{
    "url": "https://forestrycommission.blog.gov.uk/2024/12/03/following-in-my-familys-forestry-footsteps/",
    "title": "Following in my family's forestry footsteps",
    "authors": [
        "Ian Everard"
    ],
    "categories": [
        "Careers"
    ],
    "pub_date": "2024-12-03T09:00:00+00:00",
    "content": [
        {
            "text": "As a second-generation forester, my family tree is made up of passionate foresters. My parents both worked in forestry, and my son David is following in our family’s footsteps working for Forestry Scotland. As a family we have a deep connection to the outdoors. We want to make a difference to people, nature and the environment, and leave a legacy for the next generation."
        },
        {
            "heading": 2,
            "text": "Growing up in forestry"
        },
        {
            "text": "As I cast my mind back to the things that shaped and inspired me as a young lad growing up in Hampshire, Northumberland and Penarth, I’m reminded of fond family holidays spent in Cornwall, roaming the picturesque countryside and forests that form our magnificent English landscape. I recall from an early age that I only ever wanted to be outdoors. I was always eager to explore my natural surroundings and to learn from my father who was then a Forest Researcher, and my mother who worked at a research station in the Forest of Dean."
        },
        {
            "text": "When it came to deciding what I would do after I left school, I knew it had to be something that would allow me to pursue a career outdoors. At the time, I was able to gain some contracting experience that involved spraying and clearing woodlands which I really enjoyed. However, I knew I wanted to experience more than just the hands-on work. I wanted to learn what forestry was all about."
        },
        {
            "heading": 2,
            "text": "A stepping stone into forestry"
        },
        {
            "text": "The great thing about forestry is that there are lots of different pathways you can explore. I decided to explore a route that would involve learning the theory while gaining practical experience."
        },
        {
            "text": "Looking back, I had a deep connection with my local National Park in Rothbury, Northumberland. I envisaged myself as a National Park Ranger, working with the public and on national footpaths – things I knew I would enjoy and be good at. With that ambition firmly in my mind, I knew it would be best to get a job in a related industry such as forestry, to gain some valuable experience."
        },
        {
            "text": "I decided to explore different college courses and decided on a diploma in Forestry, which would involve two years’ practical outdoors experience. As part of the Ordinary National Diploma (OND) course at Newton Rigg College in Cumbria, I spent my middle year on placement at North West Water in Macclesfield. I completed a lot of practical work during the course and achieved an OND (which later changed to a Forestry BTEC National Diploma) which would later open the door to a new chapter in forestry."
        },
        {
            "heading": 2,
            "text": "A variety of rewarding roles"
        },
        {
            "text": "In the early daysDuring my college days I was able to gain some experience as a Survey Assistant for the Forestry Commission which I really enjoyed, as it involved traipsing through woodlands to collect data. It was around this time I realised forestry was for me. When I finished college, I found 12 months of land-based work at a private estate to build on my experience and when a role at the Forestry Commission opened up, I jumped at the chance to apply. I was successful, which meant I was posted to the Llandovery district in Carmarthenshire, where I worked in timber production harvesting trees and managing heavy machinery."
        },
        {
            "text": "Embarking on a new adventureI decided after five years that I fancied a change of scene. I embarked on a new adventure which would take me to the west coast of Scotland. I remember arriving by ferry and taking in the stunning outlook across the Cowal Peninsula, there was nothing but blue skies and sunshine."
        },
        {
            "text": "As you can imagine, the blue skies didn’t last long in Scotland, and so my trusted waterproofs were put to the test for the next eight years working in Cowal forest district. The wet weather didn’t dampen my enthusiasm for the fun-filled recreation role I did for four years, where I got to create new outdoor activities and events including mountain biking and 4x4 off roading, as well as organising the odd Easter bunny trail for families to enjoy."
        },
        {
            "text": "The other four years were spent looking after forests in my patch – otherwise known as managing a ‘beat’. This involved planting, restocking and managing trees along the steep slopes of the west coast of Scotland. It was an enlightening and very enjoyable experience for me. I had never done this before and it felt great to gain new skills and to work alongside other like-minded, passionate teammates."
        },
        {
            "text": "I always think that it’s the people at the Forestry Commission that make it such a special place to work, there is always someone to lend a hand and such strong camaraderie – you feel you belong to a supportive forest family."
        },
        {
            "text": "In recent yearsAfter settling down in Cowal to start a family, we relocated to Newton Stewart in Galloway where I was beat forester for Galloway West for five happy years."
        },
        {
            "text": "My wife and I then decided to move back to Northumberland where I got a promotion within Forestry England. I worked for five years as a District Forester in forest management – managing the North East forest district restocking and maintenance programme."
        },
        {
            "text": "An opportunity then arose to transfer to the North East Area team at the Forestry Commission in Rothbury, where I worked as a Woodland Officer and then as a Project Manager. Now, in my current role as a part-time Field Manager, I have a more internal focus where I help support the other Field Mangers and train staff in technical forestry skills, as well as manage the Level 4 apprentices."
        },
        {
            "text": "Looking back, I realise how much I have enjoyed the variety of roles I have performed throughout my forestry career; I’ve always been curious and embraced different opportunities to learn new skills along the way."
        },
        {
            "heading": 2,
            "text": "Advice to those considering a role in forestry"
        },
        {
            "text": "Be open to new opportunities I was open to moving around to different locations and seeking out new opportunities and experiences. I grasped a couple of opportunities, and they had a positive impact on my career – as sometimes you need to go sideways before you can go forwards. The great thing about forestry is that trees are all around us, which has meant I’ve seen colleagues experience a variety of roles within the same locality."
        },
        {
            "text": "Find the route that works for youI left school with one A Level with a view to doing a more practical, hands-on role in forestry and it didn’t hold me back. If you are more academic, then you may choose to explore qualifications through to degree level."
        },
        {
            "text": "Be proactiveTry to find ways to gain experience, these skills can be gained through a contractor where you can develop chainsaw or machine operating skills. There are also training opportunities and apprenticeships available for many practical roles."
        },
        {
            "text": "We need youThere is demand for people across the sector, from hands-on roles to scientific, managerial and administrative roles. We need a new generation of skilled and passionate people to continue the impactful work we do in forestry, that makes a real difference for nature, people and the planet."
        },
        {
            "heading": 2,
            "text": "Final reflections"
        },
        {
            "text": "My career in forestry has been incredibly rewarding and I’ve made many life-long friends along the way. I feel great knowing I am making a difference, whether it’s helping to future-proof our woodlands and forests against climate change or planting trees and creating amazing outdoor spaces for the next generation to enjoy. It’s something I am incredibly passionate and proud of."
        }
    ]
}