{
    "url": "https://ukhsa.blog.gov.uk/2024/12/03/how-we-monitor-invasive-mosquitoes-and-stop-them-spreading-in-the-uk/",
    "title": "How we monitor invasive mosquitoes and stop them spreading in the UK",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Zoonoses"
    ],
    "pub_date": "2024-12-03T16:33:29+01:00",
    "content": [
        {
            "text": "As we release data showing a significant rise in travel-related infections like dengue and malaria, we speak to Colin Johnston, Senior Medical Entomologist at UKHSA, about his team’s work on invasive mosquito surveillance. Read on to find out how we are monitoring our borders for disease-carrying insects."
        },
        {
            "heading": 4,
            "text": "Can you explain what you do?"
        },
        {
            "text": "I am part of The Medical Entomology and Zoonoses Ecology (MEZE) team which works closely with local authorities, other government agencies and research institutions to coordinate national vector surveillance programmes and conduct field-based research on the distribution and seasonality of vectors and their pathogens."
        },
        {
            "text": "The increasing number of cases of dengue and malaria that we are seeing at the moment in the UK are travel-related, so people have picked them up when visiting countries where mosquito-borne illnesses are transmitted. My team’s job is to identify and monitor the spread of vectors (typically mosquitoes and ticks) in the UK and assess the risk of vector-borne diseases to public health. If we can delay the point where invasive mosquitoes enter the country this is an important way of cutting off a source of infection. My work mostly focuses on coordinating the UKHSA’s invasive mosquito surveillance scheme."
        },
        {
            "text": "We operate a citizen science mosquito recording scheme and encourage anyone to send us photos of mosquitoes for identification. We're particularly interested in those that might be tiger mosquitoes or are causing biting issues. This can found here: Mosquitoes: how to report - GOV.UK"
        },
        {
            "text": "What is an invasive mosquito?"
        },
        {
            "text": "An invasive mosquito is one that can colonise new areas, they are often also non-native. One of the most concerning is Aedes albopictus, commonly known as the tiger mosquito. This mosquito has been of increasing concern to public health officials across Europe and is listed as one of the top 100 invasive species in the world. Native to Southeast Asia, it has rapidly spread to many parts of the world, including most of mainland Europe. Where it occurs, it has been involved in transmission of dengue, chikungunya and occasionally Zika viruses."
        },
        {
            "text": "The tiger mosquito is small, has distinctive black and white striped legs and a stripe along the top of its back, making it easily identifiable from the 36 native species of British mosquito. It is smaller than many of the common UK species."
        },
        {
            "text": "Why are we worried about the tiger mosquito in particular?"
        },
        {
            "text": "The tiger mosquito is able to colonise urban environments successfully and unlike many mosquitoes it will bite in the daytime. Their eggs are frost tolerant and can enter winter diapause. They therefore have adapted to surviving winters in Northern Europe. The mosquito can breed in natural and artificial aquatic habitats including water collecting in uncovered water butts, disused tyres, barrels, rainwater guttering, bird baths and discarded drinks cans. It is particularly common in urban and suburban habitats and is a nuisance biting species."
        },
        {
            "text": "The spread of the tiger mosquito is influenced by factors such as climate change and global trade. Changes in temperature and rain patterns can alter the distribution and abundance of mosquitoes, while increased international travel and trade can aid the movement of the species to new locations. This has contributed to the spread of vector-borne diseases to areas where they were previously not present, including the UK. Although it is thought that our current climate limits their ability to establish themselves across much of the UK, temperatures in the south-east of England are high enough for their survival. With climate change, the area of suitability will increase."
        },
        {
            "text": "They are already a nuisance in many countries including Italy, France, Spain, and Croatia. Tiger mosquitoes were responsible for an outbreak of over 60 locally acquired cases of dengue in the South of France in 2022 and 3 cases in Paris in 2023. As of November 2024, France reported 83 cases, Italy reported 213 and Spain 3."
        },
        {
            "text": "How are we protecting the public?"
        },
        {
            "text": "My role is to coordinate a national surveillance programme to detect any incursions of the tiger mosquito into the UK. The programme is a collaboration between various organisations and relies heavily on local authorities. With their amazing support we have been able to expand our surveillance to over 117 sites this year, with more than 1,300 traps deployed in 2024."
        },
        {
            "text": "Our surveillance focuses on points of entry with high levels of international travel, such as seaports, ferry terminals, distribution centres, and lorry parks: anywhere the tiger mosquito is likely to enter the country. The surveillance programme is vital in the detection - and preventing the establishment - of the tiger mosquito in the UK."
        },
        {
            "text": "Climate modelling indicates that the area around London already possesses a climate suitable for the survival of the tiger mosquito. Consequently, we have dedicated considerable effort to informing local authorities in London about this emerging threat. Our efforts include detailed explanations of the risks, as well as comprehensive guidance on how these authorities can actively participate in surveillance and control measures if these mosquitoes are detected. As a result, we now have surveillance running across London in a range of locations, including transport hubs, recycling centres, botanical gardens, and lorry parks."
        },
        {
            "text": "We also run a national scheme to monitor British species of mosquitoes. We set around 50 traps around the UK, mostly in wetlands. All of these traps would have collected invasive mosquitoes if they were present, so we're pretty confident we don't have them in other parts of the UK at moment."
        },
        {
            "text": "What happens when we detect them?"
        },
        {
            "text": "Local authority Environmental Health Officers (EHOs) use small mosquito traps to passively attract egg-laying female mosquitoes by providing water and a small polystyrene block for them to lay their eggs on. Then the MEZE team examine the blocks for the minuscule black rice-shaped eggs."
        },
        {
            "text": "When we find eggs on the blocks, we do an initial screen to check they are from an invasive species. If they are, we trigger the cross-government contingency plan, which involves setting up an incident led by the health protection team. The MEZE team then deploy to the site, set up enhanced surveillance around the area of detection to understand more about the finding and look for other life stages of the species and provide control advice to the local authority. Local authority EHOs work with landowners and businesses within a 200-metre radius of the positive trap to remove potential habitat in the area, or apply mosquito larvae control products where necessary. This process has worked effectively, and, on all occasions, this has prevented the establishment of the mosquitoes."
        },
        {
            "text": "Using this method, we have detected invasive mosquitoes in seven locations in southeast England since 2016. Three incursions were detected in 2019 and one in 2023. There is currently no evidence that it has become established in the UK. We supplement this work with a citizen science mosquito recording scheme and conduct surveys with local authorities."
        },
        {
            "text": "How do we collaborate internationally?"
        },
        {
            "text": "The tiger mosquito is found across much of Europe including France, and large areas of Paris. My colleagues visited Paris to meet French public health officials and to see what we can learn from them. MEZE is part of VectorNet which coordinates data sharing across a large network of medical and veterinary entomologists right across Europe. This keeps us informed about what's happening with each country. MEZE also collaborates closely with, and supports, the UK overseas territories to further enhance our understanding and preparedness when responding to invasive mosquitoes, as well as providing capacity building to our UK territories."
        }
    ]
}