{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2024/12/03/meet-the-gse-award-winners/",
    "title": "Meet the GSE award winners",
    "authors": [
        "gseprofession"
    ],
    "categories": [
        "Blog Series",
        "Diversity & Inclusion"
    ],
    "pub_date": "2024-12-03T12:58:19+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Interview with Stacey Rothwell, Innovation award winner"
        },
        {
            "text": "At the GSE Conference, we celebrated excellence in science and engineering by recognising outstanding contributions across government. There were several award categories, with eight key awards in total. We sat down with our award winners in this new award blog series to hear more about their achievements.  "
        },
        {
            "text": "Up next, we hear from our 2024 Innovation award winner, Stacey Rothwell from Kent Constabulary. This award honours those who incorporate innovation into their public sector work practices."
        },
        {
            "text": "GSE team: Hi Stacey, what is your role and what do you do? "
        },
        {
            "text": "Stacey: When I undertook the project, I was the project lead for Rapid Video Response within Kent Police’s Innovation Task Force. I am now the Network Director for the Eastern Region Innovation Network (ERIN) that is a centre of excellence sharing and replicating innovation across seven police forces in the east of England. ERIN finds and shares best practice and innovations across our region, then measures the impact via data. Rapid Video Response was shared using a blueprint and an assisted implementation programme, sponsored by the Home Office and supported by the Chief Scientific Advisor to policing, Professor Paul Taylor.  "
        },
        {
            "text": "GSE team: How did you get into the area of government that you're currently working in? "
        },
        {
            "text": "Stacey: I joined Kent Police as a Police Officer in 1998, and have worked as a Detective, Financial Investigator and Sergeant, and became a civilian staff programme manager in innovation as a continuous improvement consultant. I then undertook a master's degree in applied criminology and senior police management at Cambridge University, which taught me the importance of a science-led approach to testing and enabled me to lead on the randomised control trial that underpins Rapid Video Response. I supported implementation in Kent Police before rolling out the intervention across six of the forces in the eastern region and continue to support other forces with implementation of Rapid Video Response in policing.  "
        },
        {
            "text": "GSE team: What does winning this award mean to you personally and professionally? "
        },
        {
            "text": "Stacey: Being recognised as a pioneer of innovation across all of government science and engineering is an honour and a privilege. One that I will use to highlight Rapid Video Response, which is now changing people’s lives, protecting victims of domestic abuse from harm. I will use the award professionally and personally to champion not only the intervention, but the methodology used to test it, as policing needs to utilise field testing, data and research to better understand the impact of innovation, especially given the rate at which technology is advancing.   "
        },
        {
            "text": "GSE team: How important do you think it is for government science and engineering to be recognised in this way? "
        },
        {
            "text": "Stacey: Winning the Innovation of the Year Award is important because it highlights the critical role that science plays in policing. Recognition of this kind brings attention to the innovative work being done in the public sector, encourages further investment in research and development, and inspires others in the field. It underscores the value of scientifically tested contributions to public policy, creating a culture of continuous improvement and innovation.  I look forward to continuing to work with the wonderful, passionate people that are shaping our future services to the public, learning and discovering what works with an evidence-based approach.  "
        },
        {
            "text": "GSE team: Thank you, Stacey, and congratulations once again on your well-deserved award.  "
        },
        {
            "text": "Stay tuned for more of the winners’ series to find out about the extraordinary science and engineering achievements across the government. "
        }
    ]
}