{
    "url": "https://ukhsa.blog.gov.uk/2024/12/03/what-is-bird-flu-and-how-are-we-protecting-people-against-it-in-the-uk/",
    "title": "What is bird flu and how are we protecting people against it in the UK?",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Avian Flu"
    ],
    "pub_date": "2024-12-03T13:26:47+01:00",
    "content": [
        {
            "text": "Avian influenza (bird flu) is an infectious disease that affects birds, caused by the influenza A virus. Birds are the hosts for a variety of influenza virus subtypes, particularly waterfowl and shore birds. All birds are susceptible to avian influenza and the virus can rapidly cause significant mortality in flocks but some species of bird show more severe clinical signs than others."
        },
        {
            "text": "The influenza viruses found in birds are not well adapted to infect humans, and human infections with avian influenza viruses are rare. However, some subtypes, such as A(H5N1) or A(H7N9), have been associated with human disease, usually in people directly exposed to infected birds or animals."
        },
        {
            "text": "Over the past few years, a particular virus has come to dominate infections in birds in the Western hemisphere, influenza A(H5N1). Globally it has also caused animal outbreaks among mink and marine mammals. In recent months, it has spread among dairy cows in the United States and there have been human cases in those working on farms with affected cattle. Both A(H5N1) and A(H5N5) have been detected in wild and kept birds in Great Britain this season. "
        },
        {
            "heading": 2,
            "text": "Symptoms and risk level in humans"
        },
        {
            "text": "The symptoms of avian influenza in humans vary. Currently, the infections in humans occurring in the US are mild with symptoms of conjunctivitis (red, sore and discharging eyes) being common. However, the infection can be serious, for example, in Cambodia there have been a number of individuals and more recently an individual in Canada who have experienced severe illness."
        },
        {
            "text": "Almost all cases of A(H5N1) virus infection in people have been associated with close contact with infected live or dead birds and mammals or contaminated environments. Influenza A(H5N1) continues to infect new mammals (ranging from foxes, otters and seals to cattle) and spread between them, increasing the opportunities the virus has to evolve."
        },
        {
            "text": "The concern is that these changes in the virus may at some point allow it to spread readily between people. We therefore remain vigilant for any evidence of changing levels of risk and keep this under constant review, although based on the latest evidence the current risk to the UK human population from the avian influenza virus remains very low."
        },
        {
            "heading": 2,
            "text": "Measures to protect against humans from bird flu"
        },
        {
            "text": "UKHSA works with the Animal and Plant Health Agency (APHA), the Department for Environment, Food and Rural Affairs (Defra), Food Standards Agency (FSA), and the public health agencies of Scotland, Wales and Northern Ireland to monitor the risk to human health from emerging influenza viruses. "
        },
        {
            "text": "Our work contributes to initiatives such as the WHO Global Influenza Surveillance and Response System, helping the world detect and respond to emerging influenza viruses with pandemic potential."
        },
        {
            "text": "Our surveillance and diagnostic expertise coupled with our genomic sequencing abilities are crucial to the early detection, assessment and response to emerging health and biosecurity threats such as avian influenza."
        },
        {
            "text": "We typically see more detections of avian influenza in wild birds over autumn and winter and an increased risk to poultry and other captive birds, associated with the migratory pattern of waterfowl and environmental conditions becoming more favourable for virus survival."
        },
        {
            "heading": 2,
            "text": "The enhanced surveillance programme"
        },
        {
            "text": "To improve scientific understanding of the threat of avian influenza to humans, UKHSA runs a zoonotic influenza surveillance programme in humans."
        },
        {
            "text": "This programme aims to detect possible animal-to-human infections in people who are exposed to infected birds - for example poultry workers and those involved in culling birds in infected commercial and domestic premises - so that we can better understand whether transmissions from birds to humans occur and if so, how often."
        },
        {
            "text": "Individuals taking part in the programme are sampled through virological nose and throat swabs. Samples are then processed by UKHSA testing laboratories, with any positive samples being sent to the WHO designated National influenza reference laboratory in our Colindale premises for genomic analysis. Over 200 participants have been recruited, although some of these have participated more than once."
        },
        {
            "text": "If a positive test is returned, individuals will be managed in line with UKHSA guidance. As part of the public health response to any positive detections, our Health Protection Teams follow up all individuals who have been in contact with a confirmed human case of avian influenza."
        },
        {
            "heading": 2,
            "text": "NHS surveillance"
        },
        {
            "text": "Alongside this asymptomatic avian influenza surveillance programme, we are working with the NHS to ensure patients admitted to intensive care with severe acute respiratory infections, or influenza-like-illnesses are tested for respiratory viruses, including influenza."
        },
        {
            "text": "UKHSA public health labs and the influenza reference laboratory undertake additional testing of samples that are positive for influenza A but where normal seasonal influenza is not found, to confirm that the detection is not due to avian influenza."
        },
        {
            "text": "Monitoring of these samples is an important mechanism for the early detection of avian influenza and novel influenza viruses. For example, in November 2023 a novel human case of influenza A(H1N2)v was identified in this way."
        },
        {
            "text": "As people developing avian influenza infections may become severely ill, intensive care units are a good place to target disease surveillance; this work fits within wider surveillance programmes alongside the existing contact management process, where people who are exposed to birds with avian influenza are monitored by UKHSA Health Protection Teams."
        },
        {
            "heading": 2,
            "text": "Vaccination"
        },
        {
            "text": "The standard seasonal flu vaccination is not expected to protect against avian influenza, although it remains important for those eligible to take up the seasonal flu vaccine to protect them from severe illness caused by the flu that circulates every winter in people."
        },
        {
            "text": "As part of long-standing preparedness plans, the government has recently purchased over 5 million human H5 influenza vaccines in case these are ever needed in a pandemic scenario."
        },
        {
            "heading": 2,
            "text": "How you can avoid being exposed"
        },
        {
            "text": "If possible, do not touch or handle wild birds or their droppings. Keep your distance from wild birds as much as possible – aim to stay at least 2 metres away if you can. If you decide that you need to handle a wild bird, there are some steps which you can follow to reduce the risks, see the advice published here."
        },
        {
            "text": "In Great Britain, members of the public are encouraged to report findings of dead wild birds using the online reporting system or by calling the Defra helpline (03459 33 55 77). Reporting dead wild birds helps Defra and APHA understand the risk of avian influenza and other diseases to different species groups of wild birds, and supports UKHSA’s understanding of the risk to humans. Further information on APHA’s surveillance for avian influenza in wild birds can be found in our Avian influenza (bird flu): infection in wild birds and wild mammals - GOV.UK (www.gov.uk) guidance."
        }
    ]
}