{
    "url": "https://naturalengland.blog.gov.uk/2024/12/03/working-together-for-nature-recovery-in-greater-manchester/",
    "title": "Working together for Nature Recovery in Greater Manchester  ",
    "authors": [
        "Marian Spain"
    ],
    "categories": [
        "Biodiversity",
        "Biodiversity Net Gain",
        "Connecting People with Nature",
        "Development",
        "Ecosystem Services",
        "Local Nature Recovery Strategy (LNRS)",
        "Natural Capital",
        "Natural England",
        "Nature Recovery",
        "Nature-based solutions",
        "Wildlife"
    ],
    "pub_date": "2024-12-03T08:47:48+00:00",
    "content": [
        {
            "text": "The launch of Biodiversity Net Gain (BNG) has been a major achievement this year – this world-leading initiative means that for the first time, development must leave nature measurably improved. I was lucky enough to visit Greater Manchester to speak with our partners in local government, including Andy Burnham (Mayor for Greater Manchester), developers, land managers and local authorities to understand what Defra’s policy looks like now that it is in practice.  "
        },
        {
            "text": "BNG aims to deliver nature recovery alongside sustainable development. This in turn leads to healthy ecosystems, climate resilience, and access to nature. The last point was a particular focus of our visit. The BNG metric includes habitats that also have an amenity or recreational value, recognising the huge value in improving people’s connection to green spaces near where they live.  "
        },
        {
            "text": "Some of the most exciting plans for development in Greater Manchester are those which are aiming to open huge new urban green spaces. These plans include affordable city-central housing in areas which are currently experiencing high levels of nature deprivation and many other indices of social deprivation. It is fantastic to see high-quality green spaces as core to these designs, a real testament to the strong relationship between our Area Team and their work with the Metro Mayor Andy Burnham, and the Greater Manchester Combined Authority.   "
        },
        {
            "text": "Some words from one of our partners have stuck with me about how BNG offers new opportunities to land managers. He introduced the work they are doing as “the birth of a new habitat bank, not the death of a farm.” Fundamentally this means a continuation of stewardship of the same land by the same people but with a different contribution to society. The pioneering habitat bank we visited was proud to tell us about how the farmer and the community forms part of its management governance. Onsite, the area of improved habitat is managed by the same tenant farmer who has worked here for years. This continuity of local knowledge means that communities are working for nature, and nature in turn is feeding into and strengthening communities. "
        },
        {
            "text": "I was reminded again how important our messaging is in bringing partners with us. At Natural England, we understand the many complexities within the word nature, and how it relates to our varied roles, and all the different aspects of our lives. It is easy to assume others are on the same page. This isn’t always the case. We need to explain that by nature, we do of course mean wildlife and biodiversity, but we also mean how the place looks, the landscape, the aesthetics. We mean practical services, like flood management. We mean cultural and heritage aspects. We mean public access and wellbeing. The more we can blend all these elements together in our understanding of nature, how we talk about nature, and how we approach working for nature with partners, the more we maximise the value of what nature can do for all of us, and what we can do for nature.  "
        },
        {
            "text": "Our partners talked about needing nature on an industrial scale,  and also how Manchester as core to the industrial revolution is now leading the nature revolution. Individual projects, like those we visited in Greater Manchester, are fantastic, but they are one part of a much bigger picture. BNG itself is just one policy within a wider framework of tools for nature recovery that allows us and our partners to make the Local Nature Recovery Strategies (LNRS) a reality, contribute to the national goals of 30% of land protected and managed for nature (“30x 30”), and everybody being able to access nature (“Green in 15”).  "
        },
        {
            "text": "Greater Manchester launched the consultation on their LNRS on the day of our visit, and the ambition and vision within the LNRS mark such a wonderful moment of embedding nature strategically in the earliest stages of planning. LNRSs themselves are so much more than the sum of their parts when they link up regionally, and ultimately, nationally.  "
        },
        {
            "text": "Embedding nature at the heart of each of the government’s five missions may be a national task, but national outcomes build on individual policies, and individual places.  "
        },
        {
            "text": "Each of these mechanisms is a huge achievement in our push from nature conservation to nature recovery and should be celebrated. We heard from partners what was working well on BNG, and what could still be improved. It is exciting to be working for nature in these moments of hope and progress, but we all also can see how much more there is yet to be done. Let’s celebrate how far we’ve come, while also planning how best we will take the next step for nature, and the next.  "
        }
    ]
}