{
    "url": "https://space.blog.gov.uk/2024/03/06/a-partial-penumbral-lunar-eclipse-and-the-pons-brooks-comet-the-uk-night-sky-in-march-2024/",
    "title": "A partial penumbral lunar eclipse and the Pons-Brooks comet: the UK night sky in March 2024",
    "authors": [
        "Derek Smale"
    ],
    "categories": [
        "Astronomy"
    ],
    "pub_date": "2024-03-06T10:22:39+00:00",
    "content": [
        {
            "text": "Wednesday 20 March marks the spring or ‘vernal’ equinox, one of two days in the year where the Sun is directly over the equator, and neither hemisphere of our planet is leaning closer to the Sun."
        },
        {
            "text": "The word equinox comes from the Latin of ‘equal’ (equi) and ‘night’ (nox) because the day and night are equal in length, and the day marks the start of ‘astronomical spring’."
        },
        {
            "heading": 2,
            "text": "Planets"
        },
        {
            "text": "The second half of the month is a great time to spot Mercury in our evening skies. A week or so either side of 24 March is the optimal time to look for it, as the innermost planet will be above the western horizon for a couple of hours after the Sun has set."
        },
        {
            "text": "Mercury orbits around the Sun once every 88 days, and this rapid movement means the planet travels from being completely obscured behind the Sun at the start of the month to reaching its greatest separation from the Sun (from our perspective here on Earth) in just three weeks."
        },
        {
            "text": "Significantly brighter Jupiter also sits in our western evening skies, visible for three or four hours after the Sun has set. Following their conjunction last month, Mars and Venus are both still visible in the mornings as the sky starts to lighten before sunrise."
        },
        {
            "heading": 2,
            "text": "Partial penumbral lunar eclipse"
        },
        {
            "text": "In the pre-dawn skies of 25 March, there’ll be a brief opportunity to see a partial penumbral lunar eclipse from UK skies. At around 5am, the amount of the Sun’s light hitting the surface of the Moon will be reduced slightly as our planet causes a slight shadow. However, because the Moon, Earth and the Sun are not perfectly aligned, sunlight reaching the Moon is diffused only slightly, so there’ll only be a subtle change in brightness."
        },
        {
            "text": "The event takes place just minutes before the full Moon sets below the western horizon, so while the eclipse itself may not be prominent, it’ll be a great morning to enjoy watching the slightly eclipsed full Moon set and the Sun rise."
        },
        {
            "heading": 2,
            "text": "Comets"
        },
        {
            "text": "Astronomers are watching two comets for signs that they may become bright enough to be visible to the naked eye this month, as they approach the inner solar system."
        },
        {
            "text": "These large bodies of rock, ice and dust tend to orbit the Sun with far more elliptical orbits than the planets, bringing them significantly closer to and further away from our star than the more circular (though still slightly elliptical) orbits of the planets."
        },
        {
            "text": "As they get closer to the Sun’s radiation, interactions with the gas, dust and ice on the comet can cause outbursts on the surface, ejecting material into a plume or ‘tail’."
        },
        {
            "text": "Predicting the brightness of comets is still a little unreliable, but both are already visible with the aid of binoculars or a telescope, and current forecasts suggest that comet 12P/Pons-Brooks may become visible to the naked eye later in the month."
        },
        {
            "text": "Believed to be about 30km (18 miles) in diameter, comet 12P/Pons-Brooks has a fascinating history of flaring suddenly in brightness as it approaches the inner Solar System on its 70-year orbit of the Sun. This comet has earned the nickname of the ‘Devil Comet’ in recent months as one of several eruptions caused a second plume of material to stream from its surface, giving it the appearance of having horns."
        },
        {
            "text": "Comet Pons-Brooks starts the month in the western evening sky just beneath the Andromeda Galaxy. It’ll move steadily through the tip of Pisces, just under Triangulum and end the month on the line of brighter stars in Aries, appearing to move in the direction of Jupiter. In reality the comet is moving toward the inner solar system where it will reach its closest point to the Sun next month."
        },
        {
            "text": "If you have binoculars or a telescope, you may also want to try and spot the fainter comet C/2021 S3 PanSTARRS in the east in the early hours of the morning, where it will pass through the summer constellations of Aquila, Sagitta and Vulpecula."
        },
        {
            "text": "If you’re planning to try and spot these comets, you can find their precise location on any given night, and if you manage to capture a photo please share your image with us!"
        }
    ]
}