{
    "url": "https://stratcommand.blog.gov.uk/2024/03/06/bfgib-iwd-event_2024/",
    "title": "British Forces Gibraltar Hold Another Successful International Women's Day Event",
    "authors": [
        "abievans"
    ],
    "categories": [
        "Gibraltar",
        "Overseas Bases"
    ],
    "pub_date": "2024-03-06T16:13:09+00:00",
    "content": [
        {
            "text": "On Wednesday 6 March, British Forces Gibraltar (BF Gib) held another very successful International Women’s Day Event in Devil’s Tower Camp."
        },
        {
            "text": "The event which spanned over two hours, was opened by Commander British Forces Gibraltar, Commodore Tom Guy who thanked everyone for attending before welcoming the keynote speaker, The Minister for Equality, the Hon Christian Santos GMD MP, Minister for Equality, Employment, Culture and Tourism."
        },
        {
            "text": "Over one hundred BF Gib personnel gathered in the Gibraltar Officers’ Mess to explore International Women’s Day ‘Inspire Inclusion’ and the United Nation’s ‘Invest in Women’ themes through educational talks from guest speakers."
        },
        {
            "text": "Listeners were given the opportunity to hear from the CEO of GibSams, Brenda Cuby, the Managing Director from PossAbilities, Nicole Buckley, HQBF’s Senior Dental Officer, Commander Alexa Fyfe-Green and Gibraltar Defence Polices’ PC Seleen Celecia who all spoke openly about topics relating to their professional journeys and the challenges they have overcome, before inviting the audience to ask some questions."
        },
        {
            "text": "The Hon Christian Santos GMD MP, Minister for Equality, Employment, Culture and Tourism said: “International Women’s Day is an opportunity to amplify women’s voices and increase their visibility. Very often women’s work is under-valued and over-looked, so it is only right and fair that it is acknowledged and recognised."
        },
        {
            "text": "I would like to congratulate the organisers of today’s events for providing women with a platform to showcase their work, abilities, and talents and how they contribute to making our community a better place to live in."
        },
        {
            "text": "Events like these powerfully help to address the under-representation of women.”"
        }
    ]
}