{
    "url": "https://forestrycommission.blog.gov.uk/2024/03/06/careers-in-forestry-marks-story/",
    "title": "Careers in Forestry: Mark's story",
    "authors": [
        "wendyjohnson"
    ],
    "categories": [
        "Careers"
    ],
    "pub_date": "2024-03-06T09:19:31+00:00",
    "content": [
        {
            "text": "I’m a veteran of 12 years uniformed service that’s seen both operational service and active duty across the Fire Service, Royal Marines, and the Police Force. I came to a point in my uniformed career where I felt a change was needed and found myself working for the Green Task Force, an organisation that helps veterans and service leavers into work within the land-based sector."
        },
        {
            "text": "The work is predominantly woodland creation but also covers woodland management and various conservation projects with teams based in the North West of England, East Riding of Yorkshire & Humberside along with South Wales and a new team developing within the North East of England. The Green Task Force has been gathering steady momentum and is currently a delivery Partner for the Mersey Forest, Humber Forest and White Rose Community Forest Trusts."
        },
        {
            "text": "For the last two years, I’ve been the North West regional Operations Manager and Head Ranger of the Green Task Force. I found myself thrust into a sector that had drawn me to it for a long time, but I also became ingrained working for a project that was very close to my heart."
        },
        {
            "text": "As a young man that had grown up within the countryside, life felt it had truly come full circle. My time served within the forestry industry may be considered very junior to some but I’m an individual that always keeps personal development high on the agenda and therefore I thoroughly enjoy any opportunity to learn as both a student and a manager within the sector."
        },
        {
            "text": "I applied for funding through the Forestry Training Fund (now the Forestry and Arboriculture Training Fund) when it launched at the start of last year. The funding played a key role in supporting both my own personal development and my team’s. It allowed my team to expand their capabilities and improve their confidence which also aids their recovery. Veterans and service leavers naturally take to working outside, particularly within forestry and outdoor environments. Working outside has many synergies with mainstream military service, so it becomes very nostalgic, and provides a sense of belonging within the working environment."
        },
        {
            "text": "Having the opportunity to significantly upskill has been golden. I used the Training Fund by focusing on my skill gaps, and where it would not just enhance my own personal development, but would also make my team’s employability a much broader offering enabling us to secure work on a wider scale - work which we would have normally let slip past us . Both current team members and new employees have taken full advantage of the opportunity to upskill and increase their own capability. The confidence it has given my team is fantastic, it also really opened the employability for the new team members and created a whole new energy within the workforce."
        },
        {
            "text": "My career to date has seen many opportunities arise within the sector, but also supported me significantly in my own personal growth. The professional network has been incredibly supportive and continues to enhance my learning through an amazing community of devoted enthusiasts. I would strongly recommend to any veteran, service leaver, or anyone simply wishing to develop a new skill, to look at a career within Forestry, woodland management and conservation."
        }
    ]
}