{
    "url": "https://insideDIO.blog.gov.uk/2024/03/06/conservation-in-action-at-portsmouth-harbour/",
    "title": "Conservation in action at Portsmouth Harbour",
    "authors": [
        "Helen Butt"
    ],
    "categories": [
        "Environment and Ecology"
    ],
    "pub_date": "2024-03-06T15:58:37+00:00",
    "content": [
        {
            "text": "I work as DIO’s ecologist for the South East region, spanning from Hampshire all the way over to Kent and up to London and Oxford.  "
        },
        {
            "text": "One of the highlights of my role is getting out on the MOD estate and supporting hands-on conservation work. Recently, I had a chance to do just that at one of my favourite sites – Horsea Island in Portsmouth. "
        },
        {
            "heading": 2,
            "text": "Horsea Island’s annual volunteer work group "
        },
        {
            "text": "Within the context of the vast UK Defence estate, Horsea Island is a small site, at around 32 hectares in size. The landscape is partly man-made and partly natural, but perfectly adapted to support an abundance of wildlife.  "
        },
        {
            "text": "Each year, the DIO ecology team funds some vital scrub clearance work to maintain the quality of the chalk grassland on site. This is particularly important as this area falls within the Portsmouth Harbour Site of Special Scientific Interest (SSSI), a nationally important site for nature conservation. It is the responsibility of MOD and DIO to ensure that SSSI features are protected and maintained in favourable condition, and we have our internally funded SSSI programme which helps to achieve this.  "
        },
        {
            "text": "The works are carried out by a dedicated group of volunteers from Hampshire and Isle of Wight Wildlife Trust, and this year I went along to lend a helping hand, alongside colleagues from other parts of the MOD.  "
        },
        {
            "text": "The work involved lopping, sawing, cutting and burning – essentially, pushing back the encroaching scrub (particularly dogwood and wild privet) from the edges of the grassland, followed by mowing which will allow this floristically rich habitat to develop and flourish. This is done in combination with other management techniques such as sheep grazing throughout the year.  "
        },
        {
            "text": "This is a special area of grassland, unique in its origins. The land is made up of chalk deposited from diggings under the nearby Portsdown Hill, and over the years it has developed a diverse chalk grassland flora with significant invertebrate interest for its size. Some lovely calcareous plant species such as bee orchid, lady’s bedstraw and eyebright are regularly recorded.  "
        },
        {
            "text": "For me, the day was a great opportunity to spend more time at the site, enjoy the ecological interest it has to offer, and get stuck in with some practical habitat management away from my desk! "
        },
        {
            "heading": 2,
            "text": "The history of Horsea Island "
        },
        {
            "text": "Horsea was originally two islands, Great and Little Horsea, the former large enough to support a dairy farm. "
        },
        {
            "text": "Its military use dates back to the 1880s, when the two islands were requisitioned by the Admiralty and joined together to form a torpedo testing lake. This involved the excavation of thousands of tons of chalk from under Portsdown Hill, situated a kilometre to the north, with the chalk transported and used to bridge the space between the islands.  "
        },
        {
            "text": "Over the decades Horsea Island has seen various uses, from being the site of one of the Navy's three high-power shore wireless stations in 1909, to the use of Horsea Lake as a testing site for ejection seats in the 1950s.  "
        },
        {
            "text": "In the early 1970s, much of the adjacent harbour was reclaimed from the sea, connecting Horsea to the mainland. Despite this, though, the name Horsea Island has prevailed! "
        },
        {
            "text": "Today, the site continues to be used by the MOD, with a number of facilities predominantly focusing on diving and underwater engineering. "
        },
        {
            "heading": 2,
            "text": "Conservation at HMS Excellent  "
        },
        {
            "text": "Horsea Island forms part of the wider HMS Excellent site, along with Whale Island on which HMS Excellent itself is situated.  "
        },
        {
            "text": "A wide range of conservation activities are carried out across the series of man-made islands and low-lying peninsula that form HMS Excellent. Co-ordinated by the HMS Excellent Conservation Group, these include regular surveys of over a hundred different species, ranging from birds to butterflies and moths, along with plant and tree species. Other activities include managing bee hives and hedgehog releases, as well as conservation grazing in collaboration with Hampshire and Isle of Wight Wildlife Trust. The Conservation Group is chaired by HMS Excellent’s Environmental Protection Advisor, Ian Mackfall, and Ian plays an instrumental role in coordinating the time, creativity and effort needed to carry out this important conservation work across the establishment.  "
        },
        {
            "text": "In 2022, the conservation work at HMS Excellent was recognised with a prestigious Gold Award in the South and South-East Britain in Bloom competition for Urban Communities – a remarkable achievement and testament to the efforts of all who are working to protect and preserve this unique and ecologically vital part of the Defence estate. "
        }
    ]
}