{
    "url": "https://dluhcdigital.blog.gov.uk/2024/03/06/driving-adoption-of-open-referral-uk-to-deliver-millions-in-annual-savings-for-councils/",
    "title": "Driving adoption of Open Referral UK to deliver millions in annual savings for councils",
    "authors": [
        "The Local Digital team"
    ],
    "categories": [
        "Local Digital"
    ],
    "pub_date": "2024-03-06T13:44:04+00:00",
    "content": [
        {
            "text": "The Local Digital team is pleased to announce an ambitious three year plan for the Open Referral UK (ORUK) data standard that could potentially deliver millions of pounds in annual savings and help citizens access better quality information when they need it. An initial fund of £600k will be allocated to drive further adoption and to set up a Cross-Government Advisory Group."
        },
        {
            "text": "After receiving endorsement by the Cabinet Office’s Data Standards Authority and completing a Local Digital funded beta phase, we are now looking to accelerate widespread adoption of the standard across local government."
        },
        {
            "text": "Learn more about the benefits of the standard, our three year plan, and how you can join the community in this blog post."
        },
        {
            "heading": 2,
            "text": "Challenges connecting people to services"
        },
        {
            "text": "Local authorities spend significant time and resources connecting residents with relevant community services, handling over 2 million requests related to adult social care alone in 2021/22. Each council maintains their own directory of community services but managing this information is challenging, often leading to duplication of efforts even within the same local area. Different organisations also hold and share their information in different ways. This means that directories can lack consistency and residents find it difficult to access the right information. "
        },
        {
            "heading": 2,
            "text": "How Open Referral solves this"
        },
        {
            "text": "Four councils worked together to define the Open Referral data standard, which organises community service data in a common way so directories can communicate with each other. The standard means they can share data in real-time, citizens receive information quicker, and there is improved connectivity among our local communities and services."
        },
        {
            "text": "A video developed during the beta phase to explain what the data standard is and what problem it solves."
        },
        {
            "text": "By implementing the standard, councils can streamline their administrative processes, as well as the work of front-line staff who find and recommend services to citizens. This could save the taxpayer millions of pounds a year."
        },
        {
            "text": "Nick Parker from Leeds City Digital Partnerships Team describes the benefits he’s seen:"
        },
        {
            "text": "To hear more testimonials, you can visit the case studies on the Open Referral website. "
        },
        {
            "heading": 2,
            "text": "Our three year plan for Open Referral"
        },
        {
            "text": "Local Digital have been supporting Open Referral since 2018, starting with funding for a discovery project: data standards for local community services. As part of our recent programme review and updated approach, we commissioned TPXimpact to analyse the work to date and help to inform our next steps. Their report is available to read in full on our website. "
        },
        {
            "text": "The report identified consistent barriers to wider adoption of the standard and we recognise that it’s DLUHC’s role to help address these, which should unlock valuable benefits for the sector."
        },
        {
            "text": "Over the next three years, we’ll be producing materials that make adoption of the standard easier for councils and their suppliers. These will be both practical how-to guides and business cases that show the benefits of adoption."
        },
        {
            "text": "We’ll also be funding an Open Referral UK Cross-Government Advisory Group, which will provide clear, broad endorsement of the standard. We believe that showcasing ORUK and its sustainability is crucial in encouraging others to invest in its adoption."
        },
        {
            "heading": 2,
            "text": "Stewardship and standards"
        },
        {
            "text": "While Open Referral stands out as a well designed standard that can benefit both councils and citizens, our vision extends beyond the adoption of one standard. "
        },
        {
            "text": "There are many areas where data standards could have a positive impact, so we’re actively looking for what next. We’ll utilise our experience with Open Referral to test and gain insights on effective adoption strategies, designing a playbook to streamline the introduction of standards into councils."
        },
        {
            "text": "This reflects our updated approach to act as a ‘steward’ for the sector."
        },
        {
            "heading": 2,
            "text": "Join the community"
        },
        {
            "text": "There are many ways you can join the Open Referral community to keep updated, adopt the standard, or share your experiences to help others."
        }
    ]
}