{
    "url": "https://defrafarming.blog.gov.uk/2024/03/06/farming-equipment-and-technology-fund-improving-productivity-and-slurry-management-grants-available/",
    "title": "Farming Equipment and Technology Fund: improving productivity and slurry management grants available",
    "authors": [
        "Laurren March"
    ],
    "categories": [
        "Payments for equipment, technology and infrastructure"
    ],
    "pub_date": "2024-03-06T10:20:36+00:00",
    "content": [
        {
            "text": "I am pleased to say you can now apply for a productivity and slurry management grant through the Farming Equipment and Technology Fund (FETF) 2024. "
        },
        {
            "text": "Last month, I blogged about the FETF and improvements we've made. I also included a link to the official FETF 2024 guidance. We recently made an update to it, so please note that the online guidance on GOV.UK is the very latest guidance."
        },
        {
            "text": "In this post, I’ll set out the process to apply and how you can learn more.  "
        },
        {
            "heading": 2,
            "text": "Overview "
        },
        {
            "text": "The FETF provides grants for farming equipment and technology that supports improvements in productivity, slurry management and animal health and welfare."
        },
        {
            "text": " Grants for productivity and slurry management items are available now. The deadline to apply is midday 17 April 2024."
        },
        {
            "text": " Grants for animal health and welfare items will be available later this month."
        },
        {
            "text": "Farmers, foresters, growers and contractors to those sectors can apply. "
        },
        {
            "text": "You can apply for one grant from each of the 3 themes. The fund is competitive."
        },
        {
            "text": "Successful applicants will receive a grant of: "
        },
        {
            "text": "We will pay a percentage of the cost depending on the item. For many items, this percentage is an increase on last year. This funding will go towards either: "
        },
        {
            "heading": 2,
            "text": "Steps to apply"
        },
        {
            "text": "You’ll receive an acknowledgement email within 24 hours of applying – you may need to check your junk folder for emails about your application.   "
        },
        {
            "text": "The Rural Payments Agency (RPA) will allocate funding once all the applications have been received and scored. You may not receive any, or all of the funding you apply for. "
        },
        {
            "text": "If your application is successful, the RPA will send you a Grant Funding Agreement (GFA). GFAs for each grant will be sent separately. If your application is unsuccessful, the RPA will write to you to tell you why."
        },
        {
            "text": "Use the Farming Investment Fund service to accept your GFA by the deadline which will be in the email. You’ll need to select each grant to accept each GFA.  "
        },
        {
            "text": "We've set out the steps you’ll need to follow to claim your FETF 2024 grant payment on GOV.UK.  "
        },
        {
            "heading": 2,
            "text": "Future application windows "
        },
        {
            "text": "We expect to open 2 more productivity and slurry application windows later this year. "
        },
        {
            "text": "The first application window for animal health and welfare items will open later this month, we will post again when it is time to apply. "
        },
        {
            "text": "The item specifications and their costs are the same in each application window. The total overall budget for each grant is split evenly across the application windows. "
        },
        {
            "text": "If your application falls below the scoring threshold and is unsuccessful, the RPA will reject it. You will be able to apply again in a different window. "
        },
        {
            "text": "If you've accepted a grant funding agreement (GFA) to buy items from a grant, you cannot apply again for the same grant in 2024. "
        },
        {
            "heading": 2,
            "text": "Learn more at our webinar "
        },
        {
            "text": "Our team will host a webinar covering the grants available on 12 March 2024. "
        },
        {
            "text": "You will be able to put your questions to policy leads during the session. Register to attend the webinar. "
        },
        {
            "text": "Applications for the animal health and welfare grants will open soon. Subscribe to the blog to receive a reminder on the day. "
        }
    ]
}