{
    "url": "https://cyberandspecialistoperationscommand.blog.gov.uk/2024/03/06/gdp-marine-exams/",
    "title": "GDP officers pass Maritime exams",
    "authors": [
        "abievans"
    ],
    "categories": [
        "Gibraltar",
        "Overseas Bases"
    ],
    "pub_date": "2024-03-06T15:29:20+00:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "Twelve Gibraltar Defence Police Marine Section Coxswains are celebrating after achieving a number of maritime qualifications this week."
        },
        {
            "text": "During a ceremony held at the GDP Marine Section on Monday (4 March), Commander of British Forces Commodore Tom Guy handed out certificates to the officers."
        },
        {
            "text": "The coxswains’ qualifications included Royal Yacht Association (RYA) Certificate of Competence for Advanced Powerboat and Coastal Yacht Master Theory as well as National Police Chief’s Council (NPCC) Tactical Coxswain courses with two officers also achieving Advanced Powerboat Instructor & NPCC Tactical Coxswain Instructor qualifications."
        },
        {
            "text": "A Gibraltar Defence Police spokesperson said: “The officers have been training for the last 12 months and are now qualified in tactical decision making, small craft and swimmer intervention, positional craft dominance, enforced stops, boarding, delivery with rigid ladders as well as help response and pursuit and beach delivery.”"
        },
        {
            "text": "Throughout their training, officers were regularly assessed locally to ensure they met the demands of both shore side and practical examinations by Royal Yachting Association examiners."
        },
        {
            "text": "The spokesperson added: “GDP Coxswains are now adhering to the highest UK standards for seagoing personnel both as seafarers and as Police Officers, achieving a 100 per cent pass rate during this process. Instructors are now RYA members who are also commercially endorsed.”"
        },
        {
            "text": "GDP Chief of Police, Rob Allen said: “This is a significant personal and professional achievement for the officers, which has taken a great deal of effort to achieve."
        },
        {
            "text": "“The force is mandated to meet all applicable UK standards and the qualifications that these officers now hold places them at a level only attained by a few hundred officers in the entire UK Police Service. The role they carry out in Gibraltar is a vital one and I am immensely proud of what they have achieved for themselves and for the Gibraltar Defence Police.”"
        }
    ]
}