{
    "url": "https://naturalengland.blog.gov.uk/2024/03/06/natural-england-wildlife-licensing-statistics-for-2023/",
    "title": "Natural England wildlife licensing statistics for 2023",
    "authors": [
        "Stephanie Bird-Halton"
    ],
    "categories": [
        "Licensing",
        "Monitoring",
        "Protected sites and species",
        "Species re-introductions",
        "Wildlife"
    ],
    "pub_date": "2024-03-06T16:49:04+00:00",
    "content": [
        {
            "text": "Many wild animals and plants are protected by legislation such as the Wildlife and Countryside Act 1981 and the Conservation of Habitats and Species Regulations 2017. As nature conservation adviser and regulator, one of Natural England’s roles is to licence certain activities that may disturb or harm wildlife, in line with the legal framework established by Parliament."
        },
        {
            "text": "Each year, as part of our commitment to transparency, we publish a summary of the wildlife licences we have issued and the data for 2023 are now available here."
        },
        {
            "text": "In our 2023 summary, the licences again fall into four main categories:"
        },
        {
            "text": "The Natural England Wildlife Licensing Service, with the support of specialists, issues more than 12,000 licences each year. 9000 of the protected species licences are for science and conservation purposes, more than for any other activity. This enables direct conservation action, scientific research and monitoring to improve our understanding of many rare and declining species so we can better protect and conserve them in future. An example of this is the Darwin Tree of Life Project which has required licences permitting the possession of whole or part specimens of certain plants and animals such as the pearl-bordered fritillary butterfly and barberry carpet moth."
        },
        {
            "text": "Natural England has issued three licences in 2023 for the release of beavers into large-fenced enclosures. Some of these releases have been part of natural flood management projects studying how beavers transform a landscape and help slow the flow of water. The initial release is usually of a male and female pair of beavers, in the hope that they will reproduce to form small family groups. This has resulted in a number of beavers being born in England and in 2023 some projects were reporting the birth of a second litter of kits. We have also issued 193 beaver management class licence registrations to enable suitably trained people to manage any conflicts with the increasing activities and numbers of free-living beavers in the south-east and south-west of England."
        },
        {
            "text": "The legislation sets out the limited purposes for which we may grant a licence to take, kill or disturb wildlife or impact upon their habitat. These include preserving public health and public safety or air safety, preventing spread of disease, preventing serious damage to crops, livestock and property."
        },
        {
            "text": "Licences are only issued if all relevant criteria are met following a review of the purpose of the application, alternatives and methods, and the scientific context relating to it. Wildlife management and licensing is often a balancing act in finding a solution that enables the customer to satisfactorily achieve their aim in a way that has the least impact on the protected species. This could include changing the timing, location or methods of the proposed activity or requesting additional compensation."
        },
        {
            "text": "Among the licences issued last year were those for the removal of bird nests that had been built in places that were causing a risk to public health or public safety. The following are some examples:"
        },
        {
            "text": "In some circumstances when there is a high risk to public health or public safety licences may be issued for the year authorising lethal control of multiple bird species or the taking of higher numbers of birds or eggs than for other types of licences. This is to ensure that in urgent situations, such as when there is a risk to aircraft, action can be taken immediately, without having to wait for a licence modification with a specific number. In most of these cases, the actual numbers of birds or eggs taken will be much lower than permitted by the licence."
        },
        {
            "text": "Licences are only ever issued when there is deemed to be no effect on the conservation status of the birds involved. Where a renewal of a licence is requested, the numbers and species are reviewed and will be reduced the following year where appropriate."
        },
        {
            "text": "We continue to seek improvements in wildlife licensing by finding approaches that save time while maintaining and improving the conservation status of the species. This has included 236 new or renewed licences for District Level Licensing (DLL) for Great Crested Newts (GCN) which involves applicants making a conservation payment based on the predicted impact of their development or activity. This payment covers the creation or restoration of ponds in areas which are known to represent the best places for newts to thrive."
        },
        {
            "text": "The DLL scheme now operates in 133 Local Planning Authorities and has generated over £33 million for GCN conservation. This has funded the creation of 3,000 ponds and 2023 saw the highest occupancy rate of GCN in DLL ponds since the launch of the scheme."
        },
        {
            "text": "The full wildlife licensing statistics are on GOV.UK. For further information on any of the data please contact us via: enquiries@naturalengland.org.uk."
        }
    ]
}