{
    "url": "https://food.blog.gov.uk/2024/03/06/what-to-expect-from-an-inspection-a-food-safety-officer-tells-us/",
    "title": "What to expect from an inspection - a Food Safety Officer tells us",
    "authors": [
        "Here to Help"
    ],
    "categories": [
        "Case studies"
    ],
    "pub_date": "2024-03-06T11:55:06+00:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "We spoke to Lucy, a Food Safety Officer from Bath and North East Somerset Council to find out what food businesses can expect from a local authority inspection. "
        },
        {
            "text": "This blog is part of our Here to Help series, making it easier for businesses to do the right thing through business stories, resources and our improved hub of business guidance on our website."
        },
        {
            "heading": 3,
            "text": "Could you describe your role to us?"
        },
        {
            "text": "I call myself a senior Environmental Health Officer, but my official title is Specialist Officer - Food Safety. I’ve been working in different areas of environmental health for over 20 years, but I prefer food safety because it’s a good balance of education and enforcement. Every day is completely different, I enjoy meeting a variety of people and learning about different businesses and foods."
        },
        {
            "text": "We’re there to support businesses. The main role is to ensure compliance with food safety law, but we are also there to help them make improvements and answer any questions a business owner might have. There’s always something that even the best businesses could improve, because nobody’s perfect. Most businesses are quite pleased to get advice and have some suggestions."
        },
        {
            "heading": 3,
            "text": "What would you say to a business owner who is feeling apprehensive about their first inspection?"
        },
        {
            "text": "I'd say not to worry. We are not there to find fault; we do not set out to close businesses down or prosecute them. We are all human and it’s natural to be nervous if someone is looking around your business and asking questions. However, we are there to help them achieve a baseline level of compliance and ensure their customers are safe. You can have areas to work on and still achieve a good rating. The action we take is proportionate to the risk."
        },
        {
            "text": "Inspections are typically unannounced, so businesses should find out what they need to do before an inspection. This way they can have everything they need ready and available for their first visit. I would say check out what’s available online - on the FSA website, and on your Council’s website to help businesses so that they know what the requirements are before their first inspection."
        },
        {
            "heading": 3,
            "text": "What happens during an inspection?"
        },
        {
            "text": "I collect evidence to make a judgement as to how well the business is controlling any food safety risks and determine if the food offered is safe for consumers to eat. I offer advice and support to develop the business."
        },
        {
            "text": "I have a chat to the food business operator to try and obtain an overview of the business – what they do and how they do it. Then I would start inspecting where the food is delivered, go through all the food storage, preparation, then production, completely through to serving a customer. I’m checking things like fridge and freezer temperatures, cleaning, food hygiene training, written food safety procedures, allergen controls, pest, and waste control arrangements. I look at some paperwork as we go around, but normally at the end of the inspection, I would sit down and audit the paperwork to make sure what they're writing down reflects what I've seen. Every visit is different, but that's a general idea."
        },
        {
            "text": "For more information on how to keep your business on track whilst keeping consumers safe head to our business guidance hub. Alternatively, head to our easy-to-navigate guide for those starting up a new food business. "
        },
        {
            "heading": 1,
            "text": "Beth i’w ddisgwyl yn ystod arolygiad. Gair gan Swyddog Diogelwch Bwyd."
        },
        {
            "text": "Buom yn siarad â Lucy, Swyddog Diogelwch Bwyd o Gyngor Caerfaddon a Gogledd-ddwyrain Gwlad yr Haf, i ddarganfod beth gall busnesau bwyd ei ddisgwyl yn ystod arolygiad gan yr awdurdod lleol. "
        },
        {
            "text": "Mae’r blog hwn yn rhan o’n cyfres Yma i Helpu, sy’n ei gwneud hi’n haws i fusnesau wneud y peth iawn trwy rannu straeon ac adnoddau busnes yn ogystal â chanllawiau busnes yn ein hyb ar ein gwefan."
        },
        {
            "heading": 3,
            "text": "Wnewch chi ddisgrifio eich rôl i ni?"
        },
        {
            "text": "Rwy’n galw fy hun yn Uwch-Swyddog Iechyd yr Amgylchedd, ond y teitl swyddogol yw Swyddog Arbenigol – Diogelwch Bwyd. Rwy wedi bod yn gweithio mewn gwahanol feysydd iechyd yr amgylchedd ers 20 mlynedd a mwy, ond mae’n well gen i ddiogelwch bwyd oherwydd ei fod yn gydbwysedd da o ran addysg a gorfodi. Mae pob diwrnod yn hollol wahanol, rwy’n mwynhau cwrdd ag amrywiaeth o bobl a dysgu am wahanol fusnesau a bwydydd."
        },
        {
            "text": "Rydyn ni yno i gefnogi busnesau. Y brif rôl yw sicrhau cydymffurfiaeth â chyfraith diogelwch bwyd, ond rydyn ni hefyd yno i helpu perchnogion busnes i wneud gwelliannau ac ateb unrhyw gwestiynau a allai fod ganddyn nhw. Mae wastad lle i wella, hyd yn oed yn y busnes gorau: heb ei fai heb ei eni. Mae’r rhan fwyaf o fusnesau’n falch o gael cyngor ac awgrymiadau."
        },
        {
            "heading": 3,
            "text": "Beth fyddech chi’n ei ddweud wrth berchennog busnes sy’n teimlo’n bryderus am ei arolygiad cyntaf?"
        },
        {
            "text": "Byddwn i’n dweud wrtho am beidio â phoeni. Dydyn ni ddim yno i weld bai; nid ein bwriad yw cau busnesau na’u herlyn. Rydyn ni i gyd yn ddynol ac mae’n naturiol bod yn nerfus os yw rhywun yn edrych o gwmpas eich busnes ac yn gofyn cwestiynau. Ond, rydyn ni yno i helpu busnesau i gydymffurfio ar lefel sylfaenol a sicrhau bod eu cwsmeriaid yn ddiogel. Gallwch fod â meysydd i’w gwella a dal i gael sgôr dda o hyd. Mae’r camau rydyn ni’n eu cymryd yn gymesur â’r risg."
        },
        {
            "text": "Mae arolygiadau fel arfer yn ddirybudd, felly dylai busnesau ddarganfod beth sydd angen iddyn nhw ei wneud cyn arolygiad. Fel hyn, gallan nhw sicrhau bod popeth sydd ei angen arnyn nhw’n barod ac ar gael ar gyfer eu hymweliad cyntaf. Byddwn i’n argymell gwirio beth sydd ar gael ar-lein – ar wefan yr ASB, ac ar wefan y Cyngor. Gall yr adnoddau sydd ar gael ar-lein helpu busnesau i wybod beth yw’r gofynion cyn eu harolygiad cyntaf."
        },
        {
            "heading": 3,
            "text": "Beth sy’n digwydd yn ystod arolygiad? "
        },
        {
            "text": "Rwy’n casglu tystiolaeth i wneud dyfarniad o ran pa mor dda mae’r busnes yn rheoli unrhyw risgiau diogelwch bwyd, ac yn penderfynu a yw’r bwyd sydd ar gynnig yn ddiogel i ddefnyddwyr ei fwyta. Rwy’n cynnig cyngor a chymorth i ddatblygu’r busnes."
        },
        {
            "text": "Rwy’n cael sgwrs â gweithredwr y busnes bwyd i geisio cael trosolwg o’r busnes – beth mae’n ei wneud a sut mae’n ei wneud. Yna, rwy’n dechrau arolygu lle mae’r bwyd yn cael ei ddosbarthu, yn mynd trwy’r holl fannau storio, paratoi a chynhyrchu bwyd. Yn y bôn, rwy’n bwrw cipolwg dros bopeth hyd at weini’r cwsmer. Rwy’n gwirio pethau fel tymheredd oergelloedd a rhewgelloedd, arferion glanhau, hyfforddiant hylendid bwyd, gweithdrefnau ysgrifenedig ar gyfer diogelwch bwyd, a threfniadau ar gyfer rheoli alergenau, plâu a gwastraff. Rwy’n edrych ar rywfaint o waith papur wrth fynd o gwmpas ond, fel arfer, ar ddiwedd yr arolygiad rwy’n eistedd ac yn archwilio’r gwaith papur i wneud yn siŵr bod yr hyn sydd ar bapur yn adlewyrchu’r hyn rwy wedi’i weld. Mae pob ymweliad yn wahanol, ond dyna ryw syniad i chi."
        },
        {
            "text": "I gael mwy o wybodaeth am sut i gadw’ch busnes ar y trywydd iawn a diogelu defnyddwyr ar yr un pryd, ewch i’n hyb canllawiau busnes. Fel arall, ewch i’n canllaw hwylus i’r rhai sy’n dechrau busnes bwyd newydd.  "
        }
    ]
}