{
    "url": "https://insidehmcts.blog.gov.uk/2022/06/09/a-collaborative-approach-to-mental-health-services/",
    "title": "A collaborative approach to mental health services",
    "authors": [
        "Bev Bowery"
    ],
    "categories": [
        "Crime"
    ],
    "pub_date": "2022-06-09T15:30:10+01:00",
    "content": [
        {
            "text": "The justice system and national health service offer essential support to some of the most vulnerable members of our society."
        },
        {
            "text": "We know that many people facing the criminal justice system also experience health problems."
        },
        {
            "text": "NHS England (NHSE) is working with partners across government, including HMCTS, to make sure the most vulnerable people in our communities receive the mental health support they need. The aim is to help reduce inequalities and address the health-related factors in offending."
        },
        {
            "text": "I’ve recently returned to HMCTS after a secondment to NHSE. I worked with health, social care and justice services to provide physical and mental health services in prisons and criminal courts. Together, our aim was to make sure offenders received the mental health and social support they needed."
        },
        {
            "text": "Strengthening those partnerships was critical to raising awareness of mental health vulnerabilities. It’s vital to improve communication channels about offenders with mental health issues waiting for a trial or sentencing hearing or in prison."
        },
        {
            "text": "It helps prison officers and healthcare staff to support them in the best way possible. It also benefits magistrates, judges, solicitors, barristers and probation staff dealing with criminal cases as they progress towards the final hearing."
        },
        {
            "heading": 2,
            "text": "Mental Health Treatment Requirements"
        },
        {
            "text": "Mental Health Treatment Requirements (MHTRs) are one of three Community Sentence Treatment Requirements alongside drug rehabilitation and alcohol treatment."
        },
        {
            "text": "Using them more in sentencing aims to reduce reoffending by addressing underlying health and substance issues, which may be contributing towards the offending behaviours. They also provide a meaningful alternative to a custodial sentence."
        },
        {
            "text": "In May 2022, the judiciary were able to sentence an offender to a MHTR in 22 areas covering 34% of the population in England. This will continue to grow to 50% by the summer. More funding has been confirmed which will enable full coverage by 2024."
        },
        {
            "text": "New MHTR services developed across England through the NHSE programme include a focus on offenders whose mental health conditions do not require specialised mental health services but who present with multiple complex issues. These include depression, anxiety, personality disorder, histories of trauma/abuse, as well as those with dual diagnosis (such as mental health and substance misuse issues)."
        },
        {
            "text": "My role on secondment included supporting local services to make sure they could assist offenders with mental health conditions to engage with treatment in the community, while also carrying out the sentence for their offence."
        },
        {
            "heading": 2,
            "text": "Benefits of MHTRs"
        },
        {
            "text": "MHTRs aim to:"
        },
        {
            "text": "This not only brings benefits to the wider communities but also a potential reduction of the financial cost of crime."
        },
        {
            "text": "MHTRs provide psychological interventions, treatment and support that the offender might otherwise have struggled to access."
        },
        {
            "text": "Evaluation studies have shown that, with the right treatment and support, an offender is more likely to meet the conditions of their sentence and prevent a breach. Ultimately, they increase the chances of the person reintegrating into society and reducing their reoffending."
        },
        {
            "text": "MHTRs can be used alongside other requirements, such as an alcohol treatment or drug rehabilitation requirement. They can be issued for a maximum of 3 years. The offender must give their consent to engage with treatment and the provider or clinician overseeing the treatment must agree for the treatment to be issued."
        },
        {
            "heading": 2,
            "text": "My ongoing liaison role "
        },
        {
            "text": "As funding for these support services is introduced in more courts across England, I continue to advise in both health and justice settings."
        },
        {
            "text": "I use my experience and contacts to keep my HMCTS colleagues aware of changes across the health landscape. I support NHS colleagues not only in the north-east, where I’m based, but in other regions too."
        },
        {
            "text": "No 2 days are ever the same for me. I can deal with queries from nurses, clinical liaison leads or psychiatrists in the morning, and then legal advisers, probation officers, solicitors, barristers and judges in the afternoon."
        },
        {
            "text": "Effective communication is key!"
        }
    ]
}