{
    "url": "https://kingsawards.blog.gov.uk/2022/06/09/a-farewell-to-sue-winfield-her-majestys-lord-lieutenant-for-tyne-and-wear/",
    "title": "A farewell to Sue Winfield – Her Majesty’s Lord Lieutenant for Tyne and Wear",
    "authors": [
        "The Queen's Awards for Enterprise"
    ],
    "categories": [
        "Lord-Lieutenants",
        "North East"
    ],
    "pub_date": "2022-06-09T09:41:37+01:00",
    "content": [
        {
            "text": "The Queen’s Awards are the most prestigious awards for business, celebrating the outstanding achievements of organisations across the UK."
        },
        {
            "text": "One of the many benefits of being awarded is that each winning company is formally presented with a Grant of Appointment scroll by Her Majesty’s Lord Lieutenant, The Queen’s personal representative. Sue Winfield has been Her Majesty’s Lord Lieutenant for Tyne and Wear for the past 8 years, but as of this month Sue is required to step down as she reaches her 75th birthday."
        },
        {
            "text": "Over the past 8 years the Queen’s Award Team has had the privilege of working closely with Sue and we wanted to celebrate her retirement from this role."
        },
        {
            "text": "A Lord Lieutenant acts as Her Majesty's representative in each county, and they work to uphold the dignity of the Crown. Some of the many duties involved are arranging Royal visits and escorting members of the Royal Family, presenting honours, medals, and awards, and swearing in new magistrates."
        },
        {
            "text": "In Sue’s own words;"
        },
        {
            "text": "Her Majesty’s Lord Lieutenants work with the Queen’s Awards Office to promote them and encourage businesses in their area to apply. As part of this, many Lord Lieutenants host events in their counties where potential applicants can learn more information on how to apply and hear inspirational case studies from previous winners."
        },
        {
            "text": "Tyne and Wear has been connected to the Queen’s Awards since its very inception in 1965. One of the very first winners of a Queen’s Award for Enterprise in 1966 was Cole Cranes which were a Crane Building company based on the River Wear in Sunderland. The founder of Cole Cranes Sir James Steel later became the first Lord Lieutenant of Tyne and Wear in 1974."
        },
        {
            "text": "Over the 8 years, Sue has experienced many highlights, such as the 2021 Royal Reception for Queen’s Awards winners which was hosted by HRH The Prince of Wales, at Windsor Castle and attended by another 7 members of the Royal Family."
        },
        {
            "text": "Another stand out moment for Sue was presenting the Queen’s Award for Enterprise to the Skill Mill alongside HRH The Princess Royal. The Skill Mill achieved 2 Awards in 2021 for Sustainable Development and Promoting Opportunity (through Social Mobility). They are a social enterprise which provides employment opportunities for young ex-offenders through the provision of environmental construction services. It was a personal highlight for Sue as she has previously worked as a Probation Officer, so she has first-hand experience of the importance of Skill Mill’s interventions."
        },
        {
            "text": "We’d like to wish Sue every success in the future and thank her for championing The Queen’s Awards for Enterprise."
        },
        {
            "text": "Applications for the 2023 Queen’s Awards for Enterprise are now open!"
        },
        {
            "text": "Whether your business excels in international trade, has a great innovative product or service, or is running an impressive social mobility or sustainable development programme, these Awards are a unique way to recognise your achievements."
        },
        {
            "text": "Visit the Queen’s Awards for Enterprise website to apply."
        }
    ]
}