{
    "url": "https://openpolicy.blog.gov.uk/2022/06/09/an-independent-review-of-childrens-social-care-appreciating-the-wider-family-context/",
    "title": "An independent review of children's social care: Appreciating the wider family context",
    "authors": [
        "Dr Pina Sadar",
        "Dr Pauline Carnet",
        "Dr Solène Heinzl"
    ],
    "categories": [
        "Examples and findings",
        "News",
        "Projects",
        "Skills, tools and techniques"
    ],
    "pub_date": "2022-06-09T13:19:48+00:00",
    "content": [
        {
            "text": "The recent independent review of children’s social care in England has placed the focus firmly on those with experience of the children’s social care system. From the start of their work, the review team recognised that it is almost impossible to explore the experiences of children without also considering  the role of their families. Not only do families inevitably shape children’s lives, the interactions of parents and guardians with children’s services play a significant role in determining how families navigate the care system. In order to understand the bigger picture, the review team partnered with Policy Lab."
        },
        {
            "text": "The review recently published its final report, which incorporates findings from the work with Policy Lab, described in more detail below. An anonymised summary report of the findings and case studies from four of our 12 participants have also been published on the review's website."
        },
        {
            "heading": 2,
            "text": "Capturing families’ perspectives"
        },
        {
            "text": "For nearly a decade, Policy Lab has pioneered innovative approaches to policy making by placing the emphasis on those affected most directly by policy decisions. We have been developing, adapting and testing various human-centred methods and tools, including ethnography. "
        },
        {
            "text": "For the independent review of children’s social care, we were asked to scratch beneath the surface, by looking at wider family contexts, to understand the impact of the system on the families who navigate it. In particular, we focused on exploring the lived experience of parents or legal guardians of children with a 'child in need plan' or a 'child protection plan'. Taking an ethnographic approach, we aimed to understand how these parents and guardians experience the existing children’s social care system."
        },
        {
            "text": "For the review, we opted to use film ethnography, capturing the experiences of parents and guardians through short films - comprising recorded interviews, footage captured directly by participants and professionally shot clips of contextual situations. The medium of film conveys complex narratives in an accessible format, and can reduce the distance between decision makers and people affected by policies."
        },
        {
            "heading": 2,
            "text": "An ethical and flexible research framework"
        },
        {
            "text": "Our participants shared personal stories, which were at times painful to recount, including experiences of abuse, loss and mental health difficulties. It was essential that we put participants first and ensured that our recruitment practices, research methods and final outputs were conducted in a way that prioritised their privacy and wellbeing. Creating an ethics and data protection framework and revising it at different stages of the research was vital. At the same time, we continued working closely with participants and various experts, such as their key workers, to ensure they were comfortable and adequately supported at all times. "
        },
        {
            "text": "Working with twelve participants - which is a large cohort for this intensive research method - meant that we had to stay flexible and adapt our approach and engagement from participant to participant, especially as the research was also undertaken during COVID-19 restrictions. We used remote interviews to build rapport and delve into participants’ experiences of the system. We then dived deeper into their lives by asking participants to journal their experiences as video diaries. This created space for them to narrate their stories in their own terms, and to show their lives through their lens. As the COVID-19 guidelines were relaxed, we were able to combine remote engagement with face-to-face interactions with participants. We had the opportunity to visit our two research locations in London and Cumbria. "
        },
        {
            "heading": 2,
            "text": "Unpacking emerging themes"
        },
        {
            "text": "We continued to rigorously revisit our research questions and material throughout the process in order to identify, understand and further explore emerging patterns, topics and knowledge gaps. We then clustered our findings into themes and dedicated one short film to each theme. "
        },
        {
            "text": "For example, one of the films focused on families’ reasons for entering the care system and their experiences of trying to leave it. Another one honed in on parents’ and guardians’ engagement with social workers and the impact of those interactions on their overall understanding of the system and processes. Other topics included; exploration of families’ experiences of navigating the complex system; gaps between families’ practical needs and the action plans set out by social services; and impacts of children’s social services’ involvement on families, both in positive and negative terms. "
        },
        {
            "text": "We have created different outputs in the hope they can reach diverse and wide audiences. We produced six thematic films as well as an overarching summary film. Whilst the films are not publicly accessible due to their sensitive nature and to protect participants’ anonymity, they informed the findings of the review. They will continue to be a resource for policymakers in central government, helping decision makers to understand the lived experience of parents in the children's social care system."
        },
        {
            "text": "We have also created two final reports capturing the key findings of the research - one summary report which is anonymised, and another more detailed report which includes information about participants' circumstances and therefore cannot be published. We also developed five anonymised case studies. Both the review team and Policy Lab place emphasis on publishing wherever possible, and the summary report and four of the case studies (with the permission of participants)  have been published on the review's website."
        },
        {
            "heading": 2,
            "text": "Making a meaningful difference "
        },
        {
            "text": "People’s firsthand accounts of the care system were informative, genuine, and moving. They revealed nuanced narratives that included instances of domestic abuse, poverty, mental health problems, substance misuse, generational trauma and a system described as often ignoring or even exacerbating families’ challenges. At the same time, they highlighted examples of the care system’s ability to make a positive difference in the lives of families in times of need. "
        },
        {
            "text": "Upon seeing the films one policymaker commented:"
        },
        {
            "text": "Another policy maker claimed that the films provided a case for ethnographic methods being used in every single policy project that involves members of the public. The review team stated that without this research project, they would have struggled to hear such rich testimonies from families currently on 'child in need' or 'child protection' plans, contributing to their recommendation for the government to invest £2 billion across 5 years in providing more help for families."
        },
        {
            "text": "And it’s not just about conveying these stories to policymakers. Some of our research participants provided positive feedback on the report too. They also appreciated having time and space to reflect on their experiences, and the opportunity to amplify their seldom heard voices by taking part in the research. Their stories are now part of a process to transform the care system in a way that can make a meaningful difference for them, and for families for generations to come."
        },
        {
            "text": "If your team is keen to understand the live experiences of the people your policy affects, or if you're already using ethnographic approach in your policy work, we'd love to hear from you: team@policylab.gov.uk. "
        }
    ]
}