{
    "url": "https://prisonjobs.blog.gov.uk/2022/06/09/being-openly-lgbtqi-in-the-prison-service/",
    "title": "Being openly LGBTQI+ in the prison service",
    "authors": [
        "Ministry of Justice"
    ],
    "categories": [
        "Personal stories"
    ],
    "pub_date": "2022-06-09T16:30:16+01:00",
    "content": [
        {
            "text": "As part of Pride month, prison officer Jaxon Feeley shares how he navigated his transgender journey with the support of colleagues and prisoners at HMP Hindley."
        },
        {
            "text": " Serving four years as Jessica Feeley and then walking back through those gates as Jaxon was not only a daunting prospect, but something I never in a million years thought I would have the strength or the courage to do."
        },
        {
            "text": "Throughout both my military and prison service career so far, I have never experienced something so terrifying. And to this day, I am unbelievably proud and grateful I took the chance. When I came out as transgender the response was overwhelming and 12 months on, the kindness and compassion I’ve received leaves me speechless."
        },
        {
            "text": " “I am still the same officer and friend I have always been”"
        },
        {
            "text": "I try to reassure everyone that it's okay to make mistakes, all that matters is that they try and they know that I am still the same officer and friend I have always been. I was desperate for people to still see me as Feeley, to say something rather than nothing, to still have a laugh, make jokes and most importantly, still see me as human."
        },
        {
            "text": "Before making the decision to publicly come out as transgender, some of my best friends within the prison service were the people I was most terrified of telling. I worried about losing the bond I had spent years building in the stressful job we do."
        },
        {
            "text": "It turns out they have become my biggest champions, and our friendships have only become stronger and more genuine than ever before. They have taken this experience home to their families and are so open and grateful to have had such a drastic change in mindset, which makes everything I am doing 100% worth it."
        },
        {
            "text": "“I wanted to be as open as possible about my experience”"
        },
        {
            "text": "It's impossible to know what comments you are going to receive from prisoners. Returning to work identifying as a transgender man, I was expecting the worst. Working on a small unit for individuals with personality disorder, I wanted to be as open as possible about my experience. I believed there was an opportunity for me to change the mindset of prisoners who would never have understood the journey a transgender person embarks on; the trauma it brings or the reasons behind it."
        },
        {
            "text": "One of the men who has been in the prison system for over 14 years said to me: “Feeley, I have so much respect for you. I’m right behind you and I know that I am going to be so much better around my nieces and nephews when I get out because of you.” That one comment reinforces how putting myself out there can have an incredible impact that I may never see."
        },
        {
            "text": "Being visible, especially in the most hostile environments can be more powerful than you will ever realise. It is, and will be, terrifying every single day, but along with that comes an overwhelming sense of pride and strength. I know seeing me go on this journey is helping change people’s mindsets."
        }
    ]
}