{
    "url": "https://socialcare.blog.gov.uk/2022/06/09/carers-week-mental-health-support-for-both-carers-and-the-cared-for/",
    "title": "Carers Week: mental health support for both carers and the cared for",
    "authors": [
        "Tracey S (carer)",
        "Mark Osterloh"
    ],
    "categories": [
        "Care and support",
        "Carers",
        "Events",
        "Mental health"
    ],
    "pub_date": "2022-06-09T16:08:43+00:00",
    "content": [
        {
            "heading": 2,
            "text": "“I finally recognised that, like him, I had to talk to someone too”"
        },
        {
            "text": "When my fiancé woke me up in in the middle of the night in September 2020, I thought everything was normal. How wrong I was."
        },
        {
            "text": "Nothing seemed different about him in the run up to this Sunday night. When I look back with hindsight, he might not have been quite himself, but as he chatted to me, it was only when he began to cry and say ‘I can’t lose you’ that I started to wonder if he could be depressed."
        },
        {
            "text": "At this point I assumed that he had been shaken from seeing his dad’s grave and that this was why he was acting strangely. I had my own experience with depression, so it did cross my mind that he might be going through something similar."
        },
        {
            "text": "About a year ago he had a similar experience, he rang the doctor as he hadn’t felt quite right, and the doctor told him to go online and look at mental health websites for advice. It was likely that he was experiencing depression then, but the dismissive attitude from the doctor made him want to hide his real feelings, and so to me he always seemed pretty jolly and happy."
        },
        {
            "text": "His dad passed away 7 years ago, and it was around the anniversary of his death, so thinking his behaviour may be down to this, I suggested we visit his grave the next day to give him some solace.  When we got to the graveyard, I said I would go for a wander and leave him there to have some time on his own. I saw him talking to someone, before returning to me, looking distraught."
        },
        {
            "text": "“They’re after us”, he said.  “You can’t drive”.  Then to the side, “Do I tell her?”"
        },
        {
            "heading": 2,
            "text": "Difficult times for the family"
        },
        {
            "text": "This was the start of a really tough time. I called the doctor and the mental health early intervention team got involved. For two weeks my fiancé struggled with psychosis. My eldest son from a previous relationship and our youngest son were sent to their grandparents while my fiancé also struggled with panic attacks and paranoia."
        },
        {
            "text": "Our youngest son had seen him try to walk in front of a bus, and my eldest saw him grab a knife. I asked my fiancé’s best friend if he could stay to help me with appointments and prevent my fiancé from trying to get out of the car while I was driving, or bolt over the six-foot fence in the garden."
        },
        {
            "text": "It felt like with a click of the fingers, my partner was a different person."
        },
        {
            "text": "It took some time to work out the balance with his medication and he couldn’t be left alone for a few months. He’d been at his work for 14 years but didn’t particularly enjoy it. Although it was hard, he left work. My work was understanding, and I was able to work flexibly to support him. When I returned to work, he occasionally came in to see me, but I also tracked him using my phone as I was still worried about him, especially as there was a river nearby where we lived."
        },
        {
            "text": "I describe that time as like ‘having another child’. Things have improved though. He’s now a self-employed landscape gardener and loves it. He gets himself up and out to work.  He’s still under the care of the Early Intervention Team and has ups and downs as you’d expect. The main thing is that he seems happy in himself. I can see our youngest son is like his dad – he puts pressure on himself when he really doesn’t need to, but sometimes when things like this happen you can realise that you need to change.  It’s also a time where you find out who your friends are, and that by opening up to people, you can get a lot back in return."
        },
        {
            "text": "Sometimes I feel guilty that I have received more support as a carer than he has. The carers group I attend has been brilliant. I finally recognised that, like him, I had to talk to someone too. I love and admire him more now for what he’s been through and we’re stronger as a couple. I can’t wait until we get married in two weeks!"
        },
        {
            "text": " "
        }
    ]
}