{
    "url": "https://socialworkwithadults.blog.gov.uk/2022/06/09/carers-week-adult-social-works-role-supporting-unpaid-carers/",
    "title": "Carers Week: adult social work's role supporting unpaid carers",
    "authors": [
        "Lyn Romeo"
    ],
    "categories": [
        "Care and support",
        "Knowledge and skills",
        "Society"
    ],
    "pub_date": "2022-06-09T13:25:03+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Staying alert to unpaid carers needs"
        },
        {
            "text": "It is part of our job as social workers, in both adult and children’s services, to be intuitively and professionally aware of the needs of those we serve."
        },
        {
            "text": "Many of the families and individuals we work alongside will, in addition to other life pressures, have caring obligations which they sometimes struggle to meet, due to the many competing demands on their time, both practical and emotional."
        },
        {
            "text": "Sometimes, this means many unpaid carers do not seek out the help and support they need to stay healthy in mind and body. This obviously has a knock on effect for the family, friends and loved ones they care for."
        },
        {
            "text": "Carers Week, which this year emphasises the theme of making sure carers are ‘visible, valued and supported’, reminds us of the principles of our practice. We must be alert to issues which employers, educators and even other family members may miss."
        },
        {
            "text": "Social work practice has as an imperative that we make no assumptions or snap judgments about a person’s capacity to cope, and that we have a duty to look at the whole picture, including how those who are caring for others look after themselves and to flag concerns with professionals and services which could help them."
        },
        {
            "heading": 2,
            "text": "Protecting carers' autonomy"
        },
        {
            "text": "We do this whilst making sure we respect and encourage individuals to make their own decisions about the support they need. Our job is to provide guidance, advice and recommendations on ways forward, none of which should compromise or undermine their autonomy."
        },
        {
            "text": "This is critical to bolstering and strengthening confidence and self-esteem. We want unpaid carers to achieve their life goals just as much as anyone seeking to overcome difficulties or challenges in their lives."
        },
        {
            "text": "On this point, the current work to explore ways to promote the named social worker model across social work with adults – and social care more generally – will, I hope, serve the needs of carers well."
        },
        {
            "text": "Given we are already the touch point for other health and care services involved in a person’s care, we are ideally placed to raise the visibility of those with additional caring responsibilities."
        },
        {
            "text": "We also have a responsibility to acknowledge the caring needs of an increasingly diverse society, this means making sure we embed anti-racist, culturally sensitive and competent approaches in our practice. This could mean being alert to caring traditions within certain communities or being aware of differences of view between the carer and the cared for. How we handle these nuances will determine the manner in which we can identify and build the right support to keep the individual and their carers safe and well."
        },
        {
            "text": "During this Carers Week, I ask all my social work colleagues to consider what more they can do to raise awareness of the needs of unpaid carers and how they may enlighten and inspire others to do the same."
        }
    ]
}