{
    "url": "https://defradigital.blog.gov.uk/2022/06/09/defra-data-heroes-meet-the-information-appraisal-team/",
    "title": "Defra Data Heroes: Meet the Information Appraisal Team",
    "authors": [
        "Allison Wort"
    ],
    "categories": [
        "Data protection",
        "Data Transformation"
    ],
    "pub_date": "2022-06-09T08:35:47+01:00",
    "content": [
        {
            "text": "On International Archives Day we hear from Allison Wort, who leads Defra’s Information Appraisal Team, on the work her team does to process, archive and dispose of many thousands of historic files and departmental records each year."
        },
        {
            "text": "Hi, I’m Allison and I lead Defra’s Information Appraisal team. I and most of my team are based at Alnwick in Northumberland, but some are at other locations too in London, York, and Peterborough."
        },
        {
            "text": "Every year we process, archive, and dispose of many thousands of historic files and departmental records. Our work is vital to ensuring Defra meets its statutory obligations when it comes to information management."
        },
        {
            "text": "The work of my 15-strong team is statutory. Under the terms of the Public Records Act of 1958, all government departments must appraise their information by the time it reaches 20 years old (previously, this was 30 years)."
        },
        {
            "text": "At that point a decision needs to be made as to what could be destroyed now, destroyed at a date in the future, or preserved for public access at The National Archives (TNA) in Kew."
        },
        {
            "heading": 2,
            "text": "Who we are and what we do"
        },
        {
            "text": "We must carry out the appraisal and selection of records (paper and soon digital) in line with TNA guidance and policies. The end-to-end appraisal function is undertaken across sites in London, Alnwick, and Peterborough."
        },
        {
            "text": "The London team, based in Nobel House, is essentially where the archiving and appraisal process begins, and ends. The team handles the intake of files from across the Department, and they send them to the Iron Mountain facility for long term storage, and they retrieve files from that facility on request. There are currently around 240,000 Defra files in storage. Once appraisal is complete, they ensure that the Iron Mountain database is updated."
        },
        {
            "text": "Our Alnwick team – ten staff in total - appraise Defra’s registered paper files, managing the intake and disposal of files which have reached the 20-year point and prepare and transfer selected files to Kew and manage our contract with Iron Mountain. The team disposes of those files which are no longer needed, and they also arrange for a small number of files, which are deemed necessary to be kept for business or sensitivity reasons, to be further stored."
        },
        {
            "text": "Our Peterborough and York team - originally Natural England (NE) staff who were transferred into Defra in 2015 - retains responsibility for appraising NE material and providing advice on NE records."
        },
        {
            "heading": 2,
            "text": "Knowing what to archive and what to dispose of"
        },
        {
            "text": "Each year we develop an appraisal programme. During this calendar year - 2022 - we must appraise files from 2000 and 2001. TNA monitors our compliance with this via their annual Information Management Report."
        },
        {
            "text": "Appraisers identify files requiring closer examination and call them to Alnwick from Iron Mountain. A decision is then taken on whether they should be selected for TNA (round 3% are), destroyed immediately or destroyed at a date in the future. We try to liaise with the original owners of the files over the decisions we make and engage them in discussion. Some files do have a longer retention, 50 years plus in some cases usually due to sensitivity (a few wartime files remain.) The oldest file I’ve seen related to land and property deeds. It was written on vellum and dated back to around 1650."
        },
        {
            "text": "We see unusual files too. One, dating back to 1986, which will be transferred to Kew soon, is a file relating to radiation readings from Chernobyl, which were taken in Sweden two days after the explosion but before the Soviet Union had declared a nuclear incident."
        },
        {
            "text": "The appraisal teams also work on files inherited due to machinery of government changes or privatisations. A recent example of this was Defra’s acquisition of around 60,000 unappraised files from the Food and Environment Research Agency (FERA) privatisation back in 2016."
        },
        {
            "heading": 2,
            "text": "Dealing with Covid and adapting to the ’new normal’"
        },
        {
            "text": "During Covid, we spent much of 2020 away from the office and working from home, which impacted our ability to carry out file examinations as we were able only to do limited online research. Some team members were loaned out to other parts of the wider team, and some even went to the Department for Work and Pensions."
        },
        {
            "text": "As a result, we now have a backlog of files. The speed and way in which we recover is being monitored by TNA. We anticipate the move to blended working across Defra, coupled with the closure of offices such as Nobel House, will result in more files being found that need to be stored and appraised."
        },
        {
            "heading": 2,
            "text": "Looking to the future – paper files giving way to digital appraisal"
        },
        {
            "text": "All Defra (and predecessor organisation MAFF) records were held on paper until 2002. Defra records have been held digitally and on paper since then. The use of paper records has sharply declined in the past 10 years, with digital records increasing exponentially."
        },
        {
            "text": "We are currently working with our Digital Information Records Management team to explore and develop an appraisal solution for our digital records."
        },
        {
            "heading": 2,
            "text": "Why our work is important"
        },
        {
            "text": "Some Defra staff will probably never have seen a paper file, but it’s important that everyone in the department understands our statutory role. We capture the history of the department, and its predecessors, its engagement with the public and we help ensure Defra learns from its past."
        },
        {
            "text": "The appraisal work is subjective. There are TNA criteria, but a lot of what we do is about an appraiser’s understanding of the organisation, how things have changed and how it interacts with other departments and public bodies, and our citizens."
        },
        {
            "text": "There isn’t a specific training course you can go on to be an appraiser. It’s therefore very important for new team members – we had three new staff join last year – to learn from the more experienced appraisers, who can explain how the department has changed over the years, and so that they build up their own knowledge and understanding."
        }
    ]
}