{
    "url": "https://defrafarming.blog.gov.uk/2022/06/09/farming-investment-fund-new-slurry-infrastructure-grants-coming-in-autumn-2022/",
    "title": "Farming Investment Fund – new slurry infrastructure grants coming in autumn 2022",
    "authors": [
        "Thomas Proudfoot"
    ],
    "categories": [
        "Payments for equipment, technology and infrastructure"
    ],
    "pub_date": "2022-06-09T10:50:19+01:00",
    "content": [
        {
            "text": "Today we’re announcing more details about the new slurry storage grants that we will be launching later this year, as part of the Farming Investment Fund."
        },
        {
            "text": "Every year, farms in England generate and use millions of tonnes of livestock slurry. Slurry contains lots of nutrients and material that can benefit soil health and support crop growth. It can, though, create significant pollution to our environment. Though some farmers have plans, equipment and infrastructure in place to manage the nutrients in their slurry and manure well, others face significant financial barriers to having sufficient slurry storage. This is an area that has not been effectively regulated in the past. As part of the agricultural transition, we want this to change."
        },
        {
            "text": "We’ve designed the new grant alongside a number of other measures to help livestock farmers make use of their manure and organic nutrients, backed up by better advice and fair, effective regulation of the rules over the agricultural transition period. We are increasing the scope of the Catchment Sensitive Farming service so that it is available across England. We are reviewing all the guidance on GOV.UK so it is as clear as possible. We are also looking into the potential of more nutrient sharing between farms."
        },
        {
            "text": "The grant reflects the unique nature of investing in slurry storage infrastructure. We’ve drawn on months of co-design to shape it with farmers, industry and environmental experts."
        },
        {
            "text": "This post gives extra context to the information published today on GOV.UK. We explain what the new grant offers, how to apply and what to look out for over the coming months."
        },
        {
            "heading": 2,
            "text": "What we’ll offer"
        },
        {
            "text": "The grant will help livestock farmers already using a slurry system to upgrade their slurry storage, to reach 6 months storage capacity and to cover grant funded stores with impermeable covers."
        },
        {
            "text": "Farmers are obliged to have a minimum of 4 months slurry storage in the rules for Storing silage, slurry and agricultural fuel oil; 6 months storage will help farmers go beyond those requirements, meet the Farming rules for water and spread slurries to meet crop needs, rather than wasting them because of a lack of storage."
        },
        {
            "text": "All pig, dairy and beef farmers already using a slurry system can apply. You can use the grant to:"
        },
        {
            "text": "You can choose from multiple store types and find one to suit the needs of your farm, including slurry lagoons, steel and concrete ring tanks and rectangular concrete stores."
        },
        {
            "text": "You must use the grant to reach at least 6 months storage capacity based on your current herd, and the stores must meet regulatory and build standards. You can go beyond 6 months storage capacity but we will cap the grant contribution at 6 months so that we can afford to support more farms to improve their storage to at least that level. You’ll need to maintain 6 months storage capacity on your farm as a condition of the grant funding agreement – meaning you’ll need to take appropriate action if you change your herd size in the future. "
        },
        {
            "text": "All grant funded stores must also be fitted with an impermeable cover. This is an important step to prevent rainfall entering stores and to reduce air pollution. You don’t need to do this if your farm already uses a slurry acidification system that reduces the pH to 6 or below at the point of storage.  "
        },
        {
            "text": "Stores that remain part of your compliant storage capacity don’t need to be covered as a condition of the grant. You cannot use the grant to retrofit a cover onto an existing store without also expanding the store in the first round, but you can apply for covers for existing stores under Countryside Stewardship."
        },
        {
            "text": "Recognising the significant cost of investing in high standard slurry infrastructure, the grant will cover 50% of eligible costs. We’ve also changed the minimum and maximum grant amounts from previous rounds of the Farming Investment Fund: lowering the minimum grant to £25k to help smaller farms and capping the maximum at £250k so we can fund more projects. "
        },
        {
            "text": "We think this offer represents the best use of public money to help farmers upgrade their storage for the long term. We are committed to reviewing the design and scope of the grant for future rounds. "
        },
        {
            "heading": 2,
            "text": "How to apply"
        },
        {
            "text": "As with other themes in the Farming Investment Fund, you can apply through a 2-stage process, starting with an online eligibility checker (opening in the autumn) followed by a full application (over the winter). "
        },
        {
            "text": "This is the first time we have run national slurry storage grants for many years. So, we expect demand to be high. In the first round, if we get more applications than we’re able to fund, we’ll prioritise applications which will have a higher environmental benefit. We will do this by inviting those applicants with projects near protected sites to submit a full application."
        },
        {
            "text": "There will be multiple opportunities to apply for a grant. So if you aren’t successful this year, we would encourage you to apply again in future rounds which we expect to run over the next few years. "
        },
        {
            "heading": 2,
            "text": "What you can do now"
        },
        {
            "text": "You can start preparing now by: "
        },
        {
            "text": "AHDB will shortly publish an updated version of the Slurry Wizard tool to help you calculate your storage capacity. The Construction Industry Research and Information Association (CIRIA) also produce extensive guidance to help you plan your slurry storage needs, meet regulations and comply with build standards. You can get this resource for free on their website.  "
        },
        {
            "text": "If we invite you to make a full application, you will need to give more details. As part of our checks, the Environment Agency will be helping review project plans to check they fit with the rules, and suggest changes, preventing money wasted on detailed planning or construction. "
        },
        {
            "text": "Farmers will also be asked to create and use a nutrient management plan. Further details will be issued about this nearer the time. "
        },
        {
            "heading": 2,
            "text": "What’s next?"
        },
        {
            "text": "We will be publishing further details on the grant over the summer ahead of applications opening in the autumn.   "
        },
        {
            "text": "Do look out for further updates on the Defra Future Farming blog and at Funding for Farmers on GOV.UK."
        }
    ]
}