{
    "url": "https://defrafarming.blog.gov.uk/2022/06/09/farming-investment-fund-adding-value-grants-open-for-applications-from-9-june/",
    "title": "Farming Investment Fund: Adding Value grants open for applications from 9 June",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Payments for equipment, technology and infrastructure"
    ],
    "pub_date": "2022-06-09T11:17:53+01:00",
    "content": [
        {
            "text": "Following publication of the Adding Value manual on 23 May, the online checker is now open for you to apply. This £30 million fund offers grants focused on supporting farmers and growers to process, diversify and add value to their eligible agricultural products after they are harvested or reared. It offers grants of between £25,000 and £300,000 for up to 40% of eligible project costs.  "
        },
        {
            "text": "You can apply for a grant if you are:"
        },
        {
            "text": "Details on what you can apply for are in the manual for Adding Value on GOV.UK."
        },
        {
            "heading": 2,
            "text": "Applying"
        },
        {
            "heading": 3,
            "text": "Step 1: An eligibility and desirability check"
        },
        {
            "text": "The online checker opens today and will remain open until 21 July. It will give you an idea of your chances of success. Please note, Adding Value grants apply to England only."
        },
        {
            "heading": 3,
            "text": "Step 2: An invitation"
        },
        {
            "text": "If your project scores highly enough, following closure of the online checker you will be invited to submit a full application. You will need to complete a full application form and send this with your supporting documents (including quotes) to the Rural Payments Agency (RPA) by email.   "
        },
        {
            "text": "Successful projects will be provided with details about how to do this when the scheme is open for applications. You will then have until 31 January 2024 to submit your full application. If you need planning permission, then this must be approved and submitted with your full application."
        },
        {
            "text": "If you have any specific questions about the Adding Value grant, contact the Rural Payments Agency:    FTF@rpa.gov.uk"
        }
    ]
}