{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2022/06/09/gse-conference-highlights-from-chief-scientific-advisors/",
    "title": "GSE Conference: Highlights from Chief Scientific Advisors",
    "authors": [
        "Jamal Arabi"
    ],
    "categories": [
        "Collaborating & Networking",
        "Latest Stories"
    ],
    "pub_date": "2022-06-09T13:01:05+01:00",
    "content": [
        {
            "text": "The GSE Profession hosted the GSE Conference on 9 May at the London Science Museum, attended by over 400 in-person attendees as well as over 2000 members online. This was a really great event which showcased the breadth and depth of science and engineering expertise we have across government. To round of the event, we asked Chief Scientific Advisors and senior civil servants who attended to provide their highlight from the conference. Here’s what they had to say:"
        },
        {
            "text": "Sir Patrick Vallance, Government Chief Scientific Adviser and Head of the Government Science and Engineering Profession"
        },
        {
            "text": "\"It's hard to pick one highlight, but I did love the turbo talks. I loved hearing about such a range of science that spanned across different disciplines and that is done so well by people who were really experts. It was also incredibly useful to make so many new contacts. Some of the people I met had deep scientific expertise or worked in policy areas where science has an important impact. It really demonstrated to me the wealth of expertise we have across the civil service - we are sitting on a goldmine of talent and people who are doing really interesting things.\" "
        },
        {
            "text": " "
        },
        {
            "text": "Osama Rahman, Chief Scientific Adviser at Department for Education"
        },
        {
            "text": "“The first thing that struck me at the GSE conference was the huge variety of work going on across the profession: there were so many excellent posters, dealing with such a wide range of issues. It really demonstrated what an exciting and varied profession GSE is. "
        },
        {
            "text": "But the main highlight for me was the Diversity and Inclusion aspect, which was a thread running throughout the conference. We heard from Patrick during his keynote address just how important it is to be a diverse and inclusive profession: the wider the range of backgrounds, characteristics and lived experiences, the less likely we are to succumb to group-think and the more likely we are to be innovative and achieve great outcomes in our work. This was reinforced during the Diversity and Inclusion session, where members of the GSE Diversity and Inclusion Action Group shared their thoughts on some of the challenges, discussed best practice and highlighted some of the progress that’s been made. My main takeaway from this session was the importance of leaders being visible and open about our real selves – for me, that means remembering more than ever to be clear about being a proud British Bangladeshi, a muslim, and someone who deals with imposter syndrome.” "
        },
        {
            "text": " "
        },
        {
            "text": " Sarah Sharples, Chief Scientific Adviser at Department for Transport"
        },
        {
            "text": "Luckily, I was able to attend most of the GSE conference and was invited to be a part of the closing session providing some of my remarks from the day, this also included presenting the winner of the engineering poster. It is incredibly hard to pick out a highlight from the day as there were so many interesting and wide ranging sessions. If I was to narrow it down to two it would be the Turbo Talks from the morning session, which gave the opportunity for various individuals from across Government to present on their previously submitted S&E posters; Unfortunately I was unable to attend this session, but heard extremely positive reviews from the wide range of DfT colleagues that attended the conference. Furthermore, I was delighted to hear that Michaela Nelson from our very own team was one of these talks, spotlighting the DfT Futures Uncertainty Portal. The other was the strong emphasis throughout many of the session on Diversity and Inclusion and the importance of this within the Science and Engineering profession. It is great to see this at the forefront of our thinking and the great discussion both within the sessions and in the coffee/lunch breaks. "
        },
        {
            "text": " "
        },
        {
            "text": " Andrew Curran, Chief Scientific Adviser at Health and Safety Executive"
        },
        {
            "text": "“As Deputy Chair of the Government Science and Engineering Profession it was my privilege to award the prize for best poster in the ‘Science’ category.  The poster book, still available online, is a testament both to the great depth and to the breadth of government science and engineering.  It also shows how science underpins much of the activity, drives real practical changes for UK citizens, and protects those citizens from a range of potential issues, often before the public is fully aware of them.  The winners from the Medicines and Healthcare products Regulatory Agency, who presented a poster entitled ‘The MHRA’s response to the COVID-19 pandemic: using science to protect the patient’ in my category, are exemplars of this. The posters also showed how new knowledge is being generated and applied, directly and indirectly through Futures thinking, to influence and guide policy development in the years ahead. The conference highlighted to me the importance of working together, both in the science we undertake and also in sharing that knowledge across normal boundaries.”"
        },
        {
            "text": " "
        },
        {
            "text": "Vicki Chalker- Chief Scientific Adviser at UK Health Security Agency & Chair of the Diversity and Inclusion Action Group"
        },
        {
            "text": "“My highlight from the conference was meeting the volunteers from across government that have been helping advocate for diversity and inclusion in STEM. We have been working together for more than a year to highlight the great work underway, role modelling blogs, peer to peer mentoring and more, including why diversity and inclusion are essential to bring the maximum to GSE from across the community that we serve. It was great to meet face to face for the first time, meet new members and have a session committed to embedding diversity and inclusion at the heart of everything we do. There is still work to do across GSE and we are always keen to welcome anyone interested in helping. We had so many questions from the audience we ran out of time. It would be lovely to meet more GSE members and learn from others what is working locally and how we can share good practice. Please get in touch if you would like to be involved: gse@go-science.gov.uk. “"
        },
        {
            "text": " "
        },
        {
            "text": "Jennifer Rubin- Chief Scientific Adviser at Home Office"
        },
        {
            "text": "“Our highlight of the GSE Conference was getting off-site – especially at such an impressive venue – and seeing so many scientists and engineers from across government, at different career stages, excited to be together again. It offered an excellent opportunity to connect with old and new colleagues, and to pay tribute to the strength of our science and engineering work. There was a real energy and buzz about the day, and it was inspiring to learn about the diversity and vitality of the work that GSE colleagues are involved in: from land use in Defra, to the science and technology behind kitting out and maintaining a submarine. "
        },
        {
            "text": "Thank you to everyone involved in organising the GSE Conference – it was a true celebration of the role of science and engineering in government.”"
        },
        {
            "text": " "
        },
        {
            "text": "Damian Wilson- GSE Shadow Board representative at Met Office"
        },
        {
            "text": "“My highlight was listening into the very lively Resilient Cities discussion. Climate change is already impacting our cities and their residents, through heat and flooding, with associated actions to reduce climate change also improving air quality and the health or residents. The highest risks are felt in areas where the majority of the population are from an ethnic minority. The UK has one of the largest rates of public concern around climate change, but this concern has not been translated into large-scale action. The emphasis on devolved ownership of solutions to the local communities came across strongly in the discussion, with examples of where this has worked well. Policies need to actively support those working at the community level, rather than introducing extra process. Understanding the social context of the challenge, and how to communicate effectively with the community, is important right from the start of any intervention. People are an inherent part of our net zero journey and scientific co-development to generate behaviour change and initiate action is every much a part of the solution as policy changes.“"
        },
        {
            "text": "If you missed the conference and would like to catch up on some of the sessions, please contact gse@go-science.gov.uk"
        },
        {
            "text": " "
        },
        {
            "text": "Looking more widely, we received quarterly updates from departments following last months GSE theme, Celebrating Science and Engineering:"
        },
        {
            "text": "Department for Work and Pensions"
        },
        {
            "text": "DWP operates a Methods Advisory Group (MAG) of 12 leading academics drawn from a range of disciplines. The MAG convenes to advise the DWP Chief Scientific Adviser, Trevor Huddleston, on issues relevant to DWP methods for analysis.   MAG members also advise DWP teams outside of formal MAG meetings on a range of methodological, research and evaluation issues."
        },
        {
            "text": "In April, the MAG met to discuss the topic of how we can best understand disengagement from the labour market. Covid-19 saw significant numbers of particularly older workers leave the workforce.  DWP analysts presented data from the Labour Force Survey and the Over 50s Lifestyle Survey. The MAG suggested making use of surveys such as Understanding Society and the English Longitudinal Study of Ageing.  And provided useful contacts and the latest thinking on deliberative research methods and systems analysis."
        },
        {
            "text": "A review of the MAG is being carried out this Summer by a PhD Placement student. To make an assessment of the first three years of operation of the MAG and provide information for the CSA on the future operation of the MAG."
        },
        {
            "text": "For the Membership of the DWP MAG and Terms of Reference see: DWP Methods Advisory Group - GOV.UK (www.gov.uk)"
        },
        {
            "text": "For further information please contact evidence.strategyteam@dwp.gov.uk"
        },
        {
            "text": " "
        },
        {
            "text": "Ministry of Defence"
        },
        {
            "text": "Defence’s Exceptional Science and Engineering Celebrated:"
        },
        {
            "text": "Over fifty examples of exceptional science and engineering across the Defence Enterprise were recognised at the recent MOD Chief Scientific Adviser Commendation Awards in March 2022. Winners were presented with their prizes by MOD’s CSA, Prof Dame Angela McLean, and Head of Profession (Engineering), Rear Admiral Paul Marshall in the first in-person celebration of science and engineering within MOD since the emergence of the COVID-19 pandemic."
        },
        {
            "text": "Award categories included Excellence in Science and Engineering, Diversity and Inclusion and in the 2021 Awards, a special additional category to recognise the contribution of science and engineering to the once-in-a-generation COVID-19 pandemic. Prof Dame Angela McLean presented an organisational award to Dstl to celebrate their efforts in response to the pandemic. Another highlight was the awarding of Science and Engineering Apprentice of the Year to four current apprentices, in recognition of the exceptionally high calibre of nominations received and highlighting the exciting future of Defence’s workforce."
        },
        {
            "text": "A huge congratulations to all winners across the Defence Enterprise and the MOD S&E Profession teams look forward to receiving even more fantastic nominations for the 2022 Awards."
        }
    ]
}