{
    "url": "https://educationhub.blog.gov.uk/2022/06/how-we-are-continuing-to-support-students-who-are-struggling-at-university/",
    "title": "How we are continuing to support students who are struggling at university",
    "authors": [
        "media officer"
    ],
    "categories": [
        "Mental Health",
        "Students",
        "Universities"
    ],
    "pub_date": "2022-06-09T14:31:34+01:00",
    "content": [
        {
            "text": "Helping students be happy and healthy in their studies is crucial."
        },
        {
            "text": "That’s why, thanks to the creation of the first ever Student Support Champion, students will soon be able to benefit from more joined-up support from their universities"
        },
        {
            "text": "Here’s everything you need to know."
        },
        {
            "heading": 3,
            "text": "What have you announced?"
        },
        {
            "text": "We have announced the creation of a new Student Support Champion to advise universities on supporting students who may be struggling and at risk of dropping out."
        },
        {
            "text": "We’ve appointed Edward Peck CBE, Vice-Chancellor and President of Nottingham Trent University, to the new role, which has been established to help universities make sure students complete their studies and get extra help when they need it."
        },
        {
            "heading": 3,
            "text": "Why has this role been created? "
        },
        {
            "text": "The appointment comes following the disruption students faced during the pandemic."
        },
        {
            "text": "High levels of student engagement and a sense of belonging have been linked with students performing well at university and reducing dropout rates."
        },
        {
            "text": "A recent joint study by Pearson and higher education outlet WonkHE showed those students with the sense of belonging were associated with high engagement are likely to enjoy more academic success."
        },
        {
            "text": "Out of those surveyed, 72% who agreed that they belonged at their institution felt confident about their academic skills compared to just 34% who reported that they did not feel such a sense of belonging."
        },
        {
            "heading": 3,
            "text": "What will the role entail?"
        },
        {
            "text": "The new champion will advise universities on keeping students engaged with all aspects of campus life including how to spot the early warning signs of students who are struggling with their studies or mental health."
        },
        {
            "text": "In the next two years as Student Support Champion, Edward Peck will advise universities on how they can better monitor the student population, including through technologies such as Customer Relationship Management systems."
        },
        {
            "text": "These systems can flag the early warning signs of those who are struggling by monitoring data such as attendance and library collections."
        },
        {
            "heading": 3,
            "text": "What else are you doing to support students’ mental health? "
        },
        {
            "text": "Students struggling with their mental health can access Student Space, a mental health and wellbeing hub supporting students impacted by the pandemic."
        },
        {
            "text": "Funded by £3.6m from the Office for Students, Student Space provides dedicated one-to-one text and web chat facilities as well as a collaborative online platform providing vital mental health and wellbeing resources. The platform includes resources and specialist services for students from ethnic minority groups."
        },
        {
            "text": "Students can also access support mental health and wellbeing support via online resources from the NHS, Public Health England via the Better Health - Every Mind Matters website, and the mental health charity Mind."
        }
    ]
}