{
    "url": "https://educationhub.blog.gov.uk/2022/06/09/how-many-pupils-from-ukraine-have-been-given-school-places-in-england/",
    "title": "How many pupils from Ukraine have been given school places in England?",
    "authors": [
        "media officer"
    ],
    "categories": [
        "Schools",
        "Ukraine"
    ],
    "pub_date": "2022-06-09T14:51:21+01:00",
    "content": [
        {
            "text": "We’ve published data that shows how many children from Ukraine have applied for and been offered school places since the start of the war."
        },
        {
            "text": "Here we answer your questions on the data."
        },
        {
            "heading": 3,
            "text": "What does the data you’ve published show?"
        },
        {
            "text": "It shows that 9,900 pupils from Ukraine have been offered school places and 11,400 in total have applied."
        },
        {
            "heading": 3,
            "text": "Why is there a difference – why have some pupils not been offered places yet? "
        },
        {
            "text": " That’s because local authorities and schools, who run the application process, have 15 school days from the point a parent or guardian applies for a place to get a school place for the child."
        },
        {
            "text": "Many of the pupils who have applied for a place but not been given one may be the middle of that process to find them a place."
        },
        {
            "heading": 3,
            "text": "What else does the data show?"
        },
        {
            "text": " The data shows the figures broken down by local authority (council) and by primary and secondary level."
        },
        {
            "text": "We have also published similar data for resettlement programmes for children from Hong Kong and Afghanistan."
        },
        {
            "heading": 3,
            "text": "Why have you published this data? "
        },
        {
            "text": " The Government wants parents with children arriving from Ukraine to be able to apply for a school place and have their children start school as soon as possible, rather than waiting until the start of the new academic year in September."
        },
        {
            "text": "This data helps us understand how well the system is responding to the new arrivals and which areas might need additional support."
        },
        {
            "heading": 3,
            "text": "Are there any pupils who have come from Ukraine but haven’t applied for a school place? "
        },
        {
            "text": " Yes – and this data helps us understand that."
        },
        {
            "text": "There are a number of families who haven’t applied for a place – that may be because they are learning remotely through the Ukrainian online platform set up in the pandemic. We’ll use this data as part of our work to encourage parents to apply for school places for their children."
        },
        {
            "heading": 3,
            "text": "How can I find out more about applying for a school place?"
        },
        {
            "text": "The Department has produced a helpful guide in both English and Ukrainian so new arrivals know what they should do and what is available to them: How do families arriving from Ukraine apply for a school place and childcare? / Як родинам, що приїжджають з України, подавати заяви на отримання місць у школі та допомоги з оплати послуг з догляду за дитиною? - The Education Hub (blog.gov.uk)"
        }
    ]
}