{
    "url": "https://dwpdigital.blog.gov.uk/2022/06/09/launching-our-women-in-data-network/",
    "title": "Launching our ‘Women in Data’ network",
    "authors": [
        "Gemma Elsworth, Head of Digital Performance Analytics, DWP Digital"
    ],
    "categories": [
        "Data",
        "Women in Digital"
    ],
    "pub_date": "2022-06-09T14:36:37+01:00",
    "content": [
        {
            "text": "Earlier this year I was talking to someone who coaches women in leadership and was asked the question: “What are you doing to help encourage and support women in data?”"
        },
        {
            "text": "We recognised the great work being done by the existing Women in Digital network but we realised we needed to do more in the data space. That’s why we’ve launched our new ‘Women in Data’ network for female data colleagues across DWP Digital."
        },
        {
            "heading": 2,
            "text": "Bringing the community together"
        },
        {
            "text": "The data industry is still heavily male-dominated, so we wanted to create a safe environment for our female colleagues to go to for support.  Working in data is truly a good career that provides lots of opportunities to progress and to meet and work with new and all types of people – we’re hoping to use the network to promote that."
        },
        {
            "text": "There’s a whole range of different roles available in our Data Practice including data analysts, digital performance analysts, data scientists and data engineers. And we all have specific needs and challenges to address that differ from other areas in the organisation."
        },
        {
            "text": "There’s a real benefit of having networks within networks as it allows us to foster relationships between our people and our community. Creating a network for women working within the Data Practice at DWP Digital will enable us to meet and connect with other women that we've potentially not met before, as well as understand some of the challenges we face and how we can work together to improve them."
        },
        {
            "text": "It’s also a great opportunity for us to celebrate our own personal and career achievements as a community!"
        },
        {
            "heading": 2,
            "text": "Looking forward to the future"
        },
        {
            "text": "It's still really early days for the network but I’m excited for what’s to come. Our main aim is to create a space for women to get to know each other, and for women to support each other within their roles. But beyond that, we want the network to create its own goals to strive for things that we all collectively want to get out of the network."
        },
        {
            "text": "There are a lot of good books that highlight and explore how much women have been excluded from the data industry in the past. It's important that women are there making those decisions so that this inequality doesn’t continue to happen. We need to present and be part of the right conversations so our voices can help make those key decisions."
        },
        {
            "heading": 2,
            "text": "Be digital with purpose"
        },
        {
            "text": "Working in data at DWP Digital is unique. Pretty much everywhere else that you work, you're using your talent to make loads of money for somebody else. Everything is geared towards profit. Everything is geared towards improving that conversion number and improving that overall revenue number."
        },
        {
            "text": "When you come to government, you take those skills and you get to put them towards changing people's lives, making a real difference for people. Not only this but you get to work alongside other people who only want to help and to improve the lives of people in this country."
        },
        {
            "text": "Why wouldn't you want to use your data talent for good? It was my biggest reason for wanting to move here. I was tired of just trying to get money out of people and I wanted to make a real difference in the work that I do."
        },
        {
            "text": "Even the smallest things feel like you're making a real difference for people in the UK, so visit the DWP Digital careers site and join us today."
        },
        {
            "text": " "
        }
    ]
}