{
    "url": "https://planninginspectorate.blog.gov.uk/2022/06/09/new-appeal-a-planning-decision-service-launches/",
    "title": "New ‘Appeal a planning decision’ service launches",
    "authors": [
        "Olu Abraham-Sunday"
    ],
    "categories": [
        "Appeals",
        "Service improvement"
    ],
    "pub_date": "2022-06-09T16:59:16+01:00",
    "content": [
        {
            "text": "Olu Abraham-Sunday, Product Manager at the Planning Inspectorate, explains about the recent launch on GOV.UK and what’s next."
        },
        {
            "text": "If you appeal a planning decision made by Hillingdon or Bradford local planning authorities (LPA) you can now use our new Appeal a planning decision service available on GOV.UK."
        },
        {
            "text": "These LPAs have been helping us to test the online service over the past year. We initially started with householder appeals, and the latest launch now includes larger types of planning appeals."
        },
        {
            "text": "The new service is in ‘Beta’ while we test and prepare for a wider launch with more LPAs later in the year."
        },
        {
            "text": "The eligibility check that we’ve built into the service means that only planning appeals of decisions from those LPAs can use the new service, for now. We need to do this so that we can test the service against a certain number of cases, but over time we will scale this up."
        },
        {
            "text": "So, if you’re a planning agent representing appellants in the relevant areas, we ask that you use the new service instead of going directly to the Appeals Casework Portal."
        },
        {
            "heading": 3,
            "text": "What’s the new service?"
        },
        {
            "text": "The new online service will ultimately replace the Appeals Casework Portal and is designed to make it easier and faster to appeal a planning decision. Our goal is to provide a better service to our users – appellants, planning agents, councils and citizens who wish to comment or find out about an appeal."
        },
        {
            "text": "Some of the key benefits include:"
        },
        {
            "text": "Whilst we are starting with a limited trial area of these LPAs, later in the year we will expand to include more LPAs and other types of appeals such as enforcement appeals."
        },
        {
            "text": "Here’s a taster of what the new service looks like:"
        }
    ]
}