{
    "url": "https://nda.blog.gov.uk/sand-owsnett-nda-group-lgbt-network-co-chair-talks-about-their-experience-as-non-binary/",
    "title": "Sand Owsnett, NDA group LGBT+ Network Co-Chair, talks about their experience as non-binary",
    "authors": [
        "NDA group"
    ],
    "categories": [
        "diversity"
    ],
    "pub_date": "2022-06-09T10:51:31+01:00",
    "content": [
        {
            "text": "You may see me as a woman, because I was assigned female at birth, yet I would rather just be seen as agender, rather than a gender. I am non-binary."
        },
        {
            "text": "It was in October 2016 when I realised that I was non-binary. After being around trans and non-binary people and reading about the gender spectrum, I knew that my identity was valid and that I was not alone. It was a massive relief to finally be able to attach a word to my experiences and know that there were other people like me."
        },
        {
            "text": "It wasn’t until January 2018 that I told my family and started making some changes at work."
        },
        {
            "text": "Although I have the right to change my gender on my official NHS registration documents, I still haven’t told my GP or updated my gender marker. It’s never really occurred to me, or maybe, on reflection it’s because deep-down I’m worried it’ll change how I’m treated. You can change your name, title, and gender marker at your GP surgery at any time and writing this blog has prompted me to do this."
        },
        {
            "text": "It’s important to be aware that changing your gender marker with NHS services may affect whether you’re invited for screening tests. These are tests for certain conditions that are offered based on gender marker. So, for instance, people assigned female at birth are invited for cervical screening from the age of 25 in the UK. Trans masculine people who change their gender marker to male may no longer be invited for screening. The opposite can also be the case. If you’re a trans feminine person but you don’t change your gender marker to female, you may not be invited for breast screening."
        },
        {
            "text": "It’s also important that you receive screening for the body that you have, so if you change your gender marker you should ask your GP to make sure you are enrolled in the right programmes."
        },
        {
            "text": "In healthcare settings, it’s important to create a safe and welcoming environment for all patients and service users. Outside of trans-related care such as gender clinics, trans and non-binary people have the same healthcare needs as other patients."
        },
        {
            "text": "My experiences as a non-binary person have been the same for me now as any other time in my life. Health professionals and support staff have always treated me with the same respect and care as they would any other person, as it should be. I hope that doesn’t change when I update my gender marker, because we should be treated as human beings first and foremost."
        },
        {
            "text": "I’m 50 and experiencing the perimenopause. Trans men and non-binary people may experience menopause if they keep their ovaries and do not alter their hormone profile. However, because they are not represented in the language around healthcare, they risk losing access to care entirely. If people feel like they’ll be ignored or misunderstood if they seek support, they’re much less likely to do so – and it’s much more likely that the symptoms will get worse."
        },
        {
            "text": "By making space in our language for people of any gender and focusing healthcare on individual needs rather than gendered assumptions, we can achieve better health outcomes for everyone."
        },
        {
            "text": "Learning about non-binary identities has given me the words to articulate something that I didn’t have the language to describe and has enabled me to understand myself a bit better. It is important for me to be true to myself. We change society by being who we are."
        }
    ]
}