{
    "url": "https://competitionandmarkets.blog.gov.uk/2022/06/09/supporting-carers-at-the-cma/",
    "title": "Supporting carers at the CMA",
    "authors": [
        "James Waugh"
    ],
    "categories": [
        "Life at the CMA"
    ],
    "pub_date": "2022-06-09T14:01:46+01:00",
    "content": [
        {
            "text": "In this year’s Carers Week, the CMA is proud to announce that we have joined the Employers for Carers membership forum, which is focused on helping employers support carers in the workplace. Through working with the specialist knowledge of Carers UK, and the wider Employers for Carers community, the CMA is committed to creating an environment where carers are seen, valued and can be open around their caring responsibilities."
        },
        {
            "heading": 2,
            "text": "Who are carers?"
        },
        {
            "text": "A carer is anyone who cares, unpaid, for a friend, partner or family member who due to illness, disability, a mental health problem or an addiction cannot cope without their support."
        },
        {
            "text": "The charity Carers UK estimates that around 1 in 7 people in the workplace have caring responsibilities. Research has shown that, if unsupported, caring whilst working can result in poorer mental health, higher risk of burnout and financial worries. Those with heavy caring responsibilities are 2 to 3 times more likely to be in poor health and over 70% of working carers have felt isolated in the workplace due to caring responsibilities."
        },
        {
            "text": "No one starts life thinking that they will become a carer but most people's lives will include at least one episode of caring – whether that’s for a child with additional needs, a parent who needs greater support as they get older, or for a partner who struggles with a physical or mental health problem."
        },
        {
            "heading": 2,
            "text": "Caring and working"
        },
        {
            "text": "Balancing caring responsibilities with work presents a particular challenge. One of the hardest acts in the workplace can be for carers to open up to colleagues about their personal circumstances; and for managers and colleagues to have the confidence to have open, empathetic and honest conversations with their caring staff. Employers have a key role in fostering a culture in which such conversations can take place."
        },
        {
            "text": "The CMA is committed to supporting its carers and has an active staff-led Carers Network, which I am proud to chair. I look forward to helping the CMA to build on this by drawing on the expertise and support that Employers for Carers membership will bring."
        }
    ]
}