{
    "url": "https://nationalscreening.blog.gov.uk/2024/07/05/2024-annual-call-for-topics-is-open/",
    "title": "2024 annual call for topics is open",
    "authors": [
        "Mike Harris"
    ],
    "categories": [
        "General"
    ],
    "pub_date": "2024-07-05T11:49:56+01:00",
    "content": [
        {
            "text": "The UK National Screening Committee’s (UK NSC’s) 2024 annual call for new screening topics has opened."
        },
        {
            "text": "This is our regular opportunity for you – our stakeholders – to submit proposals to the committee."
        },
        {
            "text": "During the 3-month annual call period, any individual or organisation can propose potential new screening programmes, new technologies we have not previously reviewed, modifications to current screening programmes, or early updates (following new evidence) to topics the committee has considered recently."
        },
        {
            "text": "Proposals can cover targeted and stratified screening as well as population screening."
        },
        {
            "text": "The annual call will close on 30 September. Proposals must be submitted before that date to be considered."
        },
        {
            "text": "The Fetal, Maternal, Child Health (FMCH) expert group and the Adult Reference Group (ARG) will propose next steps for submissions and a final decision will be made in collaboration with the UK NSC. The selected topics will be included in the next work plan, which will be agreed with the chief medical officers (CMOs) from the 4 countries."
        },
        {
            "text": "We will aim to get back to stakeholders shortly after the first 2025 meeting of the relevant expert group to update them on the progress of their proposals."
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK NSC. You can register to receive updates direct to your inbox, so there is no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, please email uknsc@dhsc.gov.uk."
        }
    ]
}