{
    "url": "https://dwpdigital.blog.gov.uk/2022/03/07/breaking-the-bias-in-the-workplace/",
    "title": "Breaking the bias in the workplace",
    "authors": [
        "Rowena Maccallum - Gender Lead, DWP Digital"
    ],
    "categories": [
        "Equality",
        "International Women's Day",
        "Women in Digital"
    ],
    "pub_date": "2022-03-07T11:57:22+00:00",
    "content": [
        {
            "text": "International Women’s Day particularly resonates with me because of my role as Gender Lead for DWP. Today, we are being asked: will you help break the bias? "
        },
        {
            "text": "As I deliberate this subject, I find myself challenging my own thinking, beliefs and understanding about what breaking the bias means to me, as a woman and whether bias still exists in our modern society. "
        },
        {
            "text": "As I dig deeper into this subject, I need to understand how bias works and reflect on my own journey, life experiences, culture, and beliefs. It’s important that I recognise how unconscious biases shape the way I view the world and affect my decision making, as well as the way I perceive and interact with others. This extends to what I can do to overcome my biases to ensure that I don’t create a negative experience for others.  "
        },
        {
            "heading": 2,
            "text": "Creating an environment for inclusivity"
        },
        {
            "text": "I don't think there's an easy or quick solution, but one thing I know is, it is imperative that we create an inclusive environment and recognise that everyone needs to be treated with respect and fairness and that we acknowledge differences.  Each one of us can initiate change and do something about it. And this change needs to start within ourselves. I knew that I had to create my own change and take control of my own career. "
        },
        {
            "text": "Looking back to a few years ago, what made a big impact on me was having mentors and allies. Particularly, if I’m being honest, male allies campaigning for those who are less privileged. Allies can make a real difference.  "
        },
        {
            "text": "I am optimistic that progress is being made and women are being accepted more with more opportunities to progress, but it is important for organisation to recognise the vital role they play in breaking the bias in the workplace. Organisation need to step up by mitigating the impacts of unconscious gender bias by doing more to understand the barriers that hold women back and prevent them from progressing and advancing into leadership roles. For example, women returning to their careers after a period of paternity or maternity leave. "
        },
        {
            "text": "We are well into the 21st century and based on the shared and lived experiences of bias that women experience, particularly women of colour, and the societal expectations and organisational practices, I think significant barriers to women’s career advancements remain. For example, the domestic obligations of men are often less compared to women, particularly working mother, this can make it easier for men to be available take roles and be more geographically mobile. Another example is around unconscious bias thinking on the term senior leaders, the perception is that often people automatically think of male leadership. "
        },
        {
            "heading": 2,
            "text": "How we're breaking the bias"
        },
        {
            "text": "In the last few years, many organisations have taken proactive steps to address gender bias.  In 2015, the Civil Service introduced a cross-government ‘name blind recruitment’ policy, removing an applicant’s name from the recruitment process helps drive down the risk of bias and as part of a wider diversity approach, it is a much fairer system and this is proven to help increase senior female representation. "
        },
        {
            "text": "I perceive the technology sector as having been a male dominated environment. One where it can be a challenge for women, like myself, working in digital to build a profile and be more visible. That said, across DWP we are changing that landscape, often linked by our common experiences of navigating stereotypes that hold us back from reaching our full potential.  "
        },
        {
            "text": "It’s true that progress has been made towards gender equality and more women are excelling in various roles and women have gained significant ground in the workplace roles that were once dominated by men. Having said that, I believe more can be done to identify the barriers that are still holding us back so that we can break the bias. I believe that each of us can make an impact on how things evolve. We can be bolder and facilitate discussion to help unpack the more qualitative issues that matter to women, engage men in the conversation on the issues that women face as well as explore what we can do to foster gender equity at work. "
        },
        {
            "text": " All of us are affected by unconscious biases but giving people, especially women and others with protective characteristics a greater opportunity to foster a supportive culture for everyone is imperative. Whether you're from an ethnic minority background, a young person or a new entrant just starting out in your career, to have a more equal playing field is going to reduce the experiences that culminate unconscious bias in the workplace. This can create a ripple effect on morale, teamwork, commitment and performance."
        },
        {
            "text": "This year the International Women’s Day theme 'Break the bias' is fully complemented by our DWP gender mission which is to create an environment where diversity of thoughts, personality, background, and people’s protective characteristics are fully accepted and celebrated.  "
        },
        {
            "text": "As the DWP Gender Lead, I am truly grateful to be involved and contribute to this vital work to enable people to be their authentic selves. I believe a big part of diversity is acknowledging that we are all different. So, in my opinion women must not feel that we must be honorary men. Rather we should be able to succeed and contribute to better workplaces by being ourselves and bringing in the masculine and feminine qualities. Taking in talent with different ideas in the workplace can be a great formula for an innovative environment. "
        },
        {
            "text": "Together let’s celebrate International Women’s Day and make time to reflect on what women have achieved individually, as a team and as an organisation. Let’s: Take proactive steps to overcome biases. Take a stand, speak up. Let’s break the bias and share our stories. "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}