{
    "url": "https://ruralpayments.blog.gov.uk/2022/03/07/getting-ready-to-make-your-countryside-stewardship-higher-tier-application/",
    "title": "Getting ready to make your Countryside Stewardship Higher Tier application",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Countryside Stewardship"
    ],
    "pub_date": "2022-03-07T11:07:28+00:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "Applications for Countryside Stewardship Higher Tier opened on 8 February 2022."
        },
        {
            "text": "Application packs can be requested using the Rural Payments service. The pack will be emailed to you and will contain the information that we hold for your business as it appears in the Rural Payments service."
        },
        {
            "text": "We can only email you the pack once, so it is important to make sure that your details are up to date before requesting it. You should also make sure that all the land you want to enter into the scheme is already registered with the Rural Payments service when requesting your application pack."
        },
        {
            "text": "You will need to request an application pack by midnight on 31 March 2022 at the latest. Find out more by reading ‘How to request a Mid Tier or Higher Tier application pack’ on GOV.UK."
        },
        {
            "text": "Agreements we build in 2022 will start 1 Jan 2023, we recommend reading the  Higher Tier CS manual for more information about 2023 agreements."
        },
        {
            "text": "Before applying, we recommend thinking about what environmental features you have on your farm. It’s also important to research the priorities in your local area. You can find the Statements of Priorities for Countryside Stewardship and Priority Maps on GOV.UK."
        },
        {
            "text": "Consider what outcomes you would like to achieve. For example; if you would like to create a new habitat, which Countryside Stewardship options would be the best for you and how will this fit with your system?"
        },
        {
            "text": "The deadline to submit your completed application and supporting documents is 29 April 2022. You can read more about the key dates for RPA schemes on GOV.UK."
        },
        {
            "text": "If possible, we recommend submitting your application early, and well before the deadline as this will make it easier for the Rural Payments Agency (RPA), the Forestry Commission and Natural England to make decisions and recommendations about your application."
        },
        {
            "heading": 2,
            "text": "Speaking to an Adviser "
        },
        {
            "text": "If you are planning to submit an application, you should consider discussing it with Natural England to make sure that you are ready to apply."
        },
        {
            "text": "Speaking to Natural England will give you all the information that you need when getting ready to submit applications. It’s important to engage in these conversions early, because this will allow for plenty of time to discuss and agree the best mix of options when applying and will help to deliver the most for the environment."
        },
        {
            "text": "If you would like to contact Natural England, use the following contact details:"
        },
        {
            "text": "Email: enquiries@naturalengland.org.uk"
        },
        {
            "text": "Telephone: 0300 060 3900"
        },
        {
            "text": "If you are considering applying for woodland options, we also recommend talking to the Forestry Commission."
        },
        {
            "text": "You can find out the details for contacting the correct office by reading the Office Access and Opening Times page on GOV.UK."
        },
        {
            "text": "When contacting us about your application, make sure to let us know that you would like to discuss Higher Tier options and tell us whereabouts you are in the country. This will help us make sure that the correct adviser can get in touch with you."
        },
        {
            "text": "Countryside Stewardship schemes such as Higher Tier help to support the preservation of the countryside for future generations. By applying to create new habitats, for example, you will be helping enhance the natural environment through supporting biodiversity."
        },
        {
            "text": "This is all part of supporting Defra’s 25 Year Environment Plan ‘for our country to be the healthiest, most beautiful place in the world to live, work and bring up a family’."
        },
        {
            "text": "To make sure that you are able to see all of the latest updates and top tips from RPA, we encourage you to follow us on social media for the latest updates and information:"
        },
        {
            "text": "By following and subscribing to our social channels and blog, you’ll be able to see updates, announcements, and other useful information to support you."
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}