{
    "url": "https://defradigital.blog.gov.uk/2022/03/07/how-i-forged-my-career-in-defra/",
    "title": "How I forged my career in Defra",
    "authors": [
        "Maggie Bosniak"
    ],
    "categories": [
        "Defra digital",
        "Defra services",
        "Digital transformation",
        "Software tools",
        "User research"
    ],
    "pub_date": "2022-03-07T08:00:50+00:00",
    "content": [
        {
            "text": "I left school as soon as I possibly could, and with no qualifications. My first job from school was at a chemist, where I worked until having my first child. The following few jobs were fitted around being a mum – party planning, arts, and crafts, in particular making paper flowers, all of which could be done at home."
        },
        {
            "text": "When my youngest child started nursery, I started to regret having left school so early. I picked up a leaflet for a ‘Women returners scheme’, applied and was accepted on the course. I gained a computing and electronics qualification. This gave me what I needed to progress onto higher education."
        },
        {
            "text": "I completed a Higher National Diploma (HND) in IT Engineering at Sheffield Polytechnic (now Sheffield Hallam University). The course included a year in industry where I did a placement in education – promoting IT across the national curriculum, working with schools and teachers teaching them how to use computers. I then studied for a Design and Technology Education Degree, specialising in resistant materials."
        },
        {
            "heading": 2,
            "text": "Going against the grain"
        },
        {
            "text": "As I moved from education back into the world of employment, I found myself having to fight against the established view, at that time, that women were better placed to teach textiles and food, rather than woodwork and metalwork."
        },
        {
            "text": "I had no problems getting interviews, but when I arrived at the schools, I was often competing with ex-mining engineers, aircraft builders etc.  In the six interviews I had in a month, in all cases I was the only female candidate, and at one school I was approached by a parent governor asking why I was applying to teach a male orientated subject."
        },
        {
            "text": "That didn’t deter me though, and I got myself a temporary teaching role in my chosen subject covering long term sick. After this I began a one-year appointment working with the 'Women Returners’ College’, this time as a tutor delivering courses for women and young adults looking to gain IT skills. When that role ended, I decided to start contracting and was successful in gaining a software support role with the Royal Mail."
        },
        {
            "heading": 2,
            "text": "My route into Defra"
        },
        {
            "text": "In 1996 I was offered a three-month contract with the National Rivers Authority (the predecessor to the Environment Agency). That was my way in. After three extensions to my contract, I became a permanent member of staff, and started the role of Service Team Leader managing the Service Desk call team. Shortly afterwards I gained a place on a management development scheme which included moving around roles on short term basis, something I really enjoyed and thrived on."
        },
        {
            "text": "Over the next few years, I did different jobs – I’ve had 13 or fourteen different roles in Defra and its predecessor organisations. By 2000 I was the Central Host and PC Server Group Manager, responsible for two data centres and all the EA’s critical applications. Two years later, I was the National Support Manager responsible for IT Service Delivery across nine regions of England and Wales. Not sure how that even happened!"
        },
        {
            "heading": 2,
            "text": "My ‘Why’ "
        },
        {
            "text": "If you were to ask me why you should choose Defra as an employer I’d say, honestly, above all because it’s a great place to work. I’ve never done a job here that I’ve not enjoyed. I’ve always been encouraged to challenge myself and supported to do so."
        },
        {
            "text": "For those looking to join Defra, we have a range of talent and development schemes. There’s the Civil Service Fast Stream, which looks for people from all backgrounds to become our future leaders, to help ensure the Civil Service reflects all the communities it serves."
        },
        {
            "text": "There are also Civil Service apprenticeships. which can provide excellent opportunities to gain qualifications and develop your career for colleagues already working in the organisation, as well as new recruits.  If you’re interested in knowing more about apprenticeships, please contact my team."
        },
        {
            "text": "Both schemes are open to young people, who might just be starting out on their career journey, as well as those who have decided to make a switch later in life. Whether you’re looking for your first job or a new career direction, whatever your background or age, there’s something for you."
        },
        {
            "text": "In Defra we offer mentoring too. Mentoring is something I personally have used in the past, to good effect. I once went through a difficult patch with a manager, we just couldn’t get on the same wavelength. That was as much my fault as theirs. So, I sought out someone to talk to. In mentoring – the ball is in your court. You work with a mentor when you need support, or someone to bounce something off. I’ve never had a mentoring experience that’s not been positive."
        },
        {
            "heading": 2,
            "text": "Generation next"
        },
        {
            "text": "I’m passionate about developing people, and in my current role I really get to influence how we develop our people and I often see the results too. I previously co-led a career development programme, and I managed a graduate scheme in the Environment Agency. Both were rewarding for me and, I hope, for the trainees."
        },
        {
            "text": "Organisations like Defra depend almost entirely on people. In our part of Defra, we have around 1,200 colleagues, including project managers, digital developers, and research specialists."
        },
        {
            "text": "National Careers Week is all about ‘Empowering Positive Change through Careers Education’. We are a diverse workforce, and we encourage people from all backgrounds to join us. We’re recruiting all the time so keep an eye out on our jobs page to see the latest opportunities, or contact our Workforce team for a chat."
        },
        {
            "heading": 2,
            "text": "And finally……"
        },
        {
            "text": "My top take-away tip would be that if you want an opportunity, find it and grab it, make time for career discussions, use the opportunities available such as mentoring programmes, and make use of the expertise that is around you."
        },
        {
            "text": "If you love the environment as much as we do, and want to work in a dynamic place where you can develop and use your skills in a way that aligns with your passion, then join us to make a difference."
        },
        {
            "text": "In moments of doubt, think about what you have achieved and what you could achieve, and ask yourself – what’s the worst that can happen!"
        },
        {
            "text": "National Careers Week is a celebration of careers guidance and free resources in education across the UK. The aim is to provide a focus for careers guidance activity at an important stage in the academic calendar to help support young people leaving education."
        }
    ]
}