{
    "url": "https://traderemedies.blog.gov.uk/2022/03/07/industry-data-means-better-investigations-and-fairer-outcomes-for-trade-remedies/",
    "title": "Industry data means better investigations and fairer outcomes for trade remedies",
    "authors": [
        "John Kirkpatrick, Investigations Delivery Director"
    ],
    "categories": [
        "Investigations"
    ],
    "pub_date": "2022-03-07T14:36:06+00:00",
    "content": [
        {
            "text": "The law requires us to make recommendations to Ministers on measures that protect UK industries from unfair trading practices.  Before we can make recommendations, we need to understand how affected industries and markets operate.  Only then will we know the consequences of imposing, or not imposing measures."
        },
        {
            "text": "What we need to understand"
        },
        {
            "text": "If any UK industry fears it is being harmed by dumped or subsidised imports of goods from exporting nations internationally, the TRA needs to understand whether and how those goods come to be traded unfairly, and what harm is being done to UK industry."
        },
        {
            "text": "Dumping occurs when goods are sold at a price below their market value in their country of export; subsidy when Governments support their industries so they can sell at lower prices than would be sustainable in a fair market.  Both distort fair competition, but with the right evidence we can use tariff measures to redress the balance."
        },
        {
            "text": "To do so, we need to understand:"
        },
        {
            "text": "We also have to look at whether tariff measures that were transitioned over from the EU are suitable for the UK market.  In our review of these transitioned measures, we have to form a judgement on what would happen if those measures were removed.  Would imports flood in? At what price?  With what consequences?"
        },
        {
            "text": "But whether we are looking back at past imports or forward at potential future ones, we can only reach a conclusion with information and insight from industry participants – producers, importers, customers."
        },
        {
            "text": "Whatever your role in the value chain, you hold key data, information and insights into the value chain, costs, sales, prices and market behaviour that are useful to us in building a strong recommendation. It is also in your interests to help us understand your industry from your perspective and back that up with real data that illustrates what you are trying to explain to us."
        },
        {
            "text": "Using data from affected industries to make decisions"
        },
        {
            "text": "Take some recent or current examples: We need to understand whether apparently similar products  - biodiesel and renewable diesel, for example, or cast and forged road wheels - can substitute for each other, and under what circumstances."
        },
        {
            "text": "We look at the drivers of cost in a production process – how do the cost of raw aluminium, the costs of energy and the cost of customised dies affect the cost of different shaped aluminium extrusions. We also need to understand how and why customers buy particular products – what other considerations besides price influence stockholder choices of where to buy steel products."
        },
        {
            "text": "We try only to ask for data we know we will need.  And while we tend to specify quite closely what we want, we recognise that can also be challenging.  So we always encourage people to talk to us about what they can provide, to make it easier for them to contribute to an investigation."
        },
        {
            "text": "We use your data to reach evidenced conclusions and explain publicly how we have reached them.  We must publish the evidence we have used.  This is why we need everyone who provides us with information to submit it through our online Trade Remedies Service (TRS).  Importantly, we also ask you to give us a non-confidential version of your submissions.  That may sound laborious.  But it’s really important.  We can’t make recommendations that will dramatically affect people’s businesses without being transparent with the evidence our recommendation is based on.  If the decision impacts on your business you have the right to expect that. We are also obliged by law to respect the confidentiality of information.  Again, if it were your information you’d expect that too.   And it’s you, the people, who supply us with information who are in the best position to judge what’s confidential in it and what’s not."
        },
        {
            "text": "So there’s always a balance to strike that respects both those obligations. But if we don’t receive non-confidential versions of submitted evidence from interested parties, we can’t publish it and may not be able to rely on that evidence, so the effort to put it together goes to waste.  Worse still, arguments contrary to your business interests may appear to carry more weight."
        },
        {
            "text": "We can help UK businesses and industry sector representatives present  your data in ways that we can share it whilst maintaining confidentiality.   And we are always prepared to advise and show you  what a good contribution to an investigation looks like in practice.  We will be sharing some examples here soon,"
        },
        {
            "text": "Sharing your company data with us means better analysis, better evidenced findings and fairer outcomes from trade remedies investigations"
        },
        {
            "text": "Access the Trade Remedies Service. View case files, register your interest or raise a new case on the TRA’s online service."
        }
    ]
}