{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2022/03/07/integrating-scientific-research-into-government-grey-parrot-model/",
    "title": "Integrating scientific research into government: Grey Parrot Model",
    "authors": [
        "Magda Osman",
        "Dzhordzhio Naldzhiev"
    ],
    "categories": [
        "Collaborating & Networking",
        "Guest Blog"
    ],
    "pub_date": "2022-03-07T10:10:18+00:00",
    "content": [
        {
            "text": "In a recent study researchers found that African grey parrots show a remarkable willingness to help their peers achieve their goals by lending a wing, so to speak. Inspired by this example, we gave our model the name in honour of the grey parrot. In this blog we are excited to tell you about it."
        },
        {
            "text": "Opening two unlocked doors with one key"
        },
        {
            "text": "We had two objectives. First, to find creative ways to help early career researchers contribute to reducing current evidence gaps that the civil service has identified using a low-cost, high-risk, high-reward model. Second, to incentivise those who want to generate impactful research by allowing them access to relevant policy questions."
        },
        {
            "text": "Grey Parrot Model"
        },
        {
            "text": "A recent review of Government Science Capability outlined the need for developing more effective models for integrating scientific and engineering expertise and embedding it into policymaking. Following this we made an enquiry via the Research Hub, with a director of an MSc programme to explore potential project collaborations and to trial something new- our Grey Parrot Model."
        },
        {
            "text": "This model develops interdisciplinary knowledge whilst nurturing UK capacity and capability in terms of early career scientists and engineers. It educates them at an early stage in their careers about the delivery of research for policy.  The value to academia is that this self-contained model gives early career researchers experience in running a small-scale project that does two things: 1) produces high quality publishable research and 2) translates and communicates the work to policy professionals to identify where it could have impact. The value to the civil service is that the model utilises subject specific expertise to provides outputs that have been peer reviewed by experts."
        },
        {
            "text": "This model adopts the UK Innovation strategy framing the UK as a “hub for innovation” by creating an innovative ecosystem of knowledge that realises the potential of UK STEM expertise. Our role in setting up the model is to act as ‘knowledge brokers’ that translate knowledge from STEM to the civil service."
        },
        {
            "text": "The model represents GSE Profession Strategy across all of its pillars: developing expertise, allowing scientists to gain broader experience, nurturing GSE talent and developing GSE leadership. It puts interdisciplinarity at the centre and allows the cross-pollination of ideas."
        },
        {
            "text": "We’ve reviewed evidence on methods of engagement with experts and for this reason it doesn’t matter what grey parrots call their academic home, as long as they have the expertise to drive forward innovative research."
        },
        {
            "text": "Our Grey Parrot model is a work in progress, so we welcome comments and ideas to improve it further. We also invite you to explore an opportunity to work with us on using the model."
        },
        {
            "text": "If you would like to know more about the Grey Parrot Mode, and how to contribute, or implement a similar model, then please contact us: dzhordzhio.naldzhiev@beis.gov.uk or magda.osman@beis.gov.uk"
        },
        {
            "text": " "
        },
        {
            "text": "Dzhordzhio and Magda work in the Office for Product Safety and Standards (OPSS), the national regulator for all consumer products (except vehicles, medicines and food) and legal metrology. OPSS is also building our capabilities in the process of becoming the new National Construction Products Regulator. "
        }
    ]
}