{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2022/03/07/international-womens-day-breakthebias/",
    "title": "International Women’s Day: #Breakthebias 8th March 2022",
    "authors": [
        "Jamal Arabi"
    ],
    "categories": [
        "Diversity & Inclusion"
    ],
    "pub_date": "2022-03-07T17:21:12+00:00",
    "content": [
        {
            "text": "International Women’s Day is a global day of celebration for the social, economic, cultural and political achievements of women. This day is an opportunity to celebrate the progress made towards achieving gender equality around the world. From the development of COVID-19 vaccines to the mitigation of climate change female scientists are making vital contributions to the world we live in. It is important to take this opportunity to celebrate the contributions women make to the science and engineering space and understand ways in which we can do more to support the empowerment of women."
        },
        {
            "text": "The official International Women’s Day 2022 campaign theme is #BreakTheBias. Together we should strive for a world free from bias, stereotypes and discrimination. We should strive for a world that is diverse, equitable, and inclusive and a world where difference is valued and celebrated. Strike the #Breakthebias pose and share on social media using the hashtag."
        },
        {
            "text": "The United Nations are marking the day under the theme “Gender Equality today for a sustainable tomorrow” and a call for climate action for women, by women. As women and girls bear the burden of climate impacts, they are also essential to leading and driving change in climate adaption, mitigation and solutions."
        },
        {
            "text": "This year the Action Coalition for Feminist Action for Climate Justice is helping drive investment with a focus on financing for gender-just climate solutions, increasing women’s leadership in the green economy, building the resilience of women and to climate impacts and disasters and increasing the use of data on gender equality and climate. Without the inclusion of half of the world's population, it is unlikely that solutions for a sustainable planet and a gender equal world tomorrow will be realised."
        },
        {
            "text": " "
        },
        {
            "text": "International Women’s Day events across the science and engineering space"
        },
        {
            "text": "Break the Bias: Women in STEM"
        },
        {
            "text": "Join us on Wednesday 9th March at 12:00pm for our Virtual Break the Bias: Women in STEM webinar, to discuss:"
        },
        {
            "text": "Register here"
        },
        {
            "text": " "
        },
        {
            "text": "Registration for our next Women in COG lunchtime event of 2022, is open! "
        },
        {
            "text": "On International Women’s Day, Tuesday 8th March, from 12:15 to 13:00"
        },
        {
            "text": "Women in COG is a supportive network to share experience and knowledge and to promote science careers for women and girls. The next event is hosted by Colby Benari- a passionate leader and CEO of In2scienceUK, a charity dedicated to empowering young people to choose STEM. She has over ten years of experience of developing programmes to promote diversity in higher education and research as well as building career pipelines to increase access to the full range of opportunities available in STEM."
        },
        {
            "text": "This event will feature a conversation about In2Science and in particular, how they organise summer placements for young people to promote social mobility and diversity in STEM, followed by an informal Q&A."
        },
        {
            "text": "Please join this event if you wish to hear more and think you may be able to help, everyone (regardless of gender) is welcome to attend."
        },
        {
            "text": "If you would like to attend, please register here"
        },
        {
            "text": " "
        },
        {
            "text": "Webinar: Celebrating Women Working In STEM On International Women’s Day (Supported By RAF Engineering)"
        },
        {
            "text": "Please join us on International Women’s Day to celebrate talented women at all stages of their career. We will do so by showcasing the variety of roles, career progression opportunities and best practice within RAF Engineering. This webinar aims to celebrate and promote workforce diversity by discussing how to attract, develop and sustain women in engineering and technological roles. The session will also shine a spotlight on inspirational role models at entry, mid-career and leadership level within RAF Engineering."
        },
        {
            "text": "Register here"
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}