{
    "url": "https://mojdigital.blog.gov.uk/2022/03/07/my-career-path-college-drop-out-to-delivery-cheerleader/",
    "title": "My Career Path: College Drop Out to Delivery Cheerleader",
    "authors": [
        "Nic Macken"
    ],
    "categories": [
        "National Careers Week"
    ],
    "pub_date": "2022-03-07T15:01:43+01:00",
    "content": [
        {
            "text": "Why did you choose a digital role?"
        },
        {
            "text": "While I was working in an IT user support role I’d been working alongside colleagues in digital for a number of years so this had got me interested in Agile ways of working and how digital delivery was done with multi-disciplinary teams. "
        },
        {
            "text": "Having this insight allowed me to learn about digital professions and that not all roles in digital are necessarily ‘techy’ roles and in fact, I recognised I had many transferable skills that would map across to something like Product or Delivery and the more I learnt about Delivery Management and spent time shadowing DM’s that just became the natural fit for me. "
        },
        {
            "text": "What has your career path been? "
        },
        {
            "text": "I left school at 16 with a small handful of GCSE’s, tried college but quickly decided it wasn’t for me, and looking back now I realise that a traditional classroom based education has never been a good fit for me. I already had a Saturday job so I took on some extra hours and was placed in the office doing basic admin duties. "
        },
        {
            "text": "This grounding then allowed me to start applying for full-time administration roles, at which point my mum, also a Civil Servant with 40 years of service! told me that the Benefits Agency was recruiting Admin Assistants. I worked in the Preston Income Support office for about a year, filing, photocopying and filling in milk tokens before I decided I’d like to try something different. So I applied for an Admin Assistant role with the Prison Service at HMP Wymott but I didn’t get it! The HR manager was not impressed with my F in GCSE Maths, I’m not really sure why a GCSE in Maths was needed for filing prisoner records! But as it turned out the person they did offer the job to turned it down and I was next on the list."
        },
        {
            "text": "So that was the start of my career in the Prison Service and on 5th Jan 1998. I walked into a prison for the first time as an 18-year-old who wasn’t even allowed her own set of keys! I gained a promotion to an Admin Officer and did lots of varied administrative roles before transferring to Prison Service HQ in London in 2000 and then leaving the service for a short time before returning to HMP Garth in 2002 when I moved back to Preston. I took another break from the service where I thought I’d go and try something new with the NHS, but ended up returning to the Prison Service in 2006 back at Garth where I was promoted to Executive Officer and became the IT Manager. After a couple of years at Garth, I transferred to HMP Hindley as the IT Manager and it’s from there that probably one of the first big changes of my career came along."
        },
        {
            "text": "The Prison Service was replacing its aged prisoner database with a system called Prison-NOMIS and they needed a cohort of national trainers to travel to all establishments and spend 6 to 8 weeks on-site delivering all the training modules to staff. I travelled around prisons for just over a year delivering training during the rollout, towards the end of the rollout a national application support team was established to provide 2nd line support to prison staff using NOMIS. I applied for an application support manager role based at HMP Kirkham and was successful in gaining promotion to HEO. I remained in this role for 10 years and during that time the MoJ was established along with MoJ Digital in 2016. HMPPS Digital was established as part of MoJ Digital to begin the in-house building of digital services for the Prison and Probation Service and alongside that to take on the responsibility for the eventual replacement of Prison-NOMIS."
        },
        {
            "text": "The introduction of Agile ways of working as part of the now established MoJ Digital started giving me an insight into new roles within Digital which previously I thought were only done by contractors or suppliers and were unobtainable to me as a Civil Servant. I very quickly realised that Delivery Management felt like a natural fit for my skills and experience and I applied and was successful in becoming an Associate Delivery Manager in October 2020 before progressing to Delivery Manager in December 2021 and gaining promotion to a Grade 7. "
        },
        {
            "text": "What qualifications have you needed to gain for this role? "
        },
        {
            "text": "Personally, I don't believe you need any qualifications to be a Delivery Manager.  Don’t get me wrong there are lots of qualifications you can obtain, Certified Scrum Master for example, but these are not essential to ensure success as a DM. Everything you need you can learn on the job by spending time with people experienced in the role, by being an active member of your Community of Practice. Being a DM is about people, working with teams, bringing them together to be successful and to deliver. You need to be able to quickly tune into individuals' personalities so you can build a rapport and provide a team environment where everyone feels valued and safe and can concentrate their energies on delivery outcomes. "
        },
        {
            "text": "You need to be curious, to be the person on the team that’s not afraid to ask difficult questions or sometimes daft questions! You need to be an advocate for your team and be confident in protecting your team from distracting noise from stakeholders or senior management that may disrupt the focus on delivery. If there are any qualifications needed, they’re not the ones you’d gain in a classroom or by attending a course. They’re the ones you pick up along the way through experience, by trying things and making mistakes and learning from them, by being a human being."
        },
        {
            "text": "What barriers/ challenges have you faced and how did you overcome them?"
        },
        {
            "text": "I feel the only barriers have been the ones in my own head! The little imposter on my shoulder that tells me I’m not good enough, I’m not clever enough, who do I think I am! But being part of a supportive community and surrounding yourself with cheerleaders helps with that, reminds you that you deserve to take up space in your chosen profession."
        },
        {
            "text": "Are there any expectations you had about this career path that you have found differed from reality, in either a good or bad way?"
        },
        {
            "text": "I thought I’d need lots of technical knowledge, that I’d need to know about code. I thought everyone who worked in digital would have come through a university route and I’d feel like a total uneducated dunce all the time."
        },
        {
            "text": "What do you love/ excites you most about working in a digital role?"
        },
        {
            "text": "In digital we’re at the front line of a lot of transformation within the MoJ and that in itself is exciting. We’re able to make tired and frustrating processes so much simpler for colleagues in front-line roles, to take away the pain of manual paper processes or wrangling a humongous spreadsheet. Hearing the feedback from users when they see a new digital service for the first time that’s going to make their lives so much easier is the most exciting part."
        }
    ]
}