{
    "url": "https://educationhub.blog.gov.uk/2022/03/national-careers-week-what-you-need-to-know-about-your-choices-after-school/",
    "title": "National Careers Week: What you need to know about your choices after school",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Careers",
        "Further education"
    ],
    "pub_date": "2022-03-07T12:12:17+00:00",
    "content": [
        {
            "text": "National Careers Week, aims to empower young people to make informed choices about their next steps by making sure they are getting the best careers advice and information possible."
        },
        {
            "text": "Deciding which option to take after you have completed your GCSEs, A levels or T Level can be daunting but there is plenty of support out there to help you choose the route that is right for you – whether you are planning on starting your first job or moving onto further study."
        },
        {
            "text": "There is no one route to success, so it is important that you consider all your options before making this important decision."
        },
        {
            "text": "Here are some options you could consider."
        },
        {
            "heading": 3,
            "text": "Why should I consider taking T Levels?"
        },
        {
            "text": "T Levels – the new technical post-16 qualification equivalent to three A levels – are now available in schools and colleges across England."
        },
        {
            "text": "These pioneering qualifications offer students a mixture of classroom study and ‘on-the-job’ experience during industry placements of at least 9 weeks, so they gain the skills and knowledge they need to progress into work, further study, or an apprenticeship."
        },
        {
            "text": "With course content designed with over 250 employers including Fujitsu and Amazon you can be sure these high-quality qualifications will set you on the path to a rewarding career. If you have not yet achieved a minimum standard in maths and English, you will also be able to get these crucial qualifications as part of your T Level."
        },
        {
            "text": "Speaking to the Education Secretary last year, Greg, a T Level student studying at Barnsley College told him:"
        },
        {
            "text": "Click here to find out more about why you should consider T Levels."
        },
        {
            "heading": 3,
            "text": "Why should I consider a traineeship?"
        },
        {
            "text": "Traineeships offer a fantastic opportunity for young people aged 16-24 to develop skills on the job, splitting their time between the classroom and practical learning."
        },
        {
            "text": "These programmes last between 6 weeks and a year (although most are shorter than 6 months) and give students the chance to get a real feel for a particular profession."
        },
        {
            "text": "Whether you are considering a career in business administration, web development or the beauty industry, these programmes bridge the gap between school,  further study or work – giving you the chance to make sure this is the right career path for you, and helping you build up confidence before committing to a longer-term course, apprenticeship or job."
        },
        {
            "text": "Milita, a hair dressing trainee in Romford, is about to finish her traineeship and take up an apprenticeship. She said:"
        },
        {
            "text": "Research shows that 66% of trainees get a job, take up an apprenticeship or go on to further study within 6 months of completing their programme."
        },
        {
            "text": "Traineeships help young people build goals on their terms while giving employers the skilled workforce they need to succeed. Find out more here."
        },
        {
            "heading": 3,
            "text": "Why should I consider an Apprenticeship?"
        },
        {
            "text": "Apprenticeships are paid jobs, which give thousands of people the opportunity to gain the skills and on-the-job experience needed to hit the ground running in their chosen profession."
        },
        {
            "text": "There have never been so many great apprenticeship options available in a diverse range of industries, including digital, construction, nursing, fashion, teaching or film and TV. There are options to train at every level right up to degree level, offering the chance to work in some of the country’s top companies."
        },
        {
            "text": "Alongside your on-the-job training, as an apprentice you will spend at least 20% of your time in off-the-job training with a training provider, such as a college or university, learning skills and building confidence for the workplace."
        },
        {
            "text": "Sophia, a Business Administration apprentice for Newcastle Building Society said:"
        },
        {
            "text": "There are thousands of apprenticeship vacancies on offer – meaning you could pursue a career as anything from a space engineering technician to a junior advertising creative."
        },
        {
            "text": "Click here to find out more about why you should consider an apprenticeship."
        },
        {
            "heading": 3,
            "text": "Where can I find support and information?"
        },
        {
            "text": "For more information on the choices available to you visit:"
        }
    ]
}