{
    "url": "https://lifeathmrc.blog.gov.uk/2022/03/07/national-careers-week-becoming-a-grade-7-at-age-25/",
    "title": "National Careers Week – Becoming a grade 7 at age 25",
    "authors": [
        "Holly Chyba-Little"
    ],
    "categories": [
        "General",
        "Guest blog"
    ],
    "pub_date": "2022-03-07T10:00:30+00:00",
    "content": [
        {
            "text": "Its National Careers Week, so we’re sharing some great stories of our people and how they’ve developed their careers within HMRC and the wider Civil Service. Read on to find out about Holly’s journey."
        },
        {
            "text": "I don’t think many people grow up with the dream job of civil servant, I certainly didn’t, but stumbling into a civil service career was the best thing I’ve done. The breadth of learning and diversity of experience that the Civil Service provides has allowed me to find a job in HMRC that I genuinely enjoy and an environment where I can thrive."
        },
        {
            "text": "I initially applied for the Civil Service after completing my law degree and working in a café. I’d realised that I didn’t want a career in law but knew that I really wanted to help people. I looked at many different jobs, not really feeling that any of them looked like a fit for me until a role as a Work Coach in my local job centre was advertised. I was interested in the prospect of supporting individuals in finding opportunities and bettering their futures so was keen to apply. It also definitely helped, coming from hospitality, that the job was a Monday to Friday 9-5!"
        },
        {
            "heading": 2,
            "text": "My first role in the Job Centre"
        },
        {
            "text": "I was fortunate to get the job and started life as a work coach in 2017 at the age of 21. I loved the ability to spend every day talking to people from all walks of life and genuinely helping others. I found a real passion in supporting people in many creative ways and quickly began to take on more responsibility. Just over 12 months after I started, I was promoted to Work Coach Team Leader, overseeing a team of 11 work coaches. While this felt like a lot of responsibility and I sometimes doubted my own ability, I was supported by a fantastic team and felt able to put my own mark on the role."
        },
        {
            "text": "Working at the jobcentre was an incredible foundation in the Civil Service; it allowed me to be on the frontline of seeing how we, as civil servants, can genuinely change lives. It was in this role that I knew I wanted to create a long-lasting civil service career, particularly in helping others. I took energy from seeing members of my team grow in capability and confidence and keen to progress, I started exploring the options for a career in Human Resources."
        },
        {
            "heading": 2,
            "text": "A career change to HR"
        },
        {
            "text": "Despite having limited HR experience, I was encouraged by my managers to apply for the Fast Stream, a leadership development programme open to graduates – but also, any member of the civil service can apply without a degree. Being able to make a “career change” without leaving the Civil Service was a real bonus to me and something that has made me want to stay put!"
        },
        {
            "text": "I started my role as a Leadership Consultant supporting the Department for Work and Pensions HR community in developing leadership capability across the department. Through accessing mentorship, connections, experience and qualifications, I was encouraged to apply for a grade 7 role after a year in leadership."
        },
        {
            "heading": 2,
            "text": "Becoming a grade 7 at 25"
        },
        {
            "text": "I started my current grade 7 role as an Organisation Design and Development Lead for HMRC at the age of 25, just 4 years after joining the Civil Service. The Civil Service paid for me to complete my level 7 qualification in HR Management, allowing me to become a CIPD chartered member on completion which was great. In my role I support HMRC to ensure it is designed in the most appropriate way to deliver its objectives and be a great place to work where people feel valued."
        },
        {
            "text": "Over the last 18 months, I have led large scale projects impacting the whole of HMRC. I feel that my work is genuinely appreciated, surrounded by colleagues with an incredible breadth of experience and encouraged to take personal responsibility for exciting and important areas of work. HMRC provides an outstanding benefits package; a highly competitive salary, the experience of travelling around the UK to meet fascinating clients and the ability to work both flexi time and hybrid working: meaning I split my time between the office and home. My job gives me a genuine purpose and a reason to get up every morning knowing I make a difference to the citizens of the UK. It also gives me a great work-life balance helped by a great annual leave allowance, which currently allows me to take a weekend break abroad every other month!"
        },
        {
            "text": "For those who have never considered a career in HMRC, I can’t recommend highly enough seeing if there is a role to suit you! There are a wide variety of jobs available, and the support given to developing your career is second to none, you really can set your own direction and goals. Also, don’t doubt how transferrable your skills from other jobs are and if you’re curious, give it a go. You’ve got nothing to lose and everything to gain!"
        }
    ]
}