{
    "url": "https://civilservice.blog.gov.uk/2022/03/07/start-an-exciting-career-in-government-cyber-security/",
    "title": "Start an exciting career in government cyber security",
    "authors": [
        "Civil Service Government Security Professions Team"
    ],
    "categories": [
        "A Skilled Civil Service",
        "An Ambitious Civil Service",
        "An Innovative Civil Service",
        "Apprenticeships"
    ],
    "pub_date": "2022-03-07T12:34:16+00:00",
    "content": [
        {
            "heading": 3,
            "text": "The Civil Service is recruiting women as cyber security apprentices. If you want an exhilarating career, rich with opportunities and excellent training to progress, don’t delay - apply by 10 March."
        },
        {
            "text": "My name is *Chloe and I’m a government cyber security apprentice who works in the Department for Work and Pensions (DWP) in Manchester."
        },
        {
            "text": "If you’re reading this wondering, “Should I apply for a Government Security Cyber Apprenticeship?” hopefully my experience can help you. I’m currently in my second year of the Government Security Cyber Apprenticeship (level 4), placed within DWP and I can genuinely say it’s been fascinating. I have learned loads and enjoyed it immensely."
        },
        {
            "text": "Leap of faith"
        },
        {
            "text": "My pathway into cyber security wasn’t exactly conventional. Other than a passion for cyber security and an A-Level in IT, I lacked a strong technical background. I read history at university and after graduating, worked in hospitality for many years. When the pandemic began, I was working as a full-time nanny. My lack of IT experience was my biggest concern when applying for the apprenticeship, but I decided to take a leap of faith and applied anyway."
        },
        {
            "text": "Opens doors"
        },
        {
            "text": "So what do I do day-to-day? My apprenticeship has opened many doors and I’ve discovered that it can be whatever you choose to make of it. I’ve managed to get a range of experience across the different cyber role families including security monitoring, vulnerability management, threat intelligence and risk analysis. "
        },
        {
            "text": "Hands-on experience"
        },
        {
            "text": "I currently work within a Security Operations team within the DWP Digital directorate. I’ve had the opportunity to get hands-on experience with a multitude of ‘best of breed’ security tools - from SIEM solutions to intrusion prevention systems and vulnerability scanners. "
        },
        {
            "text": "The apprenticeship has enabled me to apply my learning to live projects in my role. Being a kinaesthetic learner, I’ve learned the most by doing and asking my team many questions which they’ve been very supportive with. My management and colleagues are a great sounding board for advice and support and I’m always encouraged and given constructive feedback which has helped me learn so much."
        },
        {
            "text": "Malicious actors"
        },
        {
            "text": "The DWP is the UK’s biggest public body. The cyber security work we carry out in DWP helps protect more than £135 billion which is paid out to citizens. We ensure these funds go to the most vulnerable in our society and are not stolen or misdirected into the hands of malicious actors."
        },
        {
            "text": "DWP holds vast amounts of citizen data, so our systems and services must be secure and resilient against different attack vectors and threat actors. Another benefit of my apprenticeship is that it’s allowed me to contribute to this vital work learning on the job, whilst I earn a competitive salary. "
        },
        {
            "text": "Talented women"
        },
        {
            "text": "But it’s not just about the work; I joined a welcoming friendly team, always keen to help, support, encourage and answer my questions! Don't believe the dated stereotypical image of security services being filled with middle-aged, white men. It’s much more diverse than you think. "
        },
        {
            "text": "There are inspiring talented women of all ages and backgrounds, talent programmes and mentoring schemes with plans for the Civil Service to increase to recruit even more women as one of the UK’s most female-friendly employers. And once you’re in, it doesn't end there. You’re encouraged at every step to learn, develop and rise up the ranks where there are women at every leadership grade - which may come as another surprise! "
        },
        {
            "text": "The profession currently offers two cyber apprenticeships, one at level 4 and another at level 6. These schemes are a great opportunity to earn while you learn, whether you’ve recently left school or are looking for a career change like myself. Both schemes will help you to build your cyber security knowledge and take control of your own career. "
        },
        {
            "text": "Go for it"
        },
        {
            "text": "If you have a strong passion for cyber security, transferable skills and can communicate why you would be an asset to the Government Security Profession then I encourage you to submit an application. "
        },
        {
            "text": "Application process"
        },
        {
            "text": "If you’re successful in the initial stages of the application process, you’ll be invited to take part in an assessment. My top tip is to fully research and understand cyber security as an industry, and explore the challenges and threats it poses to public bodies and the government. "
        },
        {
            "text": "If you can effectively articulate how your skills, knowledge and experience will aid in protecting UK services, citizens and critical national infrastructure then you will stand every chance of doing well. This was a sentiment that was emphasised to me in my first week as a cyber security apprentice. During an early meeting, a deputy director highlighted the tangible and vital importance of the services we provide and our value as apprentices within that. This really resonated with me. "
        },
        {
            "text": "If you want to do meaningful work that impacts people’s everyday lives, then this is the right apprenticeship for you.  "
        },
        {
            "text": "Apply now - Applications close 11:55pm Thursday 10 March."
        },
        {
            "text": "*Chloe is a cyber security apprentice whose name is being withheld for security reasons."
        }
    ]
}