{
    "url": "https://services.blog.gov.uk/2022/03/07/what-to-expect-in-services-week-2022/",
    "title": "What to expect in Services Week 2022",
    "authors": [
        "Lisa Jeffery – Senior engagement and content lead, Cabinet Office",
        "Martin Jordan – former Head of Service Design, GDS"
    ],
    "categories": [
        "Events",
        "Service design",
        "Service transformation"
    ],
    "pub_date": "2022-03-07T14:28:05+00:00",
    "content": [
        {
            "text": "Services Week 2022 is taking place this week, from 7–11 March. It’s already the fourth annual cross-organisational UK public sector event series to discuss good public services. "
        },
        {
            "text": "Services Week 2022 is about growing service literacy and awareness of how great public services are designed. People will make connections across the sector, from policy to operations, from local to central government, from digital to beyond. User-centred designers can connect with those promoting change across the broader system and vice versa. People can learn, connect and network across the public sector. And joining up can help us all deliver better public services and outcomes for citizens. "
        },
        {
            "heading": 2,
            "text": "Connecting, learning and co-creating value across government and the public sector "
        },
        {
            "text": "Services Week 2022 will kick off with a welcome from senior public sector leaders, along with some case studies. During the week, various organisations will run sessions, covering everything from user-centred design in the NHS to policy design and the role of services in a Modern Civil Service. In addition, at midday each day, there will be a case study with various topics. "
        },
        {
            "text": "Benefits of hosting sessions include increasing awareness of your work, feedback and new connections to improve your work. Benefits of attending include learning about the work of others and understanding how that might relate to your own.  "
        },
        {
            "text": "Session running during the week can be explored on the open agenda and accessed by civil servants and public servants working across the UK. Formats include talks, training, workshops, presentations and more. As an open agenda, with 50 sessions hosted by people from 23 organisations (and counting), the lineup may continue to change. "
        },
        {
            "text": "Some sessions are open to everyone, while others require you to sign up for a place. Where possible, we will share session joining links on the #ServicesWeek channel on the cross-government Slack. And some sessions will also be available afterwards as recordings.  "
        },
        {
            "heading": 2,
            "text": "Why are we doing it? "
        },
        {
            "text": "People get involved for many reasons. Here’s what some of this year’s participants have told us about their experiences with Services Week in the past and what they are excited about this year: "
        },
        {
            "heading": 3,
            "text": "Lisa Trickey – Service Manager, Digital Strategy and Design, Dorset Council"
        },
        {
            "text": "“We love Services Week in Dorset and have been involved since the very first one. It creates a buzz to talk to the organisation about the benefits of service design. In the past, we’ve run taster sessions around the different skills used in design, shared learning from work taking place, and promoted accessibility which we want to have as a big focus again this year. Services Week helps us explain to the organisation that digital is about more than technology. It’s great to have the mix of work taking place across the country that you can hear about whilst providing a local focus.”"
        },
        {
            "heading": 3,
            "text": "Sarah Stokes, Senior User Researcher, NHS Business Services Authority (NHSBSA)"
        },
        {
            "text": "“At the end of the day, we need to build good services for users. Else why are we here! For me, I think we work with a lot of people who feed into service design and delivery, but this might not be their background. So to get things done well, we need to support their learning and development, which is why I’m helping facilitate the sessions. "
        },
        {
            "text": "I like the format. I can choose what I want to go to; there are a few formats depending on how I’m feeling, so it just makes it easier to get involved. There’s been a good mixture of ‘how-tos’ and ‘show and tell’ formats, so you can learn what to add into your own practice, and learn from other people. I feel like it’s been a relatively relaxed atmosphere too, which I prefer for learning anyway."
        },
        {
            "text": "I will be facilitating some sessions for the NHS Business Services Authority and helping publish Services Week as a whole in our organisation. I will run a series of lightning talks on key user-centred design – User Centred Design (UCD) – topics, so I’m just doing the ops stuff! But we have a few mint people from our UCD community here in the NHSBSA delivering lightning talks on key UCD topics, like Service Standards – both NHS and CDDO – inclusive design, selecting appropriate research methods, and even participant recruitment and research ops.”"
        },
        {
            "text": "Jeffrey Allen - Lead Service Designer, Ministry of Justice"
        },
        {
            "text": "“Services Week is always one of the highlights of the year for me. There’s so much interesting work happening all across government — it’s an excellent opportunity to spend some time being inspired by everyone else and learning from how others are digging into gnarly problems. A few years ago, we ran a user-centred policy design workshop at Services Week, and I’ve been to loads of exciting sessions throughout my years in government."
        },
        {
            "text": "This year we’ll be holding a series of talks and an afternoon workshop bringing together colleagues from all across government to look at the whole journey through the justice system. From early life to arrest and charge to trial and sentencing, custody, and then serving a sentence back in the community on probation. We want to understand what the whole journey looks like, identify who’s working on what aspects of it, and highlight places where one team’s work is dependent on information or services being worked on by other teams. We hope the session will help us build our knowledge of the system and make contact with others working on parts of the system relevant to what we’re working on. That’s the first step toward a more joined-up justice system.”"
        },
        {
            "heading": 2,
            "text": "Get involved "
        },
        {
            "text": "There’s still time to get involved in Services Week 2022. You can host a session or release a recording of one and add it to the open agenda. There are presentation templates, backgrounds and posters to help you promote your sessions and share Services Week with colleagues. You can also share the agenda with colleagues and invite them to attend sessions. "
        },
        {
            "text": "We will be publishing blog posts during the week. Subscribe to the Services in government blog to receive email notifications about them. You can also follow #ServicesWeek for updates and connections during the week. "
        },
        {
            "text": " "
        }
    ]
}