{
    "url": "https://civilservicelocal.blog.gov.uk/2021/06/17/a-modern-civil-service-a-new-vision-for-all-of-us/",
    "title": "A Modern Civil Service - a new vision, for all of us",
    "authors": [
        "Heidi Stephens"
    ],
    "categories": [
        "A National Spotlight",
        "Cymru Wales",
        "East, South East & London",
        "Midlands",
        "North East, Yorkshire and the Humber",
        "North West England",
        "Northern Ireland",
        "Scotland",
        "South West England"
    ],
    "pub_date": "2021-06-17T15:46:05+00:00",
    "content": [
        {
            "text": "Across the Civil Service Local team from Scotland to Wales, from the South West to the North and to the East we have been working with the Modernisation and Reform Team contributing to the new vision for the Civil Service. We are all signed up as Modernisation and Reform Champions and highly recommend you consider joining that network and make your voice be heard. The links can be found at the end of this blog. You will know that we have been closely involved with promoting and contributing to A Brilliant Civil Service over the last few years and we are excited with this inspiring new movement towards making a truly skilled, innovative and ambitious Civil Service, one fit for the modern age."
        },
        {
            "text": "You might have heard about the launch of the renewed vision for the Civil Service, A Modern Civil Service, and the Declaration on Government Reform. But what does this mean for the Civil Service and all of us?"
        },
        {
            "text": "Over the last year, many of you have shared your views on how to build on the brilliant work of the previous 12 months and meet our future challenges. You have been involved in discussions, contributed to surveys and attended Civil Service Local sessions. Your input has helped shape the renewed vision and is reflected in the declaration."
        },
        {
            "text": "The declaration outlines how, in partnership with Ministers, civil servants will shape a shared vision for reforming government. It sets out the priorities for reform covering people, performance and partnership:"
        },
        {
            "text": "This focus on people, partnership and performance is what will enable us to achieve our vision of A Modern Civil Service that is more skilled, innovative and ambitious."
        },
        {
            "text": "https://www.gov.uk/government/publications/a-modern-civil-service"
        },
        {
            "heading": 3,
            "text": "What can you do?"
        },
        {
            "text": "All civil servants can play a part in helping to build A Modern Civil Service, irrespective of grade, location or role. To begin with, you can take the time to understand how the new vision aligns with you and your work. How are you already being skilled, innovative and ambitious? Are there areas where you could go further? What great new ways of working have you identified recently? Can you share them with a colleague?"
        },
        {
            "text": "In consultation with civil servants across government, a resource pack has been designed for you to use with your teams and colleagues to help answer some of these questions. There are also six actions that we can all take to help build A Modern Civil Service. Please see your departmental intranet for more information and for more resources."
        },
        {
            "heading": 3,
            "text": "How else can you get involved?"
        },
        {
            "text": "But it doesn’t stop here. This is a movement for change that all civil servants can feel a part of and there are several ways you can get involved:"
        }
    ]
}