{
    "url": "https://publicpolicydesign.blog.gov.uk/2021/06/17/how-to-set-up-a-multidisciplinary-policy-design-team/",
    "title": "How to set up a multidisciplinary policy design team",
    "authors": [
        "Andrew Knight"
    ],
    "categories": [
        "Research"
    ],
    "pub_date": "2021-06-17T12:00:43+01:00",
    "content": [
        {
            "text": "There is no right way to establish a multidisciplinary policy design team. The remit and profile of the team will differ based on the kind of problems or opportunities that you seek to address. However, it is useful to understand what these teams look like across government."
        },
        {
            "text": "This blog post tells the story of how multidisciplinary policy design is being practiced based on the experience of people from labs in the Department for Education, the Department for Work and Pensions, the Foreign, Commonwealth and Development Office, Home Office, HM Revenue & Customs, the Ministry for Housing, Communities and Local Government & the Ministry of Justice."
        },
        {
            "heading": 2,
            "text": "A diverse set of knowledge and skills"
        },
        {
            "text": "Multidisciplinary policy design teams tend to dynamically form themselves around subject matter expert policymakers when they are commissioned to work on new policy questions, so the teams are usually composed of just technical experts. Subject matter expert policymaker collaborate with the team full time or target their input in a more piecemeal way."
        },
        {
            "text": "The types of technical experts in these units vary from organisation to organisation, but they tend to have a core of policy designer, user researcher, service designer, often supported by a delivery manager. Other types of technical expert that are sometimes included in the team are: content designer, UX, research ops, business analyst, data analyst, social researcher, behavioural scientist, developer, technical architect."
        },
        {
            "text": "For most types of technical expert role, junior staff are graded EO-SEO and senior roles are graded G7. The only exception is the policy designer role where senior roles are often graded at G6 because there is a limited pool of people who are able to deploy design work in a government environment. Many teams buddy junior and senior staff together to enable professional development."
        },
        {
            "text": "Small multidisciplinary policy design teams have 5-10 people, whereas large multidisciplinary teams have 18-25 people. The teams tend to sub-divide into several smaller deployable units that can independently tackle policy questions. These units have between 2 and 6 people each and can be scaled up or down depending on the size or nature of the policy question or the time to reach a conclusion. These units tend to deliver 1 project per quarter."
        },
        {
            "text": "The cost of the team is usually centrally funded and is provided as a free-to-use service for policymaking teams. About half the teams have a discretionary budget to fund activities like recruiting research participants. Their budget is between £40,000 and £65,000 per year."
        },
        {
            "text": "The heritage of most multidisciplinary policy design teams derives from design methodologies most recently found in digital industries. Most teams are still underpinned by digital funding streams, but policy teams are beginning to fund these teams too. The teams themselves have a clear desire to make a cultural shift away from digital and towards policy."
        },
        {
            "heading": 2,
            "text": "Day-to-day working practices"
        },
        {
            "text": "Multidisciplinary policy design teams are usually commissioned to work on a policy question when they are approached directly by a policy team to help with a live issue. In fewer cases, teams plan their own pipeline of work or portfolio."
        },
        {
            "text": "Most multidisciplinary policy design teams have a prioritisation process for acceptance and ordering the delivery of work with criteria based around value and deliverability. There is often oversight of this process at director level."
        },
        {
            "text": "Some infrastructure is essential for multidisciplinary policy design teams to operate successfully. Staff need opportunities to improve professional capability like communities of practice, training, ‘show and tells’, etc. The teams also need recruitment infrastructure, and communications and content design support."
        },
        {
            "text": "Other types of infrastructure are frequently established like: research banks, research participant panels and recruitment agencies, call-off contracts with suppliers of research or design services, service maps or road maps, and licences for digital tools."
        },
        {
            "heading": 2,
            "text": "A new trend for specialisation"
        },
        {
            "text": "There is an increasing trend for multi-disciplinary policy design teams to be more specialised. Some years ago when the original ‘labs’ were being established they tended to serve whole organisations or wider. However the current trend is for labs to develop expertise in a particular policy area, like prisons, schools, tax, etc."
        },
        {
            "text": "Multidisciplinary policy design teams that do this are able to develop deep knowledge on users of services and the system environment, plus they are able to build infrastructure to work more productively."
        },
        {
            "heading": 2,
            "text": "New teams face common problems"
        },
        {
            "text": "There is good evidence that policymakers want to design policies and services with citizens. But the Civil Service’s maturity for this way of working is sometimes low. There are a number of frequently made mistakes that dampen successful implementation, which should be avoided."
        },
        {
            "text": "Often budgets are tight and there is insufficient funding to understand policy at the inception stage. But by investing in multidisciplinary working at an early stage, policy can be de-risked at an early stage."
        },
        {
            "text": "Public organisations often don’t invest in the pipeline of multidisciplinary people. Just like subject matter expert policymakers, technical experts like researchers, analysts and designers also need communities of practice and structured career progression to thrive."
        },
        {
            "text": "Culture clashes can inhibit collaboration. Policymakers and technical experts can be unfamiliar with each other's way of working and terminology. Strong and visible support from leaders for collaboration, diversity and experimentation can be a powerful tool for evolving policymaking culture."
        },
        {
            "text": "The back office can strangle innovation. Overbearing governance, slow procurement and slow recruitment are all barriers to bringing people together rapidly. Back office teams are often designed to assure major projects, not policy at the inception stage. Their support for multidisciplinary teams should be proportionate. Multidisciplinary teams tend to benefit from leaders providing a certain amount of air cover or licence to enable rapid deployment."
        }
    ]
}