{
    "url": "https://publicguardian.blog.gov.uk/2021/06/17/looking-at-the-customer-journey/",
    "title": "Looking at the customer journey",
    "authors": [
        "Kat Morrison"
    ],
    "categories": [
        "Digital",
        "Future planning",
        "Insights",
        "OPG Team",
        "Research"
    ],
    "pub_date": "2021-06-17T13:10:07+01:00",
    "content": [
        {
            "text": "Katrina Morrison and the OPG Insights Team have been carrying out work to create a “customer journey map”.  Here we discuss the different experiences of our customers and what’s next for the project."
        },
        {
            "text": "As part of  OPG’s 2020 – 2021 business plan we pledged to “Continue our research to find out why more people do not take out LPAs, what support our customers need and how we can support them.” "
        },
        {
            "text": "We made this pledge because we recognise that it’s important to learn about the experiences of customers. We want to understand what works well in our processes but also the barriers or sticking points, so we can continue to improve our services."
        },
        {
            "text": "Our customer journey mapping project is part of fulfilling this pledge."
        },
        {
            "text": "We’re broadening our insight into the customer journey and how we can better support our customers through their LPA application."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "What did we do?"
        },
        {
            "text": "Our first step was to carry out interviews with donors and attorneys who have recently registered their LPAs."
        },
        {
            "text": "We transcribed and analysed this interview data which enabled us to ‘map’ the different experiences or ‘journeys’ of using our service. From deciding to start the process of making an LPA, through to the arrival of the registered documents, and if necessary – using them."
        },
        {
            "text": "This has been mapped in a visual format but has also enabled us to draw out insights such as thoughts, feelings, barriers and frustrations."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Why have we been doing this?"
        },
        {
            "text": "This process allows us to understand not only the difficulties or ‘pain points’ that customers might experience, but also the wider context in which they are choosing to register an LPA."
        },
        {
            "text": "For example, has there been a specific trigger for the LPA being taken out? Has it been an emotional experience?"
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Insights from the journeys so far\nWe discovered:"
        },
        {
            "text": "We’ve uncovered plenty of misconceptions too, such as:"
        },
        {
            "text": "\"I don't need a Health & Welfare LPA; my family will be able to make decisions for me”"
        },
        {
            "text": "“I don’t need a Health & Welfare LPA as I wouldn’t realistically disagree with doctors”"
        },
        {
            "text": "“On our deaths, my son will contact the Certificate Provider”"
        },
        {
            "text": "We‘ve also learned about the emotional journey of customers. Such as the relief of receiving their LPA, to the stress of family conflicts and attorney choice. We’ve also uncovered plenty of ‘customer pain points’, which are particular stages in the process which cause frustration and confusion."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "What’s next?"
        },
        {
            "text": "We are currently finalising the visual customer journey maps for donors and attorneys, which will help facilitate conversations about service and customer experience improvement."
        },
        {
            "text": "We are currently planning information sharing sessions to present these to teams across OPG. This will facilitate discussion to identify improvements we can make in our processes and activities that could benefit our customers."
        }
    ]
}