{
    "url": "https://hmlandregistry.blog.gov.uk/2021/06/17/my-pride-in-our-big-family-community/",
    "title": "My pride in our big family community",
    "authors": [
        "James Wand, Deputy Chair, Assured"
    ],
    "categories": [
        "Working at HM Land Registry"
    ],
    "pub_date": "2021-06-17T10:24:45+01:00",
    "content": [
        {
            "text": "In what has been a testing year for colleagues, this June HM Land Registry is celebrating Pride month, a time of reflection and rejoicing for LGBTQI+(lesbian, gay, bisexual, transgender, queer, intersex +) colleagues and allies. At the heart of this celebration is the concept of community, something which all of us can appreciate given the events of the past 12 months."
        },
        {
            "text": "For it is community that has the power to lift spirits, promote tolerance and provide acceptance; and throughout the pandemic, it is a sense of community which has bound us together – both inside the workplace and out – and shown that for all our differences, we are strongest when everyone is supported and looked after."
        },
        {
            "text": "This feeling of community is one which HM Land Registry has worked hard to foster, nurture and grow, in all shapes and sizes."
        },
        {
            "text": "I first joined HM Land Registry at the beginning of the year as a Senior Policy Coordinator in our Chief Executive and Chief Land Registrar’s Office, working across government on evolving priorities and the impact of government initiatives on the organisation. In this role, I have had the pleasure of working with talented, knowledgeable and interesting colleagues from across data, strategy, operational and legal teams; and in this time I have begun fully to appreciate what was first mentioned to me as a new starter: that HM Land Registry feels like one big family community."
        },
        {
            "heading": 2,
            "text": "Supporting others, celebrating diversity"
        },
        {
            "text": "The Assured network here in HM Land Registry acts as an outlet and support system for LGBTQI+ staff and allies. I first discovered the network some months ago and delved in to the message boards providing access to opportunities for training and development. While the group is relatively small in number, it is big in motivation, holding coffee mornings and social events with external speakers and inviting colleagues from all over the organisation to learn more about how best to support LGBTQI+ colleagues. The Assured network is a strong community, supporting others and celebrating diversity as our strength."
        },
        {
            "text": "Since first becoming involved with Assured, I have taken on a greater role, and am now Deputy Chair of the group. I have been welcomed in to my role with open arms and will look to spend the next year developing new programmes which grow our links with other networks in HM Land Registry. I am also keen to work with other members to keep Assured as up to date as possible, and to make sure that everyone across the business knows there is a community here to support them."
        },
        {
            "text": "I have worked in multiple departments across the civil service, and have found HM Land Registry to be the most personal of them all. The focus shone on welfare and wellbeing and developing a community where we all look out for each other is stronger here than in countless other agencies. This ethos is something we aim to build upon in Assured, creating an LGBTQI+ space which is open and safe for all."
        },
        {
            "text": "While we may not be able to celebrate in person this Pride month, the thread of community – both within our Assured network and across the organisation – will continue to bring us together. As we look to the next 12 months, our eyes will be focused on making sure the sense of community felt across HM Land Registry continues to strengthen."
        }
    ]
}