{
    "url": "https://kingsawards.blog.gov.uk/2021/06/17/paraffins-work-with-global-clients-has-been-recognised-for-its-excellence-with-a-queens-award-for-enterprise-in-international-trade-2021/",
    "title": "Paraffin’s work with global clients has been recognised for its excellence with a Queen’s Award for Enterprise in International Trade 2021",
    "authors": [
        "The Queen's Awards for Enterprise"
    ],
    "categories": [
        "Advice",
        "International trade",
        "Winners"
    ],
    "pub_date": "2021-06-17T16:39:52+01:00",
    "content": [
        {
            "text": "Paraffin are an award winning capabilities agency. They empower people with capabilities that create positive change and business growth."
        },
        {
            "text": "Paraffin work with ambitious companies to supercharge learning and development by provoking people to think, innovate and perform better. They use human-centred, experience-based learning to create high-impact, long lasting behaviour change. They are recognised by world leading organisations for the impact they create and have received awards that celebrate their ongoing work."
        },
        {
            "text": "Paraffin are proud winners of the International Trade Award, 2021. Read their story below."
        },
        {
            "heading": 2,
            "text": "How did you hear about the awards?"
        },
        {
            "text": "Being a local business I read the local paper, 'The Portsmouth News', everyday to find out about something new that's happening in the city. It was in the paper I saw the advert. It was a tiny little piece in the paper inviting people to apply for the Queen's Award which led me online to discover we were in fact eligible for it, which was amazing!"
        },
        {
            "heading": 2,
            "text": "Why did you apply?"
        },
        {
            "text": "We've achieved outstanding growth over the last three years with our international work, even though we are a small business. We are proud to promote positive, cultural, change through learning and capabilities programmes for some of the biggest businesses in the world, and our work is used by the United Nations and the Cannes Lion judges. We've also just released our new book ‘Supercharged Teams: 30 Tools of Great Teamwork’, which gives anyone, in any team across the world, in any industry, the tools to be more collaborative, to benefit more from collective intelligence, make their teams more diverse, be more productive and work together effectively to solve some of the most complex issues our world faces."
        },
        {
            "heading": 2,
            "text": "What the award will mean to your business?"
        },
        {
            "text": "The last year has been tough on everyone, and our team has worked so hard - it's great to be able to show we are being recognised.  It's also a big thank you to our clients (Unilever, Essity, ABI, Diageo, Ipsos, Tesco, GSK) who have been so supportive of us in difficult times."
        },
        {
            "heading": 2,
            "text": "Potential benefits and boost to staff morale?"
        },
        {
            "text": "We are looking forward to throwing a big celebration party for our team and clients down by the seaside in Portsmouth as soon as restrictions lift.  We are hoping to get advice through the free membership of the 'Institute for International Trade and Development', especially on how to take 'Supercharged Teams: 30 tools of great teamwork' around the world."
        },
        {
            "heading": 2,
            "text": "Any top tips for future applicants?"
        },
        {
            "text": "Put in as much detail as you can about the work you do. Although our growth in international trade was the reason why we were eligible, we think that some of our social purpose work helped us to stand out.  Our work to give people tools to collaborate more, our framework to address negative gender stereotyping, and our voluntary social purpose method Project Bridge that helps communities to solve complex local issues such as childhood obesity, rough sleeping and rebuilding communities shattered by tragedy."
        },
        {
            "text": "We are enormously proud to have won a Queen’s Award for Enterprise: International Trade 2021 for Outstanding Short Term Growth and would like to say a huge thank you to our team, our clients, partners and colleagues who made it happen."
        },
        {
            "text": "Find out more about Paraffin on their website: https://paraffin.ltd/"
        },
        {
            "text": "Follow the Queen's Awards Office on Twitter "
        }
    ]
}