{
    "url": "https://civilservice.blog.gov.uk/2021/06/17/serving-queen-and-country-in-your-spare-time/",
    "title": "Serving Queen and Country in Your Spare Time ",
    "authors": [
        "James Waller, Head of People & Physical Security, Cabinet Office"
    ],
    "categories": [
        "A great place to work",
        "Reservists",
        "Uncategorized"
    ],
    "pub_date": "2021-06-17T09:06:56+00:00",
    "content": [
        {
            "text": "Thousands of Civil Servants are part-time members of the Armed Forces – but what motivates them, and what do they gain from it? Civil Servant James Waller joined the Naval Reserves more than 20 years ago and hasn't looked back."
        },
        {
            "text": "Wed 23rd June is ‘Reserves Day,’ an event to mark the role played by the tens of thousands of people serving in Britain’s Armed Forces who voluntarily sacrifice the luxury of weekend lie-ins to yomp across hills in the name of duty."
        },
        {
            "text": "Reservists play a vital role helping support the armed forces, operating around the world in a variety of roles including intelligence, cyber security and medical operations."
        },
        {
            "text": "The Civil Service strongly encourages its staff to join the Reserves, as it recognises the myriad of benefits that can make such a significant, positive difference to day-to-day work as well developing personal qualities such as leadership, confidence and communications skills. "
        },
        {
            "text": "Air Force Adventures"
        },
        {
            "text": "Not every job in the Reserves involves jumping out of planes. Kirsten Geenaway works in the Cabinet Office Central Secretariat, serving Cabinet Committees. In her spare time Kirsten is training to be an RAF Analyst."
        },
        {
            "text": "Kirsten recently passed basic training which covered everything from learning the history and structure of the Air Force to handling a rifle and battlefield first aid. She is now completing her Analyst trade training.  Kirsten says despite joining the Reserves recently, her new skills are already benefiting her career in the Cabinet Office."
        },
        {
            "text": "Kirsten says: “I collect and interpret data and information which has improved my analytical skills and eye for detail. Whilst learning how to deliver information to commanders, aircrew and troops on the ground has massively increased my self-confidence with public speaking and ability to communicate clearly and effectively.  "
        },
        {
            "text": "“Above all, I believe that the resilience, teamwork and leadership skills which I’ve gained from being a Reservist are invaluable. Being a Reservist is both enjoyable and rewarding, and my colleagues in the Cabinet Office couldn’t have been more supportive.”"
        },
        {
            "text": "Jumping out of an aircraft"
        },
        {
            "text": "Matthew is a professional communicator in the Cabinet Office. He joined the Army Reserves just before joining the Civil Service. Matthew was recruited into the Parachute Regiment, undergoing basic training, passing the notoriously tough physical tests, such as the world-renowned ‘P Company’ and basic parachuting course – to become a fully-fledged paratrooper."
        },
        {
            "text": "As Matthew progressed through training, his colleagues were both supportive and curious about what a typical training weekend entailed. On a Monday morning, as colleagues chatted about weekends over coffee, Matthew’s trademark erstwhile stories combining pubs and pints on a Saturday night were out, replaced with tales of speed marches despite few hours sleep and no Sunday lie-in."
        },
        {
            "text": "Unique experiences"
        },
        {
            "text": "Matthew says: “Although joining the Paras may be an unconventional way to spend my weekends, the experiences and friendships I’ve gained are unique."
        },
        {
            "text": "“I’ve already achieved dreams stretching back to my teens and loved every minute. Admittedly, I’ve enjoyed it even more after the event than at the time! On a personal level, it's about serving and being part of an organisation that puts the aims of the country first that I find so rewarding – much like my day job with the Civil Service.”"
        },
        {
            "text": "Sailing the World"
        },
        {
            "text": "James Waller joined the Royal Navy Reserves in 1998 and has been a civil servant since 2003. As a reservist, James works as a media officer, with international media organisations to create news stories that highlight the work carried out by UK armed forces around the world."
        },
        {
            "text": "James says: “Working as a reservist is a great way to learn new skills that help complement my day to day experience. For example, I’ve been able to access a range of professional media training and opportunities that have helped expand my skills and qualifications, and been of real benefit to my day job."
        },
        {
            "text": "“Being a reservist is a great way to expand my skills and enjoy some fantastic experiences. I’ve been able to travel across the world, and serve in Afghanistan with the Reserves, while always enjoying the full support of my employer. For example Civil Service Reservists get up to 15 days additional paid leave per year for training.”"
        }
    ]
}