{
    "url": "https://phescreening.blog.gov.uk/2021/06/17/virtual-clinical-skills-trainers-and-quality-assurance-leads-aaa-regional-networking-events/",
    "title": "Virtual clinical skills trainers and quality assurance leads (AAA) regional networking events",
    "authors": [
        "Tsitsi Muchayingeyi"
    ],
    "categories": [
        "NHS Abdominal Aortic Aneurysm Screening Programme"
    ],
    "pub_date": "2021-06-17T12:47:51+01:00",
    "content": [
        {
            "text": "Last year PHE Screening hosted virtual events for clinical skills trainers (CSTs) and quality assurance (QA) leads in the NHS abdominal aortic aneurysm (AAA) screening programme."
        },
        {
            "text": "This year we hoped to hold the events face to face, but we will be running them online again. CSTs and QA leads are invited to register your attendance at one of these 4 Microsoft Teams events. You are not restricted to your own regional event if the date is not convenient."
        },
        {
            "heading": 2,
            "text": "Register now for a regional event"
        },
        {
            "text": "Follow the relevant link below to register your attendance. Sessions will be running for:"
        },
        {
            "text": "Please register by Friday 23 July 2021."
        },
        {
            "heading": 2,
            "text": "Get involved"
        },
        {
            "text": "Last year, the presentations delivered by CST/QA leads were informative and generated much discussion and we are keen to have the same level of engagement. This year we have the use of breakout rooms in Microsoft Teams which will enhance interaction."
        },
        {
            "text": "This year, topics will include:"
        },
        {
            "text": "If you have any interesting experiences from practice that you are willing to share and present, please do get in touch. This could be yours or a screening technician's experience of the new annual competency assessment, an interesting AAA case, a screening incident or near miss in your local service or something else relevant for sharing and discussing with your peers. Please email the Screening helpdesk by Friday 6 August 2021."
        },
        {
            "heading": 2,
            "text": "PHE Screening blog"
        },
        {
            "text": "The PHE Screening blog provides up to date news from all NHS screening programmes. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new blogs. If you have any questions about this blog article, or about population screening in England, please contact the PHE screening helpdesk."
        }
    ]
}