{
    "url": "https://ofqual.blog.gov.uk/2021/06/17/what-students-teachers-parents-and-carers-think-and-feel-about-assessments-this-year-in-the-wake-of-the-pandemic/",
    "title": "What students, teachers, parents and carers think and feel about assessments this year in the wake of the pandemic",
    "authors": [
        "Prof. Roger Murphy",
        "Dr Tina Isaacs"
    ],
    "categories": [
        "A levels and GCSEs",
        "Coronavirus (COVID-19)",
        "Exams",
        "Functional skills",
        "Uncategorized",
        "Vocational and technical qualifications"
    ],
    "pub_date": "2021-06-17T10:00:27+01:00",
    "content": [
        {
            "text": "Foreword by Paul Newton, Ofqual Research Chair."
        },
        {
            "text": "Ofqual has a statutory duty to promote public confidence in regulated qualifications, which means that we need to listen carefully to what people think and feel about them. Never has this obligation been more pressing than in the run up to summer 2021, following more than a year of disruption to teaching and learning."
        },
        {
            "text": "We have commissioned two external research teams to find out what students, teachers, parents, carers, and other stakeholders think and feel about high stakes assessments this year, and about the disruption that students have experienced. One team is running focus groups, while the other is running online surveys. Both teams are gathering this information on an ongoing basis, with the first interviews conducted in December 2020, and the last ones scheduled for after the publication of results in August 2021."
        },
        {
            "text": "This blog illustrates insights arising from our focus group research, shining a spotlight on experiences of learning during the coronavirus (COVID-19) pandemic. We will report in detail on outcomes from both projects in the autumn."
        },
        {
            "heading": 2,
            "text": "The impact of the pandemic on the learning experiences of year 11 and 13 students"
        },
        {
            "text": "An article from Roger Murphy, Emeritus Professor of Education, Nottingham University and Tina Isaacs, Emeritus Associate Professor of Education, University College London Institute of Education."
        },
        {
            "text": "The pandemic has undoubtedly made a big difference to the lives and educational experiences of year 11 and 13 students following courses leading to general and vocational qualifications in summer 2021 in England. These students are at a critical stage of their educational journey and the pandemic has, as we know, had a major impact upon their learning. This has all happened during a year when they would normally have taken examinations and other types of assessment to determine their grades in qualifications, which can be vitally important to them in terms of their future progression."
        },
        {
            "text": "Our current research study has been focused upon understanding those experiences better. It has been based upon surveys, interviews and focus groups for year 11 and 13 students, their teachers and their parents or carers. It is continuing through the autumn of 2021, since we are interested to track experiences as these students encounter alternative ways of being assessed and graded over the next few months."
        },
        {
            "text": "In this blog we reveal early headline results from this research."
        },
        {
            "heading": 3,
            "text": "Diversity of individual experiences"
        },
        {
            "text": "The most substantial finding from our research has been the diversity of experiences that we have encountered. It is impossible to generalise about the impact of the pandemic on young people in these year groups. Some have come through totally unscathed with reports of them making faster than normal progress in their studies, as they and those supporting their learning have responded so well to the restrictions and barriers that have stood in the way of normal educational experiences. These fortunate students have been supported by teachers who found highly creative ways to keep their learning on track, even during long periods when normal attendance was not possible."
        },
        {
            "text": "In most cases these students had access to devices and internet connectivity that allowed them to engage effectively with remote learning. They also had study facilities in their homes that were conducive to quiet, uninterrupted study, often with supportive adults or siblings around who could help them. They would also often have been following courses that did not involve much practical work, and which were taught by teachers who were quickly able to switch from their normal classroom practice to effective online blended learning. The most successful would also have been comfortable with working on their own and were not too phased by any lack of contact with their peer group or diminished opportunities for away-from-home leisure activities. In some cases their schools and colleges found interesting ways of offering extra-curricular activities remotely."
        },
        {
            "text": "However, while some students thrived, others did not – for a wide variety of reasons. Some did not adapt well to the more independent style of learning required when schools and colleges were closed. Others suffered mentally and became anxious and depressed as their lives were disrupted in ways that they found challenging. We heard about students on practically oriented and vocational courses who had very little they could do on them for extended periods, because the work they should have been doing could not in many cases be undertaken remotely."
        },
        {
            "text": "Our research also involved us engaging with schools and colleges in areas where the pandemic exacerbated existing issues with social deprivation, disadvantage and under-funding. Some students from less advantaged home backgrounds suffered from both a lack of access to remote learning and to a study environment that made it possible for them to engage with that learning."
        },
        {
            "text": "We heard about schools that had to send staff out not only with worksheets, but also with pens, paper and school meals, often to students living in crowded accommodation that did not make remote learning easy. Unfortunately in many cases such areas were hit harder in health terms than other areas, and this led to higher rates of COVID-19 among students, their siblings, parents and carers as well as their teachers and classmates."
        },
        {
            "text": "In areas of high incidence of COVID-19 the disruption caused by national school and college closures has been compounded by additional absences from school and college, meaning that some students had only a limited number of days at school or college during a fifteen month period and/or only limited contact with their normal teachers when their schools and colleges were open"
        },
        {
            "text": "Some students have had a year of ill-health, exclusion from learning for long periods, and an impact on their mental health and general learning dispositions that will require skilled interventions to put right in the coming months and years. Such students are thankfully in a minority but their needs are pressing if their educational progress is to be brought back on track."
        },
        {
            "heading": 3,
            "text": "What can be done?"
        },
        {
            "text": "There certainly needs to be a widespread understanding of the huge diversity of experience that has occurred. Ofqual has gone on record stating that it is impossible to compensate fairly for the level of diversity of experience in terms of the grades that will be issued in the summer of 2021."
        },
        {
            "text": "The fact that the grades obtained by some learners will be influenced by the impact of the pandemic is certainly an issue. Alongside this are other pressing issues relating to the support needed for the health, well-being and educational recovery of a generation of learners."
        },
        {
            "text": "Prof. Roger Murphy and Dr Tina Isaacs"
        },
        {
            "text": "Ofqual will soon be publishing a set of reports on ‘Learning During the Pandemic’ – a compilation of detailed analytical reviews of the literature that has been published in England and overseas since March 2020 – which will help to explain in more detail the broader context for assessments this summer. This will explain how assessment processes were modified this year to mitigate the impact of the pandemic on grades, to be as fair as possible to students."
        }
    ]
}