{
    "url": "https://companieshouse.blog.gov.uk/2021/06/17/working-for-companies-house-sonsares-story/",
    "title": "Working for Companies House: Sonsare's story",
    "authors": [
        "Sonsare Zabadi - Internal Communications Manager",
        "Spencer Vignes - Campaigns Manager"
    ],
    "categories": [
        "People and culture",
        "Working at Companies House"
    ],
    "pub_date": "2021-06-17T13:55:10+01:00",
    "content": [
        {
            "text": "At Companies House, we like to think of ourselves as an inclusive, innovative and welcoming employer, one that supports people and encourages them to ‘find their passion’ by developing their skills and careers. But don’t just take our word for it. Here, Internal Communications Manager Sonsare Zabadi kicks off a new series of features in which employees reflect on what makes Companies House special to them."
        },
        {
            "text": "“It has been remarkable. I don’t think I’ve ever had any 2 years in my life that have been so eventful in terms of my career progression and feeling fulfilled in the workplace.” Says Sonsare Zabadi, now working as an Internal Communications Manager at Companies House in Cardiff."
        },
        {
            "text": "Sonsare first came to South Wales in 2012 from his homeland of Nigeria to do a master’s degree in International Relations at Cardiff University."
        },
        {
            "text": "It was not long before he fell in love with the place and a girl, Chanai, who he met at the church he’d started attending. Long story short, the happy couple were married in 2018."
        },
        {
            "text": "After a period working as a freelance graphic and web designer, Sonsare got word of job openings at Companies House and decided to apply. In 2019 he started work there as an administrative officer overseeing accounts in the Customer Operations Team, known internally as COT, which sits within the Customer Delivery Directorate (CDD)."
        },
        {
            "text": "Before long he was on the move internally, this time to Compliance, tasked in Sonsare’s words with “encouraging directors who, for whatever reason, might not have filed their accounts to actually file their accounts. To comply, in other words.”"
        },
        {
            "text": "Six months later he was on the move yet again internally having applied for, and got, his current position in Internal Communications."
        },
        {
            "text": "So why all the moving around?"
        },
        {
            "text": "“After my first month at Companies House, I met a man called James who was head of a service area called Maintain A Company, or MAC for short. James acts as a mentor at Companies House and he took an interest in me."
        },
        {
            "text": "“He asked about my background and, when he heard I had a master’s degree and had done graphic and web design work for clients, he was like ‘You really need to be somewhere further up the ladder. Have you thought about progressing?’ And my response was ‘Not really – I’ve only just got here!’"
        },
        {
            "text": "“Based on my skillset, James helped me identify some areas within Companies House where I could possibly work – digital, policy, communications. Over a period of time, it became clear that I was probably best suited for communications. That’s what I really enjoy doing."
        },
        {
            "text": "“Sure enough, a role then came up as an Internal Communications Manager. Just reading the job description, I was like ‘This is me. I need to give this my very best’. Which I did. And I got the position."
        },
        {
            "text": "“That’s one of the many, many things I love about working at Companies House. The opportunity to move into other parts of the organisation are there. If you can show that you have the capability, or you want to develop and take courses, then you can take your career in a different direction.”"
        },
        {
            "text": "To have achieved so much in such a short space of time, with the coronavirus (COVID-19) pandemic going on in the background throughout so much of it, is a tribute to Sonsare. Small wonder he feels that the past 2 years have been eventful."
        },
        {
            "text": "“I’ve never been in a workplace that has been so people-centred. I’ve always had the sense, working in other places, that it was about what you could produce, what you could do. Here, there’s a sense in which people are the asset."
        },
        {
            "text": "“Coming from another country, from a minority ethnic background, being in a workplace like this is fantastic. I’ve not felt limited in any way. In fact, the only limitation is how hard you can work, because there are so many different opportunities."
        },
        {
            "text": "“When I say opportunities, I don’t just mean work. We have many networks at Companies House for the people who work here. Six months after I started, I was one of the founding members of a new network called FACE – the faith, allyship, culture and ethnicity network – which celebrates cultural diversity, ethnicity and faith at Companies House."
        },
        {
            "text": "“Being involved in FACE has been such a great learning experience and a lot of fun. I’m vice-chair of the network, a role which I really enjoy doing, as well as something that has helped build my profile in a useful way.”"
        },
        {
            "text": "At the end of 2020, having overseen a successful Black History Month campaign, Sonsare gained recognition as joint winner of a Companies House Spotlight Award for promoting diversity and inclusion."
        },
        {
            "text": "“Two years ago, I was still trying to find my feet in the UK. Now this. It has been an amazing journey. It is an amazing journey. And I have Companies House to thank for that.”"
        }
    ]
}