{
    "url": "https://insideDIO.blog.gov.uk/2022/03/11/british-science-week-2022-using-green-innovation-to-deliver-carbon-efficient-training-accommodation/",
    "title": "British Science Week 2022: Using green innovation to deliver carbon efficient training accommodation",
    "authors": [
        "DIO Communications Team"
    ],
    "categories": [
        "Construction",
        "Defence Training Estate (DTE)",
        "Sustainability"
    ],
    "pub_date": "2022-03-11T13:47:26+00:00",
    "content": [
        {
            "text": "The two new, carbon negative double-storey accommodation facilities at Brunswick Camp [Copyright: Reds10 Ltd]Today marks the start of British Science Week, a ten-day celebration of science, technology, engineering and maths. This year’s theme is ‘growth’ and in Defence, we are highlighting the ways in which science and innovation are being harnessed to grow our capabilities while reducing carbon emissions."
        },
        {
            "text": "A key step on our path to meeting the UK Government’s net-zero 2050 target is decarbonizing the built environment, including the training and accommodation facilities used by military personnel across the Defence Training Estate (DTE). Working with our partners Landmarc Support Services and modular construction specialist Reds10, we are delivering the award-winning Net-Zero Carbon Accommodation Programme (NetCAP), which has recently introduced the DTE’s first double-storey carbon negative buildings featuring rainwater harvesting capabilities."
        },
        {
            "heading": 2,
            "text": "About NetCAP"
        },
        {
            "text": "NetCAP is part of a multi-million pound investment to transform the lived experience for our Armed Forces. The programme is set to deliver over 70 carbon efficient buildings, which will mean more than 3,900 new bed spaces, across the DTE. The accommodation provides beds, showers and drying rooms all in one modern complex, removing the need for troops to move around different buildings."
        },
        {
            "heading": 2,
            "text": "Driving down carbon emissions"
        },
        {
            "text": "NetCAP has delivered continuous improvements on the accommodation design, thanks to data from SMART technology and lessons learned being fed directly back into the programme. So far, the programme has delivered the DTE’s first carbon negative accommodation with an Energy Performance Certificate (EPC) rating of -5, followed by further blocks achieving EPC ratings of -7,-9 and -10. This means the buildings are capable of generating power for the site, reducing electricity costs."
        },
        {
            "text": "The latest double-storey NetCAP accommodation buildings allow for 104 bed spaces each and feature rainwater harvesting technology [Copyright: Reds10 Ltd]The new NetCAP accommodation facilities are set to save a massive 9,100 tonnes of carbon across the entire programme. The modular construction process, where large parts of the buildings are assembled off site, has also enabled considerable savings in time spent on manufacture and installation – from 15 weeks for the programme prototype to less than 13 weeks for subsequent buildings."
        },
        {
            "heading": 2,
            "text": "Boosting environmental performance"
        },
        {
            "text": "A key aim of NetCAP has been to boost environmental performance not only in construction, but for the ongoing lifecycle of the buildings. A variety of innovative green approaches have been used to ensure long-term sustainability as well as operational efficiency. These include rooftop solar panels, air source heat pumps and a heat recovery system in the buildings’ showers and drying rooms."
        },
        {
            "text": "The most recent development in this area is the implementation of a rainwater harvesting system, whereby rainwater is captured from the roof using the guttering system, before being filtered and directed into a rainwater harvesting tank that pumps the water back into the building for use. This greatly reduces water consumption within the buildings and uses the wet British weather to our advantage."
        },
        {
            "text": "The new facilities join three existing single-storey NetCAP accommodation buildings at Brunswick [Copyright: Reds10 Ltd]The project team have also installed sensors on the water feeds to measure the volume collected and evaluate how much water is saved per building each year. The first NetCAP buildings to include this additional feature are at Brunswick Training Camp in Surrey. These buildings, which were completed in February, are both carbon negative and the first double-storey accommodation facilities to be delivered by the programme. The two new facilities provide 104 bed spaces each and join three existing single-storey buildings on site already."
        },
        {
            "text": "The programme is currently set to deliver more of the latest double-storey facilities at several locations. In addition, continuing the trend of innovation and improvement that has been central throughout NetCAP, we are looking forward to installing the DTE’s first carbon negative Combined Joint Operations Centre (CJOC) at Wretham Camp in Suffolk at the end of March."
        }
    ]
}