{
    "url": "https://mhrainspectorate.blog.gov.uk/2022/03/11/compliance-monitor-process-part-1-an-introduction/",
    "title": "Compliance Monitor process (Part 1) – An introduction",
    "authors": [
        "Ewan Norton",
        "Tony Orme",
        "Joanne Parkin"
    ],
    "categories": [
        "Compliance matters"
    ],
    "pub_date": "2022-03-11T16:26:48+00:00",
    "content": [
        {
            "text": "This is the first part of a two-part blog series on the Compliance Monitor process which is being piloted by the MHRA from April 2022."
        },
        {
            "text": "The MHRA has a history of implementing risk-based inspection practices:"
        },
        {
            "text": "2009: The risk-based inspection programme was introduced.\nLow risk organisations with good compliance history benefitted from reduced inspection frequency whilst organisations with poor compliance history were subject to increased inspection frequency."
        },
        {
            "text": "2013: The Compliance Management Team (CMT) initiated.\nThe CMT process resulted in increased supervision of organisations whose marginal compliance required early intervention to prevent regulatory action becoming a necessary.  An overview of this process can be found in Alan Moon’s Blog from February 2017."
        },
        {
            "text": "The MHRA’s delivery plan for 2021 to 2023 committed to the use of innovative interventions to ensure the UK continues to provide high quality medicines.  We are preparing to pilot a new Compliance Monitor (CM) supervision process for appropriate GMP (Good Manufacturing Practices) and GDP (Good Distribution Practices) Inspection Action Group (IAG) cases."
        },
        {
            "text": "Compliance Monitor (CM) pilot programme"
        },
        {
            "text": "The current process of supervision of companies at IAG can result in frequent on-site inspections to assess progress in rectifying the issues of concern.  Supervision is essential to ensure patient safety, however it can require significantly increased resources from the MHRA and can therefore lead to a direct impact on the delivery of the statutory, routine, risk-based inspection programme that provides essential oversight of the supply of medicinal products to patients."
        },
        {
            "text": "From April 2022, the MHRA will begin a pilot programme for GMP and GDP remediation supervision by eligible consultants acting as Compliance Monitors (CM).  The CM will work with the company to deliver actions identified in a Compliance Protocol (CP), that has been agreed with the MHRA.  High-level updates on progress against the CP will be communicated to the MHRA at a pre-agreed frequency (provision of additional detail will be by exception against the CP requirements)."
        },
        {
            "text": "Upon completion of the Compliance Protocol, the Compliance Monitor will communicate to the MHRA that the company is ready for inspection.  The MHRA will then carry out an inspection to determine if the company can be removed from IAG oversight.  The MHRA will maintain the right to carry out inspection(s) prior to the completion of the CP if considered necessary."
        },
        {
            "text": "Overview of the CM process"
        },
        {
            "text": "Anticipated benefits"
        },
        {
            "text": "The second part of this blog series will provide more details on the CM role and the application process."
        }
    ]
}