{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2022/03/11/covid-inquiry-g7-head-of-planning-and-governance/",
    "title": "Covid Inquiry - G7 Head of Planning and Governance",
    "authors": [
        "Jamal Arabi"
    ],
    "categories": [
        "GSE Opportunities"
    ],
    "pub_date": "2022-03-11T11:57:24+00:00",
    "content": [
        {
            "text": "The GO-Science COVID-19 Inquiry Team performs an invaluable function. It ensures the nation, department and HMG learns from the experiences of COVID-19 to benefit the UK and our citizens in future. Using the Civil Service values as our foundation – integrity, honesty, objectivity and impartiality – our role is to take an open and transparent approach to ensure an accurate view of the role of science in the national Covid response.\nThis post offers a great opportunity to improve how our nation and HMG will work for years to come for the benefit of society and individuals. Working within the Inquiry team offers the chance to develop core and highly transferable skills in policy, analysis, communications, engagement and the interaction between policy and legal issues."
        },
        {
            "text": "GO-Science is a hard-working and welcoming team, with very high People Survey Skills and a strong sense of purpose and mission."
        },
        {
            "heading": 3,
            "text": "About the role"
        },
        {
            "text": "GO-Science (GOS) has played an important role in the formulation and communication of Science Advice throughout the COVID-19 pandemic response. HMG has committed to a full statutory Public Inquiry. This will commence in Spring 2022. With this in mind, we are now expanding our existing Inquiry preparation team. We want to ensure GOS is ready as a department to participate fully with the Inquiry and support the Government Chief Scientific Advisor (GCSA)."
        },
        {
            "text": "The GO-Science COVID-19 Inquiry and Scrutiny team is headed up at Deputy Director level, comprising two Grade 6 led teams. One leading on Engagement and Disclosure and the other on Policy and Governance. We are currently seeking to fill the COVID-19 Inquiry G7 Head of Planning and Governance. You will report to the Grade 6 Policy and Governance Team Lead, but use your planning and programme management expertise to support the whole team, often working directly with the Deputy Director."
        },
        {
            "text": "We are seeking someone with a strong track record of programme management in a new, developing and high-profile area of work."
        },
        {
            "text": "The role is rewarding, challenging, interesting and diverse. The post will focus on making sure the team is well placed - and well prepared - to meet the challenges of the forthcoming inquiry."
        },
        {
            "text": "Once the Inquiry Terms of Reference are announced and the process commences, you will engage with colleagues across GO-Science and HMG to establish effective and productive relationships. This collaboration is going to be key to success, and will underpin the work of the team."
        },
        {
            "text": "This is a new post, and likely to evolve as the Inquiry progresses and develops. If you are an independent and adaptable individual, ready to shape and deliver this key role we'd be delighted to hear from you!"
        },
        {
            "heading": 3,
            "text": "Responsibilities"
        }
    ]
}