{
    "url": "https://deframedia.blog.gov.uk/2022/03/11/environment-secretary-attends-g7-agriculture-ministerial-on-ukraine-and-food-security/",
    "title": "Environment Secretary attends G7 Agriculture Ministerial meeting on Ukraine and food security",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Weekly stories"
    ],
    "pub_date": "2022-03-11T15:41:19+00:00",
    "content": [
        {
            "text": "Environment Secretary George Eustice today (Friday 11 March) joined his counterparts from the G7 nations to hear from the Ukrainian Agriculture Minister and to express their solidarity with Ukraine as well as committing to work closely together to mitigate any impacts on global food security in light of Russia’s invasion of the country"
        },
        {
            "text": "Following the virtual meeting, the G7 agricultural ministers published a joint statement (BMEL - Publications - G7 Extraordinary Agriculture Ministers’ Meeting: Statement on the invasion of Ukraine by armed forces of the Russian Federation), condemning the large-scale aggression by the Russian Federation against Ukraine."
        },
        {
            "text": "Ministers agreed to work together to help ensure that sufficient, safe, affordable, and nutritious food continues to be available and accessible to all people, including the poorest, the most vulnerable, and displaced people in a timely, safe, and organized manner. The G7 called on all countries to keep their markets open and guard against unjustified restrictive measures on their exports."
        },
        {
            "text": "Environment Secretary George Eustice said: "
        },
        {
            "text": "The UK is currently among the largest donors to Ukraine, having so far pledged £394 million - with £220 million as humanitarian aid, and £174 million as economic and energy support. We will continue to work with international partners to help facilitate harvests in Ukraine and ensure the ability of Ukrainian farmers to feed their population, addressing logistical challenges for food exports to contribute to global food security."
        },
        {
            "text": "Overall the UK imports a very low amount of foodstuffs from Eastern Europe, with the majority of grains, meat, dairy and eggs produced in the UK, so the government does not expect any significant direct impact on UK food supply. Government will continue to support UK farmers as the situation evolves."
        },
        {
            "text": "We remain in regular contact with major grain traders, manufacturers and food retailers to understand the impacts of global events on supply chains and to ensure the highest possible standards of animal welfare and care, and have stepped this engagement up in recent weeks in response to the Russian invasion."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}