{
    "url": "https://homeofficemedia.blog.gov.uk/2022/03/11/factsheet-home-office-visa-support-for-ukrainians/",
    "title": "Factsheet: Home Office visa support for Ukrainians",
    "authors": [
        "Home Office news team"
    ],
    "categories": [
        "Fact sheet",
        "Leading stories"
    ],
    "pub_date": "2022-03-11T21:42:49+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Eligibility "
        },
        {
            "text": "Family members of British nationals and those settled in the UK are eligible to come to here. This includes:"
        },
        {
            "heading": 3,
            "text": "Visa requirements "
        },
        {
            "text": "The Ukraine Family Scheme is a fee-free visa route. There are no salary or language tests, but people will need to pass security checks."
        },
        {
            "heading": 3,
            "text": "How to apply with a valid passport"
        },
        {
            "text": "From Tuesday 15 March, valid Ukraine passport holders do not need to attend in-person Visa Application Centre appointments to submit fingerprints or facial verification when making applications under the Ukraine Family Scheme."
        },
        {
            "text": "Once their application has been considered and the appropriate checks completed, they will receive direct notification that they are eligible for the scheme."
        },
        {
            "text": "The majority of applications can be completed entirely online without attending a Visa Appointment Centre."
        },
        {
            "text": "All applicants will still need to complete an online application form. Application forms must be completed for each family member, including one application per child."
        },
        {
            "heading": 4,
            "text": "Step-by-step guide "
        },
        {
            "heading": 3,
            "text": "How to apply without a valid passport "
        },
        {
            "text": "Applicants who hold identity cards and do not have a valid passport will still need to attend a VAC in person and provide their biometric information."
        },
        {
            "text": "When applicants have completed an online form, they can book an appointment at any Visa Application Centre throughout Europe."
        },
        {
            "text": "They should then attend their Visa Application Centre appointment, where they be required to submit their biometric information."
        },
        {
            "text": "Once the visa application has been processed, we will contact applicants."
        },
        {
            "text": "Applicants should remain in the location where they have submitted their application until they are contacted."
        },
        {
            "heading": 3,
            "text": "Leave to remain in the UK"
        },
        {
            "text": "Ukraine Extension Scheme"
        },
        {
            "heading": 3,
            "text": "Helpline "
        },
        {
            "heading": 3,
            "text": "Myth buster: "
        },
        {
            "heading": 4,
            "text": "Why don’t you just waive visas?"
        },
        {
            "text": "Can’t you just do biometric checks on the street? Why do you need to go to the VAC?"
        }
    ]
}