{
    "url": "https://food.blog.gov.uk/2022/03/11/food-safety-in-food-waste-action-week/",
    "title": "Food safety in Food Waste Action Week",
    "authors": [
        "Allan Shivembe, Foodborne Disease Control Policy Adviser"
    ],
    "categories": [
        "Our mission",
        "Partners"
    ],
    "pub_date": "2022-03-11T09:55:08+00:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "Here at the Food Standards Agency, we’re supporting WRAP’s Food Waste Action Week. Raising awareness of the environmental consequences of wasting food and promoting activities that help to reduce the amount of food we waste has never been more important."
        },
        {
            "text": " "
        },
        {
            "text": "Have you seen a 10-foot-wide planet of food waste this week? Created by WRAP (Waste & Resources Action Programme) and Love Food Hate Waste, it represents the typical amount of food waste from one single household in the UK over one year. A total of 165kg."
        },
        {
            "text": "It is a stark reminder that we all have a role in reducing the amount of food we throw away. Yet, we do not have to engage in risky food behaviour to do so. In fact, reducing food waste and good food safety practices can go together."
        },
        {
            "text": "Food waste is having a real impact on climate change, contributing 8–10% of total man-made greenhouse gas (GHG) emissions. In addition, 4.5 million tonnes of edible food is thrown away each year by UK households. This is the equivalent of 8 meals per week. Our recent Food and You survey indicated that the most common prompted food concern for people was food waste (60% of respondents)."
        },
        {
            "text": "A great deal of food waste is a result of food spoilage and inadequate storage. Research from WRAP has shown that 70% of food being wasted in the UK is in the home and most of this waste comes from:"
        },
        {
            "text": "Within the food industry, waste occurs on the farm, during processing, distribution and retail. On top of this, 30% of CO2 greenhouse gases are created with the production and distribution of food."
        },
        {
            "heading": 2,
            "text": "Reducing food waste does not mean reducing food safety"
        },
        {
            "text": "Changes in consumer behaviour and an appetite to adopt sustainable practices, has meant many in the food industry are using innovative ways to reduce food waste. These include using technology to track how much food they throw away, donating leftover food, and composting."
        },
        {
            "text": "Whilst this is a positive move, it is important that consumers also make simple changes to reduce food waste. This includes getting to grips with freezing and defrosting food to prevent food from going to waste at home. We also advise consumers to plan meals beforehand to ensure that they use or cook the right amount of food. These actions can help reduce the amount of food waste we all throw away in our homes."
        },
        {
            "text": "One major way we’re combating food waste and ensuring food safety is through working with WRAP and other government departments to ensure targeted messaging, guidelines and measures are followed to create a sustainable food safety culture. For example, we work closely with WRAP to help consumers understand:"
        },
        {
            "text": "Adopting these positive food safety practices not only helps keep food safe but also contributes to the reduction of food waste."
        },
        {
            "text": "Implementing these actions at home and in food businesses will not only ensure that food remains safe but will also help to significantly reduce the excessive food thrown away each year due to it not being used and stored in time. Food waste is a challenge that is becoming ever more important in the face of not only food insecurity but also climate change."
        },
        {
            "heading": 1,
            "text": "Diogelwch bwyd yn ystod Wythnos Gweithredu ar Wastraff Bwyd"
        },
        {
            "text": "Yma yn yr Asiantaeth Safonau Bwyd rydym ni’n cefnogi Wythnos Gweithredu ar Wastraff Bwyd WRAP. Nid yw codi ymwybyddiaeth am oblygiadau amgylcheddol gwastraffu bwyd, a hyrwyddo gweithgareddau sy’n lleihau faint o fwyd a wastraffwn, erioed wedi bod mor bwysig."
        },
        {
            "text": " "
        },
        {
            "text": "Ydych chi wedi gweld planed gwastraff bwyd 10 troedfedd o led yr wythnos hon? Mae wedi’i chreu gan WRAP (Waste & Resources Action Programme) a Love Food Hate Waste, ac mae’n cynrychioli’r bwyd sydd fel arfer yn cael ei wastraffu gan un cartref yn y Deyrnas Unedig (DU) dros gyfnod o flwyddyn - sef cyfanswm o 165kg."
        },
        {
            "text": "Dyma atgoffâd trawiadol bod gennym ni oll ran i’w chwarae wrth leihau faint o fwyd rydym yn ei wastraffu. Ac eto, nid oes rhaid i ni gymryd risgiau gyda bwyd i wneud hyn. Mewn gwirionedd, gall lleihau gwastraff bwyd ac arferion diogelwch bwyd da fynd law yn llaw."
        },
        {
            "text": "Mae gwastraff bwyd yn cael effaith wirioneddol ar newid hinsawdd, gan gyfrannu 8–10% o gyfanswm yr allyriadau nwyon tŷ gwydr a achosir gan bobl. Yn ogystal, caiff 4.5 tunnell o fwyd bwytadwy ei daflu i ffwrdd bob blwyddyn gan gartrefi’r DU. Mae hyn yn cyfateb i 8 pryd yr wythnos. Nododd ein harolwg Bwyd a Chi taw’r pryderon mwyaf cyffredin mewn perthynas â bwyd oedd gwastraff bwyd (60% o’r ymatebwyr)."
        },
        {
            "text": "Mae llawer iawn o wastraff bwyd yn ganlyniad i fwyd yn dirywio a storio annigonol. Mae ymchwil gan WRAP wedidangos taw yn y cartref y mae 70% o fwyd yn y DU yn cael ei wastraffu a bod y"
        },
        {
            "text": "Yn y diwydiant bwyd, ceir gwastraff ar y fferm, yn ystod prosesu, dosbarthu ac wrth fanwerthu. Ar ben hyn, mae 30% o nwyon tŷ gwydr CO2 yn cael eu creu wrth gynhyrchu a dosbarthu bwyd."
        },
        {
            "heading": 2,
            "text": "Nid yw lleihau gwastraff bwyd yn golygu lleihau diogelwch bwyd"
        },
        {
            "text": "Mae newidiadau i ymddygiad defnyddwyr ac awydd i fabwysiadu arferion cynaliadwy wedi golygu bod llawer yn y diwydiant bwyd yn defnyddio dulliau arloesol i leihau gwastraff bwyd. Mae'r rhain yn cynnwys defnyddio technoleg i olrhain faint o fwyd maen nhw’n ei daflu i ffwrdd, rhoi (donate) bwyd dros ben, a chompostio."
        },
        {
            "text": "Er bod hwn yn gam cadarnhaol, mae'n bwysig bod defnyddwyr hefyd yn gwneud newidiadau syml i leihau gwastraff bwyd. Mae hyn yn cynnwys dysgu sut mae rhewi a dadmer bwyd yn iawn er mwyn ei atal rhag mynd yn wastraff yn y cartref. Rydym hefyd yn cynghori defnyddwyr i gynllunio prydau ymlaen llaw i sicrhau eu bod yn defnyddio neu’n coginio’r swm cywir o fwyd. Gall y camau hyn helpu i leihau faint o wastraff bwyd rydym ni i gyd yn ei daflu i ffwrdd yn ein cartrefi."
        },
        {
            "text": "Un o’r prif ffyrdd rydyn ni’n mynd i’r afael â gwastraff bwyd a sicrhau diogelwch bwyd yw trwy weithio gyda WRAP ac adrannau eraill y Llywodraeth i sicrhau bod yna negeseuon targededig, a bod canllawiau a mesurau’n cael eu dilyn i greu diwylliant bwyd diogel a chynaliadwy. Er enghraifft, rydym yn gweithio’n agos gyda WRAP i helpu defnyddwyr i ddeall y canlynol:"
        },
        {
            "text": "Nid yn unig y bydd mabwysiadu'r arferion diogelwch bwyd cadarnhaol hyn yn helpu i gadw bwyd yn ddiogel, bydd hefyd yn cyfrannu at leihau gwastraff bwyd."
        },
        {
            "text": "Nid yn unig y bydd gweithredu’r camau hyn yn y cartref ac mewn busnesau bwyd yn sicrhau bod bwyd yn parhau i fod yn ddiogel, ond bydd hefyd yn helpu i leihau’n sylweddol y swm gormodol o fwyd sy’n cael ei daflu i ffwrdd bob blwyddyn oherwydd nad yw’n cael ei ddefnyddio a’i storio mewn pryd. Her gynyddol bwysig yw gwastraff bwyd yng nghyd-destun ansicrwydd cyflenwadau bwyd a hefyd newid hinsawdd."
        }
    ]
}