{
    "url": "https://dfedigital.blog.gov.uk/2022/03/11/how-to-name-a-service/",
    "title": "How to name a service",
    "authors": [
        "Rinto Cyriac"
    ],
    "categories": [
        "software and services",
        "user research"
    ],
    "pub_date": "2022-03-11T15:24:44+00:00",
    "content": [
        {
            "text": "Deciding on a name for a new service can be tricky, especially in government. We’re not brand-driven or focused on marketing. We need to think about the words that users will use so they can find our service more easily when they search online."
        },
        {
            "text": "In this post I explain how my team and I named our ‘Manage an academy transfer’ service and the factors that helped us decide."
        },
        {
            "heading": 2,
            "text": "Our service"
        },
        {
            "text": "Academy transfers is an internal service. This means that only DfE staff will use this service and not the public."
        },
        {
            "text": "Before we launched our service in private beta, the service was described by the name of the delivery team, 'Academy transfers'. Not only was this confusing but the name didn’t explain clearly what the service actually did."
        },
        {
            "text": "So we needed a new and meaningful name that was self explanatory for new and experienced delivery officers managing academy transfers."
        },
        {
            "heading": 2,
            "text": "User research"
        },
        {
            "text": "Our first step was to understand what terms people were using to describe the service."
        },
        {
            "text": "We looked at Google Analytics to understand the common terms people were using to describe transfers. As well as how the process is talked about by other organisations and the sector."
        },
        {
            "text": "Based on desk research, we learned that ‘academy transfers’ is a well established term. It’s used by the sector to describe guidances relating to academies being transferred to another academy trust. We also learned from user research that users didn’t want another acronym."
        },
        {
            "text": "This gave our team the confidence to start making an informed decision about creating a verb based name incorporating \"academy transfers\"."
        },
        {
            "heading": 2,
            "text": "Using the service manual"
        },
        {
            "text": "We revisited the ‘naming your service’ section of the GDS Service Manual. In government we should only ever use descriptive names."
        },
        {
            "text": "They must describe what the thing is and what it’s for. We use verbs instead of nouns and names that don’t need to change when policy or technology changes - as this would be confusing for users."
        },
        {
            "heading": 2,
            "text": "Namestorm"
        },
        {
            "text": "Our next step was to think of possible names. We organised a workshop with the members of the team and stakeholders from our wider senior leadership team."
        },
        {
            "text": "We explained the findings from our desk research and invited team members on to an online whiteboard. The team had 10 minutes to come up with as many names as possible."
        },
        {
            "text": "Once we had lots of ideas we could then begin the elimination process. We discussed and then eliminated anything that"
        },
        {
            "text": "We were down to about 5 post-its. We then had another discussion about which names we thought were appropriate. Once we had whittled it down to 3 names we did a dot vote to see which one we liked best."
        },
        {
            "text": "Finally, we threw them around in some sentences to make sure that the service name we selected made sense when explaining the service to somebody."
        },
        {
            "text": "“Have you heard about the new ‘manage an academy transfer' service? It’s a new service by DfE for delivery leads to process the transfer of one academy to another trust.”"
        },
        {
            "heading": 2,
            "text": "Collecting user feedback"
        },
        {
            "text": "We are now holding research sessions to collect feedback from users. We want to know about their experience and the findability of the service."
        },
        {
            "text": "So far, the name of our service has not been raised as an issue. There have been no suggestions that it needs changing."
        },
        {
            "text": "We are planning to monitor how users search for guidance related to transfers in public beta. That will inform us about the mental model of our users."
        },
        {
            "heading": 2,
            "text": "Tell us what you think"
        },
        {
            "text": "We know that there are other ways to choose a name for a service. Have you used a different method? We’d love to hear from you or try something new."
        },
        {
            "text": "You can comment below or get in touch on Twitter."
        }
    ]
}