{
    "url": "https://aphascience.blog.gov.uk/2022/03/11/investing-in-the-uks-science-capability-in-animal-health/",
    "title": "Investing in the UK’s science capability in animal health",
    "authors": [
        "Jenny Stewart"
    ],
    "categories": [
        "APHA news"
    ],
    "pub_date": "2022-03-11T09:00:24+00:00",
    "content": [
        {
            "text": "In this blog we hear from APHA’s new Director of Science and Transformation, Dr Jenny Stewart, as she talks about plans to redevelop the Weybridge site to enhance its capability and reputation as a world-class science centre to support APHA’s mission to safeguard animal health for the benefit of people, the environment and the economy."
        },
        {
            "heading": 3,
            "text": "Future-proofing our science"
        },
        {
            "text": "In the autumn last year, I joined APHA as the Director of Science and Transformation at an exciting time for our organisation. As I started, the government funding for the transformation of APHA’s Weybridge facility and the construction of a new Science Hub on the site was secured. This started a long-term programme to future-proof the UK’s science capability in animal health (the Science Capability in Animal Health (SCAH) programme)."
        },
        {
            "text": "Substantial investment in the UK’s science capability in animal heath feels particularly timely. The threat from zoonotic diseases (diseases that can be transmitted from animals to humans) is growing, as recently recognised by the World Health Organisation (WHO). In fact, COVID-19 made the links between animal and human health clearer to us all. It highlighted the need for modern, future-proofed facilities that can support efforts to continue to strengthen our understanding of these diseases to safeguard both animal and public health and hopefully limit future outbreaks."
        },
        {
            "heading": 3,
            "text": "The importance of our science capability"
        },
        {
            "text": "The transformation of APHA’s Weybridge science campus will contribute to developing the UK’s world-leading animal health expertise. APHA’s science is world-renowned, and we collaborate with national and international partners from government, academia and industry on a wide range of scientific projects."
        },
        {
            "text": "We are designated as an international reference laboratory for 23 animal health specialisms by the World Organisation for Animal Health (OIE). The agency is also a national reference laboratory for 49 animal specialisms. This highlights the breadth and depth of knowledge and expertise of our scientists on a range of One Health disease threats (including new and emerging threats) impacting on animals, plants and the environment."
        },
        {
            "text": "The development of APHA’s main animal health science and laboratory facilities will support our world-leading research, surveillance and testing capability and, in turn, help to protect animal health. APHA plays a vital role in the development of surveillance techniques, diagnostics and treatments for diseases such as bovine tuberculosis, rabies and brucella as well as facilitating rapid responses to animal disease outbreaks."
        },
        {
            "text": "You may be interested in reading this year’s One Health Day blog which talks about APHA’s response in recent cases of Brucella canis in Great Britain."
        },
        {
            "text": "The importance of this capability has also been demonstrated this winter as APHA plays a critical role responding to the largest avian influenza (AI) outbreak the UK has ever experienced."
        },
        {
            "text": "APHA and partners can respond effectively because of year-round international and UK surveillance, rapid confirmation of the causes of bird mortality, as well as testing and sequencing of samples to identify the AI strain involved. All of this informs outbreak control measures and, alongside wider testing, allows the poultry industry and others to continue to operate despite the outbreak."
        },
        {
            "text": "Also of note, is that the use of APHA’s specialist science staff and facilities was critical in supporting UKHSA (UK Health Security Agency) manage the human health threat during the COVID-19 pandemic."
        },
        {
            "text": "Investment in animal health science capability will not only be beneficial for animal and human health but also have positive consequences for the economy. A strong animal health science capability will help to limit costly outbreaks (for example foot and mouth disease and bovine tuberculosis) as well as underpinning the UK’s ability to export £4.2bn of livestock, meat, dairy and animal by-products every year."
        },
        {
            "text": "As we look to the future, to support APHA’s globally important work, we need to attract, train and develop the next generation of UK animal health scientists the SCAH investment at Weybridge supports us to do this by signalling the importance of APHA’s work to current and future generations."
        },
        {
            "heading": 3,
            "text": "APHA in the community"
        },
        {
            "text": "We are excited to continue our work with the local community to support projects that improve our shared local environment. Most recently, we were pleased to announce that Defra agreed to letting land and buildings, which form part of the APHA Weybridge site, to a local community workshop and gardens project. This will be a wonderful hub for local people to connect with each other and with nature to support their physical and mental health."
        },
        {
            "text": "The SCAH programme is still in its early stages but it is an exciting opportunity to ensure the UK creates a world-class science campus which supports APHA’s mission to safeguard animal health for the benefit of people, the environment and the economy."
        },
        {
            "heading": 3,
            "text": "Find out more"
        }
    ]
}