{
    "url": "https://grantscommunity.blog.gov.uk/2022/03/11/making-a-career-in-grant-making-you-can-too/",
    "title": "Making a career in grant making - you can too",
    "authors": [
        "alisonlong",
        "abrahammontefiore",
        "emilyturvey",
        "williamwilson"
    ],
    "categories": [
        "Civil Service",
        "Government Grants Management Function"
    ],
    "pub_date": "2022-03-11T10:21:52+00:00",
    "content": [
        {
            "text": "What do you want to be when you grow up? And, what do you do? questions follow us through life. For many, we are not sure what we want to do and typically change jobs an average of 12 times during our career as we find out what we are good at, what interests us and what helps us pay the bills! A few even make dramatic career changes, proving that you can always change course."
        },
        {
            "text": "What about working in government grants? Did you know that the grants spend from 1 April 2019 to 31 March 2020 was almost £118 billion? That’s about 13% of all government spending. Grants is a pacy, innovative and high-profile policy area to work in and make a difference to social and economic wellbeing. "
        },
        {
            "heading": 2,
            "text": "Skills, skills, skills!"
        },
        {
            "text": "Working in grants is all about transferrable skills - from finance and accounting, risk management, project management, business case development, stakeholder management, marketing, developing digital tools to data analysis. It’s about translating government policy into well-designed, well-managed and well-advertised grant schemes. It’s a great place to start your Civil Service career journey. "
        },
        {
            "text": "But, if you are unsure, hear from Abraham, Emily and Will, our recently qualified graduates working for the Government Grants Management Function (GGMF). They share the experiences and skills they gained working in the fast-paced grants environment and provide advice for school leavers considering their career options.  "
        },
        {
            "heading": 2,
            "text": "Analyst - Economics and Politics graduate"
        },
        {
            "text": "I’m Abraham and graduated with a degree in Economics and Politics last year  from the University of Manchester. I’m an analyst, tracking how our grants experts are helping departments deliver value for money grant schemes. It’s exciting being able to support government departments working on such important issues to the country. I’ve had a fantastic experience as a new starter to the Civil Service and GGMF. There is a really welcoming culture where everyone is very understanding and helpful to new joiners. I have also found that there is a great sense of community between people in the Civil Service, with great opportunities to connect with people working in other areas and share experiences. My advice to school leavers is be proactive. Graduate job vacancies fill up fast. So don’t wait around for something to come up. Instead, make the effort to go online and start applying for things that interest you early. "
        },
        {
            "heading": 2,
            "text": "Communications - Law graduate"
        },
        {
            "text": "Hello, my name is Emily. I graduated with a Law degree two years ago and joined GGMF at Christmas. I work on the Grants Applicant Programme, designing an online service for applicants to access and apply for government grants all in one place; supporting the Levelling Up agenda, increasing transparency and reducing fraud. This role exemplifies the importance of the Civil Service and the positive improvements it can achieve for the public. Also, I love working amongst the GGMF team as it is full of truly kind, hardworking and welcoming people. My advice to school leavers, or indeed anyone, would be to go with your gut. As cheesy as it sounds - go after opportunities that you find interesting and give things a go. Any experience is good experience. And the Civil Service is such a supportive environment for development and progression with plenty of opportunities for you!"
        },
        {
            "heading": 2,
            "text": "Data analyst - Physics graduate"
        },
        {
            "text": "I’m Will, and graduated with a degree in physics from Loughborough University 5 years ago. I’m a data analyst and it’s my job to ensure GGMF has all the information it needs to provide effective support to the highest risk grant schemes. I’m working on the publication of the official grant spend statistic later this month, holding government to account for how much money is spent on grants and who it’s going to. I love my role working across government, reporting on government objectives to ministers and (for all the nerds out there) I get to solve all sorts of interesting data-related problems. For me, knowing that your work has an impact and helps improve the lives of the public is hugely motivating. I love hearing about the impact of a grant and thinking ‘we helped with that!’ My advice to school leavers - it may seem that everyone else knows ‘the secret’ and has it all figured out. But in reality we’re all in the same boat with the same uncertainties so don’t be put off applying for that role or promotion.  "
        },
        {
            "heading": 2,
            "text": "Want to know more?"
        },
        {
            "text": "Why not put a career in grants administration on your list? You can find out more about GGMF here and we will post job opportunities on our LinkedIn page. We’d love you to join our dynamic, inclusive and nationally-based grant-making Function working at the heart of government."
        }
    ]
}