{
    "url": "https://educationhub.blog.gov.uk/2022/03/national-careers-week-morgans-career-in-the-civil-service-after-leaving-college/",
    "title": "National Careers Week - Morgan’s career in the Civil Service after leaving college",
    "authors": [
        "media officer"
    ],
    "categories": [
        "Careers"
    ],
    "pub_date": "2022-03-11T11:33:18+00:00",
    "content": [
        {
            "text": "Hi, my name is Morgan and I work on the central recruitment team in Department for Education. I have worked in the Civil Service for almost 7 years now, since I was 17 years old."
        },
        {
            "text": "Did anything particularly inspire you to choose this career path?"
        },
        {
            "text": " I went to college for one year after leaving school and like many people at that age I wasn’t sure what I wanted to do in life. I came across a job advert for an apprenticeship with HMRC (Her Majesty’s Revenue and Customs Department), working on the Surge and Rapid Response Team. I wasn’t entirely sure what the Civil Service even was at that stage but the role offered the opportunity to be deployed across different government departments gaining a variety of new skills whilst completing a level 3 apprenticeship in operational delivery. This was the beginning of my journey at the Civil Service."
        },
        {
            "text": "What are the best parts of your career / role?"
        },
        {
            "text": " I have been able to gain so much experience working in the Civil Service. In my previous role I worked for many different departments including HMRC, Home Office, Rural Payments Agency and more. I was able to work with new people all over the country which not many people get to do and I am extremely grateful for career opportunities I have been given so far. I joined the Department for Education (DfE) on a promotion to an Executive Officer which is one of my biggest highlights in my career so far, I work on a small team which extremely fast paced this keeps the role interesting and challenging which I love."
        },
        {
            "text": "What is a typical day in your role?"
        },
        {
            "text": " No two days in recruitment are the same. My team and I work through every stage of the recruitment process, from start to finish - from posting the job advert, reviewing applications, releasing interview results, completing pre-employment checks, through to onboarding the candidate and setting up IT. It is important we stick to the service level agreement and process all information in time for the candidate joining the department, if not this could cause many issues including the employee not being paid. I really enjoy being part of this team they are a great group of people who have been so welcoming and supportive since I started."
        },
        {
            "text": "Are there many opportunities for progression and development in the Civil Service?"
        },
        {
            "text": " I think one of the best things about working in the Civil Service for me, is the opportunities for progression. I joined HMRC as an Administration Officer Apprentice and gained a lot of experience as well as my apprenticeship qualification before applying for promotion. I joined DfE in 2020 as an Executive Officer and within 6 months I was temporarily promoted to a Higher Executive Officer within the team. You are always encouraged to take opportunities that may arise, everyone in the department wants to see you succeed. There is always workshops and learning materials available to gain new knowledge and push yourself out of your comfort zone."
        },
        {
            "text": "What would you say to someone considering a career in civil service?"
        },
        {
            "text": " I would say go for it! Push yourself outside of your comfort zone and take risks. I would never have been able to travel all over the country meeting new people of all different ages and backgrounds if it wasn’t for my job in the Civil Service. You won’t only gain knowledge but life experience, independence and a lot of new friends! Even if you aren’t sure what you want to do or which department suits you best, there are endless opportunities to help you discover your career path."
        }
    ]
}