{
    "url": "https://digitaltrade.blog.gov.uk/2022/03/11/our-new-strategy-business-operations/",
    "title": "Our new strategy: Business Operations",
    "authors": [
        "Ann Hughes, Head of Business Operations"
    ],
    "categories": [
        "Flexible working",
        "People and Skills"
    ],
    "pub_date": "2022-03-11T10:00:12+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Our profession is an important and unique part of DDaT at DIT "
        },
        {
            "text": "The Business Operations team provides a corporate service for the Digital, Data and Technology (DDaT) team in the Department for International Trade (DIT). We cover governance, assurance, finance, procurement and people.  "
        },
        {
            "text": "This wide range of areas enable our teams to do a great job within DDaT, across DIT and for business.  The team brings together expertise from a range of civil service professions enabling us to advise DDaT staff on a wide of topics. We support not only each other and staff across DDaT, but also other government departments who ask the team to help and guide them through change. Our experience and expertise help us share to best practice in many areas. Our team also supports hybrid working and we have colleagues in locations across England from Darlington to Exeter."
        },
        {
            "heading": 2,
            "text": "Aligning our goals with the DDaT mission "
        },
        {
            "text": "DDaT’s mission is to: "
        },
        {
            "text": "The Business Operations team works across the whole of DDaT, supporting staff to carry out the technical and specialist work that happens across the directorate. The specialist staff working on finance and procurement ensure that we are providing value for money and that DDaT’s contracts are consistently supporting the delivery of DIT’s outcomes. The People team do excellent work to support, empower and develop staff, and we partner with many aspects of DIT and wider government. "
        },
        {
            "text": "A major part of the team’s role is to lead governance and assurance across DDaT. As a corporate function, DDaT is subject to both DIT governance as well as Cabinet Office governance. This dual governance can occasionally lead to a healthy tension in approach and pace. When managed right, this enables DDaT to deliver on DIT’s biggest priorities in the most effective way, applying best practice standards across design, digital, data and technology and helping the department to do the same.  "
        },
        {
            "text": "DDaT and the Business Operations team aligns to DIT governance for reporting, budget management, contract management and audit. We will make sure: "
        },
        {
            "text": "DDaT aligns to the Cabinet Office governance. We will ensure: "
        },
        {
            "text": "We are continually exploring ways to improve our ways of working, learning from the digital, data and technology colleagues that we work with so closely. We are already working closely together on several improvement projects and are looking forward to continued improvements over the next 5 years. This will help DDaT to operate with a strong Business Operations enabling function. "
        }
    ]
}