{
    "url": "https://ukhsa.blog.gov.uk/2022/03/11/powering-our-nations-health-security-with-world-leading-science/",
    "title": "Powering our nation’s health security with world leading science",
    "authors": [
        "Isabel Oliver"
    ],
    "categories": [
        "UKHSA science"
    ],
    "pub_date": "2022-03-11T09:52:58+01:00",
    "content": [
        {
            "text": "Today marks the start of British Science Week, a celebration of science, technology, engineering and maths, and an opportunity to highlight health protection science and UKHSA’s contribution as an organisation with science at its heart."
        },
        {
            "text": "Our health protection science saves lives; both through landmark discoveries and through scientists working quietly behind the scenes to keep us safe from infectious diseases and environmental hazards."
        },
        {
            "text": "And as well as keeping us safe, our science inspires people of all ages, offers exciting career opportunities and makes an important contribution to the prosperity of the UK."
        },
        {
            "text": "Science at UKHSA is diverse and multidisciplinary. We are microbiologists, epidemiologists, toxicologists, data scientists, radiation protection experts, medics, nurses, geographers, modellers, bioinformaticians, chemists, behavioural scientists, biomedical scientists, biologists and engineers."
        },
        {
            "text": "We tackle the big health challenges the world faces, from new and emerging infections and antibiotic resistance to climate change, air pollution and the threats from terrorism."
        },
        {
            "text": "And our health protection science is at the forefront of our efforts to end the harm caused by diseases like HIV and hepatitis C."
        },
        {
            "text": "All of our science is applied into practice. The knowledge and evidence that we generate in the delivery of our health protection functions is translated into action to overcome health challenges."
        },
        {
            "heading": 3,
            "text": "Bringing together a wealth of scientific assets"
        },
        {
            "text": "To protect the nation from infectious diseases and other hazards to health, we bring together multidisciplinary teams, drawing insights from our data and surveillance systems as well as making use of scientific innovations for example in data science and genomics."
        },
        {
            "text": "Our laboratory network includes reference laboratories, labs studying hazards in food, water and the environment, labs carrying out assessment of exposures to toxic substances or radiation and high containment facilities where we work with the most dangerous pathogens like Ebola."
        },
        {
            "text": "Our biological models enable critical research on vaccines and other countermeasures and our genomics laboratories, and the national collection of cell lines and microbial strains, support medical science world-wide."
        },
        {
            "text": "Some of these capabilities are highly specialised, and either rare or unique in the country, and we maintain them ready to respond to any emergency."
        },
        {
            "text": "Every day we generate and apply scientific evidence in many ways, for example to identify the source of outbreaks of infectious diseases, assess the risks from exposure to environmental hazards, determine the effectiveness of interventions such as vaccines and develop advice and guidance for health professionals and the public."
        },
        {
            "text": "Our evidence also informs Government policies and programmes as well as helping us to monitor and evaluate the impact and cost effectiveness of our work."
        },
        {
            "text": "Our rich partnerships are also a vital asset helping us ensure that our science is of the highest quality and benefits from scientific innovations. Our work with colleagues in academia, industry, other government agencies and international partners is critical to our mission."
        },
        {
            "heading": 3,
            "text": "An ambitious vision for UKHSA science"
        },
        {
            "text": "The COVID-19 pandemic has demonstrated that through power of science we protect health against the biggest threats."
        },
        {
            "text": "The rapid development of effective vaccines, the insights from genomic surveillance and the introduction of quick and accessible diagnostic tests have been crucial in bringing the pandemic under control and saving lives."
        },
        {
            "text": "We are now developing a science strategy that will take what we’ve learned from COVID-19 and set out how science can help secure victories that are within our reach, such as the elimination of hepatitis C or measles. We’ll also set out how we’ll use science to tackle complex problems like climate and environmental change."
        },
        {
            "text": "But we can’t do this alone. The best science is always done in partnership and so we will develop broader and deeper collaborations with academia and industry."
        },
        {
            "text": "We will also work ever closer with international partners to strengthen global health security, because as I heard UN Secretary General Antonio Guterres quite rightly say this week: “an outbreak anywhere is a potential pandemic everywhere.”"
        },
        {
            "text": "As well as protecting health, science contributes to the prosperity of the UK and our strategy will look at how we can unlock the potential of our assets and set the direction for collaborations which can realise the Government’s vision for the UK to be a Science Superpower."
        },
        {
            "text": "Underpinning all of this is our mission to build an open and collaborative culture of science and research, with UKHSA being a career destination of choice for scientists and the go-to partner for health security."
        },
        {
            "heading": 3,
            "text": "Looking forward"
        },
        {
            "text": "UKHSA was born in the midst of one of the most challenging health emergencies in a generation, and we must recognise that the future will bring further pandemics and health crises."
        },
        {
            "text": "And of course, the health effects from climate and environmental change, air pollution and antibiotic resistance are already being felt."
        },
        {
            "text": "But COVID-19 demonstrated that through the generation and application of the best scientific evidence, and with concerted effort and strong partnerships, we can tackle these threats."
        },
        {
            "text": "We will bring together multidisciplinary scientific expertise and work with academic, industry and international partners to understand and control threats of health before they spread and secure scientific advancements to protect health, reduce inequalities and contribute to the prosperity of the country."
        },
        {
            "text": "Please look out for more detail on UKHSA’s Science Strategy as we move towards its publication later this year. I’d also invite you to keep an eye on our social media channels over the coming week to see more science focussed content presented for British Science Week."
        }
    ]
}