{
    "url": "https://teaching.blog.gov.uk/2022/03/11/returning-to-teaching-adapting-to-being-back-in-the-classroom/",
    "title": "Returning to teaching: adapting to being back in the classroom",
    "authors": [
        "Patrick Lawler"
    ],
    "categories": [
        "COVID-19 support",
        "Teachers' reflections"
    ],
    "pub_date": "2022-03-11T09:50:31+00:00",
    "content": [
        {
            "text": "Patrick Lawler, Secondary School Supply Teacher at Monarch Education, returned to the classroom following the government’s call for ex-teachers to return to the profession. He explains what motivated him to return and his experiences so far."
        },
        {
            "text": "I have always been passionate about helping young people and that stemmed from the positive impact several of my teachers. I grew up in a poor, working-class family and I believe those teachers changed the course of my life. If I could make a positive impact on just one pupil, as my teachers did for me, I could potentially change the course of their life too. That is the reason I became a teacher."
        },
        {
            "heading": 3,
            "text": "The right person at the right time"
        },
        {
            "text": "During my teaching career, I worked as a secondary school History teacher before becoming Head of History and, later, Lead Teacher for Humanities. Working in different schools around the country, I gained experience in both state and independent sectors. I have always been passionate about helping lower-ability pupils, so I also set up intervention groups for  GCSE pupils studying History."
        },
        {
            "text": "When my wife was diagnosed with cancer, I decided to take a break from teaching so I could nurse her. Sadly, she passed away and, although I returned to teaching, I was unable to cope and resigned to prioritise my mental and physical health. This took a year."
        },
        {
            "text": "When I heard the government was urging teachers to return to the classroom, I thought about the reasons why I wanted to become a teacher in the first place and knew those reasons remained. Is there a child somewhere that needs support? Would I be the right person to help them at the right time? I still felt like I had something to contribute and that’s why I registered to work on a supply basis."
        },
        {
            "heading": 3,
            "text": "Returning to the classroom"
        },
        {
            "text": "You never forget how to ride a bike, but you forget how to ride it well. Teaching is very much the same. You get ‘rusty’, so I wanted to ease myself back in and supply was the best route for this. I secured my first teaching placement and although I hadn’t taught in more than a year, I wasn’t nervous. I didn’t have butterflies in my stomach. I was ready to teach."
        },
        {
            "text": "On my first day, I could see the effects of the pandemic on pupils quite clearly. Some were less confident and had gaps in numeracy and literacy. Within just a week of returning to teaching, I knew I had to change my teaching style."
        },
        {
            "text": "Though I tend towards the stricter side, I have not been averse to having a laugh to help pupils feel relaxed and comfortable. As I’ve gotten more familiar with classes, I can be confident they will get back to work afterwards. Returning to teaching has been a learning curve, but one I am relishing."
        },
        {
            "text": "Read guidance on applying to teach supply"
        }
    ]
}