{
    "url": "https://defradigital.blog.gov.uk/2022/03/11/why-i-chose-a-career-as-a-junior-developer-in-defra/",
    "title": "Why I chose a career as a junior developer in Defra",
    "authors": [
        "Holly Adamson"
    ],
    "categories": [
        "Defra digital",
        "Defra services",
        "Software tools",
        "User centred design",
        "User research"
    ],
    "pub_date": "2022-03-11T07:00:31+00:00",
    "content": [
        {
            "text": "Hi, my name is Holly. I joined Defra’s Digital data and technology function in December 2021, but my career in the Civil Service began at the Disclosure and Barring Service in October 2016. I took a role there as a part-time caseworker (at AO grade, the most junior grade), working on the evening shift, to fit around my university studies. The work involved sifting through physical utility bills and official documents to prove someone’s residence."
        },
        {
            "text": "Following my degree, I became a full-time caseworker at EO level, the next grade up, a role I stayed in for a further two years. By the time I left the department, last year, I had moved into a temporary role at HEO level, another grade up again. I was also acting as co-chair and communications lead for the Home Office Gender Equality Network. Busy times!"
        },
        {
            "heading": 2,
            "text": "My passion for hobbies opened a new door"
        },
        {
            "text": "In my personal life, I have always been someone who juggles, arguably, too many hobbies. I love to learn new things, understand how they work, and create art in all its forms. I don’t remember how it feels to be bored, only overwhelmed at the lack of hours in the day."
        },
        {
            "text": "Fortunately, these hobbies have evolved into a freelance graphic design and illustration career – essentially anyone who knows me, who needs something making with adobe products for little to no money, asks me what I’m up to."
        },
        {
            "text": "At the beginning of the pandemic, after finding myself spending far too many hours a day on phone games like solitaire, I made the conscious decision to delete them all except for Duolingo; an app that teaches you languages that is formatted like a game."
        },
        {
            "text": "Starved of variety, I found myself enjoying casual learning, and, without noticing, I arrived at a 365-day streak, primarily focusing on Dutch, even though I only intended to learn French. This led me to find Mimo, essentially Duolingo that teaches coding languages."
        },
        {
            "text": "After a few months on Mimo, I saw an advert on Civil Service Jobs for a junior software developer. According to Gov.uk a junior developer learns on the job by delivering software components. After reading this brief job description, I applied for the position, even though I had never actually written a line of code. I made this clear in my application, which I submitted as a long shot."
        },
        {
            "heading": 2,
            "text": "No experience is no barrier"
        },
        {
            "text": "To my great surprise, the resource managers, who are responsible for recruitment and line management, were okay with my lack of software experience, they even welcomed it. They made it clear that they were looking to place entry-level developers into different teams, around the country, to grow us to become full-stack developers, with the specialist knowledge needed to progress and develop services and products."
        },
        {
            "text": "They also made it clear that they strive towards employee retention, looking to develop and promote from within. Therefore, I’d get the time and resources to learn and grow at my own pace. That was such a powerful message to hear, it gave me reassurance and confidence. That said, never in a million years did I expect to be hired. But I was, and so here I am."
        },
        {
            "text": "The reality of working in my new role has been even more surprising. I currently work on the Check for Flooding (CFF) service, which enables people to see current flood warnings and alerts for England and the national flood forecast for the next five days. They can also check river, sea, groundwater, and rainfall levels."
        },
        {
            "heading": 2,
            "text": "Looking beyond my immediate horizon"
        },
        {
            "text": "My entire team is so friendly, welcoming, collaborative, and hardworking. I have been paired up with an amazing mentor too, who answers all my questions, even those I ask repeatedly."
        },
        {
            "text": "I’m also regularly invited to shadow and collaborate with other team members, such as design, test, and user research, to see how the whole service functions. This experience is giving me a more rounded view of the end-to-end process of designing, developing, and delivering a citizen-facing service."
        },
        {
            "text": "The resource managers host weekly meetings where all the new junior developers and I meet to discuss how we’re feeling, how things are going, and to discuss what we’ve learned in our respective languages."
        },
        {
            "text": "These meetings alternate between team building and chatting with guest speakers, such as principal developers, as an opportunity to learn and create a community. The meetings have branched into additional sessions, led by another new starter."
        },
        {
            "text": "It’s clear that the intentions set out by management during the recruitment process didn’t end there, and that we will be supported in becoming the future of software development at Defra. The amount of time that we are afforded to learn and collaborate is so refreshing. It wasn’t something I’d experienced before taking on this role. I feel blessed to work in such a positive environment, where I am well supported, in addition to providing positive services to the public."
        },
        {
            "heading": 2,
            "text": "Further information"
        },
        {
            "text": "National Careers Week is a celebration of careers guidance and free resources in education across the UK. The aim is to provide a focus for careers guidance activity at an important stage in the academic calendar to help support young people leaving education."
        },
        {
            "text": "We're regularly recruiting for talented people to join our growing team. Check out our latest vacancies."
        }
    ]
}