{
    "url": "https://naturalengland.blog.gov.uk/2025/05/12/a-new-peat-map-for-england/",
    "title": "A new peat map for England ",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Climate change",
        "Environmental Improvement Plan",
        "Landscapes",
        "Mapping",
        "Monitoring",
        "Natural England",
        "Nature Recovery Network",
        "NCEA",
        "Peat",
        "Science and evidence"
    ],
    "pub_date": "2025-05-12T06:00:00+01:00",
    "content": [
        {
            "text": "By Dr Ruth Waters, Director for Evidence, Natural England, and David Jones, Senior Responsible Officer for the Natural Capital and Ecosystem Assessment, Defra"
        },
        {
            "text": "England’s peat deposits are one of our most valuable national assets. They’re our largest carbon store, they filter most of our fresh water and help defend communities against flooding, and they’re home to irreplaceable plants and wildlife."
        },
        {
            "text": "But what you can’t measure, you can’t manage. Today Natural England launched a new nationwide map of peat and peaty soils, The England Peat Map. The map has the most detailed national coverage to date for peat depth, peatland vegetation, upland drainage channels, and upland bare peat, which are all important in determining peatland condition. It’s published on an open access, easy to use web viewer and across a number of freely accessible government platforms. "
        },
        {
            "text": "This new peat map marks a step change in our ability to make national, regional, and local scale plans for England’s peatlands and peaty soils. It will be a key resource for government, for conservation organisations, and for anyone else working on the large-scale restoration of peatlands or the ecosystem services they provide. The map has been produced by the Natural Capital and Ecosystem Assessment programme as part of a nationwide survey of our land, freshwater and coastal ecosystems to produce a baseline of our natural assets."
        },
        {
            "text": "We already know that many of our peatlands are in a poor condition, but limited data has made it hard to build a detailed picture of what is happening across England. The new England Peat Map allows us to see that around three quarters of our peatlands are covered by plants and land use types associated with drier conditions, such as arable and horticultural land, bare peat, broadleaved woodlands, or near or within built-up areas and gardens, rather than the wetland plants we’d expect on healthy peatland.  At least 37% is dominated by heather, which flourishes under dry conditions, while just 1% is dominated by Sphagnum mosses – a key peat-forming plant group associated with wetlands. The map also shows the locations of many thousands of drainage channels, which are often closely connected to dried-out, deteriorating peatlands. Taken together, the data provides the most detailed understanding of peatland extent and features ever available at an England-wide scale.  "
        },
        {
            "text": "How will the map be used?"
        },
        {
            "text": "How is the map made?"
        },
        {
            "text": "The map relies on the integration of AI techniques with other survey methods. It uses satellite imagery, pre-existing peat survey data, new field survey data, and data on geology, topography (LiDAR), and historic land use. These are then analysed using AI algorithms (machine learning and deep learning). Using these algorithms we have, without needing to visit sites in person, predicted where peat will be found and identified drainage channels right across upland peat landscapes."
        },
        {
            "text": "Without needing to manually survey every peat deposit in the country, the England Peat Map combines modelling and real-world data to give our best prediction of where peat is. Our models are trained on over 300,000 data points from field surveys. They have an overall accuracy measure of over 95% for the extent of peaty soils and 94% for vegetation and land cover. As a national-scale map it will be a vital part of the decision-making toolkit for local scale management, though needs to be used in conjunction with local evidence for site-level decisions."
        },
        {
            "text": "The most difficult areas to map have been in the lowlands, where survey data is harder to gather and where more peat has been modified through historic intensive agricultural use. Drained lowland agricultural peat soils are responsible for the vast majority of greenhouse gas emissions from England’s peat, so improving mapping of these areas will be an important area of work for the future."
        },
        {
            "text": "Technical documentation and datasets can be downloaded from the project website, from Defra’s Science Search platform, and from Natural England’s Access to Evidence page. The map can also be accessed from Defra's Data Services Platform (DSP).  "
        },
        {
            "text": "Funding and partners"
        },
        {
            "text": "The map has been made by Natural England and is funded by Defra’s Natural Capital and Ecosystem Assessment (NCEA) programme and Nature for Climate Fund (NCF). However, it’s also a triumph of teamwork between the public, non-profit, and private sectors. Natural England wouldn’t have been able to make the England Peat Map without generous contributions of data from 29 partner organisations – ranging from the National Trust and the Great North Bog partnership to Anglian Water. Together we’ve moved from a fragmented, localised picture of England’s peatlands to a joined-up, national one."
        },
        {
            "text": "The natural capital value of peatlands"
        },
        {
            "text": "England’s peatlands and peaty soils are among our most valuable natural capital resources. New peat only forms at a rate of about 1mm a year, so by far the best way of ensuring that we continue to receive its benefits is by not letting it degrade in the first place and restoring damaged peatlands. Figures from the Office for National Statistics indicate that our peatlands’ value as a source of drinking water is worth many hundreds of millions, while our 180 million hours of recreational visits to them were worth £274 million. But all this is dwarfed by their value as a carbon store. The value of reduced carbon emissions from restoring all peatlands in the UK would be between 5 and 10 times the cost of restoration. At a conservative estimate, restoring 55% of peatlands to near-natural condition would have a value of around £50 billion. In allowing us to measure how much peat we have in locations across England, and the features of our peatland landscapes, the England Peat Map will give decision makers vital information to help them make the right choices for these irreplaceable national assets."
        },
        {
            "text": "Natural England’s Chief Scientist Dr Sallie Bailey has said of the map: "
        },
        {
            "text": "“Trying to map something that’s largely underground, changes in volume depending whether it’s rained recently, and tries to swallow you up every time you set foot in it comes with its challenges, which makes this map extraordinary in its accomplishment and something of a global first.  "
        },
        {
            "text": "“Mapping peat to this level of detail will help us maximise the benefits of peat and massively advances our understanding the role our peatlands are playing in a changing climate.” "
        },
        {
            "text": "Natural England’s Chair Tony Juniper said of the map:"
        },
        {
            "text": "“The urgent need to improve the condition of our peatlands is well documented. They provide irreplaceable benefits as our biggest natural carbon stores, regulators of water quality and flood risk, and through the habitats they offer for plants and animals."
        },
        {
            "text": "It is only with the support of detailed evidence and mapping that we can understand the health of these ecosystems and turn this into effective conservation action."
        },
        {
            "text": "The England Peat Map will help us understand their contribution to our greenhouse gas emissions, target restoration efforts to the most degraded land, and identify some of the best opportunities for nature recovery. This will underpin better decisions affecting peatlands for many years to come.”"
        },
        {
            "text": "Nature Minister Mary Creagh said:"
        },
        {
            "text": "“Our peatlands are this country’s Amazon Rainforest and in desperate need of restoration and protection, as this mapping and research work starkly demonstrates."
        },
        {
            "text": "“That is why we have announced up to £400m for nature restoration, including of our peatlands, and are consulting on new plans to extend the ban on burning deep peat. This government, as part of our Plan for Change,  are committed to expanding nature-rich habitats and turning the tide on nature’s decline after years of neglect.”"
        },
        {
            "text": "Caroline Thorogood, the National Trust's national lead for peatlands, has said of the map: "
        },
        {
            "text": "\"We’re excited to see the launch of the England Peat Map. The data in the map will help us take a significant step forward to more accurately map peatlands that we own and care for in England and understand their condition. This will allow us to better identify priorities and action future work to recover our precious peatlands, helping nature thrive and providing benefits such as carbon storage and water regulation.\""
        }
    ]
}