{
    "url": "https://socialcare.blog.gov.uk/2025/05/12/celebrating-international-nurses-day-2025/",
    "title": "Celebrating International Nurses Day 2025",
    "authors": [
        "Deborah Sturdy"
    ],
    "categories": [
        "Care and support",
        "Communities",
        "Diversity",
        "Events",
        "Leadership",
        "Workforce"
    ],
    "pub_date": "2025-05-12T10:18:38+00:00",
    "content": [
        {
            "heading": 2,
            "text": "The honour to call ourselves nurses"
        },
        {
            "text": "I have always been proud to call myself a social care nurse."
        },
        {
            "text": "Every day in our profession, we are privileged to use our hard-won skills and experience in the most creative ways, caring for people with multiple needs, comorbidities and other complexities."
        },
        {
            "text": "So, it is always concerning – galling even – when individuals outside our specialisms choose to use the title ‘nurse’ when they have neither the skills, training nor registration to legitimately claim it as their own."
        },
        {
            "text": "This week’s momentous announcement, on International Nurses Day, that the title “nurse” will be protected in law is, in my view, long overdue."
        },
        {
            "text": "Finally, we can reassure residents, patients and colleagues they are dealing with registered practitioners across all relevant care settings."
        },
        {
            "text": "They can have faith in their accountability and peace of mind all requisite qualifications have been obtained."
        },
        {
            "text": "As we celebrate our colleagues, at home and abroad, during International Nursing Week, this announcement can only serve to strengthen our practice, standing and professionalism."
        },
        {
            "text": "It also means we can fly the flag for nursing across all care and health settings with confidence and pride. It’s important nurse graduates feel encouraged to join us, safe in the knowledge the title ‘nurse’ in their job roles is valued, respected and real."
        },
        {
            "heading": 2,
            "text": "Supporting our diverse profession"
        },
        {
            "text": "Lucy Gillespie is the lead nurse developing preceptorship resources, which will support our newly qualified colleagues and help create a framework for their transition into social care settings."
        },
        {
            "text": "Meanwhile, supporting newly qualified nurses and exploring ways to develop more experienced colleagues through enhanced roles will remain our focus."
        },
        {
            "text": "Inclusivity remains a priority. New networks, supported by Skills for Care, will be focused on education."
        },
        {
            "text": "As we look to the year ahead, colleagues at Skills for Care, Council of Deans and the wider care sector will be pushing for every student nurse to have placements in social care through our undergraduate placement strategy."
        },
        {
            "text": "The Queens Institute of Community Nursing (QICN) and The Outstanding Society continue to provide support to the Social Care Nursing Councils through their respective networks, giving us the opportunity to open them up to even more members. We want the councils to become crucibles of ideas and creativity, to be shared with nurses across the sector."
        },
        {
            "text": "We are also exploring ways to build a strong network for global majority colleagues, whose experiences, skills and diversity can only enrich our practice with valuable perspectives."
        },
        {
            "text": "In many ways, we are weaving a tapestry of social care connections; nursing communities threaded together by a common purpose, shared values and the desire to be the best we can be."
        },
        {
            "heading": 2,
            "text": "Building evidence of excellence"
        },
        {
            "text": "Elsewhere, I continue to champion the development of a strong research base for social care nursing, including opportunities for more nurses to get involved with this essential work."
        },
        {
            "text": "The Social Care Nursing Research Programme, led by Dr Zena Aldridge at the National Institute for Health and Care Research (NIHR), offers paid opportunities for social care nurses to become research pioneers. Now more than ever we need to showcase the evidence underpinning the value of our practice and the innovations we can bring to the sector."
        },
        {
            "text": "The programme complements the work led by the UK’s first Professor of Social Care, Professor Claire Pryor, Salford University.  Funded by the RCN Foundation, Claire continues to signpost the priorities we need to focus on in social care nursing research."
        },
        {
            "text": "Last week, the Royal College of Nursing (RCN) held the first Social Care Nursing conference. The regional Independent Sector Leads are making inroads into supporting nurses locally and the senior RCN team are committed to do more."
        },
        {
            "text": "From now until next year’s International Nurses Day, we have much to accomplish. Luckily, the social care nursing workforce has the talent, energy and commitment to deliver above and beyond the goals we set ourselves."
        },
        {
            "text": "We should be so proud of what we do. I strongly encourage you to help shape the future with us. Your leadership, compassion and creativity are the qualities which makes social care nursing such a great place to practice."
        },
        {
            "text": "And now we can claim the title ‘nurse’ with even greater pride and confidence. It’s what we – and the people we are pledged to support – need and deserve. Happy International Nurse Day!"
        }
    ]
}