{
    "url": "https://defrafarming.blog.gov.uk/2025/05/12/farming-podcast-a-farmer-and-agronomists-perspective-on-ipm/",
    "title": "Farming Podcast: a farmer and agronomist’s perspective on IPM",
    "authors": [
        "Graham Higgins"
    ],
    "categories": [
        "Future Farming Podcast"
    ],
    "pub_date": "2025-05-12T11:42:59+01:00",
    "content": [
        {
            "text": "In this episode, arable farmer and leader of the British On-Farm Innovation Network (BOFIN), Tom Allen-Stevens, speaks with farmer Martin Lines and agronomist Ed Schofield about their experiences of implementing integrated pest management (IPM)."
        },
        {
            "text": "Martin farms in Cambridgeshire and uses IPM as part of a whole-farm approach, while Ed supports farmers in adopting IPM across a wide range of farming systems in multiple counties."
        },
        {
            "text": "Together, they discuss how they apply IPM on farm to reduce input costs, support biodiversity and improve long-term business resilience. They also highlight the importance of planning, monitoring and collaboration between farmers and advisers."
        },
        {
            "text": "Martin shares his perspective: “Good IPM should reduce a lot of the input costs because you're trying to change your practices, not needing that additional input.” He adds, “Proper integrated pest management looks at the problems and finds solutions.”"
        },
        {
            "text": "Ed explains how IPM begins before any crops are planted: “...the process starts before you even drill the crop. You work right back and start from the very beginning and integrate all these solutions together.”"
        },
        {
            "text": "Martin describes how creating and using an IPM plan can help you get started: “It's about setting out what our problems are and what we are doing going forward.” "
        },
        {
            "text": "From an adviser’s perspective, Ed highlights the importance of planning and communication: “I spend most of my life telling people solutions to problems that could have been avoided three months ago.”"
        },
        {
            "text": "Tom highlights the importance of peer-to-peer learning, emphasising: “Farmers learn best from other farmers, and knowledge has value – farmer knowledge has more value than perhaps we give it credit for, but it only has value when you share it.”"
        },
        {
            "text": "They also stress the value of field monitoring, habitat management for beneficial insects, and on-farm trials to test and learn different techniques – all of which can go a long way in helping to get the most out of IPM. As Martin puts it: “We don't know if something works unless we do it.”"
        },
        {
            "text": "The discussion also touches on the upcoming launch of the UK Pesticides National Action Plan 2025 and how farmers can get involved in research and innovation through initiatives like the ADOPT fund and IPM NET – a knowledge-sharing network designed to improve the effectiveness of IPM."
        },
        {
            "text": "Read the transcript of the podcast."
        }
    ]
}