{
    "url": "https://childrenssocialcare.blog.gov.uk/2025/05/12/fostering-in-the-east-midlands/",
    "title": "Becoming Foster Carers in the East Midlands",
    "authors": [
        "Sharnie and Zak"
    ],
    "categories": [
        "Foster care"
    ],
    "pub_date": "2025-05-12T10:12:30+01:00",
    "content": [
        {
            "heading": 2,
            "text": "Sharnie and Zak's story"
        },
        {
            "text": "We’re Sharnie and Zak, and we’re new foster carers with Foster for East Midlands Councils. We live in Nottinghamshire with our young daughter, and this year, we began our fostering journey after years of talking about it. With Foster Care Fortnight underway, we wanted to share our story in case you’re thinking about fostering, or if it’s something you’ve never considered but might be interested in."
        },
        {
            "text": "After years of \"one day we will\" conversations, we finally took the leap. We’re unable to have more biological children but with plenty of love to give, we wanted to open our home to children needing safety and stability. We also wanted our daughter to experience the joys and challenges of sibling relationships such as learning to share, care, and build close bonds. Fostering provided this opportunity while making a positive impact in our community."
        },
        {
            "heading": 2,
            "text": "What we've learnt as new foster carers"
        },
        {
            "text": "Being first-year foster carers means we're still learning, and that's perfectly fine. We approached fostering with open hearts and a willingness to grow. Foster for East Midlands Councils has supported us through every step, providing guidance whenever needed."
        },
        {
            "text": "The local council fostering service provides valuable training, resources, and ongoing support. Through fostering, we are connected with a supportive network of people and professionals in our area. We're never alone in this journey, which makes all the difference."
        },
        {
            "text": "Our first placement, which was respite care over a few weekends, went surprisingly smoothly. We expected challenges like awkward silences or resistance, but instead found laughter, play, and unexpected calm. While we know not every placement will be as smooth, this experience gave us confidence to continue."
        },
        {
            "text": "The approval process was both nerve-wracking and exciting. Through fostering, we've experienced the huge power of community and close human connection."
        },
        {
            "heading": 2,
            "text": "5 tips for prospective foster carers"
        },
        {
            "heading": 2,
            "text": "Take the first step this Foster Care Fortnight"
        },
        {
            "text": "Fostering grows your family in unexpected, beautiful ways while providing essential support to children who need it most. This Foster Care Fortnight, consider beginning your own journey."
        },
        {
            "text": "For more information about Foster for East Midlands Councils, visit the website or call 0303 3132 950."
        },
        {
            "text": "If you would like to find out more about fostering, head to the GOV.UK national postcode finder tool to find your nearest local council."
        }
    ]
}