{
    "url": "https://aphascience.blog.gov.uk/2025/05/12/how-genomics-is-fighting-invasive-threats/",
    "title": "Protecting Britain’s fields and forests: how genomics is fighting invasive threats",
    "authors": [
        "Yogesh Gupta"
    ],
    "categories": [
        "Plant health"
    ],
    "pub_date": "2025-05-12T12:53:37+01:00",
    "content": [
        {
            "text": "It started in a commercial greenhouse on the edge of South East England. A grower supplying fresh tomatoes to major supermarkets noticed something troubling - the tomatoes looked mottled and discoloured, and the fruits were misshapen. At first, they thought it might be a nutrient issue or a common virus. But tests confirmed their fears: Tomato brown rugose fruit virus (ToBRFV) had made it to their crop."
        },
        {
            "text": "Highly contagious and difficult to control, ToBRFV can slash tomato yields by up to 70%. In the United Kingdom (UK), this has led to losses of tens to hundreds of thousands of pounds, and the greenhouse complexes have had to be completely disinfected to prevent further spread. In Florida, a major tomato producing state in the United States (US), the virus is estimated to put at risk an industry with an annual turnover of $262 million, further underscoring the need to prevent introduction and take swift action when found."
        },
        {
            "text": "Meanwhile, in a woodland near Devon, a ranger walked among dead and dying larch trees, many with stem bleeds. They knew what it was before the diagnostic results came back: Phytophthora ramorum - a destructive plant pathogen responsible for ‘Sudden Larch Death’ - was on the move again, silently reshaping landscapes across the UK. In a five-year period (2009-2014) the UK government spent £21 million on managing and slowing the spread of P. ramorum disease."
        },
        {
            "text": "Two very different environments - a high-tech glasshouse and a commercial forest - yet they illustrate a growing crisis. Across the UK, the introduction of exotic plant pathogens is becoming more common, and these are often not noticed until they spread and start to cause damage, by which time, it is often too late."
        },
        {
            "text": "From wheat rust and potato blight on farms to Dutch elm disease, Phytophthora disease, and ash dieback in forests, the UK is facing a growing plant health crisis. Agriculture, horticulture and the natural environment are under an increasing threat from pests and diseases, driven by a range of accelerating factors:"
        },
        {
            "heading": 2,
            "text": "Why genomics matters now more than ever"
        },
        {
            "text": "Traditional methods of disease detection rely on visible signs. By the time they are visible, pathogens like ToBRFV and P. ramorum have often already spread."
        },
        {
            "text": "This is where the Genomics of Animal and Plant Disease Consortium (GAP-DC) comes in. Led by APHA, in partnership with key organisations across animal and plant health, scientists in the GAP-DC are pioneering new approaches to help us better understand and monitor invasive pathogens of terrestrial and aquatic animals, plants and ecosystems. GAP-DC is integrating both targeted and wide-ranging genomic techniques to enhance early pathogen detection, rapid response and effective disease control."
        },
        {
            "text": "Genomics can now be used to help track, predict and manage plant diseases in real time. Instead of relying solely on visual inspections or traditional diagnostics, genomic surveillance allows researchers to:"
        },
        {
            "text": "Here is what that means in practice:"
        },
        {
            "heading": 2,
            "text": "Looking ahead: a smarter, genomics-driven response"
        },
        {
            "text": "In the near future, genomics, coupled with rapid tests, will allow us early detection and control of ToBRFV outbreaks, helping to limit its spread and reduce both the crop damage and economic losses."
        },
        {
            "text": "For rangers, environmental DNA (eDNA, which is DNA found in environmental samples) monitoring in woodlands could reveal the presence of P. ramorum even before visual signs appear on trees. This would allow forest managers to better target containment zones, reroute public access, or prioritise at-risk areas for intervention. "
        },
        {
            "text": "These scenarios are not science fiction - they are exactly the kind of applied outcomes GAP-DC is actively working towards."
        },
        {
            "heading": 2,
            "text": "A future built on prevention, not reaction"
        },
        {
            "text": "Genomic surveillance is not just a tool for scientists – it is a game-changer for policymakers, farmers, foresters and land managers. By integrating this data into national plant health strategies, we can:"
        }
    ]
}