{
    "url": "https://educationhub.blog.gov.uk/2025/05/how-to-apply-for-30-hours-free-childcare-and-find-out-if-youre-eligible/",
    "title": "How to apply for 30 hours free childcare and find out if you’re eligible",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Childcare",
        "early years"
    ],
    "pub_date": "2025-05-12T09:51:24+01:00",
    "content": [
        {
            "text": "From 12 May 2025, more eligible working parents in England can apply for government funded childcare. This major expansion is helping families nationwide with the cost of quality childcare."
        },
        {
            "text": "Around half a million families have already secured funded places, with 93% of parents getting their first choice of provider according to our Childcare Experiences Survey. Many families are using this support to increase their working hours, particularly those on lower incomes."
        },
        {
            "text": "This childcare offer isn't just about saving money – it also helps children build confidence, learn social skills, and prepare for school."
        },
        {
            "text": "Here we explain the 30 hours funded childcare scheme for working parents and the 15 hours scheme for families on certain benefits, how to access them and apply."
        },
        {
            "heading": 3,
            "text": "15 and 30 hour funded childcare schemes explained "
        },
        {
            "text": "From September, parents working at least 16 hours a week may be eligible for 30 hours of funded childcare, for their children aged at least nine months on or before 31 August. Places are funded from the term after your child turns nine months old until they start reception. "
        },
        {
            "text": "If you are not eligible for 30 hours of funded childcare, your child may be eligible for 15 hours instead. All parents of children aged three to four in England can access a universal offer of 15 hours of government funded early education from the term after their child turns three. It doesn't matter how much you earn or how many hours you work.  "
        },
        {
            "text": "Parents of two-year-olds can also access 15 hours a week of funded early education and childcare if they receive additional forms of support. This includes support like being on Universal Credit and earning less than £15,400 a year, or if your child has an Education, Health and Care Plan, or has been looked after by a local authority. Places are funded from the term after a child turns two. "
        },
        {
            "text": "For all these schemes, the childcare provider must be approved – so informal providers such as grandparents don’t count.  "
        },
        {
            "text": "The funding covers up to 15 or 30 hours of early education and childcare a week for 38 weeks a year. You may be able to spread this funding over more than 38 weeks a year if you take fewer hours over more weeks. You should check with your childcare provider to find out if this is something they offer.  "
        },
        {
            "text": "Some providers may ask you to pay for extra costs like meals, nappies or trips.  "
        },
        {
            "text": "Eligibility depends on whether you’re working, your income, your child’s age and circumstances and your immigration status. Full details about eligibility requirements can be found here."
        },
        {
            "text": "There are different early education and childcare support schemes in Scotland, Wales and Northern Ireland.  "
        },
        {
            "heading": 3,
            "text": "The application process for working parents "
        },
        {
            "text": "To apply for 30 hours government funded childcare, you can sign into your account here.   "
        },
        {
            "text": "You can apply from when your child is 23 weeks old. When you can get your hours from will depend on the date your child turns 9 months old.  "
        },
        {
            "text": "If you want to get 30 hours from September 2025, then you will need to apply by 31 August. You should speak to your provider to confirm you can use your full 30 hours from September.  "
        },
        {
            "text": "You’ll need your Government Gateway user ID to login.  "
        },
        {
            "heading": 3,
            "text": "What do I need to do if I’m already claiming 15 hours of funded childcare as a working parent?  "
        },
        {
            "text": "If you’re already claiming 15 hours and you work at least 16 hours a week, you can keep reconfirming as normal and if you’re still eligible, it will automatically be updated to 30 hours.  "
        },
        {
            "text": "You’ll need to confirm your details are up to date in the usual way and give the code to your childcare provider once you have agreed with them how you would like to use your 30 hours entitlement. You need to agree how many hours you are using from September, which days and billing, terms and conditions with your childcare provider.  "
        },
        {
            "text": "It’s important to remember that codes need to be reconfirmed every three months, so parents applying any time before 1 June may need to reconfirm before taking up their offer, starting in September 2025.  "
        },
        {
            "text": "  "
        },
        {
            "heading": 3,
            "text": "How to claim your 15 hours entitlement "
        },
        {
            "text": "If your child is aged three or four, you can access the universal 15 hours of government funded early education and childcare without making an application yourself. Your childcare provider will handle this for you automatically. You'll simply need to: "
        },
        {
            "text": "For parents of 2-year-olds who receive additional forms of support (such as Universal Credit), you should contact your local council to apply for the 15-hour scheme.  "
        },
        {
            "text": "As with the 30 hours offer, your child becomes eligible from the term after they turn two or three, and the support continues until they start reception class. "
        },
        {
            "text": "This funding provides up to 15 hours of early education and childcare per week for 38 weeks a year. Some providers offer flexibility to spread this funding over more than 38 weeks by taking fewer hours per week. Check with your childcare provider about these options. "
        }
    ]
}