{
    "url": "https://nationalscreening.blog.gov.uk/2025/05/12/uk-nsc-stakeholder-discussion-groups-could-you-help/",
    "title": "UK NSC stakeholder discussion groups: could you help?",
    "authors": [
        "Mike Harris"
    ],
    "categories": [
        "UK National Screening Committee"
    ],
    "pub_date": "2025-05-12T10:22:21+01:00",
    "content": [
        {
            "text": "We recently blogged to thank everyone who took part in our stakeholder engagement survey."
        },
        {
            "text": "Nearly 200 of you responded, giving us valuable feedback from individuals and organisations representing a wide range of roles, experiences and perspectives."
        },
        {
            "text": "We now want to get some more in-depth insights as we seek to build on and improve our stakeholder engagement strategy and activities."
        },
        {
            "text": "We plan to do this by holding small group discussions to explore in detail some of the themes and issues highlighted in the survey responses."
        },
        {
            "text": "The group discussions will be held online in July and last around 90 minutes. We want to involve a broad range of individual and organisational stakeholder voices and perspectives whose feedback will help inform and enhance the way the UK NSC engages with its stakeholders."
        },
        {
            "text": "The groups will be small to ensure discussions can be meaningful and manageable. Spaces will be limited, so we may not be able to accommodate all requests to participate. However, please be assured there will be more opportunities for all stakeholders to provide feedback following these discussions. Watch this space."
        },
        {
            "heading": 2,
            "text": "Keep up to date "
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK NSC. You can register to receive updates direct to your inbox, so there is no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, please email uknsc@dhsc.gov.uk."
        }
    ]
}