{
    "url": "https://hodigital.blog.gov.uk/2020/07/23/not-a-black-and-white-issue-using-racially-neutral-terms-in-technology/",
    "title": "Not a black and white issue: using racially neutral terms in technology",
    "authors": [
        "Christopher Cope",
        "Sanjay Gurung"
    ],
    "categories": [
        "cyber security",
        "Diversity"
    ],
    "pub_date": "2020-07-23T09:45:49+01:00",
    "content": [
        {
            "heading": 3,
            "text": "Using racially neutral terms in technology"
        },
        {
            "text": "In April, the UK National Cyber Security Centre (NCSC) published a blog announcing a significant change to their website, by replacing commonly used cyber security terminologies ‘whitelisting’ and ‘blacklisting’ with racially neutral terms such as ‘allow list’ and ‘deny list’."
        },
        {
            "text": "Whitelist refers to the practice of explicitly allowing access to identified entities while blacklist is a list of entities that are considered untrusted and unacceptable."
        },
        {
            "heading": 3,
            "text": "Home Office Digital, Data and Technology to adopt this approach"
        },
        {
            "text": "This may seem like a small thing – but it’s offensive to many and we in Home Office Digital, Data and Technology support the NCSC stance and will make the same changes to our terminology."
        },
        {
            "text": "We will also encourage people not to use terms like ‘master’ and ‘slave’ for our servers - abhorrent phrases which somehow have become normalised. Using negative or derogatory language for white meaning ‘good’ and black meaning ‘bad’ or ‘not allowed’ or making casual reference to human oppression and tyranny is just not acceptable anymore."
        },
        {
            "text": "Our Deputy Chief Information Security Officer, Kate Stanbury, said:"
        },
        {
            "heading": 3,
            "text": "Tech firms are also using racially neutral terms"
        },
        {
            "text": "Tech firms are now actively discouraging teams from using terminologies that promote racial stereotypes and stigma. For example, a popular programming language, Python, replaced terms ‘slaves’ to ‘workers’ or ‘helpers’ and ‘master process’ to ‘parent process’. In a similar way, Google Chrome has also asked their developers to avoid ‘blacklist’ and ‘whitelist’ in favour of ‘blocklist’ and ‘allowlist’."
        },
        {
            "text": "It’s good news that organisations are taking a similar approach and we know it’s only a small step which may seem insignificant compared to the challenges presented by wider prejudice and offensive language. But it is a small step in the right direction."
        }
    ]
}