{
    "url": "https://dcmslibraries.blog.gov.uk/2022/08/26/coventry-libraries-a-new-home-for-digital-culture/",
    "title": "Coventry Libraries – a new home for digital culture",
    "authors": [
        "Dave Lloyd - Service Development Manager, Coventry Libraries and Information Service"
    ],
    "categories": [
        "Case study",
        "Digital"
    ],
    "pub_date": "2022-08-26T12:58:25+01:00",
    "content": [
        {
            "text": "What 2022 has meant to Coventry"
        },
        {
            "text": "Coventry is the ninth-largest city in England and has a diverse and relatively young population. From May 2021 to May 2022, it held the prestigious title of City of Culture – a celebratory year marked by recovery from the COVID pandemic.  The year saw over a million people attend events and activities (online and in person), creating £172 million of direct investment into the city.  "
        },
        {
            "text": "The key theme for City of Culture was the development of the Coventry Model – co-creation at a local level that told the story of Coventry and its residents in an innovative way.  The provision of greater access to arts and culture was to be achieved by changing people’s lives, building communities and delivering social value that would be experienced long after the year had finished.  "
        },
        {
            "text": "The year as City of Culture was only one element in the plans for Coventry. The Council is also resetting its vision and priorities for the city through its One Coventry Plan 2022-30, recognising the need for people and organisations to work together to create positive differences for local residents.  Residents are also witnessing significant investment in the city, including the transformation of the railway station and the announcement of a major City Centre South regeneration scheme."
        },
        {
            "text": "Where does a library service sit within these plans? "
        },
        {
            "text": "The library service plays an important role in regenerating the public realm, being the original safe place for residents and enabling levelling up across society.  Libraries also play a role in creating a literate and empowered society by tackling inequalities, providing solutions to digital exclusion and being trusted hubs of information. "
        },
        {
            "text": "The year as City of Culture allowed Coventry’s libraries to secure funding from Arts Council England and opportunities to work with partners at a new level to collaborate on Digital Spaces – an ambitious multi-strand digital culture programme.  It was delivered in partnership with The Space (a digital agency established to help promote digital engagement across the arts and culture sector) and the British Film Institute. "
        },
        {
            "text": "What is Digital Spaces?"
        },
        {
            "text": "Designed to bring communities, artists and other creative practitioners together throughout the year, Digital Spaces aimed to expand the library services’ digital and cultural offering by providing an opportunity for people of different backgrounds, interests, experiences and ages to come together to explore the creative possibilities of technology, art and culture.  "
        },
        {
            "text": "The Virtual Reality Library and Immersive Audio Experience"
        },
        {
            "text": "Having previously showcased a Virtual Reality (VR) programme with the BBC and Libraries Connected, it was clear that audiences wanted more opportunity to experience VR in greater depth. We were delighted to partner with The Space to create a programme of high-quality VR content and immersive audio that was accessible to audiences who might never otherwise have a chance to experience it."
        },
        {
            "text": "Public libraries are a perfect space to test the idea that digital technology and creative media can enrich the lives of individuals and communities.  Libraries allow visitors easy access to new experiences in a safe and trusted environment.  By using innovative technologies and creative media solutions libraries can tackle the inequalities in our communities, provide accessible answers to digital exclusion and thus help to level up across society. "
        },
        {
            "text": "To work well in a library setting, the technology had to be easy to use and as stress-free as possible to operate.  Thanks to Redbox VR, we were able to provide robust plug-and-play headsets to four libraries, each one loaded with an easy-to-use app that showcased an award-winning collection of VR content that would appeal to all ages and backgrounds, from the BBC and Diversion Cinema."
        },
        {
            "text": "Alongside the VR content, the BBC’s Research and Development team carefully curated a selection of immersive audio experiences for us, including binaural audio dramas, slow radio and documentaries designed to immerse listeners in an expanded sonic field."
        },
        {
            "text": "Digital arts projects created with Coventry communities  "
        },
        {
            "text": "The VR programme is only part of the story.  In addition, a strand of three community co-creation projects, inspired by the Creative People and Places (CPP) programme, saw commissioned artists work with communities around Bell Green, Foleshill and Tile Hill libraries in a broader digital cultural programme. "
        },
        {
            "text": "Creative groups working out of the library venues were given access to audio-visual archive material relating to Coventry from our project partners, the British Film Institute and the BBC Archives. They used them to create projects unique to their local area. These projects were:"
        },
        {
            "text": "What impact has Digital Spaces had?"
        },
        {
            "text": "The library service already plays a crucial role in regenerating the public realm and levelling up by providing easy access to new cultural experiences. Digital Spaces has allowed Coventry Libraries to continue to reach new and underrepresented audiences and thereby cement the library role of creating a literate and empowered society."
        },
        {
            "text": "Digital Spaces has enriched and empowered communities to shape their own cultural provision, creating a new digital legacy for the city. Coventry Libraries are looking forward to working with The Reel Store in Coventry – the UK’s first permanent digital gallery – and other nationwide partners on new projects in the coming months."
        },
        {
            "text": "Our VR programme is still open to the public, and our library staff continue working with local community groups to develop new digital creative projects. At the same time, library staff are expanding their digital skills in areas such as filmmaking, photography and social media so they can contribute to the digital legacy of the libraries.  "
        },
        {
            "text": "Through our experiences and understanding of what works, future plans include expanding the digital culture offer to other library services in the country. We are also looking at the creation of new commissioning guidelines to ensure creators understand audiences’ needs and drive forward a whole new ‘ecosystem’ of digital content. "
        },
        {
            "text": "The Digital Spaces project has been a catalyst for culture, creativity and innovation that has enriched the lives of local communities by inspiring people and creating a deeper sense of place, pride and identity in Coventry. We are proud to have played such an essential role in placing art and culture at the heart of Coventry’s regeneration."
        }
    ]
}