{
    "url": "https://naturalengland.blog.gov.uk/2022/08/26/more-than-100-hen-harriers-fledge-in-england-for-the-first-time-in-over-100-years/",
    "title": "More than 100 hen harriers fledge in England for the first time in over 100 years.",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Biodiversity",
        "Hen Harriers",
        "Licensing",
        "Protected sites and species",
        "Wildlife"
    ],
    "pub_date": "2022-08-26T06:45:10+01:00",
    "content": [
        {
            "text": "By: John Holmes, NE Strategy Director"
        },
        {
            "text": "This year has seen another encouraging increase in the breeding population of one of our rarest birds of prey. Natural England and partners are pleased to report that a total of 49 hen harrier nests were recorded, and 119 chicks took to the skies. This is the first time in over 100 years that more than 100 hen harrier chicks have successfully fledged in England, showing real progress in efforts to protect and restore their numbers."
        },
        {
            "text": "Hen harriers currently breed on moorland in upland areas of northern England. Lancashire remains the stronghold, with 18 nests in the Bowland region, and there was also a cluster of territories in Northumberland (nine nests). There were ten nests across the Yorkshire Dales and Nidderdale region, seven in the North Pennines, and five in the Peak District. This represents an encouraging increase in numbers across their breeding range compared to the recent past."
        },
        {
            "text": "While 49 nests were recorded, not all were successful. Fifteen failed, including failures subsequently investigated by police, meaning the 119 chicks came from 34 successful nests. On a number of occasions, the same pair re-nested after a failure, and the total also includes polygamous groups where one male has several nests. The number of actual breeding pairs will therefore be smaller than the number of nests."
        },
        {
            "text": "Hen harriers were driven to extinction in mainland Britain in the 19th century and have remained rare since recolonising England in the 1960s. This is due to illegal persecution and disturbance, primarily in areas associated with grouse shooting. The Hen Harrier Action Plan, published by Defra in 2016, sets out a number of actions aiming to increase hen harrier numbers, mostly designed to reduce conflict with grouse shooting interests and associated persecution. These include supporting police detection and enforcement of bird of prey crime, as well as licensing other activities intended to promote the coexistence of hen harriers and grouse shooting, such as the provision of substitute food to nesting harriers (diversionary feeding) and a trial of brood management. Work on all of these actions has been under way over the past six years, and careful analysis, particularly of survival rates, will be required to better understand which actions have helped to drive the increases in numbers we are seeing, and to set the direction for future work to sustain them."
        },
        {
            "text": " "
        },
        {
            "text": "A broad partnership effort \nThis year, hen harriers nested on land managed for a number of purposes, often in combination, including forestry, water quality improvements, carbon sequestration, amenity, nature conservation and driven grouse shooting. We are grateful for the efforts of all of our partners to monitor, protect and manage Hen Harrier nests and breeding habitats. We work closely with RSPB staff who monitor nesting attempts on RSPB reserves, and in Bowland through liaison with landowners and managers. We are also grateful for the contributions of volunteer Raptor Study Groups to nest monitoring, and to landowners and authorities including National Parks & AONBs, the National Trust and Forestry England."
        },
        {
            "text": "Natural England field staff lead on liaison with privately-owned grouse shooting estates, working in partnership with those land managers that are encouraging hen harriers to nest successfully alongside their wider estate management for grouse and other wildlife. Natural England staff organise the monitoring and tagging of these nests, and provide support and guidance on diversionary feeding and brood management. We recognise the efforts put into these activities by these estates and their staff, as well as those of our other partners in the Brood Management Trial. The total number of 119 fledglings this year includes 13 brood-managed chicks, taken from four nests on grouse moors and reared to fledging in captivity. We were pleased that all 13 were released as healthy full-grown birds, and also to see brood-managed birds from previous years breeding successfully (five individuals, producing 10 chicks between them in 2022). A formal assessment and evaluation of both the practicalities of this technique and its role in changing attitudes to hen harriers will inform a decision on its future role."
        },
        {
            "text": "Satellite tagging \nNatural England field staff have fitted satellite tags to 18 of this year's fledglings to learn about their movements and causes of any deaths. The total includes 12 Moorland Association funded tags fitted to brood-managed birds (one was released untagged as a welfare precaution) and six tags fitted to nestlings from wild nests (named Jenny, Bernie, Craig, Reuben, Penelope and Nicola). All of these have been added to the table of tagged birds published on the update page. Together with the 14 birds tagged in previous years that are still alive and transmitting, we are now tracking 32 birds."
        },
        {
            "text": "Since the last update in March six of the tagged birds monitored by Natural England have been lost; either confirmed or presumed dead. As covered in our previous blog, ‘actions taken when a tagged bird is lost’, no efforts are spared to find and determine the cause of death of tagged birds, working with our partners in the Police and always considering the possibility that they could have been illegally killed. In March, a 2021 brood-managed bird, R1-M2-21, was found dead. Tests including a post mortem examination were carried out, led by our partners at the Institute of Zoology, during which the bird was found to have been suffering from symptoms of respiratory disease and tested positive for avian influenza (AI) virus and Capillaria spp nematode worms, either, or both, of which may have been associated with death. This was a concerning finding, and we are considering the implications of AI on our investigations into bird deaths and our wider Hen Harrier work."
        },
        {
            "text": "The four other birds lost since March are:"
        },
        {
            "text": "Any further findings and results of investigations will be covered in future blog posts."
        },
        {
            "text": "Next steps \nSome elements of this hen harrier recovery work have remained controversial, but we remain committed to strengthening our partnerships to tackle persecution and effectively support hen harrier recovery. This increase in breeding numbers in 2022 is really encouraging and we would like to thank all those who are working to support a continued increase in breeding hen harriers."
        },
        {
            "text": "These include: Natural England, Defra, RSPB, Forestry Commission, Moorland Association, United Utilities, National Trust, Hawk and Owl Trust, International Centre for Birds of Prey, Yorkshire Dales National Park Authority, Northumberland National Park Authority, Peak District National Park Authority, Nidderdale & Forest of Bowland Areas of Outstanding Natural Beauty, Northumberland Wildlife Trust, British Association for Shooting and Conservation, Game & Wildlife Conservation Trust, local police forces and the National Wildlife Crime Unit, various Estates and their representatives, and individuals including landowners, farmers, academic researchers and volunteer raptor enthusiasts."
        }
    ]
}