{
    "url": "https://deframedia.blog.gov.uk/2022/08/26/over-100-hen-harrier-chicks-fledge-in-england-in-2022/",
    "title": "Over 100 hen harrier chicks fledge in England in 2022",
    "authors": [
        "defrablogs"
    ],
    "categories": [
        "Natural England",
        "Uncategorized",
        "Wildlife"
    ],
    "pub_date": "2022-08-26T18:02:48+01:00",
    "content": [
        {
            "text": "There has been widespread coverage today in the Guardian, Independent, Metro, BBC News, Yorkshire Post, Leeds Chronicle, Evening Standard and other publications of Natural England’s announcement that more than 100 rare hen harrier chicks have fledged in England this year. There was also broadcast coverage on BBC Radio Norfolk and other regional radio stations."
        },
        {
            "text": "This year has seen another encouraging increase in the breeding population of one of our rarest birds of prey. Natural England and partners are pleased to report that a total of 49 hen harrier nests were recorded, and 119 chicks took to the skies. This is the first time in over 100 years that more than 100 hen harrier chicks have successfully fledged in England, showing real progress in efforts to protect and restore their numbers."
        },
        {
            "text": "Hen harriers were once found across upland and lowland Britain including throughout many English counties. However after 1830 they became exceptionally rare breeding birds in England due to persecution, which was made illegal in the 1954 but continues in some places today."
        },
        {
            "text": "Natural England chair Tony Juniper said:"
        },
        {
            "text": "This is the sixth successive year of increases, following a low in 2016 when only eight chicks fledged. There were 49 nests recorded in 2022, of which 34 were successful in producing chicks. Lancashire remained a stronghold, with 18 nests recorded in Bowland, and there was also a cluster of territories in Northumberland (nine nests). There were 10 nests across the Yorkshire Dales & Nidderdale region, seven in the North Pennines, and five in the Peak District. This represents an encouraging increase in numbers across their range compared with the recent past, when only a few pairs nested each year, mostly in Bowland."
        },
        {
            "text": "Read more about the numbers, the recording of hen harriers and methods used to support their recovery in our Natural England blog."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}