{
    "url": "https://environmentagency.blog.gov.uk/2022/08/26/supporting-farmers-during-drought/",
    "title": "Supporting Farmers during Drought",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Uncategorized",
        "Water"
    ],
    "pub_date": "2022-08-26T18:29:38+00:00",
    "content": [
        {
            "text": "What are the water issues for farmers?"
        },
        {
            "text": "July was the driest July in England since 1935, and since records began for the East and Southeast.  Most of the country is now in drought. As we approach the end of the summer, water is still as critical as ever for farmers.  Many farmers have limited water remaining in their storage reservoirs and little volume left on their annual licensed abstraction so are taking difficult decisions on which crops to irrigate with this precious resource. Many farmers have stopped irrigating fields to save water for harvesting crops. The harvesting of some root crops like potatoes requires water to soften dry hardened soils sufficiently so that crops are not bruised. Farmers are also looking ahead to their water needs for the winter to help establish newly sown and planted crops such as brassicas and cereals and to refill their reservoirs ahead of next year’s irrigation season."
        },
        {
            "text": "It’s not just in the arable sector where water is crucial, livestock farmers are also being affected. Wet fencing to manage livestock on marshland grazing is drying out and abstractors who normally take water from ditches are being asked to stop to ensure the fencing is still effective. With the lack of rain and grass dying off, farmers are already having to feed their animals with winter forage. This means, combined with reduced silage production, they may need to buy in additional forage later in the winter. Milk production is already down. Some support is already available for farmers through such actions as temporarily easing environmental stewardship scheme rules.  Support for farmers on dry weather impacts - GOV.UK (www.gov.uk)"
        },
        {
            "text": "Commercial fish farms are reliant on having adequate river flows and have been impacted by the dry weather with stock being held back and many fisheries are closed as water temperatures are too high."
        },
        {
            "text": "What is the Environment Agency doing to help farmers access water?"
        },
        {
            "text": "The Environment Agency is working closely with farmers to support the industry with a package of measures to help access water to safeguard food production and animal welfare without causing harm to the environment. These include options for farmers to access water, with short term actions such as water rights trading between licence holders and adding abstraction points and volumes where the Environment Agency can ensure that the environment and other users will be protected. Where there is a real or imminent threat to crops and livestock, farmers can contact the Environment Agency to discuss availability of water. While numbers of these requests (currently in the low tens) have been relatively few compared to the many thousands of agriculture and irrigation licences, we know that as the dry conditions continue, we will see more farmers come forward for help harvesting crops and refilling their storage reservoirs.  We are operating our water transfer schemes to help maintain river flows and groundwater levels to support wildlife and facilitate abstraction. The Environment Agency is now actively looking at how they can potentially support farmers accessing water for early refill of winter storage reservoirs. We are also carrying out irrigation patrols and other compliance checks to ensure all abstractors are complying with their licence conditions to help protect water availability."
        },
        {
            "text": "What are farmers doing to help themselves?"
        },
        {
            "text": "Farming organisations including the National Farmers Union (NFU), Country Land and Business Association (CLA) and Agriculture and Horticulture Development Broad (AHDB) are offering guidance to their members and highlighting the need for farmers to:"
        },
        {
            "text": "What more can be done to help farmers access water?"
        },
        {
            "text": "More information is available at https://www.gov.uk/guidance/water-abstraction-flexible-options-in-exceptional-dry-weather which includes a link on how to formally apply to change your licence. By making these changes (ideally over the winter period when businesses have potentially more time) farmers are making themselves more resilient to dry weather and the longer-term effects of climate change. Farming Advice Newsletters  provide useful abstraction reminders and the Farming Advisory Service also publish our irrigation prospects in the spring."
        },
        {
            "text": "Through the National Drought Group we are encouraging sectors to work together and asking water companies to consider where they may be able to support farmers locally."
        },
        {
            "text": "Longer term, the agricultural sector, along with other stakeholders are part of the five Water Resources planning groups working on Regional Plans under the National Framework to understand and plan for the water needs for England from 2025 to 2050 and beyond Link to Meeting our future water needs: national framework for water resources - accessible summary."
        },
        {
            "text": "The Environment Agency’s Executive Director for Environment and Business, Harvey Bradshaw, recently met with representatives of the National Farmers Union, including Deputy President Tom Bradshaw, in the Thames Valley to discuss the challenges facing dairy farmers. This included the impacts of the current drought on farming and concerns for next year if we don’t receive significant rainfall over the autumn and winter."
        },
        {
            "text": "The Environment Agency has put in place a package of measures to help farmers access water to irrigate crops and water livestock."
        }
    ]
}