{
    "url": "https://history.blog.gov.uk/2022/08/26/the-art-of-delivery-the-prime-ministers-delivery-unit-2001-2005/",
    "title": "The Art of Delivery: The Prime Minister’s Delivery Unit 2001-2005",
    "authors": [
        "Dr Michelle Clement"
    ],
    "categories": [
        "Prime Ministers and No. 10",
        "Researcher in residence"
    ],
    "pub_date": "2022-08-26T11:29:51+01:00",
    "content": [
        {
            "text": "My name is Dr Michelle Clement and I am Researcher in Residence at No.10 Downing Street. This role forms part of a partnership between No.10 Downing Street and The Strand Group, which is based in The Policy Institute at King’s College London. The Researcher in Residence programme aims to investigate and explain the history of No.10 and the role of Prime Minister."
        },
        {
            "text": "This blog post examines the Prime Minister’s Delivery Unit 2001 to 2005, which was created during Tony Blair’s premiership. The Prime Minister’s Delivery Unit acted as a nexus of power between No.10 and Whitehall."
        },
        {
            "heading": 2,
            "text": "The Prime Minister’s Delivery Unit 2001 – 2005"
        },
        {
            "text": "The Prime Minister’s Delivery Unit was set up in 2001 to monitor and accelerate the implementation of Prime Minister Tony Blair’s public service reform priorities in health, education, transport, crime and asylum. It was designed and led by Michael Barber who developed a methodology, which then Treasury official Nicholas (now Lord) Macpherson called ‘deliverology’."
        },
        {
            "text": "But why was a unit like this needed? To answer this, I will provide some background context on the then Prime Minister and his government."
        },
        {
            "heading": 2,
            "text": "Why was the Delivery Unit created? "
        },
        {
            "text": "When a newly elected Prime Minister arrives at No.10 Downing Street, the workplace and often home of the British Prime Minister, they quickly find out that the levers of power they expect to pull must in fact be adapted to meet their objectives and style of working. As Prime Minister Harold Wilson reflected in 1965, one year into his premiership:"
        },
        {
            "text": "'No.10 is what the prime minister of the day makes it. The levers of power are all here in No.10 […] The ability of the prime minister to use them depends on the prime minister being in touch with what is going on – and not going on.'1"
        },
        {
            "text": "In 1997, New Labour under Tony Blair won the biggest majority since the Second World War. Nevertheless, two years later Blair had become frustrated with the lack of progress on public service reform, a priority for his government."
        },
        {
            "text": "Speaking to the Venture Capital Association in 1999, he complained of having ‘scars on my back’ as a result of trying to reform public services. Blair’s rhetoric was a reflection of his own frustration at the challenge of learning how to govern, having never been in government before, but also at the many resistances he found. During his first couple of years as Prime Minister, Blair was still deciding how to make his public service reform agenda more radical yet practical."
        },
        {
            "text": "From 1998, the New Labour government began to significantly increase investment in public services, but resources alone would not lead to the successful delivery of reforms. Within Whitehall, the Prime Minister told his officials and aides that 1999 should be the ‘Year of Delivery.’2"
        },
        {
            "text": "The implementation of reform agendas had long been an issue for prime ministers and many had set up their own units to promote particular priorities. For example, Edward Heath formed the Central Policy Review Staff, Harold Wilson established the Policy Unit, and Margaret Thatcher created the Efficiency Unit. Yet responsibility for delivering specific public service outcomes had historically not been viewed as a traditional role for senior civil servants.  The Delivery Unit was the first unit to establish a robust framework, which pursued measurable improvements in public services and began to alter Whitehall’s culture towards delivery."
        },
        {
            "text": "Ahead of the 2001 General Election, Blair advanced his vision for a bold domestic agenda. With New Labour confidently expecting to win a second term, Blair’s advisers and civil servants in No.10 and the Cabinet Office began to consider how the centre of government could be reformed. One of the gaps identified was the need for a clear delivery operation at the heart of government."
        },
        {
            "heading": 2,
            "text": "The formation of the Prime Minister’s Delivery Unit "
        },
        {
            "text": " Towards the end of the first term, Blair and his advisers were increasingly impressed by the progress being made in education reform, and particularly by the key person working to deliver this change – Michael Barber. Prior to 1997, Barber had a varied and established career in the education sector, including as a secondary school teacher in London and Zimbabwe, a policy official at the National Union of Teachers (NUT), Chair of Education for Hackney, and as a Professor of Education at Keele University and then at the Institute of Education. After Blair was elected Leader of the Labour Party, Barber began advising on and planning New Labour’s education policy."
        },
        {
            "text": "In 1997, on taking up his position in the (then) Department for Education and Employment under Secretary of State David Blunkett, Barber set up and headed the Standards and Effectiveness Unit. The aim of the unit was to ‘change the culture of the department as well as implement the schools reforms.'3 His reforms and approach to implementing them won respect and built good relations with many ministers and civil servants. He had entered government in 1997 as a special adviser but by 2001 he had made the transition to become a civil servant."
        },
        {
            "heading": 2,
            "text": "A renewed mandate "
        },
        {
            "text": " New Labour resoundingly won the General Election in June 2001. They had fought the election campaign under the banner of ‘a lot done and a lot more to do’ with a focus on ‘radical’ public service reform, alongside huge investment. Much of the first term had been spent in perpetual campaigning mode to ensure a second victory at the polls and allow for a ‘quantum leap’ during a second term."
        },
        {
            "text": "Shortly after the election, Barber was asked by Blair to set up a Delivery Unit. The new unit would be based on a proposal which Barber had drafted with the Prime Minister’s Chief of Staff, Jonathan Powell, and Principal Private Secretary to the Prime Minister, Jeremy Heywood, in the weeks before the election. The Delivery Unit would primarily work with four ‘delivery departments’: the Department for Education and Skills, the Department of Health, the Department for Transport and the Home Office."
        },
        {
            "heading": 2,
            "text": "How did it work in practice? "
        },
        {
            "text": "Three key elements of Barber’s original design brief proved useful."
        },
        {
            "text": "First, that there would be ‘rigorous and relentless focus on a relatively small number of the Prime Minister’s key priorities.'4 This meant that Blair and his government were required to identify and adhere to a clear set of domestic objectives."
        },
        {
            "text": "Second, Barber decided to keep the Delivery Unit small (around 40 members of staff) which allowed it be agile when developing a delivery framework. He was also keen to avoid the Delivery Unit becoming a large bureaucratic unit overseeing an even larger bureaucracy."
        },
        {
            "text": "Third, the initial design tied in the Prime Minister’s time, the most valued resource in Whitehall, to the delivery of priorities by installing stocktake meetings. The Prime Minister would meet with the relevant Cabinet minister, Permanent Secretary, Chief Secretary to the Treasury, Treasury officials and the Delivery Unit team led by Barber, to discuss the status of each target, every two-to-three months for each policy area."
        },
        {
            "text": "This ensured that the Prime Minister was regularly engaged with the work of the Delivery Unit and consistently investing political capital in his domestic agenda. The stocktake meetings proved to be an effective forum for collective discussion and accountability, chaired by the Prime Minister."
        },
        {
            "text": "The Delivery Unit and wider government approach to targets and delivery was seen as controversial by some who thought it contributed to an inflexible target-led culture of top-down policymaking, from No.10 to departments. The new performance measurement framework certainly put more pressure on departments and the frontline to be accountable for delivering targets linked to major taxpayer-funded investment."
        },
        {
            "heading": 2,
            "text": " Challenges to success"
        },
        {
            "text": " During the course of Barber’s tenure as Head of the Prime Minister’s Delivery Unit 2001-05, the unit faced many challenges in forming resilient working relationships with secretaries of state, permanent secretaries and special advisers. The Prime Minister’s attention on domestic delivery was also challenged by unforeseen events, most notably 9/11."
        },
        {
            "text": "Throughout Blair’s government, there was a second centre of power to the Prime Minister – the Treasury under the Chancellor of the Exchequer, Gordon Brown. The ensuing rivalry between the two leaders and institutions became legendary in the history of British government."
        },
        {
            "text": "To be effective, the Delivery Unit had therefore to skilfully develop good relations with No.10 and the Treasury as well as Cabinet ministers, civil servants and special advisers in delivery departments. Under Barber’s leadership, the Delivery Unit was broadly able to do this. Barber secured an office in No.10 Downing Street, and the Delivery Unit was institutionally part of No.10 and the Cabinet Office but physically based within the Treasury (from 2003). This allowed the Delivery Unit to act as a nexus between these bases of power, on matters of public service delivery."
        },
        {
            "text": "Over time, the Delivery Unit began working in collaboration with Treasury officials to align the Prime Minister’s targets with the Treasury’s own performance measurement framework for departments – Public Service Agreements (PSAs). During the 2002 and 2004 spending reviews, the Delivery Unit became closely involved and then integrated into assessing the ‘deliverability’ of departments’ new plans for funding and their associated PSA targets."
        },
        {
            "text": "Blair’s planning for his second term was irrevocably changed on 11th September 2001 by the terrorist attacks in the United States. In the aftermath of 9/11, Blair created a ‘war cabinet’ which held daily meetings for a month and, by November 2001, Britain had deployed troops in Afghanistan as part of a US-led coalition."
        },
        {
            "text": "Barber quickly recognised that the new foreign focus for the Prime Minister could be overwhelming in the next few months and beyond. The Delivery Unit was however able to adapt and continue its work with departments, keeping a determined domestic focus. The first Delivery Report was produced which detailed the planning and progress of the Prime Minister’s priorities."
        },
        {
            "heading": 2,
            "text": " What difference did the Prime Minister’s Delivery Unit make? "
        },
        {
            "text": " Prime ministers and their governments typically spend a great deal of time on policy – developing ideas, building support and then securing the passage of reforms through Parliament. This process is a massive task."
        },
        {
            "text": "But governments often spend less time monitoring the implementation of reforms and problem-solving where gaps in capacity to deliver emerge within departments. The disparity between a focus on generating policy rather than pursuing outcomes can become a problem for a prime minister yet the UK lacked a framework for delivery until 2001. Indeed the UK’s Delivery Unit was the first of its kind in the world, and other countries would soon be influenced by its approach."
        },
        {
            "text": "The Prime Minister’s Delivery Unit did manage to assist Blair’s government in improving performance in the vast majority of target areas. By the summer of 2005, there was progress in all priority areas in health, with key targets on Accident & Emergency waiting times and GP appointments met. In education, there had been progress on the majority of priority areas, though targets on literacy and numeracy had been missed. In the Home Office, there had been improvements in every target area. On transport, the rail punctuality target had been hit but the road congestion target had been missed."
        },
        {
            "text": "The Delivery Unit kept Blair focused on his short to medium term priorities throughout war and an ever-evolving ambitious domestic reform programme. When his time and attention was directed on these other aspects of governing, the Delivery Unit continued to work in his name, to maintain momentum."
        },
        {
            "text": "Relationships were the lynchpin of the Delivery Unit. The Unit and its Head had to simultaneously:"
        },
        {
            "text": "Simon Rea, who worked for the Delivery Unit under Barber reflected, ‘With the right relationships we could achieve almost anything (and often did) and without it we could achieve nothing.'5"
        },
        {
            "text": "As Head of the Delivery Unit, Barber’s ability to form such relationships was critical to the ‘art of delivery’, without which the ‘science of delivery’ could not have been fully operationalised. To be effective, this alchemy had to be continuously cultivated to create the conditions for successful delivery in government."
        },
        {
            "text": "Though it was created fundamentally as a lever of power for the Prime Minister, the Delivery Unit also became a valuable tool for Cabinet ministers and their departments, including Gordon Brown and the Treasury. It improved their capacity to deliver and offered consistent access to the Prime Minister to collectively discuss public service reform, based on agreed performance data."
        },
        {
            "text": "Speaking to the Strand Group at King’s College London in 2015, Blair explained that Barber’s delivery approach with the PMDU was ‘quite revolutionary, more so than we realised at the time.’6. A former Cabinet minister in charge of a delivery department during Blair’s second term reflected that, ‘It was probably the biggest single contributor’ to the delivery of public service reform."
        },
        {
            "text": "The Prime Minister’s Delivery Unit was in many ways a distinctly new invention. Though its lineage can be linked to various prime ministerial units which were created in the twentieth century, with the aim of improving the effectiveness of British government."
        },
        {
            "text": "Previous blog by Dr Michelle Clement: ‘The Queen and her Prime Ministers’"
        },
        {
            "text": "Dr Michelle Clement is Lecturer and researcher on government reform and delivery at The Strand Group, King’s College London and Researcher in Residence at No.10 Downing Street. @MLClem"
        }
    ]
}