{
    "url": "https://environmentagency.blog.gov.uk/2022/04/04/environment-agency-scoops-not-one-but-two-awards-at-the-annual-edie-awards/",
    "title": "Environment Agency scoops not one, but two wins at annual Edie sustainability awards!",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Other areas of our work"
    ],
    "pub_date": "2022-04-04T14:00:37+00:00",
    "content": [
        {
            "text": "Net Zero Carbon Strategy of the Year – reflections from Van Griffiths"
        },
        {
            "text": "Simon Dawes and I almost didn’t make it to the EDIE Awards. We had both succumbed to Covid in the fortnight before the glittering event. We kept on doing our lateral flow tests until they were clear, and we were both glad we made it, as we came home with two entirely unexpected surprises: Awards for Net Zero Carbon Strategy and Net Zero Leader of the Year."
        },
        {
            "text": "EDIE was founded twenty years ago and has since grown into the leading UK network for sustainability, energy, and environmental professionals. EDIE is industry-led and through its website, content and events, it helps organisations across the UK to tackle the climate and nature emergencies, and transform our businesses for good."
        },
        {
            "text": "The EDIE Awards really count, as they are a public ratification from our expert peers, that the EA is on the right track with regards to our net zero work.  This year, there were a record number of entries, with 178 finalists in 24 categories, net zero being one of the most hotly contested.  The big banks and big businesses were all represented, so it was tremendously encouraging to know that our plan stands up."
        },
        {
            "text": "There was a lovely moment, just before they announced the winner. Chris Packham, who was hosting the event, said he wanted to take a moment to pay tribute to the EA “unsung heroes”.  And everyone clapped. Simon and I blushed and told each other how much we wished that everyone across the EA who had helped to create our new strategy - and there are so many of you, right across the business - could have been there to hear his words, and to celebrate with us."
        },
        {
            "text": "It was a shock to win and a timely reminder that WE CAN DO THIS, and that what we do really does matter: we are in a critical decade for the history of our planet and we all need to step up, or stand aside now.  We have much work to do across the EA on net zero this year - in key areas such as carbon reporting, green financing and offsetting. But just for one night it was great to stop, and pause, and recognise all we have already done together, to get the EA to this point, so we can truly “walk the walk” and turn our words into vital action over the coming decade."
        },
        {
            "text": "You can have a look at our now officially award-winning net zero strategy here."
        },
        {
            "text": " "
        },
        {
            "text": "Net Zero Leader of the Year – Simon Dawes"
        },
        {
            "text": "It’s great to be recognised as a leader in the area of delivering on net zero.  When people ask “What did you do in lockdown?” I can safely reply with “Developed a plan to move our organisation to be Net Zero by 2030.”"
        },
        {
            "text": "Whilst it is flattering and humbling to be singled out, this has been about pulling us all together and focussing us on the right goal but the delivery is down to all of us.  Direction and ambition are critical but it is the strength of team and everyone playing their part that will enable us to hit our goals."
        },
        {
            "text": "In announcing the winner in this category, the judges particularly highlighted the support from our board, the upskilling of our people, the way we have built net zero into our governance and targets, and how it is being woven into our decision making, such as in the FCRM business case templates.  We now need to replicate this approach throughout all our thinking and decision making to make net zero just how we do things.  We need to do this with urgency and teamwork."
        },
        {
            "text": "So, this award, alongside the Net Zero Carbon Strategy award is external recognition that we have laid down a brilliant plan in a brilliant way.  We now need to execute the plan.  With the dedication of Environment Agency colleagues, I know we can do that, if we put all the right pieces in the right places."
        },
        {
            "text": "We’re pleased to have been recognised with these awards, because it means we’re on the right track and can share our experiences to help other people, partners and organisations on their net zero journeys as well. Together, we can protect people, enhance nature, tackle climate change, and work towards a better future."
        },
        {
            "text": "Have questions, comments, or suggestions? Get in touch with the EA net zero team: EANetZero@environment-agency.gov.uk"
        },
        {
            "text": " "
        }
    ]
}