{
    "url": "https://educationhub.blog.gov.uk/2022/04/04/how-we-are-supporting-families-across-the-country-with-family-hubs/",
    "title": "Family Hubs: how we are supporting families across the country",
    "authors": [
        "media officer"
    ],
    "categories": [
        "Families"
    ],
    "pub_date": "2022-04-04T10:52:27+01:00",
    "content": [
        {
            "text": "Family Hubs offer help and support to families, from early years support to parenting classes, all of which can make a difference – particularly to those families who are going through a tough time."
        },
        {
            "text": "We have announced funding to create a new network of family hubs to bring together and transform local services, as evidence shows some of the most disadvantaged families don’t access these vital services."
        },
        {
            "text": "Below is what you need to know about the family hubs programme and how it can benefit your family."
        },
        {
            "heading": 3,
            "text": "What are family hubs? "
        },
        {
            "text": "Family hubs are one-stop-shops where families can access important services."
        },
        {
            "text": "An effective family hub acts as a single ‘front door’, making it easier for families to get the help they need, and to improve the support on offer. This can include parenting support and infant feeding advice."
        },
        {
            "text": "Family hubs are for families with children of all ages, but with a great Start for Life (the critical 1,001 days from conception to age 2) offer at their core. This includes mental health advice for new mums in the weeks immediately before and after birth and support for parents to build strong relationships with their babies."
        },
        {
            "heading": 3,
            "text": "What have you announced? "
        },
        {
            "text": "75 local authority areas have been confirmed as eligible for a share of £302 million to create a new network of family hubs to bring together and transform local services."
        },
        {
            "text": "This delivers on a manifesto commitment to champion family hubs, which can help families access support including parenting classes and infant feeding advice, as well as ‘wrap-around’ services such as support for domestic abuse or substance misuse."
        },
        {
            "heading": 3,
            "text": "Why are family hubs so important?"
        },
        {
            "text": "All families need a bit of help at times. An effective family hub will make it easier for parents to get support and ensure better outcomes for them and their children."
        },
        {
            "text": "For the youngest children, parent-infant relationships are crucial in the early years, and babies need strong and nurturing interactions with their caregiver as a foundation for lifelong mental health."
        },
        {
            "text": "Support at the right time also helps to improve children’s mental health and life outcomes and parents and carers also benefit from support for their wellbeing and mental health."
        },
        {
            "heading": 3,
            "text": "Who can benefit from family hubs and where can I go to get support? "
        },
        {
            "text": "A family hub supports families from pregnancy through early years and later childhood, up to the age of 19 (or 25 for young people with special educational needs and disabilities)."
        },
        {
            "text": "Family hubs can support all parents and carers, including those with babies and very young children, with additional help on offer for those who need it most."
        },
        {
            "text": "For information on what is available in your area, search for your council’s local ‘family information service’."
        },
        {
            "text": "Watch Becky tell us how her local Family Hub has made a difference for her and her son, Leo."
        },
        {
            "text": " "
        }
    ]
}