{
    "url": "https://civilservice.blog.gov.uk/2022/04/04/never-been-to-csl-heres-why-you-should-really-go/",
    "title": "Never been to CSL? Here's why you should really go!",
    "authors": [
        "Lorraine McBride, Editor of the Civil Service Blog Channel"
    ],
    "categories": [
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Ambitious Civil Service",
        "An Innovative Civil Service"
    ],
    "pub_date": "2022-04-04T08:49:32+00:00",
    "content": [
        {
            "heading": 3,
            "text": "An event of learning and discovery, Civil Service Live 2022 is back with a six-date tour spanning five cities, bringing together civil servants for inspiring speaker sessions rich with opportunities."
        },
        {
            "text": "Civil Service Live is one of Europe’s biggest corporate training events, unlike any other. It offers tailored learning and development created for civil servants by civil servants making it an unmissable event. For two years, it moved online when the live event fell victim to the pandemic. Now as we return to the workplace again, it’s back with a line-up curated by organisers that promises to be bigger and better than ever. "
        },
        {
            "text": "Inspiring sessions"
        },
        {
            "text": "There will be keynote talks from Cabinet Secretary Simon Case, permanent secretaries and senior leaders plus many guest speakers. You can gain insight from the largest professions in government, as well as try one-to-one mentoring sessions, workshops and seminars. Expect a series of more than 60 inspiring sessions delving into the three themes of A Modern Civil Service: Skilled, Innovative and Ambitious."
        },
        {
            "text": "What to expect"
        },
        {
            "text": "Civil Service Live is an opportunity to engage with other civil servants and hear from thought-provoking speakers sharing their experiences, knowledge and expertise. You can expect to learn new facts, meet new people and join in interactive sessions. Look out for Developing Your Skill for Future Challenges, A Civil Service Fit for a Digital Age and Leading to Deliver - a taster session that aims to give practical leadership tips."
        },
        {
            "text": "Steer Jen’s Journey"
        },
        {
            "text": "Curious minds might opt for The Armchair Analyst where a fictional ‘Jen’ has an important policy issue she needs to analyse and solve, and needs your help. You’ll steer Jen’s journey through the world of data analysis. There are different ways to crack this nut, but which will you choose? And if you’re short of inspiration, check out Smash the Glass Ceiling where staff share inspiring personal stories on how they carved their Civil Service careers despite obstacles they’ve faced along the way. "
        },
        {
            "text": "Line-up"
        },
        {
            "text": "Other top civil servants appearing at Civil Service Live include: Professor Chris Whitty, Jim Harra, Angela MacDonald, Head of the Fraud Profession Laura Eshelby, Tamara Finkelstein and Chief Commercial Officer Gareth Rhys Williams."
        },
        {
            "text": "Organisers are also expecting a few ministers to make an appearance, with names being kept under wraps for now!"
        },
        {
            "text": "Speaker sessions"
        },
        {
            "text": "Flagship sessions include a live Q&A where you can quiz the Head of the Civil Service, Simon Case [left] and CS Chief Operating Officer, Alex Chisholm. You’ll even have the opportunity to witness first-hand the permanent secretaries’ weekly ‘Wednesday Morning Colleagues’ meeting when they get together to discuss key topics affecting the government. "
        },
        {
            "text": "Rock ballads"
        },
        {
            "text": "Not all speakers are Senior Civil Servants; one of the most popular sessions is hosted by the pensions team. Last year, pensions presenter Andrew Jones set their high-octane session to classic rock ballads, which went down a storm. "
        },
        {
            "text": "Exhibition halls in London and Edinburgh will host networking areas with hubs and activities from the Modernisation and Reform team at other locations. If you’ve got a project or piece of work you think other civil servants need to know about, why not apply for an exhibition stand? "
        },
        {
            "text": "Exhibition hubs in all locations will host sessions from  some of the Civil Service’s major professions conveying their aims, objectives and work. The goal is to arm delegates with fresh insight across different parts of the Civil Service. "
        },
        {
            "text": "Ask Alex"
        },
        {
            "text": "Cabinet Office Permanent Secretary Alex Chisholm said: “What I like most about Civil Service Live is the chance to hear what is working well across the service and to network informally with colleagues. After two years of online conferences I am really looking forward to seeing people in person, reconnecting with old friends and getting to know new colleagues.”"
        },
        {
            "text": "Can’t make it?"
        },
        {
            "text": "Don’t worry, the speakers’ sessions will be recorded and available to watch on demand after the event."
        },
        {
            "text": "Save the date"
        },
        {
            "text": "Registration is now open on the Civil Service Live website."
        },
        {
            "text": "Volunteers at CSL - we need you!"
        },
        {
            "text": "We’re looking for volunteers to make CSL extra special. "
        },
        {
            "text": "Our amazing volunteers give up their time to manage sessions and help every guest enjoy a smooth, glitch-free learning day. You’ll welcome colleagues to venues and help them find their way, accompany our speakers including Senior Civil Service leaders, oversee the sessions, manage attendees, and much more! "
        },
        {
            "text": "As a volunteer, you must have a can-do, friendly and problem-solving attitude, be flexible, hard-working, and willing to pitch in. Civil servants with a smattering of Welsh are particularly welcome to support our Cardiff event! If you’re interested in volunteering at CSL, then register your interest now. "
        },
        {
            "text": "You can find out more on the Civil Service Live website."
        }
    ]
}