{
    "url": "https://insidedio.blog.gov.uk/2022/04/04/the-next-step-on-our-journey-to-transform-accommodation-services-for-armed-forces-families/",
    "title": "The next step on our journey to transform accommodation services for Armed Forces families",
    "authors": [
        "Air Commodore James Savage"
    ],
    "categories": [
        "Accommodation",
        "Future Defence Infrastructure Services (FDIS)"
    ],
    "pub_date": "2022-04-04T15:52:20+00:00",
    "content": [
        {
            "text": "Our Armed Forces and their families have no real choice where they serve, or when and how frequently they move. More than 39,000 families live in military homes across the UK."
        },
        {
            "text": "Therefore, it’s vital we ensure homes of the right quality are available for them wherever and whenever they are assigned."
        },
        {
            "text": "Having lived in Service Family Accommodation (SFA) for much of my RAF career, I am passionate about the work we do every day to support the Armed Forces and their families, and on Friday DIO and our suppliers marked an important milestone as our new Future Defence Infrastructure Services (FDIS) contracts for SFA came into service across the UK."
        },
        {
            "heading": 2,
            "text": "Designed to support families"
        },
        {
            "text": "The five contracts, worth £640m in total, are part of the £3bn FDIS programme, which is also providing new contracts for the maintenance of the Defence Built Estate and Defence Training Estate. The accommodation contracts are designed to be very different from the contract they replace. They have been developed with Service Personnel and families firmly in mind and in developing them, DIO collaborated closely with stakeholders including Service Personnel, their families and the Service Families Federations to ensure that their needs were fully considered."
        },
        {
            "text": "The Families Federations have played a particularly important part in helping shape the new contracts before they were tendered, testing our processes as we approach the in-service date, and communicating key messages to families. They will continue to do so in providing feedback on how the new services are being delivered and identifying areas for continuous improvement, which will be a key feature of FDIS. I am hugely grateful for their ongoing support to help us get this right for families."
        },
        {
            "text": "Enhancing customer service will be a key focus. For the first time in MOD housing contracts there will be clear customer satisfaction targets for suppliers to meet that are backed by financial consequences for falling short and incentives to go well beyond the minimum standards."
        },
        {
            "text": "Pinnacle Group Ltd were awarded the National Accommodation Management Services (NAMS) contract. They are now operating the new National Service Centre, the single point of contact for families for housing services."
        },
        {
            "text": "The new contracts will deliver more responsive and accessible accommodation services through the greater use of modern communications technology. Families will also have more choice when arranging appointments, with narrower appointment windows and options for evening, weekend and non-school run times to provide greater flexibility."
        },
        {
            "text": "Four Regional Accommodation Maintenance Services (RAMS) contracts will provide repair and maintenance services to military homes. Worth £499m, these were awarded to Amey for the Northern Region and Central Regions, and VIVO for the South East and South West of England. In addition, these will deliver £171m of improvement and upgrade works in their first year alone. This builds on the unprecedented levels of investment we have recently made in improving the estate, with around £350m invested over the last two financial years."
        },
        {
            "text": "The new contracts offer incentives to suppliers to reduce disruption to families, including ‘first time fix’ targets and quicker response times for repairs. They also require suppliers to adopt recognised industry standards, including for proactive and preventative maintenance."
        },
        {
            "heading": 2,
            "text": "Working with suppliers"
        },
        {
            "text": "Following the award of contracts, the last 9 months have been about getting to know our new providers and gaining an understanding of how we will work together with them successfully in the future. A key focus for me has been on changing the culture of delivery by agreeing a ‘Family First’ approach with our industry partners, placing the needs of our families at the heart of what we do. This includes shifting our language and culture from maintaining assets and properties and allocating them to occupants, to providing high-quality homes and community spaces for families. This approach will be backed by enhanced customer service training that brings to life what it means to be a Service family through video interviews with families from all three Services."
        },
        {
            "text": "There are many more changes that FDIS will bring than I can mention in this blog. Further information is available from our Gov.uk SFA page and on Pinnacle's website."
        },
        {
            "text": "This is a really exciting time for us in DIO Accommodation, with the opportunity to make a big difference to the lived experience for Service families. Not everything will change overnight and some of the innovations FDIS will bring may take time for some to embed and deliver results, but we are working hard together to transform housing services for our Armed Forces."
        }
    ]
}