{
    "url": "https://ipo.blog.gov.uk/2023/05/07/intellectual-property-for-king-and-country/",
    "title": "Intellectual property for King and country",
    "authors": [
        "Paula Davy"
    ],
    "categories": [
        "Design",
        "Patents",
        "Trade marks"
    ],
    "pub_date": "2023-05-07T10:54:33+01:00",
    "content": [
        {
            "text": "The Coronation is a major historic event that grips not only our nation but draws the attention and eyes of the world. This huge occasion, full of tradition, pomp and symbolism, is likely to be big business for some with flags, bunting and commemorative nick-knacks flooding the shops. But what about intellectual property? What are the rules on Royal-related IP?"
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Trade marks"
        },
        {
            "text": "Perhaps the most obvious IP related to Royalty is commemorative souvenirs. We’ve all seen the mugs and plates emblazoned with pictures of the Monarch in celebratory colours. You might not know that this is only possible because, during a Royal wedding or Coronation, infringement rules are relaxed so that the Royal Crest can be used on the explosion of memorabilia."
        },
        {
            "text": "The Lord Chamberlains office issues guidelines on the acceptable commercial use of everything from emblems to portraits. The guide specifically mentions trade marks but states that to qualify souvenirs must be in ‘good taste’; free from any form of advertisement; and carry no implication of Royal custom or approval."
        },
        {
            "text": "You might also be surprised to know the desire for commemorative items goes back to the 1600’s and the celebration of the end of Cromwell’s puritanism with the crowning of Charles II. This rare hand crafted Charles II coronation mug looks surprisingly modern, like it could be from the latest Cath Kidston range, and shows that tastes in collectables haven’t really changed all that much."
        },
        {
            "text": "It wasn’t until the Coronation of George III that we saw more mass-produced souvenirs with the invention of transfer printing on pottery resulting in the world‘s first printed Royal Coronation mug."
        },
        {
            "text": "So, whether you like them or not, you can expect to see the usual plates and mugs decorated with the King's portrait at your Coronation street parties."
        },
        {
            "heading": 2,
            "text": "Royal Warrants"
        },
        {
            "text": "The granting of Royal Warrants dates back hundreds of years, and they are issued by certain members of the Royal Family to individuals or companies that routinely provide goods or services to the Royal Household."
        },
        {
            "text": "Whilst Royal Warrants are used alongside brands, they are separate and do not operate in the same way as trade marks. There is a distinction - while a trade mark operates as an indicator of origin for a product or service, a Royal Warrant is instead a 'stamp of approval' for that product or service from the Royal grantor."
        },
        {
            "text": "There’s a searchable directory of the 725 member companies from all commercial spheres that have been granted a Royal Warrant."
        },
        {
            "heading": 2,
            "text": "Design"
        },
        {
            "text": "In the last Coronation, a high profile and very visible representation of IP was the Queen’s dress."
        },
        {
            "text": "It was designed by Sir Norman Hartnell to incorporate the emblems of Scotland, Ireland and Wales alongside the English Tudor rose and the flowers of Commonwealth countries."
        },
        {
            "text": "​​​​​​​ This V&A article has more about the design process in consultation with the late Queen and Hartnell’s disappointing discovery that the leek, and not the attractive daffodil, was the Welsh emblem."
        },
        {
            "text": "Whilst the King is reportedly rejecting traditional breeches and stockings in favour of the more modern looking military uniform, we may have some design IP on display on the day in the form of the Queen Consort’s dress."
        },
        {
            "text": "Designer Bruce Oldfield is in charge of creating the gown and there’s speculation that detailed embroidery will represent Britain and the Commonwealth in a nod to the previous Coronation. The Royal School of Needlework may also lend a helping hand in creating Camilla's look, as they worked on the late Queen's Coronation robe back in 1953, as well as the Princess of Wales' wedding dress."
        },
        {
            "heading": 2,
            "text": "Patent"
        },
        {
            "text": "These days patents are granted for inventions that are new, have an inventive step and is something that can be made and used, a technical process, or a method of doing something."
        },
        {
            "text": "However, patents were formerly known as letters patent and the name refers to the fact that they were originally awarded by means of a published, rather than private, letter from the Monarch, to which the Great Seal had been applied."
        },
        {
            "text": "Although this is no longer the method of grant for modern patents, The Monarch continues to award letters patent in other contexts, including awarding a town Royal status. Interestingly, intellectual property barristers were appointed to the Queen’s Counsel in this way."
        },
        {
            "text": "If you’re interested, Wikipedia has a list of places with royal patronage in the United Kingdom and Ordnance Survey has an interesting article on the Monarchy’s legacy on place names."
        },
        {
            "heading": 2,
            "text": "There is only one town in Wales with Royal Patronage…."
        },
        {
            "text": "…the Royal Town of Caernarfon. The status of Royal borough was granted to then municipal borough of Caernarvon in August 1963. The borough was abolished in 1974 and replaced by the community of Caernarfon, to which the status of Royal town was granted. Caernarfon was the site of the investiture of Charles, Prince of Wales."
        },
        {
            "text": "The heraldic design is located on the headquarters of the Gwynedd Council, the governing body for this region in North West Wales."
        }
    ]
}