{
    "url": "https://insidehmcts.blog.gov.uk/2023/11/16/improving-access-to-justice-across-hmcts/",
    "title": "Improving access to justice across HMCTS",
    "authors": [
        "Luc Altmann"
    ],
    "categories": [
        "Court and tribunal reform",
        "Customer experience and research"
    ],
    "pub_date": "2023-11-16T12:00:17+00:00",
    "content": [
        {
            "text": "All court users should have equal access to justice. At HMCTS, we’re assessing how effectively our services deliver access to justice using the definition outlined by Dr Natalie Byrom in the publication “Developing the detail: Evaluating the Impact of Court Reform in England and Wales on Access to Justice” to provide an objective measure.   "
        },
        {
            "text": "The definition consists of four elements: "
        },
        {
            "text": "Using this definition, we’ve today published our first 4 assessments covering services for probate, divorce, Online Civil Money Claims and the Social Security and Child Support Tribunal. "
        },
        {
            "heading": 2,
            "text": "Using the assessments to develop our services "
        },
        {
            "text": "The assessments are possible because we’re now able to collect protected characteristics information which allows us to identify barriers which may otherwise have been hidden. Data from reformed services is also providing better evidence for areas we’re already working to improve. "
        },
        {
            "text": "When we identify a barrier to justice, we work to reduce it or remove it. We do this by: "
        },
        {
            "text": "The assessments also highlight areas where access to justice is working well and where it has improved. For example, more people are now administering low value estates and applying for probate without the help of a legal professional, partly because of improved guidance on the service. "
        },
        {
            "text": "Most importantly, the assessments are allowing us to learn a huge amount about our users. By asking for protected characteristics information, such as sex, age, ethnicity and disability we can assess if our services are working well for everyone. If they’re not, we can make targeted improvements like those in probate and divorce where we’ve identified differences for ethnic minority users and have designed solutions to improve access to justice for these users. "
        },
        {
            "heading": 2,
            "text": "Looking to the future "
        },
        {
            "text": "Over the next couple of years, we’re aiming to complete up to 6 more assessments and will publish regular updates on the protected characteristics data. We know we have some gaps in our knowledge - for example wanting to better understand the experience of people using our paper forms - so we’ll also be looking at these to improve how we gather the data we need to produce better outcomes for people. "
        },
        {
            "text": "Finally, we’re one of the few, if not the only, country to be assessing access to justice in its court services in this way. This has been recognised by the Organisation for Economic Cooperation and Development (OECD) which hosts Global Roundtables on Equal Access to Justice. The roundtables are a forum for mutual exchange of good practices and lessons learned and allows policy-makers to share experiences on improving access to justice for all. "
        },
        {
            "text": "I’ll be attending an OECD conference in Slovenia next month on behalf of HMCTS, where we’ll be exploring ways the two organisations can work together to publish a joint document of best practice outlining our approach for use by other OECD members. "
        },
        {
            "text": "If you’d like more information on these assessments or had any questions, please contact hmctsinsight@justice.gov.uk  "
        }
    ]
}