{
    "url": "https://educationinspection.blog.gov.uk/2023/11/16/improving-school-attendance/",
    "title": "Improving school attendance",
    "authors": [
        "Lee Owston, Deputy Director, Schools and Education"
    ],
    "categories": [
        "inspection",
        "schools"
    ],
    "pub_date": "2023-11-16T09:18:19+00:00",
    "content": [
        {
            "text": "Persistent school absence is one of the most significant ongoing impacts of the pandemic. The latest data shows that nearly 1 in 4 pupils were absent for 10% of school sessions in autumn 2022, nearly double the position in 2019. We remain very concerned about the effect this will have on children."
        },
        {
            "text": "As the Department for Education (DfE) points out in its blog Why is school attendance so important and what are the risks of missing a day?, we know that the highest attendance rates are linked with the best outcomes at all key stages. Even missing small amounts of education can mean a child misses important sections of the curriculum and may therefore struggle to learn concepts that are built on what they missed."
        },
        {
            "text": "And it’s not just about the academic opportunities. There’s value in the whole school experience. Learning with peers, enjoying sport and music, building relationships with adults beyond their families, and building friendships – these are the building blocks of well-being and a good life. School contributes so much to this."
        },
        {
            "text": "It is therefore vital that children are in school as much as possible."
        },
        {
            "text": "The role of schools"
        },
        {
            "text": "Schools have a vital role in improving attendance but not all factors influencing attendance are in their control. Because of this, there cannot be an arbitrary attendance percentage that all schools need to reach."
        },
        {
            "text": "But many factors are within schools’ powers, and it is right to expect them to do all they reasonably can to achieve the highest possible attendance. If a school can demonstrate they are doing this, we will judge it favourably, even if its attendance numbers are lower than previously. Importantly, the school will need to demonstrate they are moving towards pre-pandemic levels of attendance or higher, even if they remain a distance away from their overall ambition. However, if a school is not doing all that can reasonably be expected, we may still have concerns."
        },
        {
            "text": "The causes of absence"
        },
        {
            "text": "For schools to improve attendance, they need to understand the causes of absence, especially when persistent or severe."
        },
        {
            "text": "For example, we have found that, in some cases, the impact of the pandemic has led to parents’ heightened anxieties about children attending school when ill, and this is impacting on pupils’ attendance, particularly in primary schools. While a degree of caution may be appropriate in some cases, as the Chief Medical Officer set out in his letter to school leaders on mild illness and school attendance:"
        },
        {
            "text": "This message also needs to be reinforced too by the medical profession (especially GPs and pharmacies) helping parents get the right perspective and balance and avoid an overly risk-averse approach to keeping children out of school."
        },
        {
            "text": "To aid decisions like these, schools need to have strong communication with parents and with pupils about the importance of attendance and tackling non-attendance. This includes building family relationships, pupil support, and repeated positively framed messages in assemblies and newsletters."
        },
        {
            "text": "Further examples of good practice are provided in our report on securing good attendance and tackling persistent absence."
        },
        {
            "text": "Resources"
        },
        {
            "text": "Our report on securing good attendance and tackling persistent absence includes examples of good practice for schools."
        },
        {
            "text": "We have also published a webinar on attendance."
        },
        {
            "text": "The Department for Education also provides support for schools to improve attendance, including through their:"
        },
        {
            "text": "There is also the Attendance Mentors programme which is delivered by the children’s charity Barnardo’s. The programme targets areas of the country with the highest levels of pupil absence. Trained mentors work directly with persistently and severely absent children and their families to identify barriers to attendance and support them back into school."
        },
        {
            "text": "The NHS has also provided a guide for parents on when children maybe too ill for school."
        },
        {
            "text": "We hope this blog underlines the importance of attendance, and how we will ensure we are fair to schools as they navigate this difficult challenge. And we hope that the support we signpost here will help schools to do all they can to ensure children are in school every day."
        },
        {
            "text": "Find the webinar below:"
        }
    ]
}