{
    "url": "https://environmentagency.blog.gov.uk/2023/11/16/internships-with-the-regulated-industry-team-amanis-story/",
    "title": "Internships with the Regulated Industry team – Amani’s story",
    "authors": [
        "pressoffice"
    ],
    "categories": [
        "Environment Agency"
    ],
    "pub_date": "2023-11-16T10:12:33+00:00",
    "content": [
        {
            "text": "About me"
        },
        {
            "text": "My name is Amani, and I will be completing my fourth year at the University of Nottingham studying Environmental Science (MSci). My studies have allowed me to develop my interest in our current climate where conservation, sustainability, and greener and smarter practices are crucial to maintaining our natural environment."
        },
        {
            "text": "It is a profession where I believe I can make a positive impact to the environment through a future career."
        },
        {
            "text": "Why the EA? "
        },
        {
            "text": "The Environment Agency was at the top of my interests because I wanted to understand how environmental science is actually applied within the workforce, and find the areas within the field that I could pursue throughout my career."
        },
        {
            "text": "I really wanted to get a better understanding of the roles with the Regulated Industry team (RI) and how the department works with businesses and organisation to regulate their operations and address environmental challenges."
        },
        {
            "text": "What have you been up to?  "
        },
        {
            "text": "Over the weeks I have been able to go out on-site and apply what I have learnt through training in the real world. Being able to ask myself what is expected on-site to minimise and mitigate impacts on the environment and any concerns from the public. Compliance Assessment Reports (CAR) and Waste Assessment Reports (WAR) are the basis of assessing sites, in which I have developed a good competency from the practical experience and training."
        },
        {
            "text": "Site visits: "
        },
        {
            "text": "Garages can be harmful to the environment, and often in indirect ways that you wouldn’t think could be so detrimental. For example, there are many contamination risks just from the incorrect disposal of oil rags. By simply throwing them in the bin you are actually mixing a hazardous waste with general waste, and without interceptors or bunded areas, any oil on the rags can leak into drainage. Proper disposal and having spill kits readily available on-site is essential."
        },
        {
            "text": "A few of the waste transfer stations we visited allowed me to explore some of the more unexpected measures put into practice such as Odour Suppressant Systems which included the spraying of bubble-gum and strawberry scented de-odourises and automatic doors."
        },
        {
            "text": "I had the opportunity to visit a capped landfill. I had never really imagined what a landfill would physically look like, but I was surprised to find the site covered with trees, grass and wildflowers and not identifiable as closed landfill."
        },
        {
            "text": "Here we assessed the engineering of the landfill, including the steepness of the slopes and whether this could be an issue with heavy rainfall, the flow rate of leachate wells and the presence of any gas emissions."
        },
        {
            "text": "Environmental Outreach Day "
        },
        {
            "text": "Whilst being at the EA, we had the opportunity to participate in a garden tidy-up along the river Trent canal in Nottingham city centre, organised with the Canal and River Trust. It was an uplifting experience with everyone getting involved in weeding, harvesting and general maintenance of the area."
        },
        {
            "text": "How was your experience?"
        },
        {
            "text": "In the three months of being at the EA, I saw how much emphasis is put on enabling staff to explore opportunities.  Such as being involved in different networks to support the diversity everyone brings, flexible working, and environmental engagement days. I saw first-hand how this creates a strong work force and environment for individuals to thrive in."
        },
        {
            "text": "Overall, my experience at the EA exceeded what I had expected. The training opportunities, site visits, enrichment activities and the team itself made this internship a great chance to gain a practical understanding of working within the Regulated Industry. I am very appreciative to my manager who got me involved in as many sites and opportunities as possible to broaden my experience and had me networking with many individuals within the organisation!"
        },
        {
            "text": "What’s next?"
        },
        {
            "text": "I hope to successfully complete my degree and put into practice the theory and work experience I gained through my internship with the EA. I also hope to work on contaminated land and water resources and investigate into the remediation aspects of pollution events in the future."
        },
        {
            "text": "Ultimately my aim is to stay within this field and diversify my experience, whilst ensuring that whichever route I take I can positively contribute to our climate."
        },
        {
            "text": "What advice would you give to anyone considering an internship with the EA?"
        },
        {
            "text": "I would encourage future interns to be as vocal as possible in order to maximise their opportunity at the EA. My manager and team were very forthcoming in giving us interns an enriched experience – voicing your interests to the team and other teams will allow you to gain insight to some of your interests along the duration."
        },
        {
            "text": "Are you interested on an internship at the EA? "
        },
        {
            "text": "Find out more information about the early career opportunities, including internships, industry placements and apprenticeship opportunities at the Environment Agency by visiting Early careers - Environment Agency (environmentagencycareers.co.uk)"
        }
    ]
}