{
    "url": "https://socialworkwithadults.blog.gov.uk/2023/11/16/promoting-progressive-amhp-anti-racist-practice/",
    "title": "Promoting progressive AMHP anti-racist practice",
    "authors": [
        "Lyn Romeo",
        "Dr Caroline Leah",
        "Kenny Thompson",
        "Debbie Best"
    ],
    "categories": [
        "Care and support",
        "Co-production",
        "Mental health",
        "Safeguarding"
    ],
    "pub_date": "2023-11-16T09:34:10+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Let's work this out together"
        },
        {
            "text": "Debbie Best:  I’m an optimist. It’s important I present my authentic self to effect change rather than working from a position of blame, which only reinforces hostile work environments. We’re all human, it’s OK to be scared and to give yourself permission to be vulnerable."
        },
        {
            "text": "I am also a carer. I have supported my son through local, medium, high and low secure forensic services for over fourteen years. It’s been a journey. There have, without a doubt, been some examples of good practice. However, the hardest part has been challenging practices (inequalities, disparities, gaslighting and coercion to name a few) within services."
        },
        {
            "text": "I was the first carer to attend a safeguarding meeting in a long established hospital. So, I welcome the Patient Carer Race Equality Framework (PCREF) and I’m looking forward to leading on it within my local trust, so that together, we can affect positive change and better outcomes."
        },
        {
            "text": "However, I do wonder if it’s going to be another tick box exercise. For example, during a BAME carers meeting (I don’t even like the term BAME), a trainer gave a brief overview of PCREF. It was going well. They explained all staff would be given cultural, statutory and regulatory awareness training."
        },
        {
            "text": "‘That’s great’, I replied. ‘However, I also feel patients and carers should have the same training’. They responded by saying it was a great idea, which they would take back to their organisation to consider. This seemed fair enough, as they were not in a position to make any decisions there and then."
        },
        {
            "text": "I explained that training needed to be delivered to patients, carers and professionals collectively. The representative responded with the counter view that professionals should have separate training specific to them."
        },
        {
            "text": "I don’t agree, as it appears to be a power dynamic, coming from a place of privilege. What I’m curious about is whether the trainer’s response was conscious or unconscious."
        },
        {
            "text": "I was left feeling this was a prime example of my lived experience of power and control. They were describing the framework from their professional perspective and trying to tell us, the patient and carer, how we should use it. That’s not equity, co-production, or partnership working. My request is simple: we must work it out together, sharing learning and understanding."
        },
        {
            "heading": 2,
            "text": "Respect our lived experience"
        },
        {
            "text": "Kenny Thompson: Having been in the mental health system and now medication free, I see that practice ideas and the medical model is out-dated and broken. How can we ‘fix’ people in a broken system, one which suffers from institutional racism? We need to consider conscious and unconscious bias in professionals, challenging racism in practice. For practice to be truly progressive and based on human rights, this includes reporting and logging incidents of racism."
        },
        {
            "text": "I was told I would be on medication for life, but I am not and won't be. Medication isn’t always the answer, communication and talking therapies are important. However, communication with people outside your own race can be difficult."
        },
        {
            "text": "Each case is different and seeing each person as an individual is important. We are constantly evolving. It’s essential to ask someone in crisis about their lived experiences. Having a mental health issue is a journey in a difficult and racist world. If external factors make the person sick, then racism can seem like an illness and have lasting effects. The culture around mental health must change for us all to be well."
        }
    ]
}