{
    "url": "https://supportingfamilies.blog.gov.uk/2023/11/16/reach-out-domestic-abuse-service-in-redbridge/",
    "title": "“Reach Out” – Domestic abuse service in Redbridge",
    "authors": [
        "ballypahal"
    ],
    "categories": [
        "Early Help",
        "Education",
        "Financial Frameowrk",
        "Health",
        "Multidisciplinary Teams",
        "Reducing Parental Conflict",
        "Transformation",
        "Uncategorized"
    ],
    "pub_date": "2023-11-16T08:52:59+00:00",
    "content": [
        {
            "text": "Background "
        },
        {
            "text": "Reach Out is Redbridge Council’s in-house support service for any adult or child aged 16 or over who is experiencing domestic abuse. The service provides practical help and emotional support to victims/survivors, including children and young people who have been affected by domestic abuse. There is also help available for those who are worried about their own behaviour and wish to address it. "
        },
        {
            "text": "The new service offer was launched in September 2023, and has three key principles.  "
        },
        {
            "text": "Reach Out is: "
        },
        {
            "text": "One front door  "
        },
        {
            "text": "Reach Out acts as the front door for domestic abuse in Redbridge. A lead professional carries out a full assessment of the risks and needs, completes safety planning, and acts as a single point of contact to co-ordinate the family’s needs (housing, physical and mental health, substance misuse, financial issues, immigration etc.) Their work focuses on improving the safety, wellbeing and freedom of survivors and children.   "
        },
        {
            "text": "Reach Out also connects survivors and children to specialist services in the borough who offer tailored support for those with protected characteristics. "
        },
        {
            "text": "Spotlight  "
        },
        {
            "text": "The service will also contact perpetrators of domestic abuse to  connect them to Spotlight, Redbridge’s in-house Respect-accredited  perpetrator programme. The programme aims to reduce domestic  abuse by working with perpetrators who wish to address their abusive  behaviours. The name ‘Spotlight’ was chosen for the programme because individuals are supported, first and foremost, to shine a light on their  behaviours and take accountability for their abuse. The Spotlight Programme  then works with individuals to help them identify and address the underlying  belief systems that drive such behaviours and equips them with the tools to  create change.  "
        },
        {
            "text": "Family Feedback  "
        },
        {
            "text": "“I thank the Reach Out DV Hub of London Borough of Redbridge for the exceptional support and guidance provided to move forward during the most difficult times of life. Initially I was sceptical about taking a major decision as I was completely clueless about how to move forward in a new country. With the prompt and professional support provided by the DV Hub, I was all set to come out of the unhealthy relationship. Me and my daughter are extremely thankful for the commendable service provided. This is exactly the kind of support that every woman who is a victim of DV needs to be offered for them to be able to move forward in confidence.” "
        },
        {
            "text": "Innovation  "
        },
        {
            "text": "As a new service Reach Out is a showcase for how investing and empowering professionals within your workforce can benefit the community they serve. They can go on to make a direct impact to families, often acting as a lead professional who is able to access housing/financial services and other partners to make the right connections within a short timeframe. "
        },
        {
            "text": "They can advocate on behalf of the family to enable them to meet essential needs while working in the longer term to empower the family to take control of their financial/ emotional wellbeing. This can include training sessions as well as one to one bespoke support.  "
        },
        {
            "text": "Summary  "
        },
        {
            "text": "This is a new service that has been rolled out and the offer extends beyond early help. By working with the whole family, they ensure support is offered at the right time for all family members to take their next step with confidence."
        }
    ]
}