{
    "url": "https://mojdigital.blog.gov.uk/2023/11/16/reflections-on-transforming-with-digital/",
    "title": "Reflections on Transforming with Digital",
    "authors": [
        "Kamal Bal"
    ],
    "categories": [
        "collaboration",
        "Our services",
        "Transforming with Digital"
    ],
    "pub_date": "2023-11-16T12:50:29+01:00",
    "content": [
        {
            "text": "From Justice Digital, Policy, and beyond, we have been uniting forces in an exciting ‘Transforming with Digital’ collaboration campaign co-sponsored by Gina Gill (CDIO) and Jerome Glass (DG Policy). "
        },
        {
            "text": "The world is changing - fast. Earlier this month the UK hosted the first world summit on AI, showing the international community how seriously we are taking these changes. At the MoJ, we want to embrace this by bringing in experts and helping all colleagues think differently about how they design and deliver the justice services of tomorrow. "
        },
        {
            "text": "This goes beyond the digital experiences and services we create, by encouraging us to reimagine things and understand what it requires from Policy, Operations, and Digital, Data, and Technology to make it happen. The campaign includes events from leading experts in technology, AI, product design, and the justice system."
        },
        {
            "text": "Amongst many of our inspiring guest speakers, we were delighted to be able to welcome Professor Richard Susskind, a global expert on the future of the justice system. Over the years I have been fortunate enough to attend many talks and conferences, but there are very few that really stick in my mind. This session, however, was one of the few that did."
        },
        {
            "text": "What resonated with me most was how Professor Susskind framed the way in which we need to see the world. He opened up with the example of Black & Decker and how they don’t actually make power tools – they build solutions to most efficiently make a hole in a wall."
        },
        {
            "text": "He then encouraged us to think about what this means for us and the future of the Justice sector with thought-provoking questions such as:"
        },
        {
            "text": "Part of Professor Susskind’s rationale for pushing us to think like this is that he sees too much effort put into automating/improving things, as opposed to truly innovating and changing things."
        },
        {
            "text": "Using his analogy, we spend all our time ensuring that we can get an ambulance to the bottom of the cliff faster, making it better equipped to help the patient that needs it – when we should actually be thinking about how we put a fence at the top of the cliff such that the ambulance is never needed."
        },
        {
            "text": "Professor Susskind has a very rare skill set in that he is both a lawyer and a technologist. He therefore also talked about how we can better use technology and invariably shared thoughts on Artificial Intelligence (AI). "
        },
        {
            "text": "He made a wonderful comparison of the use of AI in the medical world versus the legal world. In the medical world, the key question seems to be “How will AI improve health?” and not “What will AI mean for doctors?” – yet in the world of Justice, too often the question seems to be “What will AI mean for lawyers?” and not “How will AI improve legal outcomes for members of society?”"
        },
        {
            "text": "Another lovely comment I took away from his session was “If the answer is more lawyers, you are asking the wrong question”."
        },
        {
            "text": "A couple of final observations/questions that I took from the session and I am keeping front of mind as I think about what I and my teams can do to make a difference:"
        },
        {
            "text": "I love observational humour/comedy as I can very easily relate to what is being said, but it is being said in a way that I have never before considered it. It is for the same reason that I loved this session with Professor Susskind. Afterwards, nothing of what he said felt like it was something out of the blue that nobody was thinking about, but the clarity of his thought and the structure of his delivery gave me my own little “Eureka!” moment."
        },
        {
            "text": "Our Transforming with Digital campaign goes beyond discussion. It's an immersive experience, forging connections and harnessing the brightest minds in the MoJ. I wholeheartedly encourage other organisations to create collaborations that can elevate industries, foster shared goals and drive positive change in an ever-changing world. "
        }
    ]
}