{
    "url": "https://ipo.blog.gov.uk/2023/11/16/ten-years-of-the-ip-attache-network-in-se-asia/",
    "title": "Ten years of the IPO in Southeast Asia",
    "authors": [
        "Rachael Wood"
    ],
    "categories": [
        "Design",
        "International",
        "Patents",
        "Trade marks"
    ],
    "pub_date": "2023-11-16T15:54:20+00:00",
    "content": [
        {
            "text": "This year marks 10 years of the IPO’s attaché network in Southeast Asia (SE Asia). We spoke to Rachael Wood, IPO Senior Advisor for Business and International Policy, to learn how the team has been supporting UK businesses trading in the region since our SE Asia intellectual property (IP) relationship began."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Tell us about the IP attaché network - what value can it add for businesses trading overseas?"
        },
        {
            "text": "Our IP attaché network colleagues are based in UK embassies and High Commissions across the world. Together they help to build IP knowledge in UK businesses, providing in-market support. They work with governments and partners to improve the IP environment for businesses wanting to trade overseas."
        },
        {
            "text": "Intellectual Property underpins the innovation that is so important to the UK’s businesses and economy, more so now than ever. IP rights provide the security that businesses, creators, and innovators need to allow them to grow, invest in the future and foster further innovative endeavours."
        },
        {
            "text": "As a former IPO Director of Business and International Policy himself, IPO’s CEO Adam Williams is happy to voice his pride in the continued success of IPO’s international work and all that has been achieved:"
        },
        {
            "text": "IP attachés, based across the world, are well-placed to advise on local and international IP frameworks and environments, adding value for UK businesses trading overseas. One such area is SE Asia."
        },
        {
            "heading": 2,
            "text": "Who are our IP attachés in the ASEAN region?"
        },
        {
            "text": "In the 10 years since the team was established in SE Asia, we now have two attachés, Christabel Koh and Desmond Tan. They are based in Singapore and provide regional IP support to UK businesses already operating in or venturing to the region for the first time."
        },
        {
            "text": "Our SE Asia attaché team has provided direct support to more than 175 businesses, and spoken to more than 6,500 since 2013."
        },
        {
            "text": "Since 2018 the team has expanded its work to include collaboration with ASEAN as an organisation. Together with the ASEAN Working Group on Intellectual Property Cooperation (AWGIPC), the team is supporting the creation of ASEAN-wide frameworks, not only to facilitate ASEAN’s ambitions but also to make it easier for British businesses to operate across the region."
        },
        {
            "heading": 2,
            "text": "How do UK and ASEAN businesses benefit?"
        },
        {
            "text": "Our attaché network is a key part of the IPO’s business support and has proved consistently to be a key enabler for policy interventions for the benefit of both UK and ASEAN businesses. Feedback regularly endorses the fact that IP attaché support makes it easier for businesses to protect and enforce their IP and grow in this thriving region."
        },
        {
            "text": "Lindesay Low, Deputy Director of Legal Affairs in The Scotch Whisky Association, told us how IP attaché support has been a crucial part of Association members’ successful expansion into SE Asia, an important and growing market for Scotch Whisky."
        },
        {
            "heading": 2,
            "text": "Digital enforcement – how can IP Attaches help?"
        },
        {
            "text": "The ASEAN team is well aware of the need to continue its support for businesses in making the most of the opportunities across SE Asia, especially when it comes to the growing digital landscape. Reflective of the enormous potential of ASEAN’s e-commerce economy and how our attaché network is consistently looking to make sure we keep pace with where and how businesses are operating, our current focus on is on digital enforcement."
        },
        {
            "text": "The boom in e-commerce, and consumers’ reliance on it, has presented opportunities for businesses to expand and grow their customer base as well as increase sales. It has also presented the same opportunities for infringers. Counterfeits and piracy pose additional costs, reputation risks and creates an unfair environment for legitimate businesses operating in ASEAN’s expanding e-commerce economy."
        },
        {
            "heading": 2,
            "text": "The E-Commerce Code of Conduct"
        },
        {
            "text": "The team wants it to be easy and effective for businesses to enforce their IP in the e-commerce space across ASEAN."
        },
        {
            "text": "In 2021, funded by our regional Economic Reform Programme, the UK supported the government of the Philippines in launching of one of region’s first IP E-Commerce Code of Conduct (CoC). This agreement makes it faster and easier to take down infringing goods online as well as provide IP owners with an alternative beyond potentially expensive court action."
        },
        {
            "text": "Ramesh Raj Kishore, Regional Director of the Asia Pacific Pharmaceutical Security Institute (PSI) told us how he considers the collaboration between PSI and the IPO’s team to be “ground-breaking”."
        },
        {
            "text": "Another partner in the region is Premier League. General Counsel Kevin Plumb told us how much the organisation values the passionate support of fans throughout Asia, where Premier League enjoys huge popularity."
        },
        {
            "text": "It is now almost five years since the opening of the League’s first international office in Singapore to provide regional support for Asia-Pacific broadcast partners, with a focus on developing anti-piracy work and programmes. Kevin told us:"
        },
        {
            "text": "The IPO’s IP attaché team in ASEAN continues to work hard to encourage more businesses to sign up and take advantage of the CoC as well as to replicate the success elsewhere. Currently the team is working on a CoC with Indonesia."
        },
        {
            "heading": 2,
            "text": "What is next for IPO’s attaché network, not just in ASEAN but across the globe?"
        },
        {
            "text": "Through the International IP Service and the IP attaché network, the IPO will continue to expand its support for businesses and their global ambitions across key markets."
        },
        {
            "text": "You can find out more about trading in SE Asia and other overseas markets (link) International IP Service Gov.uk page."
        },
        {
            "text": "The IPO has recently published a SE Asia country guide to help businesses wishing to trade in the region (link) IP in ASEAN - GOV.UK (www.gov.uk)"
        },
        {
            "text": "Keep up to date on all the latest developments in the SE Asia IP environment: sign up to the IP in ASEAN Newsletter (link) IP Newsletter by SE Asia IPO Attaché Network (Oct 2023) (office.com)."
        }
    ]
}