{
    "url": "https://teaching.blog.gov.uk/2023/11/16/working-together-to-tackle-attendance-in-rural-communities/",
    "title": "Working together to tackle attendance in rural communities",
    "authors": [
        "Samantha Reed",
        "Michael Bourne"
    ],
    "categories": [
        "Attendance",
        "Data protection and management",
        "Inspiring teachers",
        "Primary schools",
        "Secondary schools",
        "Teachers' reflections"
    ],
    "pub_date": "2023-11-16T07:00:41+00:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "Schools have been sharing daily attendance data with DfE and making use of the Monitor Your School Attendance (MYSA) service - a free, secure tool that helps them visualise the data and monitor, manage and improve pupil attendance."
        },
        {
            "heading": 3,
            "text": "Deputy head, Michael Bourne uses MYSA data to tackle absence in a rural community  "
        },
        {
            "text": "I’m Mike, deputy head at a primary school. I’ve been using DfE’s MYSA service to help me have conversations with parents and staff about attendance.  "
        },
        {
            "text": "My school "
        },
        {
            "text": "Being part of a small school comes with its own set of advantages. We know each child personally and we've got a good relationship with parents. My attendance strategy is very much a people-driven process. I have meaningful conversations that give me the context that data alone does not. It's a blend of data, conversations and commitment. "
        },
        {
            "text": "How I use the service in practise "
        },
        {
            "text": "I use a combination of the DfE’s data and our school Management Information System to analyse attendance data and look out for emerging issues. My main focus is spotting persistent absence and working out the reasons behind it. I’m also interested in spotting those who might become persistently absent to make sure they get extra support if they need it. "
        },
        {
            "text": "The data on potential attendance issues prompts conversations with colleagues and parents. These conversations give a fuller overall picture of attendance. I have the insight from the data and the context from talking to parents. "
        },
        {
            "text": "The MYSA service is an easy way to view data. The layout is simple, and it gives you the key information up-front on one screen. It’s a live system, it’s clear and you can drill down into the data. It’s user friendly, you can navigate it all and do comparisons.   "
        },
        {
            "heading": 3,
            "text": "Head teacher, Samantha Reed, saves herself time by using DfE’s MYSA service "
        },
        {
            "text": "I’m Sam, an assistant head and SENCO at a rural secondary school. My school is in a rural area with a diverse cohort of pupils. It’s a big farming community with 17 feeder primary schools.  "
        },
        {
            "text": "My school "
        },
        {
            "text": "Pupils living in rural areas brings a whole range of additional challenges for attendance. Transport and journey lengths is a key consideration for some pupils. Students might miss the bus or their parent’s car could be in the garage. They might get up in the morning and feel a unwell, so they stay at home because the idea of picking up a sick child is a significant barrier.  "
        },
        {
            "text": "We’ve also struggled with attitudes towards attendance since the Covid-19 pandemic. People were being told to stay off with a sore throat, and we’re now working hard to explain that this is no longer acceptable.  "
        },
        {
            "text": "How using the service has helped us support our pupils "
        },
        {
            "text": "Having all the key information about a pupil’s attendance data on one page has really encouraged me to dig deeper when I need to. It’s great that it’s there in black and white, on a single page.  "
        },
        {
            "text": "It’s particularly useful to see how many days it’s been since a pupil was last absence, like a counter. It helps me identify when a pupil’s attendance dipped because of an illness, compared to those who are regularly absent. I used to have to count this up using our Management Information System (MIS), so it’s great to have this in front of me.  "
        },
        {
            "text": "Getting persistent absence and severe absent figures saves me a lot of time and is really important for supporting absent pupils early in the year.  "
        },
        {
            "text": "Find out more about the Monitor Your School Attendance service and how your school can benefit.  "
        }
    ]
}