{
    "url": "https://aphascience.blog.gov.uk/2023/11/16/world-amr-awareness-week-2023/",
    "title": "World Antimicrobial Resistance (AMR) Awareness Week",
    "authors": [
        "Tom Chisnall"
    ],
    "categories": [
        "Antimicrobial Resistance"
    ],
    "pub_date": "2023-11-16T14:00:37+00:00",
    "content": [
        {
            "text": "Antimicrobial Resistance (AMR) is a global threat to both animal and human health. In this blog, APHA’s Tom Chisnall explains what AMR is and how antibiotic resistant bacteria found in migratory birds, could affect farm livestock."
        },
        {
            "text": "Over the years, APHA have published many blogs concerning Antimicrobial Resistance (AMR). AMR occurs when bacteria, and other microorganisms, develop a resistance to antimicrobial drugs, such as antibiotics, making them less effective in treating infections. APHA uses many approaches to detect, understand, and contain the threat of AMR."
        },
        {
            "text": "At APHA, many groups are involved in detecting antibiotic resistant bacteria from livestock and wild animals. These wild animals include migratory birds, which often visit farms for food and shelter, and move between countries. It is important to understand which antibiotic resistant bacteria are found in migratory birds, as they could transfer these resistant bacteria to farms, affecting the livestock. This information can be used to introduce measures to prevent contact between wild birds and livestock."
        },
        {
            "text": "Our knowledge and understanding of AMR at APHA is shared globally, for example, through collaborations with partners abroad and the scientific publications arising from this collaborative work. A key part of our international work on AMR is carried out through the UK’s Food and Agriculture Organization of the United Nations (FAO) Reference Centre for AMR, working with government laboratories and research partners located in low- and middle-income countries to develop their approach to investigate AMR and antimicrobial use."
        },
        {
            "text": "As part of this, in collaboration with partners at the Bangladesh Livestock Research Institute, we have published work on identifying and characterising antibiotic resistant Salmonella strains in migratory birds."
        },
        {
            "text": "Bangladesh lies in the path of two migratory flyways, the East Asian–Australasian Flyway and the Central Asian Flyway. Birds migrate between breeding grounds in Northern regions and their overwintering quarters in the South. Migratory birds either overwinter in Bangladesh or pass through as part of their annual migration and therefore afforded an ideal opportunity for sampling and testing to assess their carriage of Salmonella."
        },
        {
            "text": "Sampling area of Tanguar Haor and Hakaluki Haor in Bangladesh. © 2023 Card, Chisnall, Begum, Sarker, Hossain, Sagor, Mahmud, Uddin, Karim, Lindahl and Samad, Multidrug-resistant non-typhoidal Salmonella of public health significance recovered from migratory birds in Bangladesh, Front. Microbiol., 15 May 2023, Sec. Antimicrobials, Resistance and Chemotherapy, Volume 14 – 2023, https://doi.org/10.3389/fmicb.2023.1162657Birds were sampled at Tanguar and Hakaluki Haors, diverse wetland ecosystems in North-eastern Bangladesh, which provide important habitats for migratory birds. Up to ~40,000 migratory waterfowl from 98 species converge on Tanguar Haors at the height of migration."
        },
        {
            "text": "It is well understood that migratory birds can harbour avian influenza and in our study we wanted to establish if this was also the case with antibiotic resistant Salmonella. We selected the bacteria Salmonella because it is a zoonotic disease, meaning it is able to pass between animals and humans, and is of significant public and animal health concern worldwide. We collected samples from the migratory birds and isolated the Salmonella bacteria. Then, using gold-standard antibiotic susceptibility testing methods, we found that several of these Salmonella isolates were multi-drug resistant (multi-drug resistant Salmonella has been associated with more serious disease in people). We also found that some of the Salmonella isolates were resistant to the antibiotic ciprofloxacin and this was an important finding because the World Health Organisation classifies ciprofloxacin resistant Salmonella as a priority pathogen."
        },
        {
            "text": "To further assess the Salmonella, we used whole genome sequencing to define the DNA content of each bacterium we had isolated from the birds and compared these to data reported from other studies. This analysis showed that some of the Salmonella strains we identified were very similar to those found in India, China, and South Korea. Migratory birds could, therefore, play an important role in the long range spread of antibiotic resistant Salmonella."
        },
        {
            "text": "This emphasises the worldwide threat of antibiotic resistant bacteria, which requires global collaboration to control, particularly as many antibiotics are used in both humans and animals."
        },
        {
            "text": "Following the results of this project, the FAO Reference Centre for AMR continues to collaborate with government institutions and the FAO in Bangladesh by supporting continued AMR surveillance and stakeholder engagement with farmers to increase awareness of farm biosecurity to help prevent introduction of disease via wildlife."
        },
        {
            "text": "It is important to stress that the transmission pathways between wild animals, farmed livestock and the environment are complex and multi-directional. The measures promoted by Defra to prevent the transmission of Avian influenza seek to prevent transmission from farmed poultry to wild birds, and vice versa. The recent Veterinary Antimicrobial Resistance and Sales Surveillance (VARSS) report indicates that sales of antibiotics for use in food-producing animals in the UK fell by nearly 10 percent in the last year and have more than halved since 2014. This positive news is combined with declining detection of resistant bacteria in UK livestock, but we must continue with our efforts to tackle the problem."
        },
        {
            "text": "AMR is a global threat to both animal and human health that requires the work of many disciplines and sectors to control. During World AMR Awareness Week APHA we will be sharing other examples of the work we are doing to combat AMR."
        }
    ]
}