{
    "url": "https://defrafmp.blog.gov.uk/2025/12/08/collaborative-multi-year-strategy-for-the-king-scallop-fishery/",
    "title": "Collaborative multi-year strategy for the king scallop fishery",
    "authors": [
        "Shellfish FMP policy team, Defra"
    ],
    "categories": [
        "- Defra led FMPs",
        "Implementation"
    ],
    "pub_date": "2025-12-08T16:30:17+00:00",
    "content": [
        {
            "text": "King scallops are valuable shellfish that are important for fishing jobs and businesses. Both the UK and EU catch king scallops; however, they are at risk from overfishing. This is why they have been chosen as the subject of the first trial Multi-Year Strategy (MYSt) which will work alongside the king scallop fisheries management plan (FMP)."
        },
        {
            "text": "The UK and EU are working together under the Specialised Committee on Fisheries (SCF) to trial the development of multi-year strategies, or long-term plans, for the conservation and management of shared non-quota species (NQS). They will follow rules in our Trade and Cooperation Agreement (TCA).  "
        },
        {
            "heading": 2,
            "text": "Starting work on the MYSt"
        },
        {
            "text": "Back in September 2024, the European Commission and the UK government held a workshop to begin sharing knowledge and understanding of the king scallop fishery in UK and EU waters."
        },
        {
            "text": "This brought together representatives from EU member states, UK fisheries administrations, scientists, the fishing industry and environmental NGOs (non-governmental organisations). It marked the start of a positive collaboration with the EU in developing joint goals for management of shared king scallop stocks. A report of the workshop was published in May and can be found here: MYSt workshop report."
        },
        {
            "heading": 2,
            "text": "Working together"
        },
        {
            "text": "In early 2025, a technical group was established to advance collaborative work on the strategy. The group includes officials from both Defra and the European Commission."
        },
        {
            "text": "In addition, a separate expert group of UK and EU scientists has been formed to offer independent analysis and advice. They will play a crucial role in building a shared understanding of the fisheries and informing strategic decisions."
        },
        {
            "text": "Their work will make sure that the management of shared king scallop fisheries under the first MYSt is guided by robust evidence and supports long-term sustainability."
        },
        {
            "heading": 2,
            "text": "How the MYSt works with the king scallop FMP"
        },
        {
            "text": "The king scallop FMP provides a framework for sustainable management in England and Wales. It is designed to ensure stocks are fished sustainably and so will help to inform the MYSt, supporting effective management across different jurisdictions."
        },
        {
            "heading": 2,
            "text": "What happens next?"
        },
        {
            "text": "Once the scientific group has completed its report, it will be shared with stakeholders and discussed at a further workshop, which we expect to take place in 2026. "
        },
        {
            "text": "To stay updated on the king scallop MYSt please look out for future emails, subscribe to the FMP blog for updates, or get in touch with Defra’s shellfish team at shellfish@defra.gov.uk."
        }
    ]
}