{
    "url": "https://nationalscreening.blog.gov.uk/2025/12/08/consultation-opens-on-evidence-relating-to-population-screening-for-type-2-diabetes-in-adults/",
    "title": "Consultation opens on evidence relating to population screening for Type 2 diabetes in adults",
    "authors": [
        "Omaer Syed"
    ],
    "categories": [
        "Adult screening"
    ],
    "pub_date": "2025-12-08T08:38:25+00:00",
    "content": [
        {
            "text": "The UK National Screening Committee (UK NSC) has opened a consultation on evidence relating to population screening for Type 2 diabetes in adults."
        },
        {
            "text": "It is asking stakeholders and members of the public to provide feedback on a 2025 evidence map and its conclusions. Evidence maps are typically the first step in the UK NSC evidence review process. "
        },
        {
            "text": "The 2025 evidence map was commissioned to review literature on the topic published since the previous evidence review in 2019. The 2019 review concluded there was no evidence to support whole population screening for Type 2 diabetes mellitus (T2DM) in adults in the UK."
        },
        {
            "text": "The 2025 evidence map reaffirms the conclusion of the 2019 review and concludes that this topic should be reviewed again in 3 years’ time."
        },
        {
            "heading": 2,
            "text": "How to respond"
        },
        {
            "text": "To take part in the consultation, download the consultation documents by clicking on the grey ‘View documents’ button on the UK NSC’s diabetes recommendation page. Then submit your response by clicking on the green ‘Submit comments’ button. "
        },
        {
            "text": "The deadline for responses is 11.59pm GMT on 2 March 2026. "
        },
        {
            "text": "Consultation responses will be considered by the UK NSC when it updates its recommendation on this topic."
        },
        {
            "heading": 2,
            "text": "About Type 2 diabetes"
        },
        {
            "text": "Diabetes is a long-term (chronic) condition caused by too much glucose (sugar) in the blood."
        },
        {
            "text": "Type 2 diabetes occurs when the body does not produce enough insulin to function properly, or when the body’s cells do not react to insulin. This is called insulin resistance. Type 2 diabetes is far more common than type 1 diabetes. It accounts for more than 95% of patients with diabetes and approximately 537 million cases of diabetes worldwide."
        },
        {
            "text": "Diabetes is one of the most common chronic diseases in the UK, and its prevalence is increasing. Registration figures from 2021-2022 from Diabetes UK showed that more than 4.3 million people in the UK were living with diabetes, and an additional 850,000 people could be living with diabetes who were yet to be diagnosed."
        },
        {
            "text": "Over time, diabetes can damage blood vessels in the heart, eyes, kidneys and nerves.  T2DM leads to complications within blood vessels that causes distress to patients and places a huge burden on the healthcare system. Early diagnosis is important to prevent the worst effects."
        },
        {
            "text": "A common test for T2DM is the HbA1c blood test which is less reliable for screening because of its low sensitivity and the need to be confirmed by a second test, such as a second HbA1c, a fasting plasma glucose (FPG) or an oral glucose tolerance test (OGTT)."
        },
        {
            "text": "A further test, the 50-g glucose challenge test (GCT) does not require fasting and has been used extensively in screening for gestational diabetes. It appears to be a promising screening tool, but the evidence base is sparse."
        },
        {
            "text": "Treatment focuses on reducing blood glucose levels. Treatment includes lifestyle changes, antidiabetic drugs, or patients can be prescribed insulin."
        },
        {
            "heading": 2,
            "text": "The evidence"
        },
        {
            "text": "The 2025 evidence map identified new published evidence since 2019 but:"
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK NSC. You can register to receive updates direct to your inbox, so there is no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, please email uknsc@dhsc.gov.uk. "
        }
    ]
}