{
    "url": "https://mhclgdigital.blog.gov.uk/2025/12/08/new-draft-guidance-published-to-support-faster-and-clearer-local-plan-making/",
    "title": "New draft guidance published to support faster and clearer local plan-making ",
    "authors": [
        "Adele Maher, Head of Planning Transformation"
    ],
    "categories": [
        "Digital Planning",
        "PropTech"
    ],
    "pub_date": "2025-12-08T09:40:31+00:00",
    "content": [
        {
            "text": "Local plans are the backbone of England’s planning system, shaping how places grow and develop. But the current system isn’t working as we need it to. Many plans take over 7 years to produce and cost councils millions of pounds, putting pressure on local resources and delaying the delivery of homes and infrastructure local communities need. "
        },
        {
            "heading": 2,
            "text": "A new approach to plan-making "
        },
        {
            "text": "Earlier this year, the government gave an update on the steps being taken to achieve universal coverage of local plans and realise the full potential of planning reforms initiated in 2024. "
        },
        {
            "text": "On 27 November, Housing and Planning Minister Matthew Pennycook confirmed details of a new plan-making system in a Written Ministerial Statement. The Minister outlined how the reforms will make it easier for councils to shape development in their area and play their part in delivering the government’s target of 1.5 million homes.  "
        },
        {
            "text": "The new local plan regulations underpinning the new approach to plan-making will come into force early next year, establishing a faster system with shorter and clearer local plans that communities and the development sector can rely on. At the heart of this reform is a new 30-month timeline for creating and adopting local plans, supporting the government’s commitment to achieving universal local plan coverage. "
        },
        {
            "heading": 2,
            "text": "Supporting the new plan-making system "
        },
        {
            "text": "MHCLG’s Digital Planning programme and Development Plans team, in collaboration with the Planning Inspectorate, have been working to address the pain points and inefficiencies within plan-making to help deliver a simpler, faster and more accessible new system of local plans. In February 2025 we published a new dedicated home of resources on GOV.UK - Create or update a local plan, bringing together guidance to provide greater clarity, consistency and certainty to the plan-making process. "
        },
        {
            "text": "We’ve now added, in draft, the first tranche of detailed draft guidance to help authorities preparing plans under the new system get started as soon as possible.  "
        },
        {
            "text": "We have prioritised resources for the earliest stages of plan-making so local planning authorities can understand how the new system will work and what they can do now to prepare.  "
        },
        {
            "heading": 2,
            "text": "Developed with users at its heart "
        },
        {
            "text": "What makes this planning guidance different is how we've developed it – with the primary users, the plan-makers. We’ve developed every piece directly with local planning authorities and planning inspectors. The intensive, iterative testing has shaped the content, structure and tools to ensure they work in practice and not just in theory.   "
        },
        {
            "text": "This user-centred approach is reflected in the practical tools we've created. It sets out how local councils are expected to prepare their local plan and provides practical resources to support preparation. For Gateway 1 – the first of a series of checkpoints designed to help local councils to stay on track to deliver plans within 30 months – we have developed ready-to-use templates including the Gateway 1 summary template, to remove guesswork from critical stages. Our site selection guidance walks planners through identification, assessment and allocation with step-by-step clarity. These are working tools shaped by the people who will use them every day. "
        },
        {
            "text": "The result is a fundamental shift towards making local planning work for everyone involved. Councils get the clarity and tools they need to deliver efficiently. Communities get plans faster that respond to their current needs. And nationally we can move more quickly to achieving full plan coverage across England, critical to unlocking the types of development our country needs. "
        },
        {
            "text": "We're enormously grateful to all the local authority officers who generously volunteered their time and expertise over the many months of testing.  "
        },
        {
            "heading": 2,
            "text": "Learning from authorities using digital tools "
        },
        {
            "text": "Local planning authorities are already discovering the potential of technology and digital tools to transform plan-making. Case studies showing how councils have used innovative tools as part of the PropTech Innovation Fund to speed up local plan creation are currently available and signposted to on Local Digital, with user-centred versions soon to be published on Create or update a local plan. These real-world examples illustrate the practical benefits and efficiency gains possible. "
        },
        {
            "heading": 2,
            "text": "Next steps "
        },
        {
            "text": "We will review the guidance and make any necessary revisions and updates as the new system is implemented, and related regulations and policy are confirmed.  "
        },
        {
            "text": "These resources form part of a growing digital offer to support plan makers to deliver local plans faster. It will be followed by the timely release of tools and services both next year and beyond. "
        },
        {
            "text": "As local planning authorities start using these resources, we'll also be reviewing and refining the guidance based on real experience. "
        },
        {
            "text": "We're actively seeking feedback from plan-makers as they work with the new system. Each guidance page includes instructions on how to share their thoughts, suggestions and questions. This feedback will help us iterate the guidance to better support users through this transition and ensure it meets the practical needs of those using it every day. "
        },
        {
            "heading": 2,
            "text": "Get involved "
        },
        {
            "text": "As we've explored in this post, our research volunteers are at the heart of how the Digital Planning programme is transforming planning for the 21st century. "
        },
        {
            "text": "We're looking for volunteers from across the planning and development sector to take part in research sessions. Whether you're a planning officer, developer, landowner, planning consultant or technology vendor, your insights will directly shape our work. Register your interest to take part. "
        }
    ]
}