{
    "url": "https://civilservice.blog.gov.uk/2022/05/16/breaking-the-menopause-taboo-in-the-civil-service/",
    "title": "Breaking the menopause taboo in the Civil Service ",
    "authors": [
        "Antonia Romeo, Permanent Secretary of the Ministry of Justice and Civil Service Gender Inclusion Champion",
        "Angela MacDonald, HMRC Deputy CEO and Second Permanent Secretary"
    ],
    "categories": [
        "A great place to work",
        "A Modern Civil Service",
        "An Ambitious Civil Service",
        "Health & Wellbeing",
        "Policymaking",
        "Uncategorized"
    ],
    "pub_date": "2022-05-16T10:22:37+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Antonia Romeo, Civil Service Gender Inclusion Champion, welcomes the new Civil Service Menopause in the Workplace Policy and explains what it means.      "
        },
        {
            "text": "The Civil Service should be at the forefront of inclusivity, breaking down barriers and treating every one of our colleagues with respect and understanding.\n"
        },
        {
            "text": "The Menopause in the Workplace Policy plays a major part in the Department of Health and Social Care (DHSC) Women’s Health Strategy and represents a step forward in our support of affected colleagues. It will inform better understanding, strengthen conversations with managers and teams, provide guidance on the duty of care to support our people, and give advice on the use of relevant workplace adjustments. "
        },
        {
            "text": "It’s vital that the public and private sector work together on this issue. As the Civil Service, we should expect to set the standard in our approach to inclusion, so it’s great that this policy adopts best practice from other leading bodies and organisations."
        },
        {
            "text": "I am grateful to everyone who has played their part in helping us to reach this milestone. We would particularly like to congratulate the Cross-Government Menopause Network for the terrific groundwork they did in providing the initial guidelines for colleagues and for developing such a practical and helpful toolkit for managers."
        },
        {
            "heading": 3,
            "text": "Angela MacDonald, senior sponsor of the Cross Government Menopause Network and Second Permanent Secretary at HMRC, shares her personal experience of this all-too-often taboo subject. She encourages colleagues to share their own experiences and to join the Cross-Government Menopause Network. "
        },
        {
            "text": "It wasn’t that long ago that I struggled to talk openly about my own difficult menopause symptoms, and I expressed that journey in my recent article in Civil Service World. I outlined just how important it is to have meaningful conversations about the menopause and any barriers you might face at work as a result. "
        },
        {
            "text": "I know from my many years in the Civil Service that it isn’t easy being a line manager at times. I certainly don’t expect line managers to be experts of every menopause symptom - after all, there are more than 30. Yet just being willing to find out more, listening carefully to how each colleague experiences the menopause, and helping to look for ways to provide support can go such a long way. "
        },
        {
            "text": "Thanks to all who have taken the time to review the policy and shared their insights and reflections. The policy is the result of years of work by colleagues to raise awareness of the menopause, and every person who has started a conversation in order to support a colleague with the menopause. "
        },
        {
            "text": "If you want help setting up a network or advice about raising awareness of the menopause in your organisation, then contact the Cross Government Menopause Network: crossgovernmentmenopausenetwork@hmrc.gov.uk."
        },
        {
            "text": "Do contact the network with your thoughts and examples of best practice and to share your stories. Antonia and Angela look forward to hearing what works!"
        }
    ]
}