{
    "url": "https://insolvencyservice.blog.gov.uk/2022/05/16/continuing-professional-development-at-the-insolvency-service/",
    "title": "Continuing professional development at the Insolvency Service",
    "authors": [
        "Jason Pawlin"
    ],
    "categories": [
        "Official Receiver Services",
        "Working for the Insolvency Service"
    ],
    "pub_date": "2022-05-16T09:43:50+00:00",
    "content": [
        {
            "text": "When we published the Insolvency Service Strategy 2021-2026 last September, we announced how we would sharpen our operating focus in the Official Receiver Services (ORS).  We also announced our specialists would be given the opportunity to undertake a programme of continuing professional development (CPD)."
        },
        {
            "heading": 2,
            "text": "CPD pilot scheme launched"
        },
        {
            "text": "Out of this commitment, we ran a project to run a pilot scheme for several of our Official Receivers and Deputy Official Receivers to take the same professional qualifications that are available for insolvency professionals in the private sector."
        },
        {
            "text": "On offer was the Joint Insolvency Examination Board (JIEB) qualification for our Official Receivers, while Deputy Official Receivers could study for the Institute of Chartered Accountants in England and Wales (ICAEW) Certificate in Insolvency."
        },
        {
            "text": "We are delighted to report that the pilot was a success, with some of our Deputy Official Receivers attaining the Certificate in Insolvency Practice and a couple of our Official Receivers achieving the JIEB qualification."
        },
        {
            "text": "To celebrate Learning at Work Week, we sat down and chatted with two successful colleagues, Katie Hudson and Joe Sullivan, and asked for their honest assessment about achieving the JIEB  qualification."
        },
        {
            "heading": 2,
            "text": "Katie Hudson, Official Receiver:"
        },
        {
            "text": "Back in October 2020 I received an email asking me if I’d like to consider being part of a pilot of Official Receivers undertaking the JIEB qualification."
        },
        {
            "text": "I’ve been in the Insolvency Service now for nearly 25 years and was aware of the reputation that the exams were extremely tough to pass. I knew a few ex-colleagues who had joined the private sector and it had taken a couple of attempts to get the qualification, so I surprised myself by agreeing to going for it."
        },
        {
            "text": "Although I had been an Official Receiver for a few years, I’d recently moved to the agency's Public Interest Unit and was dealing with more complex work, so it felt like a good opportunity to broaden my technical knowledge. I also hoped I’d learn more about the mysterious world of what Insolvency Practitioners do (I did), learn some useful things (I definitely did) and hopefully I’d come out of it with a qualification (I did that too, by the skin of my teeth!)."
        },
        {
            "heading": 3,
            "text": "New found confidence"
        },
        {
            "text": "Gaining the qualification has given me more confidence in the regular conversations I have with insolvency practitioners and other insolvency professionals. It has certainly enhanced my technical knowledge outside of bankruptcies and compulsory liquidations that I had years of experience of, to the whole wonderful world of insolvency options."
        },
        {
            "text": "It might be a bit of a stretch to say I enjoyed doing the JIEB. It was certainly challenging and extremely stressful at times, particularly in finding time to fit in study around the day job and home life, but it had its enjoyable moments. I have a huge sense of achievement in gaining the qualification and I’m grateful to the agency for giving me the opportunity to study for it and develop my professional skills.\""
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Joe Sullivan, Official Receiver:"
        },
        {
            "text": "Having worked in IP Regulation for many years, I built up a good understanding of what the JIEB entailed, and how difficult it was. Despite that, when I became an Official Receiver, I jumped at the opportunity to study for the exams."
        },
        {
            "text": "Even though the JIEB was daunting I thought that I would be off to a good start as I already knew the Statements of Insolvency Practice and the Insolvency Code of Ethics, only to be told they are only ever worth a couple of marks in the exam."
        },
        {
            "text": "The journey itself had everything: whole days doing cashflow forecasts, spending 40 minutes writing pages for zero marks and making myself (in)famous for inadvertently suggesting fees could be approved by deemed consent – something my tutor has never let me forget!"
        },
        {
            "heading": 3,
            "text": "A fantastic study programme"
        },
        {
            "text": "Aside from all that, it was a fantastic study programme which I learnt an lot from. I've already been able to apply it to the work of ORS and that is so important to the future of the agency as we professionalise our work."
        },
        {
            "text": "We have more colleagues this year studying for the JIEB, but also the Certificate in Insolvency Practice too and no doubt there will be many more successes. I'd to wish everyone good luck with their studies."
        },
        {
            "text": "If an opportunity to study for a professional qualification does come up, I would encourage everyone to give some thought to that opportunity and how that fits in with your own development and career. It will be hard work and for the JIEB, very hard."
        },
        {
            "text": "For two months at the end I was living and breathing JIEB. I remember vividly sitting in the cinema a few weeks before the exams watching the new James Bond film and reciting the out of court procedure for an administration in my head!"
        },
        {
            "text": "I’m immensely proud to have passed and be supporting the Agency’s future strategy, but I also couldn’t have done it without the support of my team and colleagues around me.\""
        },
        {
            "heading": 3,
            "text": "Further information"
        }
    ]
}