{
    "url": "https://space.blog.gov.uk/2022/05/16/how-could-we-stay-connected-with-astronauts-on-mars/",
    "title": "How could we stay connected with astronauts on Mars?",
    "authors": [
        "Rob Brougham"
    ],
    "categories": [
        "Space exploration"
    ],
    "pub_date": "2022-05-16T15:43:30+01:00",
    "content": [
        {
            "text": "Meet the company preparing for humans' first mission to Mars by creating a new communications technology to help astronauts stay connected and emotionally supported."
        },
        {
            "text": "This innovative technology, developed by Braided Communications with funding support from UK Space Agency, is already helping to improve inclusion in cognitively diverse workforce teams here on Earth. "
        },
        {
            "heading": 2,
            "text": "Meeting a Martian challenge"
        },
        {
            "text": "Humans will soon return to the Moon for the first time in 50 years, in part as a stepping stone towards the first crewed missions to Mars."
        },
        {
            "text": "A mission to Mars will be much harder than getting to the Moon, mainly because it is so far away."
        },
        {
            "text": "The distance between Earth and Mars changes all the time as the two planets move around the Sun, but Mars is always at least 150 times further away from us than the Moon, and sometimes over 1,000 times further away."
        },
        {
            "text": "As well as sourcing the right equipment and fuel, one of the biggest challenges of these missions will be how to keep the crew healthy and happy, so that they can work properly and return safely."
        },
        {
            "text": "For starters, they will need enough food, water and oxygen for a mission that could last up to three years."
        },
        {
            "text": "Without going into too much detail, a lot of recycling will be required to meet some of those needs…"
        },
        {
            "heading": 2,
            "text": "Isolation and communication delay"
        },
        {
            "text": "Astronauts heading to Mars will also need protection against the many hazards of deep space."
        },
        {
            "text": "Some are obvious, such as microgravity and high radiation levels."
        },
        {
            "text": "Less obvious, but equally challenging, is the psychological impact of isolation."
        },
        {
            "text": "The crew will be in a small space a long way from home so they will need plenty of help and support from the ground."
        },
        {
            "text": "That will include expert help from their colleagues in mission control, and emotional support and encouragement from their loved ones."
        },
        {
            "text": "While many of us have become used to managing feelings of isolation, especially throughout the pandemic, using phones and video, the challenge here is that you can't just phone a friend from space."
        },
        {
            "text": "The distances are so vast that radio waves, or lasers, carrying the signals take much more time to cross the void."
        },
        {
            "text": "For crews on Mars, the delay between messages can be up to, and even more than, 20 minutes."
        },
        {
            "text": "It's tricky to have a normal conversation if it takes 40 minutes to exchange a \"hello\"."
        },
        {
            "heading": 2,
            "text": "How we can help"
        },
        {
            "text": "Braided Communications is a UK company that has developed a solution to this problem by splitting dialogue into different threads, or braids, and presenting them in a novel way that will make these communications feel like normal conversations to both parties."
        },
        {
            "text": "An experiment funded by UK Space Agency to test this idea has already shown positive results."
        },
        {
            "heading": 3,
            "text": "Can this technology benefit people on Earth?"
        },
        {
            "text": "Braided Communications has used this space-focused technology to create Braided Meetings: a new way of holding meetings between cognitively diverse groups that allows everybody to contribute equally."
        },
        {
            "text": "Recruiting a cognitively diverse workforce enhances teams by ensuring a range of creative, problem-solving skills."
        },
        {
            "text": "But just as people think in different ways, they often communicate in different ways, too."
        },
        {
            "text": "Introverts may prefer to think deeply before contributing to group conversations, for instance, while extroverts tend to speak more readily."
        },
        {
            "text": "This can mean that, in a traditional meeting setting, outputs are dominated by the more extroverted team members, while good ideas from more introverted team members can get lost."
        },
        {
            "text": "Braided Meetings aims to change that completely and give everyone the chance, not just to be included, but to really feel that they belong in the team."
        },
        {
            "text": "To find out more visit www.braided.space"
        }
    ]
}