{
    "url": "https://hodigital.blog.gov.uk/2022/05/16/innovative-pathways-into-tech-for-graduates-our-dynamic-development-scheme/",
    "title": "Innovative pathways into tech for graduates: our Dynamic Development Scheme",
    "authors": [
        "Anastasia Bower, DDS Business Analyst Associate"
    ],
    "categories": [
        "Graduates",
        "Recruitment"
    ],
    "pub_date": "2022-05-16T15:26:00+01:00",
    "content": [
        {
            "text": "The Dynamic Development Scheme (DDS) is an exciting two-year rotational programme for graduates with a minimum 2.2 degree in any subject who are passionate about working in Digital, Data and Technology (DDaT)."
        },
        {
            "text": "During your first year you will complete six-month placements supporting DDaT projects working within DDaT multidisciplinary teams."
        },
        {
            "text": "In the second year you will complete a 12-month placement and choose a preferred specialism from five options. You will also have a great opportunity to develop and broaden your skills and undertake specialist training."
        },
        {
            "text": "You will form part of a diverse and supportive graduate network, with mentors to help support you shape your career."
        },
        {
            "text": "Our Associates on the scheme receive a competitive starting salary (£35,054) London, (£30,817) National."
        },
        {
            "text": "Anastasia tells us about her experiences as a Business Analyst on the scheme."
        },
        {
            "text": "Tell us a bit about your journey into the Civil Service and how you ended up in your current role"
        },
        {
            "text": "I joined the Civil Service a few months after leaving University after taking time to reflect on my values and what drives me. I knew I wanted a role where I could help people and serve a purpose in society."
        },
        {
            "text": "I began searching roles in the Civil Service and soon applied as a Work Coach in the Department for Work and Pensions (DWP) supporting people through the pandemic. It was there that I was introduced to the concept of agile and project delivery which led to my interest in the DDaT profession. I was able to apply some of the methodologies I had learned to the smaller projects I was working on and began broadening my skillset."
        },
        {
            "text": "This supported my application to the Home Office DDS. I am currently on my second placement of the scheme as a Business Analyst. Prior to that I was placed as a Technology Delivery Manager."
        },
        {
            "text": "Describe a day in the life at your current role as a Business Analyst on the scheme"
        },
        {
            "text": "A typical day as a Business Analyst within a multidisciplinary agile team delivering a digital service begins with a ‘daily stand-up’. The stand-up meeting is an opportunity to share your focus for the day and hear what your colleagues are working on. Colleagues share relevant news and raise any potential blockers or challenges to the project for the team to discuss."
        },
        {
            "text": "I may meet with the Product Owners and read documentation to gather requirements for the particular business area I am investigating. I then map out the requirements and begin breaking these down into user stories."
        },
        {
            "text": "We have regular peer review meetings which provide an opportunity for me to share the user stories and acceptance criteria I have written for the area of the system I’m responsible for."
        },
        {
            "text": "Tell us about some of your Civil Service highlights so far "
        },
        {
            "text": "A particular highlight for me was in my previous placement on the DDS. I was a Technology Delivery Manager for a live system used by the police."
        },
        {
            "text": "After only a few months in the job I attended a policing conference and workshop with one of the products’ stakeholder governance groups. Due to Covid, I attended the event as the only Home Office colleague. As a relatively new member of staff, and a naturally introverted one at that, the prospect of attending such an event alone was a daunting one."
        },
        {
            "text": "Despite my nervousness, I was able to positively engage with our stakeholders and act as a representative during the workshop."
        },
        {
            "text": "This experience really took me out of my comfort zone, however it highlighted that I can step up to a challenge and was a great example of how opportunities like these in the Civil Service can build self-confidence."
        },
        {
            "text": "What are your hobbies outside of work and how is your work/life balance in the Civil Service?"
        },
        {
            "text": "I love painting and illustration and have recently tried my hand at making wedding stationery. I also love getting outdoors for photography and being by the sea."
        },
        {
            "text": "A good work/life balance is really important to me and my experience so far in the Civil Service has provided that."
        },
        {
            "text": "What advice would you give to a young person who is unsure about joining the Civil Service?"
        },
        {
            "text": "My advice to anyone who is unsure about joining the Civil Service is to take some time to think about your natural strengths and how these can be transferred to different roles. Part-time jobs and your experiences at University may provide you with the skills you need for Civil Service roles."
        },
        {
            "text": "Also take time to reflect on what matters to you and what engages you. Taking a wider look may help in assessing a potential path or area of interest in the Civil Service. The Civil Service has a variety of roles and professions requiring an array of different skill sets, working on projects, services or operations that are engaging and fulfilling."
        }
    ]
}