{
    "url": "https://gds.blog.gov.uk/2022/05/16/intern-to-data-scientist-the-civil-services-innovative-tech-talent-pipeline/",
    "title": "Intern to data scientist: the Civil Service’s innovative tech talent pipeline",
    "authors": [
        "Jake Rutherford, Data Scientist, Government Digital Service"
    ],
    "categories": [
        "People and skills"
    ],
    "pub_date": "2022-05-16T11:06:35+01:00",
    "content": [
        {
            "text": "Summer Diversity Internship Programme (SDIP) graduate Jake Rutherford spent some of his internship collaborating with the Government Digital Service’s (GDS) Data Products team. Jake went on to be offered a full time role as a data scientist at GDS and here, to celebrate Learning at Work Week, explains how the opportunity to learn whilst working was instrumental to his career."
        },
        {
            "heading": 2,
            "text": "The foundations "
        },
        {
            "text": "I first became aware of the SDIP after one of my friends completed the programme. He often spoke of his joy working collaboratively with humble, entrepreneurial, and talented people to serve the public. This, of course, filled me with the desire to work alongside such people myself. Furthermore, I thought it’d be great to be involved in something that facilitates social mobility and stimulates diversity of thought in government, by creating opportunities for disadvantaged people."
        },
        {
            "text": "My placement on the SDIP began in August 2021, in the Central Digital and Data Office’s DDaT (Digital, Data and Technology) Profession team. I landed on my feet here, surrounded by lovely people that wanted the best for me. As my time at university was spent studying data science, my workplace mentor and supportive line manager were keen on exposing me to opportunities to continue learning about data science at work. This led me to collaborate with the Data Products team in GDS, and the rest, as they say, is history! "
        },
        {
            "text": "I was thrilled to be offered a full time role in Data Products at GDS in September 2021. After all my studying, this was my first proper job in the career I had wanted so much to pursue. I derived great lessons from the experience of joining the Civil Service and transitioning into Data Products:"
        },
        {
            "text": "These lessons are foundational to the ongoing pursuit of learning in the workplace."
        },
        {
            "heading": 2,
            "text": "The journey"
        },
        {
            "text": "I see Data Products as a group of people, aiming to use data science to improve the experiences people have when consuming government content and services. That may be via deploying public-facing technology, or by empowering other teams to do their best work through the internal tools we build. "
        },
        {
            "text": "Naturally, I learnt a huge amount about data science being in a data science team. My technical data science skills blossomed, whilst my soft data science skills were nurtured, as I learnt more and more at work and heightened my awareness of the opportunities for data science. Some of my development highlights included: "
        },
        {
            "text": "Before I came to GDS, it was difficult to gauge the standard of my data science capabilities. This was a source of self-doubt… hello, impostor syndrome! When I first joined Data Products, I thought I’d be in the midst of all-knowing polymath demigods of data science. However, being amongst experienced data scientists, observing what they know and heeding their feedback, I realise now that I am unashamedly good at what I do. "
        },
        {
            "text": "What’s more, we’re all still learning. Nobody knows everything. There are no all-knowing data scientists. Every day, at work and in our personal lives, there are endless lessons to be learnt. Admitting you don’t know everything and committing to being a student for life is something to be proud of."
        },
        {
            "heading": 2,
            "text": "The future"
        },
        {
            "text": "If I could give advice to anyone considering the SDIP or working at GDS, it’d be wherever you are right now, take the initiative: find opportunities, be bold and challenge yourself. Don’t ever let your background diminish your self-confidence or self-worth, and instead let it be a strength that propels you to the top. Your life so far has been an education in itself. "
        },
        {
            "text": "This can be leveraged as a source of wisdom, which will be seen as a great asset to GDS and the Civil Service. You will be treated as an equal and your team will invest in you. Your potential will be unleashed and you will learn immeasurably. GDS, and my team, have helped set me on a promising career path, one in which I am brimming with confidence. "
        },
        {
            "text": "It’s been a privilege to work alongside the great minds at GDS, united under a shared vision. The work we do here is difficult, but I think we all thrive on that. It’s why we wanted to work in tech – it’s an ever-changing, fast-paced sector that’s building the future. Constant exposure to challenge and innovation at work creates this unscratchable itch to keep learning. So let your workplace be your university. Look out bravely upon the fog of mystery and let it be the greatest teacher you ever had."
        }
    ]
}