{
    "url": "https://deframedia.blog.gov.uk/2022/05/16/water-resources-on-bbc-countryfile/",
    "title": "Water resources on BBC Countryfile",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Environment Agency",
        "Weekly stories"
    ],
    "pub_date": "2022-05-16T14:28:39+01:00",
    "content": [
        {
            "text": "The pressures facing England’s water resources as a result of a growing population, climate change and ageing infrastructure was covered by BBC One’s Countryfile last night (Sunday 15 May) as it looked at ways to solve the issue."
        },
        {
            "text": "The latest predictions estimate that if further action is not taken, an additional 4 billion litres of water per day will be needed by 2050 to meet future public demand."
        },
        {
            "text": "Sir James Bevan, chief executive of the Environment Agency, was interviewed by reporter Tom Heap at the Bewl Water reservoir in East Sussex where he discussed a range of actions to address the issue, including reducing personal consumption, fixing leaks in pipes, and increasing supply by creating new reservoirs. He also spoke of the potential impacts on farming and food supply, energy production and the natural environment if water supply issues are not managed in the future."
        },
        {
            "text": "Sir James Bevan said on Countryfile:"
        },
        {
            "text": "The film also explored water neutrality – the concept that demand for water should be the same or lower in an area after new development is built as it was before – focusing on the Arun Valley in south east England."
        },
        {
            "text": "Natural England has set a requirement for water neutrality in Southern Water’s Sussex North water zone to protect a designated conservation site in the Arun Valley from possible damage from increased abstractions. Sue Beale from Natural England spoke to Tom Heap about why this advice has been issued, including the potential impacts on rare wildlife in the area."
        },
        {
            "text": "The Home Builders Federation were also interviewed about the effect of water neutrality legislation, while Southern Water spoke about the company’s work in fixing infrastructure and boosting future water supply in the area."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}