{
    "url": "https://designnotes.blog.gov.uk/2022/05/16/why-and-how-to-embed-design-training-in-your-organisation/",
    "title": "Why and how to embed design training in your organisation",
    "authors": [
        "Nikin Nagewadia, Senior Interaction designer, GDS"
    ],
    "categories": [
        "Community",
        "Design",
        "Training"
    ],
    "pub_date": "2022-05-16T09:00:18+01:00",
    "content": [
        {
            "heading": 2,
            "text": "Training helps both organisations and individuals"
        },
        {
            "text": "Within the design community in government we’ve seen the benefits that user-centred design training can have. There’s so much knowledge in the heads of the people we work with, and through developing our own training it helps us to share that in a way that’s tailored to the work we do and the context we work in, filling knowledge gaps and creating consistency where useful."
        },
        {
            "text": "Beyond knowledge sharing, designing and delivering training can also allow you to receive feedback and iterate your work or methods, and make valuable connections across government. Others may even come to perceive you as an expert when it comes to a specific craft or space, and ultimately this can help build your confidence in your own practice and further develop your career."
        },
        {
            "text": "There are even benefits to offering training beyond your discipline. By opening up training to others there is a greater chance that you will learn from different perspectives or approaches which can help you develop your own practice. It can also help to build understanding about how other disciplines work and what they can offer, which makes working together even better."
        },
        {
            "text": "Recently, Services Week 2022 took place, where many disciplines from across the government offered training and workshops ranging from content design, to using the Prototype Kit, to an introduction of Service Design. There were also talks about applying user-centred design practices and its impact within a department. These workshops were open to anyone with an interest, and more than 2,500 people attended which goes to show how much people value learning from their peers and other disciplines – you can read about the week’s activities. "
        },
        {
            "text": "So how do you get started as a trainer? Here are some tips based on what we’ve learned:"
        },
        {
            "heading": 2,
            "text": "1. It’s possible for anyone to be a trainer"
        },
        {
            "text": "You don’t need to be an expert or know the inside-out of the tool or methodology, you just need to know about one thing really well and believe that it can benefit others. To get started, reach out within your networks to gauge interest to shape the scope of your training."
        },
        {
            "text": "Over the last year, I facilitated Figma training sessions on the more advanced features like Auto Layout. Not only did I share my understanding of those features’ methodologies and functionalities with others; I also learned some neat tricks myself, and gained empathy for those not familiar with using Figma. Although I ran those sessions, I’m constantly learning about the tool itself and will be sharing what I learn as I go.\n\nIf you haven't run training before it can seem a bit stressful – that’s okay. I was nervous when I did my first Figma workshop, so I did a dry run beforehand with one person. Starting with one or 2 people can help you get a feel for it, get feedback on what worked and what didn’t go exactly as you envisioned and build your confidence to run the session with a larger group."
        },
        {
            "heading": 2,
            "text": "2. Your training process will iterate"
        },
        {
            "text": "As for the session itself, it can be as large as a 40-person workshop or as intimate as a one-on-one session. Regardless of the size, there is a possibility that the session itself may not run as you may have imagined – and that’s okay."
        },
        {
            "text": "Remember, this is an ongoing learning process with room for improvement and further iterations, so reflect when things go off track, and be open to feedback and trying out new approaches. It’s important to keep in mind that there is more than one way of doing something, so be open to gaining new insights and perspectives from your participants."
        },
        {
            "text": "If you want to know more about how to structure your training, read “Making design training better”, which clearly demonstrates the evolution and challenges of iterating the design training course."
        },
        {
            "heading": 2,
            "text": "3. There’s lots out there to learn from"
        },
        {
            "text": "You don’t have to start from scratch – there are lots of people out there who have developed and delivered training, and shared their learnings about it. To find out more, have a read of these openly-available resources:"
        },
        {
            "heading": 2,
            "text": "Good luck! "
        },
        {
            "text": "Once you feel ready in running your own training workshop, or interested in helping out by being a co-facilitator, details can be found in the blog post, “Setting cross-government design community objectives”, which also outlines the many ways you can contribute to the cross-government design community."
        }
    ]
}