{
    "url": "https://defrafarming.blog.gov.uk/2022/12/14/how-we-used-co-design-to-create-vet-visits/",
    "title": "How we used co-design to create vet visits ",
    "authors": [
        "Martin Jenkins",
        "Robin Hancock",
        "The Co-design Team"
    ],
    "categories": [
        "Conversations we're having",
        "Payments to improve animal health and welfare",
        "Things we're doing",
        "Things we've learned"
    ],
    "pub_date": "2022-12-14T15:00:23+00:00",
    "content": [
        {
            "text": "Farmers, vets, industry representatives and colleagues in government are shaping the Animal Health and Welfare Pathway together. "
        },
        {
            "text": "The first step of the pathway is the Annual Health and Welfare Review. In this post, we'll share how we used co-design to create the yearly vet visits. "
        },
        {
            "heading": 2,
            "text": "A collaborative approach"
        },
        {
            "text": " Through co-design, we believe our schemes have the greatest chance of success. There really is no substitute for on-the-ground experience.  "
        },
        {
            "text": "So, in addition to offering our expertise, those with farming experience needed to be involved.  "
        },
        {
            "text": "We decided that the chair of our co-design steering group should be a farmer. Farmer and former Chair of the Animal Health and Welfare Board, Michael Seals took on the role. The steering group helped narrow our focus. "
        },
        {
            "text": "Initially, the group thought that for sheep we should focus on sheep scab. Over time and through conversation, it became clear that a broader health screening approach would be more effective than attempting to focus on a single disease."
        },
        {
            "heading": 2,
            "text": "Working in the open"
        },
        {
            "text": "Working in the open and discussing a range of views helped build a holistic view of what everyone was trying to achieve: in this case, healthier animals reared to high welfare standards.  "
        },
        {
            "text": "We also wanted to get a wide range of perspectives. So, through the farmers and vets co-designing with us, we contacted over 500 people in the pig, cattle, sheep and poultry sectors. "
        },
        {
            "text": "We tested proposals from our steering group with them and arranged workshops and focus groups so we could work together and keep people involved. We also fed back what we were doing through presentations."
        },
        {
            "text": "As we continued this process of co-design, it became clear to us that neither government nor industry had a fully accurate view of the prevalence of some of the priority endemic diseases. "
        },
        {
            "text": "Although we have been battling these diseases continuously, when we went back and checked we found that in some cases, our data needed updating. This presented a challenge for us: we needed to know whether disease prevalence has changed over time. "
        },
        {
            "text": "We initially thought we could solve this by running research and development as part of a larger programme of work. This would have taken a long time, and may not have been cost effective."
        },
        {
            "text": "We were also concerned that this would not fit with the co-design approach we had been following so far."
        },
        {
            "text": "We looked at what was happening already. Vets provide advice and play a significant part in bringing about change on farms.  They are often a more trusted source of animal health and welfare advice than inspectors.  "
        },
        {
            "text": "As a result, we offered to pay for the farmer's vet visit. During these visits, vets could offer our health and welfare advice for free. They could also carry out a priority test to detect endemic diseases."
        },
        {
            "text": "Through this approach, farmers would receive health and welfare advice leading to improved outcomes on their farms. Our understanding of disease prevalence would be improved, too. Approaching those two things in a joined-up way represented better value for money."
        },
        {
            "text": "As well as the outcomes, we hope that it will strengthen partnerships and improve trust between farmers, vets and government."
        },
        {
            "text": "We tested the first Annual Health and Welfare Reviews in September 2022. We will steadily increase the number of reviews by invitation, before we open the review to all eligible farmers in January 2023."
        },
        {
            "text": " We will continue to make improvements and iterations over time, using feedback from farmers and industry experts. "
        },
        {
            "heading": 2,
            "text": "What we learned  "
        },
        {
            "text": "One of the main takeaways was that it is critical to build trust. This takes time and cannot be rushed. "
        },
        {
            "text": "Open discussion and clear communication from the start was vital. For example, as a group we discussed what we knew about endemic disease in livestock and where our knowledge was lacking.  To that end, we found great value in working in partnership with the industry."
        },
        {
            "text": "By working together in the open we learned from each other. Farmers, vets, policy makers and analysts (amongst others) approach problems in different ways and bring different ways of thinking to the table. Being exposed to them is hugely beneficial to both our understanding and decision-making. "
        },
        {
            "text": "Continuously sharing feedback was also incredibly important. It helped keep everyone involved informed and contributing to the pathway. "
        },
        {
            "text": "We did this by both regularly meeting together within our working groups, but also by sharing with the wider community through talks and presentations, where everyone had the chance to share their insight and reflections."
        },
        {
            "text": "A lot of what we learned has been distilled into the principles that the Future Farming co-design team created. You can read about this in a previous post. "
        },
        {
            "text": "Look out for an update on what we’ve learned from the early roll out of vet visits by subscribing to the Future Farming blog. "
        }
    ]
}