{
    "url": "https://dfedigital.blog.gov.uk/2022/12/14/improve-public-service/",
    "title": "Overcoming different ways of working to improve a public service",
    "authors": [
        "Frankie Roberto",
        "Myles Jarvis"
    ],
    "categories": [
        "multidisciplinary teams",
        "Service design",
        "user research"
    ],
    "pub_date": "2022-12-14T14:02:28+00:00",
    "content": [
        {
            "text": "Traditionally in government, policy has been quite far removed from how services were run (sometimes literally, being in separate cities)."
        },
        {
            "text": "With the development of digital services and the practice of user-centred design, we can now bring policy and digital much closer together, although this if often easier said than done."
        },
        {
            "text": "The cultural differences between policy and digital are both superficial and deep rooted."
        },
        {
            "text": "Policy teams deal in ‘submissions’, ‘options analysis’ and ‘lines’. Digital teams deal in ‘sprints’, ‘Trello cards’ and ‘pull requests’. Policy people do engagement and decision making up front. Digital people make decisions as they go along and then make changes in response to user research and behaviour."
        },
        {
            "text": "In this post I explain how we overcame ways of working and cultural issues with our policy colleagues, while we all worked together on a significant improvement to a public service."
        },
        {
            "heading": 2,
            "text": "The service challenge"
        },
        {
            "text": "In the Apply for teacher training service, we recently decided to tackle one of the biggest barriers facing people who wanted to train to be a teacher. This barrier was having to get 2 references before they could submit an application to the teacher training service. This caused problems because:"
        },
        {
            "text": "The requirement for 2 references was a longstanding policy going back to the days when Universities and Colleges Admissions Service (UCAS) ran the service."
        },
        {
            "text": "We started by questioning the purpose of the references, if they were needed, and if so, at what stage."
        },
        {
            "heading": 2,
            "text": "What the user research showed us"
        },
        {
            "text": "Policy and digital people worked closely together to watch user research with all 3 of our user groups, which are:"
        },
        {
            "text": "Our research showed us 3 particularly useful insights:"
        },
        {
            "heading": 2,
            "text": "What the data told us"
        },
        {
            "text": "In May 2022 data showed that 2,000 candidates who had applied to UCAS (and given contact details of  their 2 referees) didn’t receive their references. This was in spite of the system automatically emailing their referees, prompting them to submit a reference."
        },
        {
            "text": "This meant 2,000 applications were blocked. Getting references was clearly a barrier for candidates who were subsequently stuck in the system."
        },
        {
            "heading": 2,
            "text": "Changing the sequence of steps made a big difference to users"
        },
        {
            "text": "We decided to design a change to the references process."
        },
        {
            "text": "Referees’ details would be collected in the initial application form, but the references themselves would not be requested until after an offer had been accepted. This would remove the need for references up front and speed up the process of assessing candidates. Instead references would become a safeguarding check further along in the process."
        },
        {
            "text": "Prototyping this, and carrying out usability testing with our 3 user groups, convinced us that this process would be a big improvement."
        },
        {
            "text": "We then needed to explain why this change was necessary to teacher training providers such as colleges and universities. So policy and digital colleagues co-presented to training providers explaining the research findings and answering questions."
        },
        {
            "heading": 2,
            "text": "Bringing policy and delivery people closer"
        },
        {
            "text": "Bridging across the digital and policy cultural divide wasn’t always easy. Although we had debates about the details of implementation, our shared goal brought us closer together than ever before."
        },
        {
            "text": "Some things that helped us build trust and improve communication were:"
        },
        {
            "heading": 2,
            "text": "Early results are promising"
        },
        {
            "text": "On the first day of the 2022 to 2023 recruitment cycle, 825 more candidates submitted applications compared to the year before."
        },
        {
            "text": "In the first month, 640 more candidates submitted applications."
        },
        {
            "text": "On average, when candidates are working on their application, before they submit it, they are signing in 2 times less than they did before we made this change."
        },
        {
            "text": "Training providers have recognised the benefits of the new process. Here’s some feedback we’ve received."
        },
        {
            "heading": 2,
            "text": "What’s next"
        },
        {
            "text": "In our team we know a digital service is never finished or complete. But we've done one thing to make it easier for candidates to submit applications."
        },
        {
            "text": "We want to continue to make those applications as successful as possible. We've begun research with teacher training providers. We’re keen to hear what the first 2 months of the application process is been like for them. This information will inform where we go next."
        },
        {
            "text": "If you or your team have any other practical ways to bring policy and digital teams closer together to design better services, please let us know – we'd love to hear from you."
        }
    ]
}