{
    "url": "https://dluhcdigital.blog.gov.uk/2022/12/14/insights-from-the-local-government-caf-pilot/",
    "title": "Insights from the Cyber Assessment Framework for Local Government pilot",
    "authors": [
        "The Local Digital team"
    ],
    "categories": [
        "Cyber",
        "Local Digital"
    ],
    "pub_date": "2022-12-14T12:12:11+00:00",
    "content": [
        {
            "text": "In September 2022, the DLUHC Local Digital team kicked off a pilot with a cohort of councils to explore how the NCSC’s Cyber Assessment Framework (CAF) could be used to help assess and manage cyber risks across local government in England."
        },
        {
            "text": "The first phase of the pilot has seen us undertake more than 50 hours of workshops with 10 councils from across England as we’ve worked through the four objectives outlined in the CAF."
        },
        {
            "text": "As this phase comes to an end, we’re keen to share some initial insights and feedback with you before we move into the next phase."
        },
        {
            "text": "Read on to find out what’s next for the pilot in 2023, and how to register for the Show and Tell in January to hear more about our findings."
        },
        {
            "heading": 2,
            "text": "Exploring a cyber assessment framework for local government"
        },
        {
            "text": "Since September, we’ve been working closely with our pilot councils to gather thoughts and feedback about the CAF and the value it could add in their organisation. We’ve also been exploring more complex questions such as how to scope the assessment, and whether a single assessment would be a realistic and meaningful reflection of a whole council IT network."
        },
        {
            "text": "We also wanted to test what a proportionate CAF profile for councils might look like – in other words, which of the 39 CAF Outcomes should councils be aiming to ‘fully achieve’ or ‘partially achieve’ as a minimum."
        },
        {
            "heading": 3,
            "text": "Selecting the councils"
        },
        {
            "text": "While our pilot cohort needed to be small to allow us to get into detail, we wanted to make sure we were engaging with a group of councils representative of some of the common challenges and postures across the sector."
        },
        {
            "text": "We invited over 30 councils to submit short expressions of interest, and from the responses we selected a group of 10 councils with a good level of variation across factors such as size, geography, cyber maturity, and IT model (for example, in-house, outsourced and shared services)."
        },
        {
            "text": " "
        },
        {
            "text": "Our pilot councils have been working through the four objectives outlined in the NCSC’s Cyber Assessment Framework, carrying out a self-assessment against each of the 39 Outcomes and providing additional user feedback in an Excel workbook that we created for the task."
        },
        {
            "text": "As they moved through the self-assessment, they were invited to one-to-one workshops with our DLUHC team to discuss the user experience and the finer points of their assessment."
        },
        {
            "text": "Now that the workshops are complete, we’re keen to share some early insights from the process."
        },
        {
            "heading": 2,
            "text": "Initial insights from the first phase of the CAF pilot"
        },
        {
            "heading": 3,
            "text": "1. Assessing against the CAF adds value"
        },
        {
            "text": "Using the CAF helped IT leads to consider new questions and identify areas for improvement, particularly across data storage, governance and documentation."
        },
        {
            "text": "The content of the CAF is useful and relevant to the sector but additional clarification or complementary guidance would be helpful in some areas."
        },
        {
            "text": "The CAF was also seen as a potentially helpful tool to support discussions about cyber risk across the business. However for this to be effective, there needs to be engagement and participation from colleagues and leaders outside of the IT team."
        },
        {
            "text": "The councils participating in the pilot told us:"
        },
        {
            "heading": 3,
            "text": "2. The draft CAF profile is challenging, but not necessarily disproportionate"
        },
        {
            "text": "The draft CAF profile we tested during the pilot is intended to help set a proportionate baseline for the sector, and be reflective of a posture resilient to common vulnerabilities and low-level attacks. For example, it sets out that while Outcome ‘A1a Board Direction’ should be “fully achieved” as a minimum, for Outcome ‘A4a Supply Chain’ “partially achieved” might be an acceptable posture for a council."
        },
        {
            "text": "This is not to say that ‘good’ will look the same for everyone."
        },
        {
            "text": "Achieving some parts of the profile will require time, money and effort, but participants generally agreed that this is not a reason to lower the bar."
        },
        {
            "text": "IT leads would also like to see a way to recognise improvement against outcomes that are not yet being met or partially met."
        },
        {
            "text": "The councils participating in the pilot told us:"
        },
        {
            "text": "The CAF profile is still in draft but we hope to share it with the sector early next year."
        },
        {
            "heading": 3,
            "text": "3. We still need to define the scope and ‘essential functions’"
        },
        {
            "text": "Many of the IT leads we spoke to were unsure of how to define ‘essential functions’ in the context of their organisations. This is a question that will require more engagement across the sector to get right."
        },
        {
            "text": "We also collectively struggled with how to approach scoping the assessment. Participants agreed with our starting assumption that the assessment should cover the entire council IT network, but we did find some challenges in practice which we’ll need to keep working through."
        },
        {
            "text": "The councils participating in the pilot told us:"
        },
        {
            "heading": 2,
            "text": "There’s more to come…"
        },
        {
            "text": "We’re still busy analysing the feedback we’ve collected through this phase of the pilot, and will publish more about what we’re learning in early 2023."
        },
        {
            "text": "We’re also hosting a Show and Tell on Wednesday 25 January where you can learn more about the pilot, hear key findings and insights, and listen to members of the pilot council cohort share their experience – register for the event on Eventbrite."
        },
        {
            "heading": 2,
            "text": "Next steps for the CAF pilot"
        },
        {
            "text": "Findings and feedback so far support that adopting the CAF can add genuine value for councils, and we should continue with this approach. In the new year, the second phase of this work will see Local Digital continuing to examine questions raised through the pilot, as well as starting to explore options for external validation of assessments, and reporting into central government."
        },
        {
            "text": "The expectation is that adopting the CAF will not only help councils to manage risks in a clearer, more comprehensive way, but will enable better information sharing to help identify sector-level risks and understand where more support is needed."
        },
        {
            "text": "If you are already using, or are about to start using, the CAF in your council then please complete this short survey to let us know! We’d love to hear more about how you’ve approached it and how it’s working for you."
        },
        {
            "text": "On the other hand, if the CAF is still an unknown acronym, why not start familiarising yourself with it?"
        },
        {
            "text": "You can follow the progress of this work on our usual channels, and we look forward to more CAF discussions in the new year:"
        }
    ]
}