{
    "url": "https://competitionandmarkets.blog.gov.uk/2022/12/14/secondment-opportunities-for-competition-and-consumer-lawyers/",
    "title": "Secondment opportunities for competition and consumer lawyers",
    "authors": [
        "Victoria Oates"
    ],
    "categories": [
        "Life at the CMA"
    ],
    "pub_date": "2022-12-14T10:00:21+00:00",
    "content": [
        {
            "text": "We are launching a new round of secondment opportunities for lawyers, to start on 20 March 2023."
        },
        {
            "text": "Since its launch in June 2018, approaching 50 secondees from over 20 law firms have taken part in the programme and we are now accepting applications for the next round, which is anticipated to start on 20 March 2023."
        },
        {
            "text": "We invite you to consider whether your firm and any of your associates wish to participate."
        },
        {
            "text": "The deadline for applications is Friday, 13 January 2023."
        },
        {
            "text": "We believe our programme offers an exciting opportunity for competition and consumer lawyers:"
        },
        {
            "heading": 2,
            "text": "Comments from previous secondees:"
        },
        {
            "text": "\"I thoroughly enjoyed my secondment to the CMA’s Consumer team. My colleagues were very welcoming and friendly, and got me involved from day one. I helped scope for new consumer law enforcement cases and this taught me a lot about strategy, prioritisation and working within a team to make decisions. I also helped launch and run enforcement cases over my secondment. Overall, this experience was incredibly valuable as I was able to develop my understanding of consumer laws and CMA enforcement powers.  The project I was on very much sat at the forefront of law and technology. Further, the CMA clearly value knowledge sharing as there is no shortage of talks and seminars to attend.”"
        },
        {
            "heading": 2,
            "text": "Application details"
        },
        {
            "text": "Secondments are open to all UK and EU qualified lawyers currently employed in a law firm, and with previous experience working on competition and/or consumer law or related litigation matters."
        },
        {
            "text": "Additionally:"
        },
        {
            "text": "Firms that would like to put candidates forward should email a CV and covering letter for each candidate by Friday, 13 January 2023 to Simon Harms, Richard Flanagan, John Bardsley and Victoria Oates."
        },
        {
            "text": "As part of their covering letter, candidates should confirm that they are able to start their secondment on 20 March 2023 for a 6-month period."
        },
        {
            "text": "Candidates should also express any preference for particular types of work within the CMA which we will do our best to accommodate, including with a view to maximising a firm’s exposure to different CMA tools among their associates seconded over time."
        },
        {
            "text": "Candidates should be available to have a meeting or call with the CMA during the weeks of either 16 January 2023 or 23 January 2023 to discuss the secondment."
        },
        {
            "text": "Please note we will not consider applications via agencies."
        },
        {
            "text": "If you have any questions or would like to discuss the benefits of the programme, please contact any of Simon Harms, Richard Flanagan, John Bardsley and Victoria Oates."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Contact details for secondment programme queries:"
        },
        {
            "text": "Simon Harms "
        },
        {
            "text": "Legal Director Simon.Harms@cma.gov.uk"
        },
        {
            "text": "Richard Flanagan"
        },
        {
            "text": "Legal Director Richard.Flanagan@cma.gov.uk"
        },
        {
            "text": "John Bardsley"
        },
        {
            "text": "Legal Adviser John.Bardsley@cma.gov.uk"
        },
        {
            "text": "Victoria Oates"
        },
        {
            "text": "Legal Adviser  Victoria.Oates@cma.gov.uk"
        },
        {
            "text": " "
        }
    ]
}