{
    "url": "https://extremismcommission.blog.gov.uk/2022/12/14/the-commission-for-countering-extremism-hosts-its-second-conference-of-the-year/",
    "title": "The Commission for Countering Extremism hosts conference focused on tackling extremism in our communities",
    "authors": [
        "timparker"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2022-12-14T15:10:53+00:00",
    "content": [
        {
            "text": "Last week, the Commission for Countering Extremism hosted its second conference of the year, convening experts from across academia, government and law enforcement. The subject under discussion was how best to tackle extremism in our communities."
        },
        {
            "text": "Speeches for the event were delivered by Secretary of State for Levelling Up, Housing and Communities, the Rt Hon Michael Gove MP; and Munira Mirza, Chief Executive of Civic Future, and former Director of the No 10 Policy Unit."
        },
        {
            "text": "Michael Gove thanked delegates for their involvement in the vital work of countering extremism and talked about the new and persistent threats that we face from extremists."
        },
        {
            "text": "Munira Mirza spoke about her longstanding research interest in extremism and protecting liberal values, and the nature of this challenge whilst in the No 10 Policy Unit. She also asserted that counter extremism work involves both the state and wider society, as well as the need for a robust defence of certain core values."
        },
        {
            "text": "Robin Simcox, Commissioner for Countering Extremism, began the day by talking about how extremism can flourish across communities when pernicious ideologies are not openly confronted."
        },
        {
            "text": "He pointed to a number of events this year to support the need for greater focus in this area, including the extreme right-wing inspired firebomb attack in Dover, some of the rhetoric aired during The Lady of Heaven film protests, and civil unrest in Leicester."
        },
        {
            "text": "He also addressed the importance of experts and policymakers working together to find solutions to difficult challenges in the sector."
        },
        {
            "text": "Four informative panel discussions followed, which specifically focused on:"
        },
        {
            "text": "Robin reflected on the day,"
        },
        {
            "text": "“Events like this are a key component of our quest to take on extremism and the social ills it causes. Bringing together academia, government, and law enforcement so they can exchange information and ideas is vital if we are going to make headway – as we must. Today’s rich discussion demonstrated that there is a wealth of knowledge, insight, and fresh thinking on offer. Now it is vital that it is utilised in the most effective way.\""
        }
    ]
}