{
    "url": "https://gott.blog.gov.uk/2021/08/23/from-mars-enabled-technology-to-state-of-the-art-healthcare-techniques/",
    "title": "From Mars enabled technology to state of the art healthcare techniques",
    "authors": [
        "Hayley Goldsbrough"
    ],
    "categories": [
        "Department for Business Energy and Industrial Strategy"
    ],
    "pub_date": "2021-08-23T10:23:22+01:00",
    "content": [
        {
            "text": "We recently hosted an event for anyone across government who might have heard about knowledge assets (KAs) but hadn’t had an opportunity to learn more about the vast potential for this work. KAs are becoming increasingly important to the economy and can realise huge financial, economic and social benefits in the public and private sectors. This event allowed us to showcase the brilliance of this work and the exciting journey ahead, with some key speakers providing real world examples. If you couldn’t join us on the day, please watch the recording here."
        },
        {
            "text": "Agenda and Speakers"
        },
        {
            "text": " "
        },
        {
            "text": "BEIS Chief Scientific Advisor, Professor Paul Monks gave the audience some background on an estimated c.£104 billion of KAs held by the government, which includes the range of advanced research in government laboratories, as well as the many skills and capabilities generated across departments, arm’s length bodies and the wider public sector through the delivery of world-leading public services."
        },
        {
            "text": "Professor Paul Monks also gave a case study to help generate a better understanding."
        },
        {
            "text": "Novel laser detection device"
        },
        {
            "text": " "
        },
        {
            "text": "Sentinel Photonics – invisible laser system  "
        },
        {
            "text": "Chief Technology Officer of Sentinel Photonics (a spin out by DSTL tech transfer team Ploughshare), Sean Tipper spoke of laser-based threats, i.e. a weapon that uses a laser to target and mark an object, to guide in a missile to hit that target accurately. Critically, the laser system is invisible and can cause loss of life. Technology advances means that this threat is becoming increasingly common for soldiers. Sentinel have developed a technology that can see that invisible laser radiation and knows where it is and what it is. The goal is to create a product that can provide users with this information which will provide greater situational awareness and ultimately save lives. They are exceeding the capabilities of current laser detectors at a fraction of the cost by using parts used in mobile phones alongside their own intellectual property."
        },
        {
            "text": "State of the art healthcare techniques"
        },
        {
            "text": "A model of the world’s first dedicated breast density assessment device "
        },
        {
            "text": "Product Leader at the National Physical Laboratory (NPL), Phil Cooper spoke about how NPL is helping to unlock new capabilities by improving ultrasonic standards and developing new devices and imaging technologies. In 2020, 2.3m women were diagnosed with breast cancer, with 685,000 deaths globally​. Early detection is a key to the effective management of the disease​. They have invented the world’s first dedicated breast density assessment device. It will have a quick 2-minute scan time, be quantitative, non-ionising​, comfortable​ and simple. After a 2-minute scan, doctors will be instantly provided with a breast density assessment​. Phil also discussed diabetes as a major global health challenge. ​Diabetic foot ulcers cause significant harm​ with 170 foot amputations each week in the England. No easy way exists to detect, manage and reduce suffering but it is up to 90% preventable if detected early by accurate thermometry​."
        },
        {
            "text": "Applying Mars enabled technologies for industry globally"
        },
        {
            "text": "Keit IRmadillo – a ‘Fourier transform infrared’ (FTIR) Spectrometer"
        },
        {
            "text": "Keit’s technology began in RAL Space in the late 2000s "
        },
        {
            "text": "Liam Brennan from the Science and Technology Facilities Council (STFC, and a part of UK Research and Innovation) gave an example of Keit Spectrometers, where they are commercializing an innovative optical technology."
        },
        {
            "text": "STFC had designed a tool that could analyse the atmosphere of Mars – a Fourier spectrometer. This needed to be able to tolerate the rigours of space travel, to be low maintenance, compact, low-power and vibration tolerance accurate system as well as exceptionally robust. The STFC team realised that there could be alternative industrial uses for this on earth. A spin out company was created, raising more than £8m in private sector funding, creating a range of high-tech jobs. The product is now being sold in several countries including Japan, USA, Australia and Sweden, tackling problems in sectors such as biotech, chemicals and pharmaceuticals."
        },
        {
            "text": "Knowledge Assets Team"
        },
        {
            "text": "Knowledge Assets Team - going forward "
        },
        {
            "text": "Hayley Goldsbrough from the BEIS Knowledge Assets Team gave an update on ​the new strategic capability unit called ‘The Government Office for Technology Transfer’. It will deliver a step change in the management of the social, economic, and financial value of KAs held by the UK public sector, for the benefit of the UK economy and the UK taxpayer. The unit will work with partners across the public sector to help them identify their KA opportunities and oversee a fund and help people access it. The unit will also promote a network of KA professionals across government which will allow sharing of expertise and experience in business and beyond. ​It will serve central government departments and some partner organisations and will act as a leader and convener across government and a focal point for those that can enable the asset to reach its potential, including private sector investors. It will provide guidance and advice to central government organisations and offer more focused specialist support. ​ ​"
        },
        {
            "text": "We finished the session with some brilliant and engaging questions from our audience."
        },
        {
            "text": "Please do watch the recording of the event here. If you have any questions, please get in touch with the team at kaguidance@beis.gov.uk"
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}