{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2021/08/23/g7-laboratory-manager/",
    "title": "G7 Laboratory Manager",
    "authors": [
        "Selina Khan"
    ],
    "categories": [
        "GSE Opportunities"
    ],
    "pub_date": "2021-08-23T10:52:11+01:00",
    "content": [
        {
            "text": "The Office of Product Safety and Standards is recruiting for a Laboratory Manager into the testing team.  The team holds responsibility for the internal product testing which feeds into overall OPSS regulatory activities and research. On any given day, the team collaborate closely with both internal and external partner to ensure robust, rigorous and outcome focussed scientific based tests are conducted. To continue to increase our testing capabilities, we are spending over £5 million to develop our site at Teddington and that includes growing our new laboratories at the Centre of Product Testing and Research to cover key elements of product safety testing needs. We are looking to recruit a candidate with passion and experience in this field to develop these capabilities to play a core element of the OPSS science and engineering outputs."
        },
        {
            "text": "As part of a dynamic collaborative management team, you will receive professional and informed peer support. You will have responsibility for leading on developing the new testing laboratories, in collaboration with partners across the business. You will represent OPSS externally and feed into British Standard Committees The team delivers across the whole portfolio of OPSS regulatory and testing requirements."
        },
        {
            "text": "Further information can be found on their Careers website https://opss-careers.co.uk/ or by contacting the Organisational Growth team at opss.recruitment@beis.gov.uk."
        },
        {
            "text": "Vacancy reference: 144022, Teddington London; closing date:  11:55 pm on Sunday 12th September 2021"
        },
        {
            "text": " "
        },
        {
            "heading": 4,
            "text": "Do you have an opportunity to share?"
        },
        {
            "text": "If you would like to publicise an opportunity in the next GSE Opportunities blog post, please send a summary of no more than 100 words with contact details or a link and a closing date to: gse@go-science.gov.uk"
        }
    ]
}