{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2021/08/23/g7-strategic-research-programme-lead/",
    "title": "G7 Strategic Research Programme Lead",
    "authors": [
        "Selina Khan"
    ],
    "categories": [
        "GSE Opportunities"
    ],
    "pub_date": "2021-08-23T10:58:47+01:00",
    "content": [
        {
            "text": "The Office of Product Safety and Standards is recruiting for a G7 Strategic Research Lead into the Research, Evidence and Dissemination (RED) team.  The RED team is responsible for the Office’s Strategic Research Programme and Research Hub, developing new and novel research, and ways of delivering research, to drive forward improvements in consumer product safety through changes in policy and delivering regulation, and, has oversight of how the OPSS designates standards for GB."
        },
        {
            "text": "This is an exciting opportunity to apply for a new role in the RED team that will lead on further developing our growing and cross-disciplinary Strategic Research Programme. The post holder will have responsibility for the management of the Strategic Research Programme, designing, procuring, and managing this cross-disciplinary research programme to address evidence gaps; developing a strong understanding of the relevant evidence base and policy drivers, and communicating evidence needs across OPSS, BEIS, other Government Departments, and the scientific community to advise our approach, align evidence work and find opportunities for collaboration. Key to this are the abilities to see the bigger picture and understand and communicate how the scientific capabilities within OPSS support the delivery of the broad range of activities OPSS has responsibility for; to network and work collaboratively across a large number of internal and external teams; to communicate scientific evidence to a non-technical audience; to identify gaps in the evidence base and opportunities for how these can best be filled; and, continue to enhance the quality of our evidence."
        },
        {
            "text": "Further information can be found on our Careers website https://opss-careers.co.uk/ or by contacting the Organisational Growth team at opss.recruitment@beis.gov.uk."
        },
        {
            "text": "Vacancy reference: 143994 London, Teddington or Birmingham; closing date:  11:55 pm on Sunday 12th September 2021"
        },
        {
            "heading": 4,
            "text": "Do you have an opportunity to share?"
        },
        {
            "text": "If you would like to publicise an opportunity in the next GSE Opportunities blog post, please send a summary of no more than 100 words with contact details or a link and a closing date to: gse@go-science.gov.uk"
        }
    ]
}