{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2021/08/23/introducing-the-gse-recognition-offer-recognition-launch-week/",
    "title": "Introducing the GSE Recognition offer – Recognition Launch Week",
    "authors": [
        "Leon Kennedy"
    ],
    "categories": [
        "GSE Profession Updates",
        "Reward & Recognition"
    ],
    "pub_date": "2021-08-23T14:26:20+01:00",
    "content": [
        {
            "text": "The Government Science and Engineering (GSE) Profession is proud to launch the beginning of their new Recognition offer. This offer will provide GSE members with bespoke support to become professionally registered with an institution that best aligns with their professional expertise. As part of this offer, the GSE Profession is providing better access to partner professional institutions and bodies, support with the application process, and advice on getting departmental funding where possible."
        },
        {
            "text": "In the 2021 GSE Survey, 80% of members outlined they wanted more information on being chartered or professionally registered. This Recognition offer will help provide that information and help GSE members gain all the benefits of being professionally registered. Such benefits include career progression, external recognition of your professional skills, and access to external opportunities such as professional networks, events and training workshops."
        },
        {
            "text": "Initially, the GSE Profession will be launching this programme with the professional bodies and institutions that cover most of our members’ specialisms. The initial launch partners include: the Institute of Physics (IoP), the Royal Society of Chemistry (RSC), the Royal Society of Biology (RSB), the Institution of Mechanical Engineers (IMechE), the British Computer Society (BCS), the Institution of Engineering and Technology (IET), the Institution of Civil Engineers (ICE), and the Institution of Chemical Engineers (IChemE)."
        },
        {
            "text": "The Profession plans to expand this offer in the future to include other professional bodies aligned with a wider range of our members. If you have close links to an institution and think we should be partnered with them – email gse@go-science.gov.uk to let us know."
        },
        {
            "text": "To learn more about this exciting new offering, and to fully understand our offer of support, we would like to invite all members to our introduction seminar on Monday, 13th September 12:30 – 13:00, email gse@go-science.gov.uk to register your interest."
        },
        {
            "text": "There will be more events with our launch partners throughout the week. We encourage you to attend the partner institution events that most appeal to you to hear first-hand what they can offer you. Further details have been provided in the Events section below."
        },
        {
            "heading": 2,
            "text": "GSE Profession Recognition Week Events"
        },
        {
            "text": "Sign up to the GSE blog to receive an email when a new blog is published and keep up to date with the work of the GSE profession."
        }
    ]
}