{
    "url": "https://charitycommission.blog.gov.uk/2021/08/23/listening-to-charities-experiences-of-the-coronavirus-pandemic/",
    "title": "Listening to charities’ experiences of the coronavirus pandemic",
    "authors": [
        "Helen Stephenson"
    ],
    "categories": [
        "Governance",
        "Research",
        "Uncategorized"
    ],
    "pub_date": "2021-08-23T14:41:39+01:00",
    "content": [
        {
            "text": "The COVID-19 pandemic has been a shared experience like no other, but it has also affected everyone - countries, organisations, people - in innumerable different ways."
        },
        {
            "text": "We know from our own research that the pandemic has had an uneven impact across the charity sector."
        },
        {
            "text": "At the Charity Commission, we recently set our priorities for the next year. One of those is:"
        },
        {
            "text": "\"We want to help ensure that the sector is resilient and able to play its part as the country recovers from the impact of the pandemic.\""
        },
        {
            "text": "We cannot do this without understanding the impact the pandemic has had on charities."
        },
        {
            "text": "Hearing about charities’ experiences"
        },
        {
            "text": "This summer, together with Commission Board members, I held a series of roundtable discussions with leaders from small and medium size charities."
        },
        {
            "text": "This was a great opportunity to hear how charities have worked through the pandemic."
        },
        {
            "text": "The charities were from 4 different areas of the sector:"
        },
        {
            "text": "I am very grateful to those who took part for giving up their time and sharing their experiences. I hope they found the discussion as useful as I did."
        },
        {
            "text": "The long-term effects of the pandemic"
        },
        {
            "text": "Across the board, charities were clear that the pandemic presents significant long-term challenges."
        },
        {
            "text": "For many parts of life, we've recently seen the lifting of restrictions. But it was clear from the discussions that the effects on charities will last into the future."
        },
        {
            "text": "I heard about:"
        },
        {
            "text": "This wider context is why it’s so important for us to continue our work to make it easy for trustees to use our guidance and services."
        },
        {
            "text": "As charities deal with the long-term effects of the pandemic, we want dealing with the Commission to be as easy as possible, to help trustees make the best use of their time and to run their organisations effectively."
        },
        {
            "text": "Charities have adapted in many different ways"
        },
        {
            "text": "Many of us will be familiar with doing more online over the past 18 months. From virtual meetings to online quizzes, to finding new ways to keep in touch with friends and family."
        },
        {
            "text": "Some of the charities I spoke to were quickly able to move to provide services online and I believe we may have seen an acceleration of digital transformation in the sector – something many have wanted for some time. For others, for example those who work outdoors or rely on live audiences, this was not an option."
        },
        {
            "text": "Our recent research also backed this up."
        },
        {
            "text": "38% of charities said they had moved services online. This was as high as 63% for charities with income over £500,000, whereas for charities with income under £10,000, it was only 24%."
        },
        {
            "text": "I also heard about the changes charities have made in the face of financial challenges."
        },
        {
            "text": "Again, we know the response to financial challenges varied across the sector. According to our research:"
        },
        {
            "text": "These roundtables were a valuable chance to hear just some of the stories behind these numbers."
        },
        {
            "text": "These included things like:"
        },
        {
            "text": "Impact on trustees and staff"
        },
        {
            "text": "As well as the impact on services and beneficiaries, we also heard about the impact on trustees and staff."
        },
        {
            "text": "There was a common view that the pandemic has placed more demands on trustees. These included:"
        },
        {
            "text": "The feedback shows that the flexible and proportionate approach to regulation we took through the pandemic - where possible reducing short-term regulatory burdens - was the right one."
        },
        {
            "text": "I also heard how charity leaders are thinking about the impact on their staff and volunteers."
        },
        {
            "text": "These ranged from concerns about fatigue to how the 'new normal' may not be easy for everyone to adapt to."
        },
        {
            "text": "This echoed many of the things I've thought about in my role leading staff at the Commission."
        },
        {
            "text": "Doing more to understand the impact of COVID-19"
        },
        {
            "text": "Of course, these 4 roundtables are not enough to understand the full impact on the sector."
        },
        {
            "text": "We will continue to carry out research in this area. This will build on what we've already heard and support our wider work of:"
        },
        {
            "text": "We’re also planning to hold more roundtables with different types of charities over the coming months."
        },
        {
            "text": "For, as the country moves further towards recovering from the pandemic, there is no doubt that charities will play a key role in that recovery."
        },
        {
            "text": "Find out more"
        },
        {
            "text": "Read what trustees told us about their experience of the pandemic in our annual research"
        },
        {
            "text": "Read more about our plans for the next year in our business plan"
        }
    ]
}