{
    "url": "https://actuaries.blog.gov.uk/2021/08/23/measures-of-price-inflation-rpi-cpi-and-cpih/",
    "title": "Measures of Price Inflation: RPI, CPI, and CPIH",
    "authors": [
        "Dillan Patel - Analyst"
    ],
    "categories": [
        "Analysis"
    ],
    "pub_date": "2021-08-23T14:11:34+01:00",
    "content": [
        {
            "text": "Inflation is a key indicator of the health of an economy but with no single approach to measuring inflation, there is often debate about which methodology is most appropriate. Additionally, decisions over how to measure inflation do have real world consequences."
        },
        {
            "text": "This blog looks at how inflation was affected during the pandemic and the outcome of a consultation to reform the UK’s longest standing measure of inflation, the Retail Price Index (RPI)."
        },
        {
            "text": "The 3 most common measures used in the UK are, RPI, Consumer Prices Index (CPI) and Consumer Prices Index with Housing (CPIH). A previous GAD explanatory note provides more detail. Essentially, price inflation refers to the increase in the price of goods and services over time and the measures differ by looking at:"
        },
        {
            "heading": 2,
            "text": "Inflation in a pandemic"
        },
        {
            "text": "Figure 1 shows 3 different inflation measures, RPI is consistently higher than both CPI and CPIH but despite expectations that CPIH will be higher than CPI on average, we can see from the past 10 years that this has not consistently been the case."
        },
        {
            "text": "Figure 1 also highlights that the pandemic caused a sharp drop in all 3 measures of inflation from March 2020 to March 2021. This fall is largely driven by impact on housing, restaurants, and hotels, as well as transport industries (shown below in figure 2). As these industries were hit, prices within the sector fell (notably in August for hotels and restaurants as they tempt customers back), causing the sectors to contribute less to the overall CPIH figure."
        },
        {
            "text": "These industries suffered during the lockdown as they were heavily impacted by the lockdown measures, however the recreation and culture industry was resilient across the sector. While the number of holidays and trips out went down, other areas of recreation such as gardening and audiovisual devices saw an increase in prices as consumers shifted their forms of recreation."
        },
        {
            "text": "Following targeted policies and the easing of lockdown measures, the housing, restaurants and hotels, and transport sectors rapidly started to increase in price as consumer demand rose. It’s also important to recognise that other factors will be impacting on the inflation measure, such as the exit from the EU."
        },
        {
            "heading": 2,
            "text": "The RPI consultation conclusion"
        },
        {
            "text": "RPI has been dropped as an official national statistic, due to the shortcomings of the current approach. However, due to largely historic reasons, it is still used across government. In 2019, changes were proposed to RPI and in January 2020, GAD released a Technical Bulletin describing the possible changes and their potential impact. A conclusion was reached in November 2020, where following a consultation, HM Treasury announced that it would reform RPI in line with CPIH approach by February 2030."
        },
        {
            "text": "This news has been met with mixed reactions as there are perceived winners and losers resulting from this decision, as CPIH is expected to be lower than RPI on average. To illustrate this point, the Association of British Insurers estimated the impact of the change could be around £96 billion. It will largely impact savers and companies that invest in government debt linked to inflation (known as index-linked gilts) and those with defined benefit pensions with increases linked to RPI."
        },
        {
            "text": "The Pensions Policy Institute estimates that the impact on pension holders will be felt the greatest for those with final-salary pensions. It also estimated the average reduction in lifetime income from an individual’s RPI-linked pension post-retirement could be 5% for a woman and 4% for a man (based on a 65 year old in 2020). Women will generally experience a greater lifetime reduction in overall pension benefit, as they live longer than men, on average."
        },
        {
            "text": "With this cost to pensioners and investors, comes opposition to the change. Members of different pensions funds from Marks and Spencer, Ford and BT have challenged the alignment to CPIH. They claim that government did not properly consider the effect aligning to CPIH would have on those whose pensions were linked to RPI. This judicial review is still ongoing."
        },
        {
            "text": "As with any change, there is a flip side, for example those with student loans may find the interest on their loans lower than would otherwise be the case."
        },
        {
            "text": "Disclaimer"
        },
        {
            "text": "The opinions in this blog post are not intended to provide specific advice. For our full disclaimer, please see the About this blog page."
        },
        {
            "text": " "
        }
    ]
}