{
    "url": "https://deframedia.blog.gov.uk/2021/08/23/plans-outlined-to-tackle-cruel-puppy-smuggling-trade/",
    "title": "Plans outlined to tackle cruel puppy smuggling trade",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2021-08-23T09:59:50+01:00",
    "content": [
        {
            "text": "On Saturday, there was widespread positive media coverage following our announcement of an eight-week GB-wide consultation on new plans to tackle puppy smuggling and low-welfare pet imports. The story was covered by Sky News, The Express, The Guardian, BBC News, Mirror, Independent, Daily Mail and The Times."
        },
        {
            "text": "David Bowles, head of public affairs at the RSPCA, and media vet Dr Marc Abraham OBE were also interviewed by Sky News about the new measures and how they can help protect puppy and dog welfare. Chris Sherwood, chief executive of the RSPCA, was also interviewed by BBC Radio 5Live."
        },
        {
            "text": "The new plans includes raising the minimum age for importing a puppy from 15 weeks to six months, banning the import of dogs with cropped ears or docked tails and banning the import of heavily pregnant dogs. These measures are aimed at safeguarding the welfare of the thousands of puppies and dogs that come into Great Britain from overseas each year."
        },
        {
            "text": "In addition, the consultation asks the public and stakeholders for views on new penalties for breaching these rules, changes to the detention and rehoming process and whether the proposals should be extended to cover cats and ferrets."
        },
        {
            "text": "Launching the consultation, Animal Welfare Minister Lord Zac Goldsmith said:"
        },
        {
            "text": "“Puppy smuggling is a grim trade, and we are determined to clamp down on it."
        },
        {
            "text": "“Raising the minimum import age for puppies will help protect thousands of animals that are brought into the country each year and stop criminals looking to profit from the rise in demand for pets."
        },
        {
            "text": "“We already have one of the toughest pet travel border checking regimes in the world and as an independent nation outside the EU we are going even further by preventing anyone from bringing in dogs which have undergone inhumane procedures such as ear cropping or tail docking."
        },
        {
            "text": "“These new measures build on our plans to raise animal welfare standards across the board as part of our Action Plan for Animal Welfare.”"
        },
        {
            "text": "Puppies that are imported too young face a significantly higher risk of developing illnesses or even death."
        },
        {
            "text": "Raising the minimum age for bringing puppies in to the UK will therefore ensure that they are not separated from their mothers too early and will allow them to develop further ahead of being taken on potentially long and stressful journeys which can have a lasting impact on their temperament and behaviour."
        },
        {
            "text": "The RSPCA has also recently reported a 620% rise in reports of dogs found to have had their ears cropped, covering from 2015 to 2020. Ear cropping is a painful process where a dog’s outer ears are surgically altered or removed altogether to make them look more aggressive. The surgical procedure, which has been illegal in this country since 2006, can hinder their ability to communicate with other dogs and their owners."
        },
        {
            "text": "Last year the Dogs Trust warned the public about the risk of buying dogs online after rescuing dozens of puppies that were illegally imported into the country. Victims of this cruel trade included a group of six underage puppies seized at Dover port after being found covered in sticky oil and suffering from diarrhoea. The puppies had been illegally imported from Romania and were travelling in the back of a van for more than 24 hours. They had to be shaved to remove the oil from their fur."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}