{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2021/08/23/science-capability-review-and-science-systems-lead/",
    "title": "Science Capability Review and Science Systems Lead",
    "authors": [
        "Selina Khan"
    ],
    "categories": [
        "GSE Opportunities"
    ],
    "pub_date": "2021-08-23T16:38:03+01:00",
    "content": [
        {
            "text": "The Government Office for Science works at the heart of Government, to ensure that policies and decisions are informed by the best scientific evidence and strategic long-term thinking. It is a very exciting time to join the organisation, we have outstanding and high-profile positions where you will have the opportunity to inform and influence policy-making and the systems for use of science and engineering across government. If you are highly motivated and looking for the next challenge in your career, we want to hear from you."
        },
        {
            "text": "This is a new role leading on understanding and improving the science systems in government in support of the implementation of the Science Capability Review. There is significant scope to shape and lead this work, finding opportunities and prioritising to improve science capability across government."
        },
        {
            "text": "Key to this role will be developing an understanding of how government uses science and evidence, exploring the connections' science has with policy, analysis and others within government and its interactions externally with academia and industry. You will use that knowledge to identify how and where government can best use and improve those systems to build capability and ensure provision of prompt and excellent scientific advice within government. An area already identified as needing improvement is government engagement with Academia and Industry and you may be involved in delivery of projects to support this area."
        },
        {
            "text": "Find out more about the job role, requirements and application process here."
        },
        {
            "text": "Vacancy reference: 144173; closing date:  11:55 pm on Sunday 5th September 2021"
        },
        {
            "heading": 4,
            "text": "Do you have an opportunity to share?"
        },
        {
            "text": "If you would like to publicise an opportunity in the next GSE Opportunities blog post, please send a summary of no more than 100 words with contact details or a link and a closing date to: gse@go-science.gov.uk"
        }
    ]
}