{
    "url": "https://deframedia.blog.gov.uk/2021/08/23/telegraph-on-new-national-parks/",
    "title": "Telegraph on new National Parks",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2021-08-23T15:19:03+01:00",
    "content": [
        {
            "text": "There was speculation in the Telegraph this weekend that the Chilterns and Cotswolds are set to become National Parks. Currently no areas are being considered for designation as a National Park."
        },
        {
            "text": "Natural England is undertaking a new assessment of England’s landscapes in the 21st Century, reflecting the spirit of the Hobhouse Map, which led to the establishment of the first National Parks 70 years ago. This England-wide assessment - when it begins - will work with stakeholders and communities to identify nature recovery and enhancement needs across England, including any remaining places suitable for future National Park or AONB designation."
        },
        {
            "text": "The Government is committed to protecting 30% of our land by 2030, boosting biodiversity while taking action to safeguard and extend our protected areas. We are currently working with partner organisations to inform and develop our response to the Landscapes Review.  We expect to consult on draft proposals later this year."
        },
        {
            "text": "A Defra spokesperson said:"
        },
        {
            "text": "“Our landscapes are national treasures, and we are committed to ensuring that they flourish as havens for nature and are places that everyone can visit and enjoy."
        },
        {
            "text": "“The Landscapes Review set out a compelling vision for more beautiful, more biodiverse and more accessible National Parks and Areas of Outstanding Natural Beauty. We welcome this ambition, and we have been actively engaging with stakeholders to inform our response to the Review, which we intend to publish in due course.”"
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}