{
    "url": "https://hmlandregistry.blog.gov.uk/2023/03/14/benefits-of-a-collaborative-approach/",
    "title": "Benefits of a collaborative approach",
    "authors": [
        "Ollie Cummins, Account Manager"
    ],
    "categories": [
        "Law and practice"
    ],
    "pub_date": "2023-03-14T16:08:44+00:00",
    "content": [
        {
            "text": "National law firm Blake Morgan LLP is one of our most prolific customers by volume of applications. Over the past year, I have been working closely with Blake Morgan’s post-completion team to ensure its often highly complex land registration cases are processed as smoothly and easily as possible. As a result, Blake Morgan has one of the lowest avoidable requisition rates in the sector and, as Head of Post-Completion Jade Watson herself says below, this saves the firm a lot of money."
        },
        {
            "text": "We meet regularly and talk about any patterns in applications or issues that are causing concern and while – much as we might like to – we cannot offer the same level of support to all our many thousands of customers at this time, ideas and suggestions often arise that are well worth sharing."
        },
        {
            "text": "Jade Watson, Head of Post-Completion, talks about the benefits of a collaborative approach both with HM Land Registry and, perhaps more importantly, within Blake Morgan."
        },
        {
            "text": "I’m very focused on the quality of Blake Morgan’s applications to HM Land Registry (HMLR) and for me, the starting point is our published requisition rates. As well as going through them in detail with Ollie, I look at them myself on a bi-monthly basis, interpret the data and review what’s happening, before filtering issues through to individuals. If it’s a training point, we’ll work on it. I run workshops as well as other training in-house, and encourage staff to join HMLR’s webinars, which I also attend. They are good and, wherever possible, I give feedback to help make them even better!"
        },
        {
            "heading": 2,
            "text": "Keeping track of changes"
        },
        {
            "text": "Post-completion demands a particular set of skills and knowledge, and we find it really pays to keep up to date with all the changes to practice and processes, which fee earners [solicitors and others who regularly do work for which clients are charged] don’t always know about. For them, my team is a second pair of eyes – and vice versa. We have a really good relationship with staff across our five offices and I’m always available for consultation or advice on what I think HMLR will accept – and what they won’t."
        },
        {
            "text": "We have a close working relationship with our fee earners and they are very tuned in to this. As well as taking on board any feedback we might have, they often ask what they can do to help us, including attending training. In return, they know they can rely on the post-completion team to ensure their applications are the best they possibly can be on lodgement with HMLR."
        },
        {
            "heading": 2,
            "text": "Putting post-completion first"
        },
        {
            "text": "In practice, this means we ‘frontload’ the pre-lodgement checks that need to be carried out, like variations in names, restrictions, charges, how a property will be held (panel 10 of the TR1), execution clauses and witness details. Our fee earners take these into account during the drafting process, then the post-completion team checks everything again and resolves any issues before submitting the application. Sometimes, this means tackling anomalies in documents sent by other law firms and making sure they have the authority to make changes."
        },
        {
            "text": "This saves us all a lot of time. Receiving a requisition means we have to email the fee earner and they’ll have to go back and look at the file. If an application is perfect at the time of submission, however, it means they don’t have to worry about it again. There’s no chasing, no checking if we’ve reached the four-week deadline for response, no fear of cancellation – altogether far less work for all of us."
        },
        {
            "text": "It also saves the firm a lot of money. Most residential conveyancing is carried out to a fixed fee, which doesn’t account for all the extra work involved when an application isn’t right first time."
        },
        {
            "heading": 2,
            "text": "Digital prompts"
        },
        {
            "text": "We do use HMLR’s Digital Registration Service (DRS) wherever we can. We were hesitant at first, but it is a good prompt. The system gives multiple reminders to check names or lodge certain documents, for example. Recently, I submitted a lease application using DRS which sailed through with no complications – all done and dusted in six months. I was very impressed."
        },
        {
            "text": "As far as our account manager is concerned, we like Ollie. He always does his best to give us answers and help us reduce the number of requisitions we receive."
        },
        {
            "text": "We do get frustrated with the length of time our complex applications are taking, but we recognise it’s not the fault of individuals and that every one of us can find room to improve. In fact, in our dealings with HMLR staff, we’ve often found they go above and beyond to be helpful. Ultimately, communication and collaboration are essential."
        },
        {
            "text": "The collaborative approach – working together with us to identify trends and suggest how to improve application quality – on top of Blake Morgan’s drive for continuous improvement has created a positive working relationship that is paying dividends."
        },
        {
            "text": "And it’s a two-way street. Jade is keen to make suggestions as to where we can help make conveyancers’ lives easier, giving us feedback about Estimated Completion Dates, for example, and sharing ideas about how we could help manage clients’ expectations, provide question and answer sessions with senior technicians and create webinars based on common technical issues."
        }
    ]
}