{
    "url": "https://food.blog.gov.uk/2023/03/14/british-science-week-a-day-in-the-life-of-an-fsa-scientist/",
    "title": "British Science Week - a day in the life of an FSA scientist",
    "authors": [
        "Rick Mumford, Deputy Director, Science Evidence and Research, Deputy CSA",
        "Michelle Patel, Deputy Director, Analysis and Insight"
    ],
    "categories": [
        "People",
        "Science"
    ],
    "pub_date": "2023-03-14T09:15:33+00:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "With activity well underway for British Science Week, we wanted to shine a light on our scientists and help others connect to the interesting and varied work they do."
        },
        {
            "text": "The Food Standard Agency (FSA)’s fundamental mission is to ensure that the food we buy and eat is safe and what it says it is. Our scientists lie at the heart of the research and evidence we use to make the decisions that help protect animal and public health."
        },
        {
            "text": "Our scientists are some of the best in the world and we are excited to introduce a few of them to you today."
        },
        {
            "heading": 2,
            "text": "Dr Erica Kintz, Senior Microbiological Risk Assessor"
        },
        {
            "heading": 3,
            "text": "What's your role at the FSA?"
        },
        {
            "text": "I am a Senior Microbiological Risk Assessor in the Risk Assessment Unit of the Science, Evidence and Research Directorate (SERD). Our core purpose is to look at the available evidence during micro food safety incidents and outbreaks so we can advise our Policy and Incidents teams on how severe it might be if consumers eat the contaminated products."
        },
        {
            "heading": 3,
            "text": "How does it fit into our mission of food you can trust?"
        },
        {
            "text": "A key aspect of ensuring “food is safe” is making sure that all the necessary precautions have been taken to reduce (to the lowest possible level) the chance for food contaminated with microbiological organisms to reach the consumer. Not only does our team assist in incidents and outbreaks, but we’re also responsible for producing the strategic risk assessments that guide changes to policy or official advice. We also manage research projects so that the FSA is working with the best evidence. I can see very directly how my role supports the FSA mission of food you can trust."
        },
        {
            "heading": 3,
            "text": "How did you get into science?"
        },
        {
            "text": "The jobs I wanted as a child were all science-related, astronaut, archaeologist, and forensic pathologist. Biology was my favourite subject in high school, but it wasn’t until I got to university and started learning about microbes that I finally settled on a field of study."
        },
        {
            "text": "Before joining the FSA, I worked as a New Product Development Technologist at a food ingredients company. I produced recipes for new homebrew beer kits. I worked alongside a team that tested and developed recipes for companies that used our ingredients, so there was always taste testing of beers, breads, biscuits and other tasty treats during the course of the work week! Before that, I was a researcher in academia, doing work to study how bacteria caused infections and then how those infections spread in the UK population.  "
        },
        {
            "heading": 3,
            "text": "If you could give one piece of advice to people about engaging with science, what would it be? "
        },
        {
            "text": "I have some experience in running science activities for children and have found you get good engagement if you can find something with a little bit of shock value to use. For example, I ran a series in several high schools on how scientists run outbreak investigations and would describe how sometimes poo samples were sent through the post (to allow sick people to collect the sample at home and send them to scientists working in labs to identify the microbes causing the illness). It always got a big reaction from the students! I’d like to think that, in addition to that particular piece of information, they also retained a little bit about the scientific method also discussed."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Dr Sophie Hardy, Regulated Products Engagement and Partnership Coordinator"
        },
        {
            "heading": 3,
            "text": "What's your role at the FSA?"
        },
        {
            "text": "I am the Regulated Products Engagement and Partnership Coordinator – I work in the Strategic Research Team, which is a part of SERD. Regulated Products sounds a bit fancy, all it means is food and feed that require authorisation by the FSA to be sold in the UK. This includes things such as new ingredients and food flavourings."
        },
        {
            "text": "I have been here for just over one year (time has flown by!) and in that time I’ve had two job roles, both with a strong focus on FSA’s scientific work. Prior to joining the FSA, I completed my PhD and worked as a university researcher investigating how our brains produce and understand language."
        },
        {
            "text": "While language in the brain is very different from food science in some ways (no one at the FSA talks about alpha brain waves with me!), a lot of the core science skills I gained previously are still very applicable to the work that I do now. For example, knowing how to critically evaluate scientific methods and findings, and how to communicate science in an understandable way with different audiences. Having these transferable science skills has been really exciting for me as it means I’ve been able to explore my interests in other cool areas of science!"
        },
        {
            "heading": 3,
            "text": "How does it fit into our mission of food you can trust?"
        },
        {
            "text": "My work engaging with food scientists and building the FSA’s research partnerships contributes towards the FSA being better able to assess the safety of Regulated Products. We improve access to helpful scientific expertise and a better understanding of the relevant food science evidence. And this helps the FSA deliver timely and proportionate regulation that meets consumers’ demand for new foods and protects their food safety interests. It's vital for ensuring food you can trust."
        },
        {
            "heading": 3,
            "text": "How did you get into science?"
        },
        {
            "text": "Growing up, I didn’t have a clear plan that I wanted to be a scientist. This was mainly because, at the time, I didn’t realise that science included many things beyond physics equations and chemistry! However, throughout school, I always found learning about the human brain to be super interesting and cool, which led me to study for degrees in Psychology and Neuroscience at university. Later in my career, I decided I wanted to use my science skills to expand into another cool research area – food science at the FSA!"
        },
        {
            "heading": 3,
            "text": "If you could give one piece of advice to people about engaging with science, what would it be?"
        },
        {
            "text": "When people think of scientists, an image of old, white-haired professors in lab coats is sadly still the first thing that comes to many people’s minds. This simply isn’t true though! Scientists come from all backgrounds and from all over the world, there is no one look for a scientist! There is a place in science for everybody, and I would encourage everyone to explore their science interests as engaging in and learning about science can open many exciting doors."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Mike Dickinson - Senior Chemical Risk Assessor"
        },
        {
            "heading": 3,
            "text": "What's your role at the FSA?"
        },
        {
            "text": "I am a Senior Risk Assessor in the Chemical Risk Assessment Unit focusing primarily on feed and feed additive safety. The feed additive safety work means I work closely with the regulated products risk assessment team, I’m part of that team as well! I’m coming up to two years now which has flown by. Before that, I worked for an agency of Defra for approximately 17 years, although was privatised in the last five years of that time. I was an analytical chemist/biochemist relating to food and feed safety. My specialism was mass spectrometry, particularly using this technique in a non-targeted manner. It’s great to be back in the civil service working for the public good, that really motivates me."
        },
        {
            "heading": 3,
            "text": "How does it fit into our mission of food you can trust?"
        },
        {
            "text": "Well in theory a new feed additive cannot enter the food chain without scrutiny from our team to ensure it causes no safety concerns all along the food chain. This is then verified independently by a committee, for feed additives this is the Advisory Committee for Animal Feedingstuffs (ACAF)."
        },
        {
            "heading": 3,
            "text": "How did you get into science?"
        },
        {
            "text": "Well, my childhood dreams at 16 were to be an actor! I was told in no uncertain terms by a careers advisor to drop my ambitions of studying drama and stick to the science because I had good marks in the sciences. Get off the stage and pick up the pipette!"
        },
        {
            "text": "There certainly was a push in the late 90s to get more people to universities studying science. It’s probably worked out for the best in the long run as I’d probably be an out-of-work actor now. And I’ve loved 95% of my time as a scientist, I’ve had the opportunity to present my work in fantastic places around the world I probably wouldn’t have ever visited."
        },
        {
            "text": "But in hindsight, I’d advise young people to follow their dreams first and there is always time to go back to a career. At 16, 18, 21, it always seemed so urgent to get the decision correct, but that’s not the case."
        },
        {
            "heading": 3,
            "text": "If you could give one piece of advice to people about engaging with science, what would it be?"
        },
        {
            "text": "There is no such thing as a silly question. The most inquisitive minds ask ‘silly questions.’ My 6-year-old son certainly has the most challenging, thought-provoking questions and does help ground me somewhat to look at the bigger picture."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "To stay connected to our scientists and the work they do at the FSA, sign up to our Science Newsletter."
        },
        {
            "heading": 1,
            "text": "Rhannu diwrnod ym mywyd gwyddonwyr yr Asiantaeth Safonau Bwyd i nodi Wythnos Wyddoniaeth Prydain."
        },
        {
            "text": "A hithau’n Wythnos Wyddoniaeth Prydain, dyma gyflwyno gwyddonwyr yr Asiantaeth Safonau Bwyd (ASB), a chyfle i ddysgu mwy am y gwaith diddorol ac amrywiol y maent yn ei wneud."
        },
        {
            "text": "Cenhadaeth sylfaenol yr ASB yw sicrhau bod y bwyd rydym yn ei brynu a’i fwyta yn ddiogel ac yn cyd-fynd â’r hyn sydd ar y label. Mae ein gwyddonwyr wrth wraidd yr ymchwil a’r dystiolaeth a ddefnyddiwn i wneud y penderfyniadau sy’n helpu i ddiogelu iechyd y cyhoedd ac iechyd anifeiliaid."
        },
        {
            "text": "Mae ein gwyddonwyr ymhlith y gorau yn y byd ac rydym yn gyffrous i gyflwyno rhai ohonynt heddiw."
        },
        {
            "heading": 2,
            "text": "Dr Erica Kintz, Uwch Asesydd Risg Microbiolegol"
        },
        {
            "heading": 3,
            "text": "Beth yw teitl eich swydd a’ch rôl yn yr ASB?"
        },
        {
            "text": "Rwyf yn Uwch Asesydd Risg Microbiolegol yn Uned Asesu Risg SERD. Ein pwrpas craidd yw edrych ar y dystiolaeth sydd ar gael yn ystod digwyddiadau a brigiadau o achosion yn ymwneud â diogelwch bwyd, fel y gallwn gynghori ein timau Polisi a Digwyddiadau ar ba mor ddifrifol y gallai fod pe bai defnyddwyr yn bwyta’r cynhyrchion wedi’u halogi."
        },
        {
            "heading": 3,
            "text": "Sut mae eich rôl yn cyd-fynd â’n cenhadaeth, sef bwyd y gallwch ymddiried ynddo?"
        },
        {
            "text": "Er mwyn sicrhau “bwyd sy’n ddiogel”, rhaid gwneud yn siŵr bod yr holl ragofalon angenrheidiol ar waith er mwyn lleihau (i’r lefel isaf bosib) y siawns y bydd bwyd sydd wedi’i halogi ag organebau microbiolegol yn cyrraedd y defnyddiwr. Mae ein tîm yn cynorthwyo mewn digwyddiadau a brigiadau o achosion, a hefyd yn gyfrifol am gynhyrchu’r asesiadau risg strategol sy’n llywio newidiadau i bolisi neu gyngor swyddogol. Rydym hefyd yn rheoli prosiectau ymchwil fel bod yr ASB yn gweithio gyda’r dystiolaeth orau. Rwy’n gallu gweld yn uniongyrchol sut mae fy rôl yn cefnogi cenhadaeth yr ASB, sef bwyd y gallwch ymddiried ynddo."
        },
        {
            "heading": 3,
            "text": "Sut daethoch chi i fyd gwyddoniaeth?"
        },
        {
            "text": "Roedd y swyddi roeddwn i eu heisiau fel plentyn i gyd yn gysylltiedig â gwyddoniaeth (gofodwr, archeolegydd, patholegydd fforensig). Bioleg oedd fy hoff bwnc yn yr ysgol uwchradd, ond unwaith i mi gyrraedd y brifysgol a dechrau dysgu am ficrobau fe benderfynais ar faes astudio o’r diwedd."
        },
        {
            "text": "Cyn ymuno â’r ASB, roeddwn yn gweithio fel Technolegydd Datblygu Cynnyrch Newydd mewn cwmni cynhwysion bwyd. Roeddwn yn llunio ryseitiau ar gyfer pecynnau creu cwrw yn y cartref newydd. Roeddwn yn gweithio ochr yn ochr â thîm a oedd yn profi ac yn datblygu ryseitiau ar gyfer cwmnïau a oedd yn defnyddio ein cynhwysion, a chael cyfle’n aml i flasu cwrw, bara, bisgedi a danteithion blasus eraill yn ystod yr wythnos waith! Cyn hynny, roeddwn yn ymchwilydd yn y byd academaidd, yn astudio sut roedd bacteria yn achosi heintiau ac yna sut mae’r heintiau hynny’n lledaenu ym mhoblogaeth y DU."
        },
        {
            "heading": 3,
            "text": "Oes gennych un darn o gyngor i bobl am ymgysylltu â gwyddoniaeth?"
        },
        {
            "text": "Mae gen i rywfaint o brofiad o gynnal gweithgareddau gwyddoniaeth i blant ac rydw i wedi profi ymgysylltiad da os ydych yn gallu defnyddio neu’n dangos rhywbeth sydd ag elfen o sioc. Er enghraifft, pan gynhaliais gyfres mewn ysgolion uwchradd ar sut mae gwyddonwyr yn cynnal ymchwiliadau i frigiadau o achosion, roeddwn yn disgrifio sut byddai samplau o garthion pobl yn cael eu hanfon drwy’r post (gyda phobl sâl yn gwneud y sampl gartref a’i anfon at wyddonwyr sy’n gweithio mewn labordai i nodi’r microbau sy’n achosi’r salwch). Roedd hyn bob amser yn ennyn ymateb mawr gan y myfyrwyr! Hoffwn feddwl, yn ogystal â’r darn penodol hwnnw o wybodaeth, bod y gwaith gwyddonol a drafodais wedi cael effaith arnynt hefyd."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Dr Sophie Hardy, Cydgysylltydd Ymgysylltu a Phartneriaeth Cynhyrchion Rheoleiddiedig"
        },
        {
            "heading": 3,
            "text": "Beth yw teitl eich swydd a’ch rôl yn yr ASB?"
        },
        {
            "text": "Fi yw’r Cydlynydd Ymgysylltu a Phartneriaeth Cynhyrchion Rheoleiddiedig yn y Tîm Ymchwil Strategol, sy’n rhan o’r Gyfarwyddiaeth Gwyddoniaeth, Tystiolaeth ac Ymchwil (SERD). Mae ‘Cynhyrchion Rheoleiddiedig’ yn swnio braidd yn ffansi – y cyfan mae’n ei olygu yw bwyd a bwyd anifeiliaid sydd angen awdurdodiad gan yr ASB i’w gwerthu yn y DU (mae hyn yn cynnwys pethau fel cynhwysion newydd a chyflasynnau bwyd)."
        },
        {
            "text": "Rwyf wedi bod yn gweithio i’r ASB ers ychydig dros flwyddyn (mae’r amser wedi hedfan heibio!) ac yn y cyfnod hwnnw rwyf wedi cael dwy swydd, y ddwy yn canolbwyntio’n sylweddol ar waith gwyddonol yr ASB. Cyn ymuno â’r ASB, fe wnes i gwblhau fy PhD a gweithio fel ymchwilydd prifysgol yn ymchwilio i sut mae ein hymennydd yn cynhyrchu ac yn deall ieithoedd."
        },
        {
            "text": "Er bod iaith yn yr ymennydd yn wahanol iawn i wyddor bwyd mewn rhai ffyrdd (nid oes neb yn yr ASB yn siarad am donnau alffa’r ymennydd gyda mi!), mae llawer o’r sgiliau gwyddoniaeth craidd a enillais yn flaenorol yn dal yn berthnasol iawn i fy ngwaith nawr. Er enghraifft, gwybod sut i werthuso dulliau a chanfyddiadau gwyddonol yn feirniadol, a sut i gyfathrebu gwyddoniaeth mewn ffordd ddealladwy gyda gwahanol gynulleidfaoedd. Mae hi wedi bod yn gyffrous cael y sgiliau gwyddoniaeth trosglwyddadwy hyn gan fy mod wedi gallu archwilio fy niddordebau mewn meysydd diddorol eraill o wyddoniaeth!"
        },
        {
            "heading": 3,
            "text": "Sut mae eich rôl yn cyd-fynd â’n cenhadaeth, sef bwyd y gallwch ymddiried ynddo?"
        },
        {
            "text": "Mae fy ngwaith yn ymgysylltu â gwyddonwyr bwyd a meithrin partneriaethau ymchwil yr ASB yn cyfrannu at allu’r ASB i asesu diogelwch Cynhyrchion Rheoleiddiedig yn well gan ein bod wedi gwella mynediad at arbenigedd gwyddonol defnyddiol ac ennill gwell dealltwriaeth o’r dystiolaeth gwyddor bwyd berthnasol. Mae hyn yn helpu’r ASB i reoleiddio mewn modd amserol a chymesur, sy’n diwallu galw defnyddwyr am fwydydd newydd ac sy’n sicrhau bod bwyd yn ddiogel – sy’n hanfodol ar gyfer sicrhau bwyd y gallwch ymddiried ynddo."
        },
        {
            "heading": 3,
            "text": "Sut daethoch chi i fyd gwyddoniaeth?"
        },
        {
            "text": "Wrth dyfu i fyny, doedd gen i ddim cynllun clir fy mod i eisiau bod yn wyddonydd (yn bennaf oherwydd, ar y pryd, doeddwn i ddim yn sylweddoli bod gwyddoniaeth yn llawer mwy na hafaliadau ffiseg a chemeg yn unig!) Fodd bynnag, yn yr ysgol, roedd dysgu am yr ymennydd dynol yn hynod ddiddorol i mi, ac es i ymlaen i astudio ar gyfer graddau mewn Seicoleg a Niwrowyddoniaeth yn y brifysgol. Yn ddiweddarach yn fy ngyrfa, penderfynais fy mod eisiau defnyddio fy sgiliau gwyddoniaeth mewn maes ymchwil difyr arall – gwyddor bwyd yn yr ASB!"
        },
        {
            "heading": 3,
            "text": "Oes gennych un darn o gyngor i bobl am ymgysylltu â gwyddoniaeth?"
        },
        {
            "text": "Pan fydd pobl yn meddwl am wyddonwyr, yn anffodus, delweddau o athrawon hŷn â gwallt gwyn mewn cotiau labordy yw’r peth cyntaf sy’n dod i’w meddwl – ond nid dyma’r gwirionedd! Mae gwyddonwyr yn dod o bob cefndir ac o bob rhan o’r byd – nid y ddelwedd ystrydebol! Mae lle i bawb yn y byd gwyddoniaeth, a byddwn yn annog pawb i ystyried eu diddordebau gwyddonol oherwydd gall ymgysylltu â gwyddoniaeth a dysgu amdani agor llawer o ddrysau cyffrous."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Mike Dickinson – Uwch Asesydd Risg Cemegol"
        },
        {
            "heading": 3,
            "text": "Beth yw teitl eich swydd a’ch rôl yn yr ASB?"
        },
        {
            "text": "Rwy’n Uwch Asesydd Risg yn yr Uned Asesu Risg Cemegol sy’n canolbwyntio’n bennaf ar ddiogelwch bwyd anifeiliaid ac ychwanegion bwyd anifeiliaid. Mae’r gwaith ar ddiogelwch ychwanegion bwyd anifeiliaid yn golygu fy mod yn gweithio'n agos gyda'r tîm asesu risg cynhyrchion rheoleiddiedig, rwy’n rhan o’r tîm hwnnw hefyd! Rwyf wedi gweithio yma ers bron i 2 flynedd bellach, ac mae’r amser yn hedfan heibio. Cyn hynny roeddwn yn gweithio i Asiantaeth o fewn DEFRA am tua 17 mlynedd (er iddo fynd yn breifat am y 5 mlynedd olaf o’r amser hwnnw) fel cemegydd/biocemegydd dadansoddol yn ymwneud â diogelwch bwyd anifeiliaid ac ychwanegion bwyd anifeiliaid. Roeddwn yn arbenigo mewn sbectrometreg màs, yn benodol defnyddio’r dechneg hon mewn modd heb ei dargedu. Mae’n wych bod yn ôl yn y gwasanaeth sifil yn gweithio er lles y cyhoedd; mae hynny wir yn fy ysgogi."
        },
        {
            "heading": 3,
            "text": "Sut mae eich rôl yn cyd-fynd â’n cenhadaeth, sef bwyd y gallwch ymddiried ynddo?"
        },
        {
            "text": "Wel mewn egwyddor ni all ychwanegyn bwyd anifeiliaid newydd fynd i mewn i’r gadwyn fwyd heb fod ein tîm yn ei graffu i sicrhau nad yw’n achosi unrhyw bryderon diogelwch ar hyd y gadwyn fwyd. Yna caiff hyn ei wirio’n annibynnol gan bwyllgor, sef y Pwyllgor Cynghori ar Fwyd Anifeiliaid (ACAF)."
        },
        {
            "heading": 3,
            "text": "Sut daethoch chi i fyd gwyddoniaeth?"
        },
        {
            "text": "Pan oeddwn i’n blentyn roeddwn i am fod yn actor! Dywedodd cynghorydd gyrfa wrtha’i yn blwmp ac yn blaen i beidio ag astudio drama ond parhau gyda gwyddoniaeth gan fy mod yn cael marciau da yn y pynciau gwyddonol. Bant o’r llwyfan ac mewn i’r labordy!"
        },
        {
            "text": "Yn sicr, ar ddiwedd y 90au, roedd ymdrech i gael mwy o bobl i astudio gwyddoniaeth yn y brifysgol. Rwy’n falch erbyn hyn oherwydd mae’n debyg y byddwn i’n actor allan o waith nawr.\nRwyf wedi mwynhau 95% o fy amser fel gwyddonydd, a chael y cyfle i gyflwyno fy ngwaith mewn llefydd ffantastig o gwmpas y byd fydden i fwy na thebyg byth wedi ymweld â nhw."
        },
        {
            "text": "Ond wrth edrych yn ôl, byddwn yn cynghori pobl ifanc i ddilyn eu breuddwydion yn gyntaf a bydd cyfle wedyn i ystyried gyrfa. Yn fy arddegau hwyr roedd yn teimlo fel bod pwysau mawr arnaf i wneud y penderfyniad cywir, ond nid yw hynny’n wir."
        },
        {
            "heading": 3,
            "text": "Oes gennych un darn o gyngor i bobl am ymgysylltu â gwyddoniaeth?"
        },
        {
            "text": "Nid oes y fath beth â chwestiwn gwirion. Y bobl fwyaf chwilfrydig sy’n holi’r ‘cwestiynau gwirion’. Mae fy mab 6 oed yn llawn cwestiynau heriol sy’n gwneud i mi feddwl, ac mae’n fy helpu i edrych ar y darlun cyfan."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "I gadw mewn cysylltiad â’n gwyddonwyr a’u gwaith yn yr ASB, ewch ati i danysgrifio i’n Cylchlythyr Gwyddoniaeth (govdelivery.com)"
        }
    ]
}