{
    "url": "https://stratcommand.blog.gov.uk/2023/03/14/british-science-week-meet-jonathan-slessor/",
    "title": "British Science Week | Meet Jonathan Slessor",
    "authors": [
        "calumjenkins"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2023-03-14T08:56:55+00:00",
    "content": [
        {
            "text": "To celebrate British Science Week, we sat down with members of the UKStratCom Climate Change and Sustainability Team (CC&S) to learn a little more about their careers, their motivations for working in CC&S, and the importance of understanding our connection to the environment. We also asked them for some of their top tips on how we can be more sustainable in our day-to-day lives."
        },
        {
            "text": "Meet Jonathan Slessor – UKStratCom HQ Climate Change and Sustainability Advisor"
        },
        {
            "text": "Jonathan, thank you for taking the time to speak to us and for helping celebrate British Science Week 2023. To begin with, would you mind sharing some information on your background? In particular, what have you done in the past and what does your scientific background look like?"
        },
        {
            "text": "So, with that background and wealth of experience in a whole host of different areas, I think it’s fair to say that you could have ended up focusing on anything. What made you choose to work in Climate Change and Sustainability? "
        },
        {
            "text": "Was your military background, both in the context of your family and yourself, a driving factor in you pursuing this career path at UKStratCom. Was there anything in particular that attracted you to working in the Command? "
        },
        {
            "text": "Let’s change track slightly now and move into the present day. Could you explain how your background and the experiences you’ve already mentioned, influence how you approach your current work in CC&S? "
        },
        {
            "text": "The theme for British Science Week 2023 is ‘Connections.’ I think, we’re all increasingly aware of how we contribute to climate change. Can you tell us why it is so important that we understand how our actions affect the climate & environment around us?"
        },
        {
            "text": "Finally, and I think you touched on it briefly at the end there, but how can we be more sustainable in our day-to-day lives? Do you have any top tips you can share with us?"
        }
    ]
}