{
    "url": "https://deframedia.blog.gov.uk/2023/03/14/coverage-of-new-microchipping-rules-for-cats/",
    "title": "Coverage of new microchipping rules for cats",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Nature"
    ],
    "pub_date": "2023-03-14T18:00:01+00:00",
    "content": [
        {
            "text": "There has been coverage today in the Daily Express (p2), Mail Online, Independent, LBC Online, Vet Times and Yorkshire Post (p9) on the introduction of compulsory cat microchipping."
        },
        {
            "text": "To mark the launch, Environment Secretary Thérèse Coffey visited Battersea Dogs and Cats home to see the work they do caring for and finding homes for cats."
        },
        {
            "text": "There are over 9 million pet cats in England, with as many as 2.3 million unchipped, meaning that it would be very difficult to reunite them with their owner if they get lost or stolen."
        },
        {
            "text": "The new microchipping rules follow a Government call for evidence and consultation on the issue in which 99% of respondents expressed support for the measure."
        },
        {
            "text": "The introduction of compulsory cat microchipping was a manifesto commitment and an Action Plan for Animal Welfare pledge, and will make it easier for lost or stray pet cats to be reunited with their owners and returned home safely."
        },
        {
            "text": "Environment Secretary Thérèse Coffey said: "
        },
        {
            "text": "“Cats are treasured members of the family, and it can be devasting for owners when they are lost or stolen."
        },
        {
            "text": "“This important step delivers on our manifesto commitment to introduce compulsory microchipping for cats and will help protect millions of cats across the country by increasing the likelihood that lost or stray pets can be reunited with their owners.”"
        },
        {
            "text": "Chief Veterinary Officer Christine Middlemiss said:"
        },
        {
            "text": "“I am pleased that we are progressing with our requirement for all cats to be microchipped."
        },
        {
            "text": "“Microchipping is by far the most effective and quickest way of identifying lost pets. As we’ve seen with dog microchipping, those who are microchipped are more than twice as likely to be reunited with their owner."
        },
        {
            "text": "“By getting their cat microchipped, owners can increase the likelihood that they will be reunited with their beloved pet in the event of it going missing.”"
        },
        {
            "text": "The new rules mean cats must be implanted with a microchip before they reach the age of 20 weeks and their contact details stored and kept up to date in a pet microchipping database. All owners must have their cat microchipped by 10 June 2024 and owners found not to have microchipped their cat will have 21 days to have one implanted, or may face a fine of up to £500. "
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}