{
    "url": "https://marinescience.blog.gov.uk/2023/03/14/how-cefas-science-is-supporting-sustainable-fisheries-management-in-the-high-seas/",
    "title": "How Cefas science is supporting sustainable fisheries management in the High Seas",
    "authors": [
        "Andrew Kenny"
    ],
    "categories": [
        "Fisheries",
        "Monitoring",
        "Science"
    ],
    "pub_date": "2023-03-14T08:45:27+00:00",
    "content": [
        {
            "text": "The High Seas are areas of the ocean beyond any country's territorial control and make up almost two thirds of the world’s oceans. These areas are at a greater risk of exploitation as countries are able to move, fish and carry out scientific research without any sanctions. In an attempt to manage fishing within these areas, countries with fishing interests in a geographical area come together to form Regional Fisheries Management Organizations and Administrations (RFMO/As). Most RFMOs have management powers to set catch and fishing effort limits, technical measures, and control obligations in an attempt to regulate fishing activities in areas of the high seas.  "
        },
        {
            "text": "However, in spite of these management powers there has continued to be harmful over-exploitation of many of these areas. This month, after almost 14 years of discussions, representatives from 193 member states agreed to a High Seas Treaty which aims to protect the High Seas.  The Treaty will build on the work of RMFOs in supporting marine conservation and management and will be key to achieving the UN’s new 10-year strategy for nature conservation that aims to protect and conserve at least 30% of Earth’s coastal and marine areas by 2030 (known as the “30 by 30 target”) "
        },
        {
            "heading": 3,
            "text": "Working together to achieve sustainable ecosystem-based fisheries management in the High Seas "
        },
        {
            "text": "Overfishing is a huge challenge facing many areas of our oceans. Scientists from Cefas have been working with the RFMO for the Northwest Atlantic (NAFO) to create and apply an ecosystem approach since 2009.  The ecosystem approach considers nature as a system and looks at everything as interconnected and interdependent. We don't just focus on a single species or a single problem, but we try to understand how all the different pieces fit together. For example, a change in one part of the ecosystem can have a big impact on everything else. One of the guiding principles of the recent NAFO approach is that the total catches at the ecosystem level should not exceed the rate at which the ecosystem can regenerate. This is known as the Total Catch Index (TCI). By taking the ecosystem approach, NAFO are working to ensure that fish stocks are sustained, that vulnerable marine species and habitats are protected, and ecosystem overfishing is prevented.  "
        },
        {
            "text": "NAFO has also agreed to accept advice from the Scientific Council, of which Cefas is a member, that will prevent overfishing by imposing a recommended limit on the total amount of commercial fish species that can be caught within a mixed fishery. This is the first time that an RFMO in the High Seas has established such an advisory limit. "
        },
        {
            "text": "Unregulated bottom trawling is another challenge facing the high seas. Bottom trawling is known to have a huge impact on ocean biodiversity due to the physical damage it causes to the seafloor and as the method is largely indiscriminate in what it catches. Bottom trawling often has high levels of bycatch. The Cefas team, along with colleagues from other NAFO member countries, have worked together to develop ways to understand and calculate the loss of biodiversity caused by bottom trawling activities (scs20-23 WG-ESA Report Nov 2020 (nafo.int)). This scientific evidence has supported the closure of all seamounts to bottom fishing activities at fishable depths in the Northwest Atlantic and protecting over 90% of the sponge biomass located within the NAFO Regulatory Area subject to fishing activity.  "
        },
        {
            "text": "Above: Andrew Kenny (Chair) and Anna Downie from Cefas attend a NAFO working group tasked with developing an ecosystem approach to fisheries."
        },
        {
            "text": "Above: A vulnerable marine ecosystem and biodiversity hotpot. A sponge ground located at 1,700 m depth off the Flemish Cap, Northwest Atlantic."
        },
        {
            "text": "Above: NAFO VME and Seamount fishery closures and jurisdictional boundaries."
        },
        {
            "heading": 3,
            "text": "The key to achieving global biodiversity protection targets"
        },
        {
            "text": "Going forward, these measures will ensure that NAFO complies with the United Nations Fish Stocks Agreement and specifically the UN General Assembly (UNGA) Resolution, which calls on RFMOs like NAFO to establish measures to protect vulnerable marine ecosystems. "
        },
        {
            "text": " “Following the successful protection of all seamounts at fishable depths in the Northwest Atlantic pressrelease_AM2021.pdf (nafo.int) I’m excited to be leading a group of experts this month to evaluate the biodiversity benefits of the seamount, coral and sponge fish closures. We will also be looking to determine if these and other Area-Based Fishery Management Measures (ABFMs) in NAFO can be adopted as Other Effective Area-based Management Measures (OECMs), and thereby contribute to agreed global biodiversity protection targets 221219-CBD-PressRelease-COP15-Final_0.pdf.” - Andy Kenny, Principal Scientist, Cefas "
        },
        {
            "text": "Background information on the High Seas Treaty and 30by30 "
        },
        {
            "text": "Signed by members of the United Nations, the treaty aims to put 30% of the world's seas into Marine Protected Areas, direct more money into marine conservation efforts and create new rules to manage the exploitation of these areas. This treaty will be essential in achieving the new 10-year strategy for nature conservation that was signed during the U.N. Convention on Biological Diversity in 2022. As part of this strategy, governments have committed to protect and conserve at least 30% of Earth’s coastal and marine areas by 2030 (known as the “30 by 30” target) to maintain healthy oceans, support ecosystem resilience against climate change, and improve food security.    "
        }
    ]
}