{
    "url": "https://ukhsa.blog.gov.uk/2023/03/14/national-institute-for-health-and-care-health-protection-research-units-where-research-meets-real-life/",
    "title": "National Institute for Health and Care Health Protection Research Units: Where research meets real life",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "UKHSA science"
    ],
    "pub_date": "2023-03-14T11:05:37+01:00",
    "content": [
        {
            "text": "Throughout British Science Week we are exploring this year’s theme of ‘connections’ by showcasing some of the vital partnerships that underpin UKHSA’s work. In this blog we look at our partnerships with academia through the National Institute for Health and Care (NIHR) Health Protection Research Units (HPRUs)."
        },
        {
            "text": "NIHR HPRUs are partnerships between UKHSA and Universities, funded to support UKHSA in delivering its health protection functions. The HPRUs create environments for world-class health protection research, in key areas of priority to UKHSA, with multi-disciplinary expert teams.   "
        },
        {
            "text": "There are currently 15 HPRUs covering 13 topic areas, across 9 leading universities and other collaborators, and their collective mission is to undertake research and build the evidence base to address some of the most pressing public health priorities."
        },
        {
            "text": "These partnerships are integral to UKHSA’s goal of protecting the nation’s health through science that has real-world impact."
        },
        {
            "text": "The knowledge and expertise of these scientific collaborations provide crucial evidence and knowledge that can help inform public health policy and practice, from understanding health impacts of climate change to improving how we prevent infections and manage outbreaks. They also have a focus to train future researchers, involve patients and the public in their work and mobilise knowledge for impact."
        },
        {
            "heading": 3,
            "text": "Knowledge into practice"
        },
        {
            "text": "Each HPRU is focused on a particular public health challenge that has been identified as a priority for public health and designated with undertaking research to inform public health decisions, policy and practice."
        },
        {
            "text": "An example of this work is the pioneering research into air pollution being carried out at the Environmental Exposures and Health developmental HPRU, led by Leicester University’s Centre for Environmental Health and Sustainability working in partnership with UKHSA and the Health and Safety Executive."
        },
        {
            "text": "This HPRU, funded by the NIHR in 2020 following a competitive process, is working to understand how the world around us can affect our health and how we can use these insights to create healthier spaces for living and working."
        },
        {
            "text": "Under the leadership of Centre Director Prof. Anna Hansell and UKHSA’s co-Director Dr. Karen Exley, the Leicester HPRU has identified 5 key research areas as part of its plan to tackle harmful effects of environmental exposures. These are:"
        },
        {
            "text": "In the video below: Dr. Pippa Douglas, Co-lead in Public and Community Involvement, Engagement and Participation explains how the teams conduct research into all of these areas."
        },
        {
            "text": " "
        },
        {
            "text": "The HPRU team regularly attends a cross-government programme board and reports its findings back to UKHSA, NIHR and the Department of Health and Social Care, where it is used to help shape public health practice and policy."
        },
        {
            "text": "For example, their research into air pollution has contributed to the fourth edition of the Health Effects of Climate Change report, which is due for publication in Summer 2023. Last published in 2012, the HECC report provides a detailed analysis of threats to our health linked to impacts of climate change. They have additionally fed into a major report on noise and the burden of disease, which is coming soon."
        },
        {
            "text": "The team is also carrying out important work with people with severe asthma and looking at their exposures to chemicals in the home."
        },
        {
            "text": "One PhD student within the HPRU is looking specifically at levels of fungi in the outside air and how they impact on visits to the GP or to emergency departments for asthma. Another researcher is looking at the rise in use of home 3D printers and their impact on indoor air, with a view to developing guidelines for safe use of these devices."
        },
        {
            "heading": 3,
            "text": "A two-way process"
        },
        {
            "text": "While the team has a wealth of expert involvement to draw upon, its work is ultimately dedicated to serving the public and as such, it regularly involves the public and consults other scientific experts via a forum called PIPET (Public Involvement Panel in Environment and Technology)."
        },
        {
            "text": "The HPRU also works closely with local schools on lesson plans and presents its work at science fairs to give practical advice and share findings with a non-expert audience. As well as informing the public on their findings, this type of engagement allows the team to get valuable feedback on the usefulness of what they are doing and what issues the public would like to see addressed."
        },
        {
            "text": "To find out more about our HPRUs and the ground-breaking work they are undertaking, visit https://www.nihr.ac.uk/explore-nihr/support/research-units.htm#two"
        }
    ]
}