{
    "url": "https://naturalengland.blog.gov.uk/2023/03/14/nature-on-dartmoor/",
    "title": "Nature on Dartmoor",
    "authors": [
        "Wes Smyth"
    ],
    "categories": [
        "wildlife and farming"
    ],
    "pub_date": "2023-03-14T16:43:06+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Reflections from Wes Smyth, Natural England’s Area Manager on how we ensure Dartmoor’s unique wildlife is preserved for future generations."
        },
        {
            "text": "Dartmoor is special, a working landscape with wide open moorland framed by steep intimate wooded valleys and a pastoral moorland fringe. It’s a beautiful landscape much loved by millions of people who are drawn to Dartmoor to immerse themselves in nature, in the history that has shaped the landscape and to feel part of something much bigger than any one of us. It is a place with a rich natural history, the result of generations of low-intensity farming including transhumance, combined with naturally occurring habitats and species."
        },
        {
            "text": "Protecting Dartmoor’s wildlife for future generations to enjoy will also make an important contribution to the UK’s delivery of global targets to protect at least 30% of the world’s land and at least 30% of the global ocean by 2030. This will require natural systems to be restored, species populations recovered, and extinctions halted - an ambition recognised in the Dartmoor National Park Partnership Plan. However, it’s become clear over the recent years that the relationship between farming, nature and other impacts like climate change are not in balance and nature is declining in a way that may jeopardise the huge value that Dartmoor brings to local communities and visitors."
        },
        {
            "text": "The UK government has acknowledged that delivering on the ambition of UN Biodiversity Conference (COP 15) will be challenging and will require swift action. The scale of this challenge is evident on the Dartmoor commons where sadly the wildlife that once thrived is no longer as rich or resilient as it once was. On the face of it the wildlife we now experience can seem no different from that enjoyed and experienced by our parents and grandparents. However, memories fade and ecological baselines shift. In the 1980’s large areas of Dartmoor’s open moorland were designated as Sites of Special Scientific Interest (SSSI) and later as a Special Area of Conservation reflecting the national and international importance of Dartmoor’s moorland wildlife."
        },
        {
            "text": "Despite the protection these designations provided, and the huge investment of public money in agri-environment schemes, wildlife has declined.  Breeding populations of golden plover, red grouse and ring ouzels have now gone or are on the verge of being lost. The large expanses of upland heathland that once characterised the moor are now fragmented and what remains is often in poor ecological condition.  Dartmoor’s precious peatlands, its blanket bogs on the highest ground and mires in the valley bottoms are still suffering from historic management affecting their ability to store carbon and regulate river flows."
        },
        {
            "text": "So why has the current approach of protection and incentive through agri-environment schemes not reversed the decline of wildlife on Dartmoor’s moorland?"
        },
        {
            "text": "The current High Level Environment Stewardship (HLS) schemes now in place were set up to deliver a range of environmental outcomes including the delivery of SSSI favourable condition (that is the special interest features for which the SSSI was designated are in a healthy state).  On those agreements where not all the outcomes have so far been met, we are keen to sit down with agreement holders and talk thorough how we can support them in delivering on those outcomes."
        },
        {
            "text": "For some agreements we will need to agree collectively how we can adjust grazing to reduce the impact on heathland vegetation and help control purple moor-grass expansion, explore how shepherding can be used to even out grazing pressure and address the continuing effect of historic peatland drainage.  We will need to work with graziers to agree how we can achieve the right animals in the right place at the right time of year.  This will take time and a partnership approach given the multiple demands that farm businesses on Dartmoor face."
        },
        {
            "text": "There are of course other factors at play such as air pollution, other land use demands and climate change that have all impacted on Dartmoor’s wildlife and the condition of SSSIs.  The impact of large-scale burning management will also have played a part.  However, we have seen the capacity for nature to recover where farmers support environmental improvements.  For example, the number of breeding Dunlin pairs on Dartmoor has shown a positive response following peatland restoration."
        },
        {
            "text": "Many of the current HLS agreements on Dartmoor’s commons are due to expire and as part of the transition to the new Environment Land Management scheme existing agreement holders can seek a voluntary 5-year extension to their agreement.  Agreement holders and ourselves can us this 5-year extension opportunity plan for any changes and agree a way forward helping provide continuity for farmers during the immediate agricultural transition period and help relieve some of the other pressures farmers are facing."
        },
        {
            "text": "In 2020, the Dartmoor National Park set out an ambition to “deliver Nature enhancement at a landscape scale, underpinned by the restoration of dynamic natural processes. Habitats are protected, restored, maintained, cared for, expanded and connected; supported by land management systems and natural capital investment that have the delivery of public goods at their heart.” At Natural England we fully support this commitment and are putting in place changes to support farmers through this transition, through their agri-environment agreements."
        },
        {
            "text": "The only way to achieve this vision, to a more sustainable future for all stakeholders on Dartmoor is to work in close partnership. We are planning to meet commoners, landowners and the Dartmoor National Park in early April 2023 to try and agree a shared way forward where farmers and landowners feel they have a real stake in the success of their agri-environment agreements. Success would be viable farm business delivering transformational nature recovery on the Dartmoor commons."
        }
    ]
}