{
    "url": "https://educationhub.blog.gov.uk/2023/03/14/teacher-strikes-open-letter-parents-from-education-secretary-gillian-keegan/",
    "title": "Teacher strikes: An open letter to parents from Education Secretary Gillian Keegan",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Teacher pay",
        "Teacher recruitment",
        "Trade Unions"
    ],
    "pub_date": "2023-03-14T09:26:20+00:00",
    "content": [
        {
            "text": "Education Secretary Gillian Keegan has written an open letter to parents setting out the latest on teacher strikes."
        },
        {
            "text": "Dear parents and carers,"
        },
        {
            "text": "I’m writing to update you ahead of the strike action planned by the National Education Union on Wednesday and Thursday this week."
        },
        {
            "text": "This industrial action will mean more disruption to children’s education and to your lives too – whether that’s work, arranging childcare, or changing other plans."
        },
        {
            "text": "I am extremely disappointed that many young people will once again miss invaluable time learning with their teachers and friends, particularly after their education was significantly disrupted during the pandemic."
        },
        {
            "text": "It is made worse by the fact that this strike action is completely unnecessary. As I said to the NEU three weeks ago, I want to get around the table and engage in serious talks on teachers’ pay and other issues to resolve disputes."
        },
        {
            "text": "My only condition was that strike action is paused so those discussions can take place in good faith and without disruption."
        },
        {
            "text": "This was the same offer, and the same condition, made to unions representing nurses, ambulance workers and physiotherapists. Those unions accepted that offer, paused their strikes and are now negotiating on behalf of their members in private."
        },
        {
            "text": "The NEU instead seems focused on strikes and all the needless disruption that brings."
        },
        {
            "text": "This morning I have written to the unions again to invite them to have those talks on Wednesday and Thursday this week – all they need to do is call off strikes which are unnecessary and benefit no one."
        },
        {
            "text": "The single best thing the NEU could do for both its members and for children and young people would be to sit down and talk about pay."
        },
        {
            "text": "I will continue doing everything I can to end the disruption your family is facing as quickly as possible, particularly because I know exams for older pupils are coming up fast."
        },
        {
            "text": "I hope any arrangements you make this week mean that pupils’ education can continue – even if not in the classroom – and that the next time I write it will be with news that this disruption has been brought to an end."
        },
        {
            "text": "Yours sincerely,"
        },
        {
            "text": "The Rt Hon Gillian Keegan MP\nSecretary of State for Education"
        }
    ]
}