{
    "url": "https://ruralpayments.blog.gov.uk/2023/03/14/window-opens-for-countryside-and-environmental-stewardship-revenue-claims/",
    "title": "Window opens for Countryside and Environmental Stewardship revenue claims",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Countryside Stewardship",
        "Environmental Stewardship"
    ],
    "pub_date": "2023-03-14T11:48:00+00:00",
    "content": [
        {
            "text": "You can now submit 2023 revenue claims for CS and ES agreements. "
        },
        {
            "text": "Starting from this year, we’ve made the way you submit your CS revenue claim online more straightforward. An annual declaration will be available in the Rural Payments service to CS agreement holders who submit an annual revenue claim. In certain cases you’ll be able to generate and submit an automated revenue claim with a single click and without needing to complete each section of the claim form, which makes submitting a claim simpler and faster.  "
        },
        {
            "text": "You’ll still be able to view your agreement and make changes to your claim before you submit it, and you will still be able to download and print your completed claim form.  "
        },
        {
            "text": "If you can’t submit an online annual declaration, you can still claim through the usual routes and for those with ES agreements, a claim form will be emailed or posted to you, which you should complete and submit in the usual way. Guidance is available here: How to get paid under an agreement: Environmental Stewardship - GOV.UK (www.gov.uk).  "
        },
        {
            "text": "Guidance on submitting your CS claim is available here: How to make a capital or revenue claim for Countryside Stewardship - GOV.UK (www.gov.uk). "
        },
        {
            "text": "If this is your first year of your CS agreement, or if you have recently accepted a HLS extension, you will still need to submit a claim in order to receive payment for any works carried out in 2023. Unlike BPS where an application is processed and a payment is made, for CS and ES after you have made an application and received an agreement or extension, a claim is then needed for a payment to be processed. It’s important those with a CS or ES agreement remember to submit a claim every year, so we can make their payment. "
        },
        {
            "text": "Key Dates for 2023 CS and ES revenue claims: "
        },
        {
            "text": "14 March – CS and ES revenue claims open "
        },
        {
            "text": "15 May - deadline for submitting a CS or ES revenue claim without reduction "
        },
        {
            "text": "31 August - deadline for submitting a CS or ES revenue claim (with reduction) or for making changes to a CS revenue claim that was submitted before midnight on 15 May (without reduction) "
        },
        {
            "text": "This year for any CS or ES claims submitted after the 15 May 2023 deadline but before 31 August we’ll be applying reductions in the following way; "
        },
        {
            "text": "This gives agreement holders longer to be able to submit a claim after the deadline and receive part of their payment, though we’d still encourage submission as early as possible and before the 15 May deadline so you don’t lose out. "
        },
        {
            "text": "Basic Payment Scheme "
        },
        {
            "text": "The window for submitting your 2023 BPS applications also opened today. Read more on our blog here."
        },
        {
            "text": "New funding opportunities for farmers  "
        },
        {
            "text": "Defra are introducing new funding opportunities through schemes and one-off grants, as part of the Agricultural Transition Plan. This includes the Sustainable Farming Incentive (SFI) which provides quarterly payments to help farmers manage land in a way that improves food production and is more environmentally sustainable.  "
        },
        {
            "text": "Six new SFI standards are being introduced for 2023 and SFI is compatible with other schemes such as CS so long as we are not paying for the same action twice. More information on how SFI interacts with other schemes is available on gov.uk. You can also read about eligibility, payment rates, standards and the application process here: Sustainable Farming Incentive: full guidance - GOV.UK (www.gov.uk).   "
        },
        {
            "text": "Grants "
        },
        {
            "text": "In February, Minister Spencer announced over £168 million in grants will be available to farmers this year, in a speech he gave at the National Farmers’ Union Conference. Applications for the Productivity and Slurry theme of the Farming Equipment and Technology Fund (FETF) are open now until 4 April, with Animal Health and Welfare grants due to be available soon, for livestock keepers in England.   "
        },
        {
            "text": "For details of all our current funding opportunities see: Funding for farmers and land managers - GOV.UK (www.gov.uk).  "
        },
        {
            "text": "To stay up to date with the latest information and updates from RPA, sign up to our blog and follow us on social media on the following accounts:"
        },
        {
            "text": "By following and subscribing to our social channels and blog, you’ll be able to see the latest updates about important information. We also share top tips and announcements. You can also listen to The RPA Podcast which we have launched to help farmers, landowners and rural communities keep up to date with the latest news from RPA."
        },
        {
            "text": " "
        }
    ]
}