{
    "url": "https://ruralpayments.blog.gov.uk/2023/03/14/window-opens-for-basic-payment-scheme-applications/",
    "title": "Window opens for Basic Payment Scheme applications",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Basic Payment Scheme"
    ],
    "pub_date": "2023-03-14T11:46:44+00:00",
    "content": [
        {
            "text": "You can now submit your 2023 BPS applications to the Rural Payments Agency (RPA).  "
        },
        {
            "text": "Everything you’ll need to apply for BPS this year is now available on GOV.UK including the Basic Payment Scheme rules for 2023: Basic Payment Scheme 2023 - GOV.UK (www.gov.uk) and guidance on how to apply: Basic Payment Scheme - GOV.UK (www.gov.uk). "
        },
        {
            "text": "BPS Key Dates 2023 "
        },
        {
            "text": "14 March – BPS applications open. All guidance available on GOV.UK.\n15 May – last day to submit a BPS 2023 application (including Young and New Farmers applications) without penalty and to transfer BPS entitlements. \n9 June – last day to make certain changes without penalty to a BPS application already submitted before midnight on 15 May, and deadline for BPS late applications (with penalty.) "
        },
        {
            "text": "You can read more about the key dates for 2023 for all RPA schemes on GOV.UK. "
        },
        {
            "text": "To apply for BPS in 2023, you’ll need to meet the BPS scheme rules, have eligible land at your disposal, and hold BPS entitlements on 15 May 2023. "
        },
        {
            "text": "Making your BPS application this year is especially important as from 2024 we plan to replace BPS in England with delinked payments. You must claim, and be eligible for, BPS payments in the 2023 scheme year to receive delinked payments for 2024 to 2027. You must also meet the other rules for delinked payments. "
        },
        {
            "text": "Delinked payments will be based on your average BPS payments (including any young farmer payment or greening payment) for the BPS 2020 to 2022 scheme years (before most reductions and penalties). Our scheme guidance will include information about how business changes since BPS 2020 could affect your delinked payment. "
        },
        {
            "text": "When payments are delinked, you won’t need any land or entitlements to receive the payments and you can receive delinked payments even if you stop farming. You can keep up to date with the latest information here: Delinked payments: replacing the Basic Payment Scheme - GOV.UK (www.gov.uk). You won’t be eligible for delinked payments if you receive a Lump Sum Exit Scheme payment. "
        },
        {
            "text": "As we delink direct payments, we will be moving away from cross compliance. The vast majority of our strong legal standards for the environment and animal health and welfare will continue, and we will be enforcing these in a proportionate and fair way. This means working with farmers to get it right and giving them a chance to self-correct before taking stronger action. For example, we’re increasing our use of warning letters, where appropriate, rather than immediately defaulting to payment penalties. "
        },
        {
            "text": "Since 2021, BPS payments have been reducing each year as we phase them out by the end of 2027. This online calculator will show you how progressive reductions are being applied, and as this is the last year of these reductions we want to make sure farmers have factored this into their planning. "
        },
        {
            "text": "In 2022, recognising the impact of these reductions, we changed the way we issued BPS payments to assist farmers with cashflow. For the first time we made BPS advance payments in the summer, and balance payments from December. This is now a permanent change to the BPS payment cycle so we will once again be making advance payments of around 50% from the start of August 2023. "
        },
        {
            "text": "Lump Sum Exit Scheme  "
        },
        {
            "text": "If you applied for the Lump Sum Exit Scheme but haven’t yet completed your exit from farming, you may want to apply for BPS 2023. You would need to meet the usual BPS rules. This will protect you if you then find that you are not eligible for the lump sum or can’t complete the transfer of your land by 31 May 2024. If you receive payment(s) for BPS 2023 and later meet the rules of the Lump Sum Exit Scheme, the value of any BPS payment(s) made will be deducted from the lump sum due. You can read about the scheme on GOV.UK "
        },
        {
            "text": "Farming Resilience Fund: Free farm business advice "
        },
        {
            "text": "We recognise that many farm businesses may need to adapt to take advantage of the changes taking place during the Agricultural Transition. BPS farmers can get free advice from trusted organisations through the Farming Resilience Fund who can help you understand how the changes to farming, including the loss of BPS, will affect your business and help you plan for the future. The advice is confidential and won’t be shared with Defra or RPA. "
        },
        {
            "text": "Countryside Stewardship (CS) and Environmental Stewardship (ES) claims "
        },
        {
            "text": "The window for submitting your 2023 revenue claims for CS and ES agreements also opened today. Read more on our blog here."
        },
        {
            "text": "New funding opportunities for farmers  "
        },
        {
            "text": "Defra are introducing new funding opportunities through schemes and one-off grants, as part of the Agricultural Transition Plan. This includes the Sustainable Farming Incentive (SFI) which provides quarterly payments to help farmers manage land in a way that improves food production and is more environmentally sustainable.  "
        },
        {
            "text": "The SFI has been made as straightforward as possible to apply for online, with farmers giving positive feedback over the simplicity and speed of the application process. The 2023 offer has been made more flexible and accessible to enable farmers to get started in the scheme and start to deliver the outcomes for their business and the environment. These improvements are based on learnings from extensive pilots and feedback to make it simpler, clearer and more workable for farmers. "
        },
        {
            "text": "You can read about the SFI on GOV.UK here: Sustainable Farming Incentive: full guidance - GOV.UK (www.gov.uk) including information on eligibility, payment rates, standards and the application process.   "
        },
        {
            "text": "Grants "
        },
        {
            "text": "In February, Minister Spencer announced over £168 million in grants will be available to farmers this year, in a speech he gave at the National Farmers’ Union Conference. Applications for the Productivity and Slurry theme of the Farming Equipment and Technology Fund (FETF) are open now until 4 April, with Animal Health and Welfare grants due to be available soon, for livestock keepers in England.   "
        },
        {
            "text": "For details of all our current funding opportunities see: Funding for farmers and land managers - GOV.UK (www.gov.uk).  "
        },
        {
            "text": "To stay up to date with the latest information and updates from RPA, sign up to our blog and follow us on social media on the following accounts:"
        },
        {
            "text": "By following and subscribing to our social channels and blog, you’ll be able to see the latest updates about important information. We also share top tips and announcements. You can also listen to The RPA Podcast which we have launched to help farmers, landowners and rural communities keep up to date with the latest news from RPA."
        }
    ]
}