{
    "url": "https://hodigital.blog.gov.uk/2020/02/03/apprentices-making-an-impact-at-home-office-digital-data-and-technology/",
    "title": "Apprentices - making an impact at Home Office Digital Data and Technology",
    "authors": [
        "jogibson"
    ],
    "categories": [
        "apprenticeship",
        "Recruitment"
    ],
    "pub_date": "2020-02-03T16:09:49+00:00",
    "content": [
        {
            "text": "With skills in Digital, Data and Technology in high demand, the Home Office has a vision to establish a sustained, high quality flow of entry-level resources across all DDaT job families."
        },
        {
            "heading": 2,
            "text": "Building our Civil Service workforce"
        },
        {
            "text": "We know we need to build a civil servant workforce that includes experienced professionals and a supply of home-grown talent to ensure cost effectiveness, sustainability and ownership of our delivery capability across the profession."
        },
        {
            "text": "Apprentices are key to delivering our vision and we are in the midst of scaling up our apprenticeship intake, taking an ‘apprenticeships first’ approach to building our talent pipeline. We have been trialling several apprenticeships, thanks to an active digital trailblazer community which has embraced the opportunities that employer-developed standards offer and a collaborative Government profession which sees departments working together to participate and take advantage."
        },
        {
            "heading": 2,
            "text": "Making an impact"
        },
        {
            "text": "Home Office DDaT were key players in the first government cohort of a software developer accelerated apprenticeship which started in Autumn 2018, providing opportunities for eight individuals from across the department. Some of these committed individuals are now completing their Level 4 qualification now, just over a year on and far swifter than the usual two for this apprenticeship. You can read about the first to pass, Will Wayman. This programme makes a significant impact in increasing our civil servant capability, while reducing our use of contractors as we develop some of the most challenging and transformative technology projects the department has ever seen. So much so that we took on another nine apprentices last November, extending the opportunity to employees in other departments too."
        },
        {
            "heading": 2,
            "text": "Focussing on aptitude and attitude - not qualifications"
        },
        {
            "text": "We are also attracting fresh ideas, insight and diversity from outside Government, having just completed a recruitment campaign for business and data analysts, network engineers and cyber security apprentices. To increase inclusivity and support the Home Office’s social mobility aims, we focussed on aptitude and attitude, rather than requiring qualifications. This aims to bring our total new apprentice starts across DDaT this financial year up to 50. With our 2018-19 new intake less than 20, this really will make some impact. Hear from some of 2018’s business analyst apprentices -  Bridging the gaps - kick starting my career by Jen Byrne and an SCS apprentice line manager  by reading this blog by Matt Philpott, SCS, DDaT – you’ll get an idea just how much of an impact we’re expecting.\n#Making Impact #Making Waves"
        }
    ]
}