{
    "url": "https://ssac.blog.gov.uk/2025/04/07/child-maintenance-deductions-from-universal-credit/",
    "title": "Child maintenance deductions from Universal Credit",
    "authors": [
        "Bruce Calderwood"
    ],
    "categories": [
        "Children",
        "Claimants",
        "DWP",
        "Legislation",
        "Universal Credit"
    ],
    "pub_date": "2025-04-07T19:30:12+01:00",
    "content": [
        {
            "text": "I’ve been a member of the Social Security Advisory Committee (SSAC) for around ten years, having previously been a policy director in the Department for Work and Pensions (DWP). Last week I was pleased to see that DWP had agreed nearly all of the recommendations in our most recent report on regulations which changed the way child maintenance and other deductions are made from benefits.[1] We had written formally to the Secretary of State about them and she had accepted four out of five of our recommendations in whole or in part."
        },
        {
            "text": "The regulations came about because a change announced by the Chancellor of the Exchequer in last year’s Spring Budget would inadvertently stop some child maintenance deductions. She had announced that on 7 April 2025 the Fair Repayment Rate will reduce the maximum deductions that can be taken from a claimant’s Universal Credit (UC) personal allowance from 25 to 15 percent. This would ensure that people on the lowest incomes can keep more of their UC. However, as it stood it would also mean that, when claimants’ total deductions were over 15 percent, any child maintenance deductions would stop and the households where their children lived would be poorer as a result."
        },
        {
            "text": "DWP developed a package of temporary regulations to stop this from happening and presented these proposals to an extraordinary meeting of SSAC for scrutiny on 14 February 2025."
        },
        {
            "text": "At that meeting, we accepted that DWP needed to legislate quickly to prevent children losing out. However, the particular solution DWP had adopted meant that more households than before would have child deductions made, and some would see substantial increases in total deductions. Whilst this would benefit the households where their children (from a previous relationship) lived, the evidence we saw told us very little about the composition of, or impact on, households whose monthly income would drop as a result, including the impact on any children in their current household. We concluded that this was partly because of the absence of available data, and partly because DWP had not carried out sufficient analysis of potential effects, in particular the various ways the changes might affect disabled people.[2] We were also concerned about potential risks arising from child maintenance discussions displacing other deductions like those for fuel, and we thought that the date the regulations would come into force was not well enough aligned with the Fair Repayment Rate change."
        },
        {
            "text": "For these reasons we decided to take the regulations on ‘formal reference’.[3] This means that when the new regulations are laid, the Secretary of State has also to present our report to Parliament along with a statement setting out the extent to which she proposes to give effect to the recommendations and, if she doesn’t intend to accept them, the reasons why not."
        },
        {
            "text": "This is so that Parliament is better informed about the issues in any consideration of the regulations. Normally when we do this we consult widely to ensure that our analysis is as well informed as possible. However, a solution had to be put in place in time for the introduction of the Fair Repayment Rate. This meant it was not possible to consult others if we were to provide timely advice on the proposals. We therefore decided to rely on our own analysis of the issues, based on the information presented to us by DWP officials, the knowledge and experience of our members and our own 2020 report on the way social security affects separated families."
        },
        {
            "text": "In the Government’s response to our report, the Minister of State for Social Security and Disability agreed to:"
        },
        {
            "text": "Ministers did not agree to our recommendation that claimants should be allowed to make representations about affordability before deductions begin."
        },
        {
            "text": "I have a number of reflections on this experience."
        },
        {
            "text": "[1] The Universal Credit, Personal Independence Payment, Jobseeker’s Allowance and Employment and Support Allowance (Claims and Payments) (Modification) Regulations 2025 (SI 2025/****)"
        },
        {
            "text": "[2] DWP were aware that the impacts were uncertain and as a result had decided to time limit them to a year so that they could be assessed."
        },
        {
            "text": "[3] The Social Security Administration Act 1992"
        }
    ]
}