{
    "url": "https://insidehmcts.blog.gov.uk/2025/04/07/improving-efficiency-and-service-quality-in-our-magistrates-courts/",
    "title": "Improving efficiency and service quality in our magistrates’ courts",
    "authors": [
        "Will Breame, Delivery Director, National Services: Crime and Ops Support"
    ],
    "categories": [
        "Training and support",
        "Tribunals",
        "User experience and research",
        "Working at HMCTS"
    ],
    "pub_date": "2025-04-07T12:01:09+01:00",
    "content": [
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "text": "Everyday, our Courts and Tribunals Service Centres (CTSCs) play a vital role in delivering justice smoother and more efficiently. Call handlers and agents are there to support and guide users who may have questions or need information about their court or tribunal case, delivering improved access to justice. As part of our commitment to modernising court services through a truly centralised system, we’re moving all phone enquiries for magistrates' courts in England and Wales to our CTSCs. This follows successful introduction of this approach in the North West and South West last year.    "
        },
        {
            "text": "By having everyone involved in delivering a service centrally located, and using a single system, an issue can be identified, addressed and resolved far more quickly and efficiently, without the need to send information and instructions across multiple locations. The benefits to people using magistrates’ courts include: "
        },
        {
            "heading": 2,
            "text": "Our service in numbers "
        },
        {
            "text": "Service centres are responsible for answering most calls to magistrates’ courts. Between April and December 2024, our service centres handled over three quarters of a million crime-related calls and emails. Many of these related to magistrates' cases and would previously have been dealt with by the local court. "
        },
        {
            "text": "Data from our pilot regions shows that calls are answered in under 6 minutes on average, with less than 2% of calls to service centres needing to be referred back to courts, giving us confidence that this is an effective approach. "
        },
        {
            "text": "A court administrator from the North West region provided feedback:  "
        },
        {
            "text": "\"We've felt the benefit of not allocating two staff to cover the phones throughout the day. Call migration has allowed us to dedicate more time to other areas of work, such as reducing backlogs and helping users with their cases, or to focus on one-to-one training.” "
        },
        {
            "text": "Similarly, feedback from the South West notes:  "
        },
        {
            "text": "\"The impact of call migration in the local administration team has had a profound effect on the team's ability to regroup, focus and recalibrate on processes, re-investing in their learning, without the constant disruption of phone calls.” "
        },
        {
            "heading": 2,
            "text": "Building on success "
        },
        {
            "text": "Feedback received from the North West and South West regions has played an important role in the success of this transition so far and we continue to welcome feedback via our feedback form. Manchester Magistrates’ Court has been able to accommodate a number of service centre staff on site, which has helped increase service centre knowledge of courts processes.  "
        },
        {
            "text": "The current low number of handoffs (where we need to pass an enquiry back to the local magistrates’ court) is a result of service centres continuing to build this capability following feedback from the pilot regions, which is something that will continue throughout the rollout. We’re also recruiting more call handlers, and giving ourselves time to train them as each region moves their calls out of magistrates courts."
        },
        {
            "heading": 2,
            "text": "Rollout timeline  "
        },
        {
            "text": "This change will continue to rollout across the five remaining regions between April and June 2025, and will affect professional stakeholders, such as CPS, police and members of the public who need to attend the court. "
        },
        {
            "text": "Service centres will be the first point of contact for calls instead of regional magistrates’ courts. The service centre teams can resolve most queries, but there are some matters that will still need to be handled by local courts. Our staff will advise you and connect you with the right team.   "
        },
        {
            "text": "Of course, you’ll still see our staff in magistrates' courts to ensure hearings run smoothly for people working in and using them. This includes in-court support roles, staff who handle immediate issues and teams who support thousands of magistrates and over 250 district judges nationwide. "
        },
        {
            "heading": 2,
            "text": "Contact details "
        },
        {
            "text": "All callers can contact the CTSC in the following ways: "
        },
        {
            "text": "Current contact details for emailing local courts remain unchanged. "
        },
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "heading": 2,
            "text": "Gwella effeithlonrwydd ac ansawdd gwasanaeth yn ein llysoedd ynadon "
        },
        {
            "text": "Bob dydd, mae ein Canolfannau Gwasanaethau’r Llysoedd a’r Tribiwnlysoedd (CTSCs) yn chwarae rhan hanfodol yn darparu cyfiawnder yn fwy didrafferth ac yn fwy effeithlon. Mae’r rhai sy’n delio â galwadau ac asiantau yno i gefnogi ac arwain defnyddwyr a allai fod â chwestiynau neu sydd angen gwybodaeth am eu hachos llys neu dribiwnlys, gan sicrhau gwell mynediad at gyfiawnder. Fel rhan o’n hymrwymiad i foderneiddio gwasanaethau llys drwy ddarparu system wirioneddol ganolog, rydym yn symud pob ymholiad dros y ffôn ar gyfer llysoedd ynadon Cymru a Lloegr i’n CTSCs. Mae hyn yn dilyn cyflwyno’r dull hwn yn llwyddiannus yng Ngogledd-orllewin a De-orllewin Lloegr y llynedd.  "
        },
        {
            "text": "Drwy gael pawb sy’n ymwneud â darparu gwasanaeth wedi’u lleoli’n ganolog, ac yn defnyddio un system, gellir nodi mater, mynd i’r afael ag ef a’i ddatrys yn llawer cyflymach ac yn fwy effeithlon, heb fod angen anfon gwybodaeth a chyfarwyddiadau ar draws nifer o leoliadau. Mae’r manteision i bobl sy’n defnyddio’r llysoedd ynadon yn cynnwys: "
        },
        {
            "heading": 2,
            "text": "Ein gwasanaeth mewn niferoedd "
        },
        {
            "text": "Mae ein canolfannau gwasanaethau yn gyfrifol am ateb y rhan fwyaf o alwadau yn ymwneud â’r llysoedd ynadon. Rhwng Ebrill a Rhagfyr 2024, deliodd ein canolfannau gwasanaethau â dros dri chwarter miliwn o alwadau ac e-byst yn ymwneud â throsedd. Roedd llawer o’r rhain yn ymwneud ag achosion ynadon a byddent wedi cael eu trin gan y llys lleol yn flaenorol. "
        },
        {
            "text": "Mae data o’n rhanbarthau peilot yn dangos bod galwadau’n cael eu hateb mewn llai na 6 munud ar gyfartaledd, gyda llai na 2% o alwadau i ganolfannau gwasanaethau angen eu cyfeirio’n ôl i’r llysoedd, gan roi hyder inni fod hwn yn ddull effeithiol. "
        },
        {
            "text": "Cafwyd adborth gan weinyddwr llys o ranbarth Gogledd-orllewin Lloegr:  "
        },
        {
            "text": "“Rydyn ni wedi teimlo’r fantais o beidio â neilltuo dau aelod o staff i ddelio â galwadau ffôn trwy’r dydd. Mae symud galwadau wedi ein galluogi i neilltuo mwy o amser i feysydd gwaith eraill, fel lleihau ôl-groniadau a helpu defnyddwyr gyda’u hachosion, neu ganolbwyntio ar hyfforddiant un-i-un.” "
        },
        {
            "text": "Yn yr un modd, mae adborth o Dde-orllewin Lloegr yn nodi:  "
        },
        {
            "text": "“Mae effaith symud galwadau ar y tîm gweinyddol lleol wedi cael effaith ddofn ar allu’r tîm i ail-grwpio, canolbwyntio ac ail-raddnodi mewn perthynas â phrosesau, gan ail-fuddsoddi yn eu dysgu, heb darfu cyson galwadau ffôn.” "
        },
        {
            "heading": 2,
            "text": "Adeiladu ar lwyddiant "
        },
        {
            "text": "Mae’r adborth a gafwyd gan ranbarthau Gogledd-orllewin a De-orllewin Lloegr wedi chwarae rhan bwysig yn llwyddiant y cyfnod pontio hwn hyd yn hyn a bydd yn parhau i wneud hyn. Mae Llys Ynadon Manceinion wedi gallu neilltuo lle i nifer o staff y ganolfan gwasanaethau ar y safle, sydd wedi helpu i gynyddu gwybodaeth y ganolfan gwasanaethau am brosesau’r llysoedd.  "
        },
        {
            "text": "Mae’r nifer isel presennol o drosglwyddiadau (lle mae angen i ni drosglwyddo ymholiad yn ôl i’r llys ynadon lleol) o ganlyniad i ganolfannau gwasanaethau yn parhau i adeiladu’r capasiti hwn yn dilyn adborth gan y rhanbarthau peilot, sy’n rhywbeth a fydd yn parhau drwy gydol y cyfnod cyflwyno. Rydym hefyd yn recriwtio mwy o bobl sy’n delio â galwadau, ac yn rhoi amser i’n hunain i’w hyfforddi wrth i bob rhanbarth symud eu galwadau allan o lysoedd ynadon. "
        },
        {
            "heading": 2,
            "text": "Llinell amser cyflwyno  "
        },
        {
            "text": "Bydd y newid hwn yn parhau i gael ei gyflwyno ar draws y pum rhanbarth sy’n weddill rhwng mis Ebrill a mis Mehefin 2025, a bydd yn effeithio ar randdeiliaid proffesiynol, megis y CPS, yr heddlu ac aelodau’r cyhoedd y mae angen iddynt fynychu’r llys. "
        },
        {
            "text": "Canolfannau gwasanaethau fydd y pwynt cyswllt cyntaf ar gyfer galwadau yn lle’r llysoedd ynadon rhanbarthol. Gall dimau’r canolfannau gwasanaethau ddatrys y rhan fwyaf o ymholiadau, ond mae rhai materion y bydd angen i lysoedd lleol ymdrin â hwy o hyd. Bydd ein staff yn eich cynghori ac yn eich cysylltu â’r tîm cywir.   "
        },
        {
            "text": "Wrth gwrs, byddwch yn dal i weld ein staff mewn llysoedd ynadon i sicrhau bod gwrandawiadau’n rhedeg yn ddidrafferth i bobl sy’n gweithio ynddynt ac yn eu defnyddio. Mae hyn yn cynnwys rolau cymorth yn y llys, staff sy’n ymdrin â materion uniongyrchol a thimau sy’n cefnogi miloedd o ynadon a thros 250 o farnwyr rhanbarth ledled y wlad. "
        },
        {
            "heading": 2,
            "text": "Manylion cyswllt "
        },
        {
            "text": "Gall pob galwr gysylltu â’r CTSC yn y ffyrdd canlynol: "
        },
        {
            "text": "Nid yw’r manylion cyswllt cyfredol ar gyfer anfon e-byst at lysoedd lleol wedi newid. "
        }
    ]
}