{
    "url": "https://nationalscreening.blog.gov.uk/2025/04/07/new-nihr-evidence-synthesis-groups-give-major-boost-to-the-uk-nsc/",
    "title": "New NIHR evidence synthesis groups give major boost to the UK NSC",
    "authors": [
        "Mike Harris"
    ],
    "categories": [
        "General"
    ],
    "pub_date": "2025-04-07T12:34:05+01:00",
    "content": [
        {
            "text": "The National Institute for Health Research (NIHR) is investing millions of pounds to provide the UK National Screening Committee (UK NSC) with dedicated research expertise."
        },
        {
            "text": "The NIHR is funding 3 university partnerships to establish specialist Screening Evidence Synthesis Groups (ESGs). They start work this month (April 2025). Building on the success of the NIHR’s existing ESGs, these groups will provide specialist academic input to help the UK NSC make robust evidence-based recommendations to ministers."
        },
        {
            "text": "The UK NSC, an independent scientific advisory committee, is responsible for weighing up the potential benefits and harms of screening and advising ministers and the NHS in the 4 UK countries. It only recommends screening if good quality evidence indicates it does more good than harm and represents value for money."
        },
        {
            "text": "The 3 new ESGs, based in the Universities of Bristol, Sheffield and Warwick/Birmingham, will carry out research projects to inform UK NSC recommendations about which health screening programmes should be introduced, continued, modified or withdrawn."
        },
        {
            "text": "They will evaluate existing research evidence to help determine if the benefits of screening, such as timely detection, better treatment outcomes and reduced mortality, would outweigh harms that can include overdiagnosis and overtreatment."
        },
        {
            "heading": 2,
            "text": "Working in partnership"
        },
        {
            "text": "The investment in the ESGs underlines the commitment of the NIHR and the Department of Health and Social Care to the role of research and evidence synthesis in informing healthcare policy and practice."
        },
        {
            "text": "Professor Lesley Stewart, Director of the NIHR Evidence Synthesis Programme (ESP), said:"
        },
        {
            "text": "The ESGs will work on a range of research projects. These will include concise evidence maps, which help determine if there is enough published evidence to justify more detailed work, and full modelling exercises that evaluate the overall effectiveness and cost effectiveness of screening programmes in all their complexity. The new groups are also well placed to contribute to the continuous improvement of the committee's approach to the evaluation of the evidence."
        },
        {
            "text": "Prof Anne Mackie, Director of Programmes for the UK NSC, said: "
        },
        {
            "heading": 2,
            "text": "Keep up to date "
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK NSC. You can register to receive updates direct to your inbox, so there is no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, please email uknsc@dhsc.gov.uk. "
        }
    ]
}