{
    "url": "https://dataingovernment.blog.gov.uk/2025/04/07/unlocking-data-sharing-across-government/",
    "title": "Unlocking data sharing across government",
    "authors": [
        "Murat Soncul, Head of Data Protection and Privacy, GDS"
    ],
    "categories": [
        "Open data"
    ],
    "pub_date": "2025-04-07T12:00:41+01:00",
    "content": [
        {
            "text": "The Data Sharing Network of Experts (DSNE) started in September 2022. It was set up to:"
        },
        {
            "text": "DSNE is a cross-government virtual team who help solve problems with sharing data between departments and agencies. DSNE contributes to the government’s vision for better joined up public services and productivity, outlined in the blueprint for modern digital government.  "
        },
        {
            "text": "DSNE provides impartial advice to resolve complex data sharing issues, including legal, policy and security concerns. Its work helps influence systemic changes to improve data sharing, contributing to programmes such as the Data Marketplace service and the AI Playbook for the UK Government. Additionally, it provides a platform to gather data professionals perspectives when shaping such initiatives. "
        },
        {
            "text": "By resolving these challenges, DSNE supports a privacy-positive culture and fosters more efficient government data sharing, ultimately benefitting public services."
        },
        {
            "heading": 3,
            "text": "How the Data Sharing Network of Experts works"
        },
        {
            "text": "When government departments face challenges in data sharing, DSNE steps in to offer support. The process begins when data sharing cases are referred to DSNE, particularly those that are blocked. Each case is triaged, and the team assesses the core issues preventing progress."
        },
        {
            "text": "After assessing the case, DSNE provides impartial, cross-government facilitation, working with internal stakeholders to help departments reach decisions. Importantly, DSNE does not make final decisions; rather, it offers advisory services and facilitates the discussion to help departments resolve conflicts themselves."
        },
        {
            "text": "If the issue persists despite DSNE's involvement, the matter can be escalated. Escalation routes move through the senior leadership of the involved departments, and, if needed, extend to the Chief Data Officers (CDO) Council, permanent secretaries and even ministers."
        },
        {
            "heading": 3,
            "text": "DSNE tackles a range of issues "
        },
        {
            "text": "One major challenge has been overcoming technical, legal and cultural barriers to data sharing, which have been made worse by inconsistent approaches. DSNE can handle a variety of challenges around data sharing, such as:"
        },
        {
            "text": "DNSE handled 30 cases between 2022 and 2024. These cases spanned a wide range of government bodies, including the Cabinet Office, HM Revenue and Customs, and Department for Transport."
        },
        {
            "text": "From these cases the most roadblocks to data sharing in government included:"
        },
        {
            "heading": 3,
            "text": "The wider impact of DSNE"
        },
        {
            "text": "DSNE significantly impacts government operations by improving data sharing and promoting collaboration. The benefits of this include:"
        },
        {
            "text": "The DSNE team meets every six weeks and as data becomes ever more important in government, DSNE's work will remain essential for solving the complexities of data sharing while keeping privacy and data protection as top priorities."
        },
        {
            "heading": 3,
            "text": "Get in touch to find out more"
        },
        {
            "text": "If you have a data sharing case you'd like assistance with, or if you're interested in learning more about DSNE, you can contact us at:"
        },
        {
            "text": "Murat SonculHead of Data Protection, Government Digital Service (GDS)murat.soncul@digital.cabinet-office.gov.uk "
        },
        {
            "text": "Kiran MistrySenior Data Protection Advisor, Government Digital Service (GDS)kiran.mistry@digital.cabinet-office.gov.uk"
        }
    ]
}