{
    "url": "https://naturalengland.blog.gov.uk/2025/04/07/using-our-evidence-to-plan-our-approach-to-the-management-of-dartmoors-sssis/",
    "title": "Using our evidence to plan our approach to the management of Dartmoor's SSSIs",
    "authors": [
        "Dave Slater"
    ],
    "categories": [
        "Biodiversity",
        "Evidence",
        "Farming",
        "Nature",
        "Peat",
        "Protected sites and species",
        "Science and evidence",
        "Site of Special Scientific Interest",
        "wildlife and farming"
    ],
    "pub_date": "2025-04-07T14:07:51+01:00",
    "content": [
        {
            "text": "Today we have published a Review of the evidence for the management of Dartmoor’s Sites of Special Scientific Interest (SSSIs). As an evidence-led organisation, we use this to inform our advice to farmers and stakeholders on Dartmoor. Our job is to take the best available evidence and apply it within the local context. This is needed to provide the best possible outcome for nature and for the people who work, live and visit Dartmoor.  "
        },
        {
            "text": "This blog sets out Natural England’s ambition and how we are using evidence to inform our approach to Dartmoor. This includes recommendations on short-term extensions to existing Higher Level Stewardship (HLS) agreements and our advice to the newly formed Dartmoor Land Use Management Group (DLUMG).  "
        },
        {
            "text": "In summary, Natural England’s advice will be based on the following principles: "
        },
        {
            "text": "Our recent full surveys show there is much more work to be done to improve the condition of Dartmoor’s SSSIs. All SSSIs across Dartmoor remain in unfavourable condition. For many areas grazing patterns are a factor. This includes both under grazing and over grazing. Any successful long-term plan to recover habitats will mean that grazing regimes will have to adapt. The type, numbers, timing and location of grazing animals are key. But we also know that this is very difficult to achieve in practice, given the huge extent of the unenclosed moorland commons. "
        },
        {
            "text": "Our review of the evidence concludes that causes of unfavourable condition on Dartmoor are multifaceted. Contributing factors include over and under-grazing of livestock (e.g. early summer hardy cattle), excessive burning, peat cutting and drainage. The role of external factors such as nitrogen deposition and climate change are not well evidenced on Dartmoor but should not be ignored in management decisions.  "
        },
        {
            "text": "The approach to recovering Dartmoor’s SSSIs needs to take account of all these factors – focussing on one issue such as over-grazing will not work. In fact, applying strict limits to grazing across Dartmoor may jeopardise the very farming systems needed. These farming systems are part of the recovery of the mosaic habitats that make Dartmoor a special place for nature. How to control vegetation management across large, complex and unfenced areas is still poorly understood.  "
        },
        {
            "text": "Trial solutions within Dartmoor’s unique characteristics are needed. We are therefore working closely with the DLUMG and other strategic initiatives to achieve the best ecological outcomes for protected sites. Trialling innovative approaches supported by robust experimental design and academic rigour will add to our future evidence base and advice. "
        },
        {
            "text": "Much of the evidence in this review is from smaller and more controllable areas than Dartmoor. Achieving a level of control on Dartmoor’s unfenced moorland for sustained improvement in condition is difficult. Even if this level of control could be achieved, we would need to account for the other factors. This all leads to our conclusions that a more holistic approach is needed. This approach must ensure we can sustain a long-term sustainable management regime – meaning it must be compatible with viable farm businesses. This of course, is in line with the aims of the Dartmoor Land Use Management Group. The success of this group is vital for nature recovery on Dartmoor.  "
        },
        {
            "text": "Many wider initiatives also give us huge optimism for the future health of Dartmoor’s natural environment. The Southwest Peatland Partnership has pioneered the restoration of extensive areas of peatland habitats. There are also three Landscape Recovery pilots that present an exciting opportunity to deliver the desired long-term and creative management. As well as this, the Protected Landscapes Targets and Outcomes Framework point to a step change in Government’s aspirations for our most cherished landscapes.  "
        },
        {
            "text": "Natural England and Dartmoor’s stakeholders have a common goal of a wildlife-rich landscape in tune with a thriving rural community. With this in mind, we must work very closely with the DLUMG members to co-design an approach and a plan that enhances and sustains the special qualities of Dartmoor’s protected sites.   "
        },
        {
            "text": "Over the coming year, we will be offering two-year extensions to HLS agreements and supporting farmers to maximise the environmental benefits of their scheme. This will prioritise the protection and enhancement of irreplaceable peatland to prevent deterioration to heathland through targeted management and more regular monitoring. This will also bridge the gap to a time when there is more clarity on Environmental Land Management Schemes (ELMS) to support farmers when making the right choice for their businesses and for nature. "
        },
        {
            "text": "This interim approach sets the direction for future management and allows time for the DLUMG to co-develop a strategy for achieving our longer-term ambitions. We hope this will pave the way towards a more sustainable and strategic management system for the future of Dartmoor."
        },
        {
            "text": "The publication of the review follows the publication last week of three Natural England evidence reports to inform action to support the recovery of peatland landscapes: Growing the evidence base to recover England’s treasured peatland landscapes – Natural England  "
        }
    ]
}