{
    "url": "https://ukhsa.blog.gov.uk/2025/04/07/what-is-antimicrobial-resistance-amr-and-how-can-you-combat-it/",
    "title": "What is Antimicrobial Resistance (AMR) and how can you help combat it?",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Health Protection"
    ],
    "pub_date": "2025-04-07T01:01:00+01:00",
    "content": [
        {
            "text": "Imagine a world where common infections became life-threatening, because our medicines no longer worked. It might sound like the plot for a dystopian film, but this scenario is real and it's happening now. Antimicrobial resistance, known as AMR, is stopping antibiotics from being as effective as they used to be. There were an estimated 66,730 serious antibiotic-resistant infections in 2023, a rise compared to 62,314 that we saw in 2019, before the pandemic."
        },
        {
            "text": "This blog post explains why we all need to be more aware of AMR and what it means, and introduces the new campaign to Keep Antibiotics Working, fronted by our mascot Andi Biotic. "
        },
        {
            "heading": 2,
            "text": "What exactly is AMR?"
        },
        {
            "text": "AMR occurs when bacteria and other microorganisms evolve to survive the medicines we use to fight them. Just as we adapt to challenges, bacteria can adapt to survive antibiotics. When this happens, these vital medicines stop working when we need them most. Find out more about AMR on the NHS website."
        },
        {
            "heading": 2,
            "text": "The global impact"
        },
        {
            "text": "The numbers tell a stark story:"
        },
        {
            "text": "While AMR affects everyone, Black British and Asian British communities face a higher risk of developing infections that don't respond well to antibiotics, which makes it crucial that we focus our activities to address this issue."
        },
        {
            "heading": 2,
            "text": "Our campaign"
        },
        {
            "text": "We have created a new campaign, fronted by our mascot Andi Biotic, who is on a mission to make people aware of the correct ways to use antibiotics. These are simple things everyone can do, to help make sure antibiotics work for you and for future generations."
        },
        {
            "heading": 2,
            "text": "How you can help"
        },
        {
            "text": "Here are 3 simple but powerful actions: "
        },
        {
            "heading": 2,
            "text": "UKHSA’s role in tackling AMR"
        },
        {
            "text": "The UK Health Security Agency (UKHSA) plays a pivotal role in the UK's 20-year strategy to tackle AMR, recently publishing a new National Action Plan (2024-2029)."
        },
        {
            "text": "Our aim is to contain and control AMR by 2040. Here are 3 ways we are working towards that goal:"
        },
        {
            "heading": 2,
            "text": "Want to do more?"
        },
        {
            "text": "We hope this information encourages you to join us in fighting back against AMR. There are ways to get involved:"
        },
        {
            "text": "Together, we can help keep these vital medicines working for generations to come."
        }
    ]
}