{
    "url": "https://apprenticeships.blog.gov.uk/2023/02/10/an-interview-with-kristofer-mcghee-general-counsel-at-the-institute-for-apprenticeships-and-technical-education/",
    "title": "An interview with Kristofer McGhee, General Counsel at the Institute for Apprenticeships and Technical Education",
    "authors": [
        "Institute for Apprenticeships"
    ],
    "categories": [
        "Apprentices",
        "Apprenticeship standards",
        "National Apprenticeship Week"
    ],
    "pub_date": "2023-02-10T08:26:05+00:00",
    "content": [
        {
            "text": "An interview with Kristofer McGhee, General Counsel at the Institute for Apprenticeships and Technical Education"
        },
        {
            "text": " Kristofer, General Counsel at IfATE, is a solicitor and senior civil servant leading IfATE’s legal and governance functions and supporting the organisation to deliver its objectives in a legally-sound way. In 2021, he was named one of The Lawyer’s Hot 100 lawyers to watch out for and, in that same year, was named GC of the Year at the British Legal Awards."
        },
        {
            "text": "Joanna Hughes, Director of Joanna Hughes Solicitor Apprenticeships and co-lead for the City of London Law Society collaboration initiative around solicitor apprenticeships, met with Kristofer to ask him some questions."
        },
        {
            "text": " "
        },
        {
            "text": "Joanna Hughes: Monday 6 to Sunday 12 February is National Apprenticeship Week. What is the best way for employers to feed into IfATE their thoughts and concerns. Since we are both solicitors, could you focus especially on employers in the legal sector?"
        },
        {
            "text": "Kristofer McGhee: At IfATE, one of the things we are most proud of is our engagement with employers because we know employers’ views are central to the technical products we approve. That means we are always looking for a chance to speak to employers about anything in relation to apprenticeships and technical qualifications. In fact, we’ve just concluded our Big Conversation where we engaged with over 2,000 stakeholders about the future of the skills system. We’re looking forward to digesting, then publishing, what we have heard."
        },
        {
            "text": "In terms of the legal sector, law firms and other employers of legal apprentices might consider joining a trailblazer group or contribute to the development of apprenticeships. I’d always say that the best way for employers to show commitment is to start recruiting apprentices in the legal sector – whether that’s the level 7 apprentice solicitor, the level 3 apprentice paralegal or something else to suit business needs."
        },
        {
            "text": " "
        },
        {
            "text": "Joanna Hughes: Can you update us please on the latest position on the Solicitor Apprenticeship Standards because a lot is happening in the legal sector at the moment around solicitor apprenticeships, to increase the number of opportunities for example in the City of London."
        },
        {
            "text": "Kristofer McGhee:  All our legal apprenticeships are currently in revision – which means we are considering if and how they need updating and improving – so employers, and others with an interest, should see the outputs of such in the coming months."
        },
        {
            "text": "We also have our Legal, Finance and Accounting route review in train which will include recommendations for the sector and case studies."
        },
        {
            "text": " "
        },
        {
            "text": "Joanna Hughes: The latest news item on the IfATE website talks about the best practice toolkit produced by the Department for Education and IfATE called ‘Raising the Standards’. I see that Amy Marren, solicitor apprentice and former Paralympic athlete and leading IfATE Apprentice Panel member with whom the CLLS is also working, is involved, which is great. Can you tell us more about that toolkit please?"
        },
        {
            "text": "Kristofer McGhee: The new, comprehensive toolkit put together by colleagues at IfATE, the DfE and members of our very own apprentice panel, will act as a great guidance to apprentices, employers and training providers. It explains apprenticeships, clearly describing how the apprenticeship should look from start to finish. There is also a spotlight on EDI and the benefits to everyone of having a diverse workplace that is welcoming and accepting, put together by our very own EDI network here at IfATE. I would highly recommend anyone interested in apprenticeships to read through and get a greater understanding of the process."
        },
        {
            "text": " "
        },
        {
            "text": "Joanna Hughes: do you have an apprentice yourself?"
        },
        {
            "text": "Kristofer McGhee: It won’t surprise you to know we have a wide variety of apprentices at IfATE."
        },
        {
            "text": "I’m also absolutely thrilled that I was able to recruit the first ever apprentice solicitor in Government last year. A great initiative for IfATE to have launched.  It was a really competitive recruitment exercise and we had a real social mobility dynamic to it in terms of recruitment strategy, minimum grade profile and the interview and assessment day."
        },
        {
            "text": "Thomas has now completed the first (of six!) year of his apprenticeship at IfATE. He’s been lucky to have a wide variety of work from public law, advice on IfATE’s legislative functions, data protection and helping with changes to the procurement regulations."
        },
        {
            "text": "I asked him to give some words on his first year and he said:"
        },
        {
            "text": "\"The first year of my apprenticeship here at IfATE has flown by! It has given me a brilliant and valuable opportunity to work alongside fantastic colleagues both within the legal team, but also within the wider IfATE. The varied work, alongside the opportunity to regularly cross paths with senior leaders, has put me in a good position to progress well within my apprenticeship but also within my professional career going forward. It has been an opportunity I would urge all young people to strongly consider when deciding their future options.\""
        },
        {
            "text": " "
        },
        {
            "text": "Joanna Hughes: The theme for Friday in NAW 2023 is ‘Celebration Friday’, when employers are encouraged to share the successes of their apprentices, whether that be in awards such as the Government-run National Apprenticeship Awards or the Multicultural Apprenticeship Awards, or day-to-day successes. Do you think awards showcasing apprentices are important?"
        },
        {
            "text": "Kristofer McGhee: I went to the National Apprenticeship Awards a few years ago and it was an essential reminder of the important work we all do in this landscape. Hearing the successes of apprentices across the country is really humbling and I suspect keeps us all enthusiastic about our work."
        },
        {
            "text": "I think we need to keep on celebrating success and new opportunities in the apprenticeship world. We should also celebrate novel interventions such as the medical doctor apprentice or (perhaps more excitingly) the barrister apprenticeship (which is currently in development). These novel approaches really are going to do a lot for social mobility."
        },
        {
            "text": "Each nod we can give to the good work of apprentices is crucial. Equally, though, it’s really important to recognise the huge number of people supporting apprentices – whether that’s employers, mentors, advocates or colleagues!"
        },
        {
            "text": " "
        }
    ]
}