{
    "url": "https://insidedio.blog.gov.uk/2023/02/10/an-inside-view-on-apprenticeships-at-dio/",
    "title": "An inside view on apprenticeships at DIO",
    "authors": [
        "DIO Communications Team"
    ],
    "categories": [
        "Apprentices",
        "Working at DIO"
    ],
    "pub_date": "2023-02-10T15:53:29+00:00",
    "content": [
        {
            "text": "DIO apprentices, as well as others from contractors and other Government departments, attended a Government Property Profession apprenticeship event at the Defence College of Logistics, Policing and Administration. The visit included a tour of the DIO-managed redevelopment of the site, led by the former DIO apprentice who worked on the project during his apprenticeship. [Crown Copyright/MOD 2023]Did you know DIO has 101 apprentices working and learning in 13 fields, from project delivery to finance and property to human resources? We’re committed to continuing to offer high quality apprenticeships for new and existing staff, and will be recruiting 100 more apprentices in the next financial year."
        },
        {
            "text": "Some of our current apprentices told us their experiences:"
        },
        {
            "heading": 2,
            "text": "Vee, Project Management apprenticeship"
        },
        {
            "text": "I had a career break from teaching and decided to apply for roles in Project Delivery. My first role in Project Management Office Support gave me a flavour of the variety of areas involved. I knew there was a great deal to learn, and I thought that a more structured approach to this learning would both suit and benefit me. The balance of 20% time learning and reflecting and 80% applying and extending what you are learning is working very well for me."
        },
        {
            "text": "In hindsight, I can say that my early self-training on the job was effective but somehow disjointed; I was learning in snapshots and often without a measure of comparison. The apprenticeship enabled me to understand the bigger picture, the options available and why certain project management choices were better than others. It allowed me to be more reflective and confident and also know when I needed to move on to a more specialised role. I now work in Risk Management."
        },
        {
            "text": "For me, having already spent a lengthy stint in full time education, the choice of embarking on a new degree was not the right one. Because of being new in the role and Project Delivery in general, self-study and passing qualification exams were not my preferred options either, as they would mean simply preparing for passing an exam, rather than expanding my understanding of the new field. The apprenticeship just suited my circumstances, stage in life and preferred ways of learning."
        },
        {
            "heading": 2,
            "text": "Phillip, Senior Leader apprenticeship"
        },
        {
            "text": "I’d always wanted to do some post graduate study and previously cost was the thing that stopped me. I didn’t realise I could do this as part of an apprenticeship so when I saw the Level 7 option I jumped at the chance. I opted for Leadership as I didn’t want to specialise so much I excluded myself from certain roles in the future and Leadership is applicable across a wide variety of positions."
        },
        {
            "text": "The process for enrolling wasn’t difficult; I had to provide the reasons why I wanted to do it and commit to the required level of study. The hardest part was evidencing my existing qualifications. I left school many years ago and had no idea where my exam certificates were."
        },
        {
            "text": "At last year's DIO Apprenticeship Awards, apprentices were given a tour of one of the Royal Navy's aircraft carriers, HMS Prince of Wales. [Crown Copyright / MOD 2022]I get 20% of my in-work time for attending lectures, reading and writing assignments. I’ve had to be flexible to accommodate work meetings but on the whole this is manageable. Some modules have more reading than others so you have to be prepared to put the time in to get the most out of them. I also became a dad partway through my third module so finding the time to do the extra reading became more challenging but I’m finding my way through."
        },
        {
            "text": "The apprenticeship has given me wider exposure to business areas that I otherwise would not have come across, such as strategy and digital services. The variety of subject matter in the modules has certainly raised my awareness of the range of activity the department does."
        },
        {
            "text": "The main advice I’d give others considering an apprenticeship is go for it. You do need to put the work in but it’s worth it."
        },
        {
            "heading": 2,
            "text": "Charlotte, Project Management apprenticeship"
        },
        {
            "text": " I was previously a secondary school teacher and realised this was no longer the career I wanted. I came across a job advert for the Project Management apprenticeship within DIO and found I had transferable skills for this career. An apprenticeship was the perfect choice for me as it enabled me to train on the job with support from my team within DIO and also from my training provider."
        },
        {
            "text": "Sometimes I do find myself getting distracted by work emails during my learning time so I make sure I block time out on my calendar so I can manage the 20% allowance appropriately around everyday work. My team are very supportive and understanding of the time set aside for studying."
        },
        {
            "text": "As someone who had very little experience in Project Management before starting, I already find myself feeling a lot more confident in my role. I feel the apprenticeship is setting me up well to be able to continue progressing in my career of project management within DIO. "
        }
    ]
}