{
    "url": "https://apprenticeships.blog.gov.uk/2023/02/10/apprenticeships-in-the-pensions-industry/",
    "title": "Apprenticeships in the pensions industry.",
    "authors": [
        "Institute for Apprenticeships"
    ],
    "categories": [
        "Apprentices",
        "Apprenticeship standards",
        "National Apprenticeship Week"
    ],
    "pub_date": "2023-02-10T15:18:24+00:00",
    "content": [
        {
            "text": "To celebrate National Apprenticeship Week 2023, we want to introduce you to some of the amazing individuals taking an apprenticeship in the pensions industry."
        },
        {
            "text": "Since IfATE launched five years ago, there are now over 650 apprenticeships available to train people of all ages and fill skills gaps right across the economy from entry level 2 up to degree level, which is a much better reflection of the nation’s true skills needs. As well as all the traditional trades, they now train economists, nurses, aerospace engineers, countryside rangers, brewers, laboratory scientists, graphic designers and even archaeologists."
        },
        {
            "text": "Over 80 pensions administrator apprentices started their journey in the last 12 months joining a growing pathway to a successful career."
        },
        {
            "text": " "
        },
        {
            "text": "Shiv, Level 3 Pensions administrator apprentice at Barnett Waddingham"
        },
        {
            "text": " "
        },
        {
            "text": "George Level 3 Pensions administrator apprentice at Barnett Waddingham"
        },
        {
            "text": " "
        },
        {
            "text": "Alice Level 3 Pension Administrator apprentice Barnett Waddingham"
        },
        {
            "text": " "
        },
        {
            "text": "For more information about IfATE and all things National Apprenticeship Week :www.instituteforapprenticeships.org/naw2023"
        },
        {
            "text": " "
        }
    ]
}