{
    "url": "https://companieshouse.blog.gov.uk/2023/02/10/changes-to-accounts-part-2-small-company-filing-options/",
    "title": "Changes to accounts, part 2: small company filing options",
    "authors": [
        "Accounts and reporting policy team"
    ],
    "categories": [
        "Companies House transformation",
        "Company guidance",
        "Filing advice",
        "Legislative reform"
    ],
    "pub_date": "2023-02-10T09:30:11+00:00",
    "content": [
        {
            "text": "The way we operate at Companies House is changing. Since 22 September 2022, the Economic Crime and Corporate Transparency Bill has been making its way through Parliament. The changes set out in the Bill will improve transparency by making more financial information available to the public. This will help tackle economic crime and provide more information for enforcement agencies. As part of this package of reform, we are streamlining the accounts filing options available to small and micro companies."
        },
        {
            "heading": 2,
            "text": "Why profit and loss requirements are changing"
        },
        {
            "text": "Public disclosure of information is a requirement for all companies. In return, companies have the protection of limited liability. During our consultation phase, the accountancy profession, credit sector law enforcement bodies, and some individuals suggested that the current filing requirements do not provide protection as good as the protection provided by incorporation."
        },
        {
            "text": "A small or micro company that prepares abridged or full accounts for its members does not have to file a copy of its profit and loss account and/or the director's report with Companies House. This minimal level of disclosure has the potential to appeal to fraudsters wishing to present a false image of the company."
        },
        {
            "text": "Research published by the Home Office has calculated that the cost of organised fraud to businesses and the public sector in the UK is £5.9 billion a year. Small and micro companies make up most of the register, so any meaningful changes to the quality of the information on the register will impact them. Improving transparency and having better quality information will make it easier to spot fraud when it happens, and will also help to support business growth."
        },
        {
            "heading": 2,
            "text": "What the changes mean for small and micro companies"
        },
        {
            "heading": 3,
            "text": "Fewer options"
        },
        {
            "text": "To simplify our framework, we’ll be reducing our account filing options to just two: micro-entities and small companies. Under the new measures, the option for abridged accounts will be removed. Having fewer filing options will help to avoid confusion and reduce costly mistakes."
        },
        {
            "heading": 3,
            "text": "More information"
        },
        {
            "text": "Under this new framework, all small companies, including micro-entities, will be required to file their profit and loss accounts. Having key information such as turnover and profit or loss available on the public register will help creditors and consumers make better-informed decisions. It will also improve the value of the information on the register for users."
        },
        {
            "text": "The lack of detail in small and micro-accounts has made it impossible to confirm eligibility to file under a specific regime and claim audit exemptions. It has also made it difficult for lenders and creditors to determine the creditworthiness of small businesses. This can deter them from offering finance which hinders small business growth."
        },
        {
            "text": "The detail and format of the profit and loss account filings will be set out in secondary legislation. This is being developed in consultation with business and accountancy groups. We’ll keep you updated on its development and on timescales."
        },
        {
            "text": "As small and micro-entity companies are already required to file a copy of their annual accounts to HMRC, we do not anticipate this change to be overly burdensome."
        },
        {
            "heading": 2,
            "text": "Other accounts-related changes"
        },
        {
            "text": "Other changes to filing accounts will include:"
        },
        {
            "text": "The White Paper on Corporate Transparency and Register Reform provides a deeper policy overview of the reforms. (PDF, 1,920KB)"
        },
        {
            "text": "Read more about these measures in the Economic Crime and Corporate Transparency Bill factsheet."
        },
        {
            "text": "Keep a look out on our blog for more details about the upcoming changes and what you can do to prepare, and sign up to our newsletter if you’d like to receive regular updates."
        },
        {
            "text": "For more information about upcoming changes to accounts, read our blog post on moving to software-only filing."
        }
    ]
}