{
    "url": "https://companieshouse.blog.gov.uk/2023/02/10/changes-to-accounts-part-1-moving-to-software-only-filing/",
    "title": "Changes to accounts, part 1: moving to software-only filing",
    "authors": [
        "Rachel Meese, Service Manager - Accounts Filing"
    ],
    "categories": [
        "Companies House transformation",
        "Company guidance",
        "Filing advice",
        "Legislative reform"
    ],
    "pub_date": "2023-02-10T09:30:25+00:00",
    "content": [
        {
            "text": "Most accounts at Companies House are filed using software, rather than using paper or our online service, WebFiling. Using software is quick and efficient and improves transparency, traceability, and validation of accounts filings. This adds value to the register and assists our intelligence service in fraud detection."
        },
        {
            "text": "Most company owners and directors will be aware that, each year, every company must file a set of accounts with Companies House, which show how a company has performed over the accounting period. This is required whether the company is trading or not. Over 4 million sets of accounts are filed each year, providing valuable information and helping to drive confidence in the UK economy."
        },
        {
            "heading": 2,
            "text": "Economic Crime and Corporate Transparency Bill 2022"
        },
        {
            "text": "When the Economic Crime and Corporate Transparency Bill is passed, along with many other changes such as identity verification, we expect to gain the power to mandate how companies file their accounts. This has provided us with the opportunity to completely review how accounts are filed."
        },
        {
            "text": "Our vision is to create a single, cost-effective, sustainable way of filing accounts, which will be secure, transparent, and traceable. We also want to enable much wider tagging of accounts data. This means that the data is electronically tagged and categorised to a specialist accounts taxonomy, making it easier for our users to access, analyse and search for data."
        },
        {
            "heading": 2,
            "text": "Using software is efficient and reliable"
        },
        {
            "text": "There are several ways for a company to file its accounts. Some use our web-based systems (WebFiling and Find and Update Company Information service), or our joint filing service with HMRC (Company Accounts and Tax Online), and a small number of users file on paper."
        },
        {
            "text": "As accounts become more complex, using software to file them is increasingly attractive. It’s efficient, improves accuracy and provides information that can be relied on when making business decisions."
        },
        {
            "text": "Companies House has already begun work to move to software-only accounts filing, which will see the removal of all other filing routes for accounts. We’re currently working with software companies to bring in these changes and to create a solution for more complex package accounts, which can currently only be filed using paper."
        },
        {
            "heading": 2,
            "text": "What you need to do"
        },
        {
            "text": "After the Bill has been passed and achieves Royal Assent, we’ll let you know the timetable for the incremental roll-out of the change to software-only filing.  But there’s no need to wait. The software is already available for you to make the change now. Over 65% of companies already use software filing as their preferred method."
        },
        {
            "text": "If you’re a company director and you use an accountant to file your annual accounts, talk to them about software filing to make sure you’re compliant with the upcoming changes. Ask what software they’re already using to file accounts with HMRC.  If you’re a self-filer, presenter, or agent acting on behalf of companies and you do not currently have software, you’ll need to find the right software package for your needs before web-based and paper filing are no longer available for your accounts type. Once the timeline has been agreed, we’ll make sure that you have time to make the change before it's a legal requirement."
        },
        {
            "text": "Companies House has made a strategic commitment to become a fully digital filing service. This means we need a fit-for-purpose way to improve the quality and value of information on the register to fulfil our organisational priorities of delivering legislative reform and preventing economic crime."
        },
        {
            "text": "Keep a look out on our blog for more details about the upcoming changes and what you can do to prepare, and sign up to our newsletter if you’d like to receive regular updates."
        },
        {
            "text": "For more information about upcoming changes to accounts, read our blog post on changes to small company filing options."
        }
    ]
}