{
    "url": "https://veteranstoday.blog.gov.uk/2023/02/10/information-dashboard-offers-new-snapshot-of-veterans/",
    "title": "Information dashboard offers new snapshot of veterans",
    "authors": [
        "michaelball"
    ],
    "categories": [
        "Armed Forces",
        "Armed Forces Charities",
        "Veterans",
        "Veterans Advice",
        "Veterans Support",
        "Veterans Today",
        "Veterans Welfare and Support"
    ],
    "pub_date": "2023-02-10T11:09:57+00:00",
    "content": [
        {
            "text": "A new dashboard showing information about the veteran community is now publicly available."
        },
        {
            "text": "The veterans data dashboard, from the Office for Veterans’ Affairs, has statistics in areas such as population, housing, mental health and employment."
        },
        {
            "text": "It will provide a snapshot to the public, veterans and service providers so they can learn about the community, as well as the services offered by the government to support veterans."
        },
        {
            "text": "This follows data released by the Office for National Statistics from the 2021 census on the veteran population. That data covers areas such as age, health, gender and ethnic and religious breakdown."
        },
        {
            "text": "Minister of Veterans’ Affairs Johnny Mercer (above) said: 'In order to step up services for veterans and standardise support across the country, we need a better picture of the community we’re serving."
        },
        {
            "text": "'So it’s a key part of our job at the Office for Veterans’ Affairs to improve the data we have on the veteran community and this shows that we’re making good strides forward."
        },
        {
            "text": "'Data and evidence is at the heart of our veterans policy and I encourage everyone to check out the new dashboard.'"
        },
        {
            "text": "The dashboard will be updated regularly as new data emerges. The ONS is working to further analyse the census 2021 data set, which for the first time included a question on if the respondent was a veteran."
        },
        {
            "text": "The Office for Veterans’ Affairs data dashboard can be found here."
        }
    ]
}