{
    "url": "https://naturalengland.blog.gov.uk/2023/02/10/international-day-of-women-and-girls-in-science/",
    "title": "International Day of Women and Girls in Science",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Education",
        "Natural England",
        "Science and evidence"
    ],
    "pub_date": "2023-02-10T13:20:20+00:00",
    "content": [
        {
            "text": "Women have played a crucial role in science for as long as humans have been on earth. From the earliest use of herbs in healing, to the discovery of the structure of DNA[1], women scientists have always been pioneers. However, due to outdated views on the intellectual capacity of the ‘gentler sex’, many women historically were denied the opportunity to gain scientific knowledge. Even for the small minority of women that could access this type of learning due to familial influence and/ or exceptional privilege, their contributions to science often remain relatively unknown."
        },
        {
            "text": "So, it is only fitting that the 11th of February sees the annual celebration of the vast contribution that women and girls have made to the scientific world. Hosted since 2015 by the United Nations, this year’s ‘International Day of Women and Girls in Science’ focuses on the contribution of women and girls in relation to several Sustainable Development Goals (SDGs). Namely, SDG 6 - clean water and sanitation; SDG 7 - affordable and clean energy; SDG 9 - industry, innovation, and infrastructure; and SDG 11 - sustainable cities and communities. The below stories exemplify the inspiring work of women in these areas. They connect across time to highlight womenfolk striving to make the world a better place. From the first woman to publish a book of photography, to girls using science in their activism here in the UK, women are there, at the centre of it all."
        },
        {
            "text": "Anna Atkins"
        },
        {
            "text": "Anna Atkins was a botanist and photographer from Kent who lived during the 19th Century. She is famous for publishing the first book of photographs using cyanotype photography."
        },
        {
            "text": "Atkins was very close to her father, an eminent chemist, mineralogist, and zoologist. Due to her relationship with her father, Atkins received a scientific education, which was very unusual for the time. Her education had a huge impact on her career and led her to work in botany."
        },
        {
            "text": "In 1839, she was elected a member of the London Botanical Society. Her father’s friendships with inventors William Henry Fox Talbot and Sir John Herschel, led to Atkins being taught about photography and the cyanotype process. By 1843, Atkins was able to apply the cyanotype photographic process to algae (specifically, seaweed) by making cyanotype photograms “by placing the unmounted dried-algae original directly on the cyanotype paper”[2]. The same year that she perfected this process, she self-published her photograms in the first instalment of Photographs of British Algae: Cyanotype Impressions, and in doing so established photography as an accurate medium for scientific illustration[3]. You can find out more about her in this video and try out some botanical painting techniques that mimic the cyanotype effect."
        },
        {
            "text": " "
        },
        {
            "text": "Catherine Coleman Flowers "
        },
        {
            "text": "Catherine Coleman Flowers is an American environmental and climate justice activist. She is the founder and executive director of Alabama Center for Rural Enterprise, Inc. (ACRE)."
        },
        {
            "text": "Her work largely focuses on finding solutions to the water and sanitation crises in poor rural communities across the U.S. — a topic she detailed in her book Waste: One Woman’s Fight Against America’s Dirty Secret[4]. Flowers works at the intersection of racism and climate justice as her research with the Columbia Law School Human Rights Institute investigated how structural inequalities impact access to sanitation and clean water[5]. She identified two crucial issues – firstly African American communities were disproportionately affected by poor sanitation; and secondly, that marginalised, poverty-stricken rural communities were more likely to suffer from contaminated water and poor sanitation. These issues combined lead to higher incidences of intestinal parasitic diseases such as hookworm in the African American community. The disease, normally associated with central and southern Africa and Asia, can impair physical and cognitive growth in children, and had been thought to have been eradicated from the US in the early 20th century."
        },
        {
            "text": "From negotiating with the Alabama state government, to serving as the rural development manager for Equal Justice Initiative and being an active Climate Reality Leader and Climate Speaker, Catherine has become a powerful force for change, both in her home state and beyond."
        },
        {
            "text": " "
        },
        {
            "text": "Choked Up"
        },
        {
            "text": "Choked Up are a campaign group for a new Clean Air Act led by a group of young women from South London."
        },
        {
            "text": "You may be familiar with ‘Ella’s law ’or the Clean Air (Human Rights) Bill, introduced to Parliament by Baroness Jenny Jones in May 2022. Ella Roberta Adoo Kissi Debrah died on 15 February 2013 at the age of nine as a result of asthma induced by air pollution in London. Ella was the first person in England to have air pollution named as a cause of death by a coroner."
        },
        {
            "text": "Members of Choked Up have a personal link to Ella and this led them to research air pollution in their local borough of Lewisham. They found that those who lived in London boroughs with high/ illegal air pollution levels had a proportionally higher rate of illnesses and death, with four thousand Londoners dying from air pollution each year. Those that had illnesses related to air pollutions tended to be people of colour or those from deprived communities. Thus, their campaign was born."
        },
        {
            "text": "Despite not being of voting age, the group hope to use their voices and the scientific facts to influence those who can vote. Nyeleti Brauer-Maxaeia said: “One of our main messages is that we want the Government to take air quality more seriously with effective legislation.”"
        },
        {
            "text": "“In South London particularly, air quality targets set out by the WHO (World Health Organization) are regularly exceeded.”"
        },
        {
            "text": "“We would also like deprived communities and communities of colour to be recognised, taken seriously and most of all protected when it comes to air quality.”"
        },
        {
            "text": " "
        },
        {
            "text": "We can see that the future of women and girls in science is an exciting one. We have come far, but there is still much work to do. Natural England is committed to providing exciting career opportunities for women that are considering – or are already within science roles. Natural England offers a wide range of opportunities from field to desk. With women working as policy makers, running our National Nature Reserves, or representing the UK at the international marine conferences, gender is not a barrier to scientific work at Natural England. There are currently over 1220 women employed within the organisation, a testament to the ongoing gender equality work. Find out more about the many opportunities within NE here: Working for Natural England - Natural England - GOV.UK (www.gov.uk)"
        },
        {
            "text": "In discovering the stories above, may you feel more enthused in your own scientific endeavours, and be encouraged to act as an advocate for women and girls everywhere that wish to take up the scientific mantle!"
        },
        {
            "text": "To learn more about International Day of Women and Girls in Science, visit the following link: https://www.un.org/en/observances/women-and-girls-in-science-day"
        },
        {
            "text": " "
        },
        {
            "heading": 5,
            "text": "Written by Michelle Mangal,"
        },
        {
            "heading": 5,
            "text": "National Nature Reserves Team Leader."
        },
        {
            "text": " "
        },
        {
            "text": "____________"
        },
        {
            "heading": 5,
            "text": "[1] Francis Crick, Rosalind Franklin, James Watson, and Maurice Wilkins | Science History Institute"
        },
        {
            "heading": 5,
            "text": "[2] https://scientificwomen.net/women/atkins-anna-162"
        },
        {
            "heading": 5,
            "text": "[3] https://www.getty.edu/art/collection/person/103KDM "
        },
        {
            "heading": 5,
            "text": "[4] https://www.greenmatters.com/p/black-climate-scientists "
        },
        {
            "heading": 5,
            "text": "[5]  \"Human Rights Institute\". Columbia Law School. Retrieved 2020-10-06."
        }
    ]
}