{
    "url": "https://food.blog.gov.uk/2023/02/10/international-day-of-women-and-girls-in-science-2023/",
    "title": "Celebrating International Day of Women and Girls in Science 2023 at the FSA",
    "authors": [
        "Professor Susan Jebb, FSA Chair"
    ],
    "categories": [
        "People",
        "Science"
    ],
    "pub_date": "2023-02-10T09:00:25+00:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "To mark this year's International Day of Women and Girls in Science on Saturday 11 February 2023, FSA Chair Professor Susan Jebb introduces some of the women working in key scientific roles in the organisation."
        },
        {
            "text": "I am pleased to introduce you to just a small selection of the many women working in science for the Food Standards Agency. Their work is essential to achieving our mission of food that is safe, is what it says and is healthy and sustainable."
        },
        {
            "text": "The FSA employs people in a wide range of science specialisms, from toxicologists and microbiologists to social scientists, economists and vets. Our science and evidence teams include women working on horizon scanning, planning and managing new research projects, and analysing data."
        },
        {
            "text": "As Chair of the FSA, I’m proud that science and evidence shapes everything we do as an organisation. It is a place where you can use your scientific training to have real world impacts, and work on important issues that touch all of us, every day."
        },
        {
            "text": "Below you can find out more about the experience of some of talented and committed women we have working in science for the FSA."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Naomi Davidson, Head of Science & Surveillance, Northern Ireland"
        },
        {
            "text": "I am head of the new Science and Surveillance team for the FSA in Northern Ireland. This was set up in September 2022 with the focus on leading and developing the science input and expertise in Northern Ireland. Our remit is quite broad - we provide coordination across all policy and operational delivery teams ranging from topics such as nutrition to antimicrobial resistance. I have a BSc in Human Nutrition and a MSc in Health Promotion and Public Health. Everyone in the team has different experiences and backgrounds across biological sciences, from nutrition to microbiology and a PhD in virology!"
        },
        {
            "heading": 3,
            "text": "What have you found most challenging about being a woman working in science?"
        },
        {
            "text": "When I was at the start of my career, I would look at women already working in public health and wonder how they did it. How did they balance the demands of a full-time career with life outside work and caring responsibilities? We are lucky in the FSA to have a flexible working policy, making it easy to manage this work-life balance. You can have it all! I don’t take this for granted, it would not be the same in other organisations. I can attend all of my meetings and deliver on my projects whilst taking time out to see my son’s school play, for example. I’ve also appreciated the flexible hours when it comes to continued professional development. We all know learning does not stop when you leave university, there are so many developments to keep up with. I can get up early to read research papers or spend time watching webinars later in the evening."
        },
        {
            "heading": 3,
            "text": "What would you say to someone just starting out, who might be considering a career in science?"
        },
        {
            "text": "Go for it! Believe in yourself. Don’t forget to focus on the informal aspects as well. Networking and relationship-building, for example, can be really valuable. Identify mentors and role models early on in your career. It’s also important to broaden your focus when at university to all of the career options open to you. Nutrition, for example, is such a broad field, you could choose to work in research, policy development, industry, the community and voluntary sector or clinical work. Find out what areas you are interested in and passionate about."
        },
        {
            "heading": 3,
            "text": "What is the best thing about being a woman in science for the FSA?"
        },
        {
            "text": "My background is in nutrition and this is a predominately female field. I love how supportive the women I have worked with are of each other. Everyone is willing to help, encourage and push each other. They are also brilliant at taking the time to celebrate each other’s successes, it’s a lovely culture to be a part of."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Priscilla Wanjiru, Regulated Products Risk Assessor"
        },
        {
            "text": "I am a Regulated Products Risk Assessor within the Risk Assessment Unit under SERD (Science, Evidence and Research Division). My role is to evaluate novel food that is looking to be authorised for consumption within Great Britain. I am also part of the Secretariat for the ACNFP (Advisory Committee for Novel Food and Processes), the Committee responsible for advising the FSA on all matters related to novel foods, GM foods and feed and novel processes."
        },
        {
            "heading": 3,
            "text": "What have you found most challenging about being a woman working in science?"
        },
        {
            "text": "The most challenging thing I have had to overcome would ultimately be balancing the role women play outside of work alongside a demanding career, more so as an immigrant with a ‘limited village’. However, this is a challenge that has greatly diminished whilst working for the FSA. I work flexibly remotely, thanks to the FSA facilitating different types of contracts to suit various needs (something they rolled out long before coronavirus), which helps balance my responsibilities as a mother and as a risk assessor."
        },
        {
            "heading": 3,
            "text": "What would you say to someone starting out now and considering a career in science?"
        },
        {
            "text": "My younger self would have answered this very differently but at this point in my life, I would first re-iterate that the starting point of anything you want to do is NOW. There is no wrong or right time, and everyone’s time is unique."
        },
        {
            "text": "What matters most (and this applies in every career) is having the passion for what you choose to do and being realistic about the input needed as this is what keeps you going on those days you might doubt if you made the right choice. My love for the food industry has led me to where I am today, backed up by the science subjects I undertook in school. Science is versatile with applications in just about anything in daily life so if you have the interest, you are bound to find your niche."
        },
        {
            "heading": 3,
            "text": "What is the best thing about working as a woman in science for the FSA?"
        },
        {
            "text": "We have been drumming on the need for more girls taking STEM subjects and going into science-related roles. Working for the FSA and in SERD specifically is evidence that women can successfully contribute in scientific roles… another face on the map to help inspire."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Chloe Thomas, Senior Trade Risk Assessor - Exposure Assessment & Trade"
        },
        {
            "text": "I took quite a convoluted route into science, but eventually settled on Microbiology, and that is the degree that I graduated with at BSc level. When I started at the FSA I worked in exposure assessment, where I was involved in providing estimates of exposure to different types of hazards from food and drink to subject matter experts. I am now a senior trade risk assessor where I essentially coordinate projects to inform risk assessments on imported food and drink."
        },
        {
            "heading": 3,
            "text": "What have you found most challenging about being a woman working in science?"
        },
        {
            "text": "I would say the most challenging thing I have overcome is my own self-belief. When I first thought about a career in science at around 15, I didn’t really think I could do it. I didn’t know much about the career options available and that there were, in reality, lots of women in those roles."
        },
        {
            "text": "So, I initially applied for a course at university which wasn’t really what I wanted to do, because I didn’t know what I wanted! Inevitably, it didn’t work out and I am thankful to this day for that early rejection so that I could use it to build on and end up on the path I am on now."
        },
        {
            "heading": 3,
            "text": "What would you say to someone starting out now and considering a career in science?"
        },
        {
            "text": "Speak to women in science. Most women I know working in science, including myself, would be happy to speak to people who approach them, particularly young women and girls. It’s a great way to find out what kinds of roles are available and about people’s journey into them – it’s not always what you think! It might mean asking friends and family if they know anybody, approaching someone at school or university, or on social media. I have found that most people will be friendly and willing to help – you might be surprised by what you find out!"
        },
        {
            "heading": 3,
            "text": "What is the best thing about working as a woman in science for the FSA?"
        },
        {
            "text": "That I am rarely the only woman in the room – or virtual room! There are so many wonderful people working in science or with the science directorate that the FSA, and I can honestly say, that not once have I felt the impact of being a woman in that environment. I have been at the FSA for over three years, and I think that this is because much of the way has been paved by women who have gone before me. There is still work to be done for feminism generally in science I believe, but at the FSA, my experience has only been positive."
        },
        {
            "heading": 1,
            "text": "Dathlu Diwrnod Rhyngwladol Menywod a Merched mewn Gwyddoniaeth 2023 yn yr Asiantaeth Safonau Bwyd"
        },
        {
            "text": "I nodi Diwrnod Rhyngwladol Menywod a Merched mewn Gwyddoniaeth eleni ar ddydd Sadwrn 11 Chwefror 2023, mae Cadeirydd yr ASB, yr Athro Susan Jebb, yn cyflwyno rhai o’r menywod sy’n gweithio mewn rolau gwyddonol allweddol yn y sefydliad"
        },
        {
            "text": "Mae’n bleser gennyf eich cyflwyno i ambell un o’r llawer o ferched sy’n gweithio ym maes gwyddoniaeth yr Asiantaeth Safonau Bwyd (ASB). Mae eu gwaith yn hanfodol i gyflawni ein cenhadaeth, sef bwyd sy’n ddiogel, sy’n cyd-fynd â’r hyn sydd ar y label ac sy’n iach ac yn gynaliadwy."
        },
        {
            "text": "Mae’r ASB yn cynnig ystod eang o rolau gwyddonol arbenigol, o wenwynegwyr a microbiolegwyr i wyddonwyr cymdeithasol, economegwyr a milfeddygon. Mae ein timau gwyddoniaeth a thystiolaeth yn cynnwys menywod sy’n gweithio ar sganio’r gorwel, cynllunio a rheoli prosiectau ymchwil newydd, a dadansoddi data."
        },
        {
            "text": "Fel Cadeirydd yr ASB, rwy’n falch bod gwyddoniaeth a thystiolaeth yn llywio popeth a wnawn fel sefydliad. Mae’n sefydliad lle mae modd manteisio ar hyfforddiant gwyddonol i gael effaith go iawn, a gweithio ar faterion pwysig sy’n cyffwrdd â bywydau bob un ohonom, bob dydd."
        },
        {
            "text": "Isod, gallwch ddarllen am brofiadau rhai o’r merched medrus ac ymroddedig sy’n gweithio ym maes gwyddoniaeth yn yr ASB."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Naomi Davidson, Pennaeth Gwyddoniaeth a Gwyliadwriaeth, Gogledd Iwerddon"
        },
        {
            "text": "Fi yw pennaeth tîm newydd Gwyddoniaeth a Gwyliadwriaeth yr ASB yng Ngogledd Iwerddon. Sefydlwyd y tîm ym mis Medi 2022 gyda’r ffocws ar arwain a datblygu’r mewnbwn a’r arbenigedd gwyddonol yng Ngogledd Iwerddon. Mae ein cylch gwaith yn eithaf eang – rydym yn cydgysylltu ar draws yr holl dimau polisi a chyflawni gweithrediadau, yn amrywio o bynciau fel maeth ac ymwrthedd gwrthficrobaidd. Mae gen i BSc mewn Maeth Dynol ac MSc mewn Hybu Iechyd ac Iechyd y Cyhoedd. Mae gan bawb yn y tîm brofiadau a chefndiroedd gwahanol ar draws gwyddorau biolegol, o faeth i ficrobioleg a PhD mewn firoleg!"
        },
        {
            "heading": 3,
            "text": "Beth yw’r her fwyaf am fod yn fenyw sy’n gweithio mewn gwyddoniaeth?"
        },
        {
            "text": "Ar ddechrau fy ngyrfa, byddwn yn edrych ar fenywod oedd eisoes yn gweithio ym maes gwyddor iechyd ac yn meddwl tybed sut roeddent yn gallu gwneud hynny. Sut roedden nhw’n cydbwyso gofynion gyrfa lawn amser gyda bywyd personol? Yn ffodus, mae gennym ni bolisi gweithio hyblyg yn yr ASB, sy’n ei gwneud hi’n hawdd rheoli’r cydbwysedd rhwng bywyd a gwaith. Mae modd cael y cyfan! Dydw i ddim yn cymryd hyn yn ganiataol, ac rwy’n gwybod nad yw pethau’r un peth mewn sefydliadau eraill. Dwi’n gallu cymryd seibiannau o’r gwaith, a pheidio â cholli sioe ysgol fy mab, er enghraifft."
        },
        {
            "text": "Rwyf hefyd wedi gwerthfawrogi’r cysyniad oriau craidd. Mae dysgu yn y byd gwyddoniaeth yn parhau ar ôl gadael y brifysgol, mae’n rhaid i chi ddarllen yn eang am eich pwnc. Dwi’n gallu codi’n gynnar i ddarllen papurau ymchwil neu dreulio amser yn eu darllen gyda’r nos."
        },
        {
            "heading": 3,
            "text": "Beth fyddech chi’n ei ddweud wrth rywun sydd newydd ddechrau, a allai fod yn ystyried gyrfa mewn gwyddoniaeth?"
        },
        {
            "text": "Ewch amdani! Credwch ynoch eich hun. Canolbwyntiwch ar yr elfennau anffurfiol hefyd. Gall rhwydweithio a meithrin perthnasoedd, er enghraifft, fod yn werthfawr iawn. Chwiliwch am fentoriaid a phobl dylanwadol. Mae hefyd yn bwysig ehangu eich ffocws y tu hwnt i’r pethau clinigol yn unig. Mae maeth, er enghraifft, yn bwnc eang iawn ac yn cynnwys ymchwil, polisi a gwaith cymunedol. Mae’n bwysig darganfod beth sydd o ddiddordeb i chi a’r hyn rydych yn angerddol amdano."
        },
        {
            "heading": 3,
            "text": "Beth yw’r peth gorau am fod yn fenyw sy’n gweithio i’r ASB ym maes gwyddoniaeth?"
        },
        {
            "text": "Mae fy nghefndir ym maes maeth ac mae hwn yn faes sy’n cael ei ddominyddu gan fenywod. Rwyf wrth fy modd â’r ffordd y mae merched yn cefnogi ei gilydd. Mae gan bawb amser i esbonio a helpu. Rwyf bob amser wedi cael fy amgylchynu gan fenywod cefnogol ac rwy’n sylweddoli nad yw hyn yn wir ym mhobman. Mae pawb yn barod i helpu, cefnogi a hybu ei gilydd. Mae’n ddiwylliant hyfryd."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Priscilla Wanjiru, Asesydd Risg Cynhyrchion Rheoleiddiedig"
        },
        {
            "text": "Rwy’n gweithio fel Asesydd Risg Cynhyrchion Rheoleiddiedig yn yr Uned Asesu Risg, o dan yr Is-adran Tystiolaeth ac Ymchwil Wyddoniaeth (SERD). Fy rôl yw gwerthuso bwyd newydd sy’n ceisio awdurdodiad i’w fwyta ym Mhrydain Fawr. Rwyf hefyd yn rhan o’r Ysgrifenyddiaeth ar gyfer yr ACNFP (Pwyllgor Cynghori ar Fwyd a Phrosesau Newydd), y Pwyllgor sy’n gyfrifol am gynghori’r ASB ar bob mater sy’n ymwneud â bwydydd newydd, bwyd a bwyd anifeiliaid GM a phrosesau newydd."
        },
        {
            "heading": 2,
            "text": "Beth yw’r her fwyaf am fod yn fenyw sy’n gweithio mewn gwyddoniaeth?"
        },
        {
            "text": "Y peth mwyaf heriol yr wyf wedi gorfod ei oresgyn yw cydbwyso’r rôl y mae menywod yn ei chwarae y tu allan i’r gwaith ochr yn ochr â gyrfa heriol, yn enwedig fel mewnfudwr heb lawer o gefnogaeth gan eraill. Fodd bynnag, mae gweithio i’r ASB wedi lleihau’r her hon yn fawr. Rwy’n gweithio’n hyblyg ac o bell, gan fod yr ASB yn cynnig gwahanol fathau o gontractau i weddu i anghenion amrywiol (roedd hyn ar waith gan yr Asiantaeth ymhell cyn coronafeirws), sy’n fy helpu i gydbwyso fy nghyfrifoldebau fel mam ac fel asesydd risg."
        },
        {
            "heading": 3,
            "text": "Beth fyddech chi’n ei ddweud wrth rywun sy’n dechrau nawr ac yn ystyried gyrfa mewn gwyddoniaeth?"
        },
        {
            "text": "Pan oeddwn yn iau, byddwn wedi ateb y cwestiwn hwn yn wahanol iawn, ond erbyn hyn, byddwn yn dweud yn mai NAWR yw’r man cychwyn ar gyfer unrhyw beth yr hoffech ei wneud. Nid os amser cywir nac anghywir, ac mae amserlen pawb yn unigryw."
        },
        {
            "text": "Yr hyn sydd bwysicaf (ac mae hyn yn berthnasol ym mhob gyrfa) yw bod yn angerddol am yr hyn rydych yn ei ddewis, a bod yn realistig ynglŷn â’r hyn y bydd angen i chi ei wneud, gan mai dyma sy’n eich cadw i fynd ar y dyddiau hynny y gallech fod yn amau a wnaethoch chi’r dewis cywir. Mae fy nghariad at y diwydiant bwyd wedi fy arwain i ble rydw i heddiw, ynghyd â’r pynciau gwyddonol a astudiais yn yr ysgol. Mae gwyddoniaeth yn faes amrywiol ac yn berthnasol i bron unrhyw beth mewn bywyd bob dydd, felly os oes gennych chi’r diddordeb, rydych yn siŵr o ddod o hyd i’ch niche."
        },
        {
            "heading": 3,
            "text": "Beth yw’r peth gorau am weithio i’r ASB fel menyw ym maes gwyddoniaeth?"
        },
        {
            "text": "Rydym wedi bod yn pwysleisio bod angen i fwy o ferched astudio pynciau STEM a chael rolau sy’n gysylltiedig â gwyddoniaeth. Mae gweithio i’r ASB ac yn SERD yn benodol yn profi bod menywod yn gallu cyfrannu’n llwyddiannus mewn rolau gwyddonol… wyneb arall ar y map sy’n ysbrydoli."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Chloe Thomas, Uwch-asesydd Risg Masnach – Asesu Amlygiad a Masnach"
        },
        {
            "text": "Roedd fy llwybr i wyddoniaeth yn un eithaf troellog, ond yn y pen draw, penderfynais ganolbwyntio ar Ficrobioleg, gan raddio ar lefel BSc. Pan ddechreuais yn yr ASB roeddwn yn gweithio ym maes asesu amlygiad, yn darparu brasamcanion o amlygiad i wahanol fathau o beryglon o fwyd a diod i arbenigwyr pwnc. Rwyf bellach yn uwch-asesydd risg masnach lle rwyf yn cydlynu prosiectau i lywio asesiadau risg ar fwyd a diod a fewnforir."
        },
        {
            "heading": 3,
            "text": "Beth yw’r her fwyaf am fod yn fenyw sy’n gweithio mewn gwyddoniaeth?"
        },
        {
            "text": "Byddwn yn dweud mai’r peth mwyaf heriol i mi ei oresgyn oedd gallu credu ynof fi fy hun. Wrth ystyried gyrfa mewn gwyddoniaeth am y tro cyntaf yn 15 oed, doeddwn i ddim wir yn meddwl y gallwn ei wneud. Doeddwn i ddim yn gwybod rhyw lawer am yr opsiynau gyrfa a oedd ar gael i mi, a bod llawer o fenywod yn y rolau hynny mewn gwirionedd."
        },
        {
            "text": "Felly, ymgeisiais am gwrs yn y brifysgol nad oeddwn i eisiau ei astudio mewn gwirionedd, oherwydd doeddwn i ddim yn gwybod beth roeddwn i eisiau ei wneud! Yn anochel, nid oeddwn yn llwyddiannus ac rwy’n ddiolchgar hyd heddiw na ches i le ar y cwrs hwnnw, gan fod hynny wedi fy arwain at fy llwybr presennol."
        },
        {
            "heading": 3,
            "text": "Beth fyddech chi’n ei ddweud wrth rywun sy’n dechrau nawr ac yn ystyried gyrfa mewn gwyddoniaeth?"
        },
        {
            "text": "Siaradwch â menywod mewn gwyddoniaeth. Byddai’r rhan fwyaf o fenywod rwy’n eu hadnabod sy’n gweithio ym maes gwyddoniaeth, gan gynnwys fi fy hun, yn hapus i siarad â phobl sy’n dod atyn nhw, yn enwedig menywod ifanc a merched. Mae’n ffordd wych o ddarganfod pa fathau o rolau sydd ar gael ac am brofiadau pobl eraill o gyrraedd y rolau hynny – bydd yn agoriad llygaid! Gallwch ofyn i ffrindiau a theulu a ydyn nhw’n nabod unrhyw un, mynd at rywun yn yr ysgol neu’r brifysgol, neu cysylltu â rhywun ar y cyfryngau cymdeithasol. Rwyf wedi gweld o brofiad y bydd y rhan fwyaf o bobl yn gyfeillgar ac yn barod i helpu – efallai y cewch eich synnu gan yr hyn rydych chi’n ei ddarganfod!"
        },
        {
            "heading": 3,
            "text": "Beth yw’r peth gorau am weithio i’r ASB fel menyw ym maes gwyddoniaeth?"
        },
        {
            "text": "Anaml mai fi yw’r unig fenyw yn yr ystafell – neu’r ystafell rhithwir! Mae cymaint o bobl wych yn gweithio ym maes gwyddoniaeth neu yng nghyfarwyddiaeth wyddoniaeth yr ASB, a gallaf ddweud yn ddiflewyn ar dafod, nad wyf erioed wedi teimlo’n negyddol am fod yn fenyw yn yr amgylchedd hwnnw. Rwyf wedi gweithio i’r ASB ers mwy na thair blynedd, a dwi’n credu bod hyn oherwydd bod y seiliau wedi’u gosod yn barod gan fenywod sydd wedi gweithio i’r Asiantaeth cyn fy amser i. O safbwynt ffemeistiaeth yn gyffredinol, dwi’n credu bod dal gwaith i’w wneud ym maes gwyddoniaeth, ond yn yr ASB, mae fy mhrofiad wedi bod yn gadarnhaol tu hwnt."
        }
    ]
}