{
    "url": "https://defencedigital.blog.gov.uk/2023/02/10/mynavy-2022-new-features-award-wins-preparation-for-an-even-bigger-2023/",
    "title": "MyNavy 2022: New features, award wins & preparation for an even bigger 2023",
    "authors": [
        "Lt Cdr Morgan (Mogsy) Long"
    ],
    "categories": [
        "Navy Digital"
    ],
    "pub_date": "2023-02-10T10:31:22+00:00",
    "content": [
        {
            "text": "What an incredible year 2022 was for the MyNavy team. We scaled to 40,000 users, developed 14 new features, expanded outside of the Royal Navy and continued to deliver against our goal of supporting all personnel in living the best version of their Royal Navy life."
        },
        {
            "text": "MyNavy started as an innovation project. Our aim was to give everyone access to tools and systems previously confined to Defence infrastructure, through their own devices. By embracing innovation, continually gaining insight from users and responding quickly to feedback, we’ve built an app that’s scaled at pace and is fast becoming the one-stop shop for Navy personnel looking for support, information and opportunities to grow their careers."
        },
        {
            "text": "Navy Digital has delivered change through our partnership with digital product and service design agency, Great State, as part of a fully-funded, multi-year plan — enabling us to put MyNavy in the hands of over 40,000 users across the Royal Navy TLB including Reserves, Royal Fleet Axillary and Civil Servants. The technology we’ve developed has also been used to create MyNavy’s sister app, MyRAF, which now serves over 45,000 users."
        },
        {
            "heading": 2,
            "text": "Key improvements made in 2022"
        },
        {
            "heading": 3,
            "text": "Working towards access for all"
        },
        {
            "text": "We’ve been working hard to make MyNavy accessible to the Whole Force, including the Royal Axillary (RFA) and all Civil Servants working within RN TLB. 2023 will see even more progress here – with big plans to make content available offline so personnel can stay connected, onshore and afloat."
        },
        {
            "heading": 3,
            "text": "Announcements"
        },
        {
            "text": "We’ve enhanced the internal communications capability of MyNavy so that more personalised and richer content can be delivered through it. We can now embed MP4, images, PDF and audio recordings directly into the app."
        },
        {
            "text": "As well as being able to share updates with the Whole Force, we can now tailor and target messages by Unit, Location, Trade, Brand, Gender, Rank and other criteria — right down to individual Service Number."
        },
        {
            "heading": 3,
            "text": "Have Your Say"
        },
        {
            "text": "It’s easier than ever to share feedback on MyNavy. With the Have Your Say feature, users can report a technical issue or make suggestions for features they’d like to see. Any feedback we gather is discussed with a group of users and added to our backlog so that we can continually learn, iterate, and improve app functionality and the user experience."
        },
        {
            "heading": 3,
            "text": "Leadership Centre of Excellence "
        },
        {
            "text": "In March, the First Sea Lord launched an initiative to provide all personnel with digital resources to support their careers and leadership journey. Users can now browse, search or filter to find posters, articles, podcasts, books, and policies, add them to their favourites list for later and share feedback to shape how the library evolves."
        },
        {
            "heading": 3,
            "text": "Requesting Standard Learning Credits "
        },
        {
            "text": "With under 8% of the Royal Navy spending their annual £175 learning credit, we needed to find a new way for people to research and request financial support for training. We built a feature that provides information and guidance, giving users a single way to submit a request."
        },
        {
            "text": "Once a request has been made, case managers use a custom system to authorise and track requests, with the user staying updated through notifications in the app."
        },
        {
            "heading": 3,
            "text": "Sickness & Absence Reporting "
        },
        {
            "text": "The welfare and safety of our people is paramount, with Chains of Command needing a real-time status on the health and welfare of their people. MyNavy users can now log brief sickness absences and notify their line management from within the app. Short-term light duties limitations awarded at medical centres can also be recorded and line managers notified. "
        },
        {
            "heading": 3,
            "text": "Local Hub"
        },
        {
            "text": "The latest feature to MyNavy aims to elevate the stress of moving location. Once a user receives an assignment order, a notification and action card will appear on the Dashboard in MyNavy. This links the user to a simple checklist of outstanding tasks, with links to information on booking accommodation, digitally registering at new medical and dental centres, and a map of the new location with points of interest."
        },
        {
            "heading": 3,
            "text": "Enhanced Dashboard & Navigation"
        },
        {
            "text": "Six months of feedback (from research sessions and Have Your Say) showed us that users want MyNavy to have the look, feel and easy access of a downloaded app. Throughout October and November, we made several dashboard and global navigation changes that have made it easier for users to find the information they’re looking for and carry out tasks. Future iterations will allow the navigation to be tailored to features regularly visited or of greatest interest."
        },
        {
            "heading": 3,
            "text": "Industry Awards"
        },
        {
            "text": "These great features, delivered through a true user-centred design process has led MyNavy to not only be praised within the Royal Navy but also recognised within the UK digital industry as an exceptional transformation product. We’ve won:"
        },
        {
            "text": "Digital transformation is no mean feat. Amit Zavery, VP & Head of Platform at Google Cloud sees it “less as a technology project to be finished than as a state of perpetual agility, always ready to evolve for whatever customers want next, and you’ll be pointed down the right path.”"
        },
        {
            "text": "Our ambition for MyNavy has always been to make it follow that path, scaling to multiple services and leading on cross-Defence applications of the future."
        }
    ]
}