{
    "url": "https://grantscommunity.blog.gov.uk/2023/02/10/skills-for-life-not-just-for-grant-making/",
    "title": "Skills for life - not just for grant making",
    "authors": [
        "govtgrantscommunity",
        "alisonlong"
    ],
    "categories": [
        "Government Grants Management Function",
        "Learning and development",
        "National Apprenticeship Week"
    ],
    "pub_date": "2023-02-10T17:23:35+00:00",
    "content": [
        {
            "text": "For National Apprenticeship Week, we are celebrating and showcasing the contribution of apprentices who work in grants administration across government. "
        },
        {
            "text": "These apprentices are gaining skills for life working in a variety of roles in the fast-paced grants environment - from ‘behind the scenes’, making sure grant making systems and processes are efficient, to customer facing and administering grants to eligible individuals, organisations and businesses safely and quickly. "
        },
        {
            "text": "Hear from three apprentices who share their journeys and the invaluable skills and experience they are gaining in grant making to develop their careers."
        },
        {
            "text": " "
        },
        {
            "text": "Beth - Data Technician"
        },
        {
            "text": "I have recently enrolled on the Level 3 Data Technician apprenticeship because my ambition is to become a Data Analyst. I hope to learn analysis techniques, specific coding languages and advanced Excel formulas. "
        },
        {
            "text": "I’m also taking the opportunity, as an apprentice, for extra studies and attended the GGMF Licence to Practise residential course. This was specifically relevant to my present role as a grants administrator in the Department for Transport. The training modules covering risk mitigation, fraud, national security and GDPR are relevant to all roles in Government Departments. "
        },
        {
            "text": "My top tip for the anyone going on the training is don’t be afraid to ask questions, even if they seem silly in the moment."
        },
        {
            "text": " "
        },
        {
            "text": "Caleb -  Delivery Manager "
        },
        {
            "text": "I am on the Associate Delivery Manager Level 4 apprenticeship with APM PMQ. I changed career from a charity operations manager and grant writer to move fully into project management, with a preference for working in digital. "
        },
        {
            "text": "The apprenticeship with GGMF was an attractive role with its widely recognised professional qualification in project management. This apprenticeship focuses on a linear project lifecycle so, to learn more about agile practices, I’ve taken an extra agile course and on the job learning in parallel. "
        },
        {
            "text": "My main tip would be to take the time and space to invest in yourself and your learning. If you are racing through the basic course content and finding it straightforward don't worry about that, look for ways to learn more and satisfy your curiosity. Having 20% of your time at work to invest in learning and development is a phenomenal gift and it would be a shame not to use it. One more tip - sometimes the stuff you are doing at work won't line up perfectly with what you are supposed to be learning. Don't be shy to ask your team for opportunities to put your learning into practice. "
        },
        {
            "text": " "
        },
        {
            "text": "Ripon - Business Analyst "
        },
        {
            "text": "I have just completed Level 4 Information Systems Business Analyst apprenticeship and it’s a brilliant investment in my future. "
        },
        {
            "text": "I chose an apprenticeship for relevant real-world experience - earning while learning - and to work alongside experienced colleagues with time to study for the job role and achieve a nationally recognised qualification with industry specific skills. Apprenticeships also offer fantastic opportunities for progression, whether looking to study further or climb the job ladder. I believe that this apprenticeship was a wonderful entry-point for me into the Civil Service and a fantastic opportunity to gain insight into the workings of the Cabinet Office. "
        },
        {
            "text": "I have learnt a lot of things such as stakeholder analysis, user stories, RACI charts, Cost-benefit analysis,UML diagrams, As-Is & To-Be processes and user acceptance testing. I have opportunities to progress as a business analyst and a very supportive manager who generously shares their knowledge. "
        },
        {
            "text": "My top tips are to organise your time and don’t be afraid to ask questions. And a positive attitude towards all the tasks will get you recognised and appreciated."
        },
        {
            "text": " "
        },
        {
            "text": "Life-long learning"
        },
        {
            "text": "At GGMF we are passionate about supporting life-long learning and the empowerment and opportunities learning can provide - for apprentices right through to directors! We support both our internal staff within GGMF - living and breathing growth mindset - and also those individuals across government and agencies via our Learning and Development programmes."
        },
        {
            "text": "And for apprentices, our Licence to Practice Programme is proving popular for those wanting to learn more about grants management and administration. The programme has been developed to provide practical skill-based learning, peer-to-peer and social learning along with unique networking opportunities."
        },
        {
            "text": "For those working in a government department or agency, check out our learning resources today."
        }
    ]
}