{
    "url": "https://environmentagency.blog.gov.uk/2023/02/10/the-science-behind-our-carbon-offsetting/",
    "title": "The science behind our carbon offsetting",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Environment Agency"
    ],
    "pub_date": "2023-02-10T11:00:50+00:00",
    "content": [
        {
            "text": "Jenny Connell has worked in the Environment Agency for 15 years. She is a Senior Specialist in the Environment Agency’s net zero team – and here, she gives an insight into the science behind the EA’s carbon offsetting strategy to mark International Day of Women and Girls in Science."
        },
        {
            "text": "I wouldn’t say that science was an immediate hit with me."
        },
        {
            "text": "But from an early age I read a lot of books, and I loved popular science books – I still do. There is a real skill in making science accessible for people and translating the concepts into real life.  I also had an early interest in environmental issues, and I suspect some of my high school teachers predicted my future career direction long before I did – one of them used to joke about me running my (very old) car on elderberry juice."
        },
        {
            "text": "I studied Environmental Science at university and after I graduated I was keen to work in an environmental field. My first job was actually a year-long placement at a steel works – I did water and air quality monitoring. It was physically hard work at times, but really interesting and a very real world experience. It was a great starting point to seeing some of the practical applications of science.   I started my career at the EA working on delivering our flood risk capital programme, making sure projects are designed and delivered in the most environmentally sustainable way.  Sustainability covers a broad range of issues, and having a good understanding of the various scientific principles that underpin them has been a really useful skill over the years."
        },
        {
            "text": "I’m currently working on our organisational carbon offsetting strategy, which supports our net zero ambitions by setting out how we plan to abate our unavoidable residual emissions."
        },
        {
            "text": "Just to clarify, offsetting is a valuable tool in responding to the climate emergency – but it should never be used as an alternative to emissions reductions. “Here in the EA, we have committed to cutting our emissions first, and then offsetting the rest through projects that harmlessly lock away carbon while bringing added benefits for people and nature.”"
        },
        {
            "text": "We are pursuing a nature-based approach to carbon offsetting.  This means we’ll use habitats like woodland or saltmarsh to lock away carbon dioxide.  These habitats also have additional environmental and social benefits, such as reducing flood risk, improving water quality and providing valuable recreation spaces for local communities. A win for everyone!"
        },
        {
            "text": "In 2021 we carried out and published work led by Dr Lydia Burgess-Gamble that explored the evidence for various habitat types and their carbon sequestration potential. It concluded that nature-based solutions could play an important role in offsetting, but that the scientific understanding of how effective different habitats are is variable."
        },
        {
            "text": "Our offsetting strategy is building on this valuable work to better understand the contribution that different habitat types can make to offsetting our residual emissions. We’re doing this by modelling a range of offsetting scenarios using a carbon sequestration model.  We will use this work to make evidence-based decisions and inform our final approach to offsetting."
        },
        {
            "text": "In parallel with this, we are also developing a carbon protocol to set out how we calculate, record and monitor our carbon sequestration.  It’s really important that this approach is grounded in science, because we need to be sure that any sequestration we claim has actually occurred, and that it can be evidenced.  The scientific understanding of how much carbon habitats can absorb is evolving all the time, so we expect our protocol to evolve too.  This work is in early development but the range of scientific disciplines that need to be involved in it is huge – from carbon and habitats specialists through to experts in remote sensing and satellite monitoring.  As the person bringing this all together I’m really enjoying the opportunity to learn about new evidence and technologies. For me that is what science is about - having an open mind, being willing to learn new skills and solving problems."
        },
        {
            "text": "It’s really important that we involve everyone in how we respond to the climate emergency - this is the biggest challenge we have ever faced and we need diversity in our thinking to tackle it effectively."
        },
        {
            "text": "I feel lucky to have the opportunity to work in a roll that is helping to fight climate change. It feels really positive to be working on a project that has the potential to deliver huge benefits to the climate, people and nature."
        }
    ]
}