{
    "url": "https://ruralpayments.blog.gov.uk/2022/05/05/advice-for-rpa-customers-experiencing-issues-with-bps-applications/",
    "title": "Advice For RPA Customers Experiencing Issues with BPS Applications",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Basic Payment Scheme"
    ],
    "pub_date": "2022-05-05T16:30:05+01:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "The Rural Payments Agency (RPA) are aware that some customers are experiencing issues with their Basic Payment Scheme (BPS) applications ahead of the deadline on 16 May 2022."
        },
        {
            "text": "RPA has received reports of customers who have identified irregularities in the land data captured on their online BPS declaration, which could result in incorrect submission, and to land parcels being declared incorrectly on customers’ applications with a zero activated (claimed) area."
        },
        {
            "text": "RPA would urge customer to remind themselves of the BPS guidance on How To Apply for BPS in 2022 in particular the Check your information and Change anything that needs updating sections."
        },
        {
            "text": "After making any changes that may be required to land parcel information shown on the ‘land use’ screen, and before submitting their BPS application, customers must go on to open the ‘Activate less BPS area’ screen. This screen displays the information that will be used to create the BPS application and any changes made on the land use screen will not be included in the BPS application until it has been opened."
        },
        {
            "text": "At this stage in the application process, customers should also check the activated (claimed) area (column C8) of the ‘Activate less BPS area table/screen) for all of the land parcels they have declared as part of the application. If there is an error, this can usually be corrected by over-writing the information directly into the ‘Applied for’ column."
        },
        {
            "text": "A land parcel may also have a ‘red hand’ indicator displayed next to it on the ‘Activate less BPS area’ screen. This is a warning that the activated area declared for the parcel is greater than its BPS eligible area and that this needs to be corrected before the application can be submitted.  This can normally be done by checking the information entered for the land parcel on the ‘land-use’ screen and either correcting that information or reducing the declared area to match the correct eligible area of the parcel in the ‘Activate less BPS area’ screen."
        },
        {
            "text": "RPA has identified some cases where the red hand is showing incorrectly this year. This is being corrected on the system but, while this is being done, any customer encountering this error can normally correct it by deleting and re-entering the relevant information on the ‘land-use’ screen (in some cases, it may be necessary to do this more than once) and then re-opening the ‘Activate less BPS area’ screen to ensure the information carries over into the application."
        },
        {
            "text": "If you have already submitted your application for BPS, or submit it before 16 May 2022, you have until 10 June 2022 to check your application for any errors and make any necessary changes without a penalty. If you submit your application after 16 May 2022, you have until 10 June to submit it with a penalty. You can read our Key Dates for 2022 for more information about RPA deadlines."
        },
        {
            "text": "We apologise to anyone who is experiencing this issue and should have it resolved as soon as possible."
        },
        {
            "text": "If you are encountering a different issue, or need further assistance, please get in touch."
        },
        {
            "text": "You can follow us on social media for further updates and information on the following accounts:"
        },
        {
            "text": "By following and subscribing to our social channels and blog, you’ll be able to see the latest updates about important information."
        }
    ]
}