{
    "url": "https://disabilityunit.blog.gov.uk/2022/05/05/david-stanley-bem-disability-and-access-ambassador-for-arts-and-culture/",
    "title": "David Stanley BEM: Disability and Access Ambassador for Arts and Culture",
    "authors": [
        "David Stanley BEM",
        "Disability Unit"
    ],
    "categories": [
        "Raising Awareness"
    ],
    "pub_date": "2022-05-05T17:20:27+01:00",
    "content": [
        {
            "text": "My name is David Stanley and I am the Disability and Access Ambassador for Arts and Culture. My goal is to connect the learning-disabled community across the globe through my original music."
        },
        {
            "text": "I am the founder and CEO of an award-winning international music education and performance charity for disabled people called ‘The Music Man Project’. I help musicians with learning disabilities fulfil their potential through large-scale performances at major concert venues in front of thousands of people."
        },
        {
            "text": " I began in 1999 with just a handful of students and a promise that one day they would play the Royal Albert Hall. Two decades later, I presented 200 learning-disabled musicians from Music Man Projects across the UK at the iconic concert hall to an audience of 3,000 people in my own production called ‘Music is Magic’. "
        },
        {
            "text": "The Music Man Project has:"
        },
        {
            "text": "Since my appointment as Disability and Access Ambassador, my students have also appeared on TV and radio, further strengthening their status as much-needed role-models for people with learning disabilities.  "
        },
        {
            "heading": 3,
            "text": "Why do you think it’s important to have Disability and Access Ambassadors? "
        },
        {
            "text": "My focus as Disability and Access Ambassador is to enable people with learning disabilities to access grassroots Arts and Culture as creative contributors, as well as public consumers. "
        },
        {
            "text": "The general public tends not to be aware of what people with learning disabilities can achieve as expressive artists and, as a result, there are very few opportunities for them to showcase their talents or fulfil their ambitions in Arts and Culture settings. Marking achievements, promoting concerts and events, and pushing for learning disabled representation at high-profile events and occasions is an important element to my ambassadorship. I provide a platform and opportunity for them to reverse perceptions. "
        },
        {
            "text": "It is important that government, businesses, care providers, families and individuals affected by disability can all draw upon the passion, expertise, experience and extensive networks that characterise all of the Disability and Access Ambassadors across 19 sectors. We are beacons of hope and opportunity for a more accessible and equal society. "
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "What do you like about the role? "
        },
        {
            "text": "This has led to the opportunity to explore access to other cultural services beyond music, such as museums, galleries and libraries. "
        },
        {
            "text": "I have also been able to volunteer as an advisor for the new National Plan for Music Education, working with the Department of Education and the Department for Culture, Media and Sport. It was a privilege to represent the interests of pupils with SEND, and I hope my efforts result in more musical opportunities for children and young people. "
        },
        {
            "text": "I have also enjoyed working with the Arts industry, performances venues and the private sector. There is a great deal of determination to improve prospects for disabled people across all sectors. The challenge now is to turn that good will into action."
        },
        {
            "heading": 3,
            "text": "What's one thing you wish people knew about the role or working in this field? "
        },
        {
            "text": "I was awarded the British Empire Medal in the 2021 New Year’s Honours List for my service to people with Special Needs over two decades. "
        },
        {
            "text": "I hope my ambassadorship encourages high expectations in every aspect of disability access, and shows what disabled people can offer – not just what they need. This is best summed up by the following anecdote shared during my Churchill research visit to America in 2019:"
        },
        {
            "text": "“An audience member once attended a concert in New York featuring musicians with disabilities. He only went as a favour for a friend and expected to feel nothing but pity for all the performers. After a few moments he felt like there was a mirror rising in front of his eyes and he quickly realised it was himself he was pitying. From that moment on he changed his view of people with disabilities.” "
        },
        {
            "text": "Without high expectations there is no concert. There is no mirror."
        },
        {
            "text": "- David Stanley BEM MMus BMus PGCE NPQH CF FRSA"
        }
    ]
}