{
    "url": "https://educationhub.blog.gov.uk/2022/05/everything-you-need-to-know-about-sats/",
    "title": "Everything you need to know about SATs",
    "authors": [
        "media officer"
    ],
    "categories": [
        "Exams and qualifications",
        "Key Stage Two Tests"
    ],
    "pub_date": "2022-05-05T16:58:17+01:00",
    "content": [
        {
            "text": "This month most pupils in year six will take the key stage 2 (KS2) national curriculum tests – commonly known as SATs."
        },
        {
            "text": "These tests, alongside teacher assessment of English writing and science, are used to measure school performance and to make sure individual pupils have the support that they need as they move into secondary school."
        },
        {
            "heading": 3,
            "text": "Why are SATs going ahead this year? "
        },
        {
            "text": "As national curriculum tests were suspended for the last two years, we have yet to understand in detail the full impact of the Covid-19 pandemic on pupils’ learning."
        },
        {
            "text": "That is why we took the decision that a full programme of primary assessments will take place this year."
        },
        {
            "text": "The data will provide vital information to parents about their child’s attainment, support the transition to secondary schools, and identify where additional support is best targeted to individuals."
        },
        {
            "heading": 3,
            "text": "Will these SATs differ to those pre-pandemic?"
        },
        {
            "text": "No. Primary school tests and assessments will be returning for the first time since 2019 without any adaptations."
        },
        {
            "text": "We need the standards in the tests to remain the same so we can understand the extent of any impact on pupils compared with the situation before the pandemic."
        },
        {
            "text": "The usual primary school performance measures will be produced at school level and shared securely with primary schools, academy trusts, LAs and Ofsted. However, schools’ results for 2021/22 will not be published in performance tables."
        },
        {
            "heading": 3,
            "text": "What will my child be tested on? "
        },
        {
            "text": "If you have a child in year 6, at the end of key stage 2, they will take national curriculum tests in English grammar, punctuation and spelling, English reading and mathematics."
        },
        {
            "heading": 3,
            "text": "Will my child need to revise for these tests?"
        },
        {
            "text": "Teachers will make sure all pupils in their class are prepared for the tests."
        },
        {
            "text": "You should follow their general advice about supporting your child’s education throughout the year and ahead of the tests."
        },
        {
            "heading": 3,
            "text": "What should I do if I feel my child is experiencing anxiety and stress ahead of these tests? "
        },
        {
            "text": "The KS2 assessments only include questions on things that children should already have been taught as part of the national curriculum. As such, children should not be made to feel undue pressure over them."
        },
        {
            "text": "Headteachers make the final decision about whether a pupil participates in the KS2 tests or not. Some pupils (for example, some pupils with special education needs or disabilities) may be assessed under different arrangements. If you have concerns about your child participating in the KS2 tests, you should speak to your school in the first instance."
        },
        {
            "heading": 3,
            "text": "What do these tests look like? "
        },
        {
            "text": "You can find past papers on GOV.UK."
        },
        {
            "heading": 3,
            "text": "How and when will I know how my child has done on the tests?"
        },
        {
            "text": "Before the end of the summer term, your child’s school will send you a report, which will include test results and teacher assessment judgements."
        },
        {
            "text": "This should provide you with a good sense of the standard at which your child is working in each subject."
        },
        {
            "text": "The school will report your child’s test results as a scaled score for each subject. This is created from the number of marks your child scores in a particular test. A scaled score:"
        },
        {
            "text": "If your child is working below the overall standard of the key stage, or they have special educational needs, reporting will be different and you should speak to your child’s teacher for more information."
        },
        {
            "text": "You can also find more information about results at the end of key stage 2 on GOV.UK."
        },
        {
            "heading": 3,
            "text": "Where can I find out more info on SATs?"
        },
        {
            "text": "Your child’s teacher will be able to answer any questions you may have about the tests and teacher assessment judgements."
        },
        {
            "text": "Further information and guidance for schools and parents is also available at www.gov.uk/STA."
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}