{
    "url": "https://defencedigital.blog.gov.uk/2022/05/05/gamification-the-latest-mod-tool-to-aid-cyber-security-awareness/",
    "title": "Gamification, the latest MOD tool to aid cyber security awareness",
    "authors": [
        "Cyber Confident Team"
    ],
    "categories": [
        "Cyber",
        "Cyber Confidence"
    ],
    "pub_date": "2022-05-05T20:37:15+01:00",
    "content": [
        {
            "text": "Cyber security can be a difficult topic to grasp, especially since guidance is often inaccessible containing lots of jargon. As a result some individuals do not know how to mitigate risks and how best to protect themselves."
        },
        {
            "text": "This is an issue since everyone, regardless of their role or level of responsibility, requires baseline knowledge of cyber risk and response. With our growing reliance on technology, and the sophistication and severity of cyber attacks increasing all the time, it is imperative people are engaged through novel and fun ways of learning so they can recognise and respond to cyber incidents appropriately."
        },
        {
            "text": "The MOD’s Cyber Confident Team have been addressing these challenges with initiatives such as ‘Front Liners: Challenge Accepted’. This new exercise aimed to test personnel’s level of cyber security understanding using gameplay."
        },
        {
            "text": "The month-long campaign launched with three online digital games (SITREP, Red Flag and Rapid Fire) each testing different cyber skills."
        },
        {
            "text": " "
        },
        {
            "text": "Since phishing is one of the biggest threats to cyber security, SITREP targeted an individual’s ability to distinguish between genuine communications and phishing attempts."
        },
        {
            "text": "Red Flag placed the player in a virtual office environment where they had to look for clues to identify the owner’s password. The aim was to highlight the shortcomings that some could be guilty of like using passwords related to favourite sports teams or key dates and leaving that relevant information lying around on post-it notes or paperwork."
        },
        {
            "text": "Finally, Rapid Fire was challenging from both a knowledge and speed perspective. With questions spanning a variety of cyber topics, players needed to answer quickly and accurately."
        },
        {
            "text": "The online games received thousands of plays with contestants from across the MOD taking part."
        },
        {
            "text": "The Cyber Confident Team were blown away with the response received with numerous requests for this to be an annual event since it made learning accessible to people with no interest in cyber. It also sparked conversation and competition between colleagues."
        },
        {
            "text": "The campaign culminated with the Front Liners Interservice Final where six finalists competed in various cyber challenges for the title of Front Liners Champion 2022!"
        },
        {
            "text": "Exercises such as this illustrate how we must find new ways of learning to convey serious messages. It is crucial that everyone understands that cyber security always threatens us, at work and in our personal lives."
        },
        {
            "text": "The Cyber Confident Team develops and distributes a variety of materials to inform and educate Defence personnel on cyber security risk and response."
        },
        {
            "text": "If you would like to find out more, listen to our ‘Cyber Sound Bytes’ podcast available on Spotify and Apple Podcasts."
        },
        {
            "text": "Remember, the front line is you."
        }
    ]
}