{
    "url": "https://teaching.blog.gov.uk/2022/05/05/how-we-work-with-our-community-to-tackle-the-root-causes-of-persistent-absences/",
    "title": "How we work with our community to tackle the root causes of persistent absences",
    "authors": [
        "Janice Allen"
    ],
    "categories": [
        "Attendance",
        "Teachers' reflections"
    ],
    "pub_date": "2022-05-05T10:23:23+01:00",
    "content": [
        {
            "text": "Janice Allen is the Headteacher at Falinge Park High School, a mixed community secondary school in Rochdale. Falinge Park has worked closely with a number of local charities to support the school’s drive to improve attendance. "
        },
        {
            "text": "Understanding the root cause of persistent absence "
        },
        {
            "text": "The pandemic has highlighted the important link between school attendance and pupils’ education and progress. As a headteacher, I can see the wide range of issues that affect children’s regular attendance. Often these are complex issues affecting the whole family, with some of the most serious being financial concerns, homelessness or housing insecurity, and in some instances alcohol and substance abuse.  "
        },
        {
            "text": "As a school, we recognise that we need to take action to support families in these situations but we also recognise that we cannot do this alone, and that we do not have the expertise to tackle these issues ourselves. Through our partnership with our local Voluntary, Community and Social Enterprise (VCSE) partnership, we have identified a number of local charities who were best suited to helping us tackle some of these root causes to persistent absence. "
        },
        {
            "text": "Keeping the community at the heart of the school "
        },
        {
            "text": "By building strong relationships with charities locally, we have gained additional support for our work to tackle some of the root causes of absence. We are: "
        },
        {
            "text": "We are still at the start of the journey and I know we have not yet fully realised the potential of these partnerships. I hope, however, that by working with the local community we can better support our children and families.  "
        },
        {
            "text": "Creating a structure that enables a community focused approach "
        },
        {
            "text": "To make sure that this work is embedded in the school, we also support our staff to have the capacity to volunteer and participate in community work. By providing space for staff to undertake this work, we can ensure we are giving back to the community and our children can see the important link between school, home and their local area. There is still a long way to go yet on our attendance journey but this way of working could prove effective in the long run. If we harness the power of our communities and place-based organisations then we can, I believe, address some of the intractable issues that we face in schools.  "
        },
        {
            "text": "Want to receive blog posts in your inbox?\nSign up to receive blog updates"
        }
    ]
}