{
    "url": "https://marinescience.blog.gov.uk/2022/05/05/the-developing-uk-seaweed-industry/",
    "title": "The developing UK seaweed industry",
    "authors": [
        "Elisa Capuzzo"
    ],
    "categories": [
        "Aquaculture"
    ],
    "pub_date": "2022-05-05T11:43:17+01:00",
    "content": [
        {
            "heading": 1,
            "text": "A history of production and a renewed interest"
        },
        {
            "text": "In recent years there has been a resurgence of interest in seaweed. This has been driven by the many uses of seaweed, its high nutritional value, and its ability of providing ecosystem services, such as habitat provision, carbon and nutrient uptake, coastal protection."
        },
        {
            "text": "In the UK, seaweeds have been used for centuries as a food, feed, and soil enricher, playing an important role, particularly for island communities. Around 600 species of seaweed can be found along the UK shore, with brown seaweed, such as kelp and wracks, representing the most abundant seaweed type. However, the size of the seaweed industry and the scale of production in the UK have been fluctuating with peaks and troughs throughout the centuries."
        },
        {
            "text": "For example, during the peak production of the 17th-18th centuries, brown seaweeds were burned to produce soda ash, used in glass and soap production and for bleaching linen. Kelp kilns and kelp houses are still visible today, reminders of the thousands of tons of seaweed that were processed annually. Seaweed harvesting continued at the start of the 19th century for the extraction of iodine, while in the 1970s seaweeds were mainly harvested for production of hydrocolloids, a gelling agent in food and non-food applications. With the turn of the millennium, the industry was going through a ‘trough’ phase until renewed recent interest."
        },
        {
            "heading": 1,
            "text": "Status of the UK seaweed industry in 2016 versus 2021 – has it changed?"
        },
        {
            "text": "Back in 2016, during this new wave of interest in seaweed aquaculture, I was commissioned by Defra to review the status of the seaweed industry in the UK . Summer 2021 was the 5-year mark from the previous study, so I took the opportunity to review the status of the industry with a literature and web search."
        },
        {
            "text": "In 2021, seaweeds were still harvested from the wild in various parts of the UK, mainly at a small-artisanal scale. However, there was an increasing number of commercial seaweed farms being established. For example, in 2016 there was only one commercial seaweed farm in the UK, while currently there are at least 10 active farms, suggesting a shift towards farmed aquaculture sources of seaweed. Yet, there are still no records of total seaweed production for the UK."
        },
        {
            "heading": 1,
            "text": "A growing number of seaweed-businesses and products"
        },
        {
            "text": "The seaweed industry in the UK has expanded in the last decade, with a variety of products now available on the market. Positive press coverage around consumption of seaweed is also helping to corroborate consumers perception of seaweed as a healthy and nutritional food."
        },
        {
            "text": "Seaweed-related businesses in the UK have more than doubled since 2016. In the 2021 review I found at least 74 businesses (harvesting/farming seaweed, processing seaweed and/or providing seaweed-related services), mainly located in England and Scotland and relying on seaweed harvested from the wild in the UK."
        },
        {
            "text": "Rockweed (Ascophyllum nodosum) is the seaweed species most frequently produced or used by seaweed businesses, harvested at a medium to large scale in Scotland and used in several products. Brown seaweed such as kelp and wrack species, e.g. Fucus and Saccharina, and red seaweed such as dulse (Palmaria palmata) and laver (Porphyra spp.) are other important species produced or used by UK businesses."
        },
        {
            "text": "Food and drink are currently the main target market for seaweed products, with around one third of seaweed-related businesses targeting this market. Of the remaining businesses, 19% target the beauty industry, while 13% produce nutraceuticals such as nutrition supplements. Other businesses provide fertilizers, feed and supplements for animals, alginate, bio-packaging, consultancy services etc. Certainly, since 2016, there has been an increased diversification of products and businesses."
        },
        {
            "heading": 1,
            "text": "Future perspectives and challenges for the UK seaweed industry"
        },
        {
            "text": "The seaweed industry in the UK has the potential to thrive and support a range of businesses. Farming of seaweed could contribute towards different ecosystem services, such food provisioning and regulating services. However, for the industry to grow and realise this vision, several knowledge gaps and challenges remain and need to be addressed."
        },
        {
            "text": "Future research and investments should aim to address these challenges which are not exclusive to the UK seaweed industry but are also shared by other countries, such as in Europe. Therefore, collaborations and knowledge exchange between different stakeholders, including industry, academia and government, nationally and internationally, should be encouraged to tackle these knowledge gaps."
        },
        {
            "text": "Further information can be found in my chapter in Sustainable Global Resources Of Seaweeds: Seaweed Industries and Products in the UK: A Brief Review."
        },
        {
            "text": " "
        }
    ]
}