{
    "url": "https://space.blog.gov.uk/2022/05/05/the-night-sky-in-may-2/",
    "title": "The night sky in May",
    "authors": [
        "Derek Smale"
    ],
    "categories": [
        "Astronomy"
    ],
    "pub_date": "2022-05-05T16:57:59+01:00",
    "content": [
        {
            "text": "This month provides a lively meteor shower, a total lunar eclipse, and a conjunction of the planets, as well as the usual array of wonderful astronomical sights that spring brings."
        },
        {
            "text": "Those with binoculars or telescopes can peer even deeper into space and hunt out the numerous and beautiful galaxies that lurk in the spring constellations."
        },
        {
            "heading": 2,
            "text": "Lunar Eclipse"
        },
        {
            "text": "In the early hours of 16 May, the Earth will pass directly between the Sun and the Moon, casting a shadow onto the Moon’s surface."
        },
        {
            "text": "As Earth begins to pass in front of the Moon at around 2.30am, our planet’s atmosphere is first to move into the path of light between the Sun and Moon, causing a ‘penumbra’, or partial blocking of the Sun’s light."
        },
        {
            "text": "The ‘umbral’ shadow, where the Earth itself moves between the Sun and the Moon blocking light from travelling directly from one to the other, will become visible from around 3.30am."
        },
        {
            "text": "‘Totality’, the point where the Moon is fully in Earth’s shadow, occurs around 4.30am just a few minutes before the Moon sets in the south west."
        },
        {
            "text": "While this does mean we won’t get to see the Moon re-emerge from the eclipse in the UK, we will still get to see the phenomenon associated with full lunar eclipses – the reddening of the Moon."
        },
        {
            "text": "While Earth blocks the direct light from the Sun, some light passes through our planet’s atmosphere and is redirected towards the Moon, indirectly lighting the Moon’s surface with a reddish glow."
        },
        {
            "text": "This is because as the light passes through the dust, moisture and gases of our atmosphere, it is predominantly the longer wavelengths of light (those at the red end of the spectrum), that get scattered the least."
        },
        {
            "text": "For this reason, you’ll see the Moon turn a reddish colour as the eclipse progresses towards totality."
        },
        {
            "heading": 2,
            "text": "Planetary Conjunction"
        },
        {
            "text": "The next few weeks provide a wonderful opportunity to see the planets lining up in our morning skies."
        },
        {
            "text": "The month starts with Jupiter and Venus appearing to almost touch, and ends with a close encounter of Jupiter with Mars."
        },
        {
            "text": "In both instances, the planets are actually separated by hundreds of millions of miles, but you’ll need powerful binoculars or a telescope to separate them from our perspective here on Earth, as they rise around an hour before the Sun."
        },
        {
            "text": "Later in the month, the waning moon is a very helpful guide when looking for the planets."
        },
        {
            "text": "It appears to pass close to Saturn on 22 May, Mars and Jupiter on 25 May, and Venus on 27 May. Sharp-eyed observers can also see the Moon as it passes Mercury on 29 May, as the planet closest to our Sun emerges into our morning skies."
        },
        {
            "text": "Be cautious though, especially if using binoculars or a telescope – even the briefest glimpse of the Sun through optics could damage your eyesight and your equipment."
        },
        {
            "text": "Those with binoculars or a telescope may wish to add to this planet-spotting challenge. Distant Uranus, the seventh planet from the Sun, appears to sit almost directly between Mercury and Venus in the last few days of May, despite being some 2.7 billion kilometres (1.7 billion miles) further away."
        },
        {
            "text": "It is a truly remarkable conjunction, as Neptune, the furthest planet from the Sun (since Pluto’s reclassification in 2006) is also in the same patch of sky, sitting just to the right of Jupiter and Mars as they appear to meet in our skies at the end of the month."
        },
        {
            "heading": 2,
            "text": "The Eta Aquarids Meteor Shower"
        },
        {
            "text": "The Eta Aquarids meteor shower is expected to peak around 5-6 May, though there’s a good chance of spotting meteors throughout the month."
        },
        {
            "text": "These meteors are tiny fragments of the notable Comet Halley, colliding with our atmosphere at speeds of over 65 kilometres (40 miles) per second!  Comet Halley’s orbit means it travels into the inner Solar System every 76 years, last passing through in 1986."
        },
        {
            "heading": 2,
            "text": "The International Space Station"
        },
        {
            "text": "As summer approaches, the tilt of our planet means that the Sun doesn’t travel as far below the horizon during our night as it does during winter."
        },
        {
            "text": "As well as bringing us longer daylight hours and lighter nights, being just below the horizon means the Sun is better placed to under-light the International Space Station, as well as the thousands of other satellites in our night sky these days."
        },
        {
            "text": "This means that when the orbit of the ISS brings it over the UK as it will this month, there are more visible passes throughout the night, and May is a great opportunity see the 109m-long, 75m-wide Space Station as it passes over."
        },
        {
            "text": "Visit https://www.heavens-above.com/, and click on ‘ISS’ to get accurate timings of the passes for your location."
        },
        {
            "heading": 2,
            "text": "Space Exploration"
        },
        {
            "text": "The alignment and focusing of the James Webb Space Telescope has now been successfully completed. Final instrument checks will now be undertaken, and it’s hoped the JWST will be fully operational in the coming weeks. You can find more information here."
        },
        {
            "text": "Wishing you clear skies, and good luck if you’re going to try and catch the lunar eclipse!"
        }
    ]
}