{
    "url": "https://buyingforschools.blog.gov.uk/2022/05/05/the-view-my-financial-insights-vmfi-tool-supporting-schools-access-commercial-resources/",
    "title": "The View My Financial Insights (VMFI) tool – Supporting schools access commercial resources",
    "authors": [
        "Anthony McLean, Communications Manager, Improvement and Insight Division"
    ],
    "categories": [
        "Services"
    ],
    "pub_date": "2022-05-05T12:18:36+01:00",
    "content": [
        {
            "text": "Anthony McLean, Communications Manager from the Improvement and Insight Division discusses the View My Financial Insights (VMFI) tool, created to help schools, academies and local authorities to quickly view and understand their financial information, in order to compare and identify areas where they could save money. "
        },
        {
            "text": "Achieving value for money in our schools is vital. Any efficiencies in how schools use their resources can lead to significant impact across the education sector. The Buying for Schools team has pulled together a set of DfE-approved frameworks that could lead to lower costs for schools, but how can schools identify the areas that may lead to the biggest financial savings and, more importantly, how can they assess whether seeking to negotiate a new contract would be worth it?"
        },
        {
            "text": "The View My Financial Insights (VMFI) tool can help schools, academy trusts and local authorities do just that. VMFI provides financial information quickly and in an easy-to-understand format, offering a tailored visual interface to quickly identify areas to investigate by offering comparisons with 30 of the most similar schools. The ultimate aim of VMFI is to make it far easier for users to examine the financial position of their school or trust by providing this automated assessment of their data and a set of helpful starting points to investigate from."
        },
        {
            "text": "So, what can VMFI offer in terms of support with commercial resources, contracts and frameworks?"
        },
        {
            "text": "VMFI compares each of a school’s cost areas to its 30 most statistically similar schools, highlighting where schools are most out of line with their comparators (for full guidance on how this is done, please visit our guidance pages. By identifying these potential areas for improvement, VMFI is able to identify commercial recommendations from across the DfE and suggest various frameworks that might be considered by users.  An example of how this would be displayed is in the image below:"
        },
        {
            "text": "The tool uses the data from your most recent financial return submissions to identify the resources that you may find useful.  These can be accessed through the ‘consider recommendations to reduce costs’ link.  It should be noted though, that there is no stipulation that schools have to adopt any of these suggestions.  The data should be paired with the schools’ financial strategy to determine priorities. We simply aim to provide you with the information to make your own decisions."
        },
        {
            "text": "On VMFI’s ‘recommendations’ screen you can find tailored recommendations based on the areas of greatest variance in spend when compared to similar schools. Multi-academy trust or local authority users can select which schools they would like to view recommendations on from a drop-down menu."
        },
        {
            "text": "The ‘find resources’ page provides links to the list of DfE-approved frameworks for schools, with links to general commercial and financial resources. Examples include the risk protection arrangement (RPA), school business professionals’ network and the full list of DfE-approved frameworks where you can also access the new Get help buying for schools service, which offers free procurement advice and guidance to all state funded schools."
        },
        {
            "text": "Recommendations are provided for each sub-cost category, offering an at-a-glance list of contracts that may be available.  Under the utilities category, for example, we can provide links to frameworks to enable schools to switch energy supplier quickly and easily, move towards renewable energy technologies, or find sources of liquid fuels such as heating oil."
        },
        {
            "text": "Overall, VMFI is working to bring together many of the Department’s frameworks and offer this alongside financial insights as a tailored package for schools, facilitating more effective decision making at a local level. The links to these resources are designed so that you and the senior leadership team can easily access the offer from the Department and examine whether they would be a suitable option for your school."
        },
        {
            "text": "To get started with VMFI you can log in or set up an account here. For more information, visit our user guides. The Better Financial Reporting team are holding monthly webinars to showcase VMFI and to answer any questions you may have. To sign up, please click the links below:"
        }
    ]
}