{
    "url": "https://planninginspectorate.blog.gov.uk/2022/04/06/effective-enforcement-new-outreach-programme-to-help-planners/",
    "title": "Effective Enforcement: New outreach programme to help planners",
    "authors": [
        "Jackie Anderson",
        "Ahsan Ghafoor"
    ],
    "categories": [
        "Appeals",
        "Enforcement"
    ],
    "pub_date": "2022-04-06T12:36:55+01:00",
    "content": [
        {
            "text": "A new outreach initiative aims to share the Inspectorate’s expertise with local planning authority officers and planning agents who deal with enforcement action. Ahsan Ghafoor (Professional Lead for Enforcement) and Jackie Anderson (Operations Lead, Enforcement) explain what the programme comprises and how to sign up for briefings."
        },
        {
            "heading": 3,
            "text": "We are often asked “what is enforcement action?” "
        },
        {
            "text": "It happens when something has been built, or work is taking place that has no permission or is in breach of a planning condition, or there’s a significant change in the use of land or building requiring planning permission."
        },
        {
            "text": "Taking enforcement action against unauthorised development is discretionary. Local planning authorities are required to consider if it’s appropriate to take formal action. If the authority decides to action, it can issue an enforcement notice. There’s a right of appeal against the notice. The appeal is submitted to the Planning Inspectorate."
        },
        {
            "heading": 3,
            "text": "Sharing knowledge for wider benefit"
        },
        {
            "text": "We’ve devised a series of briefings to encourage enforcement best practice among local planning authorities and planning agents."
        },
        {
            "text": "The aim is to mitigate common mistakes so that the process is more effective for all concerned. It is also an opportunity to meet the Inspectorate’s team, ask questions and understand how we can work together."
        },
        {
            "text": "In turn, the Inspectorate hopes to receive better quality enforcement appeal submissions."
        },
        {
            "text": "The briefings will be a mix of in-person seminars and webinars covering:"
        },
        {
            "text": "Please note that we won’t be able to discuss or comment on live casework."
        },
        {
            "heading": 3,
            "text": "How to reserve your place"
        },
        {
            "text": "The briefings are for local planning authority officers or planning professionals who deal with enforcement action."
        },
        {
            "text": "If you (or your colleagues) meet the above criteria, then book a place by completing the briefing registration form."
        },
        {
            "text": "We will then be in touch with joining details."
        },
        {
            "text": "If you’ve already told us you want to attend the sessions, then you don’t need to register again."
        },
        {
            "heading": 3,
            "text": "Briefings for local planning authority officers"
        },
        {
            "text": "The following briefings are relevant to local planning authority officers who deal with investigating alleged breaches of planning controls and take enforcement action."
        },
        {
            "heading": 4,
            "text": "Briefing 1: Professional & operational matters"
        },
        {
            "text": "An introduction to how the Inspectorate operates, overcoming the challenges we all face and what we can do to better work together.  This session is interactive and includes discussion about what to avoid when taking enforcement actions and what a good enforcement notice looks like."
        },
        {
            "text": "Session duration: Approximately 2 hours"
        },
        {
            "heading": 4,
            "text": "Briefing 2: Grounds of appeal and lawful development certificates"
        },
        {
            "text": "What does each ground of appeal mean and the test involved in determining the grounds of appeal. We will explore concepts relevant to “legal” grounds of appeal and lawful development certificates."
        },
        {
            "text": "Session duration: Approximately 1.5 hours"
        },
        {
            "heading": 4,
            "text": "Briefing 3: Getting the best out of appeal procedures"
        },
        {
            "text": "Considers why an enforcement or lawful development certificate appeal follows the written representations, hearing, or inquiry procedure. Explores good practice in enforcement appeal submissions."
        },
        {
            "text": "Session duration: Approximately 1.5 hours"
        },
        {
            "heading": 3,
            "text": "Briefing for planning agents and other planning professionals"
        },
        {
            "text": "This briefing is for planning professionals involved in enforcement appeals."
        },
        {
            "text": "There will be an opportunity for you to meet us and explore smarter ways of working. The session will also provide an introduction to how the Inspectorate operates, overcoming the challenges we all face and what we can do to better work together.  We will also cover grounds of appeal and lawful development certificates, and provide an overview on appeal procedures."
        },
        {
            "text": "We expect to hold in-person sessions in the autumn (dates to be confirmed)."
        }
    ]
}