{
    "url": "https://civilservice.blog.gov.uk/2022/04/06/growing-up-in-an-alien-country-wasnt-easy/",
    "title": "Growing up in an alien country wasn't easy",
    "authors": [
        "Rabia Nasimi, Research and Insights Lead, Afghan Resettlement Team, Department for Levelling Up, Housing and Communities"
    ],
    "categories": [
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Ambitious Civil Service",
        "Policymaking",
        "Uncategorized"
    ],
    "pub_date": "2022-04-06T08:03:09+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Twenty-three years after fleeing Afghanistan’s warzone aged just five years old, Rabia Nasimi tells how she adjusted to a new life and language in London. Now a civil servant, Rabia works in the Afghan Resettlement Team, using her experience to shape migration policy helping refugees."
        },
        {
            "text": "What do you picture whenever you see the word ‘refugee’? A Ukrainian? As war-torn Ukraine fights for survival, world leaders are united in condemning the invasion, but what of the cost to millions of civilians fleeing their homeland? And what is being done to help?"
        },
        {
            "text": "The UK government’s response has included the launch of the ‘Homes for Ukraine’ sponsorship scheme. According to the UNHCR, as of 24 February 2022, there are more than 3.6 million Ukrainian refugees, and this number continues to rise. But this is not a new phenomenon. Not when millions of refugees from around the world seek sanctuary and safety in countries like the UK."
        },
        {
            "text": "Curiously, my story began in Ukraine. But I am not Ukrainian. My parents were studying on a scholarship in Ukraine in the nineties when I was born. My family comes from Afghanistan, another country racked by conflict."
        },
        {
            "text": "I came to the UK with my family in 1999 – this involved difficult and dangerous ordeals along the way when I was just five years old. It was an arduous 3,509-mile journey from Afghanistan to London. "
        },
        {
            "text": "At the time of arrival, we were a family of five and soon after, my youngest sister was born at St Thomas’ Hospital in the heart of London. I barely have memories from my early childhood, perhaps because I subconsciously wanted to bury them. "
        },
        {
            "heading": 4,
            "text": "Journey of integration"
        },
        {
            "text": "Growing up in an alien country wasn’t easy. My parents experienced stress adapting and integrating, and naturally faced difficulties learning a new language, and they’ve really pushed themselves."
        },
        {
            "text": "Luckily, reflecting on our journey of integration (which is still in progress), I am proud that my parents have not only managed to integrate and learn English, but they’re now supporting thousands of other refugees every year through the charity they founded, the Afghanistan and Central Asian Association. Life in the UK gave my parents the dignity, respect, and safety they had hoped for, so they had a strong desire to give kindness and friendship to others in the country they now call home."
        },
        {
            "text": "My siblings and I have been educated at high calibre universities, something which would never have been possible had we stayed in Afghanistan, particularly for us three daughters in a society that shuns education for girls."
        },
        {
            "heading": 4,
            "text": "Taliban takeover"
        },
        {
            "text": "Last summer, when Afghanistan fell to the hands of the Taliban a second time, it was a very difficult time for us - particularly for my parents who had first-hand exposure to their barbaric rule."
        },
        {
            "text": "I was also finding it difficult to work and yearned to find a way to support people inside Afghanistan as well as those that had newly arrived in the UK. At the time, I was working for the Department of Health and Social Care as a Social Researcher, my first role in the Civil Service."
        },
        {
            "heading": 4,
            "text": "Helping refugees"
        },
        {
            "text": "So, when a DHSC colleague who had previously been posted to Afghanistan and moved to the Afghan Resettlement Team told me about an opportunity to join the team, I didn’t hesitate to apply, and was so delighted when I was successful. "
        },
        {
            "text": "My new role meant that I graduated from the Fast Stream two years early through promotion to a senior manager grade.  What often feels surreal is that now I can use my own experiences and cultural understanding of Afghanistan to make critically important contributions to the UK government’s migration efforts to resettle Afghan evacuees."
        },
        {
            "heading": 4,
            "text": "Giving refugees a voice"
        },
        {
            "text": "In my role, I lead a policy research team which aims to place the voice of Afghan arrivals and other key stakeholders at the heart of policymaking. I have found it particularly rewarding visiting newly arrived Afghan families and learning more about how they’re adjusting to their new lives in the UK and their hopes, dreams and fears for the future."
        },
        {
            "text": "For me, joining the Fast Stream was a career change and an entry route into the Civil Service. I’d been working for the volunteer and community sector for several years. Gradually, though, I realised that I wanted to move away from grass-roots delivery to helping to formulate and deliver public policies."
        },
        {
            "heading": 4,
            "text": "A Modern Civil Service"
        },
        {
            "text": "Working within A Modern Civil Service has enabled me to make friends across departments and grades. The work culture has been increasingly digital, flexible, supportive, and fast-paced. I’ve had excellent working relations with my line managers and have been given space and autonomy to lead and develop."
        },
        {
            "text": "I have been and will continue to be a strong advocate for diversity and inclusion so that my story does not remain unique, and that we continue to champion expertise and reflect the country we serve."
        }
    ]
}