{
    "url": "https://forestrycommission.blog.gov.uk/2022/04/06/kickstart-your-career-in-forestry/",
    "title": "Kickstart your career in Forestry",
    "authors": [
        "Gareth Hopkins"
    ],
    "categories": [
        "Careers"
    ],
    "pub_date": "2022-04-06T10:55:04+01:00",
    "content": [
        {
            "text": "It has never been a more exciting time to be in forestry. The government’s target to treble tree planting rates in England during this Parliament, along with the push to use more home-grown timber, means the sector is in the spotlight."
        },
        {
            "text": "Like many industries, the forestry sector has seen a decrease in staff numbers over the past decades which has led to difficulties for many organisations in filling vacant positions. In addition, the current age profile of foresters further highlights the need to address the skills and experience shortfall within the sector."
        },
        {
            "text": "I feel really privileged to be playing my part in the development of a new career pathway into forestry, designed to grow, upskill, and diversify the forestry sector workforce. The Development Woodland Officer programme is a three-year, paid development opportunity for passionate people looking to kickstart their careers in forestry and is open to school leavers, graduates or anyone looking for a change in career direction. It’s jointly led by the Forestry Commission, the University of Cumbria and the Institute of Chartered Foresters and is the first time that a degree-level forestry apprenticeship has been offered in the UK."
        },
        {
            "text": "My role in developing the programme, really builds on my background working within the Forestry Commission Technical Training team and my lifelong passion for training and coaching people to develop new skills and experiences."
        },
        {
            "text": "Reflecting on the offer which we have developed, I can only wish it had been around when I first started in forestry. I know that I would have been beating on the door of the programme. Having started my career in the late 1980’s on a Youth Training Scheme, I understand the value of on-the-job training backed up with academic studies, and the personal commitment and time needed to study part-time later in life for my degree."
        },
        {
            "text": "These passions have helped guide the development of the Development Woodland Officer programme, building on the great work of the Forestry Skills Sector Trailblazers workgroup and my experience in Technical Training, managing the early adoption of the Level 2 apprenticeship in the Forestry Commission in England in 2013."
        },
        {
            "text": "This has led to what I firmly believe is one of the best, if not the best career pathway into forestry for those people starting on their journey to becoming a professional forester. Importantly, it addresses the common problem faced by new entrants in gaining both academic qualifications and real-world experience."
        },
        {
            "heading": 2,
            "text": "So, what is the Development Woodland Officer Programme?"
        },
        {
            "text": "At the core of the Development Woodland Officer programme is the newly developed Professional Forester Apprenticeship. A degree level apprenticeship offers those on the programme the opportunity to not only study for an industry recognised BSc (Hons) qualification but enjoy a mix of 80% on-the-job training and 20% academic studies. This affords the opportunity to practice and hone newly developed skills in the real world, whilst also being ‘paid to learn’."
        },
        {
            "text": "During the course, Development Woodland Officers will benefit from academic studies in forestry management at the University of Cumbria supported by co-delivery in some areas with the Forestry Commission. This learning will take the form of block release studies at one of the University campuses in Cumbria or from the Forestry Commission training centre at Cannock Chase, which works out on average to be one week every two months. Following these learning modules, apprentices will return to their host Forestry Commission team to consolidate their skills in the real world while also engaging in additional on-the-job training."
        },
        {
            "text": "Apprentices will also gain practical experience with up to nine months of wider sector placements to further build their skills and experience, enhancing future employment prospects. Due to the nature of forestry within the UK, these placements could be anywhere within England, but every effort will be made to minimise travel and consider personal circumstances."
        },
        {
            "text": "Upon completion, successful graduates will earn a Professional Forester Apprenticeship (equivalent to Level 6), a BSc (hons) in Forest Management and the potential to gain Chartered Forester status with the Institute of Chartered Foresters."
        },
        {
            "heading": 2,
            "text": "Don’t miss out, apply now!"
        },
        {
            "text": "The Forestry Commission is offering 15 Development Woodland Officer positions in 2022, with the first cohort of officers starting in September, with up to 45 places offered over the next three years. These positions will be with the Forestry Commission Area Teams across England so there will be an opportunity near you - well, close in forestry terms!"
        },
        {
            "text": "Don’t miss your chance to join this exciting new programme, kickstarting your forestry career and playing your part in addressing the twin crisis of the climate emergency and biodiversity loss, while also supporting the vital forestry sector in the UK."
        },
        {
            "heading": 2,
            "text": "Interesting in getting involved with the programme?"
        },
        {
            "text": "The Forestry Commission are also interested in working with partners within the sector to develop the offer on an ongoing basis. If you would like to find out more about the Development Woodland Officer programme or the Professional Forester Apprenticeship, are considering offering apprenticeship positions or would like to offer support with work placements, please contact, either: DWOenquiries@forestrycommission.gov.uk or enquirycentre@cumbria.ac.uk"
        }
    ]
}