{
    "url": "https://defrafarming.blog.gov.uk/2022/04/06/landscape-recovery-your-questions-answered/",
    "title": "Landscape Recovery: your questions answered",
    "authors": [
        "Sophia Parkinson",
        "Sam Burford"
    ],
    "categories": [
        "Payments to restore landscapes and ecosystems"
    ],
    "pub_date": "2022-04-06T13:42:16+01:00",
    "content": [
        {
            "text": "In February, we launched the first round of the Landscape Recovery pilot. Landscape Recovery is 1 of our 3 environmental land management schemes. "
        },
        {
            "text": "In this round, we will fund up to 15 ambitious and impactful projects which focus on delivering species recovery and river restoration on sites of 500-5,000 hectares."
        },
        {
            "text": "Applications for the first round of Landscape Recovery will close on 24 May, so there is still time to develop an application."
        },
        {
            "text": "You can learn more and begin your application on GOV.UK. By clicking ‘Start Now’ at the bottom of that page you will be taken to our eSourcing portal where you can find the guidance on round one. This is the best place to start if you want to understand what’s involved in applying."
        },
        {
            "text": "To support potential bidders, we hosted a webinar to share information on the application process and answer questions from those thinking of applying."
        },
        {
            "text": "Over 450 people attended. "
        },
        {
            "text": "As you can imagine, we received a lot of questions on the day. In this post, we will share the webinar recording and summarise some of the most-asked questions and our replies. "
        },
        {
            "text": "The full list of questions and responses is available on our eSourcing portal to help those who are developing applications."
        },
        {
            "text": "We are looking forward to receiving bids and to working with the successful applicants to deliver some transformational projects."
        },
        {
            "text": "We are confident that we will learn a lot from this first pilot round about how to ensure the scheme works well for farmers and other land managers. We are looking forward to taking these lessons forward as the scheme grows."
        },
        {
            "heading": 2,
            "text": "Watch the webinar"
        },
        {
            "heading": 2,
            "text": "Your questions"
        },
        {
            "heading": 3,
            "text": "Do the 500-5000 hectare sites need to be contiguous? How will you assess contiguity?  "
        },
        {
            "text": "Projects must cover 500 to 5,000 hectares of broadly contiguous (connected) land.  "
        },
        {
            "text": "Contiguity is important for many of the environmental outcomes we seek. However, we recognise that habitats and land ownership in England are sometimes fragmented, so we will take a pragmatic approach to contiguity.  "
        },
        {
            "text": "Project areas can have some gaps, but applicants should demonstrate how any gaps will not compromise the project’s environmental outcomes. We will assess this as part of the ‘project leadership and delivery’ criterion. See the scheme guidance for more information. "
        },
        {
            "heading": 3,
            "text": "Can projects involving regenerative farming apply?"
        },
        {
            "text": "Yes. Projects involving regenerative farming can apply. We recognise that farming can support the delivery of environmental outcomes, for example grazing livestock can help to deliver a mosaic of habitat types and increase biodiversity."
        },
        {
            "text": "Given the scheme is competitive we can’t advise on whether a specific project will be selected, as this will depend on the other bids received. Each Landscape Recovery application will be assessed and scored on its merits using our published selection criteria. Projects are more likely to be successful the bigger the environmental impact they will have, for example by creating or restoring significant areas of habitat."
        },
        {
            "text": "We recommend that potential bidders review the criteria guidance and submit a bid if they think that their project would deliver significant outcomes and score well against the criteria."
        },
        {
            "heading": 3,
            "text": "How much commitment is needed from the land managers at the application stage?"
        },
        {
            "text": "Applicants should confirm that the land managers involved, including tenants and those with rights of common, have been engaged prior to application and are supportive of the project moving forward into project development. "
        },
        {
            "text": "This means your bid should only cover land where the land managers involved have consented to the application being submitted. "
        },
        {
            "text": "The project development phase has been designed to support projects to refine their plans and prepare for implementation. We therefore don’t expect plans to be set in stone at the application stage. Applicants are encouraged to set out how they would use project development funding to refine their plans, for example to determine the optimum location for specific activities."
        },
        {
            "text": "At the end of the project development phase, following discussions on implementation funding, land managers will be able to decide whether they are happy to move ahead with work on the ground."
        },
        {
            "heading": 3,
            "text": "How will you support unsuccessful applicants?"
        },
        {
            "text": "We ideally want to see all interested projects continuing to participate in a suitable scheme. We will signpost relevant opportunities to the unsuccessful applicants and are looking into what further support we can provide. We will also give all applicants the opportunity to help shape the design of future rounds of Landscape Recovery. "
        },
        {
            "heading": 3,
            "text": "Do we need to set up a single legal entity before applying for Landscape Recovery? Why do we need one?"
        },
        {
            "text": "You do not need a single legal entity to be in place to submit an application for Landscape Recovery. "
        },
        {
            "text": "If your project is taken forward, your project development agreement will be between Natural England or the Environment Agency and a single legal entity acting on behalf of your project. This is to ensure that grant funding is managed effectively."
        },
        {
            "text": "The single legal entity could be a land manager or organisation representing the project. We will work with the successful round one applicants during enrolment to identify the best person or entity to sign the project development grant agreement."
        },
        {
            "text": "Our current working assumption is that implementation agreements would also be with a single legal entity acting on behalf of the project, to help safeguard it into the long run. This would not need to be the same legal entity as for the project development agreement. We will discuss the details of this with projects during the project development phase and are open to suggestions regarding the best approach to ensure the longevity of the project."
        },
        {
            "heading": 3,
            "text": "How will Landscape Recovery address the importance of the historic environment?"
        },
        {
            "text": "As part of the ‘longevity’ selection criterion, we will assess how suitable the project would be in the local environmental context. As part of this, applicants will need to demonstrate an understanding of the local area including its character, heritage, and historic features. "
        },
        {
            "heading": 3,
            "text": "Why have you chosen Bravo as your application platform?"
        },
        {
            "text": "We need to host applications for this round on Bravo to comply with relevant procurement legislation. "
        },
        {
            "text": "We are aware that our eSourcing Portal Bravo has limitations. "
        },
        {
            "text": "We will use feedback from this first round of applications to scope how we can improve the application process for future rounds. As part of this we will explore opportunities to develop a more user-friendly application portal for Landscape Recovery. "
        },
        {
            "text": "In the meantime, applicants can watch the recording of the webinar from 1 March for guidance on how to submit an application via Bravo. You can send questions using the ‘Messages’ tab. If you need help with the registration process, or have questions about how to use the portal, you can call 0800 368 4850 or email help@bravosolution.co.uk"
        },
        {
            "heading": 3,
            "text": "Is private funding required for the development phase, the delivery phase or both and is there a minimum required contribution?"
        },
        {
            "text": "The Landscape Recovery project development grant can fund up to 100% of eligible costs for this phase. There is no expectation that applicants should secure private funding for the project development phase."
        },
        {
            "text": "During the project development phase, we will work with projects to agree bespoke funding arrangements for implementation. Landscape Recovery projects will not be fully funded by Defra alone during the implementation phase. We support projects to secure private funding and to ensure that funding from Defra aligns with this. "
        },
        {
            "text": "We have not specified a minimum percentage contribution from private sources in our guidance. Rather we will consider the funding model on a case-by-case basis during the project development phase. "
        },
        {
            "heading": 3,
            "text": " How long do you expect agreements will last? 20 years seems a long time."
        },
        {
            "text": "Our expectation is that project implementation agreements will be long term, for example 20 years plus, with measures such as conservation covenants to secure the benefits and deliver good value for money in the long term. "
        },
        {
            "text": "The terms of these bespoke agreements will be negotiated with the chosen projects during the project development phase. We are open to projects’ proposals for how these could work and could consider shorter agreements in the right circumstances. "
        },
        {
            "text": "Land managers interested in taking shorter term action may want to consider applying to other schemes such as the Sustainable Farming Incentive, Countryside Stewardship and, in due course, Local Nature Recovery."
        },
        {
            "heading": 3,
            "text": "How do I know whether to apply for Landscape Recovery before knowing more information on whether Local Nature Recovery might be more suitable for me?"
        },
        {
            "text": "There are several differences between Local Nature Recovery and Landscape Recovery:"
        },
        {
            "text": "If you think your project could be suitable for Landscape Recovery round one then we suggest you put forward a bid. "
        },
        {
            "text": "As part of the project development phase, we will work with you to explore how a Landscape Recovery implementation agreement could be constructed to align with and complement other funding, including funding from private sources and other government schemes where applicable. One learning objective for the pilots is how we can best design agreements to achieve this."
        },
        {
            "text": "You would be able to decide whether to move ahead with your Landscape Recovery project following these discussions. "
        },
        {
            "text": "This means that joining the Landscape Recovery pilot would not prevent you from joining the Local Nature Recovery scheme in due course alongside or instead of having a Landscape Recovery implementation agreement."
        },
        {
            "heading": 3,
            "text": "What percentage of the Future Farming budget is going to this scheme?"
        },
        {
            "text": "In June 2021 we confirmed that by 2028 we expect funding released from reductions in Direct Payments to be evenly split across farm-level, locally tailored, and landscape-scale investment."
        },
        {
            "text": "The specific percentage of the budget going to the Landscape Recovery scheme is to be confirmed, and the suggested profile of the Future Farming budget was only ever indicative. We are keeping this under review so that we are best able to meet our priority outcomes."
        },
        {
            "heading": 3,
            "text": "When will you confirm the round 2 themes? "
        },
        {
            "text": "We will confirm the proposed theme(s) for the second round later this year. Subscribe to the blog for updates."
        }
    ]
}