{
    "url": "https://teaching.blog.gov.uk/2022/04/06/national-professional-qualification-for-headship-empowering-leaders-to-make-positive-change-in-schools/",
    "title": "National Professional Qualification for Headship: empowering leaders to make positive change in schools",
    "authors": [
        "Laura Fordham"
    ],
    "categories": [
        "Professional Development"
    ],
    "pub_date": "2022-04-06T14:24:04+01:00",
    "content": [
        {
            "text": "Laura Fordham is a senior trust consultant for English at HEART Academies Trust. Laura oversees staff wellbeing, teaching and learning development as well as English at Bedford Academy. She is currently taking a National Professional Qualification for Headship (NPQH)."
        },
        {
            "text": "As an aspiring headteacher, it’s important to me to equip myself with the tools I need to create an effective school culture and help all staff deliver our school’s mission. On a personal level, I also want to deliver change confidently and consistently, while inspiring more women to become headteachers."
        },
        {
            "text": "Taking an NPQH seemed a great fit for me. It would develop my skills in managing the curriculum, teaching and learning, behaviour management and professional development. It also appealed as it’s delivered by school leaders and experts and has thriving peer-to-peer support which will help me to gain a greater understanding of leadership concepts and change management."
        },
        {
            "heading": 2,
            "text": "NPQs and my leadership journey"
        },
        {
            "text": "I’ve previously completed an NPQ in middle leadership (NPQML), which developed my confidence, leadership skills and ability to lead a large team. I then completed an NPQ in senior leadership (NPQSL), which improved my knowledge of strategic planning and management across different projects."
        },
        {
            "text": "NPQSL built on what I learned in NPQML, and together, they made me feel more empowered to make positive changes in my school. Change can be difficult! Getting buy-in from staff, outlining visions, planning and implementation aren’t always skills we get a chance to practise regularly in the classroom but that doesn’t mean they aren’t important. My NPQs helped me understand the nuance behind making changes in school and made a big difference to how I delivered them."
        },
        {
            "heading": 2,
            "text": "Why now?"
        },
        {
            "text": "After a challenging two years for teachers and students, it’s clear how important effective leaders and teachers are – it’s perhaps the single most important factor we can control."
        },
        {
            "text": "As we move out of the pandemic, we have a real opportunity to lead schools towards a brighter future with expert teachers focused on making sure that all children get a great education. Whatever stage of your career you’re at, in my experience an NPQ can help you build the skills you need. And, as all of the NPQs are available for free, they’re a really accessible and attractive opportunity for all teachers that give you so much more than a short CPD course can."
        }
    ]
}