{
    "url": "https://buyingforschools.blog.gov.uk/2022/04/06/schools-and-academies-show-april-2022/",
    "title": "Schools and Academies Show – April 2022",
    "authors": [
        "Catherine Kelsall, Stakeholder and Engagement Lead"
    ],
    "categories": [
        "Events"
    ],
    "pub_date": "2022-04-06T14:04:27+01:00",
    "content": [
        {
            "text": "Catherine Kelsall, Stakeholder and Engagement Lead for the Schools Commercial Team at the Department for Education (DfE) tells us more about the upcoming Schools and Academies Show on 27 and 28 April."
        },
        {
            "text": "Hello, I’m Catherine Kelsall, Stakeholder and Engagement Lead in the DfE’s School Commercial Team. Back in November 2021 our team was at the live Schools and Academies Show in Birmingham. It has been amazing to get back to face-to-face events and meeting people after such a long time."
        },
        {
            "text": "It has been great talking to school business professionals again, meeting some familiar faces and meeting new school colleagues too. By day two it felt like we’d never been away due to the pandemic, as we easily picked up the conversations, hearing about the challenges and rewards from the sector. I am looking forward to this year’s show and  I’m hoping that you will be able to make it to the Schools & Academies Show Agenda on| 27 April 2022."
        },
        {
            "text": "Along with my colleagues, I will be in the Government Village, so please come along and say hello."
        },
        {
            "text": "We have some great sessions lined up. We can’t wait to tell you all about our new Get help buying for schools service that went live in February this year."
        },
        {
            "text": "Before joining the Department for Education (DfE) I was a school business manager with over 24 years’ experience of working in a special needs primary school. I was an associate governor at the school and so I’m very familiar with the challenges special schools face. On joining the DfE I was instrumental in driving forward a network for school business professionals in special schools, which led to the launch of National Network of Special Schools (NNoSS)."
        },
        {
            "text": "I’m really excited to be joined in the SEND Theatre at the show by Pauline Aitchison who is lead for NNoSS, to present a session on the power of networking. NNoSS is a network whose members understand and can help with the unique challenges faced within special schools."
        },
        {
            "text": "If you work in a special school, please come along - I’d really like to meet you and see if there is any support our team can offer you. Pauline has also kindly agreed to stay and will be available if you want to talk to her about the benefits of NNoSS and how to join the network. For more information and how to join visit NNOSS website."
        },
        {
            "text": "If you can’t make it to the Schools and Academies Show, Pauline is hosting the second annual NNoSS conference in Nottingham 28 April 2022. Dr Carrie Grant MBE is a keynote speaker."
        },
        {
            "text": "We will also be holding two smaller workshops in the DfE Theatre on the Schools Buying Programme and Schools Water Strategy."
        },
        {
            "text": "On 28 April, the day after the live event in London, the Schools and Academies Show Extra will provide an opportunity to listen to pre-recorded sessions online. I’m pleased to say that we have been able to secure a couple of fantastic sessions for you to enjoy virtually."
        },
        {
            "text": "I know from conversations with schools of the ever-present challenges you face managing cyber security. Our colleagues from the Risk Protection Arrangement  (RPA) will run a session on the new cyber security cover available to schools. If you are considering membership for your school, or are interested to know more about the benefits of this alternative to commercial insurance, don’t miss this session."
        },
        {
            "text": "You can also find out more about how to make your school more water efficient and hear more about reducing flood risk and sustainable drainage systems."
        },
        {
            "text": "Registration is free and all the session for each day can be booked via the Schools and Academies website. "
        },
        {
            "text": "On behalf of the Engagement and Outreach Team, I want to express how much we are looking forward to seeing you and discussing how we can support your procurement."
        },
        {
            "text": " "
        },
        {
            "text": "Here are the full details of all of our sessions at The Schools and Academies Show:"
        },
        {
            "heading": 3,
            "text": "Wednesday 27 April – ExCel London "
        },
        {
            "text": "Get help buying for schools with the DfE Schools Commercial Team "
        },
        {
            "text": "10:00 - 10:30, Business and Finance Theatre"
        },
        {
            "text": "Our speakers are:"
        },
        {
            "text": "This session will:"
        },
        {
            "text": " "
        },
        {
            "text": "Supporting SEND: The power of the network"
        },
        {
            "text": "11:40 - 12:10, SEND Theatre"
        },
        {
            "text": "Our speakers are:"
        },
        {
            "text": "This session will cover:"
        },
        {
            "text": " "
        },
        {
            "text": "DfE Theatre workshops with the Schools Commercial Team"
        },
        {
            "text": "11:40-12:00: Schools Buying Programme "
        },
        {
            "text": "Come along to this session and find out more about the services and guidance available to help those responsible for buying goods and services in schools. ​"
        },
        {
            "text": "Get first hand details of the support available now, including details of the new Get help buying for schools service to help you get the best possible value of your school"
        },
        {
            "text": " "
        },
        {
            "text": "13:10-13:30: Schools Water Strategy  "
        },
        {
            "text": "Come along and join in the discussion on how the DfE’s Schools Water Strategy can work with and support your school to save money and support climate change actions. ​"
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Thursday 28 April - online"
        },
        {
            "text": "Schools Commercial Team – Helping your school with cyber"
        },
        {
            "text": "28 April 2022 – online"
        },
        {
            "text": "Our speakers are:"
        },
        {
            "text": "This session will:"
        },
        {
            "text": " "
        },
        {
            "text": "Schools Commercial Team – How to make your school water efficient"
        },
        {
            "text": "28 April 2022 - online"
        },
        {
            "text": "Our speakers are:"
        },
        {
            "text": "This session will introduce the school’s water strategy and in particular, the support the team can provide to your school including:"
        }
    ]
}