{
    "url": "https://educationhub.blog.gov.uk/2022/04/06/what-you-need-to-know-about-the-holiday-activities-and-food-haf-programme-2/",
    "title": "What you need to know about the Holiday Activities and Food (HAF) programme / Що ви маєте знати про Програму канікулярних заходів та харчування (HAF)",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Holidays",
        "Schools"
    ],
    "pub_date": "2022-04-06T12:05:49+01:00",
    "content": [
        {
            "text": "The Holiday Activity and Food Programme (HAF) has been supporting children and families in the school holidays since 2018."
        },
        {
            "text": "Here is everything you need to know about the programme and how it could help you and your child during school holidays."
        },
        {
            "heading": 3,
            "text": "What is the Holiday Activity and Food programme?"
        },
        {
            "text": "The HAF programme provides healthy food and enriching activities to children and young people, with free places available for those on free school meals during some of the school holidays."
        },
        {
            "text": "The programme will kick off this year over the Easter holidays and will also run through the summer and Christmas school holidays in 2022. The scheme funded by the Government and delivered by local councils, and has been running since 2018, with an expansion to all local councils in England in 2021. This year over £200 million will again be made available to councils across the country."
        },
        {
            "text": "This programme builds on our previous successful pilots: In 2020, it operated across 17 local authorities, supporting around 50,000 children. Last summer (2021) more than 600,000 children took up a free, government-funded place at a HAF club."
        },
        {
            "text": "Why is it so important?"
        },
        {
            "text": "School holidays can be a particularly difficult time for some families due to increased food and childcare costs and reduced incomes. It can mean that families struggle to provide food and activities for children."
        },
        {
            "text": "Good nutrition is essential to children’s health, development and their ability to fulfil their potential in life. This funding helps ensure that eligible children have access to healthy food and as well as fun, enriching activities to help keep them active throughout the school holidays."
        },
        {
            "text": "Families who take part in the programme will also be able to develop their understanding of nutrition and food budgeting by having access to information and support."
        },
        {
            "text": "Most children who took part in HAF last summer (2021) reported overwhelming benefits on their physical activity, higher levels of participation in activities and increased social interaction with their peers. More than three-quarters (77%) of children surveyed also said that attending clubs increased their confidence."
        },
        {
            "heading": 3,
            "text": "How does the programme work?"
        },
        {
            "text": "HAF is funded by Government and run by councils who help deliver the holiday clubs."
        },
        {
            "text": "Some councils may coordinate the clubs and others may to work with another organisation to provide clubs for children locally."
        },
        {
            "text": "Clubs will offer engaging and enriching activities such as arts, sports, drama, and music which provide opportunities to develop and strengthen skills or knowledge."
        },
        {
            "text": "Activities on offer can also include trips and other valuable learning experiences. Clubs must also provide healthy free meals, nutritional education, and physical activities on a daily basis."
        },
        {
            "heading": 3,
            "text": "Who can benefit from the programme and how can I get involved?"
        },
        {
            "text": "HAF is primarily for children in primary or secondary school who receive benefits-related free school meals, though councils do have some flexibility to provide free access to other children."
        },
        {
            "text": "We also encourage councils to make the holiday clubs available to any children not eligible for and in receipt of free school meals, who can pay to attend."
        },
        {
            "text": "We want all children who attend the programme to benefit from:"
        },
        {
            "text": "For information on how you and your family can get involved, please contact your local council."
        },
        {
            "heading": 2,
            "text": "Що ви маєте знати про Програму канікулярних заходів та харчування (HAF)"
        },
        {
            "text": "У рамках Програми канікулярних заходів та харчування (HAF), яка працює з 2018 року, надається підтримка дітям та їх родинам під час канікул."
        },
        {
            "text": "Тут ви знайдете все, що ви маєте знати про цю програму і про те, яка допомога пропонується вам і вашій дитині під час шкільних канікул."
        },
        {
            "heading": 3,
            "text": "Що таке Програма канікулярних заходів та харчування?"
        },
        {
            "text": "У клубах HAF дітям та підліткам пропонується здорова їжа та програма заходів, а тим, хто отримує безкоштовне харчування під час навчального року, надаються безкоштовні місця у Програмі під час шкільних канікул."
        },
        {
            "text": "Цього року Програма розпочалася під час Великодніх канікул, а також проводитиметься під час літніх та Різдвяних шкільних канікул у 2022 році. Ця програма, яка фінансується урядом і виконується місцевими радами, працює з 2018 року, а у 2021 році була поширена на територію всіх місцевих рад в Англії. Цього року місцевим радам буде знов надано понад 200 млн фунтів стерлінгів."
        },
        {
            "text": "Ця програма спирається на успіх попередніх пілотних проектів: у 2020 році вона працювала на території 17 місцевих органів владі, й в її рамках було надано підтримку 50 000 дітей. Минулого літа (2021 р.) понад 600 000 дітей отримали безкоштовні місця у клубах HAF за фінансової підтримки уряду."
        },
        {
            "text": "Чому це так важливо?"
        },
        {
            "text": "Шкільні канікули можуть бути особливо важким часом для деяких родин через підвищення витрат на харчування та догляд за дітьми, а також через зменшення доходів. Таким чином, родини не в змозі забезпечити харчування та зайняти дітей."
        },
        {
            "text": "Повноцінне харчування має велике значення для здоров'я, розвитку та здібності дітей повністю розвинути свій потенціал. Надання фінансування забезпечує, щоб нужденні діти мали доступ до здорової їжі, а також до цікавих, розвиваючих заходів, які займатимуть їх протягом шкільних канікул."
        },
        {
            "text": "Родини, які беруть участь у цій програмі, також зможуть покращити своє розуміння повноцінного харчування та планування витрат на їжу завдяки доступу до інформації та підтримки."
        },
        {
            "text": "Більшість дітей, які взяли участь у програмі HAF минулого літа (2021 р.), повідомляли про величезну користь в плані фізичної активності, активнішої участі у заходах та підвищення соціальної взаємодії з однолітками. Понад три чверті опитаних дітей (77%) також стверджували, що відвідування клубів сприяло підвищенню їхньої впевненості у собі."
        },
        {
            "heading": 3,
            "text": "Як працює ця програма?"
        },
        {
            "text": "Програма HAF фінансується за кошти уряду і реалізується місцевими радами, які допомагають створювати канікулярні клуби."
        },
        {
            "text": "У деяких випадках місцева рада координує роботу клубів, у інших — працює зі сторонніми організаціями над відкриттям місцевих клубів для дітей."
        },
        {
            "text": "У клубах пропонуються цікаві розвиваючі програми для дітей, як-от мистецькі, спортивні, драматичні та музичні, які надають їм можливості для розвитку та вдосконалення навичок або знань."
        },
        {
            "text": "Серед заходів, що пропонуються, є подорожі, екскурсі та інші корисні навчальні заходи. Клуби також повинні запроваджувати безкоштовне харчування, а також проводити просвітні програми з харчування та заняття спортом на щоденній основі."
        },
        {
            "heading": 3,
            "text": "Хто і як може брати участь у цій програмі?"
        },
        {
            "text": "Програма HAF в першу чергу пропонується для дітей, які навчаються у початковій або середній школі та отримують безкоштовне харчування у школі у рамках соціальної допомоги, однак місцеві ради до певної міри можуть приймати рішення щодо надання безкоштовного доступу іншим дітям."
        },
        {
            "text": "Ми рекомендуємо місцевим радам відкривати доступ до канікулярних клубів для дітей, які не отримують безкоштовного харчування в школі, і можуть платити за участь."
        },
        {
            "text": "Ми хочемо, щоб усі діти, які беруть участь у цій програмі, могли отримати користь від:"
        },
        {
            "text": "Щоб отримати інформацію про те, як ви та ваша родина можете долучитися до цієї програми, звертайтеся до місцевої ради."
        }
    ]
}