{
    "url": "https://gfie.blog.gov.uk/2025/12/12/a-second-career-for-the-armed-forces-community/",
    "title": "A Second Career for the Armed Forces Community",
    "authors": [
        "karlharvey1"
    ],
    "categories": [
        "agreatplacetoworkforveterans",
        "Break down barriers to opportunity",
        "Life Chance Recruitment",
        "Military Spouses & Partners",
        "Veterans"
    ],
    "pub_date": "2025-12-12T09:00:47+00:00",
    "content": [
        {
            "text": "The Ministry of Justice (MoJ) is proud to announce the upcoming launch of the Advance into Justice (AIJ) scheme, a dedicated recruitment initiative designed to support Armed Forces service leavers, veterans, reservists, and their spouses or civil partners in transitioning to meaningful careers within HM Prison and Probation Service (HMPPS).   The AIJ scheme will launch in 2 phases:"
        },
        {
            "heading": 3,
            "text": "What is Advance into Justice?"
        },
        {
            "text": "AIJ is a recruitment programme that recognises the transferable skills, resilience, and discipline of the Armed Forces community. It offers a dedicated route into operational roles across prisons and probation, providing tailored support throughout."
        },
        {
            "text": "Successful applicants will be given a 2-year fixed -term appointment, under exception 2 of the Civil Service Commission’s Recruitment Principles with the opportunity to convert to permanency after completing 12 months in post."
        },
        {
            "heading": 3,
            "text": "Why is Advance into Justice important?"
        },
        {
            "text": "Advance into Justice has strategic importance as it shows the MoJ’s commitment to the Veterans Strategy Action Plan and the Armed Forces Covenant and has societal impact in supporting the Armed Forces community beyond just providing employment."
        },
        {
            "text": "Additionally, it forms part of MoJ’s approach to meet the ambition that 5% of our Administrative Officer / Executive Officer or equivalent grade roles are recruited through the Going Forward into Employment pathways."
        },
        {
            "text": "The government offers incentives to employ veterans upon their exit from the Armed Forces and hiring service leavers and veterans means the MoJ can benefit from a reduction in the amount of Employer National Insurance payable for each eligible veteran for up to 12 months employment."
        },
        {
            "heading": 3,
            "text": "What makes Advance into Justice unique?"
        },
        {
            "text": "Advance into Justice has been designed to be a scheme which supports the needs of candidates. The unique selling point of AIJ is that Service Leavers can defer their start date by up to 12 months, to align with their Armed Forces leaving date."
        },
        {
            "text": "This takes a significant pressure and anxiety away from applicants who know they have a firm job offer to walk into when they exit the Armed Forces."
        },
        {
            "text": "Across our website and marketing material, we have showcased current staff from across the tri-services who have found a career with the MoJ. They include Emma, an Army veteran who has found her second career as a probation officer, Paul, who after a struggle to settle after leaving the military found purpose and progressed to a Prison Custodial Manager and Holly, who found a career that provided the flexibility she needed as a military spouse. To view these stories and others, visit the AIJ website."
        },
        {
            "text": "Applicants are supported by a dedicated team throughout the recruitment process. They are linked into the MoJ Armed Forces network and have an Armed Forces ally when they start in post."
        },
        {
            "heading": 3,
            "text": "How do you apply? "
        },
        {
            "text": "Advance into Justice vacancies can be found on the Justice Jobs page and to find out more please visit the  Advance into Justice website."
        }
    ]
}