{
    "url": "https://mhclgdigital.blog.gov.uk/2025/12/12/how-collaboration-and-innovation-came-together-to-tackle-homelessness-and-rough-sleeping/",
    "title": "How collaboration and innovation came together to tackle homelessness and rough sleeping",
    "authors": [
        "AI for Local Government Team"
    ],
    "categories": [
        "Artificial Intelligence",
        "Innovation"
    ],
    "pub_date": "2025-12-12T10:13:33+00:00",
    "content": [
        {
            "text": "Birmingham's Millennium Point became the hub for something rather special a couple of weeks ago: the Local Government Innovation Hackathon on Homelessness and Rough Sleeping. "
        },
        {
            "text": "Over 2 days, over 150 colleagues from local councils, central government, the private sector and academia gathered to design bold solutions for one of our most pressing social challenges. "
        },
        {
            "heading": 2,
            "text": "The hackathon idea "
        },
        {
            "text": "If you're unfamiliar with the term, a hackathon is an intensive collaborative event where people come together to solve problems creatively. Participants form teams, share ideas, and develop practical solutions in a short timeframe –  in this case, 2 days. It's about bringing diverse perspectives together and encouraging rapid innovation. "
        },
        {
            "text": "Participants were given an option of 3 challenge statements to tackle in their teams. They were: "
        },
        {
            "heading": 2,
            "text": "A collaborative approach to a complex challenge "
        },
        {
            "text": "The event, organised by the Ministry of Housing, Communities and Local Government (MHCLG), GDS Local, the Local Government Association and Birmingham City Council showed the power of partnership. Birmingham City Council and West Midlands Combined Authority brilliantly hosted us, whilst AWS – one of MHCLG’s cloud computing partners – provided  technical support throughout. "
        },
        {
            "text": "Minister Samantha Dixon captured the spirit perfectly in her address to participants: "
        },
        {
            "text": "The government has made it a priority to get back on track to ending homelessness, with a record investment of more than £1 billion this year. But as Minister Dixon emphasised:  "
        },
        {
            "text": "Day 1 kicked off with scene-setting talks, including from Emily Middleton, providing an overview of Government Digital Service's (GDS's) ambitions under the blueprint for modern digital government. Hayley Prime from Birmingham City Council also  provided invaluable local context on the homelessness challenge.  "
        },
        {
            "text": "We then heard from Clara Barnett, Deputy Director for MHCLG's AI for Local Government team, who explained the importance of using AI responsibly: taking a ‘do no harm’ approach, the importance of being problem-driven and not losing sight of both the human in the loop and the humans within these services. "
        },
        {
            "text": "Armed with this context, teams spent the day collaborating intensively to co-create solutions. "
        },
        {
            "text": "The energy in the room on day 2 was infectious. Teams brainstormed, prototyped, and refined their ideas, before presenting to a judging panel that included senior civil servants and local government colleagues. "
        },
        {
            "heading": 2,
            "text": "A winning solution "
        },
        {
            "text": "The winning project showed what can happen when you bring together a range of people to form a cross-sector approach.  "
        },
        {
            "text": "Team Match demonstrated a prototype solution that caught the judges'  attention – using AI to match people with accommodation. This would match people much more quickly, and increase suitability, and overall reduce the time people spend in emergency and temporary accommodation. Their solution included an AI transcription element and even learned from matched data to improve success rates over time.  "
        },
        {
            "text": "Read this recent blog post on the GDS channel to learn more about Team Match’s winning project. "
        },
        {
            "text": "The winning team will present their ideas to Ministers from MHCLG and the Department for Science, Innovation and Technology in the new year – a fantastic opportunity to influence how we tackle homelessness at the highest levels. "
        },
        {
            "heading": 2,
            "text": "Immediate impact "
        },
        {
            "text": "Colleagues working in homelessness and rough sleeping policy in MHCLG are already exploring how to integrate ideas generated at the event into ongoing policy work.  "
        },
        {
            "text": "MHCLG is also looking at how the ideas from the event intersect with the  outcomes of MHCLG’s recent Temporary Accommodation discovery, led by the AI for Local Government team, to drive change in this space, and building them into their future thinking.   "
        },
        {
            "text": "The hackathon has shown the potential to transform how the government delivers for its citizens in some specific areas and instances. MHCLG will continue to explore opportunities to responsibly use AI to help tackle homelessness. "
        },
        {
            "text": "The hackathon demonstrated what's possible when we embrace innovation whilst staying grounded in the public service values of fairness, transparency and accountability. "
        },
        {
            "text": "Tom Smith, one of the judges and Director of AI at MHCLG said: "
        },
        {
            "text": "To everyone who participated, hosted, supported or judged: thank you for bringing your creativity, passion, and expertise to this vital challenge! "
        }
    ]
}