{
    "url": "https://naturalengland.blog.gov.uk/2025/12/12/natural-englands-chief-scientist-reflects-on-the-science-evidence-and-analysis-for-nature-recovery/",
    "title": "Natural England’s Chief Scientist reflects on the Science, Evidence and Analysis for nature recovery",
    "authors": [
        "Professor Sallie Bailey FICFOR, BES"
    ],
    "categories": [
        "Biodiversity Net Gain",
        "Climate change",
        "Connecting People with Nature",
        "Development",
        "Education",
        "Evidence",
        "Flood Management",
        "Green Infrastructure",
        "Growth",
        "Monitoring",
        "Natural England",
        "Nature",
        "Nature Recovery",
        "Science and evidence"
    ],
    "pub_date": "2025-12-12T14:54:30+00:00",
    "content": [
        {
            "text": "By Professor Sallie Bailey, FICFOR, BES"
        },
        {
            "text": "On 4 December, the Royal Armouries in Leeds hosted some leading voices in nature recovery. Thought leaders and innovators from environmental NGOs, academia, finance, infrastructure and local government joined Natural England at our Science, Evidence & Analysis for Nature Recovery conference to discuss our science and consider how we might work together to drive nature recovery into the future."
        },
        {
            "text": "At the conference we launched Natural England's Science, Evidence & Analysis Framework 2025-2030, our roadmap for embedding robust science and evidence into decision-making, to ensure our strategy is powered by science. Speakers and panellists challenged and inspired us with thought-provoking insights, highlighting opportunities to drive innovation for nature recovery."
        },
        {
            "heading": 4,
            "text": "Nature Recovery"
        },
        {
            "text": "Opened by Marian Spain, Natural England's Chief Executive Officer, the day began with Sir John Lawton CBE urging us to think bigger. He reminded us that small, incremental changes would be insufficient to deliver the scale of transformation needed for genuine nature recovery. Bold action, matching the urgency of the challenge, is essential."
        },
        {
            "text": "John made clear that recovery is not something any organisation can achieve alone. Strong partnerships across government, environmental NGOs, business, academia, and local communities will be vital if we are to recover nature and secure its place at the heart of our future."
        },
        {
            "text": "We heard about Natural England’s cutting-edge work, from using eDNA to track and monitor species with Dr Katie Clark, to the application of AI increasing our understanding of complex data, and innovative applications such as monitoring sensitive seal breeding sites, brought to life for the audience by Gabby Fasoli and Nick Tomline. This award-winning project in Norfolk exemplifies how technological innovations are transforming our ability to gather rigorous science and evidence to better understand nature."
        },
        {
            "heading": 4,
            "text": "Building Better Places"
        },
        {
            "text": "Dr Julia Baker of Mott MacDonald challenged us to imagine infrastructure that works with nature, not against it. She demonstrated how Biodiversity Net Gain can be embedded at any scale, with Steve Panks, Natural England showing how it is already shaping policy and planning. Our ornithologists presented approaches to developing evidence on seabird flight paths, now guiding turbine placement to protect marine habitats while meeting energy needs. Together, these examples highlighted how Natural England is ensuring that development and recovery go hand in hand."
        },
        {
            "text": "Carl Moxley of Legal & General described the potential of working with financial institutions to unlock investment that benefits both nature and society. Woodland and Peatland codes already generate high integrity credits and expanding to saltmarsh and soil could open new opportunities."
        },
        {
            "text": "His message was clear: nature is an economic powerhouse, and by recognising its true value, finance and the environment can work together to deliver ecological, social, and economic gains. This reflects Natural England’s wider mission to embed nature into everyday decision‑making and ensure nature recovery is seen as a driver of growth, not a cost."
        },
        {
            "heading": 4,
            "text": "Security, Health, Wellbeing through Nature"
        },
        {
            "text": "Nature recovery is about weaving nature into everyday life so that people can support, access, and benefit from it wherever they live."
        },
        {
            "text": "Dr Josh Bunce, Deputy Director and Head of Research at the Environment Agency, showed how nature‑based solutions can tackle England’s most pressing security challenges, from drought to flooding. He highlighted wetlands, natural flood defences, and healthy ecosystems as practical, cost‑effective ways to protect communities and build resilience. "
        },
        {
            "text": "Building on this, Natural England teams demonstrated how a stronger evidence base is essential to anticipating risks and guiding decisions. From frameworks that support resilience to research on the people and nature connection, they showed how evidence can reduce health inequalities, improve wellbeing, and strengthen communities."
        },
        {
            "text": "Professor Michael Winter OBE reinforced that this evidence must reflect both ecological and social realities. He stressed it’s not enough to rely solely on ecological data, integrating social science is vital to capture community values, cultural influences, and economic drivers. This ensures that solutions deliver benefits for both nature and society, and was well reflected by Dr Ruth Water’s description of the State of Natural Capital work and Natural England’s commitment to evidence that is rigorous, relevant, and rooted in the way people live and interact with the natural world."
        },
        {
            "heading": 4,
            "text": "Working Together for Transformational Change"
        },
        {
            "text": "Dr Tony Juniper CBE, Chair of Natural England, convened the panel, which included Professor Lynn Dicks, Board Member and Co‑Chair of the Science Advisory Committee, to explore how collaboration can accelerate recovery. The panel emphasised that evidence must be rigorous, accessible, and directed where it makes the greatest difference - informing policy, guiding investment, and building public trust."
        },
        {
            "text": "The panel also highlighted the economic dimension of recovery, noting that nature delivers tangible benefits such as clean water, carbon storage, and resilience against flooding and drought. Embedding these values into financial and policy frameworks reframes recovery as a pathway to long‑term growth, health, and security."
        },
        {
            "heading": 4,
            "text": "Looking Ahead"
        },
        {
            "text": "The conference was a powerful reminder that time is short if we are to meet 2030 targets. Natural England will strengthen partnerships and commit to bold action guided by science, evidence, and analysis."
        },
        {
            "text": "Nature recovery is not only an environmental necessity but the foundation of future growth, health, and security. Together, we will ensure recovery delivers benefits for the whole of society."
        },
        {
            "text": "The day was filled with enthusiastic discussion about how we go further and faster to recover nature by being powered by science, ensuring we realise the ambition set out in our strategy. We must act with urgent ambition, and our Science, Evidence and Analysis Framework sets out how we will rise to the challenge."
        },
        {
            "text": "It is increasingly apparent to businesses and wider industries that nature loss is a key risk, nature positive goals will underpin national security, can unlock innovation for growth and private finance could help turn the dial on nature recovery."
        },
        {
            "text": "We heard clearly about the need to get nature into the boardroom and that investing in nature is a rational economic choice, yet there is an evidence need to unlock progress. For meaningful nature outcomes that will endure, we must work at scale and at the ecosystem level, requiring deep understanding of actions to repair and restore forward function."
        },
        {
            "text": "All this asks new and exciting questions of our science and evidence, how, when and what we monitor, and when we act with an informed approach to risk. I look forward to collaborating with both longstanding and new stakeholders to uncover much-needed answers."
        }
    ]
}