{
    "url": "https://defradigital.blog.gov.uk/2023/02/20/become-a-content-designer-in-defra/",
    "title": "Become a content designer in Defra’s future farming team",
    "authors": [
        "Jenn Brookbanks",
        "Tom Metcalf",
        "Sue Agnew"
    ],
    "categories": [
        "Defra content design",
        "Defra digital",
        "User centred design"
    ],
    "pub_date": "2023-02-20T08:26:29+00:00",
    "content": [
        {
            "text": "Defra is recruiting content designers for its future farming programme. Sue Agnew, Jenn Brookbanks and Tom Metcalf recently joined the team. Read about their experience of the content design role and what they enjoy about it, to help you decide if this role is right for you. (Details on how to apply for content design roles in our future farming team are at the end of this blog)."
        },
        {
            "heading": 2,
            "text": "Why choose content design"
        },
        {
            "text": "Content design is a relatively new profession and everyone in the team has followed different career paths to this point. "
        },
        {
            "text": "This is Tom’s second content designer role, having previously worked at Public Health England. He explains why he was drawn to content design:"
        },
        {
            "text": "‘It puts the user at the heart of everything. There’s something satisfying about making content clear and accessible to allow people to do what they need to do.’"
        },
        {
            "text": "But you don’t already need content design experience to be considered for the role. "
        },
        {
            "text": "For Jenn, her road to content design came as a bit of a surprise."
        },
        {
            "text": "‘Before applying to the content designer role, I didn’t know that the job existed! Now that I’m in the role, I realise that the marketing and editorial jobs I’ve had in the past helped me build the right transferable skills.’"
        },
        {
            "text": "For Sue, it was a natural move to make. Her previous role involved writing different types of communications for farmers and landowners at the Rural Payments Agency. "
        },
        {
            "text": "‘I’ve intentionally pursued roles where I can write or make improvements for customers, so the content designer role appealed to me. Previous experience of writing in plain English, using an appropriate style and tone and meeting accessibility requirements has definitely helped me in the content designer role.’"
        },
        {
            "heading": 2,
            "text": "What the role involves"
        },
        {
            "text": "As a content designer at Defra, you could be working on anything from content about cattle passports to improving how people find information on GOV.UK.  "
        },
        {
            "text": "Tom has taken on the challenge of improving content on Countryside Stewardship, a major funding scheme for farmers. As he explains: "
        },
        {
            "text": "‘I'm trying to make the information about the scheme easier for farmers to find and understand. This involves removing duplicate content and reducing the number of steps or clicks you need to go through to find what you need.’"
        },
        {
            "text": "Jenn has recently finished work on the Rural England Prosperity Fund. This was a complex project that involved working with colleagues in different teams. Jenn says: "
        },
        {
            "text": "‘Although this project was challenging at times, I really enjoyed working closely with policy experts. ‘Pair-writing’ meant that we could combine their policy knowledge with my content design skills.’"
        },
        {
            "text": "The team regularly works with user researchers to help define user needs. Sue recently supported user researchers during feedback sessions with users on Landscape Recovery. She explains:\n\n‘It was insightful hearing directly from users about their experience of using the content we provide on GOV.UK."
        },
        {
            "heading": 2,
            "text": "Why you should apply"
        },
        {
            "text": "This role gives you the opportunity to help shape the future of farming in the UK. You’re heavily involved in high profile pieces of work, which is exciting and rewarding."
        },
        {
            "text": "Fortunately, we’re part of a very supportive content community and get to work with colleagues with specialist skills. From understanding GOV.UK’s quirks to Google Analytics, there’s always someone on hand to help. "
        },
        {
            "text": "Jenn explains how the team support each other through ‘content crits’:"
        },
        {
            "text": "‘Content crits provide a safe space to discuss a piece of work with others and get constructive feedback. It’s amazing how fast you can resolve a content problem when it’s shared with colleagues.’"
        },
        {
            "text": "If you’re successful in getting a content designer role, you’ll get the training and support you need."
        },
        {
            "text": "The learning opportunities have been really useful for Sue:"
        },
        {
            "text": "‘We’re all encouraged to keep learning and we have regular bite-sized training sessions to share knowledge and support each other. I’ve found these really useful, specifically learning about new ways of working with different strategies, tools and resources.’"
        },
        {
            "text": "You can also benefit from flexible working. Jenn says: "
        },
        {
            "text": "‘I love the fact that Defra is supportive of flexible working. I work three days a week and am able to balance my job around my childcare responsibilities.’"
        }
    ]
}