{
    "url": "https://hmlandregistry.blog.gov.uk/2023/02/20/hm-land-registry-wants-your-views/",
    "title": "HM Land Registry wants your views",
    "authors": [
        "Neil Chester, Senior Customer Research Analyst"
    ],
    "categories": [
        "Customer research"
    ],
    "pub_date": "2023-02-20T15:29:20+00:00",
    "content": [
        {
            "text": "HM Land Registry conducts quarterly customer satisfaction surveys through telephone and email surveys in conjunction with market research provider Ipsos."
        },
        {
            "heading": 2,
            "text": "Have your say"
        },
        {
            "text": "This is your opportunity to have your say, rate our service and give us your views to help us focus our efforts where you think they are needed most."
        },
        {
            "text": "Our latest customer satisfaction fieldwork begins on Tuesday 21 February and runs until Sunday 19 March."
        },
        {
            "heading": 2,
            "text": "The process"
        },
        {
            "text": "It’s quite simple. Ipsos speaks to 300 customers via telephone. The online survey invitation comes from HMLRsurvey@ipsos-mori.com and, if you receive one, it looks like this."
        },
        {
            "text": "Find out more about HM Land Registry research."
        },
        {
            "heading": 2,
            "text": "Your feedback matters"
        },
        {
            "text": "Our findings are shared across HM Land Registry and with wider stakeholders, ensuring your views are not only heard and discussed, but also feed into business and action planning. Your customer voice is central to our work."
        },
        {
            "text": "Our current top priorities, based on your feedback, focus on getting in touch with us, requisitions and timescales for completing applications."
        },
        {
            "text": "The Customer and Market Insight team at HM Land Registry also conducts regular research with a wide range of customers, including those who have joined our professionals’ research panel, which you can join too. Sign up to the panel."
        },
        {
            "heading": 2,
            "text": "How you make a difference"
        },
        {
            "text": "Panel feedback has helped develop and enhance HM Land Registry services such as MapSearch, Ask for Guidance and most recently, form RXC and the Digital by default information campaign. Ongoing work includes testing a training pack with customers to support new starters or to use as a refresher for existing staff, as well as a project around calculating Scale 2 fees."
        },
        {
            "text": "The ball is in your court. Get involved and let us know what you want."
        },
        {
            "text": " "
        }
    ]
}