{
    "url": "https://valuationoffice.blog.gov.uk/2023/02/20/how-we-value-self-catering-holiday-homes/",
    "title": "How we value: self-catering holiday homes",
    "authors": [
        "izzyclark1"
    ],
    "categories": [
        "How We Value"
    ],
    "pub_date": "2023-02-20T09:58:58+00:00",
    "content": [
        {
            "text": "When we value a property, we generally look at its open market rental value. This means how much someone would be willing to pay for the property in rent for a year."
        },
        {
            "text": "However, this way of valuing would not be suitable for holiday lets as they are not rented on an annual basis in the same way as a shop would be."
        },
        {
            "text": "Instead, we look at the annual income the property is expected to generate if let to its full potential. This is called its fair maintainable trade."
        },
        {
            "text": "We request details of income and expenditure from different types of self-catering properties to see what the fair maintainable trade would be."
        },
        {
            "text": "After we work out the fair maintainable trade, we then apply a set percentage to this figure to arrive at a rateable value. This value is used by local authorities to calculate business rate bills."
        },
        {
            "text": "Categories of self-catering properties"
        },
        {
            "text": "There are currently around 85,000 self-catering holiday homes in England and Wales."
        },
        {
            "text": "We use different percentages depending on the type of self-catering property being valued. We divide self-catering properties into 2 categories:"
        },
        {
            "text": "Single units and complexes up to 4 properties"
        },
        {
            "text": "Single units and complexes of up to 4 properties are valued by bed space for each property."
        },
        {
            "text": "To work out the value of each single bed space, we analyse the fair maintainable trade to understand the annual net profit from letting out that bed."
        },
        {
            "text": "This profit is split into a fair income for the individual who operates the holiday let and a remainder. The remainder is considered to be a reasonable rent and overall rateable value for the property."
        },
        {
            "text": "This figure is then divided by the number of single bed spaces within the property to arrive at a rateable value for each bed space."
        },
        {
            "text": "If we have limited evidence of a property’s income and expenditure, we can compare it to a similar property type with the same number of bed spaces to work out the rateable value."
        },
        {
            "text": "Self-catering complexes (5 properties and above)"
        },
        {
            "text": "For self-catering complexes with 5 or more properties, the rateable value is based on a percentage of fair maintainable trade. The percentage we use is based on the characteristics of the complex."
        },
        {
            "text": "Each complex will fall into one of 3 categories:"
        },
        {
            "text": "Category A properties have a lower percentage as running costs and expenditure is likely to be higher. Category C properties have a higher percentage as they do not have the costs involved with having lots of facilities."
        },
        {
            "text": "To help decide what percentages to use, we talk to industry representatives, including the Professional Association of Self Caterers UK."
        },
        {
            "text": "Location, quality and type of property"
        },
        {
            "text": "The location, quality and type of property also play an important part in its valuation."
        },
        {
            "text": "Properties can be in highly sought-after areas or in less in demand locations. Prime locations tend to have higher rateable values."
        },
        {
            "text": "High-quality properties are modern and offer extra facilities, such as a hot tub. In contrast, basic properties lack standard facilities such as heating."
        },
        {
            "text": "We also consider the type of property when valuing self-catering holiday homes. All properties are placed in one of the following categories:"
        },
        {
            "text": "We then compare properties in similar locations and of a similar quality and type to work out the fair maintainable trade of different kinds of holiday lets."
        },
        {
            "text": "New eligibility rules"
        },
        {
            "text": "From April 2023, new eligibility rules for business rates will apply to self-catering properties in England and Wales."
        },
        {
            "text": "If properties do not meet these rules, then they will become eligible for paying Council Tax."
        },
        {
            "text": "Check the changes to business rates rules to find out more."
        }
    ]
}