{
    "url": "https://insidedio.blog.gov.uk/2023/02/20/supporting-the-training-of-ukrainian-forces-on-the-uk-defence-training-estate/",
    "title": "Supporting the training of Ukrainian forces on the UK Defence Training Estate",
    "authors": [
        "Brigadier Jonathan Bartholomew OBE"
    ],
    "categories": [
        "Defence Training Estate (DTE)",
        "Military Training"
    ],
    "pub_date": "2023-02-20T11:50:40+00:00",
    "content": [
        {
            "text": "A Ukrainian recruit training on the UK Defence Training Estate. [Crown Copyright / MOD 2023]This week marks the one-year anniversary of the illegal and unprovoked full-scale Russian invasion of Ukraine. As part of the international effort to support Ukraine, a programme of operational training of Ukrainian forces, supported by both UK and partner nations has been taking place across the UK. It is designed to enable Ukrainian soldiers to rebuild their forces and increase their resistance as they continue to defend their nation's sovereignty and territory against Russian invaders.  "
        },
        {
            "text": "Brigadier Bartholomew, Head of DIO’s Overseas and Training Region, explains the vital role our Defence Training Estate teams are playing in supporting the UK-based training of thousands of Ukrainian volunteer recruits. "
        },
        {
            "text": "Many of my team have been involved in supporting this training. They have worked tirelessly and efficiently, and I am proud of their efforts in supporting what has been an unprecedented and emotional programme.  "
        },
        {
            "text": "A number of Defence Training Estate sites are currently being used, and DIO teams and our colleagues from Landmarc Support Services are playing a vital role in enabling training exercises and ensuring that supporting infrastructure and facilities are available.   "
        },
        {
            "heading": 2,
            "text": "Always ready to respond "
        },
        {
            "text": "Ukrainian trainees practising urban fighting techniques. [Crown Copyright / MOD 2023]The UK Defence Training Estate is constantly poised to support pre-deployment training for our own personnel, at short notice, to respond to critical Defence needs. Nonetheless, this programme has presented a unique challenge, requiring camps, ranges and training areas to remain operational around the clock to support high-intensity use.  "
        },
        {
            "heading": 2,
            "text": "Rising to the challenge "
        },
        {
            "text": "The training being delivered on our sites has so far equipped more than 10,000 Ukrainian personnel with battle-proven skills and expertise. These individuals are volunteers recruited into the Armed Forces of Ukraine with little limited military experience, so it’s essential their training provides the skills required to be effective in frontline combat.  "
        },
        {
            "text": "The training course is based on that provided to UK Army Reserve infantry and is delivered over a five-week period. It provides instruction on weapons handling, range activity and marksmanship, individual military skills and offensive and defensive tactics. It also includes battlefield first aid scenarios and training in rural and urban environments. It also includes battlefield first aid scenarios and training in rural and urban environments. The aim is to make the training as true-to-life as possible."
        },
        {
            "text": "Ukrainian volunteers training in a trench system on the Defence Training Estate in the UK. [Crown Copyright / MOD 2023]Our Training Estate teams have delivered specific operational training requirements, from the digging of trench systems and the re-design of training areas, to supporting on the ranges where Ukrainian recruits are developing their marksmanship skills.  "
        },
        {
            "heading": 2,
            "text": "Providing fast-paced support "
        },
        {
            "text": "The nature of the programme has also called for the fast-paced provision of additional supporting infrastructure and services to our camps. There has been an enormous effort by DIO and Landmarc teams to provide and maintain everything from classrooms and briefing areas to temporary armouries, welfare, laundry and ablution facilities, as well as power and infrastructure support.  These facilities have been maintained and delivered to complement those that already exist across our camps.   "
        },
        {
            "text": "There has been an impressive level of collaboration between DIO, our training estate partner Landmarc and other industry representatives to ensure training objectives are achieved and all support services and logistics are managed effectively. This includes Army chefs working alongside ESS to prepare food, modifying meals to suit specific training requirements, and adapting menus to suit Ukrainian cuisine as much as possible. "
        },
        {
            "heading": 2,
            "text": "Supporting the welfare of training recruits "
        },
        {
            "text": "All of our teams on the ground fully appreciate the gravity of the situation and are hugely respectful of how brave, selfless and courageous the Ukrainian recruits are. We want to do everything we can to ensure they feel welcome and properly accommodated while training on our sites, so recreational opportunities are also an important priority. Whether it’s marking out football pitches and purchasing nets and balls for use in the recruits’ down-time, or setting up welfare tents and other leisure facilities, our teams have been going the extra mile to support the wellbeing of training recruits.  "
        },
        {
            "text": "It is paramount that the UK and international community continue to support Ukraine for the long-haul against the violation of their sovereignty. The work of our Defence Training Estate teams, alongside Landmarc and other partners, in support of this intensive training programme continues to be integral to this effort. I’d like to thank all our staff and teams involved for their enduring commitment and for going above and beyond. We can be proud of what has been achieved. "
        }
    ]
}