{
    "url": "https://defradigital.blog.gov.uk/2021/12/15/business-as-usual-for-mandating-sustainable-ict/",
    "title": "‘Business as usual’ for mandating Sustainable ICT",
    "authors": [
        "Chris Howes, Chief Digital and Information Officer"
    ],
    "categories": [
        "Defra digital",
        "Digital transformation"
    ],
    "pub_date": "2021-12-15T09:00:06+00:00",
    "content": [
        {
            "text": "The Greening Government Commitments (GGCs) 2021-2025. published in October sets out actions that UK government departments and their partner organisations will take to reduce their impacts on the environment in the period 2021 to 2025. This includes specific carbon reduction targets for individual departments."
        },
        {
            "text": "A brand new headline commitment states that everyone must report on the progress against the outcomes of the GGC ICT and Digital Services Strategy 2020-2025. This includes three key outcomes for net zero, the circular economy and to improve supply chain issues and transparency."
        },
        {
            "text": "Progress will be measured through annual assessments of their ICT/digital carbon footprints, resources, and policy/strategy implementation. This will help to ensure they are meeting their sustainability commitments for the key areas and that departmental budget forecasting  and spend, is aligned to sustainability outcomes."
        },
        {
            "text": "And there’s more…….\nIn the words of the famous Irish comedian, Jimmy Cricket, “and there’s more”. With reporting fixed, we had to focus on a change to how government designs and delivers ICT. One of the key mechanisms for this is the Cabinet Office/Government Digital Service managed Technology Code of Practice. This now includes a new point twelve –‘Make your technology sustainable’ - which is all about increasing sustainability throughout the lifecycle of your technology."
        },
        {
            "text": "Last month we updated the Spend Controls and the Technology Code of Practice to include sustainability outcomes. Essentially this means sustainability should also be a key factor for any new project or programme."
        },
        {
            "text": "What does this mean?\nIn a nutshell, for any departmental digital projects and programmes to get approval from Cabinet Office to spend money on any new digital service (that meets a £100,000 threshold for digital and £1000,000 for technology), you will need to meet the outcomes defined in the Greening Government ICT and Digital Services Strategy (net zero, circular economy, social value, modern slavery etc). If you don't, then you will not pass."
        },
        {
            "text": "The cross-government group, the Sustainable Technology Advice & Reporting (STAR), will be able to assist all departments, agencies, and bodies with this new approach. For those already involved in the STAR, you are well versed in creating policy, strategy, and materials within your own organisations."
        },
        {
            "text": "The ‘bottom line’\nAs a result of all this work, projects and programmes MUST now show they have considered and assessed sustainability impacts and benefits of ICT/Digital from the start. The more sustainable the solution, the easier it will be to pass spend controls. And at the end of the year, you can report all the good work in the updated GGCs."
        },
        {
            "text": "For years this work, managed by the STAR community across UK Government, has been a \"nice to have\" and \"best endeavours\". It is now Minister-supported and mandated and moving towards business as usual. Thank you to everyone who has helped make this happen, you know who you are."
        }
    ]
}