{
    "url": "https://companieshouse.blog.gov.uk/2021/12/15/filing-dormant-company-accounts-with-companies-house/",
    "title": "Filing dormant company accounts with Companies House",
    "authors": [
        "Rachel Roberts, Head of Compliance and Enforcement"
    ],
    "categories": [
        "Company guidance",
        "Filing advice"
    ],
    "pub_date": "2021-12-15T12:03:45+00:00",
    "content": [
        {
            "text": "All limited companies, whether they trade or not, must deliver annual accounts and a confirmation statement to Companies House each year. This includes dormant companies."
        },
        {
            "text": "A company’s directors are legally responsible for running the company and making sure company accounts and reports are properly prepared and filed on time."
        },
        {
            "text": "A dormant company may not be in the forefront of directors’ minds, but even if they do not intend to carry on any kind of business activity or receive any form of income, they must still file annual accounts and send Companies House confirmation statements every year."
        },
        {
            "text": "We want to inspire trust and confidence in our registers and data, so the accuracy of information on the register is of vital importance."
        },
        {
            "text": "A company may be ‘dormant’ if it’s not doing business and does not have any other income, for example investments."
        },
        {
            "text": "It’s worth noting that dormant means different things for Corporation Tax and Company Tax Returns and a company’s annual filings for Companies House."
        },
        {
            "text": "Some directors think that because HMRC may not require accounts from a dormant company, the same applies to Companies House. This is not the case."
        },
        {
            "text": "A company does not need to pay Corporation Tax or file another Company Tax Return once they’ve told HMRC their company is dormant - unless they receive a further notice to deliver a Company Tax Return. However, even if a limited company is dormant for Corporation Tax, it must still file a confirmation statement and annual accounts with Companies House."
        },
        {
            "text": "A company is called ‘dormant’ by Companies House if it’s had no ‘significant accounting transactions’ during the accounting period. A significant accounting transaction is one which the company should enter in its accounting records."
        },
        {
            "text": "Significant transactions do not include:"
        },
        {
            "text": "If no such transaction has happened, the company can have dormant status. If a company is dormant and qualifies as ‘small’ it can file ‘dormant accounts’ and does not have to include an auditor’s report with its accounts."
        },
        {
            "text": "Our WebFiling service offers a simple online template enabling easy and quick electronic submission of dormant accounts for companies that have never traded. This is available for both companies limited by shares and companies limited by guarantee."
        },
        {
            "text": "The system contains inbuilt checks so that the dormant company can be sure it has not left out any key information. You can find further guidance on how to file dormant accounts online in our YouTube video and online guidance."
        },
        {
            "text": "Filing dormant accounts is free. Costs only arise if the dormant company fails to file on time and late filing penalties are incurred. It’s important that the responsibilities of being a company director are taken seriously. If you fail to comply, it can lead to a fine and in the event of a serious breach, can lead to the company being struck off the register."
        },
        {
            "text": "Dormant companies can file their confirmation statement online for a fee of £13."
        },
        {
            "text": "A company does not need to tell Companies House if they restart trading. The next set of non-dormant accounts that they file will show that the company is no longer dormant."
        },
        {
            "text": "If a dormant company is no longer needed, directors can choose to close their company using the new companies house online service to apply to strike off and dissolve a company."
        }
    ]
}