{
    "url": "https://insideDIO.blog.gov.uk/2021/12/15/first-new-and-improved-maintenance-contract-comes-into-force/",
    "title": "First new and improved maintenance contract comes into force",
    "authors": [
        "David Brewer"
    ],
    "categories": [
        "Facilities Management",
        "Future Defence Infrastructure Services (FDIS)"
    ],
    "pub_date": "2021-12-15T13:58:23+00:00",
    "content": [
        {
            "text": "Today is a day many people in DIO have been working towards for several years. It is the start of a new contract to provide what are called ‘hard’ facilities management services to some of the MOD Built Estate. These include building maintenance, repairs, servicing, plumbing, heating, fire safety systems and more. "
        },
        {
            "text": "This particular contract, which will provide these services to MOD sites in Scotland and Northern Ireland, was awarded in June to Mitie. The team at Mitie have spent the intervening time familiarising themselves with the estate and its condition and ensuring that they are ready to hit the ground running today. They will be responsible for around 95 sites, including RAF Lossiemouth, HMNB Clyde and Glencorse Barracks in Scotland and Joint Helicopter Command Flying Station Aldergrove and Thiepval Barracks in Northern Ireland.   "
        },
        {
            "text": "The contract is expected to sustain around 340 jobs across Scotland and Northern Ireland, many of which will be in Small and Medium-sized Enterprises as the supply chain provides opportunities for local firms. The new contract will run for an initial period of seven years. "
        },
        {
            "text": "This £160m contract is the first of ten Future Defence Infrastructure Services (FDIS) contracts to come into force. The programme as a whole is worth around £3bn and includes a number of contracts to provide hard facilities management services, as well as contracts to manage Service Family Accommodation and the Defence Training Estate. In due course we will also be awarding contracts for ‘soft’ facilities management services, which covers areas such as cleaning, catering and gardening.  "
        },
        {
            "heading": 2,
            "text": "Benefits of FDIS"
        },
        {
            "text": "The FDIS contracts have been carefully designed following feedback from our Armed Forces customers to put customer satisfaction at their heart and improve upon their predecessors. For example, we previously had a policy of ‘fix on fail’ but under the new contracts preventative maintenance will be prioritised to stop as many problems as possible before they occur. The new arrangements allow for more efficient processes and the quicker delivery of high volume, lower value works, ensuring increased value for money. "
        },
        {
            "text": "We will maintain more robust and collaborative supplier relationships and contract monitoring, which will ensure that standards are kept high and the Armed Forces see improvements. We’ve introduced new contract performance measures which will give a real incentive to contractors to perform to a high standard. They will also be required to collect and manage data about the estate, which will help us and the rest of the MOD when making decisions about where to invest funding in infrastructure for the most benefit.  "
        },
        {
            "text": "We are confident that these new contracts will lead to better management of the estate, and therefore to improved experiences and a better quality of life for our Armed Forces personnel who live, work, train and deploy there.  "
        },
        {
            "text": " "
        }
    ]
}