{
    "url": "https://naturalengland.blog.gov.uk/2021/12/15/hen-harrier-monitoring-tagging-and-satellite-tracking-latest-data-published/",
    "title": "Hen harrier monitoring, tagging and satellite tracking – latest data published",
    "authors": [
        "Dave Slater"
    ],
    "categories": [
        "Biodiversity",
        "Wildlife"
    ],
    "pub_date": "2021-12-15T10:00:52+00:00",
    "content": [
        {
            "text": "For many years Natural England has been involved with monitoring, tagging and satellite tracking hen harriers. To date, more than 60 individual birds have been tagged by Natural England, helping to determine their fortunes and inform our wider hen harrier conservation work. Updates on the status of all birds carrying Natural England tags are posted on this page periodically."
        },
        {
            "text": "Birds tagged in previous years"
        },
        {
            "text": "In 2021, 31 pairs of hen harriers attempted to breed in England, of which 24 were successful, and 84 chicks fledged. This year, we have been able to follow the fortunes of 14 adult birds carrying transmitters fitted in previous years. We were pleased to see five of the older, more experienced birds - Dru (tagged 2017), Frank (2018), Sofia (2018), and Colin (2019) - attempting to breed in England in 2021, as well as Sorrel (2016) attempting to breed in Scotland. Dru’s and Sofia’s nesting attempts failed, as the nestlings were taken by predators, but Colin bred successfully, raising four young, and Frank successfully bred with two females, meaning he has now fathered 21 chicks in his lifetime. Although Colin’s tag stopped transmitting in April 2021, he was photographed and positively identified at the nest."
        },
        {
            "text": "The remaining nine adult birds tracked during the 2021 breeding season were all one-year-old birds, hatched in 2020. Of the three of these that were wild-reared, one (Susie) bred successfully. The other six were brood managed birds, reared in captivity, of which five attempted to breed and four successfully bred, raising seven chicks between them."
        },
        {
            "text": "Birds tagged this year"
        },
        {
            "text": "Of the 84 chicks that fledged in England, 17 were fitted with satellite tags by NE. Seven of these were brood managed birds (Moorland Association tags), and ten were wild-reared birds. Two of the wild-reared birds tagged this year were the offspring of the 2020 cohort of brood managed birds."
        },
        {
            "text": "As of November 2021, all tagged birds have settled into their winter ranges. Some remain within their breeding areas, others migrate short distances away from the breeding grounds, and some winter abroad. Two of the 2021 wild-tagged birds (Rodney and Pete) have crossed to France, while all other birds remain in the UK, though one brood-managed juvenile appeared to set off across the channel before turning back and returning to southern England."
        },
        {
            "text": "End transmission"
        },
        {
            "text": "Since the last update in July, we have stopped receiving movement transmissions from five of the satellite tagged birds: Asta (2020), Josephine (2021), and three of the 2021 brood managed birds. While it is not uncommon for birds to die from natural causes, particularly in their first year, hen harriers are also lost to illegal persecution. Therefore, when we stop receiving movement transmissions, the police are informed, and immediate efforts are made to locate and recover the birds on the ground. This is not straightforward, as the final transmissions from the tags do not always give a precise location."
        },
        {
            "text": "Following intensive search efforts, the bodies of two of the 2021 brood managed birds have been located and, following our standard procedures, sent for post-mortem examination. The finding circumstances did not suggest that the birds were illegally killed, but should any information come to light about the cause of death that could suggest illegal activity, we would work closely with the police on the appropriate course of action."
        },
        {
            "text": "Tags for the future"
        },
        {
            "text": "As of November 2021, 25 birds are still being tracked, plus Colin, who was known to be alive this year even though his tag has stopped transmitting. We will be publishing our next update on these birds in spring 2022. We are grateful to our staff and collaborators who work on tagging and monitoring for their considerable efforts."
        },
        {
            "text": "Note on satellite tags: The satellite tracking devices are solar-powered, lightweight transmitters, and can give the locations of the birds to an accuracy of within 150m. They are attached by a harness while the birds are nestlings and are designed to transmit for several years. The harnesses are designed to eventually break and fall off."
        }
    ]
}