{
    "url": "https://gds.blog.gov.uk/2021/12/15/join-the-user-research-panel-for-gds-products-and-services/",
    "title": "Join the user research panel for GDS products and services",
    "authors": [
        "Andy Parker, Senior User Researcher, GDS"
    ],
    "categories": [
        "Digital Service Platforms",
        "GOV.UK Notify",
        "GOV.UK Pay",
        "Service design",
        "User research"
    ],
    "pub_date": "2021-12-15T10:10:03+00:00",
    "content": [
        {
            "text": "We’re launching a new way for civil and public servants to help us iterate the Government Digital Service’s digital products and services."
        },
        {
            "text": "The Government Digital Service (GDS) builds platforms, products and services that help create a simple, joined-up and personalised experience of government to everyone."
        },
        {
            "text": "Our Government as a Platform (GaaP) products make it easy for civil and public service organisations to design and host services, send messages and take payments. These include:"
        },
        {
            "text": "The list of these common tools for digital services is growing and we want your help to make them great."
        },
        {
            "heading": 2,
            "text": "Why create a research panel?"
        },
        {
            "text": "Unlike when we want to learn about the needs of our public users, finding civil and public servants to take part in user research activities can be a challenge."
        },
        {
            "text": "We can’t use traditional participant recruitment companies because we want to speak with our colleagues across the government during office hours. This means we can sometimes be reliant on our collective networks to find suitable participants, and that can lead to speaking to the same people a lot across our service teams."
        },
        {
            "text": "Building out these social networks takes time and can happen at an individual level. We want to demonstrate our values on delivering diverse, and far reaching research by creating the right tools to help us overcome some of these challenges, and demonstrate how we make informed decisions that ensure digital in government is representative of the UK."
        },
        {
            "text": "In the past, we know that participants in user research have felt disconnected from the outcome. They may have taken part in studies that related to topics close to their own work and don’t think their contribution made a difference."
        },
        {
            "text": "We want to change that. Developing our research panel is the first step."
        },
        {
            "heading": 2,
            "text": "What happens in user research?"
        },
        {
            "text": "We know there are many things in a given day that require your time and that being part of user research activities might not be something you feel is a priority."
        },
        {
            "text": "Members of our research panel will only be invited to take part in studies we think you will find interesting, and that we believe you will benefit from the outcome of. You don’t have to take part in anything, and we’ll make sure that if you have taken part in a study recently, we’ll wait some time before we contact you again."
        },
        {
            "text": "Your opinions, thoughts, experiences and feelings matter. Anyone that has taken part in user research in the past will have had a direct impact and influenced the way that a service was created or continues to be improved."
        },
        {
            "heading": 2,
            "text": "Why should you join us?"
        },
        {
            "text": "Everyone is welcome to sign up and take part in user research. It does not matter which organisation you are part of, what your role is, your grade, or your experience. You can choose when to take part, and the types of activities you want to do."
        },
        {
            "text": "You may not have been aware until reading this that we run user testing with civil and public servants, almost daily. Or that GDS creates these products and services to support your organisation and its digital services to overcome common challenges."
        },
        {
            "text": "User research is a big part of making digital services and transformation human. It is a way for teams to hear what is happening for the people that we want to help."
        },
        {
            "text": "By taking part, you will have been an important part of making government services great. Whether you completed a survey, worked with a researcher and designer to come up with ideas for a new way for people to confirm their identity, shared your experiences of delivering a service with a researcher, or tried out a new product with us. Your active participation is what makes GDS great."
        },
        {
            "heading": 2,
            "text": "Get involved"
        },
        {
            "text": "The panel will be open to civil servants and public servants across England, Scotland, Wales and Northern Ireland who want to take part in shaping how products and services are created by the Government Digital Service."
        }
    ]
}