{
    "url": "https://grantscommunity.blog.gov.uk/2021/12/15/shape-and-grow-your-government-grants-community/",
    "title": "Shape and grow your Government Grants Community",
    "authors": [
        "Amie Wilsdon-Tagg"
    ],
    "categories": [
        "Digital transformation",
        "Grants Applicant Programme",
        "User research"
    ],
    "pub_date": "2021-12-15T09:25:39+00:00",
    "content": [
        {
            "text": "While early 2022 is likely to see the continuation of virtual events, we know that the creative spark that often came from face-to-face networking will continue through our new online way of working together."
        },
        {
            "text": "That is why in January and February, we will be holding a series of virtual sessions, for anyone from voluntary, community and social enterprise (VCSE) organisations or small to medium-sized businesses from the private sector with an interest in applying, finding and securing government grants, to discuss how together we can shape and grow your Government Grants Community.  "
        },
        {
            "heading": 2,
            "text": "What is the Government Grants Community?"
        },
        {
            "text": "Broadly speaking, the Community is a place where we can come together to share experiences, to share learning - and yes - to share frustrations. Your involvement could be large or small, it is down to you. Dip in from time to time or play a leading role. But regular interaction will keep the community invigorated, relevant and a good use of our collective time and energy."
        },
        {
            "heading": 2,
            "text": "We want to know what you want"
        },
        {
            "text": "So what would be useful? From our perspective, as we develop the new grant finder service, we would really like to get to a place where you:"
        },
        {
            "text": "We have had a few suggestions come through to us already. They include running masterclasses on:"
        },
        {
            "text": "Would either of these be of interest to you? Are there other subject areas that might interest you? As the saying goes ‘shy bairns, get nowt’. So do ask, and if we can, we will create discussion fora and work to find speakers and experts for the Government Grants Community. "
        },
        {
            "heading": 2,
            "text": "How and when to run these sessions?"
        },
        {
            "text": "Thank you for letting us know that for some of you we needed to run our virtual sessions via MS Teams rather than Google Meet, we can now offer both platforms. What else would help you and your fellow Government Grants Community members get the most out of our moments together? Is there a day of the week that is better? Is there a time slot to avoid? "
        },
        {
            "heading": 2,
            "text": "If you have more time to spare"
        },
        {
            "text": "Right now we are looking for more people to join our Government Grants Community research panel. If you are someone from a VCSE or business who may in the future consider finding and applying for government grants, we’d like to hear from you. Also, as we ensure our pilot online service is fully accessible, we'd value people with different accessibility needs helping us to test our prototypes as they iterate too. "
        },
        {
            "text": "The sort of things we might ask you to support us with are: "
        },
        {
            "heading": 2,
            "text": "How do I join"
        },
        {
            "text": "First, if you have not joined up to the Government Grants Community, just complete the sign-up form. "
        },
        {
            "text": "And, second, if you do want to play a more significant role in shaping the online grant service, you can also check the box in the sign-up form to become part of the user research panel."
        },
        {
            "text": "We want to make 2022 the year of ‘simpler, faster and fairer’. And that by this time next year, we will all have a clearer view about how to make it more straightforward for you to find and apply for grants; and have created an invaluable ‘place’ where we can come together to learn and support one and other for the benefit of society.  "
        },
        {
            "text": "And, you never know, by next December we might even get the chance to be in a non-virtual room together sharing a mince pie and cup of coffee."
        },
        {
            "text": " "
        },
        {
            "text": "Amie Wilsdon-Tagg"
        },
        {
            "text": "Engagement Lead, Grants Applicant Programme."
        }
    ]
}