{
    "url": "https://defrafarming.blog.gov.uk/2021/12/15/the-farming-investment-fund-more-notice-more-information-and-a-new-opportunity-ahead/",
    "title": "The Farming Investment Fund: more notice, more information and a new opportunity ahead ",
    "authors": [
        "Gordon Jones"
    ],
    "categories": [
        "Payments for equipment, technology and infrastructure"
    ],
    "pub_date": "2021-12-15T13:30:35+00:00",
    "content": [
        {
            "text": "Last month, we launched the Farming Investment Fund. It included the Farming Equipment and Technology Fund and the Water Management theme of the Farming Transformation Fund.  "
        },
        {
            "text": "We’re really pleased that there’s been so much interest - there’s still time to apply for funding. To find out more and apply, visit GOV.UK. "
        },
        {
            "text": "Since the launch, we’ve had regular conversations to hear your views on our approach. We want to make improvements as we go. In this post, I’ll share what we heard and what we’re doing to make things better as a result.  "
        },
        {
            "heading": 2,
            "text": "More time "
        },
        {
            "text": "You told us that you wanted more time to prepare. Specifically, that we need to prepare potential applicants that a fund will launch and that we need give a more generous window for applications. "
        },
        {
            "text": "We recognise that time for researching, planning and applying is really important which is why we’re going to try to share more and earlier whenever we can.  "
        },
        {
            "text": "So, in January, we’re going to launch the Improving Farm Productivity theme, which will be the second offering under the Farming Transformation Fund.  "
        },
        {
            "heading": 2,
            "text": "More information  "
        },
        {
            "text": "You also said more information, structured clearly, would enable you to make better decisions. "
        },
        {
            "text": " So, we’ve published ‘The Manual for Improving Farm Productivity’ on GOV.UK to support applications for Improving Farm Productivity grants.  "
        },
        {
            "text": "You won’t be able to apply for Improving Farm Productivity grants until it launches in mid-January, but this manual should help you consider your options and to make a choice in a timely way. It provides all the information you need on what is and isn’t included. "
        },
        {
            "text": "Remember, you can also apply for more than one theme under the Farming Transformation Fund, so long as the application windows are open. This is in addition to an application under the Farming Equipment and Technology Fund up to the £25k maximum for that fund. "
        },
        {
            "heading": 3,
            "text": "The next part of the fund to launch: Improving Farm Productivity "
        },
        {
            "text": "By way of a short introduction, the grants awarded through Improving Farm Productivity will pay for capital items to improve farm and horticulture productivity through:  "
        },
        {
            "text": "As with all applications under the Farming Transformation Fund, application will be by a 2-step process.  "
        },
        {
            "heading": 4,
            "text": "Step 1: An eligibility and desirability check "
        },
        {
            "text": "We’ve created an online checker, which will be available as soon as the application window opens in mid-January. It will give you an idea of your chance of success. When the window opens, we guarantee that the online checker will be open for a minimum of 8 weeks in which to check the eligibility and desirability of your project.  "
        },
        {
            "heading": 4,
            "text": "Step 2: An invitation "
        },
        {
            "text": "If your project scores highly enough, we will invite you to submit a full application. You will need to complete a full application form and send this with your supporting documents (including quotes) to the Rural Payments Agency (RPA) by email. "
        },
        {
            "text": "Successful projects will be provided with details about how to do this when the scheme is open for applications.  "
        },
        {
            "text": "You will then have until mid-September 2022 to submit your full application. If you need planning permission, then this must be approved by the end of December 2022. "
        },
        {
            "heading": 2,
            "text": "Dates for your calendars  "
        },
        {
            "text": "As a reminder for those wishing to apply for the Farming Equipment and Technology Fund the closing date for applications is Friday 7 January 2022. If you have any questions about the Farming Equipment and Technology Fund, please email the Rural Payments Agency FETFEnquiries@rpa.gov.uk "
        },
        {
            "text": "For those wishing to apply for the Water Management theme, the online checker closes 12 January 2022, with full applications required by 30 June 2022. Planning permission and any abstraction license requirements need to be in place by the 31 December 2022. If you have any questions about the Water Management theme, please email the Rural Payments Agency FTF@rpa.gov.uk "
        },
        {
            "text": "For those wishing to apply for Improving Farm Productivity, the application window is expected to open in mid-January. Further details will be available ahead of the launch. "
        },
        {
            "text": "If you have any questions about the new Improving Farm Productivity grant, or comments on our Farming Investment Fund offer, please comment below. For information about your personal situation, contact the Rural Payments Agency FTF@rpa.gov.uk "
        },
        {
            "heading": 2,
            "text": "Podcast"
        },
        {
            "text": "The latest Future Farming Podcast is on the Farming Investment Fund. Listen to the podcast. "
        }
    ]
}