{
    "url": "https://insidedio.blog.gov.uk/2022/03/18/british-science-week-2022-taking-on-the-sustainability-challenge-across-the-service-family-accommodation-estate/",
    "title": "British Science Week 2022: Taking on the sustainability challenge across the Service Family Accommodation Estate",
    "authors": [
        "David Simpson"
    ],
    "categories": [
        "Accommodation",
        "Energy",
        "Sustainability"
    ],
    "pub_date": "2022-03-18T16:48:53+00:00",
    "content": [
        {
            "text": "This week is British Science Week, a celebration of science, technology, engineering and maths. This year’s theme is ‘growth’ and in DIO, we are showcasing some key projects through which we are using science and innovation to reduce the Defence estate’s carbon footprint, while growing our capabilities in supporting the UK Armed Forces to live, work and train."
        },
        {
            "text": "I’m David Simpson, DIO Regional Delivery Accommodation Asset Manager and Sustainability Champion. I’d like to highlight some of the innovative approaches that the Regional Delivery Accommodation team is taking to meet the challenge of sustainability, including the UK Government’s Net Zero 2050 target."
        },
        {
            "heading": 2,
            "text": "Improving the energy efficiency of Service Family Accommodation (SFA)"
        },
        {
            "text": "We have already carried out considerable works to support the reduction of the carbon footprint of the SFA Estate through projects to install external wall insulation in military homes. The next step is the introduction of decarbonised heating and hot water utilities to SFA, without incurring exceptional costs to residents – any solution should not cost more, and ideally should cost less, in utility charges."
        },
        {
            "text": "Since we last carried out a significant project to decarbonise heating through Air Source Heat Pump (ASHP) installation in homes in 2016, the technology has significantly improved. Building on these advances, we have endeavoured to apply the lessons learned from previous projects. A new project will commence in 2022 at Catterick to install new ASHP and improve the energy efficiency of the SFA homes, and the results will be assessed before potentially being applied to the wider SFA Estate."
        },
        {
            "heading": 2,
            "text": "Leading the way in innovative approaches towards net zero"
        },
        {
            "text": "At the same time, we are supporting industry in developing a unique heating solution through ‘Project Nixie’. This cutting-edge initiative uses existing technology in an innovative way to provide a thermal battery which connects directly to a home’s existing central heating system, supplying decarbonised heating and hot water. Initial testing in a factory environment has shown that the concept is viable, and should operate at less cost than gas central heating."
        },
        {
            "text": "The project will shortly move to a proof-of-concept stage involving the installation of a system in an SFA property, with plans to install initial production models in three SFA homes in due course. Subject to the completion of these trials, wider roll out of the system is planned in the coming years, which will provide us with an excellent option for delivering decarbonised heating and hot water."
        },
        {
            "heading": 2,
            "text": "A wide-ranging approach to sustainability"
        },
        {
            "text": "It’s not all just about heating; the Regional Delivery Accommodation team will shortly publish a comprehensive plan on how we will address sustainability across the Defence estate, along with our Future Defence Infrastructure Services (FDIS) Suppliers. The plan will cover carbon, waste management, staff training, resident engagement and biodiversity. Our target is to decarbonise heating and hot water provision in the SFA Estate by 2035, with the phase-out of gas and oil heating systems and gas cookers. Other planned changes include the replacement of street lighting with photovoltaic (PV) lighting, and the installation of electric vehicle charging capabilities."
        },
        {
            "text": "To help boost biodiversity, a small number of SFA estates have already created ‘no cut’ wildflower areas to enhance the diversity of flora and fauna. This concept has been included in the development of the FDIS Grounds Maintenance Plans for the UK SFA Estate. If managed carefully and sympathetically, these ‘no cut’ areas can really aesthetically enhance the estate as well. Schemes are also planned to provide allotment spaces, building on work already carried out at a number of estates. Gardening, and particularly growing your own vegetables, has a range of wellbeing benefits and we intend to support local allotment schemes wherever this is feasible and there is a demand."
        },
        {
            "text": "Keep an eye on our blog for future updates on these and other initiatives through which DIO Regional Delivery Accommodation is working to provide a sustainable and energy efficient SFA Estate."
        }
    ]
}