{
    "url": "https://educationhub.blog.gov.uk/2022/03/18/childminders-can-continue-to-operate-from-home-if-someone-in-their-house-has-tested-positive-for-covid/",
    "title": "Childminders can continue to operate from home if someone in their house has tested positive for Covid",
    "authors": [
        "Media Officer"
    ],
    "categories": [
        "Childcare",
        "Families"
    ],
    "pub_date": "2022-03-18T17:37:29+00:00",
    "content": [
        {
            "text": "From 17 March childminders can continue to operate at home if someone in a childminder’s household has tested positive or has COVID-19 symptoms."
        },
        {
            "text": "Here we answer some of the questions you might have about the changes in the guidance."
        },
        {
            "heading": 3,
            "text": "I am a childminder, and my partner has tested positive for Covid, can I continue to look after children?"
        },
        {
            "text": "Yes, you can continue to operate your business at home."
        },
        {
            "text": "However, we do advise you to follow the below important steps to reduce the risk of onward transmission."
        },
        {
            "heading": 3,
            "text": "What additional measures should I be taking? "
        },
        {
            "text": "The person who has tested positive, or has COVID-19 symptoms, should avoid contact with the children being cared for in the setting."
        },
        {
            "text": "Where possible, they should use separate toilet and handwashing facilities. If this is not possible, maintain extra cleaning and hygiene routines, particularly after the person has used the facilities."
        },
        {
            "text": "You should also consider the need to reduce the spread of COVID-19 with mitigations, such as ventilation and extra cleaning and hygiene routines. They should be applied where practical and safe to do so. Additional information on how to stay safe and help prevent the spread of COVID-19 is available in the guidance published by the Cabinet Office"
        },
        {
            "text": "Childminders can also consider using alternative places to operate, such as other childminders’ houses, where possible"
        },
        {
            "heading": 3,
            "text": "Do I need to tell the parents of the children at my setting? "
        },
        {
            "text": "Yes, you should notify parents, carers, and any assistants that someone has tested positive or has COVID-19 symptoms, as soon as reasonably possible and maintain open communication with them throughout."
        },
        {
            "heading": 3,
            "text": "What about my risk assessment? "
        },
        {
            "text": "Childminders must comply with health and safety law by reviewing their risk assessment."
        },
        {
            "text": "The risk assessment must demonstrate that the provision of childcare in the setting is safe, and how they will put into place any additional but proportionate measures"
        }
    ]
}