{
    "url": "https://naturalengland.blog.gov.uk/2022/03/18/creating-the-new-homes-and-the-healthy-natural-environment-we-need/",
    "title": "Creating the new homes and the healthy natural environment we need",
    "authors": [
        "Mel Hughes"
    ],
    "categories": [
        "Biodiversity",
        "Environment Act",
        "Protected sites and species"
    ],
    "pub_date": "2022-03-18T09:31:13+00:00",
    "content": [
        {
            "text": "Natural England and Government have provided advice and support this week to help local planners and developers tackle two challenges that can sometimes be seen as in competition – building the homes the country needs while also protecting and restoring nature. In reality, we need to be able to do both for a sustainable green recovery."
        },
        {
            "text": "In partnership with Defra and the Department for Levelling Up, Housing and Communities (DLUHC) we have put together the practical guidance, tools, training and financial assistance that can help 42 local planning authorities (LPAs) ensure that the development their areas require can progress without adding pollution to our most vulnerable rivers, lakes and water bodies. A large number of these ‘habitats sites’ are in an unfavourable condition and will continue to decline unless they are protected from further nutrient pollution damage. Wastewater from new housing developments can make matters worse and undermine ongoing efforts to recover these sites."
        },
        {
            "text": "The package is targeted at the areas where catchments – and the legally-protected nature sites they contain - are most under pressure from high levels of nutrients. It is based on similar support which has already been provided to 32 LPAs, mostly in the south of England, and which has enabled new development to proceed in a sustainable way known as ‘nutrient neutrality’."
        },
        {
            "text": "But why is Natural England doing this now? Nutrient pollution is now a major environmental issue for many of England’s most important places for nature. In freshwater habitats and estuaries, increased levels of nutrients, especially nitrogen and phosphorus, can speed up the growth of certain plants, disrupting natural processes and impacting wildlife. Algal blooms and excessive vegetation growth can kill fish and prevent birds from feeding. These effects also reduce people’s enjoyment of these special places."
        },
        {
            "text": "The sources of excess nutrients include sewage treatment works, septic tanks, livestock, arable farming and industrial processes. These are long-running issues spanning decades and will be complex to resolve. However, without resolution of these we will continue to see a decline in water quality and detrimental effects on our environment. Let’s not forget this is happening at the very time we need a healthy resilient environment to support us in our climate change challenges, points clearly made in our nature positive approach. A healthy environment can help regulate not only water quality but air quality and carbon sequestration too."
        },
        {
            "text": "Government has also outlined its ambitious commitments to restore nature. It has pledged to halt the decline in species by 2030 and increase species abundance by 10 per cent by 2042. We therefore find ourselves at a turning point in what are acceptable levels of pollution and how seriously we take its resolution."
        },
        {
            "text": "The best we can do in the short term is to stop the situation getting worse which is why we have developed a neutral approach to nutrients. This isn’t legalistically driven, it’s an environmental imperative that the regulatory safety net has caught. In the long term we need to work in partnership across catchments and sectors to enact Environment Act targets of reducing nutrient pollution in water by reducing phosphorus loading from treated wastewater by 80 per cent by 2037 and reducing nitrogen, phosphorous and sediment from agriculture to the water environment by 40 per cent by 2037."
        },
        {
            "text": "For now, under the guidance provided by Natural England, LPAs and developers are advised to assess how planning proposals can mitigate the expected increase in nitrogen and phosphorus from a new development so that they can become nutrient neutral."
        },
        {
            "text": "With this advice comes tools and guidance created by Natural England using the latest evidence and bespoke catchment calculators to help assess the site’s current nutrient status and the likely impact of any new development. This allows competent authorities and developers to identify the level of mitigation required to cancel out the additional nutrient pollution expected from a particular project."
        },
        {
            "text": "Many mitigation measures will involve the creation of new wetlands, woodland or grasslands - providing new spaces for nature and recreation in the process - or installing environmentally-friendly sustainable drainage systems known as SuDS."
        },
        {
            "text": "We recognise that nutrient neutrality won’t be easy to adopt in many cases. But we would like to assure our stakeholders that Natural England, working alongside our partners, will support planning authorities and developers to implement it effectively so that they can build sustainable new homes and contribute to healthy rivers, lakes and estuaries nearby."
        },
        {
            "text": "The good news is that nutrient neutrality is already working. In the Solent, partnership working between LPAs, Government, Natural England and the Environment Agency, with the engagement of landowners, has already delivered over 3000 nutrient neutral homes. A Government-sponsored nutrient trading platform will enable further development in the region, and an LPA-led phosphorous mitigation scheme will enable Wiltshire Council to deliver their planned growth through to 2026."
        },
        {
            "text": "In the long run, the further we push on with sustainable solutions to reduce existing pollution, the lighter the need for neutrality should become. We therefore stand ready to work with our partners in planning, development, water and land management to secure the homes and the healthy nature that make attractive places for people to live."
        },
        {
            "text": "Melanie Hughes\nDirector of Sustainable Development"
        }
    ]
}