{
    "url": "https://defradigital.blog.gov.uk/2022/03/18/how-quality-sleep-can-help-maintain-good-mental-health/",
    "title": "How quality sleep can help maintain good mental health",
    "authors": [
        "Katey Melici"
    ],
    "categories": [
        "Defra digital"
    ],
    "pub_date": "2022-03-18T08:00:28+00:00",
    "content": [
        {
            "text": "Sleep is something we all place great value on, without it we are unable to perform the most basic of tasks. Sleeping has an impact on everything we do, especially the ability to do our jobs effectively."
        },
        {
            "text": "When I became aware of World Sleep Day, I thought to myself “this is something very relevant to us all”, and I wanted to share some of my own experiences. There are lots of people who experience issues with sleeping, and many sleep-related clinical disorders such as insomnia, narcolepsy, sleep apnoea, parasomnias, night terrors, and restless leg syndrome. Any of these can lead to the following problems:"
        },
        {
            "heading": 2,
            "text": "Getting to sleep is often the hardest part"
        },
        {
            "text": "I have always struggled with my sleeping patterns. My main issue is getting to sleep in the first place. Once I am finally there, I seem to stay asleep, even if there are toilet trips during the night! I feel that the main problem, for me, is that my brain seems to wake up as soon as there are no distractions."
        },
        {
            "text": "I am constantly on the go throughout the days, everything feels like it is going at a rate of 100mph. I usually experience a feeling of exhaustion in the afternoon around 2-3pm. However, as soon as my head hits the pillow, and there is nothing but the thoughts in my head to occupy me, then I am wide awake."
        },
        {
            "text": "I have tried and tested a multitude of methods to send me off to dreamland. The most effective is medication, however I try to avoid this as it makes me drowsy the next day. I sometimes use herbal sleeping tablets, which have some effect. I also listen to meditation or relaxing sounds. Guided Meditation by Aura and Relaxing Campfire Sounds are the two I find most effective. In Defra we get free access to the ‘Headspace’ app, which provides themed sessions, designed to help you manage stress, fall asleep, exercise mindfully, remain focused, and more."
        },
        {
            "text": "If I don’t get enough sleep, I struggle to maintain focus and it severely impacts on my performance at work. Anything less than six hours is disastrous for my ability to concentrate."
        },
        {
            "heading": 2,
            "text": "Keeping track is a great place to start"
        },
        {
            "text": "I decided it would be a good idea to keep a diary of my sleep for a week (I managed six days of tracking, I forgot to wear it on the Sunday!), and I have used my Fitbit to analyse this each night. Here are the results for the week overall (FYI the day stated is the day the sleep was noted e.g. Friday is the record of Thursday's sleep)."
        },
        {
            "text": "I go to bed at the same time every night, usually around 10:30-11pm. I don’t usually watch TV in the evenings, as I go to the gym at 5:30, then there are chores at home. I shower around 9pm, and then either look at my phone or read whilst sitting in bed. My alarm is set for 7:30am Mon-Fri, and usually a little earlier on the weekends."
        },
        {
            "text": "I have actively tried to avoid looking at my phone after 10pm this week, to see if it makes a difference to being able to sleep well."
        },
        {
            "text": "Key: The red represents being awake, dark blue is time in deep sleep, medium blue is REM, and the palest blue is light sleep. The number on the right is a score out of 100. "
        },
        {
            "heading": 2,
            "text": "My sleep diary"
        },
        {
            "heading": 3,
            "text": "Monday"
        },
        {
            "text": "This was an unusual week for me, I lost a close family member unexpectedly on Monday, and it manifested in me feeling exceptionally tired throughout the whole week. This night was one of the worst sleeps of the week as I had a lot on my mind. The frequency of the red at the beginning indicates that I was struggling to get asleep, it is different from the usual pattern."
        },
        {
            "heading": 3,
            "text": "Tuesday"
        },
        {
            "text": "Tuesday was an improvement on Monday, I used my meditation music to try and get off to sleep, but I did not struggle to sleep this night as I was exhausted from the prior day’s events."
        },
        {
            "heading": 3,
            "text": "Wednesday"
        },
        {
            "text": "This was the best of the week. I have PT sessions & spin class on Tuesdays & Thursdays, and boxing on a Wed so I am physically worn out. It is usual for me to sleep well towards the end of the working week."
        },
        {
            "heading": 3,
            "text": "Thursday"
        },
        {
            "text": "This was unusual as I was up early (6:30) to get to a team meeting in Birmingham. I had intended to get to sleep earlier than 23:33 but I could not relax."
        },
        {
            "heading": 3,
            "text": "Friday"
        },
        {
            "text": "This was a typical Friday night sleep. I have the gym early on a Saturday, and usually get up around 7am."
        },
        {
            "heading": 3,
            "text": "Saturday"
        },
        {
            "text": "This is the one night of the week we drink alcohol, and it reflects in my sleep pattern. I actually went to bed at 23:30, but I did not fall asleep until 00:48. I also woke late on Sunday, due to drinking wine the night before. We only shared a bottle with dinner, but it really does still impact the sleep quality. Lots of red at the beginning, again indicative of alcohol consumption."
        },
        {
            "text": "In conclusion, I feel that there is definitely room for improvement, I shall try and persevere with putting my phone down an hour before I get into bed. I also intend to take up yoga on a regular basis, I really got into it last year and the evening sessions really chilled me out before bed!"
        },
        {
            "heading": 2,
            "text": "Further information"
        },
        {
            "text": "World Sleep Day is an annual event, intended to be a celebration of sleep and a call to action on important issues related to sleep, including medicine, education, social aspects and driving."
        }
    ]
}