{
    "url": "https://mojdigital.blog.gov.uk/2022/03/18/how-well-do-we-know-our-users/",
    "title": "How well do we know our users?",
    "authors": [
        "Gina Gill"
    ],
    "categories": [
        "our users"
    ],
    "pub_date": "2022-03-18T17:18:22+01:00",
    "content": [
        {
            "text": "Every fortnight I host a stand up (these days a sit down) for the whole of my team. The focus of these stand-ups changes from fortnight to fortnight. This week we heard from a Service Owner in the Office of the Public Guardian who is working hand in glove with digital colleagues to transform the way in which his services are delivered."
        },
        {
            "text": "As he was talking it made me think about how well we really know our users - even those that we work with regularly in the organisation, never mind those outside. Which reminded me of a weeknote that I wrote the last time I visited a prison, which I’d like to share (some of) with you."
        },
        {
            "text": "The roll out of the Prison Technology Transformation Programme (PTTP) is almost complete at HMP Leeds, the feedback is overwhelmingly positive, and users are really pleased with their new technology. The governor and team are really enthusiastic about Digital and Technology, understand the change we can help them drive, and are complementary about working with us. But despite all of this, as we were walking around the prison and speaking to people, I began to wonder how much we really understand our users."
        },
        {
            "text": "Not because I think we do a bad job of working with our users and trying to understand them, but because we work in a complex environment with many and varied users, cultures and ways of working. And because I think there’s more we can do to understand all of this and to make our users feel like we understand them and their environment."
        },
        {
            "text": "How many of us really understand how our users operate in a prison? That there might be 8 prison officers using the same desktop device on a wing so nobody really feels responsible for the kit? That offenders might walk into the office and see what’s on that device? That a prison officer is more likely to swap their desktop with someone else’s if it stops working rather than call the service desk to save time (including carting it all the way across a prison through locked doors)?"
        },
        {
            "text": "We are across many parts of our team doing more to understand our users. Our digital prisons leadership team spend one day per month in a different prison. I am off to shadow some caseworkers at the Legal Aid Agency. But is that enough? How much is enough?"
        },
        {
            "text": "Looking forward to continuing this conversation on the road, as we launch our strategy in the coming weeks. "
        }
    ]
}