{
    "url": "https://teaching.blog.gov.uk/2022/03/18/how-to-implement-the-national-tutoring-programme-at-your-school/",
    "title": "How to implement the National Tutoring Programme at your school",
    "authors": [
        "Josh Lampard"
    ],
    "categories": [
        "COVID-19 support",
        "Secondary schools"
    ],
    "pub_date": "2022-03-18T10:51:45+00:00",
    "content": [
        {
            "text": "Josh Lampard is Assistant Headteacher at Farlingaye High School in Suffolk. He shares his experience of using the National Tutoring Programme (NTP) to provide online tuition for year 10 and 11 students via NTP Tuition Partner, MyTutor.  "
        },
        {
            "text": "Having used the NTP both this academic year and last, here are my top hints and tips for setting your school up for success to deliver tuition: "
        },
        {
            "text": "Allow time to identify the students and subjects you want to focus on  "
        },
        {
            "text": "At a strategic level, we selected which subjects and year groups we wanted to focus on. For this academic year, we chose to provide tuition for our year 10 and 11 students, with the aim to support them in preparing for their summer exams. We then outlined the selection requirement and sent these details to the subject teams. I recommend that you take the time to ensure groups are set up appropriately in tutoring sessions based on level, gaps, and topic need. "
        },
        {
            "text": "Identify internal staff to support the programme"
        },
        {
            "text": "We appointed a member of the Senior Leadership Team to oversee all aspects of the school’s involvement in tuition. Alongside this, we assigned subject leads (in our case, English, Maths, Science) who monitor and maintain pupil attendance at tuition sessions, through reminders and having conversations with those taking part."
        },
        {
            "text": "Engage parents and teachers as early as you can, and communicate regularly "
        },
        {
            "text": "As soon as we had identified the students, we engaged parents and carers with tuition as early as possible and this has been vital to its success. The difference in student engagement when parents and carers have been involved and engaged has been huge. For example, we sent an ePostcard which included key information, to parents and carers prior to their child starting tuition. We then reinforced their involvement up to and during the programme.  "
        },
        {
            "text": "We also ensured all subject staff were aware of the students taking part in tuition, so that they could really encourage attendance and its benefits when talking to those students. We regularly update all staff via the school bulletin, and this enables links and conversations across subject areas. Those little moments, where a form tutor or a history teacher takes an interest in a student’s science tuition, are a real game changer. "
        },
        {
            "text": "Think about the specific needs and barriers of your students "
        },
        {
            "text": "To maximise student engagement with the NTP, put as much support in place as possible to remove any barriers. For example, previously we would share lots of information with students' before they started tuition. This often led to them missing vital aspects, not reading it because it was too much or giving up part way through. So, we developed a small, carefully selected ‘hit’ of information, which has worked better. The barriers might be so simple, you had not thought about it, but for your students it can make all the difference. So, I would suggest that you speak with them and turn their barriers into opportunities to be successful. "
        },
        {
            "text": "We also created an ePostcard which included log-in details for students before their first session. Alongside this, we gave them each a pair of headphones with a built-in microphone. Most students welcomed having these to support their learning, potentially removing another barrier they might have. "
        },
        {
            "text": "Take opportunities to reflect, review and celebrate "
        },
        {
            "text": "We collect feedback from the students taking part in tuition every five weeks, via an online survey. We also award prizes and certificates to those students who regularly attend sessions. We have found this has dramatically improved continued engagement.  "
        },
        {
            "text": "Our students who have participated in tuition have made great progress in terms of academic development, and it has also improved their overall confidence towards all their GCSE exams.  "
        }
    ]
}