{
    "url": "https://deframedia.blog.gov.uk/2022/03/18/rebuttal-of-claims-on-tb-cull-effectiveness/",
    "title": "Rebuttal of claims on TB cull effectiveness",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Weekly stories"
    ],
    "pub_date": "2022-03-18T17:41:52+00:00",
    "content": [
        {
            "text": "There has been widespread, misleading media coverage about the impact of badger culling on lowering Bovine tuberculosis (bTB) disease levels in high risk areas of England. Coverage includes in the Times and Independent."
        },
        {
            "text": "The articles cite a report in the Veterinary Record, written by anti-cull activists, claiming that licensed culls have “been ineffective in reducing bTB in  cattle herds”."
        },
        {
            "text": "Experienced scientists from the Government’s Animal and Plant Health Agency have reviewed the report and found its analysis is scientifically flawed. It has manipulated the data in a way that makes it hard to understand the actual effects of badger culling and therefore its conclusions are wrong."
        },
        {
            "text": "Today, the Chief Veterinary Officer, Christine Middlemiss, and Chief Scientific Adviser, Gideon Henderson, have also published a letter in Vet Record, which rebuts the report’s claims. The CVO has also written a blog about this here."
        },
        {
            "text": "A proper inspection of publicly available data would have shown clear declining trends in disease following the start of culling which is not seen in areas without culls. For example, we have a reduction in officially TB free withdrawn herd incidence of 45% in the third year of culling and 50% in the fourth year of culling."
        },
        {
            "text": "These findings have also been corroborated by the Downs et al study, published in 2019, which demonstrated that the cull has resulted in significant reductions in the spread of the disease to cattle, showing reductions of 66% and 37% in the two areas analysed."
        },
        {
            "text": "A Defra spokesperson said:"
        },
        {
            "text": "The Government has been clear it does not want to continue the cull indefinitely, which is why we are issuing new intensive cull licences for the final time this year.  We are transitioning away from intensive culling to focus on badger vaccination, improved on-farm testing and cattle vaccination when available."
        },
        {
            "text": " "
        }
    ]
}