{
    "url": "https://ukhsa.blog.gov.uk/2022/03/18/thunderstorm-asthma-and-public-health-looking-back-to-move-forward/",
    "title": "Thunderstorm asthma and public health – looking back to move forward",
    "authors": [
        "Ross Thompson",
        "Emer O'Connell",
        "Alex Elliot"
    ],
    "categories": [
        "UKHSA science"
    ],
    "pub_date": "2022-03-18T08:59:49+01:00",
    "content": [
        {
            "text": "In June last year, UKHSA's Real-time Syndromic Surveillance system detected a potential episode of thunderstorm asthma; an increase in people reporting asthma symptoms linked to thunderstorm activity."
        },
        {
            "text": "As spring blossoms and we approach the season for these events, in this British Science Week blog we take a look at the interplay between the weather and our health and how we can use our scientific surveillance systems to inform future public health responses."
        },
        {
            "text": "Thunderstorms, like many types of weather phenomena, can be dramatic, illuminating the skies and inspiring folklore, legends and songs. Lesser known is the impact thunderstorms can have on health."
        },
        {
            "text": "Since first formally recorded in 1983, there have been instances where thunderstorm activity has been linked to increases in people reporting symptoms of asthma and seeking medical attention for issues with their breathing. These episodes are termed ‘thunderstorm asthma’."
        },
        {
            "text": "We don’t fully understand why these events trigger breathing problems and this makes it very difficult to predict when they are likely to happen."
        },
        {
            "text": "However, the air flow within a thunderstorm system is thought to be important. Thunderstorms form when warm wetter air on the earth’s surface is beneath much cooler air higher in the atmosphere. The warm air rises quickly (known as up-draft) which causes the cool air to flow down towards the ground (known as down-draft). As the warm air rises, it cools and the moisture condenses into clouds and water molecules."
        },
        {
            "text": "As the cold air (down-draft) falls to the ground, increasing pressure generates a strong cross wind on the surface. This surface wind blows across grass and plants, picking up pollen grains and fungal spores (tiny biological particles by which fungi reproduce), which are carried on air currents. This is thought to be the reason why more pollen is in the atmosphere during a thunderstorm than you might expect."
        },
        {
            "text": "It is then hypothesised that the pollen and/or spores are caught in the up-draft and get pulled up into the clouds and storm system. The excess moisture in the clouds enter into the pollen grains and fungal spores causing them to break apart into smaller granules and/or other particles. Rain then brings the tiny micro-particles down from the clouds to ground level where the micro-particles can be inhaled deep into the lungs, causing breathing problems."
        },
        {
            "text": "In addition to the meteorological factors described, there are also environmental and individual factors which have been associated with these episodes.  Environmental factors include relatively high levels of pollen and or fungal spores, usually following a period of warm and humid days."
        },
        {
            "heading": 2,
            "text": "Who is affected by thunderstorm asthma?"
        },
        {
            "text": "While everybody may be at risk from thunderstorm asthma, previous events indicate young adults (below 30) can be particularly affected. Although data is somewhat limited, there is some evidence that certain people are at greater risk of experiencing thunderstorm asthma. These include those who have:"
        },
        {
            "heading": 2,
            "text": "Past experience of thunderstorm asthma"
        },
        {
            "text": "The largest thunderstorm asthma event recorded globally occurred in Melbourne, Australia on Monday 21st November 2016.  This was the first hot day of the year with temperatures in the high to mid 30C’s following a wet and warm spring."
        },
        {
            "text": "A severe thunderstorm warning was issued mid-afternoon. The storm moved from the west of the state of Victoria, with the storm front moving across the region of Melbourne from about 17:00hrs."
        },
        {
            "text": "From about 18:00hrs the health care sector saw a surge in patients complaining of shortness of breath, with respiratory or asthma-related symptoms. The ambulance service, hospitals and emergency departments, general health care providers all felt the strain of increase service use, which continued into the following morning."
        },
        {
            "text": "Ambulance calls saw a 73% increase in call outs; emergency department presentations increased by 58%, the number of people presenting with breathing issues increased by 672%. Asthma-related hospital admissions increased by 992%, resulting in 30 Intensive Care Unit admissions. Following a coroner’s inquest, 10 deaths were associated with the event."
        },
        {
            "text": "In England, the first recorded episode of thunderstorm asthma occurred in Birmingham in July 1983 and there have been a number of recorded events across the country since."
        },
        {
            "text": "Most recently, a potential episode of thunderstorm asthma was detected by UKHSA’s real-time syndromic surveillance systems in June last year (2021)."
        },
        {
            "text": "Syndromic surveillance is a tool we use to collect information about the general public’s health and to see, in real-time (each day), whether there are any diseases which are following an unusual trend, like a sudden increase at an unexpected time of year. May was generally cool and wet in England, whilst June saw a prolonged period of above average temperatures."
        },
        {
            "text": "Pollen levels at the time were consistently high or very high in all areas of England. On 17th June, severe thunderstorms were forecast across the Southeast and East of England as the warm period of weather broke down and gave way to a weather front moving in from the Southwest, resulting in a yellow (‘be aware’) thunderstorm warning being issued by the Met Office."
        },
        {
            "text": "During this time, we noted large spikes in indicators for asthma and breathing difficulty across several of UKHSA’s syndromic surveillance systems, including NHS 111 calls and emergency department attendances."
        },
        {
            "text": "The spikes observed were most notable in patients aged 15-45 years old, and across London and the Southeast and East of England. This was one of the most significant events of its kind detected by these syndromic systems."
        },
        {
            "text": "For example, emergency department attendances for asthma increased by 560% on 17 June compared to the average number of weekday daily attendances during the previous 4 weeks. Further details are available through the PHE real-time syndromic surveillance report for the week of this event, or through the scientific report published describing the findings."
        },
        {
            "heading": 2,
            "text": "Why is thunderstorm asthma a public health issue in England?"
        },
        {
            "text": "Asthma and hay-fever are very common conditions in the UK with statistics from Asthma and Lung UK suggesting that 1 in 11 children and 1 in 12 adults, (equivalent to 5.1 million people) currently receive treatment for asthma in the UK."
        },
        {
            "text": "Estimates from the British Lung Foundation suggest that 8 million people (12% UK population) have been diagnosed with asthma. Allergy UK suggest that 10-30% of adults and as much as 40% of children suffer from allergic hay-fever in the UK.  There is therefore a significant susceptible population of otherwise potentially healthy individuals who may be affected by thunderstorm asthma."
        },
        {
            "text": "Climate change may also increase the likelihood of such events. While there is limited evidence that changes to the climate will bring about more intense and frequent thunderstorms, there is good evidence that earlier and longer growing seasons may lead to higher concentrations of aeroallergens such as grass pollen.  It doesn’t stop there, however; increased CO2 concentrations have been linked to an increased spore count of allergenic fungi (Alternaria alternata) and increased atmospheric pollen."
        },
        {
            "text": "Therefore, a combination of increased growing periods with favourable weather conditions, plus higher levels of CO2 from human activities is likely to increase the risk of thunderstorm asthma events in the future. In addition, there is evidence that interactions of pollen and air pollution can potentially increase the potency of the allergic reaction of susceptible individuals."
        },
        {
            "heading": 2,
            "text": "What are we doing about thunderstorm asthma?"
        },
        {
            "text": "In response to the potential risk to health, UKHSA is working with experts from across the organisation, the Met Office and academia."
        },
        {
            "text": "This work will include the development and publication of the scientific evidence on the role of a range of weather conditions on the observed health effects during these events. The findings of this work will be used to determine what risk mitigation measures could be put in place to protect health and inform future public health response."
        },
        {
            "text": "If you already have a diagnosis of asthma, the NHS has helpful advice about actions you can take to manage your condition. Asthma and Lung UK also have information on weather as a trigger for asthma."
        },
        {
            "text": "As our climate warms and changes to natural systems continue it is possible that episodes of thunderstorm asthma may happen more often in the coming years."
        },
        {
            "text": "That’s why it’s vital that we increase our understanding of this phenomenon so that these episodes can be better anticipated, and effective health protection actions developed so that thunderstorms, with all the drama that they bring, remain inspiration for stories and myths of legends, and not stories of real-world public health impacts in England."
        }
    ]
}