{
    "url": "https://educationhub.blog.gov.uk/2021/11/30/99-9-of-schools-are-open-how-new-safety-measures-will-help-them-stay-open-to-the-end-of-term/",
    "title": "99.9% of schools are open – how new safety measures will help them stay open to the end of term",
    "authors": [
        "media officer"
    ],
    "categories": [
        "Attendance",
        "Coronavirus",
        "school absence"
    ],
    "pub_date": "2021-11-30T13:47:39+00:00",
    "content": [
        {
            "text": "Attendance is a top priority for the government as we know that being in school is vital both for protecting young people’s education and for their mental health."
        },
        {
            "text": "The latest statistics show that 99.9% of schools remain open and our guidance is clear that schools should be doing everything possible to keep children in face-to-face education."
        },
        {
            "text": "We want to make sure schools stay open right until the end of term apart from in very rare instances. Schools should not be routinely restricting attendance and should instead ensure other preventative measures, such as supervised testing, are deployed on top of existing measures including testing, ventilation and hygiene if needed to respond to an increase in case rates."
        },
        {
            "text": "On Saturday 27 November, the Prime Minister introduced new temporary measures because of the Omicron variant, as a precaution. So, because of these precautionary measures, there have been some slight changes to the safety measures in school."
        },
        {
            "text": "While the guidance largely remains the same, these additional temporary measures, along with the existing ones, will help to ensure that students can continue to access face to face learning for the remainder of the year and help buy scientists the time to understand the variant better."
        },
        {
            "text": "More about what these measures mean in school is available here: What the new temporary COVID-19 measures mean for early year settings, out-of-school settings, schools, colleges and universities - The Education Hub (blog.gov.uk)."
        },
        {
            "text": "Schools should continue to ensure there is increased ventilation in classrooms, face coverings in communal areas, good hygiene should be promoted, and all educational and childcare settings should continue to encourage staff and students to test twice weekly using lateral flow device (LFD) tests."
        },
        {
            "text": "So far more than 277,838 CO2 monitors have been delivered to schools and colleges, with a further update coming this week. If there are particularly high Covid case rates in schools or colleges in their local areas, Directors of Public Health can advise the reintroduction of temporary additional protective measures."
        }
    ]
}