{
    "url": "https://mojdigital.blog.gov.uk/2021/11/30/desistance-finding-a-humane-and-authentic-voice/",
    "title": "Desistance: finding a humane and authentic voice",
    "authors": [
        "Martin Liddament"
    ],
    "categories": [
        "Content",
        "Desistance"
    ],
    "pub_date": "2021-11-30T16:25:35+01:00",
    "content": [
        {
            "text": "“It’s horrible, being called an ex-offender. It’s a label that you can’t peel off.”"
        },
        {
            "text": "The quote above came from a person speaking at a support group. It’s a reminder that it matters how we talk about people. The words we use to describe our fellow humans merit deep consideration. "
        },
        {
            "text": "Language has an effect on behaviour and can influence whether or not someone will change for the better. "
        },
        {
            "text": "With nearly 35% of people in prison self-reporting learning difficulties and functional illiteracy levels at around 50% it is obvious that reading and understanding can be a barrier in many areas. Clarity and simplicity are essential in overcoming this, but so are openness and humanity."
        },
        {
            "text": "As content designers, it sometimes feels that the language of the criminal justice system hinders rather than helps. It’s often used like a prop or shield rather than a tool for positive communications. "
        },
        {
            "text": "Excessive formality and legal phrasing bolster interactions based on power and authority. They reflect a model where one party feels a need to be above the other. Stern words are spoken because there’s a belief that they will fall on a person with solemn weight and have more impact. "
        },
        {
            "text": "But look closer, and you’ll find ideas appearing across the service that are challenging these ways of thinking. "
        },
        {
            "text": "The content team recently had a meeting where we were given a talk on desistance, which is part of these changes. It’s an academic term, but it’s practical. Desistance is how to understand people’s thinking and behaviour and help them move themselves towards a happier and more productive life."
        },
        {
            "text": "Special thanks to Olivia Price, a senior support manager in the Public Protection Group for explaining the concept to us. Olivia is also the subject matter expert for the Assess Risks and Needs team. It was a fascinating talk and Olivia went a step further with a short role-play where a member of the content team volunteered to be interviewed. "
        },
        {
            "text": "With a few subtle changes to her questions and comments, Olivia showed how a hard, confrontational approach could be replaced with one that actively helps the individual. The fundamental shift in emphasis was striking. It brought home to us that everyone thinks and feels and deserves to be treated with empathy."
        },
        {
            "text": "With its focus on demonstrating care about the person, avoiding stigmatising terms, and showing respect through open and honest language, desistance fits well with content design principles. "
        },
        {
            "text": "We know, for example, that excessively formal language is depersonalised and often uses the passive voice, which positions the individual as a subject to whom things happen. An active voice is clearer and easier to understand. It speaks directly to the listener and implies agency and equality. "
        },
        {
            "text": "In desistance theory and practice these things are important. ‘Offenders’ are understood as individuals who want pretty much what everyone wants, but have counter-productive methods for achieving their goals. Shouting at them through physical and emotional barriers and telling them they are wrong is not going to help. If we want people to act and think the way we do, we have to include them in our community of thought. Desistance is therefore about building genuine relationships. Its language demonstrates care about the supervisee, and avoids terms that imply control, monitoring and surveillance."
        },
        {
            "text": "Some of this is already emerging in changes to language in the probation service. ‘Offender’ became ‘service user’ fairly recently, then turned into ‘supervised individual’. It’s now ‘person on probation’. In our digital services, we are going further and using the names of people wherever possible."
        },
        {
            "text": "Humane language can still retain and even improve on accuracy. ‘Prison stock’ has harsh undertones. ‘Prison population’ is better. A person ‘stays in their room’ or ‘avoids others’ rather than being called a ‘self-isolator’. Individuals are not let out for ‘association’ but to have ‘social time’. Unhelpful labels are starting to be replaced."
        },
        {
            "text": "Desistance is still proving itself as an approach, but it’s one that everyone involved in communications within the service should take time to understand."
        },
        {
            "text": "Further reading:"
        }
    ]
}