{
    "url": "https://socialcare.blog.gov.uk/2021/11/30/fighting-against-micro-aggressions-for-minority-ethnic-nurses/",
    "title": "Fighting against micro-aggressions for minority ethnic nurses",
    "authors": [
        "Irene Ibanda"
    ],
    "categories": [
        "Care and support",
        "Recognition",
        "Viewpoint",
        "Workforce",
        "WRES"
    ],
    "pub_date": "2021-11-30T12:21:19+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Speaking up"
        },
        {
            "text": "Racism and micro-aggression have no place in the workplace and yet many minority ethnic nurses and healthcare professionals report experiences of discrimination. I’ve made it my mission to promote diversity and inclusion across the field so that future generations can get on with the important job of caring, without fears about prejudice."
        },
        {
            "text": "I started to speak up when I was in the second year of my nursing degree at Sheffield Hallam University. As a student representative from a minority ethnic background, other nursing students would often share their experiences with me. Many minority ethnic students had faced discrimination while on placement, ranging from micro-aggressions to open and direct racism."
        },
        {
            "text": "These stories reflected my own experiences and appear to be widespread throughout the profession. Minority ethnic students and staff frequently face demeaning and offensive comments about their bodies, cultural traditions and professional competency."
        },
        {
            "text": "One persistent microaggression surrounds the misuse of minority ethnic names. It is common for people to use nicknames or shortened names when pronouncing someone’s name is not convenient for them. Often, they won’t even try to say it properly and have no idea of how important a name can be to someone. For example, in African culture, large ceremonies are held when children are named, as the name forms part of their identity."
        },
        {
            "heading": 2,
            "text": "Educating the educators"
        },
        {
            "text": "Within education, microaggressions can lead to serious consequences for minority ethnic students. One student was set to fail the communications part of their placement. It later transpired  this was not due to any weakness on the student’s part, but rather because their placement mentor struggled with their accent. Issues like this should never hold students back."
        },
        {
            "text": "I decided to take a stand and work towards creating a better working environment for my minority ethnic peers in this sector. A lecturer of mine suggested I join the Nursing and Midwifery Minoritised (NMM) group. The group was founded by Ifrah Salih, a senior lecturer and PhD student at Sheffield Hallam University. It provides students with a safe space to share their personal experiences of placement and support each other. With the support of this group, I started raising issues to the university and even spoke at the Royal College of Nursing’s Black History Month Conference in 2020."
        },
        {
            "text": "Since qualifying and joining Cygnet Acer Clinic as a staff nurse, I have worked closely with management to set up an equality and diversity initiative and I have become the first-ever minority ethnic champion at my hospital. My aim in this role is to be a bridge between all staff so that everyone can feel connected."
        },
        {
            "text": "There are sometimes awkward conversations when we flag offensive comments, but it often comes from a lack of knowledge. That’s why I’ve been engaging in informal awareness-raising work with non-minority ethnic colleagues where we discuss cultural differences to minimize harmful misunderstandings."
        },
        {
            "heading": 2,
            "text": "Recognition spurring change"
        },
        {
            "text": "I feel so honoured and humbled that my work with NMM has been recognized in the shortlist for the Mary Seacole Award for Outstanding Contribution to Diversity and Inclusion, within the Student Nursing Times Awards. Sometimes people ask me why I choose to stand up and speak about these issues, but I feel the need for change is far greater than my fear of how people are going to see me. It has not always been smooth sailing and some people get very defensive but we still need to have those conversations."
        },
        {
            "text": "Racism is a learned behaviour, which means we can unlearn it with enough education. I’d like to do more work around hospitals and schools to raise awareness of direct and indirect racism. I have four children myself and I know if we speak to kids at school about racism, they will go home and pass on the message to their families."
        },
        {
            "text": "I think diversity in the healthcare sector has come a long way and I’ve been pleased to see that Cygnet has invested in resources to make all services inclusive for staff and service users. For example, we’ve made sure that there are religious texts and prayer mats available for those who need to pray. We have also been celebrating key milestones such as Black History Month, Women’s Equality Day and Pride."
        },
        {
            "text": "However, there is still work to do in making sure  diversity reaches management level."
        },
        {
            "text": "Minority ethnic staff in healthcare don’t have the same opportunities for promotion as their white colleagues, particularly those doing agency work. For example, in 2019 the Surash Pearce Report found that BME staff reported having fewer opportunities to progress but more harassment and discrimination at work. I hope these patterns will soon change."
        },
        {
            "text": "The nomination from the Student Nursing Times came as a complete surprise but it encourages me to continue this vital work. I hope we can continue to have difficult conversations to eliminate racism and micro-aggressions in healthcare settings."
        }
    ]
}