{
    "url": "https://videosurveillance.blog.gov.uk/2021/11/30/how-many-commissioners-does-it-take/",
    "title": "How Many Commissioners Does it Take?",
    "authors": [
        "frasersampson"
    ],
    "categories": [
        "Biometrics",
        "Biometrics and Surveillance Camera Commissioner"
    ],
    "pub_date": "2021-11-30T09:47:49+00:00",
    "content": [
        {
            "text": "How Many Commissioners Does it Take…?"
        },
        {
            "text": "It may sound like it came from a Christmas cracker but the question of how many commissioners are needed in the area of surveillance camera regulation is a key part of the government’s review of data reform and is an important one."
        },
        {
            "text": "At the moment the law requires the appointment of a Surveillance Camera Commissioner to oversee the use of surveillance camera systems by police and local authorities in public space.  The role is independent of government (or anyone else) and the Commissioner must publish an annual report which goes to parliament via the Home Secretary.  My first report has just been published.  The same law also requires there to be a commissioner to oversee the retention and use of biometric material (essentially DNA and fingerprints) by the police in the UK.  While each statutory role is separate and has been held by different people in the past, I was appointed to cover both at the same time, reducing the number of commissioners and increasing the consistency of approach. Incidentally I have just published my report as biometrics commissioner which can be found here."
        },
        {
            "text": "Annual Report Content"
        },
        {
            "text": "My surveillance camera report covers the period between 2020-21 when my predecessor, Tony Porter, was in post and focuses on key activity and developments in the fast-evolving area of surveillance.  The report covers issues such as the use of facial recognition technology and the judgment of the Court of Appeal in the case brought against South Wales Police. It also covers activity that has been undertaken in furthering the National Surveillance Camera Strategy including body worn devices, automated number plate recognition and the long-awaited revision of the Code of Practice.  The report sets out the Commissioner’s role and functions which the government has proposed transferring to the Information Commissioner’s Office (ICO) along with those of the Biometrics Commissioner and is seeking views on the idea.  My detailed response can be found here.  For those who want to skip to the conclusion, I don’t think it’s wise or workable and I set out the evidential basis for that view in the formal response.  In short, while there has always been a significant element of ‘data protection’ engaged in the area of camera surveillance, there are many respects in which the commissioner’s functions are wider than upholding individual rights of the data subject.  If people decide not to attend a public protest, for example, because they believe their photographs will be collected by the police, or fear their vehicle number plates will be stored for future monitoring, this would represent a significant impact on their fundamental rights in a mature democratic society but has little to do with data protection. Our data laws also have limits on which aspects of our lives they cover.  For example, the hideous offending of a recently convicted murderer did not, so far as I can see, breach any “data protection principles” even though he recorded his repellent abuse of human bodies in a hospital mortuary, because our data laws only protect the privacy and dignity of the living. While no official ‘surveillance’ was involved, there have since been calls to introduce mandatory CCTV in hospital mortuary areas as a result – were this to happen the limits of the laws that protect the ethical use of intrusive surveillance beyond data compliance would need to be reviewed."
        },
        {
            "text": "The Changing Context of Surveillance"
        },
        {
            "text": "The figures from the last decade show a huge increase in the presence of public cameras.  When measured in cameras-to-people, London was recently ranked the 3rd most surveilled city on Earth (having an estimated 691,000 cameras for 9,425,622 people = 73.31 cameras per 1,000 population); in cameras per square mile, that’s 1,138.48 cameras making London the 2nd most surveilled city in the world.  Add in mobile camera platforms such as drones and wearable devices and it gets more speculative - and when privately owned and operated cameras are factored in, it becomes anyone’s guess (literally).  This increase in camera use has been matched by an increase in the public attention it has drawn. Although much harder to quantify, public concern still counts and while it does not lend itself to worries-per-1,000 parents or miles-by-anxious-motorist it is as real and present as the cameras in our streets, bus lanes, workplaces and schools."
        },
        {
            "text": "We are getting more used to surveillance and are installing our own personal systems more readily and cheaply than ever before.  But when it’s done by the State with all its apparatus of enforcement some feel surveillance monitoring to be highly questionable - especially as the Government doesn’t yet follow its own Surveillance Camera Code; when expanded into schools and other areas of young people’s lives the surveillance sensitivities and risks are amplified.  The law has long recognised the specific vulnerability of children and young people when you capture and retain their biometrics - in fact this is the reason behind the Protection of Freedoms Act that created my roles and functions almost 10 years ago. We need to be able to have confidence in the whole ecosystem of surveillance and be sure that what is technologically possible is only being done in a way that is both legally permissible and societally acceptable.  That’s the ‘lightbulb’ that needs changing here. How many commissioners it will take is a matter of ongoing deliberation and I’d encourage answers via email to our team."
        }
    ]
}