{
    "url": "https://educationinspection.blog.gov.uk/2021/11/30/inspection-timetable-what-will-the-additional-funding-for-inspection-will-mean-for-your-school/",
    "title": "Inspection timetable: What will the additional funding mean for your school?",
    "authors": [
        "Christopher Russell"
    ],
    "categories": [
        "exempt schools",
        "inspection"
    ],
    "pub_date": "2021-11-30T11:29:26+00:00",
    "content": [
        {
            "text": "Chris Russell, our National Director for Education, on changes to the school inspection timetable."
        },
        {
            "text": "Since September we’ve returned to inspecting schools, including outstanding schools, after the government brought our legal duty to inspect every school back into force. We are glad to be seeing what’s happening for children, having conversations with teachers, and building on what we learned through our visits last year. We recognise the huge efforts being made to give pupils and learners the education and support they need through the pandemic."
        },
        {
            "text": "And, as I’ve said before, we do recognise that this isn’t business as usual. The impact of the pandemic will vary depending on the circumstances of each school. So, we’ve made some further changes to our deferral policy to reflect how deferral requests are being dealt with in practice. As you would expect, we are considering decisions carefully on a case-by-case basis, based on the particular issues that individual schools are facing. We fully appreciate the challenges, and most deferrals are being granted. We’ll be publishing our revised policy soon."
        },
        {
            "heading": 3,
            "text": "The inspection timetable"
        },
        {
            "text": "We recently announced that we’ve been given some extra funding by government to catch up on inspections delayed by the pandemic, and to help reassure parents that children’s learning is getting back on track. Understandably, schools want to know how they’ll be affected, so this post sets out what the change means in practice."
        },
        {
            "text": "The first thing to say is that the changes won’t have any effect on inspections this academic year, which are already planned."
        },
        {
            "text": "The second is that this is about getting inspection timescales back on track after the COVID disruption. It’s not about inspecting individual schools more often than before COVID hit."
        },
        {
            "text": "Before the pandemic, most good schools were usually inspected once every 4 years. Because of lockdowns and restrictions, routine inspections were put on hold for 18 months and we said it would take us until summer 2026 to get round all schools (including previously exempt outstanding schools) once we restarted. This meant that a typical good-rated school was likely to be inspected 5 or 6 terms later than it would have been."
        },
        {
            "text": "The new funding means that we can bring this forward slightly. Including last term’s inspections, we’re now aiming to get to every school once by the summer of 2025. This isn’t a radical change, but it will provide more timely assurance that they are on the right track. We’ll start gradually increasing the number of inspections we carry out from next September – so we will get to more schools as the inspection period progresses. This means that a typical good-rated school inspected just before the pandemic is likely to be inspected 1 year later than it might normally expect, rather than 2."
        },
        {
            "text": "As has always been the case, inspection timing is based on the judgement given at the last inspection. For example, schools judged as inadequate are inspected much closer to their last inspection than those with a good judgement."
        },
        {
            "text": "Let’s look at what this announcement means for schools with different judgements:"
        },
        {
            "heading": 3,
            "text": "Schools graded good"
        },
        {
            "text": "Most schools graded as good will continue to receive an ungraded (section 8) inspection. A risk assessed proportion of schools will receive a graded (section 5) inspection. All good schools will be inspected around 3-5 terms later than they would have been, because of the pandemic."
        },
        {
            "text": "This year we will inspect schools last inspected in the 2016/17 academic year – which is an extension of about 5 terms. From next September, we will work to gradually reduce this extension. In time, this will mean that schools can expect an inspection only 3-4 terms later (so around 5 years after their last inspection)."
        },
        {
            "text": "Schools that receive a ‘good improving’ or ‘good declining’ assessment will still receive a graded (section 5) inspection around a year later."
        },
        {
            "heading": 3,
            "text": "Schools graded outstanding"
        },
        {
            "text": "In September, we began inspecting outstanding-graded schools that were formerly exempt from routine inspection. These inspections will continue."
        },
        {
            "text": "Outstanding schools have been split into two groups: schools that were graded outstanding before September 2015 and schools that were graded outstanding after this."
        },
        {
            "text": "We are inspecting these two groups of schools simultaneously, starting with the oldest inspection judgements in each group:"
        },
        {
            "text": "A school that receives a ‘declining’ assessment in their section 8 will receive a graded inspection around a year later."
        },
        {
            "heading": 3,
            "text": "Schools graded requires improvement and inadequate"
        },
        {
            "text": "Before the pandemic, these schools could expect their next inspection within 30 months of receiving this grade. Now, these schools can expect an inspection approximately 5 to 6 terms later than they would have done. Because the inspection intervals are shorter for requires improvement and inadequate schools, we were already on track to reinspect these schools much sooner (and have already inspected many of them) – so the changes are unlikely to affect many of these schools."
        },
        {
            "text": "Monitoring inspections will continue in the usual way and aren’t affected by this announcement."
        },
        {
            "heading": 3,
            "text": "New schools awaiting their first inspection"
        },
        {
            "text": "Schools that opened before September 2020 can expect up to an additional 18 months on top of the usual 3 years before their first inspection."
        },
        {
            "text": "Schools that opened after September 2020 will receive their first inspection in the third year the school is open."
        },
        {
            "heading": 3,
            "text": "Schools inspected since May 2021"
        },
        {
            "text": "Schools inspected since May 2021 have already returned to our usual inspection intervals. Once a school has had an inspection, it will return to the interval set out in our section 5 school inspection handbook."
        },
        {
            "heading": 3,
            "text": "The best possible education"
        },
        {
            "text": "As ever, we are not asking schools to prepare anything specific for inspection. Please just carry on giving children the best possible education. But we are realistic. We understand that schools like to work out the likely space between inspections as part of their overall plans for improvement."
        },
        {
            "text": "The information I’ve set out here is general advice. We don’t confirm when a school will be inspected before it is officially notified, and of course, we can inspect a school at any time if we need to."
        },
        {
            "text": "I hope this blog has answered some of the questions schools have about our announcement. We’ll provide more information in our next school inspection handbook update."
        },
        {
            "text": "Ultimately, children have missed out on an awful lot over the last 20 months, and they only get one chance at school. Everyone working in education needs to play their part in giving this cohort of children the best education possible. Inspecting schools more quickly means we can provide those insights about recovery sooner, rather than later. That’s good for schools – who want to know their plans are on track. But most importantly, it’s the right thing for children."
        }
    ]
}