{
    "url": "https://technology.blog.gov.uk/2021/11/30/introducing-the-governments-chief-technology-officer-council/",
    "title": "Introducing the government’s Chief Technology Officer Council",
    "authors": [
        "Dan Bailey, CTO, CDDO"
    ],
    "categories": [
        "CTO Council",
        "Open Source",
        "Open Standards",
        "Security",
        "Tools",
        "Transformation"
    ],
    "pub_date": "2021-11-30T14:36:29+00:00",
    "content": [
        {
            "text": "The Technology in Government blog platform often highlights how government is working towards making better use of technology. "
        },
        {
            "text": "We’re now adding to that aim by introducing the work of the newly formed Chief Technology Officer (CTO) Council and the Office of the CTO. Through this blog channel we'll keep you up to date with the Council’s thinking, scope and areas where we would like to engage with you. "
        },
        {
            "text": "We'll share what we’re up to, the development of our cross-government strategies, the technical challenges we’re facing, and get feedback on potential early solutions with you."
        },
        {
            "heading": 2,
            "text": "Office of the Chief Technology Officer"
        },
        {
            "text": "I joined the Central Digital and Data Office (CDDO) in August 2021, as the new interim Government CTO. My experience includes working with the government on G-Cloud, leading on cloud strategy and delivering complex integration and transformation projects. I'll lead the Office of the CTO team, initially focusing on these priorities:"
        },
        {
            "text": "Alongside these priorities, the team will continue to produce guidance and standards to help our users implement government strategies that the Office of the CTO develops."
        },
        {
            "heading": 2,
            "text": "The CTO Council"
        },
        {
            "text": "It's been a while since government has had a CTO Council so we've created a new one to answer today’s technology issues in government."
        },
        {
            "text": "I'll head up the new CTO Council, whose membership will include CTOs from across government. We'll meet monthly, alternating between in-person and virtual meetings. The Council will develop cross-government strategies and identify and tackle areas/topics for development."
        },
        {
            "text": "The aims of the CTO Council are to make the most of existing technology resources across the public sector, align organisational and DDaT strategies, and to make the government’s transformation strategy a reality."
        },
        {
            "text": "The Council will do this by:"
        },
        {
            "text": "We'll work across government with CTOs, senior leaders, transformation directors and other subject matter experts. Together we can realise our aims and make sure our technology strategies meet your organisations’ requirements."
        },
        {
            "heading": 2,
            "text": "What's next"
        },
        {
            "text": "In the next few blog posts from the CTO Council we'll provide more detailed information and aims for each of our priority areas. Our priorities have to be flexible and agile, so we'll keep you updated with any major changes. "
        },
        {
            "text": "We'll also feature guest posts from other CTOs, highlighting the different approaches we’re all taking to completing our work. "
        }
    ]
}