{
    "url": "https://gds.blog.gov.uk/2021/11/30/podcast-maps-in-services/",
    "title": "Podcast: Maps in services",
    "authors": [
        "The GDS Team"
    ],
    "categories": [
        "Accessibility",
        "Digital Service Platforms",
        "Podcast",
        "Service design"
    ],
    "pub_date": "2021-11-30T11:15:52+00:00",
    "content": [
        {
            "text": "This month’s episode of the Government Digital Service (GDS) Podcast focuses on maps. Whether it’s to convey important data, or simply to help users navigate from point A to point B, maps feature prominently in public services."
        },
        {
            "text": "The best way to approach using maps in digital services is something we’re asked about a lot. So in this episode, we decided to explore some of the challenges services currently face when it comes to things like designing and prototyping maps at speed. We also address the question on everyone’s lips: just how do you make maps accessible?"
        },
        {
            "text": "Tune in to hear why Head of Design at the Department for Environment, Food and Rural Affairs’ (Defra), Cathy Dutton, and Imran Hussain, Community Designer for the GOV.UK Design System, have joined forces on a community-led approach to making maps more accessible, consistent and user-friendly."
        },
        {
            "text": "We explain how you can get involved in pooling expertise and good practice into a powerful central resource to benefit public sector teams at 17 minutes 30."
        },
        {
            "heading": 2,
            "text": "Subscribe to our podcast"
        },
        {
            "text": "You can subscribe to the GDS Podcast on Spotify, Apple Podcasts and all other major podcast platforms. You can read a transcript of the podcast on Podbean."
        },
        {
            "heading": 2,
            "text": "Take our 2 minute survey"
        },
        {
            "text": "Do you enjoy the GDS Podcast? Help us to make it even better by completing our short, anonymous survey."
        }
    ]
}