{
    "url": "https://environmentagency.blog.gov.uk/2021/11/30/restoring-englands-great-barrier-reef/",
    "title": "Restoring England’s ‘Great Barrier Reef’",
    "authors": [
        "aimeecarguillo"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2021-11-30T16:39:57+00:00",
    "content": [
        {
            "text": "By Charles Rangeley- Wilson, Chair of the Chalk Stream Restoration Group."
        },
        {
            "text": "On 15 October 2021, the Chalk Streams Restoration Group marked a major milestone on the journey to restore England’s chalk streams. The group was formed in 2020 to bring together many partners responsible for or interested in the future of these precious habitats. The resulting Chalk Stream Restoration Strategy, which we launched on 15 October, sets us on course to breathe life back into a part of our environment that so desperately needs it."
        },
        {
            "text": "Why do we need to restore chalk streams - what makes them so special? Chalk streams are an exceptional type of spring-fed river distinct to England and parts of France and Denmark. Although chalk exists in other parts of the world, nowhere else do we find these clear-watered rivers. In England, they are distributed across an arc of chalk that runs from Dorset to Yorkshire. Chalk streams – in their natural condition – are home to a profusion of life. When rain falls on chalk hills most of it soaks down into the body of the rock and there undergoes a kind of alchemy, emerging from springs as cool, alkaline, mineral-rich water, providing the perfect properties to create a richly diverse eco-system.  Botanically, chalk streams are the most biodiverse of all English rivers. For invertebrates, fish, birds and mammals, they offer a vast range of habitat niches. They are our equivalent of the Great Barrier Reef, or the Okavango Delta: a truly special natural heritage and a responsibility."
        },
        {
            "text": "But chalk streams are under immense pressure. They flow through one of the most urbanised, industrialised and populated parts of the UK. Three chalk streams flow through London, and there are many more in the chalk hills that surround the capital. Further afield, though many flow through more open countryside, that countryside is busily farmed, while villages or towns are sited somewhere along most chalk rivers. All these streams are impacted in one way or another by the activities of people."
        },
        {
            "text": "We depend on chalk streams for public water supply, and have leant heavily – in some places, very heavily – on the resources of the underground body of water that feeds these streams. And yet every litre of water we take out of the aquifers – and we take billions and billions of litres to irrigate our crops, or run our taps – is water lost to the natural environment. At least until we put it back."
        },
        {
            "text": "So, we have quite the job ahead of us if we are to leave our wonderful chalk streams in a better state than we found them."
        },
        {
            "text": "But that is the challenge which this chalk stream restoration strategy has attempted to address – how to restore good ecological health to these unique rivers and the catchments which support them, all within the context of this busy landscape, occupied by millions of people going about their lives, with multiple stakeholders and competing demands on resources."
        },
        {
            "text": "We’re not going to put all our chalk streams back into excellent ecological health by next year, or the year after, or even within five years or ten."
        },
        {
            "text": "But we could put some of them back into excellent ecological health within that time."
        },
        {
            "text": "And then year by year, decade by decade, if we commit to the tasks in our strategy and if we actually realise them one by one, we will be able to look back at how far we’ve come and then forward again with renewed energy for the tasks that remain."
        },
        {
            "text": "But chalk streams are under immense pressure. They flow through one of the most urbanised, industrialised and populated parts of the UK. Three chalk streams flow through London, and there are many more in the chalk hills that surround the capital. Further afield, though many flow through more open countryside, that countryside is busily farmed, while villages or towns are sited somewhere along most chalk rivers. All these streams are impacted in one way or another by the activities of people."
        },
        {
            "text": "We depend on chalk streams for public water supply, and have leant heavily – in some places, very heavily – on the resources of the underground body of water that feeds these streams. And yet every litre of water we take out of the aquifers – and we take billions and billions of litres to irrigate our crops, or run our taps – is water lost to the natural environment. At least until we put it back."
        },
        {
            "text": "So, we have quite the job ahead of us if we are to leave our wonderful chalk streams in a better state than we found them."
        },
        {
            "text": "But that is the challenge which this chalk stream restoration strategy has attempted to address – how to restore good ecological health to these unique rivers and the catchments which support them, all within the context of this busy landscape, occupied by millions of people going about their lives, with multiple stakeholders and competing demands on resources."
        },
        {
            "text": "We’re not going to put all our chalk streams back into excellent ecological health by next year, or the year after, or even within five years or ten."
        },
        {
            "text": "But we could put some of them back into excellent ecological health within that time."
        },
        {
            "text": "And then year by year, decade by decade, if we commit to the tasks in our strategy and if we actually realise them one by one, we will be able to look back at how far we’ve come and then forward again with renewed energy for the tasks that remain."
        },
        {
            "text": "That is how we will fix our chalk streams."
        },
        {
            "text": "Read the Chalk Streams Restoration Strategy on the CaBA website."
        },
        {
            "text": "Charles Rangeley-Wilson is a writer, conservationist and river restorationist."
        }
    ]
}