{
    "url": "https://taxagents.blog.gov.uk/2021/11/30/tax-administration-and-maintenance-day/",
    "title": "Tax Administration and Maintenance Day",
    "authors": [
        "geoffgreensmith"
    ],
    "categories": [
        "News and Updates"
    ],
    "pub_date": "2021-11-30T17:07:10+00:00",
    "content": [
        {
            "text": "The government has today published a Tax Administration and Maintenance command paper outlining our progress towards building a trusted modern tax administration system and highlighting other updates related to reforming tax. Alongside the paper we have published documents that provide details on these reforms. We’ve highlighted the key announcements below."
        },
        {
            "text": "Summary of response documents"
        },
        {
            "text": "Tax Administration Framework Review: Responses to the call for evidence on modernising the tax administration framework, covering the core legislation, processes and guidance that underpin obligations for HMRC, taxpayers, agents and third parties. The government is committed to incremental long-term reform to support effective tax administration in the 21st century. It will set out a roadmap for future consultation in due course."
        },
        {
            "text": "Raising standards in the tax advice market: Providing an update and detailing the next steps regarding this work. The government has decided not to introduce the professional indemnity insurance requirement at this time, but to consult in 2022 on options to improve the wider regulatory framework around standards in tax advice. The government will also be consulting on proposals to tackle the high cost to taxpayers of using tax agents to claim tax repayments. Linked to this we have also published the findings of an externally commissioned research study into characteristics of unaffiliated tax agents. This study aimed to provide HMRC with in-depth insight into the behaviours and attitudes of agents who were not members of a professional body."
        },
        {
            "text": "Reforming Research and Development (R&D) tax reliefs: At Autumn Budget 2021, the government announced that R&D tax reliefs would be reformed to support modern research methods by expanding qualifying expenditure to include data and cloud costs; to capture more effectively the benefits of R&D funded by the reliefs, through refocusing support towards innovation in the UK; and to target abuse and improve compliance. The government has published a report providing further detail and the next steps for the review, alongside a summary of responses to the consultation launched at Spring Budget 2021."
        },
        {
            "text": "New Consultations"
        },
        {
            "text": "Income Tax Self Assessment registration for the self employed and landlords: A call for evidence exploring the case for reforming registration for Income Tax Self Assessment and bringing forward the point at which some taxpayers need to register with HMRC. Earlier registration could benefit taxpayers by ensuring they understand their tax obligations, and can receive support if they need it, earlier."
        },
        {
            "text": "Modernisation of debt collection for non-paying businesses: A call for evidence seeking views on how HMRC can modernise its collection of tax debts to reflect the changing nature of the economy, where an increased use of e-commerce has given rise to new business practices – including the conduct of business in the UK without having a presence or physical assets here. The call for evidence also seeks views on HMRC’s approach to the small minority of business taxpayers who do not engage with HMRC and hold off paying their tax for as long as they can, forcing HMRC to resort to costly and time-consuming enforcement action. The proposals will not affect taxpayers who are in temporary financial difficulty and need support from HMRC to get back onto a sustainable financial footing – including those affected by the Covid-19 pandemic."
        },
        {
            "text": "Umbrella company market: A call for evidence inviting views on the role that umbrella companies play in the labour market, and how they interact with the tax and employment rights system. It also sets out the government’s understanding of the market and existing commitments and action already taken to tackle tax non-compliance, and improve protection for workers."
        },
        {
            "text": "Consulting on making Stamp Duty Land Tax (SDLT) reliefs fairer: A consultation on the SDLT reliefs for purchases of mixed property and multiple dwellings setting out potential changes to make the system fairer and reduce the scope for incorrect or abusive claims."
        },
        {
            "text": "Ensuring Landfill Tax continues to support environmental objectives: A call for evidence on how Landfill Tax can continue to support the government’s ambitious environmental objectives, including achieving zero avoidable waste by 2050."
        },
        {
            "text": "Announcements"
        },
        {
            "text": "Helping large businesses get their tax right and improving the compliance experience: At Spring Budget 2021 the government announced a review of tax administration for large businesses, in recognition of the role that the tax administration plays in supporting the UK’s competitiveness and promoting investment. Following engagement with stakeholders, the government is taking action, including: developing new guidelines for compliance and improved guidance; changes to help address long-running enquiries; and work to improve the co-operative compliance experience."
        },
        {
            "text": "Administering low-income trusts and estates: The government will reduce the administrative burden on low income trusts and estates by formalising an existing interim concession that removes trustees and personal representatives from Income Tax where the only source of income is savings interest and the tax liability is otherwise less than £100. The precise form and level of the change will be announced following consultation by HMRC."
        },
        {
            "text": "Increasing the effectiveness of the Office of Tax Simplification (OTS): Publication of the Government’s first five-year review OTS. It makes eight recommendations to maintain and improve the effectiveness of the OTS over the next five years."
        },
        {
            "text": "We are grateful for your support in co-designing many of these policy areas and we are keen to hear your views to help shape the further reforms announced today."
        },
        {
            "text": "For more information about all of today’s measures please visit GOV.UK."
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}