{
    "url": "https://educationhub.blog.gov.uk/2021/11/30/what-do-children-and-young-people-learn-in-relationship-sex-and-health-education/",
    "title": "What do children and young people learn in relationship, sex and health education",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Primary Schools",
        "Relationships and Sex Education",
        "Schools",
        "Secondary schools"
    ],
    "pub_date": "2021-11-30T11:26:45+00:00",
    "content": [
        {
            "text": "We want to make sure that young people understand what healthy relationships look like and how to navigate their personal lives in a positive, safe and healthy way."
        },
        {
            "text": "That’s why we introduced the statutory relationships, sex and health education (RSHE) curriculum."
        },
        {
            "text": "Below we outline what you need to know about RSHE."
        },
        {
            "heading": 3,
            "text": "What is RSHE?"
        },
        {
            "text": "Since September 2020, Relationships Education has been compulsory for all pupils receiving primary education and Relationships and Sex Education (RSE) for all pupils receiving secondary education. Health Education is now compulsory in all schools too."
        },
        {
            "text": "The relationships, sex and health education guidance sets out the legal duties schools must comply with when teaching RSE and RSHE, as well as setting out some more detailed expectations of school, including teaching these subjects in an age appropriate way."
        },
        {
            "heading": 3,
            "text": "Why it’s important "
        },
        {
            "text": "Children and young people are growing up in an increasingly complex world and they need to know how to be safe and healthy. RSHE helps them embrace the challenges of creating a happy and successful adult life. These subjects support children and young people to develop healthy relationships, and to keep themselves and others safe, both on and offline."
        },
        {
            "text": "RSHE should be a key pillar in any school’s plan for creating an inclusive, safe and respectful school environment where bullying, sexual violence or sexual harassment is not tolerated."
        },
        {
            "text": "It also provides pupils with the knowledge that will enable them to make informed decisions about their wellbeing."
        },
        {
            "heading": 3,
            "text": "So what topics does RSHE cover?"
        },
        {
            "text": "The RSHE curriculum is set out in detail in our statutory guidance."
        },
        {
            "heading": 4,
            "text": "Primary School"
        },
        {
            "text": "At primary school relationships education teaches children a wealth of information about healthy relationships, including how to communicate their own boundaries and recognise the boundaries of others, staying safe online, and the differences between appropriate and inappropriate or unsafe contact. We strongly encourage schools to include the teaching of different family models and same-sex relationships."
        },
        {
            "text": "Health education should include puberty, including menstruation, and this should as far as possible be addressed before onset. It also focuses on teaching the characteristics of good physical health and mental wellbeing, and teachers should be clear that mental wellbeing is a normal part of daily life, in the same way as physical health."
        },
        {
            "heading": 4,
            "text": "Secondary School"
        },
        {
            "text": "At secondary school relationships and sex education covers content on a wider range of key topics including consent, sexual exploitation, online abuse, grooming, coercion, harassment, rape, domestic abuse, forced marriage, honour-based violence and FGM, and how these can affect current and future relationships."
        },
        {
            "text": "Pupils should be taught the facts and the law about sex, sexuality, sexual health and gender identity in an age-appropriate and inclusive way. There should be an equal opportunity to explore the features of stable and healthy same-sex relationships."
        },
        {
            "text": "Health education focuses on enabling pupils to make well-informed, positive choices for themselves, and includes teaching about the impact of puberty. The curriculum covers mental health and will support young people to recognise and manage any wellbeing issues as well as how they can seek support as early as possible."
        },
        {
            "heading": 3,
            "text": "Is it mandatory to teach RSHE?"
        },
        {
            "text": "Yes, it is mandatory for RSHE to be taught in all schools."
        },
        {
            "text": "We expect all schools to teach the full RSHE curriculum to secondary age pupils and relationships and health education to primary age pupils."
        },
        {
            "text": "Primary schools may also teach sex education where appropriate. The teaching of RSHE is reviewed by Ofsted at inspection."
        },
        {
            "text": "All schools must have in place a written policy for Relationships Education and RSE and consult parents in developing and reviewing their policy."
        },
        {
            "text": "Schools should also ensure that the policy meets the needs of pupils and parents and reflects the community they serve."
        },
        {
            "text": "Parents with concerns should speak to their headteachers and schools should listen to these views. However, parental consultation does not amount a veto on curriculum content."
        },
        {
            "text": "Parents will have a right to request that their child is withdrawn from sex education, but not from Relationships Education."
        },
        {
            "heading": 3,
            "text": "And what resources/training have you made available to support teachers?"
        },
        {
            "text": "We have published a support package on GOV.UK to help all schools increase their confidence and the quality of their RSHE teaching practice."
        },
        {
            "text": "This includes RSHE teacher training modules, non-statutory implementation guidance and training for teachers led by Teaching Schools. Each of the Teacher Training Modules covers safeguarding to make sure teachers, pastoral staff and the designated safeguarding: Teaching about relationships, sex and health - GOV.UK (www.gov.uk)."
        },
        {
            "text": "All of the in-house modules were developed to support schools and provide more detail on the content that should be taught under each subject area to help support teachers’ knowledge and confidence to teach RSHE so schools can develop detailed curriculum and lesson plans."
        },
        {
            "text": "Schools should assess each resource they intend to use carefully to ensure it is age appropriate, and sensitive to their pupils’ needs."
        },
        {
            "text": "We also encourage all schools to devote some of their in-service training (INSET) days to RSHE."
        }
    ]
}