{
    "url": "https://ruralpayments.blog.gov.uk/2025/11/12/rpa-to-start-making-higher-level-stewardship-hls-payments-from-december/",
    "title": "RPA to start making Higher Level Stewardship (HLS) payments from December",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Environmental Stewardship"
    ],
    "pub_date": "2025-11-12T10:41:13+00:00",
    "content": [
        {
            "text": "We announced an increase to the Higher Level Stewardship (HLS) payment rates in May 2025. In this blog we provide a reminder of how you can estimate the value of your options and let you know when you'll receive your increased 2025 payment."
        },
        {
            "text": "When you'll receive your increased 2025 payment"
        },
        {
            "text": "We'll start making 2025 annual payments to HLS customers from December 2025. When you receive your 2025 payment, we'll send you your remittance advice confirming the total value of your annual payment based on your 2025 claim. This won't be broken down by individual options."
        },
        {
            "text": "Why we're increasing HLS payment rates"
        },
        {
            "text": "HLS payment rates haven't changed for more than 10 years. During this time, they've fallen behind rates offered through other schemes, including Countryside Stewardship Higher Tier (CSHT) and the Sustainable Farming Incentive (SFI)."
        },
        {
            "text": "We're investing £30 million to increase payment rates so farmers with HLS agreements can continue to restore habitats, support rare species, preserve historic features and maintain traditional landscape features. This recognises the valuable contribution you make, delivering important benefits for nature alongside food production."
        },
        {
            "text": "What's changing"
        },
        {
            "text": "We're increasing 157 options by 34.4% of the difference between your HLS rate and the equivalent CS or SFI action. This brings them more in line with those schemes."
        },
        {
            "text": "The change to your claim value depends on which options are in your agreement. If you have options with rates that are increasing, the new rates apply from 1 January 2025. Your payments will increase automatically - you don't need to do anything."
        },
        {
            "text": "How increased rates were calculated"
        },
        {
            "text": "HLS rates increase where there's an equivalent CS or SFI action paid at a higher rate. This means 157 options will increase. There are 23 HLS options already paid at higher rates than their CS and SFI equivalents, so these won't change. A further 22 HLS options don't have comparable CS or SFI actions, so these will stay the same."
        },
        {
            "text": "The Entry Level Stewardship element of your agreement remains unchanged."
        },
        {
            "text": "Calculating your new rates"
        },
        {
            "text": "Standard rates - if your agreement has standard rates, use the payment rate tables on GOV.UK to calculate how much each option will increase."
        },
        {
            "text": "Non-standard rates - to calculate increases for non-standard rates, agreement holders need to calculate the difference between the non-standard rate set out in their agreement and the CS/SFI equivalent."
        },
        {
            "text": "We're updating our systems to generate new payment calculations for each agreement holder and will send you your remittance advice confirming the total value of your payment when we start making payments in December 2025."
        },
        {
            "text": "For more information read the Increase in payment rates for Higher Level Stewardship from 2025 guidance on GOV.UK."
        }
    ]
}