{
    "url": "https://nationalscreening.blog.gov.uk/2025/11/12/uk-nsc-consults-on-evidence-related-to-screening-for-antenatal-and-postnatal-mental-health-conditions/",
    "title": "UK NSC consults on evidence related to screening for antenatal and postnatal mental health conditions",
    "authors": [
        "Omaer Syed"
    ],
    "categories": [
        "UK National Screening Committee"
    ],
    "pub_date": "2025-11-12T08:53:26+00:00",
    "content": [
        {
            "text": "The UK National Screening Committee (UK NSC) has opened a consultation on evidence relating to population screening for antenatal and postnatal mental health conditions. "
        },
        {
            "text": "We are asking stakeholders and members of the public to provide feedback on a 2025 evidence map and its conclusions. The evidence map looked at the latest literature on this topic and concluded that more in-depth work is not currently justified. It recommended the topic be reviewed again in 3 years’ time."
        },
        {
            "text": "The committee reviews the evidence for antenatal and postnatal mental health conditions regularly."
        },
        {
            "text": "A UK NSC evidence summary in 2019 found no evidence to support changing the pre-existing recommendation not to screen. The committee commissioned the 2025 evidence map to review literature published on the topic since that 2019 review, including evidence on new tests and interventions."
        },
        {
            "text": "The consultation responses will be presented to the UK NSC before it considers updating its recommendation."
        },
        {
            "heading": 2,
            "text": "Antenatal and postnatal mental health conditions"
        },
        {
            "text": "Antenatal and postnatal mental health conditions include common mental health disorders such as anxiety, depression, phobias, obsessive-compulsive disorder (OCD) and post-traumatic stress disorder (PTSD), plus severe mental illness (SMI) such as psychosis and personality disorder."
        },
        {
            "text": "The nature of most of these conditions may range from mild to severe, requiring different kinds of care or treatment provided by universal and specialist services. The management and treatment of mental health conditions during pregnancy and the postnatal period need to consider the impact of interventions not only on the woman but also on her baby. "
        },
        {
            "text": "In England, about 26% of women experience a mental health disorder during the perinatal period, with depression and anxiety being the most common."
        },
        {
            "text": "Screening tools exist which primarily focus on detecting anxiety and depression in women who have not previously experienced mental ill health. Examples include the Edinburgh Postnatal Depression Scale (EPDS), the Patient Health Questionnaire (PHQ), and the Whooley questions."
        },
        {
            "text": "Treatment may involve psychological, psychosocial, or pharmacological interventions. Treatment is determined by the diagnosis, the woman’s previous mental health history, the possible harms and benefits to the woman and baby, and the acceptability of the treatment to the woman."
        },
        {
            "text": "There is NICE clinical guidance on recognising antenatal and postnatal mental health issues and making referrals."
        },
        {
            "heading": 2,
            "text": "The evidence"
        },
        {
            "text": "The 2025 evidence map identified a substantial volume of new published evidence since 2019. However, it concluded that:"
        },
        {
            "text": "Based on this evidence map, more in-depth work is not currently justified, and it is recommended the topic be reviewed again in 3 years’ time."
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK NSC. You can register to receive updates direct to your inbox, so there is no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, please email uknsc@dhsc.gov.uk."
        }
    ]
}