{
    "url": "https://naturalengland.blog.gov.uk/2024/12/13/celebrating-75-years-of-the-1949-national-parks-and-access-to-the-countryside-act/",
    "title": "Celebrating 75 years of the 1949 National Parks and Access to the Countryside Act ",
    "authors": [
        "Marian Spain"
    ],
    "categories": [
        "Landscapes and access",
        "Natural England",
        "Parks, trails and nature reserves",
        "Protected sites and species",
        "Wildlife"
    ],
    "pub_date": "2024-12-13T09:14:27+00:00",
    "content": [
        {
            "text": "By Marian Spain, Chief Executive, Natural England"
        },
        {
            "text": "We know now that access to nature is vital for our health and wellbeing, and when we feel a connection with nature, we’re more likely to care for it and help its recovery. But actually our predecessors have known this too for more than 75 years. "
        },
        {
            "text": "There are therefore many reasons to  celebrate 75 years of the National Parks and Access to the Countryside Act, the law which does so much for us: the creation, maintenance and improvement of National Trails, securing access to nature rich, beautiful places, protecting wildlife on National Nature Reserves (NNRs), and finally, preserving and enhancing natural beauty and heritage in National Parks and AONBs (now called National Landscapes). "
        },
        {
            "text": "The origins of this Act are rooted in the same post world war social revolution which gave us the National Health Service and the Welfare State, as Navroza Ladha explores in her blog post. "
        },
        {
            "text": "As Chief Executive of Natural England, this legislation is special to me as it started the journey which allowed us to come into being. It created the National Parks Commission, which later became the Countryside Commission, and then the Countryside Agency, which became Natural England when, in 2006, it merged with English Nature, another body with origins in The Nature Conservancy Council and the 1949 Act. (I can trace the start of my career back to one of those bodies, the Countryside Commission, in 1988: not quite all the way to 1949! But I was handed my own copy of the Act on my first day.)  "
        },
        {
            "text": "While we may now have more tangible evidence of the benefits of nature since 1949, I am struck by the Act’s understanding of the importance of access to nature and beauty for everyone regardless of where they live. Our urban areas, and our rural areas, might have changed in the last 75 years when the act was seen as getting people out of hard-working lives into remote places, but we still see the need for the benefit of time in the beauty of nature to help us be resilient, and happier, in whatever lives we lead. In our People and Nature Survey, we saw that 92% of adults who had visited a green and natural space in the previous 14 days agreed that spending time outdoors was good for their physical health.  "
        },
        {
            "text": "The Act gave us the National Parks which we so enjoy today. We have 10 National Parks in England which cover 10% of our land area. Nearly 90 million of us visit a National Park each year, which benefits our health and wellbeing, with 84% of adults agreeing that being in nature makes us very happy. It is not just good for us, it also contributes £6 billion to the economy.   "
        },
        {
            "text": "The Act led to our 34 National Landscapes (then called AONBs) which cover an additional 15% of the land area in England. Stretching from the Northumberland Coast in the northeast to the Isles of Scilly in the southwest, more than 66% of people in England live within a 30-minute journey of their nearest National Landscape.  "
        },
        {
            "text": "These special landscapes benefit us in so many ways, from helping us to address the climate crisis by storing at least 17.5% of England’s total soil carbon, to protecting some of our key habitat in the fight against the biodiversity crisis. They encompass 20% of England's total woodland cover, and 30% of the nation's ancient woodland. They host 16 National Trails in England and Wales. These paths were also created as part of the Act, and they bring walkers (and for some cyclists and horse riders) through some of our most beautiful landscapes and other iconic places such as the River Thames.  "
        },
        {
            "text": "And we continue to connect people and nature where they are. We’re improving access to the coast with The King Charles III England Coast Path. This is the newest (and will be the longest) National Trail. It passes not just through the most beautiful parts of our coastal countryside (much of it a National Park or a National Landscape) but through towns, cities, ports  and industrial areas. Almost half is already open, and it will all be ready to walk by 2026.  "
        },
        {
            "text": "We can – and should - celebrate the achievements of the last 75 years, but we need to acknowledge how much further we have to go. The UK is one of the most nature-depleted countries in the world. National Parks and National Landscapes continue to play a huge role in preserving nature but they, and we at Natural England, need to shift from just preserving the nature that’s left to putting nature back, looking afresh at how everybody can visit those wild places.  "
        },
        {
            "text": "What else are we doing to build on the legacy of 1949?  There are now 221 National Nature Reserves in England. Almost two thirds of these are managed by Natural England, but also by over 70 different partner organisations including the National Trust, Wildlife Trusts, RSPB, local authorities and a growing number of landowners and businesses. These NNR partners all work together to ensure our most important places for nature to thrive, and help people enjoy them. They are also places for experiment and learning, more important than ever as climate change forces us to look afresh at how to care for nature.  "
        },
        {
            "text": "We still need to go further, faster, and look to recover nature at scale. The groundbreaking 1949 Act provided us with the foundations for modern nature conservation and has left us with a very valuable legacy. Ultimately though, this is not enough. Our efforts must also support sustainable economic development and ensure farming and other business can thrive and support vibrant and varied  communities who live within or visit these landscapes."
        },
        {
            "text": " "
        },
        {
            "text": "I’m proud to be leading Natural England as we work to restore nature for our collective health, wellbeing and security. In our current ecological emergency, it is time for another revolution for nature. Once again, our protected landscapes will be playing a pivotal role. "
        },
        {
            "text": "Our shared aim with our partners who manage our protected landscapes and nature reserves must be do more for nature in the next ten years than the last 75. We need to work together to achieve the nation’s commitment to protect and manage 30% of our land and sea by 2030. The opportunities are huge, it just requires us to act. So what will you do? What do you think we need to do next? I’d love to know.  "
        },
        {
            "text": "Want to hear more? In this special year of celebration for the 75th Anniversary of the 1949 National Parks and Access to the Countryside Act, Natural England have produced two new podcast episodes that I feature in. The links below will take you directly to each episode. "
        },
        {
            "text": "  75th Anniversary Part 1: past and present (30 mins) features conversations with:"
        },
        {
            "text": "Marian Spain – Natural England (The impact of the Act)"
        },
        {
            "text": "Clare Webb – Natural England (Countryside Code)"
        },
        {
            "text": "Julie Merrett - Natural England (National Nature Reserves)"
        },
        {
            "text": "75th Anniversary Part 2: the next 75 years (25 mins) features conversations with:"
        },
        {
            "text": "Stuart Pasley – Natural England (Resilient Landscapes and Seas)"
        },
        {
            "text": "Julian Gray – National Trails UK and NE Landscape Advisory Panel member"
        },
        {
            "text": "Saskia Luqmani – Protected Landscapes Partnership"
        },
        {
            "text": "Marian Spain – Natural England"
        },
        {
            "text": "Would you like to stay informed on Natural England news and announcements? Sign up to our newsletters and be part of the conversation surrounding conservation and nature recovery"
        }
    ]
}