{
    "url": "https://marinescience.blog.gov.uk/2024/12/13/early-career-ocean-professionals-at-the-all-atlantic-ocean-research-and-innovation-alliance-aaoria/",
    "title": "Early Career Ocean Professionals at the All-Atlantic Ocean Research and Innovation Alliance (AAORIA)",
    "authors": [
        "Parvathi Vallivattathillam",
        "Lianne Harrison",
        "Francesca D'Enno"
    ],
    "categories": [
        "International",
        "Science"
    ],
    "pub_date": "2024-12-13T11:30:00+00:00",
    "content": [
        {
            "text": "Written by Parvathi Vallivattathillam, National Oceanography Centre (NOC), Lianne Harrison, Cefas and Francesca D'Enno, Defra."
        },
        {
            "text": "The All-Atlantic Ocean Research and Innovation Alliance (AAORIA) is a science diplomacy effort which unites twelve countries across the Atlantic to strengthen and foster collaborative ocean research. AAORIA seeks to understand what is required to ensure the sustainability of the Atlantic Ocean over the years and decades to come."
        },
        {
            "text": "Held annually, this year’s AAORIA Forum was in Ottawa, Canada, at the Canadian Museum of Nature. The Forum gathered ocean experts, policymakers, and Early Career Ocean Professionals (ECOPs) from diverse sectors, providing a platform to engage in policy dialogue, gain hands-on experience, and build an Atlantic network. Representing the UK’s National Oceanography Centre (NOC) and Centre for Environment, Fisheries and Aquaculture Science (Cefas) respectively, Dr Parvathi Vallivattathillam and Dr Lianne Harrison travelled to Ottawa for the Forum."
        },
        {
            "text": "Day 1 - Intergenerational Dialogue"
        },
        {
            "text": "An important part of the programme was the contribution from ECOPs as part of an Intergenerational Dialogue. AAORIA brought together young professionals from various fields within ocean science and policy, from research students to ocean accountants to environmental lawyers. Before the Forum began, approximately 40 ECOPs gathered to form groups of five, each guided by a mentor who was experienced in either science or policy, with the task of developing a project that could benefit the All-Atlantic community. After hours of thoughtful discussion, each team was ready to present their project proposal during a policy pitch session scheduled for the final day of the Forum."
        },
        {
            "text": "Day 2 - Workshops and Community Engagement"
        },
        {
            "text": "On the second day, the event became even more immersive, featuring workshops and an outreach visit to a local high school. The workshops offered ECOPs opportunities to volunteer in roles such as notetakers, rapporteurs, and science communicators. Parvathi volunteered as a rapporteur during the Coastal Resilience workshop, where the session started with keynote speakers talking about ongoing resilience projects. There were roundtable discussions, where each table’s rapporteur was responsible for summarizing the key takeaways from group discussions. This was aimed at promoting an exchange of insights that spanned international perspectives."
        },
        {
            "text": "The high school visit was a unique highlight. ECOPs spoke with students about their journeys in climate research and other roles, answering their thought-provoking questions and discussing the importance of ocean science. This outreach session demonstrated AAORIA's commitment to education and public engagement, inspiring a new generation to think about ocean stewardship."
        },
        {
            "text": "Welcome Reception"
        },
        {
            "text": "AAORIA Forum delegates were welcomed at a reception held at the residence of the Irish Ambassador to Canada. This event was a great opportunity for making new connections and discovering more about the inner workings of AAORIA."
        },
        {
            "text": "The Irish Ambassador thanked participants for their commitment to ocean research and spoke about Ireland’s role as coordinators of OKEANO, which is helping facilitate the organisation of AAORIA. An ECOP who had been to a previous Forum also gave her reflections on the central importance of the ECOP programming in AAORIA. These events provided another fantastic chance to network outside the main AAORIA Forum."
        },
        {
            "text": "The British delegates attending the Forum were also invited to an event at the British High Commission to celebrate the Canadian Climate Institute and the Net Zero Advisory Body’s Annual Climate Conference. This reception celebrated milestones in the fight against climate change and showcased the newly opened British High Commission building which has been designed with reused materials and low emission principles in mind."
        },
        {
            "text": "Days 3 and 4 - Presentations, Networking, and Building a Global Ocean Community"
        },
        {
            "text": "The Forum itself consisted of two days of presentations, panels, discussions, and networking opportunities. Delegates discussed the priority needs of the Atlantic Ocean, with a large focus on collaboration with all partners that have a stake in the successful safeguarding of the Atlantic. Many shared the feeling of motivation they were taking away with them from the ideas and shared sense of action."
        },
        {
            "text": "On the final day, Lianne and Parvathi presented the ideas they had worked on in their groups and the AAORIA community had a chance to provide feedback and ask questions about the implementation of the plans. These ideas were also summarised into a policy brief to be considered by AAORIA’s High Level Board at a later date. UK ECOPs found that this was an invaluable experience in shaping and communicating innovative ideas in a policy-oriented context."
        },
        {
            "text": "Reflections"
        },
        {
            "text": "This extended experience felt distinct from traditional research-based scientific conferences. AAORIA fostered a welcoming environment that encouraged cross-sector collaboration and truly valued the contributions of ECOPs, recognising the importance of involving young talent in high-level discussions. Rather than feeling like additional tasks, the ECOP responsibilities were engaging and enjoyable, promoting their place as integral members of the Forum. AAORIA offered ECOPs a unique blend of skill-building, community engagement, and global networking. It was a great platform for ECOPs to present their work, exchange ideas, and network with seasoned professionals. Both Lianne and Parvathi reflected that being part of this Alliance broadened their perspectives on ocean science and policy and left them with a deeper appreciation for the collaborative potential of the All-Atlantic community."
        },
        {
            "text": "Find out more about AAORIA on their website."
        }
    ]
}