{
    "url": "https://environmentagency.blog.gov.uk/2024/12/13/more-projects-improving-the-environment-through-nature-market-initiatives/",
    "title": "More projects improving the environment through nature market initiatives ",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Nature",
        "Sustainability"
    ],
    "pub_date": "2024-12-13T09:47:35+00:00",
    "content": [
        {
            "text": "More projects improving the environment through nature market initiatives "
        },
        {
            "text": "Today we hosted our Natural Environment Investment Readiness Fund (NEIRF) Round 3 grantees at the University of Warwick for a dedicated networking and learning day.  "
        },
        {
            "text": "This fund is one of the ways we are supporting greater private sector funding into nature, sometimes referred to as Green Finance.  The fund, provided by Defra, aims to stimulate private investment to improve and safeguard our domestic natural environment by helping projects get ready for investment.   "
        },
        {
            "text": "Projects aim to find buyers for additional ecosystem services they can sell, such as carbon sequestration, flood management, or meeting the requirements of biodiversity net gain for new developments alongside food production.  "
        },
        {
            "text": "The event, organised by the Ecosystems Knowledge Network with support from Defra, the Environment Agency, and the Green Finance Institute, was an important milestone in the evolution of nature markets. As well as enabling grantees to share knowledge and learning on accessing the Green Finance market, there were also experts present to advise on legal and tax considerations for nature market participation.  "
        },
        {
            "text": "We also had the opportunity to discuss the success of the NEIRF so far, as detailed in evaluation of the first three years.  "
        },
        {
            "text": "Evaluation of the first few years of NEIRF Projects "
        },
        {
            "text": "The evaluation report highlights early progress for the first two rounds alongside crucial insights about the future of nature markets.    "
        },
        {
            "text": "Projects are beginning to tap into emerging nature markets, however, they remain small scale. Each successful project remains bespoke, with success and revenues increasingly generated by strong place-based business cases.  "
        },
        {
            "text": "These early pioneer NEIRF projects are already reporting they have secured £9.4 million in upfront funding through a diverse mix of sources, including their own organisational resources and grants available to the farming sector (see Funding for farmers, growers and land managers for opportunities). By May this year, the projects had generated £3 million in revenue from the sale of ecosystem services. Projects are supporting 24 ongoing jobs."
        },
        {
            "text": " "
        },
        {
            "text": "Several key factors have emerged from our evaluation. You can explore detailed case studies of these innovative approaches at hive.greenfinanceinstitute.com/gfihive/neirf/.. "
        },
        {
            "text": "What makes a NEIRF project successful? "
        },
        {
            "text": "The ability to adapt project plans is vital whilst operating in an innovative and evolving policy space. Leaders need to remain resilient and agile in responding to emerging opportunities and challenges in real-time. "
        },
        {
            "text": "An effective knowledge exchange and peer learning community helps amplify learning rapidly.  The NEIRF Community of Practice supported by Defra, the Environment Agency, and Natural England guidance enable this exchange and was highly valued. "
        },
        {
            "text": "Our commitment to creating collaborative learning environment continues.  "
        },
        {
            "text": "Development of a compelling, evidence based business and financial plan, supported by professional technical services increases confidence from buyers and the overall success of projects.  Environmental surveys, financial modelling, legal advice and communication and stakeholder engagement being the most commonly procured support services from NEIRF funding.  "
        },
        {
            "text": "Successful projects are demonstrating that organisations can effectively design financially viable approaches when given appropriate support and report their ability to replicate this for future projects with less bought in support. "
        },
        {
            "text": "Full List of Neirf Round 3 Grant Recipients: "
        },
        {
            "text": "Project: Blackwater Environmental Investment for Conservation (BEIC)  "
        },
        {
            "text": "Applicant: Land Management Services  "
        },
        {
            "text": "Funding: £99,172  "
        },
        {
            "text": "Details: Creating attractive investment propositions for developers and businesses focusing on Biodiversity Net Gain (BNG), blue carbon, and water quality improvements on a 150ha coastal farm in the Blackwater Estuary.  "
        },
        {
            "text": "Project: Developing a single farm scalable BNG and Woodland Carbon model without stacking:  "
        },
        {
            "text": "Applicant: Manor House Stoke Trister Limited  "
        },
        {
            "text": "Funding: £83,333  "
        },
        {
            "text": "Details: Working with Finance Earth and Creating Tomorrows Forests to develop a replicable business model combining Biodiversity Net Gain (BNG) and Woodland Carbon (WCC). Creating assessment and delivery solutions for farmers while avoiding stacking concerns by not layering revenue streams on the same land parcel. "
        },
        {
            "text": "Project: The Wey to Natural Flood Management Investment Readiness :  "
        },
        {
            "text": "Applicant: Surrey Wildlife Trust  "
        },
        {
            "text": "Funding: £100,000  "
        },
        {
            "text": "Details: Working with Finance Earth and South East Rivers Trust to assess Natural Flood Management measures across 2 flood risk zones on the River Wey. Focusing on 7 landholdings between Tilford and Guildford to investigate private investment potential, with emphasis on modelling flood risk reduction and monetising flood risk exposure for insured properties. "
        },
        {
            "text": "Project: DIME 2  "
        },
        {
            "text": "Applicant: Wye and Usk Foundation  "
        },
        {
            "text": "Funding: £83,138  "
        },
        {
            "text": "Details: Collaborating with Rivers Trust, Hereford Rotary Club, Welsh Water, and Herefordshire Council to build on existing work quantifying market potential for restored nature processes in the Dore and Dulas sub-catchments of the River Wye. Aims to establish commercial and legal infrastructure to underpin a £7.2 million investment over 30 years in Natural Flood Management, base flow support, biodiversity, and carbon sequestration. "
        },
        {
            "text": "Project: Environmental Farmers Gorup (EFG)  Aggregated Woodland Planting Model – ramping up woodland planting  "
        },
        {
            "text": "Applicant: Environmental Farmers Group  "
        },
        {
            "text": "Funding: £99,550  "
        },
        {
            "text": "Details: Working across 170,000 ha (2% of England's farmed area) with Zulu Ecosystems (ZE) and Natural Capital Advisory to address barriers to woodland planting on smaller farms. Using ZE's nature regeneration toolkit to identify woodland creation potential across 120 EFG members and design aggregation of woodland carbon projects. "
        },
        {
            "text": "Project: Developing an integrated supply-chain insetting model to catalyse paludiculture  "
        },
        {
            "text": "Applicant: SaltyCo Ltd (trading as Ponda)  "
        },
        {
            "text": "Funding: £99,549.20  "
        },
        {
            "text": "Details: Working with Finance Earth and Lancashire Wildlife Trust to develop a blended agri-carbon model for lowland peat restoration. Creating a Paludiculture Insetting Model  working with textile supply chain partners including landowners, bio-materials manufacturers, and fashion corporates like Stella McCartney and Burberry. "
        },
        {
            "text": "Project: Nature Markets and Paludiculture :  "
        },
        {
            "text": "Applicant: The Lancashire Wildlife Trust  "
        },
        {
            "text": "Funding: £99,367.54  "
        },
        {
            "text": "Details: Working with four farming systems to address obstacles to accessing nature markets for paludiculture systems. Focusing on collecting detailed data to quantify environmental benefits and develop investable projects that drive carbon savings, water quality, and biodiversity benefits while securing sustainable economic futures for farmers on lowland peat soils. "
        },
        {
            "text": "Project: Westcountry River Bank "
        },
        {
            "text": "Applicant: Westcountry Rivers Trust  "
        },
        {
            "text": "Funding: £99,980  "
        },
        {
            "text": "Details: Building on previous NEIRF projects to create watercourse units across Devon and Cornwall centred on weir removals. Projects expected to provide Biodiversity Net Gain units. "
        },
        {
            "text": "Project: Enabling climate resilient utilities and infrastructure – What the buyers want  "
        },
        {
            "text": "Applicant: North East Cotswold Farmer Cluster CIC  "
        },
        {
            "text": "Funding: £99,962  "
        },
        {
            "text": "Details: Working with Network Rail, Thames Water, and Great Yellow Atkinsalis to develop and test a market model for farm revenues from nature based solutions protecting utilities and infrastructure from water related risks. Exploring potential for farm-level solutions to replace hard engineering approaches. "
        },
        {
            "text": "Project: Creating a scalable Biodiversity Net Gain business model for farms bordering nature reserves  "
        },
        {
            "text": "Applicant: Netherfields  "
        },
        {
            "text": "Funding: £100,000  "
        },
        {
            "text": "Details: Working with Finance Earth and partners to develop a replicable business case for Biodiversity Net Gain at a Northants farm bordering Summer Leys Nature Reserve. Creating decision-making processes for farmland neighbouring protected areas and analysing cost-benefits of alternative land uses. "
        },
        {
            "text": "Project: Develop a replicable whole farm operating model for regenerative community farms  "
        },
        {
            "text": "Applicant: Tablehurst and Plaw Hatch Community Farm Ltd  "
        },
        {
            "text": "Funding: £99,800  "
        },
        {
            "text": "Details: Working with Finance Earth to develop a replicable 'whole farm' operating model for community-owned regenerative farms, piloted at Tablehurst Farm in East Sussex. Aiming to unlock ecosystem services revenues such as carbon, Biodiversity Net Gain and agroforestry to complement regenerative farming practices and attract private investment. "
        },
        {
            "text": "Project: Supply chain financing for farmers to transition to more sustainable practices "
        },
        {
            "text": "Applicant: Soil Association Exchange  "
        },
        {
            "text": "Funding: £99,583  "
        },
        {
            "text": "Details: Building on work developing a Sustainable Farm Practices Fund mechanism to channel funding from supply chain actors to farmers transitioning to sustainable practices. Expected to generate practice change 'trades' with value chain 'buyers' funding sustainable farming activities on approximately 80 farms. "
        },
        {
            "text": "Project: Aggregating for market access with a place based trust  "
        },
        {
            "text": "Applicant: Plymouth City Council  "
        },
        {
            "text": "Funding: £99,938  "
        },
        {
            "text": "Details: Working with the Erme to Yealm Coastal Cluster and Finance Earth to explore governance mechanisms for aggregating ecosystem services across a cluster of 5 farms. Focusing on revenue mapping with emphasis on Biodiversity Net Gain and Wilder Carbon. "
        },
        {
            "text": "Project: Realising grassland potential: an ecosystem service toolkit for farmers "
        },
        {
            "text": "Applicant: Plantlife International  "
        },
        {
            "text": "Funding: £100,000  "
        },
        {
            "text": "Details: Working with multiple partners including Pasture for Life and Nature Friendly Farming to develop a grassland creation toolkit for smaller farmers. Supporting transition to regenerative grassland management using market opportunities from carbon, biodiversity and water management, including insetting. "
        },
        {
            "text": "Project: Environmental Farmers Group Northern Lincolnshire Carbon Value Chain  "
        },
        {
            "text": "Applicant: Environmental Farmers Group (Northern Lincs)  "
        },
        {
            "text": "Funding: £99,700  "
        },
        {
            "text": "Details: Working with 40 farmers covering over 22,000ha to identify potential carbon market opportunities. Creating new value by standardising calculation of carbon emissions and sequestration across a significant farmed area and providing opportunities to supply chain and local industry. "
        },
        {
            "text": "Project: Developing a replicable multi-use business model for organic farms  "
        },
        {
            "text": "Applicant: M A & D J Parsley & Son  "
        },
        {
            "text": "Funding: £98,125  "
        },
        {
            "text": "Details: Working with Finance Earth to develop a multi-use business model for  a 150-acre organic farm near the Great Fen. Creating a robust operating model to support regenerative practices through activities including woodland creation, conversion of arable land to grassland, and agroforestry to provide ecological links with the Great Fen and Monks Wood National Nature Reserve. "
        },
        {
            "text": "Project: Gloucestershire's Nature Project Portfolio Investment Model  "
        },
        {
            "text": "Applicant: Farming Advisory Wildlife Group South West Ltd  "
        },
        {
            "text": "Funding: £99,750  "
        },
        {
            "text": "Details: Working with Landscape Enterprise Network and The Land App to create a methodology for high-integrity, county-wide nature projects. Developing options to sell investment opportunities to non-credit based nature markets, building on existing markets facilitated by the Integrated Local Delivery model. "
        },
        {
            "text": "Project: West Lakeland Water and Terrestrial Ecosystem Services  "
        },
        {
            "text": "Applicant: West Lakeland Farmer-Led Nature Recovery CIC  "
        },
        {
            "text": "Funding: £100,000  "
        },
        {
            "text": "Details: Partnering with Lake District National Park, West Cumbria Rivers Trust and National Trust to engage with 49 farms and 3 commons. Creating costed natural capital opportunities for carbon, biodiversity and water stewardship with clear delivery plans co-designed with farmers. "
        },
        {
            "text": "Project: Getting Wiltshire Investment Ready  "
        },
        {
            "text": "Applicant: Wiltshire Wildlife Trust Ltd  "
        },
        {
            "text": "Funding: £97,790  "
        },
        {
            "text": "Details: Working with Entrade and Black Sheep Advisors to build on the Bristol Avon Catchment Market. Supporting a minimum of 15 farms (100ha) to become investment ready for biodiversity, water quality and carbon markets. "
        },
        {
            "text": "Project: A resilient and scalable Farm Cluster Natural Capital Financing Model  "
        },
        {
            "text": "Applicant: Surrey Wildlife Trust  "
        },
        {
            "text": "Funding: £100,000  "
        },
        {
            "text": "Details: Collaborating with Finance Earth, South East Water and LandApp to support 8 landowners in East Surrey. Developing a scalable farm cluster governance model to enable farmers to enter natural capital markets collectively, accelerating nature recovery through baseline data, habitat enhancement and financial analysis. "
        },
        {
            "text": "Project: Voluntary Biodiversity Units: A New Nature Market in the South Downs  "
        },
        {
            "text": "Applicant: South Downs National Park Authority (SDNPA)  "
        },
        {
            "text": "Funding: £99,705  "
        },
        {
            "text": "Details: Working with Earthly Limited and National Parks Partnership to engage buyers from 8,500 SMEs in/around the National Park. Creating a new National Voluntary Biodiversity Units Register with Earthly and exploring scale-up opportunities across Protected Landscapes and farming networks. "
        },
        {
            "text": "Project: Farming Nature Derwent - A place-based payment for ecosystem services scheme for farmers and land manager.   "
        },
        {
            "text": "Applicant: Derbyshire Wildlife Trust  "
        },
        {
            "text": "Funding: £100,000  "
        },
        {
            "text": "Details: Working with 6 landowners in 4 clusters to test and troubleshoot the Green Finance Institute's toolkit. Developing investment-ready business models for land managers to deliver environmental benefits, establishing the most viable Natural Capital markets for different farms at various scales. "
        },
        {
            "text": "Project: Developing a stacked revenue model for Sphagnum moss farming  "
        },
        {
            "text": "Applicant: Micropropagation Services Limited  "
        },
        {
            "text": "Funding: £98,519  "
        },
        {
            "text": "Details: Working with Finance Earth and Manchester Metropolitan University to create a stacked revenue model incentivising farmers to restore degraded lowland peat through sphagnum farming. Combining commodity sales, agri-environment schemes, and ecosystem services to monetise carbon and biodiversity benefits. "
        },
        {
            "text": "Project: Investing in resilient farmed landscapes in the Upper Irwell  "
        },
        {
            "text": "Applicant: Groundwork Greater Manchester  "
        },
        {
            "text": "Funding: £98,189.53  "
        },
        {
            "text": "Details: Collaborating with Environment Agency, Greater Manchester Combined Authority, United Utilities, and others to develop a consortium of buyers for Natural Flood Management services across 4,500ha of the upper Irwell Catchment. Including hydraulic modelling and engagement with existing farmer networks. "
        },
        {
            "text": "Project: Aggregated investment model for Stour Valley's nature recovery  "
        },
        {
            "text": "Applicant: Bournemouth, Christchurch and Poole Council  "
        },
        {
            "text": "Funding: £99,850  "
        },
        {
            "text": "Details: Working with National Trust, Finance Earth, Wessex Water and others to develop a place-based strategy for nature-based interventions. Creating a legal framework and governance structure to help farmers with different tenures work together under an aggregated investable proposition across 5 pilot farms. "
        },
        {
            "text": "Project: An endowment mechanism to de-risk Biodiversity Net Gain habitat long-term liabilities  "
        },
        {
            "text": "Applicant: Environmental Finance Limited (Finance Earth)  "
        },
        {
            "text": "Funding: £88,050  "
        },
        {
            "text": "Details: Working with South Downs National Park Authority, Howden Group Holdings and National Forest Company to address lack of project finance for habitat banking models. Developing a mechanism/endowment for an initial cohort of 5 projects to identify how delivery of biodiversity projects can be de-risked. "
        },
        {
            "text": "Project: Reducing flooding in Braunton  "
        },
        {
            "text": "Applicant: Biosphere Foundation CIC  "
        },
        {
            "text": "Funding: £100,000  "
        },
        {
            "text": "Details: Working with North Devon Biosphere Foundation and 20 farmers in the River Caen catchment to implement and maintain Natural Flood Management measures aimed at significantly reducing flood frequency and duration in Braunton. "
        },
        {
            "text": "Project: Water Outcomes through Nature-Based Farming Interventions  "
        },
        {
            "text": "Applicant: George Thompson (Great Oakley) Ltd  "
        },
        {
            "text": "Funding: £98,875  "
        },
        {
            "text": "Details: Working with Tendring Farm Cluster (50 farmers managing 20,000 hectares), Finance Earth and Aquascope to develop investment cases for Regenerative Agricultural interventions focused on water quality benefits. Using Aquascope to simulate and verify intervention impacts across two sub-catchments. "
        },
        {
            "text": "Project: Developing the business model for farm scale soil carbon with biochar  "
        },
        {
            "text": "Applicant: Restord Ltd  "
        },
        {
            "text": "Funding: £99,625  "
        },
        {
            "text": "Details: Piloting small-scale biochar production and distribution to refine a scalable economic model generating high-value soil input for local regenerative agriculture. Working with Environmental Finance ltd and CAPCHAR ltd to finesse the business case for scale-up with suitable financing. "
        },
        {
            "text": "Project: Orton Fells Ecosystem Services Project  "
        },
        {
            "text": "Applicant: Orton Fells Farmer Cluster CIC  "
        },
        {
            "text": "Funding: £98,088  "
        },
        {
            "text": "Details: Working with 12 farmers and Yorkshire Dales National Park to increase farmer capacity to deliver ecosystem services and market to private buyers. Aiming to generate new, long-term, reliable income streams and develop farm-level business cases for landscape-scale actions. "
        },
        {
            "text": "Project: Forest of Selwood: reviving the \"Heart of Wessex\"  "
        },
        {
            "text": "Applicant: Forest of Selwood  "
        },
        {
            "text": "Funding: £100,000  "
        },
        {
            "text": "Details: Working with Environment Agency, Finance Earth, BioFarm and others to establish a scalable investment model for nature recovery. Operating across 600 Ha of pilot sites to unite buyers of Biodiversity Net Gain Units , Nutrient Credits and Carbon Credits with farmers and landowners, with estimated returns of £7.5 million across pilot sites. "
        },
        {
            "text": "Project: Biodiverse Farm Canopies: Managing Farm Woodlands for Biodiversuty Sales   "
        },
        {
            "text": "Applicant: Forest Canopy Foundation  "
        },
        {
            "text": "Funding: £99,639  "
        },
        {
            "text": "Details: Working with Sylva foundation and partners to empower farmers to generate income from biodiversity uplift through new management of existing woodlands. Developing tools, financial models, and legal documents based on a pilot project in Oxfordshire. "
        },
        {
            "text": "Project: Farms delivering locally specified natural environment services  "
        },
        {
            "text": "Applicant: Owletts Farm Partnership  "
        },
        {
            "text": "Funding: £49,356  "
        },
        {
            "text": "Details: Working with East Sussex County Council and Restored Land ltd to transition 220-acre Owletts Farm from overgrazed \"improved pasture\" to bio-abundant wood pasture including new wetlands and woodlands. Selling benefits from BNG with potential revenue from Nutrient Neutrality, Hedgerow and Soil Carbon. "
        },
        {
            "text": "Project: Duddon Farm Cluster  Biodiversity Net Gain (BNG) Project  "
        },
        {
            "text": "Applicant: Duddon Farm Cluster Group  "
        },
        {
            "text": "Funding: £94,375.20  "
        },
        {
            "text": "Details: Working with multiple partners to develop a replicable model for farmer-led, collaborative BNG delivery. Aiming to share costs and benefits to increase profitability while delivering enhanced environmental outcomes including thriving wildlife and improved water quality. "
        },
        {
            "text": "Project: Readying Velcourt managed farms for private investment  "
        },
        {
            "text": "Applicant: Velcourt Ltd  "
        },
        {
            "text": "Funding: £97,537  "
        },
        {
            "text": "Details: Partnering with Plantlife to drive investment of approximately £10 million into nature restoration across Velcourt-managed farms. Identifying land suitable for nature restoration, assessing saleable biodiversity uplift, and creating business cases for potential buyers. "
        },
        {
            "text": "Project: Green Futures: Sustainable farming through scalable collaborative investment  "
        },
        {
            "text": "Applicant: Wear Rivers Trust  "
        },
        {
            "text": "Funding: £99,990  "
        },
        {
            "text": "Details: Working with Trinity Ag tech to transition farms to sustainable revenue models independent of commodity markets through software, tools, and training to enable wider networks to gain insights into carbon and ecosystem markets. "
        },
        {
            "text": "Project: Funding wetlands in the River Severn Valley  "
        },
        {
            "text": "Applicant: Worcestershire Wildlife Trust  "
        },
        {
            "text": "Funding: £99,140  "
        },
        {
            "text": "Details: Working with Finance Earth and farmers to create business cases for wetland implementation and Natural Flood Managment interventions along the flood-prone Severn River. Focusing on riparian arable and dairy farms facing increasing flood risk, considering hydrology, opportunity cost and delivery risk. "
        },
        {
            "text": "Project: Oxfordshire Land Function Exchange  "
        },
        {
            "text": "Applicant: North East Cotswold Farmer Cluster CIC  "
        },
        {
            "text": "Funding: £99,930  "
        },
        {
            "text": "Details: Developing a replicable, tech-enabled system for optimising land use options across landscapes. Creating systematic understanding of ecosystem service functions and establishing a replicable ecosystem function exchange including local intermediary acting for buyers and sellers. "
        },
        {
            "text": "Project: Biofarm Biodiversity Net Gain (BNG) Implementation  "
        },
        {
            "text": "Applicant: Biofarm Limited  "
        },
        {
            "text": "Funding: £88,092.81  "
        },
        {
            "text": "Details: Working with developers (buyers) and landowners/farmers (sellers) to meet statutory BNG obligations while enabling environmental profit in a transparent way. Expanding capabilities to offer opportunities to more farmers throughout England. "
        },
        {
            "text": "Project: Boundary Boost.  "
        },
        {
            "text": "Applicant: Dartmoor National Park Authority.   "
        },
        {
            "text": "Funding £100,000.   "
        },
        {
            "text": "Details: The project aims to develop a model which provides sufficient incentives to farmers and landowners across the Dartmoor landscape, via nature markets by creating an additional layer of income to influence and reward the natural capital provision of the network of field boundaries, maintaining and enhancing them for the longer term. "
        },
        {
            "text": "Project: East Devon and West Dorset Green Finance Group.   "
        },
        {
            "text": "Applicant National Landscape Association.   "
        },
        {
            "text": "Funding £99,900.   "
        },
        {
            "text": "Details: The group is a collaboration of nature-based solution delivery partners working across 6 contiguous catchments covering 1290sq km. The group will support a farmer led consortium based around the 8 farm clusters (270 farms in total).  The project will seek to develop an integrated, scaled-up offer that can attract investment from the corporate sector "
        },
        {
            "text": "Project: Coppiced Woodland Revival – Investing in biodiversity and biochar benefits.  "
        },
        {
            "text": "Applicant Albanwise Environmental Ltd.   "
        },
        {
            "text": "Funding: £99,894.   "
        },
        {
            "text": "Details: Albanwise Environment working with Norfolk Wildlife Trust, Accelar, UK Hab, University of Nottingham, aims to develop an agroecology scheme to explore the viability of new and existing nature-rich, locally sourced, coppiced broadleaved woodland and agroforestry for the purpose of biochar production. It will provide clarity around the complex ecosystem service opportunities on a number of revenue opportunities, through biodiversity markets, internal cost saving from heat and economic benefits, in addition to revenue options through carbon trading platforms. "
        },
        {
            "text": "Project: A scalable gross margin calculator for sustainable farming practices.  "
        },
        {
            "text": "Applicant:  Soil Exchange Ltd.   "
        },
        {
            "text": "Funding £90,500  "
        },
        {
            "text": "Details: Soil Association and Cumulus consultants will work with farms to build a scalable gross margin calculator based on farming practice change and available funding.  The tool builds on existing technology developed by the Soil Association including private funding options like Biodiversity Net Gain, nutrient neutrality, water company and amalgamates public and private scheme data.  The calculator will help farmers take up sustainable practices and ecosystem services. "
        },
        {
            "text": "Project: Creating a Replicable Biodiversity Net Gain Investment Model for Farmers through Action Learning.  "
        },
        {
            "text": "Applicant: Nene Part Trust:  "
        },
        {
            "text": "Funding: £99,949.   "
        },
        {
            "text": "Details: Nene Park Trust will use the funding to design a nature investment model centred on delivering enhanced ecosystem services alongside productive regenerative agricultural farming techniques. "
        },
        {
            "text": "Project: Skerne Catchment Farmers Delivery Group.  "
        },
        {
            "text": "Applicant: Durham Wildlife Trust.  "
        },
        {
            "text": "Funding: £98,477.   "
        },
        {
            "text": "Details: Durham Wildlife Trust will build on previous NEIRF pilots to create a farmer-focused model to deliver improvements to the local rural economy through a localised market, matching farming with developers and investors. The project will work across a number of land holdings and ownership models to identify off-setting and environmental credit opportunities for buyers and investors. "
        },
        {
            "text": "Project: Developing a Regional Natural Capital Market and Mechanism.   "
        },
        {
            "text": "Applicant: BioCap.   "
        },
        {
            "text": "Funding: £100,000.   "
        },
        {
            "text": "Details: BioCap working with Finance Earth, Berkshire, Buckinghamshire and Oxfordshire Wildlife Trust and others will design, quantify and cost 8 Natural Capital habitat creation projects across 255ha. Projects will become ‘investment ready’ to sell ecosystem services to buyers through a ‘sale of claims’ approach, where a project uses scientific evidence and robust methodologies to measure a basket of impacts, define what claims can be made and then seeks payment for interventions in return for those claims. "
        },
        {
            "text": "Project: Bridgewater Commons Future Planning.  "
        },
        {
            "text": "Applicant: Wildfowl and Wetlands Trust.  "
        },
        {
            "text": "Funding: £94,602.   "
        },
        {
            "text": "Details: The project aims to leverage private finance through mechanisms such as Biodiversity Net Gain, soil and saltmarsh carbon, and biodiversity credits, as part of a blended finance approach including Environmental Land Management payments. It will financially model options for future management, which may include intertidal habitat creation and factor in advice on land ownership, governance and contracts helping to maximise farmers' income, securing long-term viability of farming businesses and Commons management. "
        },
        {
            "text": "Project: South Pennines Environmental Market.  "
        },
        {
            "text": "Applicant: The Calder and Colne Rivers Trust.   "
        },
        {
            "text": "Funding: £81,335.  "
        },
        {
            "text": "Details: The project will explore mechanisms for the South Pennines Farmers’ Group to enter nature markets, enabling positive long-term land management and sustainable rural businesses. The project will propose the governance structure of a brokerage or trading entity and create template contracts required for securing and selling mandatory Biodiversity Net Gain units and voluntary ecosystem units, allowing new markets to be integrated in the future. "
        },
        {
            "text": "Project: Natural Capital Scoping and investment readiness in the Arkengarthdale Valley.  "
        },
        {
            "text": "Applicant: Heggs Farm.   "
        },
        {
            "text": "Funding: £92,000.   "
        },
        {
            "text": "Details: Heggs Farm will be used as a case study for which baseline surveys and natural capital scenarios will be completed to demonstrate to 6 local farmers covering 1357ha how local, regional and national priorities can be delivered.  Real Wild Estates will act as the advisor and deliver surveys, providing modelled scenarios to local farms. "
        },
        {
            "text": "Project: Delivering a scaleable investment model for resilient upland ecosystems.   "
        },
        {
            "text": "Applicant: Kilnsey Park Estate.   "
        },
        {
            "text": "Funding: £99,985.   "
        },
        {
            "text": "Details: The Kilnsey Estate, working with Cumulus Consultants, Credit Nature, the Rivers Trust, Yorkshire Dales National Park, and Yorkshire Water will develop and test an innovative ecosystem-based nature funding model that generates credits for ‘bundled’ ecosystem services to fund nature recovery and species conservation in Upper Wharfedale in the Yorkshire Dales National Park. "
        }
    ]
}