{
    "url": "https://teaching.blog.gov.uk/2024/12/13/start-your-school-day-right-the-benefits-of-breakfast-clubs/",
    "title": "Start your school day right - the benefits of breakfast clubs",
    "authors": [
        "Ash McGann"
    ],
    "categories": [
        "Primary schools",
        "Pupil wellbeing and behaviour"
    ],
    "pub_date": "2024-12-13T15:19:19+00:00",
    "content": [
        {
            "text": "Headteacher Mrs Ash McGann shares Burton Green Primary School’s experience of being part of the Healthy Breakfast club pilot scheme and the benefits it’s brought to the whole school."
        },
        {
            "text": "We all know that having a healthy substantial breakfast is key to setting up young people for the best possible day in school. Our Healthy Minds breakfast club has brought innumerable benefits to our school community."
        },
        {
            "text": "Thanks to York’s Community Fund’s Hungry Mind’s Appeal, we have been taking part in a healthy breakfast club pilot scheme since January. The pilot scheme is funded by a combination of the council, Persimmon Homes and from donations to York Hungry Minds appeal.  Providing free, healthy breakfast every day for all our children from Reception to Year 6. Making use of a 2-week menu we provide varied healthy options and give our young people the best start to their day."
        },
        {
            "text": "From starting everyone’s day right to improving attendance, behaviour and attainment, the benefits of our breakfast club have been obvious from day one."
        },
        {
            "text": "Only a year ago, punctuality was a key challenge we were exploring ways to face, and now children are no longer late but are in fact eager to get to school for breakfast."
        },
        {
            "text": "This ensures teaching time is maximised as children are in school from before the start of their first class. We’re already seeing the impact on students' attainment now that teaching and assembly time (which was previously missed due to lateness) is being fully utilised."
        },
        {
            "text": "Our breakfast club has also provided our Senior Leadership Team a new opportunity to talk with students. Offering them a chance to speak to trusted adults before the day and share any worries they may have in a calm and safe space."
        },
        {
            "text": "Behaviour has improved both throughout the day at school and at home. We have also seen our SEND pupils benefit considerably from the softer transition into the school day."
        },
        {
            "text": "It’s not just our staff who feel these benefits but also our parent community. 35% of our pupils are eligible for pupil premium. Whilst around 40 pupils attend breakfast club each day, 70% of this group are our pupil premium students. As such many of our families find the financial benefits to be a big help especially given the current cost of living, but they too gain from the benefits listed above as well."
        },
        {
            "text": "Top 5 things to consider when setting up your breakfast club"
        },
        {
            "text": "We’ve seen such a success with our breakfast club and the City of York Council are now looking to extend the scheme to more schools in the area and we are looking forward to what 2025 will bring to our Healthy Minds Breakfast Club!"
        },
        {
            "text": "Further Resources"
        },
        {
            "text": "Guidance on the Breakfast clubs early adopters scheme"
        }
    ]
}