{
    "url": "https://defraenvironment.blog.gov.uk/2024/12/13/sustainable-festivities-how-you-can-reduce-your-waste-this-christmas/",
    "title": "Sustainable festivities: how you can reduce your waste this Christmas",
    "authors": [
        "Environment blog team"
    ],
    "categories": [
        "Sustainability"
    ],
    "pub_date": "2024-12-13T09:15:39+00:00",
    "content": [
        {
            "text": "The festive period is a time to celebrate and enjoy decorating trees, giving gifts and eating lots of delicious food. "
        },
        {
            "text": "But all of this can have an impact on the environment. The additional waste from  Christmas is estimated to exceed 3 million tonnes in the UK.  "
        },
        {
            "text": "For example, of the 175 million mince pies purchased (using 175 tonnes of aluminium packaging), approximately 74 million are discarded.  "
        },
        {
            "text": "And the wrapping paper the UK uses each year is enough to wrap the island of Guernsey. "
        },
        {
            "text": "Of course, these activities are what makes Christmas special, but there are actions you can take to reduce your environmental impact footprint during the celebration.  "
        },
        {
            "text": "Here we’ve shared a few ideas for inspiration. "
        },
        {
            "text": "Christmas trees and decorations "
        },
        {
            "text": "A beautifully decorated tree is at the heart of many Christmas celebrations. "
        },
        {
            "text": "If you choose a real Christmas tree with its roots attached, after the festive season you can keep it in a pot outside so you can re-use it for future years, or plant it in the garden. "
        },
        {
            "text": "If your tree does not have roots, you can find out where to recycle it by checking your local council’s website. Trees can be recycled into wood chips and used for green spaces and parks, or shredded and composted.  "
        },
        {
            "text": "Good quality artificial trees can be re-used for many years, but they are not recyclable. If your tree is in good condition, you could consider donating it to a charity shop, school or community group. "
        },
        {
            "text": "There are lots of fantastic options for home-made decorations, using sustainable materials. For example, you can craft origami stars or garlands with scrap paper or try using dried orange slices with cloves to decorate your trees. "
        },
        {
            "text": "LED lights use less energy and last longer than standard builds. Opt for plug-in lights over battery powered and remember to turn them off at night to stay safe and save money.  "
        },
        {
            "text": "Lights should be recycled when they no longer work. They can be recycled in small electrical household waste schemes or you can find somewhere local to you at Recycle Now.  "
        },
        {
            "text": "Gifts and wrapping "
        },
        {
            "text": "Each year, the UK throws away approximately £42 million of unwanted presents, most of which end up in landfill. "
        },
        {
            "text": "You can make beautiful Christmas gifts at home. Jams, chutneys, baked goods or even a knitted scarf or hat give a personal touch and are relatively low cost. If DIY is not for you, try gifting an experience or membership – perhaps for an organisation that supports the environment or nature. "
        },
        {
            "text": "It is also estimated that the UK uses 227,000 miles of wrapping paper each year. "
        },
        {
            "text": "So, when it comes to wrapping gifts this year, consider what you can do to reduce the amount of new wrapping paper used. You could re-use fabric or recycled wrapping paper. "
        },
        {
            "text": "And if you’re thinking of buying new wrapping materials, avoid wrapping paper with glitter or that is laminated because these aren’t recyclable. Instead, look for the FSC sign or make sure it is 100% recycled, and save wrapping paper to re-use next year.  "
        },
        {
            "text": "You can also do the scrunch test with wrapping paper to check if paper can be recycled. Scrunch the wrapping paper into a ball – if it stays in a ball, it can be recycled, if it bounces back it has to go in the bin.   "
        },
        {
            "text": "Another great idea is to re-use Christmas cards as gift tags, by cutting out the design and using a holepunch to make a hole for the ribbon. "
        },
        {
            "text": "Cutting down food waste "
        },
        {
            "text": "Try to shop locally for your Christmas dinner – buying meat, vegetables and sweet treats from nearby businesses. "
        },
        {
            "text": "After the festivities are over, don’t throw your food away – usually most poultry waste is chicken but, at Christmas, turkey takes over. "
        },
        {
            "text": "You can freeze excess meat for up to 6 months and defrost either in the fridge or using the defrost setting on your microwave. Read these storage and cooking tips for more information. "
        },
        {
            "text": "We wish you a very merry (and sustainable!) Christmas from the Defra Environment blog team."
        },
        {
            "text": "For more tips on how to have an environmentally friendly Christmas, read Recycle Now’s dedicated Christmas page."
        }
    ]
}