{
    "url": "https://socialcareinspection.blog.gov.uk/2024/12/13/the-ilacs-framework-whats-changing-and-why/",
    "title": "The ILACS framework – what’s changing and why?",
    "authors": [
        "Yvette Stanley"
    ],
    "categories": [
        "care leavers",
        "children's services",
        "inspection framework",
        "local authorities"
    ],
    "pub_date": "2024-12-13T09:43:39+00:00",
    "content": [
        {
            "text": "In December 2024, we updated the inspecting local authority children's services (ILACS) framework. This blog will discuss why we’re making these changes, the reviews that informed them, and how we are responding to your feedback."
        },
        {
            "text": "Why we updated the framework"
        },
        {
            "text": "Some updates were to make sure that the framework remains aligned with wider changes in the sector, such as:"
        },
        {
            "text": "Other changes are from the outcome of 2 reviews which looked at: "
        },
        {
            "text": "To gather feedback, we met with:"
        },
        {
            "text": "And we are grateful to the national leaving care benchmarking forum. We meet the forum regularly to hear the feedback of leaving care teams and care-experienced young people."
        },
        {
            "text": "The experiences and progress of care leavers"
        },
        {
            "text": "Inspectors and the sector agree that introducing a separate judgement for care leavers was a hugely positive change. It is helping to give these young people the recognition they deserve. Local leaders told us that it has raised the profile of care leavers and provided a useful lever for change in their area."
        },
        {
            "text": "We found that our evaluation of care leavers’ experiences is working well, and the sector has confidence in our findings. There are areas where we could do better:"
        },
        {
            "text": "In the Big Listen, we confirmed plans to remove single-word judgements for overall effectiveness. But until this happens, an inadequate judgement in any of our 3 practice judgements (help and protection, children in care, and care leavers) will result in an inadequate overall effectiveness judgement."
        },
        {
            "text": "This means that we will treat all local authorities the same the first time that we make a judgement on the experiences of their care leavers. We will make sure that we communicate this clearly at annual engagement meetings and at each inspection."
        },
        {
            "text": "We cannot report on the work of other departments or partners in an ILACS report. But we have strengthened our arrangements for writing to other inspectorates when we have concerns."
        },
        {
            "text": "We may also write to a local safeguarding partnership when we find that a partner has not engaged in the local arrangements to help, protect and care for children."
        },
        {
            "text": "Short inspections"
        },
        {
            "text": "Our review found agreement that the proportionate and risk-based approach of ILACS, including short inspections, is appropriate and remains fit for purpose. But there are changes that would help keep inspection manageable for inspectors and local leaders and staff."
        },
        {
            "text": "We did find some circumstances when a short inspection of a good or outstanding local authority might not be appropriate. These include when short inspections are far more challenging because:"
        },
        {
            "text": "We want to improve our approach to short inspections in circumstances like these. We also want to avoid adding unnecessary intensity to the single week of fieldwork we carry out."
        },
        {
            "text": "As a result, we are introducing:"
        },
        {
            "text": "We have added more detailed guidance to the framework, setting out the range of factors we will consider. This is about getting better at identifying when inspectors and local leaders need more time to arrive at a fair and accurate evaluation."
        },
        {
            "text": "A decision to carry out a standard inspection does not mean we are pre-judging our evaluation. In around half of the good or outstanding local authorities where we have already done this, the local authority was still judged good or outstanding. In one case, the judgement improved."
        },
        {
            "text": "We have amended our guidance on prioritising lines of enquiry. This is to make it clearer that we are testing the validity of the most recent self-evaluation by evaluating samples of casework. Our focus will be on where we can add to the local authority’s understanding of their services."
        },
        {
            "text": "We may quickly close lines of enquiry about practice that needs to improve if we’re confident that the local authority understands the issues and is taking appropriate action."
        },
        {
            "text": "We will ask local authorities to share information about their service structure and locations. This will give us more time to think about how to deploy our teams in the most efficient and effective way. It will also help us to make sure that the size of our team is proportionate to the largest and smallest local authorities and their number of offices."
        },
        {
            "text": "Learning and development"
        },
        {
            "text": "Through the Ofsted Academy, we committed to a learning culture with regular cycles of reflection and improvement."
        },
        {
            "text": "For ILACS, we are looking at how we can identify and share good inspection practice and support consistency in our work. We will:"
        },
        {
            "text": "An updated framework"
        },
        {
            "text": "The findings from these reviews are incredibly valuable. As ever, we have looked to improve where we can, and these reviews have helped us to do that."
        },
        {
            "text": "We have also published a summary of the changes we have made to the framework, which sets out the specific updates."
        },
        {
            "text": "ILACS is now entering its eighth year. Our first inspection was in January 2018. But we remain confident that its proportionate and risk-based approach, including short inspections, remains fit for purpose. It has the flexibility to respond to changing circumstances and to support you in delivering the best for children and families."
        },
        {
            "text": "Next steps"
        },
        {
            "text": "We will, of course, make further changes to reflect keeping children safe, helping families thrive and the anticipated Children's Well-Being Bill. You can read our blog responding to the policy paper to find out more."
        },
        {
            "text": "We will also make changes when we remove the overall effectiveness judgement. We will fully consult with you next year about what that might look like."
        }
    ]
}