{
    "url": "https://defrafarming.blog.gov.uk/2024/10/15/fipl-spotlight-transitioning-from-intensive-farming-to-nature-friendly-farming/",
    "title": "FiPL spotlight: transitioning from intensive farming to nature-friendly farming ",
    "authors": [
        "Rebekah Newman"
    ],
    "categories": [
        "Payments to support parks, National Landscapes and the Broads"
    ],
    "pub_date": "2024-10-15T12:27:38+01:00",
    "content": [
        {
            "text": "Bubnell Cliff Farm is situated on the eastern side of the Peak District National Park, in the hills close to Baslow village. It’s within view of the rugged gritstone outcrops of Baslow Edge and Birchen Edge. "
        },
        {
            "text": "This upland environment, with exposure to long wet winters on heavy clay soils, means that farms in the area mostly produce livestock.  "
        },
        {
            "text": "It is challenging for farmers to find markets for their produce, and many choose to diversify and/or sell directly to customers to support a viable farm business. "
        },
        {
            "heading": 2,
            "text": "A new vision for the farm  "
        },
        {
            "text": "The farm is 124 hectares which makes it a large-scale, commercial enterprise for the area.  "
        },
        {
            "text": "It is a tenanted farm and is part of the Duke of Devonshire’s Chatsworth Estate, just 2.5 miles from Chatsworth House which attracts 600,000 visitors annually. "
        },
        {
            "text": "The Mills family moved to Bubnell Cliff Farm in the early 1980s and initially ran the holding as a dairy farm. In 2011, the family sold the milk cows and simplified the farm operations to rearing commercial beef cattle.  "
        },
        {
            "text": "Tom Mills took on the farm in 2022, and with his father’s support, re-focussed on establishing a pedigree Longhorn herd which he had been building up for 15 years.  "
        },
        {
            "text": "The farm now prioritises environmental sustainability and a nature friendly approach to managing the land, producing Longhorn beef sold directly to the public. The environment is central to its brand.  "
        },
        {
            "text": "Chatsworth Estate was supportive, sharing Tom’s vision and approving his ideas to establish woodland pasture over one third of the farm’s less productive land, re-establishment of historic field boundaries, and introduction of regenerative grazing. "
        },
        {
            "text": "Over a third of the farm is now managed with nature as the focus – a neat fit with Defra’s ambition for 30% of land to be managed for nature by 2030, and with the Farming in Protected Landscape programme (FiPL)’s ambitions to support nature-friendly sustainable holdings."
        },
        {
            "text": "FiPL funding supported Tom’s ambition and strategy, providing a flexible approach that has proved so useful to this expanding new business.  "
        },
        {
            "heading": 2,
            "text": "Redefining the boundaries  "
        },
        {
            "text": "Tom first used FiPL funding to improve the field boundaries to achieve quick wins for nature while also restoring and maintaining the historic field pattern.  "
        },
        {
            "text": "He planted or restored 565 metres of hedgerow and planted 16 individual trees along historic field boundaries and installed a water supply, enabling Tom to implement rotational grazing – a regenerative agricultural principle that supports healthy soils.  "
        },
        {
            "heading": 2,
            "text": "Change from the core "
        },
        {
            "text": "Next, Tom used FiPL funding to establish herbal leys and legume rich grassland to enhance soil health, reduce the use of artificial fertilisers and deliver benefits for invertebrates and small birds. This option wasn’t available at the time through national schemes. Ongoing support is now provided through a Sustainable Farming Incentive (SFI) agreement.  "
        },
        {
            "text": "Tom also created 45ha of wood-pasture by planting individual and small groups of trees and grazes the land at a very low stocking density to create a tussocky sward benefitting invertebrates, birds and small mammals. The locally uncommon species Adders-tongue fern, Marsh orchid and the rare Greater Tussock-sedge are now thriving in the sward.  "
        },
        {
            "text": "The core funding support for this work comes from a Countryside Stewardship (CS) Higher Tier agreement.  "
        },
        {
            "text": "FiPL has provided complementary support for a baseline and ongoing bird survey carried out by volunteers, a soil survey, and a baseline acoustic survey of mammals and birds. This will help Tom to better understand the benefits of the CS activities for a range of species and the soil condition to help inform decisions in the future. "
        },
        {
            "heading": 2,
            "text": "Covering all bases  "
        },
        {
            "text": "Tom has also used FiPL to develop the infrastructure of the farm, to support his vision.  "
        },
        {
            "text": "FiPL is helping to restore a traditional yard barn whilst converting it to an on-farm butchery and with future FiPL funding Tom aims to develop a website that promotes the beef products and the ethos of the farm business. "
        },
        {
            "text": "This is all critical to the farm’s strategy of selling direct to local customers using its environmental ethics to encourage sales.  "
        },
        {
            "text": "FiPL is supporting small-scale works to a camping barn to allow it to open to visitors for the first time in some 30 years. Tom wants to promote nature friendly agriculture by hosting open farm events and offering on-farm stays, allowing visitors to experience farm life. "
        },
        {
            "text": "He also aims to install information panels in the barn to aid visitors’ understanding of farming and the National Park. "
        },
        {
            "text": " In addition to the barn works, a nineteenth century ash house has been restored on the farm. This rare building type contributes to the unique identity and character of the Peak District. "
        },
        {
            "text": "Historically, the ash house was a small building where fireplace ashes were collected, soaked in water and turned into lye for making soap, candles, and fertiliser. The ash house can now be accessed by the public along a FiPL funded permissive footpath.  "
        },
        {
            "heading": 2,
            "text": "The bigger picture "
        },
        {
            "text": "The FiPL programme has been timely for Bubnell Cliff Farm providing support, advice and funding to transition from their Environmental Stewardship scheme to a comprehensive Countryside Stewardship and Sustainable Farming Incentive (SFI)  agreement. "
        },
        {
            "text": "This transition has relied on FiPL funded projects to support infrastructure improvements, habitat interventions and baseline surveys. It has enabled the farm to deliver Defra and FiPL objectives whilst developing a financially sound and forward-looking business based on a third of the farm focussed on nature objectives and the remainder on regenerative agriculture.  "
        },
        {
            "text": "The success of this FiPL-facilitated farm transition in terms of the outcomes for nature, climate, people and place, depends on the farm’s profitability. Through social media marketing, where Tom tells the story of the farm, he has been able to sell directly to customers willing to pay a premium price for nature-friendly produce.  "
        },
        {
            "text": "FiPL was instrumental in kickstarting change on Bubnell Cliff farm and over the longer term, agri-environment schemes will ensure Tom is rewarded for protecting and improving the land they manage on the farm. "
        },
        {
            "text": "The FiPL projects completed on the farm entwine nature and climate outcomes with people and place benefits. "
        },
        {
            "text": "Tom observed that FiPL is particularly beneficial as it can support diverse projects of all sizes, he said: “FiPL is a great thing for farmers who don’t want to go the whole hog, they can try something smaller without committing to a ten-year national scheme – it’s adaptive and flexible.” "
        },
        {
            "text": "Tom found the ready knowledge and advice available from a Peak District National Park FiPL adviser eased the application process. The FiPL adviser’s local understanding was important to this.  "
        },
        {
            "text": "Tom said: “The direct contact with local FiPL advisers helped me shape my applications. They invested a lot of effort into the application process to help make the projects as good as possible.” "
        },
        {
            "text": "“I found the speed of decision-making to be excellent. From putting in an application to it going to the FiPL Panel and then receiving an answer, was about two weeks. A very quick turnaround! And we were paid within the month.” "
        },
        {
            "text": "Capital works have been completed by a mix of contractors and Tom’s own labour, allowing Tom to make the best use of his own skills and time.  "
        },
        {
            "text": "Habitat improvements made alongside accessibility improvements (both onsite and online) have helped support a rural business which in turn is looking after and improving the special qualities of the National Park.  "
        }
    ]
}