{
    "url": "https://digitalpeople.blog.gov.uk/2024/10/15/introduction-to-product-management-now-available-on-futurelearn/",
    "title": "Introduction to Product Management – now available on FutureLearn!",
    "authors": [
        "Thomas Munley, Senior Leaning Design Manager, CDDO"
    ],
    "categories": [
        "Capabilities",
        "Digital data and technology",
        "Government Digital and Data",
        "People and Skills",
        "Product Management",
        "Training and progression"
    ],
    "pub_date": "2024-10-15T12:30:00+01:00",
    "content": [
        {
            "heading": 3,
            "text": "Have you ever wondered what a product manager does? Do you think a roadmap is just something people used to keep in the car? Here’s your chance to learn more! "
        },
        {
            "text": "Join us as we take you through the basics of product management: learn about key concepts and terminology, how government teams are formed, and the tools and techniques product managers use to lead these teams and build, iterate and maintain vital government products and services. "
        },
        {
            "text": "In 2020, Government Campus UK launched an ‘Introduction to Product Management’ e-learning course as a pilot for 120 civil servants. The team behind that course wrote a blog post about it at the time. "
        },
        {
            "text": "Following the success of Introduction to Content Design on FutureLearn, which has been taken by over 29,000 learners, we decided to update the product management course and share it in FutureLearn’s global classroom. "
        },
        {
            "text": "In collaboration with the Government Digital Service (GDS) and cross-government colleagues from the Department for Education, the Home Office, NHS Digital and the Greater London Authority, we at the Central Digital and Data Office (CDDO) (Government Campus UK on FutureLearn) are pleased to announce that the new course is now available. This is an open course, which means there will be no limit on the number of spaces or on who can join.  "
        },
        {
            "text": "It is structured over 3 weeks with a recommended learning time of 3 hours per week, but it is self-directed and you can learn at your own pace. "
        },
        {
            "text": "The course launched in September and you can register online to join. "
        },
        {
            "heading": 3,
            "text": "Who is the course for?"
        },
        {
            "text": "This is an awareness level course. It is aimed at people who are new to product management or for those who have some knowledge but would like to learn more about product management in government."
        },
        {
            "text": "The topics covered in the course will also be useful for anyone who would like to:"
        },
        {
            "heading": 3,
            "text": "What does it include?"
        },
        {
            "text": "This course uses the UK government product management role profile and GOV.UK product management guidance to introduce product management in government to a wider audience. It was developed in collaboration with product managers in various government departments, providing a broad range of opinions and perspectives."
        },
        {
            "text": "You will learn about a range of topics, including: "
        },
        {
            "text": "You will learn through a mix of reading, completing tasks and watching educational videos produced by product managers working in government. You can keep track of your progress by taking quizzes and end-of-week tests, and by completing the learner tasks throughout the course. "
        },
        {
            "text": "You can take the course for free! However, by paying an optional fee, you will gain permanent access to the course material, get a chance to take the course assessments, and receive a signed certificate of completion at the end of the course as a record of your learning. "
        },
        {
            "heading": 3,
            "text": "Social learning"
        },
        {
            "text": "FutureLearn is a social learning platform and interaction between learners is fundamental to the experience. "
        },
        {
            "text": "On every step of the course, you will have the opportunity to chat to other learners about the subjects and activities covered. You can comment as much or as little as you would like, but we encourage you to join in and learn collaboratively – there are opportunities to give and receive peer review feedback on your learning tasks."
        },
        {
            "text": "Register now on FutureLearn – the course is free to access and available now!"
        }
    ]
}