{
    "url": "https://nationalscreening.blog.gov.uk/2024/10/15/nhs-abdominal-aortic-aneurysm-aaa-screening-annual-standards-report-published/",
    "title": "NHS abdominal aortic aneurysm (AAA) screening annual standards report published",
    "authors": [
        "Sophie Mitra",
        "Lisa Summers"
    ],
    "categories": [
        "NHS Abdominal Aortic Aneurysm Screening Programme"
    ],
    "pub_date": "2024-10-15T13:45:05+01:00",
    "content": [
        {
            "text": "The NHS Abdominal Aortic Aneurysm (AAA) screening programme annual standards report for 2023 to 2024 has been published."
        },
        {
            "text": "An abdominal aortic aneurysm is a bulge (swelling) and weakness of the aorta, the main blood vessel that runs from the heart down through the chest and tummy. The NHS AAA screening programme aims to reduce mortality from ruptured (burst) abdominal aortic aneurysms through early detection, appropriate monitoring, and timely treatment. The NHS AAA screening programme invites men for an ultrasound scan during the screening year (1 April to 31 March) that they turn 65 years old. Men over the age of 65 who have not been screened for an abdominal aortic aneurysm (AAA) can also self-refer for a scan by contacting their local NHS AAA screening service."
        },
        {
            "text": "The national AAA standards give a defined set of measures that providers must meet to make sure services are safe and effective."
        },
        {
            "heading": 2,
            "text": "Headline numbers"
        },
        {
            "text": "There were over 331,000 men eligible in the screening year 2023 to 2024 and over 271,000 men had their screening test. There were 2,004 aneurysms (aorta measured 3.0cm or greater) detected through an initial scan and 810 men with large aneurysms (aorta of 5.5cm or greater), or with aneurysms of 4.0cm or greater that grew 1cm or more in a year, were referred for potential intervention with a vascular specialist."
        },
        {
            "text": "Men who are found to have an AAA between 3.0cm and 5.4cm are put onto surveillance. Men with a small aneurysm (3.0cm to 4.4cm) are offered an ultrasound every year and men with a medium aneurysm (4.5cm to 5.4cm) are offered an ultrasound every quarter (3 months). There were about 15,300 men on surveillance at the end of the screening year 2023 to 2024."
        },
        {
            "heading": 2,
            "text": "Coverage is back to pre-pandemic levels"
        },
        {
            "text": "Understanding how many people are eligible for screening and how many have the test is very important. This is known as coverage. For the NHS AAA screening programme, coverage is defined as the proportion of eligible cohort men (those who turn 65 in the screening year) who are tested within the screening year plus an additional 2 months (so that anyone invited at the end of the screening year can attend their screening appointment)."
        },
        {
            "text": "The coverage rate for initial screens in screening year 2023 to 2024 was 81.9%. This is now above the 2018 to 2019 level (81.3%) which was the last full year not impacted by the pandemic. This is above the acceptable threshold of 75.0%."
        },
        {
            "text": "Coverage for the quarterly surveillance scan was 92.8% which meets the acceptable threshold of 90.0%. When an aneurysm is found that is slightly swollen then men are called back for more frequent (surveillance) scans. Coverage for the annual surveillance scan was 91.6% which meets the acceptable threshold of 85.0%. Both coverage rates of surveillance scans are back to pre-pandemic levels."
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK National Screening Committee. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, email uknsc@dhsc.gov.uk."
        }
    ]
}