{
    "url": "https://mhclgmedia.blog.gov.uk/2024/10/15/thousands-of-new-homes-to-be-built-as-government-unlocks-brownfield-sites/",
    "title": "Thousands of new homes to be built as government unlocks brownfield sites",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Housing"
    ],
    "pub_date": "2024-10-15T17:23:48+01:00",
    "content": [
        {
            "text": "Today we announced thousands of new homes are to be built on brownfield across the country through £68 million of government funding."
        },
        {
            "text": "Delivered through the Brownfield Land Release Fund, funding will go to 54 councils to cover the cost of decontamination, clearing disused buildings or improving infrastructure such as internet, water and power."
        },
        {
            "text": "There has been positive coverage of the announcement across national media including Sky News and the Financial Times who report this is part of the government’s plans to get building again and deliver 1.5 million homes over the next five years. The Guardian meanwhile reports how Bellway Homes has “hailed” the plans to increase the country’s housing stock, as a way to “generate long-term growth” for their company."
        },
        {
            "text": "Local Government Chronicle, Inside Housing, Local Government Chronicle and Housing Today also report how the announcement supports the government’s “brownfield-first approach” to accelerate housebuilding."
        },
        {
            "text": "Regionally, there has been coverage with the Yorkshire Post, London Evening Standard, City AM, Place North West, Bromsgrove Advertiser and Yorkshire Times all focusing on the funding being awarded to their respective local councils."
        },
        {
            "text": "Housing and Planning Minister Matthew Pennycook said:  "
        },
        {
            "text": "“The government is committed to a brownfield-first approach to housebuilding, and we have already taken steps to prioritise and fast-track building on previously used urban land through our proposals for a ‘brownfield passport’."
        },
        {
            "text": "“The funding announced today will support the delivery of thousands of new homes and boost economic growth by unlocking development on scores of abandoned, disused and neglected urban sites across the country”."
        }
    ]
}