{
    "url": "https://environmentagency.blog.gov.uk/2024/10/15/working-in-partnership-to-manage-surface-water-flooding/",
    "title": "Working in partnership to manage surface water flooding",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Climate change",
        "Flood",
        "Flood Planning",
        "telemetry",
        "Uncategorized"
    ],
    "pub_date": "2024-10-15T12:57:29+00:00",
    "content": [
        {
            "text": "Surface water flooding is localised and complex. There are currently 3.2 million properties in areas at risk in England. As the September floods have shown, it is a real and growing threat to life, property, infrastructure, and to the economy. It requires a partnership approach to manage it better."
        },
        {
            "text": "During Flood Action Week 2024 14– 20 October, Jonathan Hunter from the Environment Agency and Anna Hastings from East Sussex County Council came together to share some of the ways they are working in partnership to manage surface water flooding and help communities become more resilient."
        },
        {
            "text": "Our roles in managing the challenge of surface water flooding"
        },
        {
            "text": "Lead local flood authorities (LLFAs), which are unitary or county councils, have the lead role for managing the risk of flooding from surface water in their area. This includes understanding the risk and planning to manage it."
        },
        {
            "text": "The Environment Agency has a strategic overview role for all sources of flooding, which includes surface water. Through this role, it shows strategic leadership by enabling and supporting local authorities and other partners."
        },
        {
            "text": "Working in partnership, innovation and local action"
        },
        {
            "text": "Jonathan Hunter from the Environment Agency discusses some of the ways it is proactively providing more support to local authorities and partners:\"We are providing new national data so decisions on the location of new homes or the need for emergency flood plans are based on the best surface water risk information.  We have also been making it easier for local authorities to deliver small projects such as property flood resilience and sustainable drainage for communities."
        },
        {
            "text": "\"We recognise the value of local volunteers and community groups before, during and after a flood, with their knowledge and resources in supporting their local communities. By working with them alongside organisations such as Red Cross and National Flood Forum, we ensure we work well together to support and improve community flood resilience."
        },
        {
            "text": "\"We are also encouraging greater collaboration and learning by sharing best practice and promoting innovation, such as through the 25 local projects in our Flood and Coastal Resilience Innovation Programme.\""
        },
        {
            "text": "Anna Hastings from East Sussex County Council describes one of these projects, Blue Heart, and how this collaborative approach can benefit communities:"
        },
        {
            "text": "\"With climate change, we need to start thinking and doing things differently. Blue Heart is a multi-partner initiative designed to better predict and mitigate surface water flooding in Eastbourne and Southern Wealden. "
        },
        {
            "text": "\"The Environment Agency provides a flood warning service for river and coastal flooding. At Blue Heart we’re looking to provide a local surface water flood warning service for the 4,400 properties at risk from surface water flooding in Eastbourne. We are doing this through the deployment of over 100 new sensors in watercourses, drainage systems, below the ground and providing new rain gauges."
        },
        {
            "text": "\"These devices will then be used to develop and trial a new flood warning service to make communities better prepared and more resilient to surface water risk by 2027. It is a new and challenging approach, but the trial will provide valuable learning to hopefully allow other local authorities to roll out their own local surface water flood warning service."
        },
        {
            "text": "\"The data from the sensors has helped identify locations for action and test them, like our sustainable drainage systems (SuDS) in schools programme. Schools are great locations for SuDS, where playing fields, playgrounds and roofs can be used to capture rainwater and reduce local surface water flood risk. Supported by the Department for Education’s SuDS4Schools programme, we will be installing these in nine schools in East Sussex. They will capture rainwater that mimic natural processes by treating, storing, and reusing water in a better way. "
        },
        {
            "text": "\"Blue Heart’s project team is engaging with students about local flood risk and inspiring the next generation of climate champions and engineers."
        },
        {
            "text": "\"The students participate in outdoor workshops, led by the engineers, learning about what causes flooding and how to prevent it. Using their new knowledge, together the children and engineers design new SuDS features which are later made a reality in their school.\"Looking to the future"
        },
        {
            "text": "Our changing climate will bring more intense rainfall which makes it essential to increase community resilience to surface water flooding. It is also vitally important that we continue to work together to make this happen.  "
        },
        {
            "text": "It is easy to find out if where you live or work could flood from surface water by checking your risk online at gov.uk/check-long-term-flood-risk. There is also a simple practice list of actions you can take to be prepared at Personal flood plan - GOV.UK (www.gov.uk)."
        }
    ]
}