{
    "url": "https://civilservice.blog.gov.uk/2022/08/24/celebrating-shravan/",
    "title": "Celebrating Shravan",
    "authors": [
        "Rakesh Joshi"
    ],
    "categories": [
        "A great place to work",
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Ambitious Civil Service",
        "An Innovative Civil Service"
    ],
    "pub_date": "2022-08-24T09:24:26+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Department for Education civil servant Rakesh Joshi shares his traditions and celebrations during the Hindu religious month of Shravan, and what it means to him. "
        },
        {
            "text": "With August fast drawing to a close, Hindus have been marking the month of Shravan which, according to the Lunar calendar, falls this year between 29 July and 28 August.​​​​​​​"
        },
        {
            "text": "During this month, many Hindu colleagues across the Civil Service and around the world are celebrating Shravan. This month is dedicated to the worship of Lord Shiva."
        },
        {
            "heading": 4,
            "text": "History of Shravan"
        },
        {
            "text": "​​​​​​​Many Hindus believe that during the course of the month, the star ‘Shravan’ rules the sky. The month is celebrated with religious festivals and ceremonies and almost all the days of this month are considered to be favourable. Hindus pray to Lord (Bhagwan) Shiva in the form of Shiva Lingam (an idol that represents Lord Shiva), as shown in the image."
        },
        {
            "heading": 4,
            "text": "Shiva Lingam"
        },
        {
            "text": "Shiva Lingam is the idol representing Lord Shiva. Many thousand years before, during ‘Samudra Manthan’ (the Churning of Oceans), the battle between Dev (demi-Gods) and Danav (demons), took place in the month of Shravan - resulting in 14 different types of rubies being released from the ocean. Of these, 13 were distributed amongst the Devs and Danavs, except Halahal (poison). Lord Shiva drank the poison and stored it in his throat. Hence, the name Neelkantha (‘blue throat’) is attributed to Shiva. To reduce the strong effect of poison, Hindus believe that Lord Shiva wore the crescent moon."
        },
        {
            "text": "‘Aum’ is the centre of all meditations and believed to be manifested from Lord Shiva. Devotees can receive his blessings and feel his presence by pure meditation and chanting of ‘Aum Namah Shivay’ with devotion and purity."
        },
        {
            "text": "Each Monday of this month is a special day in the temples, where the Shiva Lingam is bathed with holy water from the river Ganges. Devotees pile the Shiva Lingam high with bilva leaves and flowers and fast until sunset. The Nandadeep (24-hour lamp) burns steadily in the temples. "
        },
        {
            "heading": 4,
            "text": "Digital fasting "
        },
        {
            "text": "Shravan is close to my heart, because during this month, I worship Lord Shiva, meditate by chanting Aum, and fast for the spiritual connection with the divine. I take one vegetarian meal a day, at one sitting. I enjoy the month's festivities, such as Rakshabandhan (celebrating the bond between brother and sister) and Janmashtami (God Shrikrishna’s birthday) to name a few. "
        },
        {
            "heading": 4,
            "text": "Fasting"
        },
        {
            "text": "I choose to fast for many reasons; for the body’s purification, to connect with the divine consciousness, practise self-control over mind-senses and realise the true way of the art of living. This year, I am fasting for the whole month but like to do something a little different, such as digital fasting, by refraining from using my phone or laptop for five hours during the daytime at the weekends."
        },
        {
            "heading": 4,
            "text": "Donate to charity"
        },
        {
            "text": "Every day I pray, meditate and sing devotional songs at home, visit the Hindu temples in Manchester and meet with close family members and community groups. We make delicious vegan-vegetarian food, sing devotional songs and attend Katha (religious talks by scholars). I donate to charities and share my knowledge with colleagues and friends. It’s a wonderful time to connect with the community, to converse, to learn from each other and to take time to appreciate our good fortune."
        },
        {
            "heading": 4,
            "text": "Civil Service faith and belief toolkit"
        },
        {
            "text": "More information for colleagues can be found in the Civil Service faith and belief toolkit."
        },
        {
            "text": "If you’d like to receive more information about the Department for Education’s Hindu Network, please contact: HINDUNETWORKDfE@education.gov.uk."
        }
    ]
}