{
    "url": "https://forestrycommission.blog.gov.uk/2022/08/24/defras-trees-and-forestry-team-taking-stock-at-the-half-way-point-of-the-year/",
    "title": "Defra’s Trees and Forestry team - taking stock at the half way point of the year",
    "authors": [
        "Bella Murfin and Naomi Matthiessen"
    ],
    "categories": [
        "Tree health",
        "Tree Planting",
        "Urban trees",
        "Woodland creation"
    ],
    "pub_date": "2022-08-24T08:00:36+01:00",
    "content": [
        {
            "text": "Our first blog, Might oaks from little acorns grow?, covered our first year with Defra’s Team Trees, setting up the Tree Programme and publishing the England Trees Action Plan (ETAP). We moved into ‘delivery mode’ last year, covered in our last blog. Now we’re looking at what happened through the last planting season, and our preparations for the next."
        },
        {
            "text": "Last winter saw some of the worst storms in recent times damage the England treescape. We worked closely with our Scottish counter parts to lead a joint response in the North of England and that recovery work is ongoing. It was a reminder of how important it is to plant the right trees, in the right places, with good woodland design and management helping them to be resilient to different threats. It also brings home the scale of the challenge we have, as the proposed net Tree Cover Target means we must make sure we’re protecting our existing trees alongside planting new ones."
        },
        {
            "text": "The impacts of the winter storms placed pressure on the skilled foresters and contractors who deal with fallen trees as well as planting new ones. The Tree Programme Sector Capacity and Skills project aims to grow the number of people with these skills, as well as the trees they will plant and manage, and has been a big focus over the last few months."
        },
        {
            "text": "We launched the new Development Woodland Officer apprenticeship in April, providing an exciting career pathway into the forestry sector for people from all backgrounds and abilities. And more recently, the £8 million Woodland Creation Accelerator Fund invited Local Authorities across England to bid for investment in new tree specialists to help enable them to fulfil widespread commitments to tree planting up and down the country."
        },
        {
            "text": "We reopened four of our funds, including the Local Authority Treescapes Fund and the Urban Tree Challenge Fund which aim to plant over half a million trees. The Woods into Management Forestry Innovation Funds and the Tree Production Innovation Fund will award up to £4.5 million to help futureproof trees and forests against impacts of pests, disease and climate change."
        },
        {
            "text": "April saw the fifth auction of the Woodland Carbon Guarantee, quickly followed with £10 million being made available for farmers and land managers to create new woodland to help tackle the effects of climate change. This is a key part of woodland creation, giving landowners creating woodlands agreements that government will buy carbon units if the market does not offer a higher price."
        },
        {
            "text": "The quarter culminated with Government pledging new long-term environmental targets, as mentioned above. A cornerstone of the Environment Act, more than a million acres of trees will be planted in England by 2050 under the proposed legally binding tree targets. This will cement the long-term commitment to tree planting and establishment."
        },
        {
            "text": "April’s Biosecure Procurement Pilot launch was a step forwards in ensuring that plant health management standards are in place for nurseries supplying trees for the England Woodland Creation Offer and Tree Health Pilot restocking grants. When you know that ash dieback will kill up to 100 million trees, costing the economy up to £15bn over the coming decades, it’s a stark reminder of how important these efforts are. It also highlights how central tree supply is to fulfilling tree planting ambitions."
        },
        {
            "text": "We launched the Tree Production Capital Grant in May, designed to help seed and sapling suppliers of all sizes looking to diversify. The grant will enable suppliers to bolster production at pace and has been designed to complement the innovation outputs of the Tree Production Innovation Fund (reopened in March), which provides support for research and development projects that will enhance UK tree production methods and has funded 16 projects to date."
        },
        {
            "text": "Moving through May we saw a team effort alongside Natural England and the Woodland Trust to update the Keepers of Time policy document, which covers ancient and native woodland and ancient and veteran trees. It states Government’s commitment to evaluate the threats facing these habitats and sets out England’s updated principles and objectives to protect and improve these precious habitats for future generations."
        },
        {
            "text": "We also published information about the Trees Call to Action Fund grant recipients. Opened in November 2021, it’s seen 12 projects receive grants of £250,000 to £500,000 to enable large scale woodland creation across both rural and urban areas."
        },
        {
            "text": "The latest refresh of the England Woodland Creation Offer incorporates the Biosecure Procurement Requirement Pilot, adjustments to deliver even more biodiversity benefits, and clarifies rules on the compatibility of Offer payments with other payments for ecosystem services. We recently announced that The England Woodland Creation Offer will become part of the Local Nature Recovery scheme – one of the new environmental land management (ELM) schemes – from 2025. We urge landowners and land managers to apply for a share of £25 million in funding to support woodland creation and tree planting."
        },
        {
            "text": "It’s been another packed few months, and it’s hard to believe how much has happened. We’re starting to see the results, with June’s official planting statistics showing an uplift in planting in 2021/22. There’s a long way to go, and we’re learning and improving all the time. As we head towards the next planting season, we’re more focused than ever in getting trees in the ground and making a real difference in bringing tree planting and woodland cover in England up to our targets."
        },
        {
            "text": "If you’re a landowner, forester, or farmer we urge you to look at what’s on offer and find out if you’re eligible to apply!"
        }
    ]
}