{
    "url": "https://educationhub.blog.gov.uk/2022/08/24/how-were-supporting-gcse-pupils-who-have-been-affected-by-the-pandemic/",
    "title": "How we're supporting GCSE pupils who have been affected by the pandemic",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "catch up",
        "Covid-19",
        "GCSE",
        "GCSE results",
        "tutoring"
    ],
    "pub_date": "2022-08-24T17:09:21+01:00",
    "content": [
        {
            "text": "During the pandemic pupils were affected in different ways. They missed varying amounts of school and the extent to which they were able to learn while at home also varied. That’s why, throughout the pandemic, we prioritised keeping children in school as much as possible."
        },
        {
            "text": "But we recognise that pupils still need help catching up and that different pupils in different areas need different levels of support. That’s why we’re continuing to invest in catch up programmes that support young people to meet their potential regardless of how the pandemic affected them."
        },
        {
            "text": "This is particularly relevant when it comes to pupils in exam years like this year’s GCSE cohort. Here we explain how we’re supporting pupils to catch up."
        },
        {
            "heading": 3,
            "text": "How have you supported this year’s GCSE students to make sure they aren’t disadvantaged? "
        },
        {
            "text": "We recognise that all pupils taking GCSEs this year faced some level of disruption over the last two years and that’s why, together with the exams regulator Ofqual, we made some important changes this year."
        },
        {
            "text": "Firstly, for the majority of GCSE subjects, students were able to view advance information published by exam boards on the focus of exams.  There was less content or fewer topics for pupils to learn in GCSE English literature, history, ancient history and geography, and a formulae or expanded equations sheet was provided in exams for GCSE maths, physics and combined science."
        },
        {
            "text": "There were also changes to the requirements for practical assessments in sciences and art and design, recognising how the pandemic will have affected students’ opportunities in these subjects."
        },
        {
            "text": "Furthermore Ofqual’s plans for grading this summer means that results will be higher than when summer exams were last sat in 2019, recognising the challenges students this year have faced. However results will be lower than in 2021, when grades were awarded by teacher assessment. You can read more about Ofqual’s approach to assessment here."
        },
        {
            "heading": 3,
            "text": "What practical support have you given pupils to help them recover learning they missed?"
        },
        {
            "text": "There is extensive evidence that tutoring is one of the most effective ways to accelerate academic progress. That is why we have invested £1.5 billion in a tutoring revolution so every child and young person who needs help catching up can access high-quality tutoring through the National Tutoring Programme, which supports schools by providing access to high-quality tutoring to help pupils whose education has been affected by the Covid-19 pandemic. We’ve seen more than 2million course starts through the National Tutoring Programme since 2020, with over 1.7m starts this academic year in around 80% of schools."
        },
        {
            "text": "Over the next two years we will ensure that students continue to have access to high-quality tutoring, through the National Tutoring Programme and 16-19 Tuition Fund, which is additional funding for the academic years 2020 to 2021 and 2021 to 2022 for schools, colleges and other 16 to 19 institutions to mitigate the disruption to learning arising from coronavirus. These initiatives sit alongside alongside other evidence-based approaches and activities funded by sustained recovery premium funding, which is set to nearly double in secondary schools from September 2022 from £145 to £276 per eligible pupil. In addition, from September 2022, every student in 16-19 provision will benefit from around 40 extra hours per year of teaching and learning."
        },
        {
            "heading": 3,
            "text": "Is this approach working?"
        },
        {
            "text": "Year 11 pupils have been supported by high-quality tuition from the National Tutoring Programme , with more than 2m tuition courses started by students across all year groups this academic year and last."
        },
        {
            "text": "In the 2020/21 academic year, year 10 pupils (now year 11s and the current GCSE exam cohort) were the most likely to receive academic mentoring out of all secondary year groups."
        },
        {
            "text": "For academic year 2022/23 all tutoring funding for the National Tutoring Programme will be provided direct to schools. This new approach gives schools the flexibility to design a tutoring offer that works best for their pupils, which can still involve tutoring delivered by their own staff, by Academic Mentors or by working with a Tuition Partner."
        },
        {
            "heading": 3,
            "text": "Some areas of the country are worse affected than others – how are you helping those areas catch up?"
        },
        {
            "text": "Our multi-year, multi-phase recovery programme, including the Recovery Premium, National Tutoring Programme and the 16-19 Tuition Fund enables targeted interventions to flow to pupils and places disproportionately impacted by lost learning, ensuring support goes to those that need it most."
        },
        {
            "text": "Data shows that take up is broadly consistent across all regions at around 80% of schools having used at least one element of the National Tutoring Programme during the academic year 2021/22. Overall, take-up in the North is generally higher than the South demonstrating that take-up of tuition support is greater in some areas worst hit by the pandemic."
        },
        {
            "text": "We’ve also identified 55 areas to be targeted for additional support known as Education Investment Areas. In these places we’ll provide extra support focused on specific issues like entrenched underperformance and high absence rates."
        },
        {
            "heading": 3,
            "text": "How are you supporting pupils who don’t get good maths and English GCSEs? "
        },
        {
            "text": "Having a good level of English and maths is really important for young people regardless of their next steps. That’s why everyone over 16 without a grade 4 or above in English or maths GCSE  is supported to continue studying these crucial subjects."
        },
        {
            "text": "The recently published Schools White Paper sets out significant support and plans for all schools across England, including our pledge that if any pupil falls behind in English or maths, they will receive timely and evidence-based support to help them to reach their potential."
        },
        {
            "text": "We recognise the challenges that some pupils experience in achieving an English or maths GCSE grade 4. To help schools and colleges support more pupils to achieve a GCSE grade 4 or above in these subjects we have invested in the Centre for Excellence in Maths programme. There are 21 centres across the country – with at least one in every region of England – which are designing new and improved teaching resources, building teachers’ skills and spreading best practice across the country through their wider networks."
        },
        {
            "text": "The 16-19 Tuition Fund has made available £400m over four years (2020/21 academic year until the end of the 2023/24 academic year) to 16 to 19 institutions. This funding enables small group tutoring activity for eligible 16-19 students. Any student that fails to achieve at least a grade 6 in English and/or Maths in their GSCEs in 2021/22 will be eligible for tuition from September, as well as disadvantaged students regardless of their grade."
        },
        {
            "heading": 3,
            "text": "Are you doing anything else to help post-16 providers support young people to improve their maths and English skills if they haven’t got a grade 4 or above?"
        },
        {
            "text": "We are, across the next three years, investing around £15m in professional development programmes, research, and resources, all specifically focussed on supporting teachers of 16 to 19 English and maths up to Level 2."
        },
        {
            "text": "In addition, from next academic year (2022/23) onwards we are funding 40  additional hours of teaching and learning each year for every student (equivalent to 1 hour per week) on a 16 to 19 study programme or T Levels."
        }
    ]
}