{
    "url": "https://disabilityunit.blog.gov.uk/2022/08/24/supporting-disability-employment-at-home-and-beyond/",
    "title": "Supporting disability employment at home and beyond",
    "authors": [
        "Chloe Smith MP"
    ],
    "categories": [
        "Event",
        "Policy"
    ],
    "pub_date": "2022-08-24T16:30:39+01:00",
    "content": [
        {
            "heading": 3,
            "text": "In June of this year, I had the privilege of attending the 15th annual UN Conference of State Parties on the Rights of Persons with Disabilities (COSP15) in New York, as the Head of the UK delegation."
        },
        {
            "text": "As Minister for Disability, Health and Work, I have a particular interest in the economic empowerment and entrepreneurship sub-theme of the event. Having recently received the Office for National Statistics (ONS) figures that the UK had met its target of 1 million more disabled people in work, I was excited to showcase the great work sitting behind these statistics."
        },
        {
            "heading": 2,
            "text": "Disability employment"
        },
        {
            "text": "In both the General Debate and Roundtable statements, I focused on disability employment - highlighting the need for wider societal change, coordinated cross-government action and continued engagement with disabled people - to meet our ambitious targets for disabled people to start, stay and succeed in work. The UK Government also hosted a side event on increasing disability employment. Alongside myself on the panel was Mike Adams, CEO of Purple, and Jennifer Heigham from the Joint Health and Work Unit. Mike provided a compelling way of thinking about disability employment, centred on making the business case for employers to take on disabled staff, to reflect disabled people in the consumer base. Mike also shared his ambitions of taking his Purple Pound campaign international, launching an American branch later this year."
        },
        {
            "text": "Jennifer and I outlined a number of UK Government initiatives, aware that these would be quite innovative for some members of the global audience. Indeed, we were really pleased to answer questions demonstrating just this, providing more detail to support other delegates’ work in this space. Questions ranged from asking about how the UK is upskilling disabled people, to issues around people’s confidence in disclosing disability in the workplace."
        },
        {
            "heading": 3,
            "text": "The breadth of questions showed how the UK is taking an inclusive and holistic approach to increasing disability employment. I was also particularly touched to see Ukrainian delegates present at the side event, with a clear interest in this topic."
        },
        {
            "heading": 2,
            "text": "Learning and sharing best practice"
        },
        {
            "text": "COSP15 served as an opportunity for learning and sharing best practice. I attended a number of bilateral meetings with other delegations. Disability employment remained a strong theme throughout these conversations, and it was both inspiring and affirming to see that other countries are eager to learn from the UK. I also met with Rosemary Kayess, Chair of UN Committee on the Rights of Persons with Disabilities, who noted the added value the UK could bring to the Committee’s Working Group on employment. Through this and other actions we will continue our commitment to improve employment prospects for disabled people."
        },
        {
            "text": "I, and my counterparts across government, strongly believe that reliable paid work is one of the best routes out of poverty. This belief is reflected domestically and internationally. That is why the Foreign, Commonwealth and Development Office’s (FCDO) ‘Disability Inclusion and Rights Strategy’ - published earlier this year and launched at the Global Disability Summit 2022 - includes an explicit commitment to continuing to develop our work on inclusive employment."
        },
        {
            "text": "FCDO’s Innovation to Inclusion, Inclusion Works, and Disability Inclusive Development programmes have all sought ways to make it easier for disabled people to get paid jobs in developing countries. A UK delegate representative from the FCDO joined non-governmental organisations and disability movement partners in speaking at a COSP15 side event on this topic. He reflected on the fact that article 27 of the CRPD is clear - disabled people have a right not only to work, but to be able to access the job market on an equal basis with others."
        },
        {
            "heading": 2,
            "text": "My reflections"
        },
        {
            "text": "COSP15 provided me with a real opportunity to reflect on how we are continually working to improve employment outcomes for disabled people at home and overseas."
        },
        {
            "text": "I mentioned at the start of this blog that one million more people in the UK are in employment compared to five years ago, far exceeding our goal to meet this milestone by 2027. This was our manifesto commitment originally set in 2017 to break down barriers for disabled people and those with health conditions and to build more diverse and inclusive workforces."
        },
        {
            "text": "Delighted with this statistic, I also know that we can’t stop there. Our goal to continue reducing the disability employment gap remains. We will now be considering what a new ambition should be, to continue to galvanise action across and outside of Government and build on existing initiatives."
        },
        {
            "text": "Initiatives like the Disability Confident Scheme, which works with employers to create more accessible and diverse workforces by championing inclusive recruitment practices. Thousands of organisations across the UK - including Sainsbury’s, Hilton and Ford - are signed up to the scheme aimed at boosting the number of disabled people in work, reaching 11 million paid workers."
        },
        {
            "text": "Over the next three years, the government will invest £1.3 billion in employment support for disabled people and people with health conditions. Our Health and Disability White Paper will help disabled people to live more independently, including with more help to move into work, where work is right for the individual. It will set out our plans to ensure the benefits system better meets the needs of disabled people now and in the future, informed by the huge amounts of feedback we received on the Green Paper. It will also detail plans of where this investment will be spent."
        },
        {
            "text": "So, this is my ask from COSP15, to my officials and businesses across the UK alike:  we can work together to ensure that disabled people in the UK are empowered through employment and entrepreneurship. I am excited at the wealth of opportunity we have to continue to help people into work, change lives, and build a society that benefits all."
        }
    ]
}