{
    "url": "https://defradigital.blog.gov.uk/2022/08/24/working-well-with-subject-matter-experts-tips-for-content-designers/",
    "title": "Working well with subject matter experts: 6 tips for content designers",
    "authors": [
        "Anna Scott"
    ],
    "categories": [
        "Defra content design",
        "Defra digital",
        "Open data",
        "User centred design"
    ],
    "pub_date": "2022-08-24T14:24:10+01:00",
    "content": [
        {
            "text": "From explaining your role to working out their pain points, Content Designer Anna Scott shares tips for creating great relationships and working well with subject matter experts "
        },
        {
            "text": "Hi, I’m Anna. I joined Defra as a content designer just over a year ago. I’ve worked for lots of organisations in lots of different roles, but good content has always been at their core. In all my roles, I’ve had the privilege of helping brilliant people to get their ideas onto paper (well, mainly onto websites). Most recently, I’ve been commissioning and editing posts from my fellow User Centred Design colleagues here at Defra to share how we work."
        },
        {
            "text": "I started my career at an international non-government organisation, interviewing development economists for podcasts, blogposts and newsletters. I then moved to the Guardian, where my job was to commission and edit articles from experts in global development and human rights. I had a Masters in Human Rights, so some of it was familiar, but a lot of it was really new to me."
        },
        {
            "text": "I think that made me a better editor, because I had to ask the same questions that a lot of readers might need to ask. I also had to edit the content so that non-experts could understand it."
        },
        {
            "text": "In that sense, this was my first ‘user focused’ job, though I didn’t know it then."
        },
        {
            "heading": 2,
            "text": "Balancing accuracy with clarity"
        },
        {
            "text": "I’ve since worked for businesses, charities and non-profits, often presenting academic or ‘techy’ subject matter to non-expert audiences. As Head of Content at the Open Data Institute, I had a lot of fun leading a team to produce creative content - from strategy documents to animations, poems to taxidermy cats - broadly about how data can be stewarded fairly to benefit citizens and society. I've also had the privilege of interviewing a lot of experts for panel discussions."
        },
        {
            "text": "\nCredit: The Open Data Institute. CC BY-SA 2.0."
        },
        {
            "text": "Ever since then, I’ve been honing the editorial skill of accurately representing an expert author’s knowledge or ideas, while ensuring the content is accessible and engaging enough for lay readers."
        },
        {
            "text": "This is a really fine balance to strike. But it’s crucial to good editing, and also to good content design."
        },
        {
            "text": "As content designers in government, our job is to design content that meets the needs of our users. We need to work with subject matter experts (SMEs) in policy to do this. They bring the policy knowledge, we bring the user perspective and content skills."
        },
        {
            "text": "In this post, I share what I think are the crucial components of working well together, and balancing accuracy with clarity as a content designer."
        },
        {
            "heading": 2,
            "text": "1. Set up one-to-one meetings"
        },
        {
            "text": "Whether you’re joining a new service team or working with a new SME for a smaller content project, it’s always worth setting up one-to-one calls or meetings. It’s likely you’ll have already met them with others, but making time for a direct conversation lets you properly get to know each other."
        },
        {
            "text": "Be curious about them, find out about each other’s backgrounds or interests, and find things to bond over. It could just be for 10 minutes. Building this foundation can be really important for collaborative working later on."
        },
        {
            "heading": 2,
            "text": "2. Explain your role"
        },
        {
            "text": "Another benefit of these initial one-to-ones is that they allow you to explain what a content designer does. This may seem obvious. But I’ve never met an SME who hasn’t answered my invitation to give a quick overview of my role with something like, “Oooh yeah actually that would be helpful.”"
        },
        {
            "text": "With this, not only can you ensure they know what content design is and what user needs are (which they might not), you can also tell them what you specifically can do for them and the project. Include your process and likely timeframes. It's also a good opportunity to ask any questions you have about their role, as you might learn something you didn't know before."
        },
        {
            "text": "This lets you identify and clear up any misconceptions from the very start. It prevents assumed knowledge from masking big gaps in understanding, which could lead to issues later on."
        },
        {
            "heading": 2,
            "text": "3. Work out their pain points"
        },
        {
            "text": "Ask your colleague what their concerns are, or what makes their job difficult. This takes trust, but hopefully you’ll have started to build that up by now. Make it clear that you’re asking so you know how to help best, and that you’re not going to share it further."
        },
        {
            "text": "When I’ve asked this question, I’ve found out things that have really helped me to plan my work. For example, one person told me that there might be a tricky stakeholder who throws a spanner in the works later down the line. This was great to know about early on, so I could allow for delay in my review timings. It also helped me to have realistic expectations of what my direct SME colleague did and didn’t have in their control."
        },
        {
            "text": "\nCredit: The Open Data Institute. CC BY-SA 2.0."
        },
        {
            "heading": 2,
            "text": "4. Be clear about process (while giving some assurances)"
        },
        {
            "text": "As content designers, we need commitment from our SMEs to engage with our processes. We need to establish user needs, and create content that meets them in the best way possible for our users. This can sometimes take a bit of time, and we do our best to avoid last minute changes after research, design and review has been completed."
        },
        {
            "text": "That said, sometimes these things happen. If an unexpected change is requested from someone much more senior, the likelihood is that your SME colleague is also a bit thrown off by this."
        },
        {
            "text": "Ask them to be clear with their stakeholders about the content creation process and timeframes, but reassure them that you can usually find a solution together. I’ve found that showing willingness like this builds an allyship between the two of you, and makes it much more likely your colleague will give you a ‘heads up’ before a big change request happens later on."
        },
        {
            "heading": 2,
            "text": "5. Agree ways of working"
        },
        {
            "text": "We all have our preferred ways of working. That’s why more and more teams are introducing ‘manuals of me’ so team members can share how they work best with each other."
        },
        {
            "text": "I’ve found it’s great to ask SMEs how they best like to work early on. They might prefer to review things on their own, or they might like to work things out on calls or in person."
        },
        {
            "text": "One SME I’ve worked with shared that he was time poor and found it hard to get around to drafting or reviewing things outside meetings. So we found a system where we had regular, short calls to pair write together in a collaborative document such as Google Docs."
        },
        {
            "text": "This worked brilliantly because we could both bring our knowledge and apply it together in real time. We could also ask questions and explain our thinking as we worked."
        },
        {
            "heading": 2,
            "text": "6. Work in the open"
        },
        {
            "text": "Finally, I’ve found that showing your working as a content designer can really help to build trust, especially when you’re new to a team. An SME might not know exactly what kind of changes you’re going to make to their draft, and might even feel a bit uneasy about it."
        },
        {
            "text": "Doing it openly - in a collaborative document with tracked changes, for example - will reassure them. It’s unlikely you’ll need to keep this up, as hopefully they will soon feel comfortable enough not to need to see every change you make."
        },
        {
            "heading": 2,
            "text": "Great relationships will mean better outcomes for users"
        },
        {
            "text": "It’s normal to have a big bond with colleagues in your field, and actually something great about user centred design is the solidarity and mutual understandings we have between us. But the more we all find ways to bond and connect with each other across specialisms, the better our work will be and the better the outcomes for our users."
        }
    ]
}