{
    "url": "https://defraenvironment.blog.gov.uk/2024/09/12/a-call-for-plant-health-experts-to-support-defras-research/",
    "title": "A call for plant health experts to support Defra’s research",
    "authors": [
        "Alex Gidley"
    ],
    "categories": [
        "Biosecurity",
        "Forestry",
        "Plants",
        "Research and data analysis"
    ],
    "pub_date": "2024-09-12T11:16:50+01:00",
    "content": [
        {
            "text": "My name’s Alex and I am a scientist in the Plant Health Evidence and Analysis team. We use plant health research to fill any gaps in evidence and to inform Defra’s policies. "
        },
        {
            "text": "This month, the Defra Plant Health team launched a new ‘Register of Reviewers’. This will provide the team with a list of external plant health experts, whom the team can approach when they need people with specific knowledge to review new research.  "
        },
        {
            "text": "Independent reviews lead to better research – and ultimately better policy "
        },
        {
            "text": "An independent review by a relevant expert, also known as ‘peer review’, is an important part of research and evidence gathering. "
        },
        {
            "text": "Peer review is used to assess and assure the quality of research, whether it is value for money, and its reliability. To do this, they will carefully check that the project methods, results and outputs are scientifically sound and reliable. "
        },
        {
            "text": "This process holds researchers accountable for producing credible work and promotes research integrity. It ensures that research uses appropriate methodology, and that high-quality research is published. "
        },
        {
            "text": "At Defra, independent reviews help us to ensure that our research proposals are appropriately designed, and that our projects are good value for money. "
        },
        {
            "text": "And, ultimately, peer reviews mean that we can be confident that we’re using robust and reliable evidence to inform our decision-making and policies.  "
        },
        {
            "text": "There are several opportunities for plant health peer reviewers   "
        },
        {
            "text": "There is a vast range of plant health research happening across Defra, to support the department’s priorities. The main themes for our research are:  "
        },
        {
            "text": "For example, recent Defra research in plant health has included an Ash tree restoration project – the ‘Living Ash Project’. This project has helped to identify thousands of trees that are resistant to Ash dieback, a disease that has devastated Ash populations in the UK, to support a breeding programme of resistant Ash trees."
        },
        {
            "text": "Being a peer reviewer has multiple benefits "
        },
        {
            "text": "Acting as a peer reviewer has benefits for the reviewer as well as for Defra. Taking part gives you the opportunity to: "
        },
        {
            "text": "If you are interested in joining our register, you can find more information and apply here.  "
        }
    ]
}