{
    "url": "https://food.blog.gov.uk/2024/09/12/introducing-the-fsas-interim-chief-executive-katie-pettifer/",
    "title": "Introducing the FSA’s Interim Chief Executive Katie Pettifer",
    "authors": [
        "Katie Pettifer, Interim Chief Executive"
    ],
    "categories": [
        "People"
    ],
    "pub_date": "2024-09-12T10:36:48+01:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "This is my first message to you as Interim Chief Executive of the FSA and I would like to take the opportunity to introduce myself to those of you who don’t know me from my previous role as the FSA’s Director of Strategy and Regulatory Compliance."
        },
        {
            "text": "I’ve been at the FSA for just over three years, and I’ve been a civil servant for more than twenty years. I’ve worked in many different areas, from the justice system to telecoms regulation, but the common theme for me has always been about improving public services and delivering better outcomes for people. I’ve loved working at the FSA on food you can trust, and I feel proud to have the opportunity to lead the FSA now."
        },
        {
            "text": "I’ll be serving as Interim Chief Executive while a new Chief Executive is recruited, following Emily Miles’ move from the FSA to Defra, where I wish her all the best in her new role."
        },
        {
            "text": "We’ve been busy over the summer recess, continuing our important work to make sure food is safe and authentic and getting to know new ministers. We’re now looking forward to the next FSA Board meeting on 18 September, where we will be covering some important issues."
        },
        {
            "text": "Amongst many items on the agenda, the Board will be considering work underway internationally on a standard approach to precautionary allergy labelling for food businesses, taking stock of the FSA’s science work this year, and hearing proposals for the first phase of a new form of National Level Regulation in England, following a trial with five major supermarkets over the past year."
        },
        {
            "text": "In our trial, we’ve been testing whether it’s possible for the FSA, working with the primary authority, to regulate some large, highly compliant businesses by scrutinising their overall controls and their data, rather than each store being treated as a separate premises by local authorities."
        },
        {
            "text": "Food safety is our absolute priority, and there will always need to be independent checks on businesses, large or small, to make sure their food is safe. But, as our trial shows, there may be different ways of carrying out those checks which still keep standards high and keep consumers safe."
        },
        {
            "text": "The proposed next steps following the pilot are subject to the board’s decision. While they are focussed solely on England at present, it is something we are interested in exploring in Wales and Northern Ireland too in the future. We are developing this approach gradually and expect ideas to evolve over time as we discuss with the board, ministers and stakeholders."
        },
        {
            "text": "If you’re interested in learning more about National Level Regulation, or any of the topics I’ve mentioned, please do dial into our Board meeting. It’s open to all and you can register now. You can also read the board papers to be discussed at the meeting."
        },
        {
            "text": "I’m conscious that election restrictions have interrupted the frequency of our updates to you over the last few months. I hope that we’ll now be able to get back to providing regular updates, not just on the outcome of our board discussions, but also developments at the FSA which we think you’ll be interested in."
        },
        {
            "heading": 1,
            "text": "Cyflwyno Prif Weithredwr Dros Dro yr ASB - Katie Pettifer"
        },
        {
            "text": "Dyma rannu fy neges gyntaf â chi fel Prif Weithredwr Dros Dro yr Asiantaeth Safonau Bwyd (ASB). Hoffwn achub ar y cyfle hwn i gyflwyno fy hun i’r rhai ohonoch nad ydynt yn fy adnabod o’m rôl flaenorol fel Cyfarwyddwr Strategaeth a Chydymffurfiaeth Reoleiddio’r ASB."
        },
        {
            "text": "Rwyf wedi gweithio yn yr ASB ers ychydig dros dair blynedd, ac rwyf wedi bod yn was sifil ers dros ugain mlynedd. Rwyf wedi gweithio mewn llawer o wahanol feysydd, o’r system gyfiawnder i reoleiddio telathrebu, ond y thema gyffredin i mi bob amser fu gwella gwasanaethau cyhoeddus a sicrhau canlyniadau gwell i bobl. Rwyf wedi bod wrth fy modd yn gweithio yn yr ASB ar fwyd y gallwch ymddiried ynddo, ac rwy’n teimlo’n falch o gael y cyfle i arwain yr ASB nawr."
        },
        {
            "text": "Byddaf yn ymgymryd â rôl y Prif Weithredwr Dros Dro nes y bydd Prif Weithredwr newydd yn cael ei recriwtio, a hynny ar ôl i Emily Miles symud o’r ASB i Defra. Rwy’n dymuno’r pob lwc iddi yn ei rôl newydd."
        },
        {
            "text": "Rydym wedi bod yn brysur dros wyliau’r haf, yn parhau â’n gwaith pwysig i sicrhau bod bwyd yn ddiogel ac yn ddilys, ac yn dod i adnabod gweinidogion newydd. Edrychwn ymlaen at gyfarfod nesaf Bwrdd yr ASB ar 18 Medi, lle byddwn yn trafod rhai materion pwysig."
        },
        {
            "text": "Ymhlith llawer o eitemau ar yr agenda, bydd y Bwrdd yn ystyried gwaith sydd ar y gweill yn rhyngwladol ar ddull safonol o labelu alergeddau rhagofalus ar gyfer busnesau bwyd, gan bwyso a mesur gwaith gwyddoniaeth yr ASB eleni, a gwrando ar gynigion ar gyfer cam cyntaf agwedd newydd ar y system Rheoleiddio ar Lefel Genedlaethol yn Lloegr. Mae hyn yn dilyn treial gyda phum archfarchnad fawr dros y flwyddyn ddiwethaf."
        },
        {
            "text": "Yn ein treial, rydym wedi bod yn profi a yw’n bosib i’r ASB, gan weithio gyda’r prif awdurdod, reoleiddio rhai busnesau mawr sy’n cydymffurfio i raddau helaeth iawn drwy graffu ar eu rheolaethau cyffredinol a’u data, yn hytrach na bod pob siop yn cael ei thrin fel safle unigol gan awdurdodau lleol."
        },
        {
            "text": "Diogelwch bwyd yw ein prif flaenoriaeth, a bydd angen cynnal gwiriadau annibynnol bob amser ar fusnesau mawr a bach er mwyn sicrhau bod bwyd yn ddiogel. Ond, fel y dengys ein treial, efallai y bydd gwahanol ffyrdd o gynnal y gwiriadau hynny sy’n parhau i sicrhau safonau uchel a chadw defnyddwyr yn ddiogel."
        },
        {
            "text": "Mae’r camau nesaf arfaethedig yn dilyn y peilot yn amodol ar benderfyniad y Bwrdd. Er eu bod yn canolbwyntio ar Loegr yn unig ar hyn o bryd, mae gennym ddiddordeb mewn archwilio hyn yng Nghymru a Gogledd Iwerddon hefyd yn y dyfodol. Rydym yn datblygu’r dull gweithredu hwn yn raddol ac yn disgwyl y bydd syniadau yn esblygu dros amser wrth i ni drafod gyda’r Bwrdd, gweinidogion a rhanddeiliaid."
        },
        {
            "text": "Os oes gennych ddiddordeb mewn dysgu mwy am y fenter Rheoleiddio ar Lefel Genedlaethol, neu unrhyw un o’r pynciau uchod, gwyliwch ein cyfarfod Bwrdd. Mae’r cyfarfod yn agored i bawb a gallwch gofrestru yma. Gallwch hefyd ddarllen papurau’r Bwrdd a fydd yn cael eu trafod yma."
        },
        {
            "text": "Rwy’n ymwybodol bod cyfyngiadau’r etholiad wedi amharu ar amlder ein diweddariadau i chi dros yr ychydig fisoedd diwethaf. Gobeithiaf y byddwn yn awr yn gallu rhannu diweddariadau rheolaidd eto, gan gynnwys canlyniadau ein trafodaethau Bwrdd a datblygiadau o ddiddordeb yn yr ASB."
        }
    ]
}