{
    "url": "https://publicpolicydesign.blog.gov.uk/2024/09/12/join-the-public-policy-design-community/",
    "title": "Join the public policy design community",
    "authors": [
        "Andrew Knight"
    ],
    "categories": [
        "Events",
        "PublicPolicyDesign"
    ],
    "pub_date": "2024-09-12T16:30:06+01:00",
    "content": [
        {
            "text": "If you are a designer or making public policies and services in innovative, design-centred ways, then now is the time to connect with other like-minded people to build your design capability and practice, and change the future of governments."
        },
        {
            "heading": 2,
            "text": "So what is design?"
        },
        {
            "text": "Design is a professional practice for making public policies and services that respond to people’s needs and the complex world in which they live. It helps governments to deliver meaningful outcomes for citizens."
        },
        {
            "heading": 2,
            "text": "We’re now 10 years old"
        },
        {
            "text": "The modern story of design in government really begins with Government Digital Service creating the GOV.UK website. This created an earthquake of change in public administrations around the globe. And when you look under the bonnet, what enabled that brilliant multidisciplinary work was design."
        },
        {
            "text": "This opened the door for the UK’s Civil Service to imagine how design might be deployed to make other types of services …and policies. In 2014, Policy Lab was founded to create a space for the experimental design of policy, that made a break from the traditional desk-based policy analysis that had driven Whitehall in prior decades."
        },
        {
            "text": "The model was seen as a success and it swiftly spread across Civil Service. Today, most departments of state have their own domain-specific labs who can design policy rapidly, fuelled by deep sector-knowledge and relationships with policymakers."
        },
        {
            "text": "The Policy Design Community has steadily grown over the years and membership numbers accelerated when it formally become part of the Civil Service’s Policy Profession family 4 years ago. Today we have thousands of members in over 160+ UK public sector organisations, and the UK is commonly seen as the global leader in using design to make public policies and services."
        },
        {
            "heading": 2,
            "text": "Our design mission"
        },
        {
            "text": "We are committed to making design core-business for governments. We aim to achieve this through a combination of training, advocacy, and building infrastructure."
        },
        {
            "text": "This year our community members are focusing on two important objectives: building capability and sharing practice internationally."
        },
        {
            "heading": 2,
            "text": "Design education for the UK public sector"
        },
        {
            "text": "Fundamentally, design is a practice. Of course, there is design theory and design research. But because it is about making ‘things’ - of all types - it is only really understood when it is used and practiced."
        },
        {
            "text": "And the practice is also systematic. You’ll often hear public sector workers say (in common parlance) that they have ‘designed’ something, but they are speaking passively, meaning ‘I worked on something’. That is not what professional designers mean when they say they have designed something. Design to a designer is a systematic process and method for reducing uncertainty about the world and the people in it and responding to what they find to deliver a specific outcome. Consequently, we need to teach design as a technical skill."
        },
        {
            "text": "This year our community will work with other types of designers in government to create a new curriculum and training and assurance platform that will underpin design professionalism for our next 10 years."
        },
        {
            "heading": 2,
            "text": "Forging international design partnerships"
        },
        {
            "text": "Our community members are very excited about the World Design Congress coming to London in Summer 2025. As part of this ‘year of design’, we are planning to host shared-practice events for policy designers in the UK and other countries to connect, build practitioner-to-practitioner relationships, and learn together."
        },
        {
            "heading": 2,
            "text": "You can join the community too"
        },
        {
            "text": "If you are not already a member of the Policy Design Community, then we’d love you to join."
        },
        {
            "text": "If you work for any part of the UK’s government (you have a gov.uk email address), then you can join our community here. Our members get monthly newsletters, meet-ups, speaker events and can work with other designers through our working groups."
        },
        {
            "text": "If you don’t work for the UK government, then you can get involved by connecting with us:"
        }
    ]
}