{
    "url": "https://food.blog.gov.uk/2024/09/12/protecting-consumers-and-supporting-the-meat-industry/",
    "title": "Protecting consumers and supporting the meat industry",
    "authors": [
        "Dr James Cooper, Deputy Director of Food Policy"
    ],
    "categories": [
        "Our mission",
        "Partners"
    ],
    "pub_date": "2024-09-12T13:51:21+01:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "Keeping meat safe for consumers and protecting animal welfare are vital jobs for the FSA. Our meat inspectors and vets inspect more than a billion animals every year to help ensure high standards of safety and welfare are maintained."
        },
        {
            "text": "Vets check the animals as they arrive at the abattoir and, together with Meat Hygiene Inspectors, monitor activities right up to the point the meat leaves the premises at the beginning of its journey to the consumer. These protections are an essential part of keeping the nation safe."
        },
        {
            "text": "HM Treasury requires that the cost of regulatory services provided by Government departments should be recovered in full. This includes charging abattoirs for the inspections our vets and meat inspectors carry out."
        },
        {
            "text": "Over the years, the FSA has been able to offer discounts to the meat industry because of the value this work provides for the taxpayer. Many businesses don’t pay the full rate, with small abattoirs paying the least for these essential official controls."
        },
        {
            "text": "Our vets and meat inspectors protect public health by making sure food is safe. There are also economic benefits. According to Defra’s ‘Agriculture in the United Kingdom 2023’ report, the value of meat production in the UK is now worth almost £11 billion. FSA vets and meat inspectors provide the stamp of approval worth £2bn to the UK’s meat export market and are essential to maintaining the confidence of consumers. Set this against the total amount the FSA charged the industry for inspections for the last financial year, which is £39.5m, and it represents a remarkably cost-effective regulation service."
        },
        {
            "text": "Our charge rates for the meat industry though are set to rise. Inflation, which is being felt across all sectors, must inevitably be reflected in the cost of these official controls. The costs of recruiting and retaining vets have also increased as we grapple with a global shortage of vets. We have also been moving towards reducing these discounts to align with HM Treasury rules."
        },
        {
            "text": "The question is how much of the cost of official controls should be met by the taxpayer and how much should the industry pay. To help us examine this, we’ve just started a Call for Evidence on meat charging, so that we can hear how the discounts benefit consumers, industry and other stakeholders. This evidence will inform a paper on charging for the FSA Board which will be discussed at its public meeting on 11 December 2024."
        },
        {
            "text": "Through our Call to Evidence, we want to hear from the meat industry, but we would also like to hear from any other groups or individuals who have a view on food safety, animal welfare, or consumer rights. This is the start of an engagement process with these groups to better understand the impact of these increased costs, ahead of publishing the new charges in February next year."
        },
        {
            "text": "For more information and to take part please see Call for Evidence: The impact of discounts on charges for official controls and other official activities in relation to meat premises"
        },
        {
            "heading": 1,
            "text": "Diogelu defnyddwyr a chefnogi’r diwydiant cig"
        },
        {
            "text": "Mae sicrhau bod cig yn ddiogel i ddefnyddwyr a diogelu lles anifeiliaid yn swyddi hanfodol i’r ASB. Mae ein harolygwyr cig a’n milfeddygon yn arolygu mwy na biliwn o anifeiliaid bob blwyddyn i helpu i sicrhau bod safonau uchel o ddiogelwch a lles yn cael eu cynnal."
        },
        {
            "text": "Mae milfeddygon yn archwilio’r anifeiliaid wrth iddynt gyrraedd y lladd-dy ac, ynghyd â’r Arolygwyr Hylendid Cig, yn monitro gweithgareddau hyd at y pwynt pan fydd y cig yn gadael y safle ar ddechrau ei daith at y defnyddiwr. Mae’r mesurau diogelu hyn yn rhan hanfodol o gadw’r genedl yn ddiogel."
        },
        {
            "text": "Mae Trysorlys EF yn mynnu bod cost gwasanaethau rheoleiddio a ddarperir gan adrannau’r llywodraeth yn cael ei hadennill yn llawn. Mae hyn yn cynnwys codi tâl ar ladd-dai am yr arolygiadau y mae ein milfeddygon a’n harolygwyr cig yn eu cynnal."
        },
        {
            "text": "Dros y blynyddoedd, mae’r ASB wedi gallu cynnig gostyngiadau i’r diwydiant cig oherwydd gwerth y gwaith hwn i’r trethdalwr. Nid yw llawer o fusnesau yn talu’r gyfradd lawn. Mae lladd-dai bach yn talu’r swm lleiaf am y rheolaethau swyddogol hanfodol hyn."
        },
        {
            "text": "Mae ein milfeddygon a’n harolygwyr cig yn diogelu iechyd y cyhoedd trwy sicrhau bod bwyd yn ddiogel. Ceir manteision economaidd hefyd. Yn ôl adroddiad ‘Agriculture in the United Kingdom 2023’ Defra, mae cynhyrchu cig yn y DU bellach yn werth bron i £11 biliwn. Mae milfeddygon ac arolygwyr cig yr ASB yn rhoi sêl bendith gwerth £2bn i farchnad allforio cig y DU, ac maent yn hanfodol wrth gynnal hyder defnyddwyr. Os rydym yn cymharu hyn â’r cyfanswm a godwyd gan yr ASB ar y diwydiant am arolygiadau ar gyfer y flwyddyn ariannol ddiwethaf, sef £34.4m, mae’n cynrychioli gwasanaeth rheoleiddio hynod gost-effeithiol."
        },
        {
            "text": "Serch hynny, mae disgwyl i’n cyfraddau tâl ar gyfer y diwydiant cig godi. Mae’n anochel y bydd chwyddiant, sy’n cael ei deimlo ar draws pob sector, yn cael ei adlewyrchu yng nghost y rheolaethau swyddogol hyn. Mae costau recriwtio a chadw milfeddygon hefyd wedi cynyddu wrth i ni fynd i’r afael â phrinder byd-eang o filfeddygon. Rydym hefyd wedi bod yn symud tuag at leihau’r gostyngiadau hyn i gyd-fynd â rheolau Trysorlys EF."
        },
        {
            "text": "Y cwestiwn yw faint o’r gost am reolaethau swyddogol y dylai’r trethdalwr ei thalu a faint ddylai’r diwydiant ei dalu. I’n helpu i archwilio hyn, rydym newydd gyhoeddi galwad am dystiolaeth ar godi tâl am gig, fel y gallwn glywed sut mae’r gostyngiadau o fudd i ddefnyddwyr, y diwydiant a rhanddeiliaid eraill. Bydd y dystiolaeth hon yn llywio papur ar godi tâl ar gyfer Bwrdd yr ASB, a fydd yn cael ei drafod yn ei gyfarfod cyhoeddus ar 10 Rhagfyr."
        },
        {
            "text": "Drwy ein galwad am dystiolaeth, rydym am glywed gan y diwydiant cig, ond hoffem hefyd glywed gan unrhyw grwpiau neu unigolion eraill sydd â safbwyntiau am ddiogelwch bwyd, lles anifeiliaid, neu hawliau defnyddwyr. Dyma ddechrau proses ymgysylltu â’r grwpiau hyn er mwyn deall yn well effaith y costau uwch hyn, cyn cyhoeddi’r taliadau newydd ym mis Chwefror y flwyddyn nesaf."
        },
        {
            "text": "Gallwch ddarllen yr alwad am dystiolaeth yma."
        }
    ]
}