{
    "url": "https://environmentagency.blog.gov.uk/2024/09/12/the-different-types-of-fish-monitoring/",
    "title": "The different types of fish monitoring",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Environment Agency",
        "Fisheries and biodiversity"
    ],
    "pub_date": "2024-09-12T13:14:43+00:00",
    "content": [
        {
            "text": "My name is Dan Hayter and I work for the Environment Agency as a fish and eel specialist in the National Monitoring Field Team and the Fisheries, Biodiversity and Geomorphology team based in East Anglia. There are many elements to my role, in fact you may have already read my previous blogs that talk you through the eel specific work and also fish surveying work. Today I am going to talk you through the other types of fish monitoring that we do."
        },
        {
            "text": "The Environment Agency monitors coarse fish (fresh water) and marine fish communities, also eel populations. We do this by carrying out electric fishing, hydroacoustic surveys, coastal netting and by using automated fish counters. We may also work on specialised fish and eel tracking projects to monitor movement of individual species."
        },
        {
            "text": "Coarse fish monitoring is done through electric fishing surveys and hydroacoustic surveys. We undertake hydroacoustic monitoring surveys on larger waterbodies including in brackish water, in locations like the Norfolk Broads which are influenced by tides. Due to these factors, it is not possible to do electric fishing. The hydroacoustic monitoring gives slightly different and less specific information compared with an electric fishing survey, but it is still a very useful way for us to understand how many fish are present.  This type of monitoring is done routinely on the relevant rivers all over East Anglia but I have worked on the river Yare, Bure, Waveney, Thurne, and Ant. We need warm water to do the monitoring as this is when fish distribution is consistent throughout the river. During the day fish often hide to avoid predators, so we undertake this work during the hours of darkness when fish come out into open water. Due to the shorter summer nights, we wait until autumn to do these surveys."
        },
        {
            "text": "We use a specially adapted boat for hydroacoustic surveys, which we drive very slowly along the river with a transmitter on the front of the boat. The transmitter emits sound to detect the fish and when this rebounds our equipment records the fish numbers. Each fish has a different echo, and it sounds different depending on the size and position they are in within the river. A hydroacoustic survey generally starts at sunset and continues throughout the night."
        },
        {
            "text": "We also gather data on migrating fish by working with partner organisations to tag and track fish. We do this to learn about their natural movements and how they cope with barriers, pumping stations and other situations so we can protect and improve fish stocks. The tracking teaches us where the fish go and monitors the timings and duration of these movements. This work has helped us to better understand fish stocks in the Norfolk broads, and also to help us plan for saline incursion."
        },
        {
            "text": "Coastal (estuary) fish surveys are done every year to monitor juvenile fish. This is done from a boat using large seine nets and smaller fyke and trawl nets. We set the nets using the boat at low tide to allow us to capture fish effectively. The different types of nets allow us to monitor as many fish communities as possible in various parts of the estuary. These surveys are carried out in the Autumn after the growth season and before the fish migrate into deeper water during the winter. The surveys take approximately 6- 8 hours to complete."
        },
        {
            "text": "Fish monitoring is just one element of the monitoring work that the Environment Agency does. The monitoring is very important for various reasons and we have International, National and Local drivers and directives which require the work to be done. The Water Framework Directive is important and is designed to protect and improve the water environment. Another, the Eel Management Plan helps with the recovery of this critically endangered species across Europe. The National Fisheries Monitoring Programme is behind a lot of the work, together with Water Resources and Drought monitoring and other Local investigations."
        },
        {
            "text": " "
        }
    ]
}