{
    "url": "https://deframedia.blog.gov.uk/2021/09/27/englands-riverbanks-and-watercourses-to-be-planted-with-new-woodland/",
    "title": "England’s riverbanks and watercourses to be planted with new woodland",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2021-09-27T12:21:23+01:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "There has been widespread positive media coverage of our announcement of a new project launched to plant extensive woodlands along England’s riverbanks. The ‘Woodlands for Water’ project aims to create over 3,000 hectares of new riparian woodland to improve water quality, manage flood risk and boost biodiversity. This has been covered nationally by outlets including the Daily Mail, The Times, The Telegraph, Daily Mirror, Daily Express, BBC Online, ITV News, MSN and Independent."
        },
        {
            "text": "Launching the project from an existing riverbank tree planting scheme in Wiltshire, Lord Goldsmith was interviewed for pieces on BBC South Today and BBC Radio Wiltshire."
        },
        {
            "text": "Regionally, the announcement was also covered in the Yorkshire Post, Western Morning News, BBC Radio Cumbria, BBC Radio Shropshire, In Your Area, Planet Radio, Times and Star, Bristol Post; Plymouth Herald and Cornwall Live. Trade outlets such as Farming Online and Forestry Journal have also covered the story."
        },
        {
            "text": "On social media, Prime Minister Boris Johnson tweeted about the announcement, reiterating the Government’s commitment to treble tree planting rates in England by the end of this Parliament."
        },
        {
            "text": " "
        },
        {
            "text": "The project will be carried out by a new ‘Riverscapes Partnership’ convened by 4 leading green organisations (Rivers Trust, National Trust, Woodland Trust and the Beaver Trust). It aims to create 3,150 hectares of trees in six river catchment areas from Devon to Cumbria by March 2025 by directing landowners and farmers to the Forestry Commission’s new England Woodland Creation Offer grant scheme."
        },
        {
            "text": "Forestry Minister Lord Goldsmith said:"
        },
        {
            "text": "Forestry Commission Chair Sir William Worsley said:"
        },
        {
            "text": "Separately, there was also coverage today (27 September) of the Woodland Trust’s announcement that almost £15 million of government funding will pay for the planting of more than a million saplings to create part of the Northern Forest, a new woodland along the M62 corridor in Lancashire and Yorkshire. This was covered by The Times, Evening Standard, the Yorkshire Post and BBC Radio Cumbria and Shropshire."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}