{
    "url": "https://defradigital.blog.gov.uk/2021/09/27/inclusion-more-than-just-a-word/",
    "title": "Inclusion – more than just a word",
    "authors": [
        "Ahana Ogle"
    ],
    "categories": [
        "Defra digital",
        "Digital transformation",
        "Smarter working"
    ],
    "pub_date": "2021-09-27T10:00:58+01:00",
    "content": [
        {
            "text": "The theme of this year’s National Inclusion Week is ‘United for Inclusion’. Being on the autistic spectrum means I have a lifelong condition that affects how I make sense of the world, how I process information and how I relate to other people. It is often described as a spectrum because it affects people in many ways, to varying degrees."
        },
        {
            "text": "People with autism can experience difficulties with social interaction, non-verbal communication and reading signals that others take for granted. Some may be over or under sensitive to any of the senses. All of which can sometimes make it hard for me, and others like me, to feel included."
        },
        {
            "heading": 2,
            "text": "Why disability awareness is important to the Civil Service "
        },
        {
            "text": "The Civil Service aims to attract the widest range of talent possible and its Diversity and Inclusion Strategy is a key mechanism for achieving this. At its core are two priorities:"
        },
        {
            "text": "Many employees have disabilities/conditions such as autism, in the same way that many people with conditions have specific skills that the Civil Service needs, such as enhanced perceptual functions and a greater-than-average ability to pay attention to small details. The Civil Service is proud to say it focuses on the ability rather than the disability of a person."
        },
        {
            "heading": 2,
            "text": "How my autism helped me land a role in the Civil Service and what I learned from it"
        },
        {
            "text": "The Civil Service Autism Exchange Internship Programme, in partnership with charity Ambitious About Autism, started to offer paid, quality work experience to young people with autism and, autism awareness training for employers in 2015."
        },
        {
            "text": "The programme offers those taking part the chance to learn new work skills while providing career development and networking advice. In exchange, participants teach managers and government departments about autism awareness."
        },
        {
            "text": "As someone who had always been interested in experiencing life in the Civil Service, the Autism Exchange placement has been helpful in providing me with practical experience of working life. I was matched to a department, Defra, that suited my interests which include environmental issues, data analysis, research, and writing."
        },
        {
            "text": "I’m learning a lot about the variety of work undertaken by Defra’s Digital, Data and Technology Services (DDTS) function. I’ve been welcomed by the team and made to feel one of them. I enjoy getting stuck into the weekly team virtual meetings where I ‘meet’ colleagues who are based all over the country. I even got to stay in Defra for an extra month thanks to my line manager being so supportive and helpful in arranging an extension for me!"
        },
        {
            "heading": 2,
            "text": "Flexibility makes a difference and aids learning"
        },
        {
            "text": "The flexibility afforded to me by the team, for example allowing me to start work slightly later than most of the team as I’m more of a night owl than an early bird, and allowing me to attend prior commitments, has been enormously helpful and hugely welcome. The placement has taught me workplace skills and helped me understand more about what I want and what I don’t particularly want from my future career."
        },
        {
            "heading": 2,
            "text": "We’re making progress but we can all do more"
        },
        {
            "text": "All of us have a part to play in creating an inclusive workplace. Despite me congratulating the Civil Service on all they do, I know that more can always be done (for example, in February of this year, only 21% of people with autism were in employment in the UK)."
        },
        {
            "text": "Together, though, if we can better understand the challenges we all face, we can devise practical solutions to address and overcome them, and bring us closer to making inclusion an everyday reality."
        },
        {
            "text": "And so, although my placement is almost at an end (and I’m heading off to enjoy student life for a few years), the Civil Service is an environment I would consider returning to, and I’ve made contacts and connections that I’ll keep into the future."
        },
        {
            "heading": 2,
            "text": "Find out more about National Inclusion Week\n"
        },
        {
            "text": "National Inclusion Week takes place between 27 September and 3 October. Register for free and find out how you can get involved."
        }
    ]
}