{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2021/09/27/national-inclusion-week-gse-diversity-and-inclusivity-action-group-diag/",
    "title": "National Inclusion Week : GSE Diversity and Inclusivity Action Group (DIAG)",
    "authors": [
        "Philip Lawrence",
        "Vicki Chalker"
    ],
    "categories": [
        "Blog Series",
        "Diversity & Inclusion",
        "Guest Blog"
    ],
    "pub_date": "2021-09-27T12:31:42+01:00",
    "content": [
        {
            "text": "It is National Inclusion Week and many of us are doing something to recognise it. Here in the Government Science & Engineering (GSE) Profession I volunteered to write three blogs to celebrate National Inclusion week. The first, is reminding you about what is happening within Diversity and Inclusion in the GSE Profession. On Wednesday, I’m going to be discussing being a man in the Women’s Working Group, and on Friday I will be outlining our plans within Diversity & Inclusion (D&I) for the next year or so."
        },
        {
            "text": "The Diversity and Inclusivity Action Group (DIAG) is made up from representatives from across the GSE Profession and is chaired by the Head of Science and Engineering Profession (HoSEP) from Public Health England, Dr Vicki Chalker. DIAG meets every 8 weeks and amongst other things helps set the general direction of D&I work within GSE and the working groups. The original aim was to have representatives from all GSE departments on DIAG but we’ve not got there yet, if you’re interested in being involved with D&I please speak to your HoSEP or GSE Champions."
        },
        {
            "text": "Within DIAG there are working groups, transitory groups created to respond to the aims of DIAG.  We currently have three working groups focused on areas identified in the GSE survey in late 2019 –focussing on those with disabilities, from minority ethnic groups, and women. A fourth group is in the process of being established and will focus on social mobility, to see what the GSE Profession can do to improve recruitment and STEM outreach across this area."
        },
        {
            "text": "We have also recently appointed a LGBTQ+ champion and are looking for more champions, initially for gender and cultural diversity. Over time the working groups may disband, and new ones will be created as ideas arise for new projects. All our contributors are volunteers, and we aim to use our time as best as we can and with more active volunteers we could do much more. Check out the article on volunteering which will be released Friday."
        },
        {
            "text": "As scientists and engineers, we know how important data is. We have all done experiments at school or university and plotted the results to either prove an existing law or try to find out something new. The subject that most of us hold dear and enjoy is built around proving things with data."
        },
        {
            "text": "D&I data is just as important, however, many of us haven’t completed our D&I data within our own departments. DIAG and the working groups, and your own departmental training teams, recruitment teams, and networks are working incredibly hard to help the GSE and the Civil Service be inclusive and diverse. Data informs us how things are going and which areas to focus on. Often it is said that women are underrepresented in STEM and in the Senior Civil Service. We could observe that is true, but with data we can see by how much, and whether it is improving and if training courses, mentoring programmes, or inspirational blog articles are making a difference."
        },
        {
            "text": "So, my challenge to you, as a scientist or engineer in Government, is to commit to completing your diversity data this National Inclusion Week.  It’ll only take minutes.  If you’ve already done it then please encourage your colleagues to do the same."
        }
    ]
}