{
    "url": "https://lifeathmrc.blog.gov.uk/2021/09/27/national-inclusion-week-at-hmrc-christines-story/",
    "title": "National Inclusion Week at HMRC, Christine’s Story",
    "authors": [
        "Mems Bangura"
    ],
    "categories": [
        "General",
        "Inclusion",
        "Mental Health"
    ],
    "pub_date": "2021-09-27T10:00:03+00:00",
    "content": [
        {
            "text": "National Inclusion week 2021 will take place from 27 September until 3 October with a focus on this year’s theme of #UnitedForInclusion. We celebrate National Inclusion week to recognise the support we offer to colleagues to make sure no one is left out. This year at HMRC, we’re celebrating with a three-part series of stories from colleagues across the department."
        },
        {
            "text": "We all know COVID-19 presented several unique challenges for everyone, creating a need for us all to adapt to the ‘new normal’. This has meant further considering how we can all help each other to be more inclusive, whether that’s through flexible working or extra support from one of our Employee Networks."
        },
        {
            "text": "With this in mind, we interviewed Christine in Customer Compliance to learn more about the inclusive initiatives they’ve used at HMRC."
        },
        {
            "text": "I work on the diverted profits team as Lead Investigator within Customer Compliance.  We deal with tackling some of the biggest corporations in the world. We try to prevent the diversion of profits into low tax territories which should be taxed in the UK."
        },
        {
            "text": "My role on the team is mainly fact finding. I get information from the corporations and interview employees, carry out investigative work and then educate corporations on better practices when needed. It’s important to get the right results because it levels the playing field and it helps the country fund schools and hospitals. It feels good to be on the right side."
        },
        {
            "text": "I needed specific qualifications to get on my team, but they were all paid for by HMRC as part of Tax Specialist Programme. They’re also underwritten by Manchester Metropolitan University so it’s an actual degree - it’s just one of many avenues for people to try and progress at HMRC."
        },
        {
            "text": "The support here is also really helpful. When I was caring for my mum who had Dementia while I was on my course, I was advised to get a Carer's Passport."
        },
        {
            "text": "It’s a report that helps your manager understand what can be done day-to-day to reduce stress and if you move roles or departments, it goes with you, so you don’t have to go through the same discussions with a new manager. It was an absolute life saver because it meant other people understood what stresses and strains you were under."
        },
        {
            "text": "With my Carer’s Passport, I was able to work 5 days over 4 days which allowed me to attend medical appointments and look after my mum. I also had some reasonable adjustments for exams due to menopause symptoms. The support was excellent and far beyond what I had expected."
        },
        {
            "text": "I’m also a member of HMRC’s Mental Health Network. It's a safe space to talk to people and it helps you realise you're not the only person feeling this way. It gives you some coping mechanisms as well. Some people may not realise the effect being a Carer has on your mental health, so it’s great this is recognised and there’s extra support available. Mental health is very much a changing picture within HMRC and it’s great they're constantly working hard to make sure that people are listened to and supported."
        }
    ]
}