{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2021/09/27/royal-society-policy-associates/",
    "title": "Royal Society Policy Associates",
    "authors": [
        "Selina Khan"
    ],
    "categories": [
        "GSE Opportunities"
    ],
    "pub_date": "2021-09-27T17:36:30+01:00",
    "content": [
        {
            "text": "Placements sought for Royal Society Policy Associates – deadline Friday 15th October 2021"
        },
        {
            "text": "Would you be in interested in hosting a Royal Society-funded researcher in your team starting between October 2021 and March 2022? This year's cohort of 'Policy Associates' (please see their profiles below) are looking for placements for three months on a full-time basis or up to nine months on a part-time basis (with the same total number of days). The Royal Society continues to pay their salaries while on secondment and cover their travel expenses."
        },
        {
            "text": " "
        },
        {
            "text": "Please contact Liz Surkovic at the Royal Society  if you are interested and/or submit a role proposal by Friday 15th October, including some elements of background (context and team), an outline of the proposed tasks and missions, and proposed dates. Please contact the GSE team if you require Liz's email."
        },
        {
            "text": "The scheme offers Royal Society’s University Research Fellows (outstanding early- to mid-career scientists) and Dorothy Hodgkin Fellows (earl​y- to mid-career scientists who require a flexible work pattern) a secondment within a science policy ​environment. The secondment should offer first-hand experience of working in science policy, and using science and evidence to inform policy advice and decision making. Details of the secondment activities would be agreed between the​ Policy Associate and the hosting department/team."
        },
        {
            "text": "The profiles for the candidates seeking secondments this year are as follows (names withheld for GDPR reasons, but will be provided to those expressing an interest in providing a placement):"
        },
        {
            "text": " "
        },
        {
            "text": "Candidate 1 (Dr V) "
        },
        {
            "text": "Research area and expertise: Research Group Leader and Academic Education in a variety of STEM departments (Mechanical and Aeronautical Engineering, Earth Sciences, Applied Mathematics). Research focusses on the dynamics of granular materials (e.g. sand, snow) in the context of natural hazards, desertification, risk management and climate change."
        },
        {
            "text": "Transferable skills and experience: Strong track record of science communication, leadership and teamwork. Effective communicator and frequent scientific expert in audio-visual media (TV & documentaries on the BBC, National Geographic, Discovery Channel)."
        },
        {
            "text": "Preferred policy areas: natural hazards, risk management in all climate-related matters. International development and equality in educational resources."
        },
        {
            "text": "Available immediately, part-time for a placement in Westminster, between 2 (minimum) and 4 (maximum) days per week"
        },
        {
            "text": " "
        },
        {
            "text": "Candidate 2 (Dr S)"
        },
        {
            "text": "Research area and expertise: Machine learning applied to robotics, computer graphics and computer vision. Expertise in developing fast computer simulations of physics (light energy, rigid objects, fluids, etc.)"
        },
        {
            "text": "Transferable skills and experience: Critical thinking, analytical reasoning, creative solutions, writing, adaptability, collaboration, planning and resource management, outreach."
        },
        {
            "text": "Preferred policy areas: social mobility, diversity (specifically women) in STEM."
        },
        {
            "text": "Available immediately, for either a full-time for a placement in Holyrood (is based in Edinburgh), or a part-time placement in Westminster."
        }
    ]
}