{
    "url": "https://educationhub.blog.gov.uk/2021/09/27/spreading-conspiracy-theories-and-targeting-teachers-and-pupils-at-the-school-gates-is-outrageous-education-secretary-nadhim-zahawi-on-the-importance-of-vaccines-for-pupils-aged-12-and-up/",
    "title": "Education Secretary Nadhim Zahawi explains the importance of vaccines for pupils aged 12 and up and condemns those \"spreading conspiracy theories and targeting teachers and pupils at the school gates\"",
    "authors": [
        "Media Officer"
    ],
    "categories": [
        "Further education",
        "Schools",
        "Uncategorized"
    ],
    "pub_date": "2021-09-27T11:34:49+01:00",
    "content": [
        {
            "text": "Education Secretary Nadhim Zahawi has today written in the Telegraph about the importance of keeping school attendance high and the role of the vaccine in that. "
        },
        {
            "text": "As Vaccines Minister, I saw first-hand how a huge national effort led to a world-leading vaccine-delivery programme, with adults in this country vaccinated against Covid at record speed."
        },
        {
            "text": "Thanks to a colossal drive from Government at a local and national level, and the NHS, medical staff and volunteers, we were able to get jabs in arms, protect people from the virus, manage hospital capacity, and safely reopen schools and our economy."
        },
        {
            "text": "As a result, life has returned to relative normality far sooner than many of us dared to imagine."
        },
        {
            "heading": 3,
            "text": "We owe this to the next generation"
        },
        {
            "text": "Now, in my new job as Education Secretary, I’m determined to see the same urgency and vigour we’ve witnessed throughout our vaccination programme as we offer the vaccine to children aged 12 and above."
        },
        {
            "text": "At the core of the Government’s mission is an unwavering commitment to the fundamental right of every child to the best possible education. We owe this to the next generation. But to deliver on that ambition, we need children to be in schools with their teachers, friends and classmates, bouncing ideas off each other and experiencing the joy of learning as a group. That is why we are giving teenagers the chance to be vaccinated, so we can get more children back into face-to-face education."
        },
        {
            "heading": 3,
            "text": "We can’t and won’t stand back and let attendance fall"
        },
        {
            "text": "We can’t and won’t stand back and let attendance fall. The education of our children is simply too important."
        },
        {
            "text": "As a parent, I have seen first-hand how damaging it can be for children to be out of education, and the great strain it can put on family life. Being in school is not only vital for children’s education, but also for their mental health, wellbeing, and development."
        },
        {
            "text": "Dame Rachel de Souza, England’s Children’s Commissioner, has said in recent weeks how her Big Ask survey of young people’s views found that “children like school” and they “realised how sitting in front of the computer is no proxy for being with a teacher”. That’s why we’ve invested billions of pounds in tutoring programmes, extracurricular activities, and further teacher training. We need to use all the tools we have to ensure that every child is in school and fulfilling their potential. Vaccination is key to achieving this."
        },
        {
            "heading": 3,
            "text": "Being vaccinated is a good thing"
        },
        {
            "text": "Schools have gone above and beyond to create spaces and get consent, allowing the health service to deliver jabs and protect us from the virus. They are providing the right information from the health service to make sure children, parents and carers can make an informed decision."
        },
        {
            "text": "Of course, no child is being forced to have the jab. It is a personal medical choice for children and parents or carers to discuss, and we trust them to do so – and no one should be stigmatised for their decision. But let’s be clear: being vaccinated is a good thing, for you and for those around you. It makes you less likely to catch the virus, less likely to pass it on, and far less likely to get seriously ill."
        },
        {
            "text": "Despite this, a small minority has spread conspiracy theories and campaigned outside schools, targeting teachers and even pupils. This is outrageous. Under no circumstances is it ever acceptable to target teachers or the wider school community."
        },
        {
            "heading": 3,
            "text": "Get behind our teachers"
        },
        {
            "text": "As Education Secretary, I want teachers and students to know that I will always stand up for them and tackle harassment head on, so teachers can do their vital jobs safely and children can get the education they deserve – regardless of choices made over vaccination. I thank them for their work and all they have done to help get our children back in schools."
        },
        {
            "text": "The virus is still a very real threat and must be treated with the utmost seriousness, but the wonders of science have allowed us to regain control of our lives through life-saving vaccines. We will always prioritise the health and education of children, and as we roll the vaccine out to the next generation, I urge everyone to get behind our teachers and the wider school community, and show them how much we appreciate their boundless commitment to keeping our schools open and our children safe."
        }
    ]
}