{
    "url": "https://insideDIO.blog.gov.uk/2021/09/27/training-estate-delivery-successes-support-armed-forces/",
    "title": "Training Estate delivery successes support Armed Forces",
    "authors": [
        "DIO communications team"
    ],
    "categories": [
        "Accommodation",
        "Armed Forces",
        "Climate Change",
        "Forestry",
        "Landmarc",
        "Salisbury Plain Training Area"
    ],
    "pub_date": "2021-09-27T13:05:01+00:00",
    "content": [
        {
            "text": "Troops outside the new facility at Nesscliff. [Copyright Landmarc Support Services 2020.]MOD land is held solely for the purpose of training the Armed Forces. Managing this land to enable the military to prepare for real-life situations is a crucial part of DIO’s role."
        },
        {
            "text": "Despite the challenges posed by the pandemic, DIO worked with its contractor Landmarc Support Services to deliver a range of projects that represented a 40% increase in value on the previous year."
        },
        {
            "text": "We completed more than 1,000 individual improvement activities across the estate, valued at around £50m, compared to some £36m in  the previous financial year."
        },
        {
            "text": "Among the key projects was the first phase of the £45m Net-zero Carbon Accommodation Project (NetCAP), which has delivered the Defence Training Estate's first carbon-negative buildings and is a significant contributor to the Government target to achieve net-zero carbon emissions by 2050."
        },
        {
            "text": "An aerial view of the three new buildings at Westdown Camp, Salisbury Plain Training Area. [Copyright Reds10].The programme will provide over 50 new carbon-efficient accommodation blocks, with more than 2,000 bed spaces, which will improve the lived experience for the Armed Forces while they are using our camps to train"
        },
        {
            "text": "Fifteen blocks were delivered during the last financial year at Westdown, Knook, Nesscliff, Brunswick and Castlemartin Camps, providing 650 bed spaces, and even in its early stages, the programme was recognised by the MOD Sanctuary Awards, achieving a Highly Commended award for Sustainable Construction. More recently  it has won the Government Opportunities Public Procurement Award for Infrastructure Project of the Year."
        },
        {
            "text": "In Kirkcudbright, enabling works started to support the trial of the Army's new multi-role, fully-digitised Armoured Fighting Vehicles (AFV). Facilities provided include a new 1.5km looped battle-run, and a new moving target system, which will rigorously test the versatility of the new fighting vehicles prior to them entering operational use."
        },
        {
            "text": "On the rural estate, DIO delivered over £1.7 million worth of work through the Conservation Stewardship Fund to improve the natural and historic environment of the estate. This supports the MOD's new Climate Change and Sustainability Strategic Approach, which has a focus on woodland creation and projects to support carbon sequestration."
        },
        {
            "heading": 2,
            "text": "Covid and Real Life Support "
        },
        {
            "text": "Last year was a year like no other, and teams across the estate stepped up to support the military's Real Life Support (RLS) teams to establish essential quarantine facilities at locations including Beckingham, Capel Curig, Crowborough and Swynnerton."
        },
        {
            "text": "These facilities were essential for personnel preparing for pre and post overseas deployments. Support included the provision of essential welfare facilities, such as secure, high-speed broadband internet. This was initially trail blazed at Halton Camp where it was deployed and in operation in just 72 hours."
        },
        {
            "text": "Last year was a year like no other, and teams across the estate stepped up to support the military's Real Life Support (RLS) teams to establish essential quarantine facilities at locations including Beckingham, Capel Curig, Crowborough and Swynnerton."
        },
        {
            "text": "These facilities were essential for personnel preparing for pre and post overseas deployments. Support included the provision of essential welfare facilities, such as secure, high-speed broadband internet. This was initially trail blazed at Halton Camp where it was deployed and in operation in just 72 hours."
        }
    ]
}