{
    "url": "https://mhrainspectorate.blog.gov.uk/2021/09/27/updated-data-integrity-requirements-for-glp-monitoring-programme-members/",
    "title": "Updated data integrity requirements for GLP Monitoring Programme members",
    "authors": [
        "Jason Wakelin-Smith"
    ],
    "categories": [
        "Compliance matters",
        "Good laboratory practice"
    ],
    "pub_date": "2021-09-27T11:39:05+01:00",
    "content": [
        {
            "text": "The MHRA published the GXP Data Integrity Guidance in March 2018 (see https://mhrainspectorate.blog.gov.uk/2018/03/09/mhras-gxp-data-integrity-guide-published/) and has subsequently led the development of an Organisation for Economic Co-Operation and Development (OECD) advisory document on data integrity."
        },
        {
            "text": "The new OECD Data Integrity Advisory Document can be found here: https://www.oecd.org/officialdocuments/publicdisplaydocumentpdf/?cote=env/cbc/mono(2021)26&doclanguage=en"
        },
        {
            "text": "The OECD Advisory Document on Data Integrity takes precedence over the MHRA GXP Data Integrity Guidance, due to the UK’s membership of the OECD Mutual Acceptance of Data (MAD) System (further details on the international GLP framework can be found here (Being signed up to the OECD Mutual Acceptance of Data agreement is anything but MAD! - MHRA Inspectorate (blog.gov.uk))."
        },
        {
            "text": "The MHRA GXP Data Integrity Guidance was always intended to sit alongside additional regulatory guidance and should also continue to be used to supplement and support UK GLP facilities as it provides additional guidance primarily associated with the importance of a supportive organisational culture in order to embed and foster a strong data integrity culture within organisations."
        },
        {
            "text": "While the keen-eyed among you will notice similarities between the MHRA data integrity document and the OECD advisory document, there are a number of differences between the 2 sets of guidance. There are a few additional requirements, but these tend to complement the existing MHRA guidance and no significant contradictions exist between the 2 documents. As a result, there are no plans to revise the MHRA document at this time."
        },
        {
            "text": "The differences can be summarised into the following groups of changes (this is not an exhaustive list, organisations should conduct their own review and assess the changes required and any impact on existing practices):"
        },
        {
            "text": "Making the guidance specific for Good Laboratory Practice (GLP) "
        },
        {
            "text": "Definitions and guidance "
        },
        {
            "text": "Additional content"
        },
        {
            "text": "Members of the UK GLP Monitoring Programme should conduct a documented review of their existing data integrity processes against the OECD document to ensure that they fully comply and that any required changes or additions are implemented. This activity is likely to be reviewed at the next inspection of the facility."
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}