{
    "url": "https://deframedia.blog.gov.uk/2022/12/29/coverage-on-the-impact-of-avian-flu-on-free-range-egg-rules/",
    "title": "Coverage on the impact of avian flu on free range egg rules",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Weekly stories"
    ],
    "pub_date": "2022-12-29T13:29:42+00:00",
    "content": [
        {
            "text": "There has been speculative coverage in the Telegraph and Guardian today on potential changes to free-range egg rules in response to bird flu outbreaks."
        },
        {
            "text": "We are experiencing our largest ever outbreak of avian influenza and housing measures remain in force to protect poultry and other birds from this highly infectious disease. Bird keepers are required to shut their birds indoors and implement strict biosecurity measures, regardless of whatever type or size."
        },
        {
            "text": "Poultry keepers who are required by the government to house their birds to protect public and animal health can still retain their free-range status so long as their birds are not housed for more than 16 weeks for eggs, provided they meet all other requirements.  This currently only applies to producers in England and Wales."
        },
        {
            "text": "We are aware that there are proposals within the EU to potentially amend the 16-week derogation period. We are under no obligation to align with EU changes and will act in the interests of UK consumers and producers."
        },
        {
            "text": "Any review of or changes to the Egg Marketing Standards are a matter for each of the devolved administrations in Great Britain. Any changes to rules will be considered carefully in order to maintain consumer confidence in the free-range brand long-term."
        },
        {
            "text": "The AIPZ requirements, including housing measures where they apply, will remain in force until further notice. However, the measures will be kept under regular review as part of the government’s work to monitor and manage the risks of avian influenza. We continue to provide support for the poultry sector throughout this challenging time."
        },
        {
            "text": "Under strengthened biosecurity measures, all bird keepers should be taking extra precautions, such as restricting access for non-essential people on site, ensuring workers change clothing and footwear before entering bird enclosures and cleaning and disinfecting vehicles regularly to limit the risk of the disease spreading."
        },
        {
            "text": " "
        }
    ]
}