{
    "url": "https://socialcare.blog.gov.uk/2024/02/13/celebrating-support-workers/",
    "title": "Celebrating support workers",
    "authors": [
        "Leanne Flint"
    ],
    "categories": [
        "Care and support",
        "Mental health",
        "Workforce"
    ],
    "pub_date": "2024-02-13T14:38:03+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Looking for inspiration"
        },
        {
            "text": "I’d been working for an NHS GP surgery and, after many years, felt I needed a new challenge. My next-door neighbour worked at Cygnet and told me how rewarding the job was. I looked online and found a health care support worker vacancy at Aspen Clinic in Mexborough."
        },
        {
            "text": "I attended the interview and was shown around the unit. Interestingly, one of the service users was also on the interview panel, asking me questions and giving me advice. It must have gone well as I was offered the role later that day. I agreed and never looked back."
        },
        {
            "text": "When I was growing up, a member of my family suffered very bad anxiety, depression and post -traumatic stress disorder (PTSD). This changed my life completely, making me grow up very quickly."
        },
        {
            "text": "At the time, mental health was a taboo subject. I can remember having weekly counselling sessions and asking what mental health support was available for carers. Although this was a difficult experience, it gave me a better understanding of the complexities of living with mental health conditions."
        },
        {
            "text": "On my first day at Aspen Clinic, I was nervous, but I still found the courage to step through the doors at 8am. It was the best decision I ever made."
        },
        {
            "text": "I attended the night staff’s morning handover and met the full team. This included the hospital manager, head of care and nursing, occupational therapy and support colleagues. They were the nicest people I have ever met. They all worked as a team and I could see from the outset no one was considered more important than any other."
        },
        {
            "heading": 2,
            "text": "My working day"
        },
        {
            "text": "Support workers’ roles vary hugely, as no two days are the same."
        },
        {
            "text": "The day on the ward gets properly underway with morning coffee and a breakfast club with the service users. This gives us time to chat with the people we support and ‘put the world to rights.’"
        },
        {
            "text": "We have different responsibilities throughout the day. This could include helping a service user with supermarket shopping, attending hospital appointments, or supporting their therapy sessions at a local animal centre."
        },
        {
            "text": "This role has really opened my eyes to the value of the support we give every day. It really does make a massive impact on people’s lives."
        },
        {
            "text": "As a team Leader, my role now involves assisting the support worker team through daily work allocations, planning monthly rotas, annual leave and staff supervisions. I still spend as much time as possible interacting with the team and the service users."
        },
        {
            "text": "During my 15 years at Aspen Clinic, I’ve been offered so much training. I’ve completed NVQ Level, 1, 2 and 3 in Health and Social Care, all funded by Cygnet. I have also been trained in recording ECGs and phlebotomy. I have been qualified for over 12 years."
        },
        {
            "text": "This training has helped me progress from my role as a health care support worker to team leader and carer lead. My role now includes supporting the unit and helping service users’ families, working together as a team to deliver the best care."
        },
        {
            "heading": 2,
            "text": "Shared values"
        },
        {
            "text": "My advice to anyone looking for roles within social care is to join a care provider committed to helping colleagues realise their potential, accomplish career goals and climb the ladder of success."
        },
        {
            "text": "I’m also fortunate to work for an employer who values colleagues’ opinions and ideas on how to move forward and improve services. In this way, we all live up to the values of integrity, trust, empowerment, respect, and care."
        },
        {
            "text": "We can talk to our Chief Executive at any time about new ideas for the organisation. There aren’t many places where you can do this, and I always feel valued as a member of the team."
        },
        {
            "text": "To come from a small town, with a basic knowledge of mental health, to now being directly involved in the development of services and our team, has been an incredible journey."
        },
        {
            "text": "My advice to anyone considering careers in care? Never think you’re ‘just a support worker’. We work as one to deliver outstanding care to everyone. The smiles you see on their faces warms the heart every time."
        }
    ]
}