{
    "url": "https://ofsi.blog.gov.uk/2024/02/13/changes-coming-to-ofsi-guidance-in-2024/",
    "title": "Changes coming to OFSI guidance in 2024",
    "authors": [
        "OFSI"
    ],
    "categories": [
        "Engagement",
        "Implementation"
    ],
    "pub_date": "2024-02-13T12:00:57+00:00",
    "content": [
        {
            "text": "The Office of Financial Sanctions Implementation (OFSI) is committed to providing high-quality, widely accessible and easy to understand guidance to support our users to implement financial sanctions. As part of this commitment, we are always looking for ways to improve our guidance to ensure it can be as beneficial as possible. This blog explains the new changes we will be making this year and how our upgraded guidance will better support you.  "
        },
        {
            "text": " "
        },
        {
            "text": "What changes are coming in 2024? "
        },
        {
            "text": "We will be upgrading your guidance experience by transitioning to a new Sanctions Digital Guidance format, replacing our previous PDF guidance. Unless otherwise specified, this will not routinely include changes to the content of the guidance but instead introduce improvements for accessibility and user experience.  "
        },
        {
            "text": "This change will bring a variety of benefits: "
        },
        {
            "text": "To support our new and upgraded guidance, you may notice changes to our website as we improve its layout and structure.  "
        },
        {
            "text": " "
        },
        {
            "text": "When will these changes happen? "
        },
        {
            "text": "We will be upgrading all of our financial sanctions guidance to Sanctions Digital Guidance throughout 2024. During the transition, you may find that some guidance will be available as digital and some as legacy PDFs. "
        },
        {
            "text": "You will begin seeing upgraded guidance from today, 13 February, with our newly upgraded general guidance now available. "
        },
        {
            "text": " "
        },
        {
            "text": "How can I provide feedback? "
        },
        {
            "text": "We are always looking for feedback on how we can provide you with better guidance and support, you can get in touch with us at ofsi@hmtreasury.gov.uk.  "
        },
        {
            "text": "You can also sign up to our e-alerts here to be the first to find out about changes to any of our guidance. "
        }
    ]
}