{
    "url": "https://mojdigital.blog.gov.uk/2024/02/13/diversity-in-tech-our-commitment/",
    "title": "Diversity in Tech - Our Commitment",
    "authors": [
        "Stuart Lynch"
    ],
    "categories": [
        "a great place to work",
        "capability",
        "collaboration",
        "connected",
        "Diversity and Inclusion",
        "Our Culture",
        "TCC",
        "Tech Talent Charter"
    ],
    "pub_date": "2024-02-13T12:56:07+01:00",
    "content": [
        {
            "text": "A resolution "
        },
        {
            "text": "During the colder months, it is usual to reflect on the year just past and the year ahead and perhaps even make a resolution or two. Here in Justice Digital our Capability Team has already fulfilled a major resolution in our efforts to be the employer of choice.  "
        },
        {
            "text": "We’re absolutely delighted to have signed up to the Tech Talent Charter (TTC). The TTC is a government-supported and industry-led membership group that brings together 700+ signatory organisations, providing the best networks and diversity and inclusion resources. This is all backed up with market-leading insights, programmes, initiatives, and practices. "
        },
        {
            "text": "Signing up means we’ve made a commitment. We will work with the TTC and our co-signatories collectively to increase the diversity and inclusion of our and the UK digital and data workforce.  "
        },
        {
            "text": "Data  "
        },
        {
            "text": "We did not go into this lightly and will share anonymised diversity data with TTC. The sharing of data was quite rightly something we discussed at length to make sure we’re doing so safely and ethically. It was this requirement to share data before joining that really made me feel this was something worth our investment. We aren’t interested in simply signing up to acquire a badge, our data and that of our co-signatories will combine to add value to our conversations, plans, and actions."
        },
        {
            "text": "Why does this matter? "
        },
        {
            "text": "Some statistics from their website help frame why the TTC was created in 2015 to address the UK’s tech talent shortage and diversity problem. "
        },
        {
            "text": "I am also very grateful to be able to pursue a CIPD Masters Level qualification. In my extensive reading about people matters, the requirement for diversity of people and thought in organisations, to enable them to thrive, is overwhelming. Proactive organisations are more likely to achieve stronger results and make better decisions. If an organisation like ours can be as diverse as the citizens we serve, we are more likely to deliver the best products and services.  "
        },
        {
            "text": "It’s also, put simply, the right thing to do. A Justice Digital workforce that is more diverse, equal, and inclusive will experience improved wellbeing and feel more psychologically safe. Things that are extremely important to us. "
        },
        {
            "text": "Resolution fulfilled; what’s next? "
        },
        {
            "text": "It’s with a real sense of pride that I can say the Justice Digital Capability Team has met one of our key New Year’s resolutions. This year, we are dedicated to creating our own roadmap and establishing a firm timeline for reflecting the diversity of the UK population. Collaborating with TTC will enable us to describe, design and deliver in a meaningful way.  "
        }
    ]
}