{
    "url": "https://stratcommand.blog.gov.uk/2024/02/13/gdp-recruits_successfully_complete_training/",
    "title": "Gibraltar Defence Police Recruits Successfully Complete Training in the UK",
    "authors": [
        "abievans"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2024-02-13T14:22:53+00:00",
    "content": [
        {
            "text": "Three Gibraltar Defence Police (GDP) recruits recently returned to Gibraltar after completing their initial 12-week police training at Southwick Park, UK, with the Ministry of Defence Police (MDP)."
        },
        {
            "text": "This milestone marks the end of an intensive training programme, aimed at equipping them with essential policing skills and knowledge."
        },
        {
            "text": "Throughout the rigorous training programme, the recruits delved into various aspects of law, legislation, and policing procedures, alongside personal safety training (PST), among other vital skills."
        },
        {
            "text": "Under the guidance of the MDP training team, they underwent comprehensive training to prepare them for the demanding responsibilities of Policing."
        },
        {
            "text": "The passing out ceremony held on 26 January 2024, hosted by the MDP at Southwick Park, provided a fitting platform for the GDP recruits to celebrate their achievement."
        },
        {
            "text": "MDP Assistant Chief Constable Jason Gwillim inspected Class ‘Sapphire’ and invited GDP Superintendent Mark Wood to inspect Class ‘Cobalt’."
        },
        {
            "text": "The parade consisted of 26 MDP officers and 3 GDP officers."
        },
        {
            "text": "Highlighting individual excellence, Police Constable (PC) 54 David Perrin (GDP) was honoured with the prestigious Endeavour Award, recognising his outstanding performance and consistent dedication to the training and in assisting his fellow recruits throughout the training period. This award highlights the commitment to excellence instilled within the GDP and sets a high standard for future recruits."
        },
        {
            "text": "With their successful completion of the initial training, the GDP recruits now transition to the next phase under the guidance of the GDP training team."
        },
        {
            "text": "Over the following eight weeks, they will continue an intensive programme which focuses on local legislation and general policing duties."
        },
        {
            "text": "Furthermore, the recruits will benefit from a four-week secondment with the Royal Gibraltar Police (RGP), offering invaluable exposure to practical policing scenarios and confrontation management."
        },
        {
            "text": "As we extend our greatest congratulations to PC David Perrin, PC Julian Serrano, and PC Kieron Garcia on their achievement, we also commend the dedication and hard work of the MDP training team. Their unwavering support and guidance have played a vital role in the development of the GDP recruits."
        },
        {
            "text": "Additionally, we express gratitude to our colleagues at the RGP for their collaboration and assistance in facilitating the recruits' development through the secondment."
        },
        {
            "text": "We look forward to witnessing their continued growth and contributions to ensuring the safety and security of the MOD and wider Gibraltar."
        }
    ]
}