{
    "url": "https://forestrycommission.blog.gov.uk/2024/02/13/how-were-using-the-power-of-the-courts-to-clamp-down-on-illegal-felling/",
    "title": "How we’re using the power of the courts to clamp down on illegal felling",
    "authors": [
        "Jonathan Tizzard"
    ],
    "categories": [
        "Ancient Woodland",
        "Tree Planting",
        "Woodland management"
    ],
    "pub_date": "2024-02-13T16:00:13+00:00",
    "content": [
        {
            "text": "The felling of trees is an important part of good woodland management and key to a healthy woodland, but we need to make sure it is done legally to avoid detrimental effects to the both the wood itself and the wider environment."
        },
        {
            "text": "I am an Enforcement Investigator working within the Forestry Commission’s National Enforcement team. Having transitioned from a long career as a Police Detective investigating other serious crime types, I am now using my skills and experiences to help tackle forestry related crime, which is on the rise."
        },
        {
            "text": "The National Enforcement team primarily investigate reports of alleged illegal felling of trees and failure to comply with Enforcement Notices issued under the Forestry Act 1967. Ultimately our goal is to bring offenders to justice, deter future offending and repair the damage to the environment caused by illegal acts using legislation that is available to us."
        },
        {
            "text": "On the 1 January 2023, the penalties for illegal felling changed and a recent case has resulted in the first ever Restocking Order after conviction being issued under Section 24B of the Forestry Act 1967 by a Magistrates Court."
        },
        {
            "text": "This court order is the culmination of hard work by our Regulations team which sought the changes to the Forestry Act 1967 (through the Environment Act 2021). It is groundbreaking news for the protection of our trees and woodlands and has been a long time in the making."
        },
        {
            "heading": 3,
            "text": "What exactly is a Section 24B Court Restocking Order?"
        },
        {
            "text": "Following a conviction for failing to comply with the requirements of an Enforcement Notice issued under Section 24B of the Forestry Act 1967, we are now able to make an application to the court for a Restocking Order. If granted, these orders are seen in the same way as other court orders. It’s something the defendant has to do."
        },
        {
            "text": "If they don’t comply, the court can now deal with them for contempt of court under Section 63(3) of the Magistrates’ Courts Act 1980. This means the court can impose a further financial penalty or even a custodial sentence."
        },
        {
            "heading": 3,
            "text": "So, what has happened?"
        },
        {
            "text": "In December 2023, a court of law ordered a landowner to replant the site of an illegal felling with trees or face further consequences from the court. This order was made after the defendant failed to comply with a Section 24 Enforcement Notice issued by us."
        },
        {
            "text": "More routinely, the courts deal with assaults, thefts, frauds and other more commonly heard of matters, and often don’t understand the impact of environmental crimes. This court order marks a change in that. Not only will the defendant need to replant the trees, but they need to maintain those trees for 10 years too."
        },
        {
            "text": "It’s fantastic to see the result of such sustained hard work putting another effective tool in the enforcement and regulatory toolbox, taking pride of place alongside the Clinometer, logger’s tape, recording equipment (and sandwiches!)."
        },
        {
            "heading": 3,
            "text": "The case"
        },
        {
            "text": "In this landmark case, an area of Ancient Woodland was felled in 2018 at Burley’s Wood in Crawley, West Sussex, for suspected development reasons. A Section 17A Restocking Notice and subsequent Enforcement Notice were issued to the company responsible for the felling who then sold the land to Stables Farm Park Ltd."
        },
        {
            "text": "Evidence unearthed during the investigation revealed that Stables Farm Park Ltd knew about the Enforcement Notice when they acquired the land but chose to ignore it. As such we served a further Enforcement Notice on them. They did not comply with the Notice and left the site in a devastated state."
        },
        {
            "text": "Ultimately Stables Farm Park Ltd pleaded guilty to the offence after excuses they made were rebutted."
        },
        {
            "text": "Working together, the National Enforcement team and Regulations Manager were able to make an application to the court through Defra Investigation Services for a court Restocking Order to be granted."
        },
        {
            "text": "We explained that the order was required to reinstate the area to woodland, that it was complaint with the UK Forestry Standard (UKFS) and was the right thing for the local and national community."
        },
        {
            "text": "As well as the restocking order being granted the defendant was also ordered to pay costs and a fine totalling £5,000 by the court."
        },
        {
            "heading": 3,
            "text": "What else does this news mean?"
        },
        {
            "text": "Well, not only can this site now not be developed, but the offender’s wallet has been significantly impacted. They’ve incurred the fine, along with having to pay hefty legal costs along with now needing to pay the planting and maintenance costs."
        },
        {
            "text": "For what?? It really wasn’t worth buying that land to develop."
        },
        {
            "text": "Other positive changes made to the Forestry Act 1967 in January 2023 mean that Section 17A Restocking Notices and Section 24 Enforcement Notices are now Local Land Charges. This means that any conveyancer worth their salt will inform prospective purchasers that such a Notice is present on the land – perhaps influencing whether they want to buy the land, or the price that they want to offer for it."
        },
        {
            "text": "Coupled with the above, Section 24 Enforcement Notices can also now be issued to the next estate or interest holder if the land is sold during the life of the Notice – ensuring that we get those trees back in the ground."
        },
        {
            "text": "All of the measures mentioned serve as a real deterrent to others thinking of making a quick profit through illegal felling."
        }
    ]
}