{
    "url": "https://medregs.blog.gov.uk/2024/02/13/med-tech-regulatory-reform-the-first-steps-towards-a-new-framework-for-medical-devices-in-the-uk/",
    "title": "Med Tech Regulatory Reform: The first steps towards a new framework for medical devices in the UK",
    "authors": [
        "Laura Squire"
    ],
    "categories": [
        "Med Tech Regulations",
        "Medical Devices"
    ],
    "pub_date": "2024-02-13T16:34:01+00:00",
    "content": [
        {
            "text": "On 9 January 2024, the Medicines and Healthcare products Regulatory Agency (MHRA) published its Roadmap for the delivery of the future regulatory framework for medical devices. In the first of a new blog series, Laura Squire, Med Tech Regulatory Reform Lead and Chief Officer Healthcare, Quality and Access, shares an update on the MHRA’s progress towards implementing the regulatory changes set out in the Roadmap."
        },
        {
            "text": "It’s a privilege to lead the MHRA's work on reforming our regulatory framework for medical devices, taking advantage of the opportunities presented to us as a sovereign regulator."
        },
        {
            "text": "The aim of this work is to create a framework which is responsive to the needs of new technologies, strengthens patient safety and provides the certainty and clarity that manufacturers need to bring their products to the UK market."
        },
        {
            "text": "We already have a regulatory framework for medical devices in the UK - The Medical Devices Regulations 2002 (as amended). Under those regulations, it’s possible, now, to apply through a UK Approved body, to get a UKCA marking for a medical device."
        },
        {
            "text": "The changes we’re making will update those regulations. The legal permission to do this comes from the Medicines and Medical Devices Act 2021, and that requires us to do certain things, including undertaking a full public consultation on the changes we plan to make. These changes must then be debated in both the House of Commons and the House of Lords before they’re made law."
        },
        {
            "text": "On 9 January we published a Roadmap to give more visibility of how we’re progressing in making those regulatory changes. There’s an element of it which is looking in the rear view mirror, and it shows the public consultation undertaken in 2021 and in 2022, the publication of the government response, which set out the changes we intend to make."
        },
        {
            "text": "Those changes are extensive, and since 2022, we’ve strengthened the team through the recruitment of team members with industry and policy backgrounds, and they’ve been working to define the detail that’s needed to turn our intentions into law and instruct lawyers through the process of creating legal text."
        },
        {
            "text": "We’ve divided the work up into a several statutory instruments (SIs), including one we put in place last summer to give transition provisions a legal footing and one which has been debated in the last month involving the application of In Vitro Diagnostic Regulation (IVDR) to Northern Ireland."
        },
        {
            "text": "As you’ll see from the Roadmap, our next major SI will strengthen requirements for vigilance and the surveillance of products once they’re on the market. The draft legal text of this Post Market Surveillance (PMS) SI has already been published."
        },
        {
            "text": "We learned a lesson from the publication of the text for PMS. We know that regulations only work if the regulated sector understands them and can practically implement them. Last year we ran a number of workshops exploring the detail for the proposed PMS rules, seeking to understand what the guidance needs of industry might be. Despite this, the response to the publication of the legal text raised issues we had not come up in those sessions."
        },
        {
            "text": "The approach set out in the Roadmap is our commitment to working even more closely with stakeholders to make sure that the links between what we said we’d do in 2022 and the detailed positions are clear, that any concerns about them are dealt with before we formally publish draft legal text and most importantly, that stakeholders know what’s coming and can start to prepare."
        },
        {
            "text": "After PMS will be a SI to put in place what we’re referring to as our 'Core' regulations - updating the fundamentals like scope, classification, some of the requirements for economic operators as well as the requirements for quality management systems. For some of these, for instance clinical investigations, a lot of the changes we’re making are already happening as best practice. For others, such as International Recognition, this is not something we’ve done before."
        },
        {
            "text": "The Roadmap commits to stakeholder discussions on a number of issues, and we started, on 26 January, with a full day discussion on International Recognition, working through our draft proposals for a risk-based system where products that have gone through a full, rigorous assessment by a regulator with comparable standards, such as the FDA, would be subject to minimal checks before being allowed onto the UK market but importantly, required to comply with UK PMS requirements."
        },
        {
            "text": "Some of the stakeholder engagement we’re doing, including the most recent one on International Recognition, will be under 'trusted advisor' principles, an arrangement we’ve come to whereby we can work openly to get the views of stakeholders, to inform our policy development. This blog series is a way of keeping a wider audience informed with how those sessions are going. Some sessions, however, are more open, and we’ve been delighted with the response to the webinar we’re planning on 5 March on Scope, Classification and Essential requirements."
        },
        {
            "text": "One of the things I’m really proud of is shown in only one place in the Roadmap – It’s the continued work to designate new Approved Bodies. We announced in August the doubling of UK capacity and at the end of January we increased that capacity still further. We also wanted to make sure we included in the Roadmap the progress we’re making on clarifying the requirements for developers of Software as a Medical Device. These are all ways in which we’re contributing to the creation of a UK environment innovators want to come to, which will benefit UK patients."
        },
        {
            "text": "I’d like 2024 to be a year of transparency. This blog series is part of that and as we work through to deliver our Roadmap, there will be more. Our priority is patient safety and we know we need to work in partnership with our stakeholders to achieve that."
        }
    ]
}