{
    "url": "https://dluhcmedia.blog.gov.uk/2024/02/13/michael-gove-sets-out-planning-measures-to-build-on-long-term-plan-for-housing/",
    "title": "Michael Gove sets out planning measures to build on long-term plan for housing",
    "authors": [
        "dluhcpress"
    ],
    "categories": [
        "Housing"
    ],
    "pub_date": "2024-02-13T12:09:50+00:00",
    "content": [
        {
            "text": "There has been widespread coverage across national papers and broadcasters about our package of housing announcements. This includes a ‘brownfield first’ approach delivering new homes and changes to Permitted Development Rights to empower people to extend their homes outwards and upward."
        },
        {
            "text": "The Times ran a splash today which leads on the Prime Minister’s pledge to build more homes in the right places, driving through plans to ‘put rocket boosters’ under construction in areas that are already built up. The paper reports that shops, offices and other commercial buildings will be able to be converted into homes without full planning permission, and the changes would result in tens of thousands of homes being built in England’s 20 biggest urban areas each year. It goes further to say that urban councils that are not meeting housing targets will be told they can refuse planning permission on brownfield land only in exceptional circumstances."
        },
        {
            "text": "Elsewhere, The Daily Telegraph, The Daily Express and The Financial Times all report on the overhaul of planning rules, saying this is designed to protect the Green Belt while boosting housebuilding on used land across England. All councils will be told to prioritise brownfield developments wherever possible to deliver more homes for local communities. There is also mention of proposed changes for millions of homeowners being able to build bigger extensions and loft conversions without needing permission."
        },
        {
            "text": "Positive stakeholder reaction from Barratt Developments is covered in The Guardian where they welcomed the measures which will make it easier to get planning permission for brownfield regeneration."
        },
        {
            "text": "The announcement also ran on morning news bulletins, including GB News and BBC Radio 4’s Today Programme, reiterating that new measures will make it harder for councils to refuse planning to build new homes on sites that were previously developed brownfields."
        },
        {
            "text": "Housing Secretary Michael Gove said:"
        }
    ]
}