{
    "url": "https://ruralpayments.blog.gov.uk/2024/02/13/mind-your-head-2024/",
    "title": "Mind Your Head 2024",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Support"
    ],
    "pub_date": "2024-02-13T15:52:05+00:00",
    "content": [
        {
            "text": "This week, 12-16 February 2024, is the Farm Safety Foundation’s (Yellow Wellies) seventh annual Mind Your Head campaign."
        },
        {
            "text": "Yellow Wellies is an independent registered charity covering the whole of the UK, set up in 2014 to raise awareness of farm safety and mental health among young farmers aged 16-40 across the UK."
        },
        {
            "text": "Last year we shared information on the Mind Your Head campaign as we recognise the many challenges facing farming communities, and the impact these can have on mental health. It saddens us to see and hear that financial pressures, including access to subsidies and grants, continue to be a contributing factor and one we’d like to help people overcome."
        },
        {
            "text": "We’re in a period of agricultural transition and thinking about the future can be overwhelming so it’s tempting to put off making decisions. We’d urge anyone who hasn’t yet considered it, to take a look at the Funding for farmers and land managers page on GOV.UK, which sets out the schemes and grants that are available now."
        },
        {
            "text": "Farmers and land managers who currently receive direct payments can also benefit from Defra’s Farming Resilience Fund. The fund provides free expert business advice, delivered by third party organisations who are trusted in the farming community, to farmers who may need help adapting to the changes during the agricultural transition. Supporting mental health and wellbeing is one of the key objectives of this fund."
        },
        {
            "text": "Defra also funds the Farming Advice Service, which provides free, confidential advice both in person and over the phone to help farmers and land managers in England understand farming policy and their legal requirements."
        },
        {
            "text": "We know that an increase in flooding, drought, and heatwaves in recent years has had huge consequences for those whose lives and livelihoods depend on the land. We understand that in these cases, letting us know of the impact of severe weather is yet another thing to think about when dealing with difficult situations. To make this easier we’ve now linked our extreme weather guidance to the RPA GOV.UK homepage, in the hope this will free up time for more pressing tasks."
        },
        {
            "text": "We’re proud to support the Mind Your Head campaign and to work with many farming welfare organisations that advocate for mental health, to understand how we can better support the rural communities we serve."
        },
        {
            "text": "We would like those who use our schemes and services to feel they can come to us if there is an issue, and that we will do our best to resolve it. We have people on the ground at events across the country who are always happy to talk, and the Defra Rural Services helpline is open 8:30am - 5pm, Monday to Friday."
        },
        {
            "text": "Yellow Wellies has a range of resources on its website including The Little Book of Minding Your Head which has a list of support organisations and charities at the back, if you need someone to talk to about how you are feeling."
        },
        {
            "text": "If you have social media, you can follow the Farm Safety Foundation on Instagram, Facebook, or Twitter @yellowwelliesuk."
        },
        {
            "text": "#MindYourHead"
        },
        {
            "text": " "
        }
    ]
}