{
    "url": "https://socialworkwithadults.blog.gov.uk/2024/02/13/moving-social-work-it-means-what-it-says/",
    "title": "Moving Social Work: it means what it says!",
    "authors": [
        "Professor Brett Smith",
        "Amarjit Randhawa"
    ],
    "categories": [
        "Co-production",
        "Communities",
        "Knowledge and skills",
        "Viewpoint"
    ],
    "pub_date": "2024-02-13T13:06:21+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Equality of opportunity"
        },
        {
            "text": "Modern social work is many things, but one of its central tenets involves the belief that everyone should have access to the same opportunities to live full, active, healthy lives, regardless of circumstance and background."
        },
        {
            "text": "In this spirit, the Moving Social Work (MSW) programme aims to harness the skills and values of social workers to support the health, wellbeing and human rights of people with disabilities."
        },
        {
            "text": "MSW focuses on increasing physical activity and the benefits this generates for mind and body, actively creating resources and co-produced strategies for new and established social workers to deploy as part of their practice."
        },
        {
            "text": "Our research shows disabled people want to have more conversations about physical activity with health and social care professionals, including social workers. Why this group specifically? Because they are trusted."
        },
        {
            "text": "They are trusted because they are empathic, a reliable source of information and knowledgeable of individual circumstances. They also tend to spend more time with the people they support and are best placed to advocate for the upholding of their human rights. That said, conversations in relation to improving physical activity can be lacking."
        },
        {
            "heading": 2,
            "text": "View from the profession"
        },
        {
            "text": "So, what do social workers think about promoting this aspect of healthier lifestyles? Our research found most believed it should be part of their role, in the context of wider efforts to promote physical health and mental wellbeing, as set out in the commitments of the Care Act 2014. They recognise it can help people become more independent, reduce loneliness, improve confidence, and mitigate trauma and substance abuse."
        },
        {
            "text": "Whilst most social workers believed conversations about physical activity should be part of their role, they said they lacked the confidence, knowledge, and skills to do this effectively and wanted training to address this. They also said it should be included in social work courses in colleges and universities."
        },
        {
            "text": "Equipped with this information, we went about creating and testing training and education materials for social workers. This was achieved through co-production, which involved widespread collaboration."
        },
        {
            "text": "For example, a group of social workers and disabled people were brought together to shape the work from start to finish. We also conducted interviews, surveys, and World Cafés (interactive workshopping, bringing a holistic range of stakeholders together to share ideas) with over 300 social workers and disabled people to understand what they wanted to see included in training and education. A strength-based approach was frequently advocated for."
        },
        {
            "text": "After co-producing the education and training, we delivered the package to over 400 students and more than 100 social workers as part of their continued professional development (CPD)."
        },
        {
            "heading": 2,
            "text": "Putting it into practice"
        },
        {
            "text": "Having completed their training, our evaluation found social workers reported improved confidence, knowledge, and skills when discussing physical activity with those they were supporting."
        },
        {
            "text": "These enhanced skills were not only a good way to help prevent poor health, but also provided opportunities to support the empowerment of people, tackle inequalities, and promote social justice."
        },
        {
            "text": "For example, social workers were better able to support disabled young people to challenge discrimination which prevented them accessing spaces to play sport or move freely in. Thanks to these interventions, disabled young people reported their confidence, self-esteem, and sense of power and control over their lives had improved."
        },
        {
            "text": "Social workers talked to them about using personal budgets to access dance classes which, in turn, could help them make new friends and feel part of a community. This approach also proved effective when helping individuals find ways to deal with their substance and alcohol issues."
        },
        {
            "text": "Research also found social workers were interested in the benefits of physical activity for themselves. For example, they talked about the value of ‘walking meetings’ for their own health and wellbeing. It’s a win/win for both sides!"
        },
        {
            "text": "Moving Social Work is embedded in the Government Disability Strategy (2021) as well as the Department of Health and the Department for Culture, Media and Sport’s Get Active: a strategy for the future of sport and physical activity (2023-2027)."
        },
        {
            "text": "We are currently creating a programme to roll Moving Social Work out nationally, in universities, county councils, the NHS and elsewhere in the health and care sector. If you’d like free physical activity training and education to support wellbeing, promote social justice and tackle health inequalities, or want to more, please do contact us!"
        }
    ]
}