{
    "url": "https://space.blog.gov.uk/2024/02/13/six-months-is-not-a-long-time-in-space/",
    "title": "Six months is not a long time in space",
    "authors": [
        "Chris White-Horne"
    ],
    "categories": [
        "Careers",
        "People",
        "Recruitment"
    ],
    "pub_date": "2024-02-13T15:22:56+00:00",
    "content": [
        {
            "heading": 4,
            "text": "Six months into the role of Deputy CEO, as jobshare with Annelies Look, Chris White-Horne looks back on their time at the UK Space Agency so far."
        },
        {
            "text": "I imagine time flies for the astronauts on the International Space Station. It certainly has for Annelies and me since we began as jobshare Deputy CEO at the UK Space Agency. The view out of our windows will never beat that from the space station, the first six months of our journey in space have had plenty of highlights. "
        },
        {
            "text": "The beauty of jobshare is that we really can be in two places at once! In our first week I was the most northerly person in the British Isles seeing progress building the Saxavord spaceport in Shetland. Meanwhile Annelies was at Edinburgh’s Higgs Innovation Centre celebrating the world-class academics who have given the UK a leading role in the LISA and Euclid missions.   "
        },
        {
            "text": "We then met the Scottish Minister for small business and innovation and heard his commitment to building a space economy in Scotland. Inspirational small Scottish companies told us about how they are forging new markets in space. The week was a lovely illustration of the truly national space effort that we had just joined. "
        },
        {
            "text": "It has gone on from there. "
        },
        {
            "text": "The MOU with Axiom Space lays the path towards a commercially-sponsored UK astronaut mission which will carry out important scientific research and help develop new technologies. Rejoining Copernicus puts the UK back at the heart of international Earth observation. The National Space Conference in Belfast attracted over 1500 attendees from around the world. We invested £47 million to help build the infrastructure to make products mission-ready. Inside the Agency we’re transforming how we operate so that we focus relentlessly on doing the right things, doing things right and providing the leadership and support the UK space sector needs to thrive. "
        },
        {
            "text": "What has surprised me most in our first six months? I have been very struck by the importance of sustainability in space and that this is not more widely recognised. Before joining the Agency I was only dimly aware of the dangers and risks. I suspect I am not alone. This is a field where the UK can show global thought leadership. And UK companies are innovating and pushing the boundaries of technology, for example as we take the next steps towards active debris removal. "
        },
        {
            "text": "Thank you to all of you across the sector who have made us feel welcome and in particular for embracing our jobshare. In the competition for talent the space sector needs to be an innovative employer. So I re-issue the challenge I gave industry, government and academia at the sector at the Appleton Space Conference last year. Where are your jobshares at board level and across your organisations? Let us know how we can help you. "
        },
        {
            "text": "After six months – and unlike the astronauts on the ISS – Annelies and I are staying in space. We’re excited about the journey ahead and working together with you to boost UK prosperity, understand the universe and protect our planet and outer space. "
        },
        {
            "text": "Thank you for being part of our journey so far. "
        }
    ]
}