{
    "url": "https://defrafarming.blog.gov.uk/2024/02/13/spotlight-on-updates-and-additions-to-livestock-and-grassland-offer/",
    "title": "Spotlight on updates and additions to livestock and grassland offer",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Countryside Stewardship",
        "environmental land management schemes",
        "Payments to improve animal health and welfare",
        "Sustainable Farming Incentive"
    ],
    "pub_date": "2024-02-13T13:16:26+00:00",
    "content": [
        {
            "text": "Over the past few weeks, we've summarised the updates to our environmental land management offer by farm type."
        },
        {
            "text": " These posts follow last month's Agricultural Transition Plan update."
        },
        {
            "text": "In this post, we’ll focus on the offer for livestock and grassland farmers. "
        },
        {
            "heading": 2,
            "text": "Updates and additions "
        },
        {
            "text": "There are 29 existing Sustainable Farming Incentive (SFI) and Countryside Stewardship (CS) actions that have a duration of up to 3 years. "
        },
        {
            "text": "We will introduce a further 16  new actions with a 3-year duration. We're exploring whether we can offer a further 41 existing CS actions as 3-year actions, including to make them more accessible to tenant farmers. "
        },
        {
            "text": "We plan to review all actions and prices on a rolling basis. "
        },
        {
            "text": "Livestock and grassland farmers will also be able to access around 35 of the 50 new actions we’re adding to the offer. This is outlined in the Technical Annex to the Agricultural Transition Plan update. "
        },
        {
            "text": "As part of our review of payments, we looked at the balance of prices between ‘creation’ actions and ‘maintenance’ actions in relation to some specific grassland habitat actions, for example species-rich grasslands. "
        },
        {
            "text": "Historically, we paid higher prices for actions involving creating or restoring habitats and features and lower prices to maintain them. "
        },
        {
            "text": "Farmers and land managers told us that they feel that those who have already undertaken creation or restoration activities are disadvantaged. "
        },
        {
            "text": "So, we’re re-balancing the payments for ‘creation’ and ‘maintenance’ actions, in particular, for grassland habitats, so that those who have already made changes are not disadvantaged.  "
        },
        {
            "text": "For example, on 1 January 2024, the price for maintaining species rich grassland will increase from £182 to £646 per hectare (ha). "
        },
        {
            "text": "Moving forward, we will pay for the cost of creating a grassland habitat in full, up front, as a separate capital grant offer. This will enable us to increase regular payments, as above. "
        },
        {
            "text": "You can read more about the rationale behind this in the Agricultural Transition Plan update, under the section, ‘Paying consistently for both creation and maintenance actions’. "
        },
        {
            "heading": 2,
            "text": "Improvements to the free vet visit offer "
        },
        {
            "text": "Through the Sustainable Farming Incentive, keepers of pigs, sheep, and cattle can apply for a free vet visit. This is known as the Annual Health and Welfare Review."
        },
        {
            "text": "You can get funding for a vet or team chosen by a vet to visit your farm and carry out a health and welfare review of eligible livestock whenever it suits you. Thousands of farmers have already applied to benefit from a vet visit and tests. "
        },
        {
            "text": "It’s quick to apply, and the review is flexible so you and your vet can decide what the health and welfare priorities are for your farm. "
        },
        {
            "text": "Those who don’t receive Basic Payment Scheme payments (BPS) can now apply. We will continue to roll this offer out, widening it so that reviews can cover multiple species (such as beef cattle and sheep) and multiple herds or flocks. "
        },
        {
            "text": "Our intent is that this is a time-limited offer for 3 years. We will evaluate the effectiveness of the review and consult on the need for further regulation in the future. "
        },
        {
            "heading": 2,
            "text": "More grant funding available "
        },
        {
            "text": "Livestock and grassland farmers will be eligible for a number of grants this year, including the Farming Equipment and Technology Fund (currently closed for applications), Farming Transformation Fund and the Improving Farm Productivity grant. The second round of the Improving Productivity grant is now open."
        },
        {
            "text": "In 2023, we launched the first dedicated animal health and welfare grants through the Farming Investment Fund. We awarded nearly £20 million to approximately 3,400 livestock farmers to purchase equipment and technology to improve animal health and welfare on-farm, such as better handling equipment.  "
        },
        {
            "text": "We also opened applications for the first of our animal health and welfare infrastructure grants. These will help farmers upgrade their livestock housing, with £10 million made available in 2023 for new or upgraded calf housing, including funding for rooftop solar installation.   "
        },
        {
            "text": "In 2024, more sectors will benefit from infrastructure grants to improve animal health and welfare, with funding for poultry and cattle farmers, followed by funding for pig farmers in 2025. These are important investments to support farmers to replace old run-down buildings with those futureproofed for a changing climate and equipped with latest innovations to improve productivity. "
        },
        {
            "text": "We will soon publish a list of all the grants available in 2024. Subscribe to the blog for the latest. "
        },
        {
            "heading": 2,
            "text": "New support for endemic disease management "
        },
        {
            "text": "This year, we plan to introduce new support for endemic disease management. BVD (Bovine Viral Diarrhoea) in cattle, PRRS (Porcine Reproductive Respiratory Syndrome) in pigs and a broader sheep health approach for a range of endemic diseases and conditions. "
        },
        {
            "text": "Healthier animals produce more food, resulting in lower greenhouse emissions and less need for antibiotics.  "
        },
        {
            "text": "We expect to trial programmes to provide on-going financial support for farmers to improve their stockmanship and adopt best practices in livestock husbandry. Initially, this will focus on better environmental management to reduce stressors for finishing pigs and improved pain management for cattle during disbudding and castration. "
        },
        {
            "text": "We’ll share more information on this soon.  "
        },
        {
            "heading": 2,
            "text": "Consultation on clearer labelling "
        },
        {
            "text": "We want UK farmers to receive fair reward from the market for producing high quality, high-standard British food. "
        },
        {
            "text": "However, it can be difficult to clearly identify where food comes from and how it is produced. This is why, in the Secretary of State’s speech at the Oxford Farming Conference, he announced that we will rapidly consult on clearer labelling. "
        },
        {
            "text": "This will include exploring how we can better highlight imports that do not meet UK welfare standards and whether and how information on the origin of food should be provided in the out of home sector.  We’ll share more information on the consultation shortly. "
        },
        {
            "heading": 2,
            "text": "Learn more "
        },
        {
            "text": "We recently set up a series of monthly sector-specific webinars for farmers and we plan to host a specific webinar for livestock and grassland farmers in the months ahead, so do look out for updates here on the blog once we have a date in the diary.  "
        },
        {
            "text": "You can also take a look at the full list of actions available in the combined Sustainable Farming Incentive (SFI) and Countryside Stewardship (CS) offer in the Technical Annex to the ATP.  "
        },
        {
            "text": "Finally, you have any questions about our work, do leave a comment below. "
        },
        {
            "heading": 2,
            "text": "Apply for SFI today"
        },
        {
            "text": "You can apply for an SFI agreement now and choose from the 23 actions currently on offer. By waiting for the 2024 actions to become available, you could be losing out on money. If you apply now, you'll be able to add actions to your agreement annually - or have multiple agreements if you'd like to carry out further actions in the future.    "
        },
        {
            "text": "It’s possible to be in SFI and Countryside Stewardship at the same time if the actions are compatible and you are not being paid for the same action twice."
        },
        {
            "text": "You can get support with applying for an SFI agreement from the:"
        },
        {
            "text": "You can also get support from organisations that provide advice through the Farming Resilience Fund to help you plan for the future – this advice is free if you get BPS."
        },
        {
            "text": "Additionally, Catchment Sensitive Farming (CSF) helps farmers in England protect water, air and soil. CSF advisers can provide advice on best practices and specific SFI actions that will benefit your farm business and the environment."
        }
    ]
}