{
    "url": "https://traderemedies.blog.gov.uk/2024/02/13/working-with-us-join-the-legal-team/",
    "title": "Working with us: Join the TRA legal team",
    "authors": [
        "TRA Communications"
    ],
    "categories": [
        "Engagement",
        "HR",
        "People"
    ],
    "pub_date": "2024-02-13T15:31:44+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Applications for a Grade 6 senior trade remedies lawyer are now open and we asked one of our Junior lawyers to tell us more about the legal team and what working at the TRA is like."
        },
        {
            "text": "Being a lawyer at the TRA will be different to what you are used to or would expect compared to being a lawyer elsewhere. You might think it is public sector government work and so works just like the civil service. Or you might think that it is not a government department and therefore might follow an in-house style of work. It is neither."
        },
        {
            "text": "The TRA is dynamic, in the way a new start-up might be described as dynamic. There are always new legal challenges arising in very complex areas. The legal team grapples with domestic, public and international World Trade Organisation law all at the same time to meet these challenges head on. "
        },
        {
            "text": "There are also opportunities for legal work on policy and governance, which will shape the legal framework we use. These new laws are yet to be tested in courts or tribunals, so the litigation work is something I am really looking forward to. "
        },
        {
            "text": "I enjoy working in case teams on trade remedy investigations where I get to advise and work with a multi-disciplined professional team of investigators, accountants, economists, analysts, policy professionals and others. The cases are often high profile and deal with industries such as energy, steel and ceramics that get reported in the media. Variations also apply to the kinds of goods we work with. I have recently enjoyed working on a case involving e-bikes, an industry that seems to be ever-growing! It’s interesting to learn about the products and industries that we work on. "
        },
        {
            "text": "I also particularly enjoy the networking aspect, building relationships with lawyers in other parts of the world, sharing ideas and having in-depth discussions on the future landscape of what is a challenging, fast paced and globally significant area of law. We have held widely celebrated trade forums in London with a number of brilliant thinkers in the Trade space sharing their thoughts on what is to come. A highlight for me has been getting to know legal experts in the trade world at the annual European Trade Defence conference in Brussels and building relationships with trade experts from all over the world at the World Trade Institute in Bern.  "
        },
        {
            "text": "Closer to home, it has been interesting working with government departments to make sure that everyone is talking to each other, and our policies are not isolated from what is practically possible. Having fascinating conversations with the Department for Business and Trade, HMRC, HMT and others on very political and topical points provides perspective for where the TRA sits in the big picture.  "
        },
        {
            "text": " "
        },
        {
            "text": "We are a relatively small legal team that integrates well in the organisation and have good opportunity to become technical experts in a field that is developing and growing rapidly in the UK."
        },
        {
            "heading": 4,
            "text": "To learn more about the role and apply head to Civil Service Jobs"
        },
        {
            "heading": 4,
            "text": "To arrange an informal 1-2-1 chat with our Chief Counsel, Clare Brodie, please email angelica.wright@traderemedies.gov.uk"
        }
    ]
}