{
    "url": "https://publicguardian.blog.gov.uk/2024/02/13/your-questions-answered-using-your-lpa/",
    "title": "Your questions answered: Using your LPA",
    "authors": [
        "rebeccaparker1"
    ],
    "categories": [
        "FAQs",
        "lasting power of attorney",
        "LPA",
        "Your questions answered"
    ],
    "pub_date": "2024-02-13T10:15:39+00:00",
    "content": [
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "text": "We receive thousands of phone calls each week from people looking for help and information on the lasting power of attorney (LPA) process. This blog series answers your questions by breaking down the different stages of your LPA journey. Here we look at common questions about using your LPA. See also:"
        },
        {
            "heading": 3,
            "text": "Completing forms"
        },
        {
            "text": "includes signing forms in order"
        },
        {
            "heading": 3,
            "text": "Payments and fees"
        },
        {
            "text": "includes cheques and applying for remissions and exemptions "
        },
        {
            "heading": 3,
            "text": "Attorneys, witnesses and certificate providers"
        },
        {
            "text": "includes making a start and who to involve"
        },
        {
            "heading": 3,
            "text": "Reporting and making changes to your LPA"
        },
        {
            "text": "includes reporting a death and changing address "
        },
        {
            "text": " "
        },
        {
            "text": "In this video we explain the codes and reference numbers associated with your lasting power of attorney (LPA). We cover, reference numbers, activation keys and access codes. You'll need these to use the online service 'use an LPA'. "
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "I’ve completed my LPA documents, sent them in, and have received two letters with different reference numbers. Why is this? "
        },
        {
            "text": "If you have created a health and welfare LPA and a property and finance LPA you will have been sent a separate reference number for each one. The reference numbers for each LPA will be different. Both forms have lots of similar information and it may seem like a duplication, so we advise you check which reference number is for which LPA. "
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "I have just received my LPA registration letter, what does my activation key mean?  "
        },
        {
            "text": "Your activation key is a one-time code for adding a summary of your LPA to your online account that you can then share with third parties by creating access codes to give them. This is entirely optional. If you wish to set this up, please visit www.gov.uk/use-lpa. Your key will expire after 12 months but you can request a replacement on the website. "
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "How do I get a new activation key?   "
        },
        {
            "text": "Log into ‘Use an LPA’ and follow the steps to Add your LPA. Follow the on-screen instructions, selecting “No, I do not have an activation key” or “I have an activation key, but it has expired.” We will then send you a letter with your new activation key once we have processed your request. "
        },
        {
            "heading": 3,
            "text": " "
        },
        {
            "heading": 3,
            "text": "My address has changed. Can I still request a new activation key?   "
        },
        {
            "text": "Log into ‘Use an LPA’ www.gov.uk/use-lpa and follow the steps to Add your LPA. Follow the on-screen instructions, selecting “No, I do not have an activation key” or “I have an activation key, but it has expired.” When entering your details, please enter your new address. We will then contact you to confirm the changes and send out a new key once the new address has been confirmed. "
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "I’ve been asked to provide a V-Code or Access code. How do I do this? "
        },
        {
            "text": "Once your LPA has been added to your online account, you will see an option that allows you to give an organisation access. Follow the instructions on screen and you will be able to generate access codes starting with a V. Each code is valid for 30 days. "
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "I have been given an access code starting with a V. How do I view the LPA? "
        },
        {
            "text": "Access codes are specific to each organisation or person the donor chooses to share their LPA details with. Each access code lasts 30 days. To view the LPA go to www.gov.uk/view-lasting-power-of-attorney. You’ll then be prompted to enter the donor's last name and input the access code you received.   "
        },
        {
            "heading": 3,
            "text": " "
        },
        {
            "heading": 3,
            "text": "I need a copy of my LPA. How do I get one?  "
        },
        {
            "text": "You or your attorney can use a certified copy to register your LPA if you do not have the original form. "
        },
        {
            "text": "A solicitor or notary can also certify copies of the LPA - they charge a fee for this. "
        },
        {
            "text": "Visit https://www.gov.uk/power-of-attorney/certify for more information on how to certify a copy of a lasting power of attorney. "
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "I have lost my LPA and need a new copy? "
        },
        {
            "text": "Office copies are available in exceptional circumstances only, they cost £35 for an LPA, and £25 for an Enduring Lasting Power of Attorney (EPA).   "
        },
        {
            "text": "You can email your request to opg_office_copy@publicguardian.gov.uk. Please include the reason, the donor’s full name and date of birth, the reference number (if known), your name, your role on the LPA or EPA, and a telephone number so we can call to take a payment.  "
        },
        {
            "text": "Alternatively, you can call the office copies team on 0300 456 0300, selecting option 2 followed by option 2 again. The team is available from Monday to Friday between 9.30am and 3.30pm (Mon-Fri 09:30-15:30).  "
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "When can my attorneys act for me? "
        },
        {
            "text": "For a health and welfare LPA, your attorney can only act for you once you’ve lost the mental capacity to make your own decisions.  "
        },
        {
            "text": "For a property and financial affairs LPA, with your permission as stated in the document, your attorney can step in and help you with decision making before you lose mental capacity. For this to happen, you will need to select this as an option when you make the LPA. "
        },
        {
            "text": "When your attorneys act on your behalf, they’re bound by the principles of the Mental Capacity Act 2005. "
        },
        {
            "heading": 3,
            "text": "How can I find out if someone has a registered LPA or Deputyship? "
        },
        {
            "text": "You will need to complete an OPG100 search request form. Details can be found on our GOV.UK page. We aim to respond to all requests within 15 working days. "
        },
        {
            "text": " "
        },
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "text": "Rydyn ni’n cael cannoedd o alwadau ffôn bob wythnos gan bobl sy’n chwilio am help a gwybodaeth ynghylch llawer o wahanol bethau. Mae’r gyfres hon o flogiau’n ateb eich cwestiynau drwy ddadansoddi gwahanol gamau eich taith Atwrneiaeth Arhosol."
        },
        {
            "text": "Yma rydym yn edrych ar gwestiynau cyffredin ynghylch defnyddio eich LPA. Gweler hefyd:"
        },
        {
            "heading": 3,
            "text": "Llenwi ffurflenni"
        },
        {
            "text": "yn cynnwys llofnodi ffurflenni mewn trefn"
        },
        {
            "heading": 3,
            "text": "Taliadau a ffioedd"
        },
        {
            "text": "yn cynnwys sieciau a gwneud cais am ostyngiadau ac esemptiadau"
        },
        {
            "heading": 3,
            "text": "Atwrneiod, tystion a darparwyr tystysgrif"
        },
        {
            "text": "Mae’n cynnwys dechrau arni a phwy i’w gynnwys"
        },
        {
            "heading": 3,
            "text": "Adrodd a gwneud newidiadau i’ch LPA"
        },
        {
            "text": "Yn cynnwys rhoi gwybod am farwolaeth a newid cyfeiriad"
        },
        {
            "text": " "
        },
        {
            "text": "Yn y fideo hwn rydym yn egluro’r codau a’r cyfeirnodau sy’n gysylltiedig â’ch atwrneiaeth arhosol (LPA). Rydym yn cynnwys cyfeirnodau, allweddi ysgogi a chodau mynediad Bydd angen y rhain arnoch i ddefnyddio’r gwasanaeth ar-lein ‘defnyddio LPA’."
        },
        {
            "heading": 3,
            "text": "Rwyf wedi cwblhau fy nogfennau LPA, wedi eu hanfon atoch, ac wedi cael dau lythyr gyda chyfeirnodau gwahanol. Pam hynny?"
        },
        {
            "text": "Os ydych chi wedi creu atwrneiaeth arhosol iechyd a lles ac atwrneiaeth arhosol eiddo a chyllid, byddwch wedi cael cyfeirnod ar wahân ar gyfer pob un. Bydd cyfeirnod pob LPA yn wahanol. Mae gan y ddwy ffurflen lawer o wybodaeth debyg a gallai ymddangos fel dyblygu, felly rydyn ni’n eich cynghori i wirio pa gyfeirnod sydd ar gyfer pa LPA."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Rydw i newydd dderbyn llythyr cofrestru fy LPA, beth mae'r allwedd cadarnhau yn ei olygu?"
        },
        {
            "text": " Mae eich allwedd cadarnhau yn god untro ar gyfer ychwanegu crynodeb o’ch atwrneiaeth arhosol at eich cyfrif ar-lein. Gallwch wedyn ei rannu â thrydydd partïon drwy greu codau mynediad i'w rhoi iddyn nhw. Mae hyn yn gwbl ddewisol. Os hoffech chi wneud hyn, ewch i www.gov.uk/use-lpa. Bydd eich allwedd yn dod i ben ar ôl 12 mis ond gallwch wneud cais am un arall ar y wefan."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Sut mae cael allwedd ysgogi newydd?  "
        },
        {
            "text": "Mewngofnodwch i ‘Defnyddio Atwrneiaeth Arhosol’ a dilynwch y camau i Ychwanegu eich Atwrneiaeth Arhosol. Dilynwch y cyfarwyddiadau ar y sgrin, gan ddewis “Na, does gen i ddim allwedd ysgogi” neu “Mae gen i allwedd ysgogi, ond mae wedi dod i ben.” Byddwn wedyn yn anfon llythyr atoch gyda'ch allwedd ysgogi newydd ar ôl i ni brosesu eich cais."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Mae fy nghyfeiriad wedi newid. Ydw i'n dal i allu gofyn am allwedd ysgogi newydd?  "
        },
        {
            "text": "Mewngofnodwch i ‘Defnyddio Atwrneiaeth Arhosol’ LPA dilynwch y camau i Ychwanegu eich Atwrneiaeth Arhosol. Dilynwch y cyfarwyddiadau ar y sgrin, gan ddewis “Na, does gen i ddim allwedd ysgogi” neu “Mae gen i allwedd ysgogi, ond mae wedi dod i ben.” Wrth roi eich manylion, rhowch eich cyfeiriad newydd. Byddwn wedyn yn cysylltu â chi i gadarnhau’r newidiadau ac i anfon allwedd newydd atoch ar ôl i’r cyfeiriad newydd gael ei gadarnhau."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Gofynnwyd i mi ddarparu Cod Mynediad neu God V. Sut mae gwneud hyn? "
        },
        {
            "text": "Ar ôl i’ch atwrneiaeth arhosol gael ei hychwanegu at eich cyfrif ar-lein, byddwch yn gweld opsiwn sy’n caniatáu i chi roi mynediad i sefydliad. Dilynwch y cyfarwyddiadau ar y sgrin a byddwch yn gallu cynhyrchu codau sy’n dechrau gyda V. Mae pob cod yn ddilys am 30 diwrnod."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Rydw i wedi cael cod mynediad sy’n dechrau gyda V. Sut ydw i’n gweld yr atwrneiaeth arhosol?"
        },
        {
            "text": "Mae codau mynediad yn benodol i bob sefydliad neu berson y mae’r rhoddwr yn dewis rhannu manylion ei atwrneiaeth arhosol ag ef. Mae pob cod mynediad yn para 30 diwrnod. I weld yr atwrneiaeth arhosol ewch i www.gov.uk/view-lasting-power-of-attorney. Yna gofynnir i chi roi cyfenw'r rhoddwr a mewnbynnu'r cod mynediad a gawsoch."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Mae angen copi o’m LPA arnaf. Sut mae cael un? "
        },
        {
            "text": "Gallwch chi neu eich atwrnai ddefnyddio copi ardystiedig i gofrestru eich LPA os nad yw’r ffurflen wreiddiol gennych."
        },
        {
            "text": "Gall cyfreithiwr neu notari hefyd ardystio copïau o’r atwrneiaeth arhosol - maent yn codi ffi am hyn."
        },
        {
            "text": "Mae rhagor o wybodaeth am sut i ardystio copi o atwrneiaeth arhosol ar gael yma."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Rydw i wedi colli fy Atwrneiaeth Arhosol ac angen copi newydd?"
        },
        {
            "text": "Dim ond mewn amgylchiadau eithriadol y mae copïau swyddfa ar gael, maent yn costio £35 am Atwrneiaeth Arhosol, a £25 am Atwrneiaeth Barhaus."
        },
        {
            "text": "Gallwch anfon eich cais at opg_office_copy@publicguardian.gov.uk. Cofiwch gynnwys y rheswm, enw llawn a dyddiad geni’r rhoddwr, y cyfeirnod (os ydych yn ei wybod), eich enw, eich rôl mewn perthynas â’r Atwrneiaeth Arhosol/\nAtwrneiaeth Barhaus, a rhif ffôn er mwyn i ni allu ffonio i gael taliad."
        },
        {
            "text": "Fel arall, gallwch ffonio’r tîm copïau yn y swyddfa ar 0300 456 0300, gan ddewis opsiwn 2 ac yna opsiwn 2 eto. Mae’r tîm ar gael o ddydd Llun i ddydd Gwener rhwng 9.30am a 3.30pm (Llun-Gwener 09:30-15:30)."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Pryd fydd fy atwrneiod yn cael gweithredu ar fy rhan?"
        },
        {
            "text": "Ar gyfer atwrneiaeth arhosol iechyd a lles, dim ond ar ôl i chi golli’r galluedd meddyliol i wneud eich penderfyniadau eich hun y bydd eich atwrnai yn cael gweithredu ar eich rhan."
        },
        {
            "text": "Ar gyfer atwrneiaeth arhosol ariannol ac eiddo, gyda’ch caniatâd fel y nodwyd yn y ddogfen, gall eich atwrnai gamu i mewn a’ch helpu i wneud penderfyniad cyn i chi golli eich galluedd meddyliol. Er mwyn i hyn ddigwydd, bydd angen i chi ddewis hwn fel opsiwn pan fyddwch yn gwneud yr atwrneiaeth arhosol."
        },
        {
            "text": "Pan fydd atwrneiod yn gweithredu ar eich rhan, maen nhw’n rhwym wrth egwyddorion y Ddeddf Galluedd Meddyliol 2005."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Sut mae cael gwybod os oes gan rywun Ddirprwyaeth neu Atwrneiaeth Arhosol gofrestredig?"
        },
        {
            "text": "Bydd angen i chi lenwi ffurflen gais chwilio OPG100. Mae manylion ar gael ar ein tudalen GOV.UK. Byddwn yn ceisio ymateb i bob cais cyn pen 15 ddiwrnod gwaith."
        }
    ]
}