{
    "url": "https://publicguardian.blog.gov.uk/2024/02/13/your-questions-answered-completing-forms/",
    "title": "Your questions answered: Completing forms",
    "authors": [
        "rebeccaparker1"
    ],
    "categories": [
        "FAQs",
        "Guidance",
        "lasting power of attorney",
        "LPA"
    ],
    "pub_date": "2024-02-13T10:14:39+00:00",
    "content": [
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "text": "We receive thousands of phone calls each week from people looking for help and information on the lasting power of attorney (LPA) process. This blog series answers your questions by breaking down the different stages of your LPA journey. "
        },
        {
            "text": "Here we look at common questions about completing LPA forms. See also:"
        },
        {
            "heading": 3,
            "text": "Attorneys, witnesses and certificate providers"
        },
        {
            "text": "Includes making a start and who to involve"
        },
        {
            "heading": 3,
            "text": "Payments and fees"
        },
        {
            "text": "Includes cheques and applying for remissions and exemptions "
        },
        {
            "heading": 3,
            "text": "Using your LPA"
        },
        {
            "text": "Includes reference numbers, activation keys and access codes "
        },
        {
            "heading": 3,
            "text": "Reporting and making changes to your LPA"
        },
        {
            "text": "Includes reporting a death and changing address "
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Where can I get the forms?  "
        },
        {
            "text": "The quickest way to make a Lasting Power of Attorney (LPA) is by using our online tool. "
        },
        {
            "text": "You can download and print all the forms you'll need to complete an LPA from this website too. "
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Can I use blue ink on my LPA application? "
        },
        {
            "text": "Your LPA will not be rejected if you complete it in blue ink, but we prefer that it is completed in black ink. "
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Can I send multiple applications in the same envelope? "
        },
        {
            "text": "Yes. If possible, please separate them with a paperclip or similar. Please don’t staple them as this could lead to the document being damaged. "
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "What is the order of signing the document? "
        },
        {
            "text": "You can find more detail on the order of signing and how to fill in the LPA on our gov.uk page. "
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Should I tick or cross the box on my LPA application? "
        },
        {
            "text": "As long as the mark you’re making is clear and within the box it doesn’t matter whether you tick it or put a cross in it. "
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Why can’t I change or amend an LPA if I find a mistake "
        },
        {
            "text": "If you make a mistake before you’ve signed the LPA you can correct it.  "
        },
        {
            "text": "Do not use correction fluid (‘Tippex’) to correct it. If you do, we will not be able to register the LPA. Cross out mistakes with a pen and write the correct details as close to the relevant box as possible. Everyone involved in each section must initial each change. "
        },
        {
            "text": "If you find an error after the donor has signed the document, it cannot be changed. This is because when the donor signs the document, they are saying everything on it is accurate and true at the time of signing.  "
        },
        {
            "text": "If you change anything in the LPA after this, it will make the LPA invalid.  "
        },
        {
            "text": "If you’re using the online LPA tool it will prompt you to check all the information in each section and highlight errors made where possible. Once you've confirmed everything and the document is ready to print, you can no longer change the LPA.  If you notice and error which you need to fix, you will need to start again as you’ve confirmed the document is final. "
        },
        {
            "text": " "
        },
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "text": "Rydyn ni’n cael cannoedd o alwadau ffôn bob wythnos gan bobl sy’n chwilio am help a gwybodaeth ynghylch llawer o wahanol bethau. Mae’r gyfres hon o flogiau’n ateb eich cwestiynau drwy ddadansoddi gwahanol gamau eich taith Atwrneiaeth Arhosol."
        },
        {
            "text": "Yma rydym yn edrych ar gwestiynau cyffredin ynghylch llenwi ffurflenni LPA. Gweler hefyd:"
        },
        {
            "heading": 3,
            "text": "Atwrneiod, tystion a darparwyr tystysgrif"
        },
        {
            "text": "Mae’n cynnwys dechrau arni a phwy i’w gynnwys"
        },
        {
            "heading": 3,
            "text": "Taliadau a ffioedd"
        },
        {
            "text": "Yn cynnwys sieciau a gwneud cais am ostyngiadau ac esemptiadau"
        },
        {
            "heading": 3,
            "text": "Defnyddio eich LPA"
        },
        {
            "text": "Yn cynnwys cyfeirnodau, allweddi ysgogi a chodau mynediad"
        },
        {
            "heading": 3,
            "text": "Adrodd a gwneud newidiadau i’ch LPA"
        },
        {
            "text": "Yn cynnwys rhoi gwybod am farwolaeth a newid cyfeiriad"
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Ble alla i gael y ffurflenni? "
        },
        {
            "text": "Y ffordd gyflymaf o wneud Atwrneiaeth Arhosol yw defnyddio ein hadnodd ar-lein."
        },
        {
            "text": "Gallwch lwytho i lawr ac argraffu'r holl ffurflenni sydd eu hangen arnoch i lenwi atwrneiaeth arhosol o'r wefan hon."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Alla i ddefnyddio inc glas ar fy nghais am LPA?"
        },
        {
            "text": "Ni fydd eich LPA yn cael ei gwrthod os byddwch yn ei llenwi mewn inc glas, ond mae’n well gennym os caiff ei llenwi mewn inc du."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "A alla i anfon mwy nag un cais yn yr un amlen?"
        },
        {
            "text": "Gallwch. Os oes modd, dylech eu gwahanu â chlip papur neu rywbeth tebyg. Peidiwch â’u styffylu gan y gallai hyn arwain at ddifrodi’r ddogfen."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Beth yw’r drefn o lofnodi’r ddogfen?"
        },
        {
            "text": "Gallwch chi ddod o hyd i ragor o fanylion am y drefn lofnodi a sut i lenwi’r atwrneiaeth arhosol ar ein tudalen gov.uk."
        },
        {
            "heading": 3,
            "text": "Ddylwn i dicio neu roi croes yn y blwch ar fy nghais am LPA?"
        },
        {
            "text": "Cyn belled â bod y marc rydych chi’n ei wneud yn glir ac o fewn y blwch, does dim ots a ydych chi’n ei dicio neu’n rhoi croes ynddo."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Pam na alla i newid na ddiwygio Atwrneiaeth Arhosol os bydda i’n sylwi ar gamgymeriad"
        },
        {
            "text": "Os byddwch yn gwneud camgymeriad cyn i chi lofnodi’r LPA, gallwch ei chywiro."
        },
        {
            "text": "Peidiwch â defnyddio hylif cywiro (‘Tippex’) i’w gywiro. Os byddwch yn gwneud hynny, ni fyddwn yn gallu cofrestru’r atwrneiaeth arhosol. Dilëwch y camgymeriadau gyda beiro ac ysgrifennwch y manylion cywir mor agos â phosibl at y blwch perthnasol. Rhaid i bawb sy’n ymwneud â phob adran lofnodi pob newid."
        },
        {
            "text": "Os byddwch yn canfod gwall ar ôl i’r rhoddwr lofnodi’r ddogfen, ni ellir ei newid. Y rheswm am hyn yw pan fydd y rhoddwr yn llofnodi’r ddogfen, mae’n datgan bod popeth arni’n gywir ac yn wir adeg llofnodi’r ddogfen."
        },
        {
            "text": "Os byddwch yn newid unrhyw beth yn yr LPA ar ôl hyn, bydd yn gwneud yr LPA yn annilys."
        },
        {
            "text": "Os ydych chi’n defnyddio’r adnodd LPA ar-lein, bydd yn eich annog i wirio’r holl wybodaeth ym mhob adran ac yn tynnu sylw at wallau sy’n cael eu gwneud pan fo hynny’n bosib. Ar ôl i chi gadarnhau popeth a bod y ddogfen yn barod i’w hargraffu, ni allwch newid yr atwrneiaeth arhosol mwyach.  Os byddwch yn sylwi ar wall y mae angen i chi ei gywiro, bydd angen i chi ddechrau eto gan eich bod wedi cadarnhau bod y ddogfen yn derfynol."
        }
    ]
}