{
    "url": "https://publicguardian.blog.gov.uk/2024/02/13/your-questions-answered-reporting-and-making-changes-to-your-lpa/",
    "title": "Your questions answered: Reporting and making changes to your LPA",
    "authors": [
        "rebeccaparker1"
    ],
    "categories": [
        "FAQs",
        "Future planning",
        "lasting power of attorney",
        "LPA"
    ],
    "pub_date": "2024-02-13T10:16:13+00:00",
    "content": [
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "text": "We receive thousands of phone calls each week from people looking for help and information on the lasting power of attorney (LPA) process. This blog series answers your questions by breaking down the different stages of your LPA journey.   "
        },
        {
            "text": "Here we look at common questions about reporting and making changes to your LPA. See also:"
        },
        {
            "heading": 3,
            "text": "Completing forms"
        },
        {
            "text": "Includes signing forms in order"
        },
        {
            "heading": 3,
            "text": "Payments and fees"
        },
        {
            "text": "Includes cheques and applying for remissions and exemptions "
        },
        {
            "heading": 3,
            "text": "Attorneys, witnesses and certificate providers"
        },
        {
            "text": "Includes making a start and who to involve"
        },
        {
            "heading": 3,
            "text": "Using your LPA"
        },
        {
            "text": "Includes reference numbers, activation keys and access codes "
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "When contacting our customer service team via email about an existing LPA please include: "
        },
        {
            "text": "If you are the donor, please provide information for one of your attorneys. Include: "
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "How do I report a death?   "
        },
        {
            "text": "You must inform OPG by email, phone or letter and return the original LPA and all certified copies . If the LPA is cancelled following the death of the donor or attorney, the LPA will be destroyed unless you instruct us otherwise. If you wish the LPA to be returned, please provide a return address when sending your documents to us.  "
        },
        {
            "text": "You do not need to send the death certificate unless requested to do so in a letter or email. If we do request to see the death certificate it must be the original. "
        },
        {
            "text": "Find more information on our GOV.UK page. "
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "I would like to remove an attorney, how is this done?   "
        },
        {
            "text": "If you wish to remove one attorney from your LPA this is referred to as ‘partial deed of revocation’.  Please see the information on our GOV.UK page.  "
        },
        {
            "text": "Please note it is not possible to add an attorney to an existing LPA. This will require a new LPA to be made. "
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "How can I stop being an attorney, or ‘disclaim’?  "
        },
        {
            "text": "An attorney on an LPA can disclaim using an LPA005 form. "
        },
        {
            "text": "An attorney on an Enduring Power of Attorney (EPA) can disclaim using an EP5 form. "
        },
        {
            "text": "You can find further details about removing an attorney on our GOV.UK page. "
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "How do I update a name or address?  "
        },
        {
            "text": "You will need to get in touch to let us know a change of name or address. We will need details of your LPA such as a reference number, name of the donor and date of birth so that we can find your document on the system and update as needed.  "
        },
        {
            "text": "Do not change the LPA itself as this will invalidate it. The document remains valid with the previous name and address details showing.  "
        },
        {
            "text": "Changes in name work in the same way as a change of address.  "
        },
        {
            "text": "Supporting documentation is needed to prove the name change is legal and legitimate. For example, a copy of a marriage certificate or deed poll certificate. "
        },
        {
            "text": "This needs to be sent to us in the post at: "
        },
        {
            "text": "Office of the Public Guardian  "
        },
        {
            "text": "PO Box 16185  "
        },
        {
            "text": "Birmingham  "
        },
        {
            "text": "B2 2WH "
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Can I use my LPA outside of England and Wales or use an overseas LPA in England and Wales? "
        },
        {
            "text": "Not usually as these documents are governed by laws that only apply to certain jurisdictions. If you want to use your LPA overseas, or use an overseas LPA in England and Wales, you should seek independent legal advice. This includes powers made in other parts of the UK. "
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Are Enduring Powers of Attorney (EPAs) still valid? "
        },
        {
            "text": "If a person has an EPA made before 1 October 2007, either registered or unregistered, it can still be used. EPAs only allowed people to appoint attorneys to make decisions about property and financial matters, not health and welfare. If someone has already made an EPA and still has mental capacity, they can either replace it with a new Property and Financial Affairs LPA or can keep the existing EPA.  "
        },
        {
            "text": "EPAs were replaced by LPAs on 1 October 2007."
        },
        {
            "text": "You can find more information about EPAs here. "
        },
        {
            "text": " "
        },
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "text": "Rydyn ni’n cael cannoedd o alwadau ffôn bob wythnos gan bobl sy’n chwilio am help a gwybodaeth ynghylch llawer o wahanol bethau. Mae’r gyfres hon o flogiau’n ateb eich cwestiynau drwy ddadansoddi gwahanol gamau eich taith Atwrneiaeth Arhosol."
        },
        {
            "text": "Yma rydym yn edrych ar gwestiynau cyffredin am adrodd a gwneud newidiadau i’ch LPA. Gweler hefyd:"
        },
        {
            "heading": 3,
            "text": "Llenwi ffurflenni"
        },
        {
            "text": "Yn cynnwys llofnodi ffurflenni mewn trefn"
        },
        {
            "heading": 3,
            "text": "Taliadau a ffioedd"
        },
        {
            "text": "Yn cynnwys sieciau a gwneud cais am ostyngiadau ac esemptiadau"
        },
        {
            "heading": 3,
            "text": "Atwrneiod, tystion a darparwyr tystysgrif"
        },
        {
            "text": "Mae’n cynnwys dechrau arni a phwy i’w gynnwys"
        },
        {
            "heading": 3,
            "text": "Defnyddio eich LPA"
        },
        {
            "text": "Yn cynnwys cyfeirnodau, allweddi ysgogi a chodau mynediad"
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Wrth gysylltu â’n tîm gwasanaeth cwsmeriaid drwy e-bost ynghylch atwrneiaeth arhosol sydd eisoes yn bodoli, dylech gynnwys:"
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Os mai chi yw’r rhoddwr, darparwch wybodaeth ar gyfer un o’ch atwrneiod. Cofiwch gynnwys:"
        },
        {
            "heading": 3,
            "text": "Sut mae rhoi gwybod am farwolaeth?  "
        },
        {
            "text": "Rhaid i chi roi gwybod i Swyddfa'r Gwarcheidwad Cyhoeddus drwy e-bost, ffôn neu lythyr a dychwelyd yr atwrneiaeth arhosol wreiddiol a phob copi ardystiedig. Os caiff yr atwrneiaeth arhosol ei chanslo ar ôl marwolaeth y rhoddwr neu’r atwrnai, bydd yr atwrneiaeth arhosol yn cael ei dinistrio oni bai eich bod yn dweud fel arall wrthym. Os ydych am i’r atwrneiaeth arhosol gael ei dychwelyd, rhowch gyfeiriad dychwelyd pan fyddwch yn anfon eich dogfennau atom."
        },
        {
            "text": "Nid oes angen i chi anfon y dystysgrif marwolaeth oni ofynnir i chi wneud hynny mewn llythyr neu e-bost. Os byddwn yn gofyn am gael gweld y dystysgrif marwolaeth, rhaid iddi fod yn wreiddiol."
        },
        {
            "text": "Mae rhagor o wybodaeth ar gael ar ein tudalen GOV.UK."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Hoffwn dynnu enw atwrnai, sut mae gwneud hyn?  "
        },
        {
            "text": "Os ydych chi’n dymuno tynnu un atwrnai oddi ar eich atwrneiaeth arhosol, cyfeirir at hyn fel ‘gweithred diddymu rhannol’.  Gweler yr wybodaeth ar ein tudalen GOV.UK."
        },
        {
            "text": "Cofiwch nad yw’n bosibl ychwanegu atwrnai at atwrneiaeth arhosol sydd eisoes yn bodoli. Bydd hyn yn golygu y bydd angen gwneud LPA newydd."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Sut y gallaf roi'r gorau i fod yn atwrnai, neu ‘ymwrthod’? "
        },
        {
            "text": "Gall atwrnai ar atwrneiaeth arhosol ymwrthod drwy ddefnyddio’r ffurflen hon."
        },
        {
            "text": "Gall atwrnai ar Atwrneiaeth Barhaus (EPA) ymwrthod drwy ddefnyddio’r ffurflen hon."
        },
        {
            "text": "Mae rhagor o fanylion am ddileu atwrnai ar gael ar ein tudalen GOV.UK."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Sut mae diweddaru enw neu gyfeiriad?"
        },
        {
            "text": "Bydd angen i chi gysylltu â ni i roi gwybod i ni am newid enw neu gyfeiriad. Bydd angen manylion eich atwrneiaeth arhosol arnom fel cyfeirnod, enw’r rhoddwr a’i ddyddiad geni er mwyn i ni allu dod o hyd i’ch dogfen ar y system a’i diweddaru yn ôl yr angen."
        },
        {
            "text": "Peidiwch â newid yr Atwrneiaeth Arhosol ei hun gan y bydd hyn yn ei gwneud yn annilys. Mae'r ddogfen yn dal yn ddilys gyda'r enw a chyfeiriad blaenorol i’w gweld arni."
        },
        {
            "text": "Mae newid enw yn gweithio yn yr un ffordd â newid cyfeiriad."
        },
        {
            "text": "Mae angen dogfennau ategol i brofi bod y newid enw yn gyfreithlon. Er enghraifft, copi o dystysgrif priodas neu dystysgrif gweithred newid enw."
        },
        {
            "text": " "
        },
        {
            "text": "Mae angen anfon hwn atom yn y post at:"
        },
        {
            "text": "Swyddfa’r Gwarcheidwad Cyhoeddus "
        },
        {
            "text": "PO Box 16185 "
        },
        {
            "text": "Birmingham "
        },
        {
            "text": "B2 2WH"
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "A alla i ddefnyddio fy Atwrneiaeth Arhosol y tu allan i Gymru a Lloegr neu ddefnyddio Atwrneiaeth Arhosol o dramor yng Nghymru a Lloegr?"
        },
        {
            "text": "Nid fel arfer gan fod y dogfennau hyn yn cael eu llywodraethu gan gyfreithiau sydd ond yn berthnasol i awdurdodaethau penodol. Os ydych chi am ddefnyddio eich Atwrneiaeth Arhosol dramor, neu ddefnyddio Atwrneiaeth Arhosol o dramor yng Nghymru a Lloegr, dylech geisio cyngor cyfreithiol annibynnol. Mae hyn yn cynnwys pwerau a wneir mewn rhannau eraill o’r DU."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Ydy Atwrneiaethau Parhaus (EPA) yn dal yn ddilys?"
        },
        {
            "text": "Os oes gan berson atwrneiaeth barhaus (EPA) a wnaed cyn 1 Hydref 2007, naill ai wedi'i chofrestru neu heb ei chofrestru, gellir ei defnyddio o hyd. Roedd EPAs dim ond yn caniatáu i bobl benodi Atwrneiod i wneud penderfyniadau am eiddo a materion ariannol, nid iechyd neu les. Os oes rhywun eisoes wedi gwneud EPA ac yn dal i feddu ar alluedd meddyliol, gall naill ai ei disodli ag atwrneiaeth arhosol (LPA) Eiddo a Materion Ariannol newydd, neu gadw’r EPA bresennol."
        },
        {
            "text": "Disodlwyd EPAs gan LPAs ar 1 Hydref 2007."
        },
        {
            "text": "Mae mwy o wybodaeth am EPA ar gael yma."
        }
    ]
}