{
    "url": "https://publicguardian.blog.gov.uk/2024/02/13/your-questions-answered-payments-and-fees/",
    "title": "Your questions answered: Payments and fees",
    "authors": [
        "rebeccaparker1"
    ],
    "categories": [
        "FAQs",
        "lasting power of attorney",
        "LPA"
    ],
    "pub_date": "2024-02-13T10:15:01+00:00",
    "content": [
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "text": "We receive thousands of phone calls each week from people looking for help and information on the lasting power of attorney (LPA) process. This blog series answers your questions by breaking down the different stages of your LPA journey."
        },
        {
            "text": "Here we look at common questions about payments and fees. See also:"
        },
        {
            "heading": 3,
            "text": "Completing forms"
        },
        {
            "text": "includes signing forms in order"
        },
        {
            "heading": 3,
            "text": "Attorneys, witnesses and certificate providers"
        },
        {
            "text": "includes making a start and who to involve"
        },
        {
            "heading": 3,
            "text": "Using your LPA"
        },
        {
            "text": "includes reference numbers, activation keys and access codes "
        },
        {
            "heading": 3,
            "text": "Reporting and making changes to your LPA"
        },
        {
            "text": "includes reporting a death and changing address "
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "How much does an LPA cost? "
        },
        {
            "text": " It costs £82 to register each LPA unless you get a reduction or exemption. "
        },
        {
            "text": "This means it costs £164 to register both a property and financial affairs LPA and a health and welfare LPA. "
        },
        {
            "text": " Fee remissions or exemptions are available based upon the donor’s financial circumstances. "
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "The donor is on a reduced income, can they pay a reduced fee? "
        },
        {
            "text": "Fee remissions or exemptions are available based upon the donor’s financial circumstances.  "
        },
        {
            "text": "A remission is a reduction in the cost of an LPA application. If the person making an LPA (the donor), earns less than £12,000 a year before tax they may be entitled to a 50% reduction.  "
        },
        {
            "text": " An exemption occurs when a person making an LPA receives certain qualifying means tested benefits. This means they aren't required to meet the cost of registering an LPA application. "
        },
        {
            "text": "Eligibility criteria for remissions and exemptions are listed in the LPA120 form."
        },
        {
            "heading": 3,
            "text": " How do I pay for my LPA application? "
        },
        {
            "text": "The quickest way to pay the lasting power of attorney (LPA) application fee is using a credit or debit card online. You can do this when you make your LPA online or after using a paper form. "
        },
        {
            "text": "You can pay OPG in one of three ways. Payment can be made by credit or debit card. We will send a text message requesting payment. This will include a link to the GOV.UK payment page and a reference number. "
        },
        {
            "text": "Payment can also be made over the phone or by cheque. Our emails and letters will tell you how to do this and include a contact number for the card payments team and your reference number. "
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Who are cheques made payable to?  "
        },
        {
            "text": "“Office of the Public Guardian” "
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "I paid for an application on the Make an LPA service, but I haven’t sent it in yet. Can I have a refund? "
        },
        {
            "text": "When you pay for an LPA online and we don’t receive the application within 42 calendar days, a refund of the original payment is actioned. This is an automated process, and we cannot extend it. It takes between 6-8 weeks for it to be credited back into your bank or building society account. \n "
        },
        {
            "text": "If the 42 day period has passed and you still want to go ahead with your LPA application, please send it in to us with a covering letter explaining how you’d like to pay, for example, by a card payment. "
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "I’ve sent my LPA application asking you to contact me for payment. When can I expect to hear from you?   "
        },
        {
            "text": "Once we have received your documents, you should hear from us regarding your payment within 6-8 weeks. If you have provided us with a landline number, you will receive a letter. If you have provided us with a mobile number, you’ll receive a text and a letter. "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "text": "Rydyn ni’n cael cannoedd o alwadau ffôn bob wythnos gan bobl sy’n chwilio am help a gwybodaeth ynghylch llawer o wahanol bethau. Mae’r gyfres hon o flogiau’n ateb eich cwestiynau drwy ddadansoddi gwahanol gamau eich taith Atwrneiaeth Arhosol."
        },
        {
            "text": "Yma rydym yn edrych ar gwestiynau cyffredin ynghylch taliadau a ffioedd. Gweler hefyd:"
        },
        {
            "heading": 3,
            "text": "Llenwi ffurflenni"
        },
        {
            "text": "yn cynnwys llofnodi ffurflenni mewn trefn"
        },
        {
            "heading": 3,
            "text": "Atwrneiod, tystion a darparwyr tystysgrif"
        },
        {
            "text": "Mae’n cynnwys dechrau arni a phwy i’w gynnwys"
        },
        {
            "heading": 3,
            "text": "Defnyddio eich LPA"
        },
        {
            "text": "Yn cynnwys cyfeirnodau, allweddi ysgogi a chodau mynediad"
        },
        {
            "heading": 3,
            "text": "Adrodd a gwneud newidiadau i’ch LPA"
        },
        {
            "text": "Yn cynnwys rhoi gwybod am farwolaeth a newid cyfeiriad"
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Faint yw cost LPA?"
        },
        {
            "text": " Mae’n costio £82 i gofrestru pob atwrneiaeth arhosol oni bai eich bod yn cael gostyngiad neu eithriad. Mae hyn yn golygu ei bod hi’n costio £164 i gofrestru atwrneiaeth arhosol eiddo a materion ariannol ac atwrneiaeth arhosol ar gyfer iechyd a lles."
        },
        {
            "text": "Gellir dileu ffioedd neu mae esemptiadau ar gael ar sail amgylchiadau ariannol y rhoddwr."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Mae’r rhoddwr ar incwm is, a oes modd iddynt dalu ffi gostyngol?"
        },
        {
            "text": "Gellir dileu ffioedd neu mae esemptiadau ar gael ar sail amgylchiadau ariannol y rhoddwr."
        },
        {
            "text": "Gostyngiad yng nghost cais am atwrneiaeth arhosol yw hwn. Os yw’r sawl sy’n gwneud atwrneiaeth arhosol (y rhoddwr) yn ennill llai na £12,000 y flwyddyn cyn treth, mae’n bosibl y bydd ganddo hawl i ostyngiad o 50%."
        },
        {
            "text": "Mae esemptiad yn digwydd pan fydd person sy’n gwneud atwrneiaeth arhosol yn cael rhai budd-daliadau cymwys sy’n dibynnu ar brawf modd. Mae hyn yn golygu nad oes rhaid iddynt dalu cost cofrestru cais am atwrneiaeth arhosol."
        },
        {
            "text": "Mae’r meini prawf cymhwysedd ar gyfer dileu ffioedd ac esemptiadau wedi’u rhestru yn y ffurflen LPA120."
        },
        {
            "heading": 3,
            "text": "Sut mae talu am fy nghais am atwrneiaeth arhosol?"
        },
        {
            "text": "Y ffordd gyflymaf o dalu ffi cais am atwrneiaeth arhosol yw defnyddio cerdyn credyd neu ddebyd ar-lein. Gallwch wneud hyn pan fyddwch chi’n cwblhau Atwrneiaeth Arhosol ar-lein neu ar ôl i chi ddefnyddio ffurflen bapur."
        },
        {
            "text": "Gallwch dalu OPG mewn un o dair ffordd: Gellir talu gyda cherdyn credyd neu ddebyd. Byddwn yn anfon neges destun yn gofyn am daliad. Bydd hyn yn cynnwys dolen i dudalen dalu GOV.UK a chyfeirnod."
        },
        {
            "text": "Gellir talu dros y ffôn neu drwy siec hefyd. Bydd ein negeseuon e-bost a’n llythyrau yn dweud wrthych sut mae gwneud hyn ac yn cynnwys rhif cyswllt ar gyfer y tîm taliadau cerdyn a’ch cyfeirnod."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "I bwy y gwneir sieciau’n daladwy? "
        },
        {
            "text": "“Swyddfa’r Gwarcheidwad Cyhoeddus”"
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Gwnes i dalu am gais ar y gwasanaeth Gwneud Atwrneiaeth Arhosol ond dydw i heb ei anfon eto Allaf i gael ad-daliad?"
        },
        {
            "text": "Pan fyddwch yn talu am LPA ar-lein, a nid ydym yn derbyn y cais o fewn 42 diwrnod calendr, bydd y taliad gwreiddiol yn cael ei ad-dalu. Proses wedi’i hawtomeiddio yw hon, ac ni allwn ei hymestyn. Mae'n cymryd rhwng 6-8 wythnos i'w gredydu'n ôl i'ch cyfrif banc neu gymdeithas adeiladu."
        },
        {
            "text": "Os yw’r cyfnod 42 diwrnod wedi mynd heibio a’ch bod yn dal eisiau bwrw ymlaen â’ch cais am atwrneiaeth arhosol, anfonwch ef atom gyda llythyr eglurhaol yn egluro sut yr hoffech dalu, er enghraifft talu gyda cherdyn."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Rwyf wedi anfon fy nghais am atwrneiaeth arhosol yn gofyn i chi gysylltu â mi i drefnu taliad. Pryd alla i ddisgwyl clywed gennych chi?  "
        },
        {
            "text": " Ar ôl i ni dderbyn eich dogfennau, dylech glywed gennym ynghylch eich taliad o fewn 6-8 wythnos. Os ydych chi wedi rhoi rhif llinell dir i ni, byddwch yn cael llythyr. Os ydych chi wedi rhoi rhif ffôn symudol i ni, byddwch yn cael neges destun a llythyr."
        },
        {
            "text": " "
        }
    ]
}