{
    "url": "https://publicguardian.blog.gov.uk/2024/02/13/your-questions-answered-attorneys-witnesses-and-certificate-providers/",
    "title": "Your questions answered: attorneys, witnesses and certificate providers",
    "authors": [
        "rebeccaparker1"
    ],
    "categories": [
        "Attorneys",
        "FAQs",
        "LPA",
        "Your questions answered"
    ],
    "pub_date": "2024-02-13T10:14:33+00:00",
    "content": [
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "text": "We receive thousands of phone calls each week from people looking for help and information on the lasting power of attorney (LPA) process. This blog series answers your questions by breaking down the different stages of your LPA journey.   "
        },
        {
            "text": "Here we look at common questions about attorneys, witnesses and certificates providers. See also:"
        },
        {
            "heading": 3,
            "text": "Completing forms"
        },
        {
            "text": "Includes signing forms in order"
        },
        {
            "heading": 3,
            "text": "Payments and fees"
        },
        {
            "text": "Includes cheques and applying for remissions and exemptions "
        },
        {
            "heading": 3,
            "text": "Using your LPA"
        },
        {
            "text": "Includes reference numbers, activation keys and access codes "
        },
        {
            "heading": 3,
            "text": "Reporting and making changes to your LPA"
        },
        {
            "text": "Includes reporting a death and changing address "
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Can anyone be an attorney? "
        },
        {
            "text": "Yes, as long as the person is aged 18 or over and able to understand the responsibility of becoming an attorney. "
        },
        {
            "text": "If you’re looking for someone to help with your finances, consider someone with a good history of managing money. If that person has been declared bankrupt, they won’t be able to act as a property and finance attorney but may still be able to act as a health and welfare attorney. "
        },
        {
            "text": "You should always choose people you trust. They could be a friend or family member or you can also appoint a professional such as a solicitor to be your attorney. "
        },
        {
            "text": "A professional will usually charge for their time. Speak to them about any charges beforehand.  "
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "If I live abroad, can I still have an LPA? "
        },
        {
            "text": "If you are the donor and live outside England or Wales, there may be complications and you might wish to seek independent legal advice. For example, there is a ‘habitual residency test’ which usually means that the donor will need to have property or assets in England and Wales for a Property and Financial Affairs LPA to be effective. "
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "I want to appoint a family member as an attorney, but they live abroad. Can I still appoint them? "
        },
        {
            "text": "Your attorney does not need to live in the UK or be a British citizen.  "
        },
        {
            "text": "In order to create the LPA all attorneys must sign the LPA document in person, in black pen and then have a witness sign the document too. "
        },
        {
            "text": "If your attorney lives abroad, you’ll need to post the LPA forms to them to sign and have them posted back to you. "
        },
        {
            "text": "Once they’ve been signed and registered your attorney can act from anywhere in the world. However, when appointing your attorneys, make sure you’re clear on how you want them to act, especially if one lives in a different country, as it could cause practical issues later.  "
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Who can witness an LPA? "
        },
        {
            "text": "A donor’s signature must be witnessed by: "
        },
        {
            "text": "An attorney’s signature must be witnessed by: "
        },
        {
            "text": "Attorneys or replacement attorneys can witness each other’s signature but not the donor’s. Signatures can’t be witnessed online and must be done in person. "
        },
        {
            "heading": 3,
            "text": " "
        },
        {
            "heading": 3,
            "text": "Who can be a certificate provider for my LPA?"
        },
        {
            "text": "A Certificate Provider must: "
        },
        {
            "text": "They sign the LPA after the donor and the donor’s witness. Their role is to make sure the donor can understand independently what they are signing and is not being forced into doing it. Ideally a certificate provider will speak to the donor separately and privately before signing and witnessing the document. "
        },
        {
            "text": "The certificate provider could also be a professional - someone with the skills to know if the donor is able to make the decision to make an LPA. For example: "
        },
        {
            "text": "You can read more about certificate providers on ‘A guide to making your lasting power of attorney (LPA)’."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "text": "Rydyn ni’n cael cannoedd o alwadau ffôn bob wythnos gan bobl sy’n chwilio am help a gwybodaeth ynghylch llawer o wahanol bethau. Mae’r gyfres hon o flogiau’n ateb eich cwestiynau drwy ddadansoddi gwahanol gamau eich taith Atwrneiaeth Arhosol."
        },
        {
            "text": "Yma rydym yn edrych ar gwestiynau cyffredin ynghylch atwrneiod, tystion a darparwyr tystysgrifau.Gweler hefyd:"
        },
        {
            "heading": 3,
            "text": "Llenwi ffurflenni"
        },
        {
            "text": "Yn cynnwys llofnodi ffurflenni mewn trefn"
        },
        {
            "heading": 3,
            "text": "Taliadau a ffioedd"
        },
        {
            "text": "Yn cynnwys sieciau a gwneud cais am ostyngiadau ac esemptiadau"
        },
        {
            "heading": 3,
            "text": "Defnyddio eich LPA"
        },
        {
            "text": "Yn cynnwys cyfeirnodau, allweddi ysgogi a chodau mynediad"
        },
        {
            "heading": 3,
            "text": "Adrodd a gwneud newidiadau i’ch LPA"
        },
        {
            "text": "Yn cynnwys rhoi gwybod am farwolaeth a newid cyfeiriad"
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Oes modd i unrhyw un fod yn atwrnai?"
        },
        {
            "text": "Oes, cyn belled â bod yr unigolyn yn18 oed neu’n hŷn ac yn deall y cyfrifoldeb o fod yn atwrnai."
        },
        {
            "text": "Os ydych chi’n chwilio am rywun i helpu gyda’ch materion ariannol, ystyriwch rywun sydd â hanes da o reoli arian. Os ydy’r unigolyn hwnnw wedi cael ei wneud yn fethdalwr, ni fydd yn gallu gweithredu fel atwrnai eiddo ac arian, ond bydd efallai y bydd yn dal yn gallu gweithredu fel atwrnai iechyd a lles."
        },
        {
            "text": "Dylech bob amser ddewis pobl yr ydych yn ymddiried ynddynt. Gallent fod yn ffrind neu’n aelod o’r teulu neu gallwch hefyd benodi gweithiwr proffesiynol fel cyfreithiwr i fod yn atwrnai i chi."
        },
        {
            "text": "Bydd gweithiwr proffesiynol fel arfer yn codi tâl am ei amser. Siaradwch â nhw am unrhyw gostau ymlaen llaw."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Os wyf yn byw dramor, a oes modd i mi gael LPA o hyd?"
        },
        {
            "text": "Os mai chi yw’r rhoddwr ac yn byw y tu allan i Gymru neu Loegr, efallai y bydd cymhlethdodau ac efallai y byddwch am geisio cyngor cyfreithiol annibynnol. Er enghraifft, ceir ‘prawf preswylio arferol’ sydd fel arfer yn golygu y bydd angen i’r rhoddwr gael eiddo neu asedau yng Nghymru a Lloegr er mwyn i LPA Eiddo a Materion Ariannol fod yn effeithiol."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Rydw i eisiau penodi aelod o’r teulu fel atwrnai, ond mae’n byw dramor. Oes modd i mi eu penodi?"
        },
        {
            "text": "Nid oes angen i’ch atwrnai fyw yn y DU na bod yn ddinesydd Prydeinig."
        },
        {
            "text": "Er mwyn creu’r atwrneiaeth atodol rhaid i bob atwrnai lofnodi’r ddogfen LPA ei hun, gyda phin du a chael tyst i lofnodi’r ddogfen hefyd."
        },
        {
            "text": "Os yw eich atwrnai’n byw dramor bydd angen i chi bostio’r ffurflenni LPA ato i’w llofnodi a sicrhau ei fod yn eu postio’n ôl atoch chi."
        },
        {
            "text": "Ar ôl i’r ffurflenni gael eu llofnodi a’u cofrestru, bydd eich atwrnai yn gallu gweithredu o unrhyw le yn y byd. Fodd bynnag, wrth benodi eich atwrneiod, gwnewch yn siŵr eich bod chi’n gwybod  sut rydych chi eisiau iddyn nhw weithredu, yn enwedig os yw un yn byw mewn gwlad wahanol, oherwydd gallai hyn achosi problemau ymarferol yn nes ymlaen."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Pwy sy’n cael bod yn dyst i atwrneiaeth arhosol?"
        },
        {
            "text": "Rhaid i lofnod y rhoddwr gael ei dystio gan:"
        },
        {
            "text": "Rhaid i lofnod yr atwrnai gael ei dystio gan:"
        },
        {
            "text": "Gall atwrneiod neu atwrneiod wrth gefn fod yn dyst i lofnod ei gilydd ond nid llofnod y rhoddwr. Ni ellir tystio i lofnodion ar-lein a rhaid gwneud hynny wyneb yn wyneb."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Pwy sy’n cael bod yn ddarparwr tystysgrif ar gyfer fy atwrneiaeth arhosol?\nRhaid i Ddarparwr Tystysgrif:"
        },
        {
            "text": "Byddant yn llofnodi’r LPA ar ôl y rhoddwr a thyst y rhoddwr. Eu rôl yw sicrhau bod y rhoddwr yn gallu deall yn annibynnol yr hyn y mae’n ei lofnodi ac nad yw’n cael ei orfodi i’w wneud. Yn ddelfrydol, bydd darparwr tystysgrif yn siarad â’r rhoddwr ar wahân ac yn breifat cyn llofnodi a thystio’r ddogfen."
        },
        {
            "text": "Gallai’r darparwr tystysgrif hefyd fod yn weithiwr proffesiynol – rhywun sydd â’r sgiliau i wybod a yw’r rhoddwr yn gallu gwneud y penderfyniad i wneud LPA. Er enghraifft:"
        },
        {
            "text": "Mae rhagor o wybodaeth am ddarparwyr tystysgrif ar gael yma:"
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}