{
    "url": "https://defradigital.blog.gov.uk/2025/07/31/building-a-shared-understanding-of-services/",
    "title": "Building a shared understanding of services",
    "authors": [
        "Lucy Hartley",
        "Lisa Jeffery"
    ],
    "categories": [
        "Defra digital",
        "Digital services",
        "Digital transformation"
    ],
    "pub_date": "2025-07-31T12:11:35+01:00",
    "content": [
        {
            "text": "Lucy Hartley, Head of Service Strategy, Ownership and Performance, and Lisa Jeffery, Design Manager, reflect on the work being done to build a shared understanding of services within Defra Group."
        },
        {
            "text": "Services are how Defra group achieves most of its outcomes but understanding what we mean by a ‘service’ can be hard. People can have different definitions for services, products, capabilities or components. Parts of a service can mean different things to different people. That’s why we’re developing a list of definitions in a ‘service taxonomy model’ to build shared understanding. In this blog post, we’ll discuss what we want to achieve, how we’re working together to develop a model and what we’ve learned so far."
        },
        {
            "heading": 2,
            "text": "The problem we're trying to solve"
        },
        {
            "text": "The service taxonomy is a model. It will never be a perfect picture of a complex reality but it’s still useful. To start with, we want to use the model to help us develop a shared language. A common understanding of how services enable us to achieve outcomes while meeting user needs. We want to grow awareness of the different parts of a service to support colleagues. We also want to show the difference between products and services and how they work together because colleagues told us this would be helpful. It matters because transforming services is a team sport. We can be more effective and efficient when we’re all working and communicating well together. "
        },
        {
            "text": "The model is in support of the Defra Group digital and data transformation strategy and senior service ownership and service mapping work that we’ve shared plans about. It is also in support of a blueprint for modern digital government, which talks of the need to join up public sector services. Plus, it uses the new cross-government definition of service from the Service Manual."
        },
        {
            "text": "The model shows high-level groupings, not all the details within each layer. Different professions such as architecture or design may have their own ways of mapping. This is not intended to replace those, it’s just a way of working together to create a shared understanding or view. In future, we hope to use the model not only to build shared understanding but also shared commonality and reusability in services."
        },
        {
            "heading": 2,
            "text": "How we're developing a model"
        },
        {
            "text": "The service taxonomy model was first shared internally in September 2024. Since then, we’ve collected feedback from colleagues. This led us to make changes by working together with those who will use the model. We’re now sharing a second version. Of course, it’s still not perfect but it is helping to move us forward on our service transformation journey. We are learning how the model helps us to have better conversations across organisational boundaries and between different professions. We are also learning how the model comes alive though real-world use. In future we will make more changes because the model should always evolve to meet our needs."
        },
        {
            "text": "We’re grateful to have spoken with public sector colleagues about this work. Thanks especially to Tero Väänänen, head of design at NHS England, who spoke to us about how they define services, products and platforms in health and care. Thanks also to Laura Yarrow, head of design at the Government Digital Service, for early support."
        },
        {
            "text": "So far, there’s been good feedback, including on the image of the model, designed by colleague Monica Tuffs, which has the shape of a house. We will continue to gather feedback as we start applying the model to Defra group services, as service designers are doing now."
        },
        {
            "text": "Chris Brooker, principal service designer, said: "
        },
        {
            "heading": 2,
            "text": "What next?"
        },
        {
            "text": "We are working on more examples to show how different people can use the model. We can use it to help map whole services, to show relationships, enabling products or services or duplication."
        },
        {
            "text": "The model is a foundational piece of work that we will build on together. It complements the mapping of whole services that is taking place across Defra Group. Together, we hope this will enable senior service owners to understand the landscape, know their remit and measure success better. "
        },
        {
            "text": "We’re keen to connect with more people, to learn from others and to share what we are learning as we progress."
        }
    ]
}