{
    "url": "https://dragonsden.blog.gov.uk/2025/07/31/dragons-den-ip-blog-series-22-episode-9/",
    "title": "Dragons Den IP Blog - Series 22 Episode 9",
    "authors": [
        "Christina Watts"
    ],
    "categories": [
        "IP",
        "Licensing",
        "Patents"
    ],
    "pub_date": "2025-07-31T21:00:00+01:00",
    "content": [
        {
            "text": "As a new episode of Dragons’ Den graced our TV screens this evening, I was excited to see what intellectual property (IP) was in store for us. Thankfully it didn’t disappoint! The episode was absolutely packed with innovative businesses and creative entrepreneurs, but it was one pitch in particular that really caught my attention and had me leaning forward in my chair. "
        },
        {
            "text": "As a mother of two neurodivergent boys, one of tonight's entrepreneurs was already on my radar! Eleven-year-old Max is the inventor of the Fidget-T, a solution for helping neurodiverse people ‘stim’ wherever they are by playing with pop-able fidget toys built into clothing hems. Stimming is the name given to repetitive physical movements, sounds or actions that help individuals self-regulate emotions and process sensory input. It’s commonly associated with autism and other forms of neurodivergence.  "
        },
        {
            "text": "Max was joined in the Den by his dad, Matt, looking for £50,000 in return for 10% of their sensory-friendly business. I personally discovered the brand last year when I was searching for a solution to my children picking at their clothing hems, constantly pulling out stitching and leaving behind frayed messes. I was spending a fortune replacing clothes and desperately hunting for an alternative when I came across Max and Matt’s Comfa brand. "
        },
        {
            "heading": 3,
            "text": "Patented innovation "
        },
        {
            "text": "It was Matt who proudly told the Dragons about the moment his son came up with his innovative solution.  "
        },
        {
            "text": "“Max came and told us his idea, and we thought it was amazing, but surely it must already exist. We did a thorough search, and we couldn’t find anything, so we began the patent process straight away.\" "
        },
        {
            "text": "Patent GB2617627 for a garment with a built-in fidget device sewn into the seam (similar to bubble wrap toys), allows wearers to discreetly engage in stimming activities for sensory regulation without drawing attention to themselves. It was granted to Matt in 2024. They also have pending patents for Europe and Worldwide.  "
        },
        {
            "text": "Back in the Den it was decision time for the Dragons. Peter Jones felt that the business was currently not investable but advised Matt that he could license his patent out to other clothing retailers. Sara Davies agreed, stating that she thinks that the duo are on to “something massive” if they go down the route of licensing their products. "
        },
        {
            "heading": 3,
            "text": "Why licence your IP"
        },
        {
            "text": "A licence is an agreement that can be used to allow another company to use your patented technology in exchange for fees or royalties. This enables you to generate revenue without losing ownership of your IP. By licensing your patent, you share the risks and costs of bringing products to market whilst accessing new territories and markets you might not otherwise reach.  "
        },
        {
            "text": "Whether you choose exclusive licensing to one partner or non-exclusive arrangements with multiple parties, licensing can provide valuable income streams and collaborative opportunities. However, it's essential to seek professional legal advice to ensure your licensing agreements protect your interests and maximise the commercial value of your innovations. Learn more about licensing via this link: Licensing intellectual property - GOV.UK "
        },
        {
            "text": "The father and son duo left the Den without investment but despite this, Matt and Max weren't downhearted. As Max himself said, they weren't 'mad' because they still came away with fantastic feedback from the Dragons. Max also shared some inspiring advice for other children like him: "
        },
        {
            "text": "Want to help young innovators like Max protect their brilliant ideas? Follow our Education team on Facebook, Instagram, X, YouTube & sign up to the ‘IP in Education’ newsletter topic. You’ll find the latest resources, competitions and events designed to inspire the next generation of inventors.  Disclaimer:  "
        },
        {
            "text": "The purpose of the IPO's Dragons' Den IP blog is to help identify the IP in entrepreneurs’ pitches and highlight how IP works, or could work, in the real-life examples featured. IPO’s authorship of this blog does not constitute its endorsement or sponsorship of any products, individuals or businesses referenced within it. "
        }
    ]
}