{
    "url": "https://defrafmp.blog.gov.uk/2025/07/31/help-shape-the-future-of-brown-crab-fishing-in-the-south-west/",
    "title": "Help shape the future of brown crab fishing in the South West",
    "authors": [
        "Fisheries Management Team, Marine Management Organisation"
    ],
    "categories": [
        "Implementation",
        "Public consultation"
    ],
    "pub_date": "2025-07-31T16:16:22+01:00",
    "content": [
        {
            "text": "The Marine Management Organisation (MMO) wants to hear from you.  "
        },
        {
            "text": "A new online survey is now open, giving fishermen and others in the industry a chance to share their views on proposed changes to the Minimum Conservation Reference Size (MCRS) for brown crab in English waters of the South West. "
        },
        {
            "heading": 2,
            "text": "What’s being proposed? "
        },
        {
            "text": "The Western English Channel brown crab fishery unit (CFU) was highlighted in the crab and lobster fisheries management plan (FMP) for priority management. The stock size was considered near maximum sustainable yield (MSY), and the exploitation rate was moderate in 2019. There are concerns about significant increases in fishing effort in the area in recent years. "
        },
        {
            "text": "Defra (Department for Environment Food and Rural Affairs) commissioned MMO to lead delivery of Proposal 3: to pilot (trial) finer scale management in a CFU in the South West. "
        },
        {
            "text": "A South West Crab Trial Group was formed in 2024, facilitated by Seafish to bring together local stakeholders, MMO and Defra to help deliver this work. "
        },
        {
            "text": "The group reviewed options and strongly backed a consistent MCRS, also referred to as the minimum landing size, for brown crab across English waters of the South West. The proposed MCRS are: "
        },
        {
            "text": "These changes are aimed at protecting crab stocks for the long term and the government plans to bring in these new sizes permanently, with no trial period. "
        },
        {
            "heading": 2,
            "text": "Quick and easy survey "
        },
        {
            "text": "To make it simple for everyone to have their say, MMO on behalf of Defra has created a short, mobile-friendly survey. It only takes about 5 minutes to complete and is open until 11:59 PM on 17 August 2025. "
        },
        {
            "heading": 2,
            "text": "Why it matters "
        },
        {
            "text": "This is your chance to help shape the future of brown crab fishing in the South West. Your feedback will help make sure any changes work for the people who rely on these fisheries. "
        },
        {
            "text": "Stakeholders have told us that now is not the right time to try out alternative trial options and we’ve listened. But MMO will keep working to get better data and a clearer picture of what’s happening in the fishery, to inform more effective management. Alongside Defra, we will carry on working with local and national groups to look at ways of managing effort, and we will pick up the conversation with the wider industry in due course. "
        },
        {
            "heading": 2,
            "text": "Take part and spread the word"
        },
        {
            "text": "If you fish for brown crab or are involved in the industry, please take a few minutes to fill out the survey—and share it with others in your network. "
        },
        {
            "text": " Take the survey here. "
        }
    ]
}