{
    "url": "https://marinedevelopments.blog.gov.uk/2025/04/24/channel-islands-marine-spatial-planning-game/",
    "title": "Channel Islands Marine Spatial Planning Game",
    "authors": [
        "Charlotte Stadden, Coastal Marine Planner (South)"
    ],
    "categories": [
        "marine planning"
    ],
    "pub_date": "2025-04-24T13:15:28+01:00",
    "content": [
        {
            "text": "Rosie Bailey and Charlotte Stadden from the Marine Management Organisation’s marine planning team recently delivered two Marine Spatial Planning (MSP) games hosted in Guernsey. The sessions aimed to increase understanding of the benefits and implications of marine planning through interactive exercises."
        },
        {
            "text": "The MSP games were attended by deputies and officers from the Committee for the Environment and Infrastructure; the Committee for Economic Development and members of the Offshore Wind Sub Committee. Representatives from Jersey Marine Resources also attended the afternoon session."
        },
        {
            "text": "The State of Guernsey are currently in the process of considering marine planning for Guernsey and were interested in the MSP game as a valuable tool to further the conversation around marine planning. The States of Guernsey currently has in place an Island Development Plan (2016) which discusses coastal issues. The Government of Jersey is currently in the latter stages of the development of their first marine spatial plan, with the final version of the plan receiving approval by politicians in October 2024."
        },
        {
            "text": "The MSP game scenario focussed on industries of relevance to Guernsey and Jersey, and issues that could be encountered there. These MSP sessions succeeded in fostering meaningful engagement, promoting regional collaboration, and set the stage for more effective marine management in the Channel Islands going forwards. The sessions received positive feedback, with interest in holding a further session later in 2025."
        },
        {
            "text": "Looking ahead"
        },
        {
            "text": "Building on the success of this event, we aim to host similar sessions in the future. If you would like to be invited to future events, please contact us at planning@marinemanagement.org.uk."
        },
        {
            "text": "We look forward to hearing from you and continuing this important work together."
        }
    ]
}