{
    "url": "https://defrafmp.blog.gov.uk/2025/04/24/cornwall-commercial-fisheries-pilot-summary-report-published/",
    "title": "Cornwall commercial fisheries pilot: summary report published",
    "authors": [
        "Nicola Lewellen - FMP Engagement and Communications"
    ],
    "categories": [
        "- Defra led FMPs",
        "Development and drafting",
        "Implementation"
    ],
    "pub_date": "2025-04-24T09:51:46+01:00",
    "content": [
        {
            "text": "Since our last post, a summary report from the Developing Cornwall’s Fisheries- engagement pilot event has been shared with attendees and been published.  "
        },
        {
            "heading": 2,
            "text": "The report "
        },
        {
            "text": "The report gives a summary of what was covered at the event. From discussions on complex issues surrounding bass, crab and lobster fisheries management plans (FMP), to exploring more sustainable approaches to demersal fishing, and through to negotiations, potential future funding and fishing priorities in Cornwall. "
        },
        {
            "text": "You can find the report here- Developing Cornwall’s Fisheries – Pilot Engagement Post Event Report - Cornish Fish Producers’ Organisation "
        },
        {
            "heading": 2,
            "text": "Reminder: what the event was about "
        },
        {
            "text": "In October 2024, commercial fishing industry representatives and government officials gathered in St Ives for a three-day pilot event aimed to tackle pressing issues and consider solutions in fisheries management in the waters around Cornwall.  "
        },
        {
            "text": "This collaborative workshop led jointly by Defra, the Marine Management Organisation (MMO), the Cornish Fish Producers Organisation (CFPO), the National Federation of Fishermen's Organisations (NFFO), and the UK Association of Fish Producer Organisations (UKAFPO) brought together stakeholders as part of our ongoing work to explore how we best work together to co-design and deliver measures for sustainable fisheries with our stakeholders.  "
        },
        {
            "text": "You can read our previous post on the event here: Insights from commercial fishing pilot event in Cornwall "
        },
        {
            "heading": 2,
            "text": "The approach  "
        },
        {
            "text": "The pilot event created a space where everyone from policy makers to those working at sea could speak openly about what is, and isn’t, working. "
        },
        {
            "text": "Perhaps most valuable were the face-to-face connections made and breaking down misconceptions between industry and government. Moving forward, the organisers have outlined clear actions with specific timeframes. "
        },
        {
            "heading": 2,
            "text": "What’s next? "
        },
        {
            "text": "A follow-up meeting in April 2025 with attendees will review progress and explain how actions from the event are being taken forward.   "
        },
        {
            "text": "One of key actions was a need to clarify roles and responsibilities in FMP governance (or how FMPs are managed and by who) so keep an eye out for an upcoming blog post on this.  "
        },
        {
            "text": "Updates on other actions will follow the next meeting, so make sure to subscribe to the FMP blog to get notifications of new posts. "
        }
    ]
}