{
    "url": "https://nationalscreening.blog.gov.uk/2025/04/24/nearly-200-people-respond-to-uk-nsc-stakeholder-survey/",
    "title": "Nearly 200 people respond to UK NSC stakeholder survey",
    "authors": [
        "Mike Harris"
    ],
    "categories": [
        "General"
    ],
    "pub_date": "2025-04-24T11:57:05+01:00",
    "content": [
        {
            "text": "At the end of February we announced, via this blog, a review of the  UK NSC stakeholder engagement strategy and stakeholder engagement activities."
        },
        {
            "text": "We kicked off the review with a stakeholder survey, asking for your feedback on the information the UK NSC provides and the way we engage with individuals and organisations."
        },
        {
            "text": "A total of 179 people, representing a wide range of roles and perspectives, responded. Many thanks to all of you who took part. Your feedback will help inform any changes we need to make to ensure the UK NSC’s stakeholder strategy and activities are fit for purpose."
        },
        {
            "text": "We received responses from, among others, members of the public, condition-specific interest groups, screening professionals, academics, royal colleges, screening laboratory staff and commercial organisations."
        },
        {
            "text": "Overall:"
        },
        {
            "text": "There was positive feedback for the UK NSC’s range of communication channels, including the blog, our recommendations website, screening masterclasses and international seminars."
        },
        {
            "text": "Respondents came up with a range of suggestions for how the committee might improve its stakeholder engagement activities. They also voiced some concerns and complaints, notably on the themes of the transparency of UK NSC information, the timeliness of its communications, stakeholder input into consultations, and the committee’s requirements for the provision of new screening evidence."
        },
        {
            "heading": 2,
            "text": "Next steps"
        },
        {
            "text": "We will analyse the survey results in more depth and use the themes it highlighted to inform the agenda of more detailed focus group discussions."
        },
        {
            "text": "We plan to invite a variety of stakeholders to participate in these focus groups to discuss key issues and identify potential ways to address them."
        },
        {
            "text": "We will then consider how the UK NSC’s stakeholder strategy and activities might need to be amended and improved. We will aim to publish any updates later this year and communicate them via the blog."
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK NSC. You can register to receive updates direct to your inbox, so there is no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, please email uknsc@dhsc.gov.uk."
        }
    ]
}