{
    "url": "https://forestrycommission.blog.gov.uk/2025/04/24/should-trees-be-planted-within-a-productive-farming-landscape/",
    "title": "Should trees be planted within a productive farming landscape?",
    "authors": [
        "Mark Broadmeadow"
    ],
    "categories": [
        "Woodland creation"
    ],
    "pub_date": "2025-04-24T12:51:26+01:00",
    "content": [
        {
            "text": "There’s a lot of discussion about how England’s limited land resource should be used. Food production is a key concern, with arable farming concentrated on the best and most versatile land."
        },
        {
            "text": "There is also a challenging and legally binding target to increase tree canopy and woodland cover to 16.5% of land area in England by 2050. This is necessary to reverse biodiversity loss, mitigate and adapt to climate change, and maintain a sustainable supply of timber. All of which support agriculture and rural communities. However, it requires an additional quarter of a million hectares of trees and woodland – equal to around 2% of England’s land area."
        },
        {
            "text": "So should any of this woodland cover be using our most productive farmed land? We explore the answer to this question and explain why there are sometimes reasons landowners may wish to plant on better quality land."
        },
        {
            "heading": 2,
            "text": "The Agricultural Land Classification map"
        },
        {
            "text": "Published in 1981, the Agricultural Land Classification map shows ‘land capability for agriculture’, based on soil type, climate and topography."
        },
        {
            "text": "Importantly, it represents land capability at the time the soil was surveyed – not necessarily current or future suitability for agriculture. The government’s recent Land Use Consultation recognises this and is currently seeking views on how the map could be updated to take account of factors including climate change."
        },
        {
            "text": "In England and Wales, there are five categories (grades 1-5), with Grade 1 being the highest quality and suitable for the largest range of agricultural crops. Grade 3 land is further broken down to Grade 3a and Grade 3b. Grades 1, 2 and 3a comprise ‘best and most versatile land’."
        },
        {
            "heading": 2,
            "text": "How is land chosen for woodland creation?"
        },
        {
            "text": "All agricultural land in England is eligible for applications to the England Woodland Creation Offer (EWCO) and other woodland creation grants. It is up to landowners to decide how their land should be used – as long as it complies with all laws and regulations."
        },
        {
            "text": "The Forestry Commission does not target high quality agricultural land for woodland creation and actively promotes planting on lower quality land with fewer constraints. We also provide supplementary payments through EWCO to incentivise planting on lower quality land."
        },
        {
            "text": "However, there are a range of reasons why landowners may wish to plant trees on better quality land:"
        },
        {
            "text": "In these circumstances, the Forestry Commission and other woodland creation delivery partners may encourage landowners to plant on the best and most versatile land to meet specific environmental objectives and align with local nature recovery strategies. Landowners also need to consider land availability, planting constraints, cost, and a range of site attributes and factors."
        },
        {
            "text": "Forestry England considers Agricultural Land Classification when it acquires land for woodland creation. The best and most versatile land is generally avoided, unless the land is ideal for meeting other social, economic or environmental objectives of the project."
        },
        {
            "heading": 2,
            "text": "How we assess the risks of woodland creation"
        },
        {
            "text": "Woodland creation Environmental Impact Assessments (EIA) determine any likely harm of the project to the wider environment. Agricultural land quality is a key consideration in EIA."
        },
        {
            "text": "If the project would likely impact on the local rural or agricultural economy through the individual or cumulative use of farmable best and most versatile land, then this is something that can be considered under the regulatory EIA process."
        },
        {
            "text": "Each case will be judged on its own merits. Generally, planting on best and most versatile land on its own is unlikely to represent sufficient harm to the environment to prevent a project from proceeding."
        },
        {
            "text": "EIAs may ask:"
        },
        {
            "heading": 2,
            "text": "Is woodland creation a major risk to food production?"
        },
        {
            "text": "We want to continue to target tree planting away from our best and most versatile land. However, even if we only planted on this land to meet our statutory tree cover target, it would cover 7% of that land in England. While this is a small minority of that land, we want to avoid this – planting large areas of woodland on best and most versatile land rather than less productive land isn’t an efficient use of land and it increases the risk of us pushing more food production abroad."
        },
        {
            "text": "But it’s highly unlikely that would happen – in 2021/22 and 2022/23, only 18% of new woodland was planted on the best and most versatile land. If this current trend continued, it would reduce the area of such land producing food by just 1.3% by 2050. Improving options for agroforestry, and encouraging woodland planting on less productive land, could further reduce the area of best and most versatile land taken out of food production."
        },
        {
            "text": "Of course, this all needs to be considered with land lost to urban expansion and energy production. The government is seeking views on how incentives can better reflect food production potential through its Land Use Consultation."
        },
        {
            "text": "Moreover, when done sensibly, and in the context of a Land Use Framework that promotes the protection of our best and most versatile land for food production, there are certain circumstances where trees or woodland can complement a productive farming landscape."
        }
    ]
}