{
    "url": "https://mhrainspectorate.blog.gov.uk/2025/06/04/a-voyage-in-good-distribution-practice-gdp-the-aviation-and-marine-sectors/",
    "title": "A Voyage in Good Distribution Practice (GDP): The Aviation and Marine Sectors",
    "authors": [
        "Dr Christopher Watson"
    ],
    "categories": [
        "GDP",
        "Good distribution practice",
        "Wholesale Dealer’s Licence"
    ],
    "pub_date": "2025-06-04T12:00:29+01:00",
    "content": [
        {
            "text": "The aviation and marine sector are a journey away from the traditional scope of a Wholesale Dealer’s Licence (WDA (H)), and one of unique and specific challenges. The lorries and trucks that supply medicines to hospitals and pharmacies also head to aircrafts, ships, and oil platforms. The supply of medicines to these locations are vital to ensure that planes can fly, ships can sail and to ensure the safety and wellbeing of crew and passengers, as well as the people that work in these remote locations. The MHRA is committed to supporting stakeholders and to continue to provide guidance."
        },
        {
            "heading": 4,
            "text": "Schedule 17"
        },
        {
            "text": "The Human Medicines Regulations 2012 require licence holders and responsible persons to implement robust procedures for establishing the authority and legitimacy of a customer to receive medicinal products. Most organisations are confident with the process to qualify a hospital or pharmacy and establish their authority to purchase medicines, and the MHRA have written blog posts on this topic previously."
        },
        {
            "text": "When the customer becomes something airborne or aquatic, whether it be an aircraft hopping between holiday destinations, a fishing vessel docked in a local harbour, or an oil platform in the North Sea, qualification of bona fides become more complicated. The Human Medicines Regulations 2012 however offers clear information for a company to qualify their customer. Schedule 17, (The Human Medicines Regulations 2012) documents the exemptions from the restrictions on sale and supply of medicinal products. These exemptions are in respect to specific medicines contained within Schedule 17 and does not grant the person exempted free reign of all medicines unless explicitly stated. Whilst using Schedule 17 to qualify a customer it is expected that this is fully documented and described within the Quality Management System. It is expected that an order can be fully traced back to the person placing an order, and it is critical to ensure the person doing so is legitimate and has authority. An example may be the commander of a plane or the master vessel is allowed to purchase medicines, the MHRA Inspectors would require companies to demonstrate that the individual and plane or vessel are validated prior to supply. For ease the company that owns the vessel can place the order of their behalf, however the order placed must be identical to that placed by the commander."
        },
        {
            "text": "Before an aircraft is deemed ready for flight, a suitably approved, bespoke (accounting for the size and shape of fuselages) medical kit must be onboard.  The required content of first-aid kits is listed in UK Regulation (EU) No. 965/2012. Likewise, organisations operating in the marine sector should familiarise themselves prior to supply as to the legal requirements surrounding both vessels and ports to be supplied prior to despatch (MIN 718 (M+F) The Ship Captain's Medical Guide 24th Edition - GOV.UK) ."
        },
        {
            "heading": 4,
            "text": "Delivery"
        },
        {
            "text": "Once you have qualified the commander or master and received a matching order, does this mean a smooth journey? Delivering to marine or aviation customers can be a complex task. Chapter 9 of GDP states “Deliveries should be made to the address stated on the delivery note and into the care of the premises of the consignee. Medicinal products should not be left on alternative premises”.  Achieving this can be challenging in both aviation and marine scenarios due to restricted access to docks and airports, and the lack of direct access to airside or offshore locations. The MHRA takes a pragmatic approach allowing companies to deliver orders to the goods inwards facility at ports or airports, but companies must ensure that there is clear documentation evidencing that the order has made it to the destination in time. There should also be a “just in time” mentality. Orders should not be stored for long periods of time in port or airport facilities before being loaded onto the ship or aircraft, as this would require those facilities to be licenced. Organisations undertaking such activity should take reasonable steps to ensure that supplies are compliant with GDP guidance, and consider undertaking, and regularly reviewing, a risk assessment to identify areas of concern prior to supply."
        },
        {
            "text": "Consideration should be paid towards qualifying the airport/port where orders will be received. What are the security measures, hours of operation, and the location of the goods receiving area? Qualifying an aircraft or vessel for one airport or port does not mean the job is complete, as both planes and ships are mobile. You may have qualified the commander or master, delivered to the goods receiving facility, and ensured prompt transfer to the ship or aircraft, but if you plan to supply the same vessel or aircraft at different ports or airports, the process must be repeated for each location."
        },
        {
            "heading": 4,
            "text": "Altered and Repackaged Medicines"
        },
        {
            "text": "A wholesale dealer licence (WDA) is required for the supply of all medicines and first-aid kits to aircrafts and vessels where the kits only contain human medicines that are the subject of a UK marketing authorisation (MA), and the medicine has not been broken or altered in anyway and remains presented in accordance with the marketing authorisation."
        },
        {
            "text": "Where changes are required to the presentation and packaging of the licensed medicine then a manufacturer's licence (MIA) that authorises assembly and names a Qualified Person (QP) continues to be required. The duties of the QP named on the manufacturer's licence regarding batch certification remain. The licensed assembler, new pack size and presentation should also be reflected in the marketing authorisation of the relevant product concerned."
        },
        {
            "heading": 4,
            "text": "Export"
        },
        {
            "text": "You have fully qualified your customer, you have a process in place to ensure that your order arrives at the port when the vessel arrives and will have its loading fully documented, does this mean that you’re finished? The flag of the vessel could pose you one more problem. Even if a vessel is docked at a British dock, if it’s not a British flagged vessel then you will need export on your licence and complete the relevant export declarations to go along with it. Likewise, all foreign commercial aircraft that operate to the UK are required to hold a CAA Foreign Carrier Permit."
        },
        {
            "heading": 4,
            "text": "Recalls"
        },
        {
            "text": "Recalls are a part of wholesaling that we all hope never to happen, and we just have to perform the annual assessment of the systems that are in place. The aviation and marine sectors pose unusual questions in this area with how we contact aircraft and vessels with affected stock and how do we retrieve the affected stock being two of the main questions. Companies should put thought into this area to ensure that they are able to perform an efficient recall if the situation arises."
        },
        {
            "heading": 4,
            "text": "Unusual sales pattern monitoring"
        },
        {
            "text": "Although persons requesting medicines may be able to order a wide range of medicines, organisations should carefully consider the volumes and types of medicines being supplied, remaining vigilant for any unusual requests which may be indicators of diversion. If you suspect medicines are being diverted, you should report this to The Bureau via thebureau@mhra.gov.uk."
        },
        {
            "text": "For further information on the topics covered, please see our “Guidance on Licence Requirements for Medical Stores on UK Ships” and “Guidance on the Supply of Medicines in First-Aid Kits to Airlines” in the appendices below."
        },
        {
            "heading": 2,
            "text": "Appendix 1"
        },
        {
            "heading": 3,
            "text": "Guidance on Licence Requirements for Medical Stores on UK Ships"
        },
        {
            "text": "Maritime travel entails unique challenges, not least of which is the health and well-being of crew members on board. The inherent isolation of ships, whether merchant or fishing vessels, demands a self-sufficient approach to medical care. This is why it is crucial for these vessels to carry an adequate supply of medicines and medical equipment. The aim is to ensure that seafarers can receive prompt and effective treatment for a wide range of medical conditions, thereby safeguarding their health and maintaining operational efficiency."
        },
        {
            "text": "The United Kingdom introduced the Merchant Shipping and Fishing Vessel (Medical Stores) Regulations 1995 to implement the standards set by Council Directive 92/29/EEC, which establishes minimum requirements for medical supplies on ships. These regulations were later updated by the Merchant Shipping and Fishing Vessel (Medical Stores) (Amendment) Regulations 1996. In 2019, Commission Directive (EU) 2019/1834 was adopted, revising the technical specifications of the earlier directive. After January 1, 2021, these Regulations became part of the UK’s retained law following Brexit. The Merchant Shipping Notice implements the updated medical store requirements, which now incorporate advances in medical treatment and the latest recommendations from the 24th edition of the Ship Captain’s Medical Guide, published in January 2025."
        },
        {
            "text": "To ensure that seafarers receive appropriate medical treatment while at sea, many of the medicines included in shipboard medical stores are classified as \"prescription only medicines,\" with some also categorized as Controlled Drugs, subject to additional regulations under the Misuse of Drugs Regulations 2001 (as amended). According to Schedule 17 of The Human Medicines Regulations 2012, the owner or master of a ship, which does not carry a doctor on board as part of the ship’s complement, is permitted to administer prescription-only medicines to treat persons on board to comply with merchant shipping legislation. Similarly, the Misuse of Drugs Regulations 2001 (as amended), specifically regulations 8(5)(a), 8(6)(c), 9(5)(a), and 10(5)(a), authorize the owner or master of a ship which does not carry a doctor among the seamen employed in it to possess and supply certain controlled drugs as set out in the regulations."
        },
        {
            "text": "The focus of this guidance document is to provide information and advice on the licence requirements for the supply of medicines on board of UK registered ships."
        },
        {
            "heading": 4,
            "text": "Medical Stores"
        },
        {
            "text": "The Merchant Shipping Notice details the various categories of medical stores that must be maintained on board, depending on the type of vessel and its specific requirements."
        },
        {
            "text": "The Crew Accommodation Regulations mandate that ships must be equipped with a secure, lockable medical cabinet specifically for storing medicines and drugs. For merchant ships and fishing vessels measuring 24 meters or more, the regulations further require the inclusion of an additional \"inner cupboard\" dedicated exclusively to the storage of Controlled Drugs. This inner cupboard must be equipped with its own door and a separate lock that cannot be accessed with the key to the main medical cabinet."
        },
        {
            "text": "Lifeboats and life-rafts are required to carry medical stores in sealed units, which should be replaced as a unit if unused at the expiry date. The minimum contents of this kit are designed to provide for immediate care where a minor delay is considered acceptable."
        },
        {
            "text": "For seagoing ships where there is no qualified medical practitioner among the crew and the vessel carries more than 12 passengers, all the medicines and equipment should be kept together in portable bag(s) or container(s) collectively known as the Doctor’s Bag, unless specific storage is required such as refrigeration."
        },
        {
            "text": "Seagoing vessels with a crew exceeding 10 members are required to have first aid kits placed in areas such as the galley and engine room. For passenger vessels, it is necessary to have at least one first aid kit for every 100 passengers, with a maximum of three kits required, meaning a ship carrying 250 passengers would require three kits. A first aid kit must be included within the Doctor's Bag."
        },
        {
            "heading": 4,
            "text": "Licences required"
        },
        {
            "text": "The supply of medicines to UK registered ships is subject to the following licences:"
        },
        {
            "text": "The supplier and the assembler of the kits may be the same or different entities, depending on the arrangements made between them. In either case, they must comply with the relevant licence conditions and the principles and guidelines of good distribution practice (GDP) and good manufacturing practice (GMP)."
        },
        {
            "heading": 4,
            "text": "Altered and Repackaged Medicines"
        },
        {
            "text": "A wholesale dealer licence (WDA) is required for the supply of medicine kits where the kits only contain human medicines that are the subject of a UK marketing authorisation (MA), and the medicine has not been broken or altered in anyway and remains presented in accordance with the marketing authorisation."
        },
        {
            "text": "Where changes are required to the presentation and packaging of the licenced medicine then a manufacturer's licence (MIA) that authorises assembly and names a Qualified Person (QP) continues to be required. The duties of the QP named on the manufacturer's licence regarding batch certification remain. The licenced assembler, new pack size and presentation should also be reflected in the marketing authorisation of the relevant product concerned."
        },
        {
            "heading": 2,
            "text": "Appendix 2"
        },
        {
            "heading": 3,
            "text": "Guidance on the Supply of Medicines in First-Aid Kits to Airlines"
        },
        {
            "text": "Aircrafts are required to carry first-aid kits to ensure they are equipped to manage medical emergencies that may arise during a flight. These kits are necessary for treating passengers or crew members who may suffer from sudden health issues or injuries, thereby stabilizing their condition until the aircraft can land and more comprehensive medical care can be accessed."
        },
        {
            "text": "The inclusion of first-aid kits is a regulatory requirement set by aviation and healthcare authorities. In the UK, the Civil Aviation Authority implemented rules in 1982 that require aircraft to carry comprehensive first-aid kits. The required content of first-aid kits is listed in UK Regulation (EU) No. 965/2012."
        },
        {
            "text": "Part 12 of the Human Medicines Regulations 2012 (HMR 2012) governs the sale, supply, and administration of medicines by specific persons under defined circumstances. This part includes provisions that allow airlines to possess, order, and use medicines on board aircraft. Notably, schedule 17 of HMR 2012 provides for certain exemptions that apply to the operator or commander of an aircraft regarding the supply and administration of specific prescription-only medicines (POMs), the supply, sale, or offer for sale or supply medicinal products on a general sale list (GSL), as well as the supply of pharmacy medicines (PMs) under defined conditions and limitations."
        },
        {
            "text": "The focus of this guidance document is to provide information and advice on the licence requirements for the supply of medicines in first-aid kits to airlines operating in the United Kingdom (UK)."
        },
        {
            "text": "This guidance applies to all medicines that are supplied in first-aid kits to airlines, including prescription-only medicines, pharmacy medicines, and general sales list medicines. It does not cover the supply of medicines to passengers or crew members for their personal use, or the supply of medicines to other types of aircraft, such as helicopters or private jets."
        },
        {
            "heading": 4,
            "text": "Licences required"
        },
        {
            "text": "The supply of medicines in first-aid kits to airlines is subject to the following licences:"
        },
        {
            "text": "The supplier and the assembler of the kits may be the same or different entities, depending on the arrangements made between them. In either case, they must comply with the relevant licence conditions and the principles and guidelines of good distribution practice (GDP) and good manufacturing practice (GMP)."
        },
        {
            "heading": 4,
            "text": "Altered and Repackaged Medicines"
        },
        {
            "text": "A wholesale dealer licence (WDA) is required for the supply of first-aid kits to aircrafts where the kits only contain human medicines that are the subject of a UK marketing authorisation (MA), and the medicine has not been broken or altered in anyway and remains presented in accordance with the marketing authorisation."
        },
        {
            "text": "Where changes are required to the presentation and packaging of the licensed medicine then a manufacturer's licence (MIA) that authorises assembly and names a Qualified Person (QP) continues to be required. The duties of the QP named on the manufacturer's licence regarding batch certification remain. The licensed assembler, new pack size and presentation should also be reflected in the marketing authorisation of the relevant product concerned."
        }
    ]
}