{
    "url": "https://insidehmcts.blog.gov.uk/2025/06/04/connecting-courts-globally-improving-how-we-manage-international-engagement/",
    "title": "Connecting courts globally: improving how we manage international engagement",
    "authors": [
        "Rob Hack, Head of External Comms & Engagement"
    ],
    "categories": [
        "General",
        "Working at HMCTS"
    ],
    "pub_date": "2025-06-04T12:03:50+01:00",
    "content": [
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "text": "We cannot deliver court and tribunal services alone. But did you know the people we work with stretch well beyond the shores of the UK? I’ve seen our international engagement grow significantly over the past couple of years, so I'm pleased to tell you about an important development in how we manage our global relationships at HMCTS."
        },
        {
            "text": "As part of using or working in our courts and tribunals, you may have noticed international delegates visiting our buildings. From judicial representatives seeking insights into our digital systems to ministry officials exploring how we operate our courts and tribunals, these visits have become a regular feature. In recent times alone we’ve welcomed representatives from justice systems in Taiwan, New Zealand, Spain, Singapore and many other countries to our sites."
        },
        {
            "text": "As an agency, we’re also strongly represented in departmental initiatives abroad as well as at home – take the recent work we did alongside MoJ and the Foreign, Commonwealth and Development Office with counterparts in India, for example, to share knowledge of our respective justice transformation programmes."
        },
        {
            "text": "Until now, these valuable interactions have been managed on an ad-hoc basis, which can result in duplication of effort or missed opportunities to coordinate them with other parts of the organisation and make them as impactful as possible. That's where the newly established International Oversight and Coordination Group (IOCG) comes in."
        },
        {
            "heading": 2,
            "text": "Why this matters"
        },
        {
            "text": "The new group brings together representatives from across HMCTS, the MoJ International Team and Judicial Office to ensure we take a coordinated approach to international engagement. This isn't just about managing visitor logistics – it's about maximising the value these exchanges bring to our organisation and aligning them with broader UK government priorities."
        },
        {
            "text": "By establishing clear criteria for evaluating international requests and creating proper oversight of resources, we can be more strategic about this type of engagement – arranging those interactions that will give us, and the international justice community, the most value. This means better support for the MoJ’s Rule of Law programme and more meaningful participation in international justice initiatives that align with our strategic goals."
        },
        {
            "text": "It also links closely to what the Lord Chancellor has said about the importance of promoting and defending the rule of law, which she describes as “more than an ideal…it is the most enduring of British values\". And it aligns with the Judicial Strategy for International Engagement that the Lady Chief Justice launched last month."
        },
        {
            "heading": 2,
            "text": "What the IOCG will do"
        },
        {
            "text": "The group is there to:"
        },
        {
            "heading": 2,
            "text": "Looking ahead"
        },
        {
            "text": "The IOCG represents an exciting opportunity for HMCTS to enhance our global influence and reputation while ensuring we derive maximum value from international engagement."
        },
        {
            "text": "A recent visit saw judges from Tanzania visit the Royal Courts of Justice to meet Lord Justice Snowden, Mrs Justice McGowan and Master Beldam. The delegation then visited Bristol Crown Court to meet His Honour Judge Picton to discuss sexual offences and rape ‘myths’, aiming to improve the way Tanzanian judges handle these cases. Courteney Rose and Chris Deighton from Judicial Office, who helped lead this event, reflected:"
        },
        {
            "text": "“International engagement undertaken by the judiciary of England and Wales is incredibly important to support the Rule of Law. It projects judicial values and enhances our judiciary’s global reputation whilst promoting its interests. There’s a unique value in judges talking to each other, sharing experiences and developing thinking together. Countries’ prosperity and security are enhanced by supporting judicial systems, individual rights and the Rule of Law. Our judiciary, the wider UK, and other jurisdictions all benefit from international engagement.”"
        },
        {
            "text": "Our more structured approach will help us transform a process into a strategic asset for HMCTS that helps oversee visits like this one. I look forward to seeing what we can deliver as our international work develops and matures in the coming months."
        },
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "heading": 2,
            "text": "Cysylltu llysoedd yn fyd-eang: gwella sut rydym yn rheoli ymgysylltu rhyngwladol "
        },
        {
            "text": "Ni allwn ddarparu gwasanaethau llys a thribiwnlys ein hunain. Ond oeddech chi’n gwybod bod y bobl rydym yn gweithio gyda nhw yn ymestyn ymhell y tu hwnt i lannau’r DU? Rwyf wedi gweld ein hymgysylltiad rhyngwladol yn tyfu’n sylweddol dros y blynyddoedd diwethaf, felly rwy’n falch o ddweud wrthych am ddatblygiad pwysig o ran sut yr ydym yn rheoli ein perthnasoedd byd-eang yn GLlTEF."
        },
        {
            "text": "Fel rhan o ddefnyddio neu weithio yn ein llysoedd a thribiwnlysoedd, efallai eich bod wedi sylwi ar gynrychiolwyr rhyngwladol yn ymweld â’n hadeiladau.  O gynrychiolwyr barnwrol yn ceisio cael cipolwg ar ein systemau digidol i swyddogion ynadaeth yn archwilio sut rydym yn gweithredu ein llysoedd a thribiwnlysoedd, mae’r ymweliadau hyn wedi dod yn nodwedd reolaidd. Yn ddiweddar yn unig rydym wedi croesawu cynrychiolwyr o systemau cyfiawnder yn Taiwan, Seland Newydd, Sbaen, Singapore a nifer o wledydd eraill i’n safleoedd."
        },
        {
            "text": "Fel asiantaeth, mae gennym gynrychiolaeth gref mewn mentrau adrannol dramor yn ogystal â gartref - cymerwch y gwaith diweddar wnaethom ochr yn ochr â’r MoJ a’r Swyddfa Dramor, y Gymanwlad a Datblygu gyda chymheiriaid yn India, er enghraifft, i rannu gwybodaeth am ein rhaglenni trawsnewid cyfiawnder priodol."
        },
        {
            "text": "Hyd at nawr, mae’r rhyngweithio gwerthfawr hwn wedi’i reoli ar sail ad-hoc, sy’n gallu arwain at ddyblygu ymdrechion neu fethu cyfleoedd i’w cydlynu gyda rhannau eraill o’r sefydliad a’u gwneud mor effeithiol â phosibl. Dyna lle mae’r Grŵp Cydlynu a Goruchwylio Rhyngwladol (IOCG) newydd a sefydlwyd yn dod i mewn."
        },
        {
            "heading": 2,
            "text": "Pam bod hyn o bwys "
        },
        {
            "text": "Mae’r grŵp newydd yn dod â chynrychiolwyr ar draws GLlTEF, Tîm Rhyngwladol yr MoJ a’r Swyddfa Farnwrol i sicrhau bod gennym agwedd gydlynol tuag at ymgysylltu rhyngwladol. Nid yw hyn yn ymwneud â rheoli logisteg ymwelwyr yn unig - mae’n ymwneud â gwella gwerth a ddaw’r cyfnewid hwn i’n sefydliad a’u halinio gyda blaenoriaethau llywodraeth DU ehangach."
        },
        {
            "text": "Drwy sefydlu meini prawf clir ar gyfer gwerthuso ceisiadau rhyngwladol a chreu goruchwyliaeth briodol o adnoddau, gallwn fod yn fwy strategol am y math hwn o ymgysylltu - trefnu’r rhyngweithio hwnnw fydd yn rhoi’r gwerth gorau i ni a’r gymuned cyfiawnder rhyngwladol.   Mae hyn yn golygu cefnogaeth well i raglen Reolaeth y Gyfraith yr MoJ a chyfrannu’n fwy ystyrlon mewn mentrau cyfiawnder rhyngwladol sy’n alinio gyda’n hamcanion strategol."
        },
        {
            "text": "Mae hefyd yn cysylltu’n agos â beth mae’r Arglwydd Ganghellor wedi’i ddweud am bwysigrwydd hybu ac amddiffyn rheolaeth y gyfraith mae’n ei ddisgrifio fel “more than an ideal…it is the most enduring of British values”.  Ac mae’n alinio gyda’r Strategaeth Farnwrol Ymgysylltu Rhyngwladol a lansiwyd gan yr Arglwyddes Brif Ustus y mis diwethaf."
        },
        {
            "heading": 2,
            "text": "Beth fydd IOCG yn ei wneud "
        },
        {
            "text": "Mae’r grŵp yno i:"
        },
        {
            "heading": 2,
            "text": "Edrych i’r dyfodol"
        },
        {
            "text": "Mae’r IOCG yn cynrychioli cyfle cyffrous i GLlTEF wella ein dylanwad byd-eang ac enw da tra’n sicrhau ein bod yn datblygu’r gwerth gorau drwy ymgysylltu rhyngwladol."
        },
        {
            "text": "Gwelodd ymweliad diweddar farnwyr o Tanzania yn ymweld â’r Llysoedd Barn Brenhinol i gwrdd â’r Arglwydd Ustus Snowden, Mrs Ustus McGowan a Meistr Beldam.  Yna ymwelodd y cynrychiolwyr â Llys y Goron Bryste i gwrdd â’i Anrhydedd y Barnwr Picton i drafod troseddau rhywiol a ‘mythau’ trais sy’n anelu at wella’r ffordd mae barnwyr Tanzania yn delio â’r achosion hyn. Bu Courteney Rose a Chris Deighton o’r Swyddfa Farnwrol, wnaeth helpu i arwain y digwyddiad hwn, yn myfyrio:"
        },
        {
            "text": "“Mae ymgysylltu rhyngwladol a gynhelir gan farnwriaeth Cymru a Lloegr yn eithriadol o bwysig i gefnogi Rheolaeth y Gyfraith. Mae’n rhagweld gwerthoedd barnwrol ac yn gwella ein henw da barnwrol yn fyd-eang tra’n hybu ei fuddion. Mae yna werth unigryw mewn barnwyr yn siarad â’i gilydd, rhannu profiadau a datblygu meddwl gyda’i gilydd. Mae ffyniant a diogelwch gwledydd yn gwella drwy gefnogi systemau barnwrol, hawliau unigol a Rheolaeth y Gyfraith. Mae ein barnwriaeth, y DU ehangach ac awdurdodaethau eraill i gyd yn cael budd o ymgysylltu rhyngwladol.”"
        },
        {
            "text": "Bydd ein dull mwy strwythuredig yn ein helpu i drawsnewid proses i ased strategol ar gyfer GLlTEF sy’n helpu i oruchwylio ymweliadau fel hyn.  Rwy’n edrych ymlaen at weld beth allwn ni ei gyflawni wrth i’n gwaith rhyngwladol ddatblygu ac aeddfedu yn y misoedd i ddod."
        }
    ]
}