{
    "url": "https://cddo.blog.gov.uk/2025/06/04/government-digital-and-data-at-civil-service-live-2025/",
    "title": "Government Digital and Data at Civil Service Live 2025 ",
    "authors": [
        "GDS"
    ],
    "categories": [
        "Cross-government strategy",
        "Data",
        "DDaT community",
        "DDaT events",
        "Government Digital and Data"
    ],
    "pub_date": "2025-06-04T12:27:31+01:00",
    "content": [
        {
            "text": "Visit our biggest offer to date at Civil Service Live 2025 to network, get interactive with Government Digital Service products and participate in live demos at venues across the UK."
        },
        {
            "text": "Experience a modern digital government first hand at the Government Digital and Data hub — an integral part of the Government Digital Service’s (GDS) biggest showcase ever at Civil Service Live (CSL) 2025. "
        },
        {
            "text": "With a range of GDS-led plenary sessions on offer throughout the main programme, and our own sessions and technology demos at our hub space, discover how we’re making progress with our long-term vision for digital public services. To get to grips with this vision and understand the blueprint in action there are still some limited places available for plenary talks at some CSL locations. They are: "
        },
        {
            "text": "Visiting our hub is a chance to network with Government Digital and Data experts, participate in live demos and get interactive with our products featuring in our biggest CSL programme ever. Session topics covered include:"
        },
        {
            "text": "This blog gives you a taste of what you can expect from Government Digital and Data and Government Digital Service at CSL 2025. Talks and discussions listed above are not complete. But if you want to be the first to catch our exclusive reveals that would delight the best social media tech influencer sign up via CSL and explore what is on offer. We look forward to seeing you there!"
        }
    ]
}