{
    "url": "https://dcmslibraries.blog.gov.uk/2025/06/04/join-the-celebrations-for-libraries-week/",
    "title": "Join the celebrations for Libraries Week",
    "authors": [
        "Chartered Institute of Library and Information Professionals (CILIP)"
    ],
    "categories": [
        "Library news"
    ],
    "pub_date": "2025-06-04T11:41:46+01:00",
    "content": [
        {
            "text": "Libraries Week: Libraries Change Lives 2025, running this week until Sunday 8 June, celebrating the vital role libraries play in transforming lives and strengthening communities."
        },
        {
            "text": "This year's theme, Libraries Week: Libraries Change Lives By Sustaining Economic Growth highlights how library services can help to build a sustainable economy - whether that is through improving health outcomes in NHS; helping new businesses get off the ground; delivering support for users looking to get into work or education, or in accessing benefits; supporting people in education at schools, colleges and universities; or growing the economy directly by helping businesses make the right, evidence-based decisions. "
        },
        {
            "text": "During the week, policy and decisions makers are visiting library services across the England to meet with library staff and users, tour facilities, and hear first-hand how the library is supporting people in areas such as:"
        },
        {
            "text": "CILIP Chief Executive Officer Louis Coiffait-Gunn said: “Everyone working in knowledge, information and library services understands and sees how the services they deliver help people and wider society grow. Libraries Week is our opportunity to celebrate the difference we make and to tell the world how important and valued our work is.” "
        },
        {
            "text": "Showcasing the work of libraries "
        },
        {
            "text": "Libraries, institutes or organisations are invited to submit case study demonstrating how information professionals and knowledge managers are at the heart of delivering economic growth for their local and national communities. "
        },
        {
            "text": "This can be via a range of activities - from delivering job and CV workshops, supporting students in schools, colleges, and universities; helping researchers in institutes and industry; to bolstering businesses of all shapes and sizes to thrive."
        },
        {
            "text": "CILIP is building a bank of case studies from across sectors, regions and topics to highlight the vital role the library workforce plays to deliver information, knowledge, learning and culture. "
        },
        {
            "text": "Almost 200 stories of impact have already been shared by libraries across the UK and are featured on this interactive map."
        },
        {
            "text": "Submit a case study"
        },
        {
            "text": "Submit your impact story (it can be through an activity, an event, an initiative, or an outstanding member of staff) from your library. This is open to all libraries across all sectors in the UK."
        },
        {
            "text": "CILIP invites libraries across the UK to take part by sharing stories, hosting activities, and showing local impact."
        },
        {
            "text": "Pritie Billimoria, CILIP’s Senior Marketing, Communications and Public Affairs Manager, said: “As communities seek to drive economic growth, close skills gaps, and level up local communities, libraries are quietly doing all three - and often overlooked.  "
        },
        {
            "text": "“From digital inclusion to business support, libraries are serving as free, local economic engines in towns and cities across the UK. Libraries Week is the perfect opportunity to showcase this work and advocate for your community.”   "
        },
        {
            "text": "For more information about Libraries Week: Libraries Change Lives visit https://www.cilip.org.uk/page/libraries-change-lives "
        }
    ]
}