{
    "url": "https://gds.blog.gov.uk/2025/06/04/making-services-work-together-starting-with-health-disability-and-work/",
    "title": "Making services work together — starting with health, disability and work",
    "authors": [
        "Eleanor Stephens, Service Owner, Government Digital Service"
    ],
    "categories": [
        "Digital Centre",
        "Digital engagement",
        "Digital strategy",
        "GDS team",
        "Service design"
    ],
    "pub_date": "2025-06-04T10:50:04+01:00",
    "content": [
        {
            "text": "The Blueprint for Modern Digital Government sets an ambitious vision for the future of public services. Our plan is to create public services that are clear and easy to use for everyone. "
        },
        {
            "heading": 2,
            "text": "The problems we see with public services at the moment"
        },
        {
            "heading": 2,
            "text": "What the Service Transformation team are doing"
        },
        {
            "text": "The new Service Transformation team within the Government Digital Service (GDS) includes colleagues with extensive experience designing and building services, and solving complex policy problems. We are all passionate about making services better for everyone. As a team, we are primarily focusing on the following areas to:"
        },
        {
            "heading": 2,
            "text": "Focus on health, disability, and work "
        },
        {
            "text": "We're piloting a new way of connecting services that puts people (our users) first, rather than forcing them to navigate separate government systems."
        },
        {
            "text": "In most cases, interacting with the government doesn’t begin and end with one service. People often need to use many services and interact with multiple organisations to get the help they need. "
        },
        {
            "text": "Teams across the public sector and in GDS have been working for a long time to make services joined up and proactive. Our aim is to share this best practice and increase focus on proactive, personalised services that meet people where they are. "
        },
        {
            "text": "We are focusing on helping people find or keep a job while managing long-term health conditions or disabilities. "
        },
        {
            "text": "Currently, 2.8 million people are economically inactive due to long term sickness, an increase of 675,000 compared to 2019.  In many cases people are keen to return to work with the right support but find it difficult to access this support due to lack of awareness, and complicated application processes.  "
        },
        {
            "text": "We found that people with a health condition or disability may need to use more than 40 services from 9 different organisations. These include things like:"
        },
        {
            "text": "Many of these services make it possible for people to work. During our research people told us that it is hard to find these services. They also said that services often ask for the same information many times."
        },
        {
            "text": "Our goals are to: "
        },
        {
            "text": "We are testing new ideas to join up and transform this journey, working with colleagues in the Department for Work and Pensions (DWP), the NHS, and other organisations across the public sector."
        },
        {
            "text": "We plan to test some short-term improvements this month, while we also work on bigger problems like sharing data and updating legacy systems. This will help us move towards personalised, proactive services that focus on the person."
        },
        {
            "text": "We’re working in the open as much as we can, with show and tell sessions available to teams across government, and regular updates to teams working in this area."
        },
        {
            "text": "We'll share what we're learning, and how small changes could make a big difference for people trying to get the support they need. We would love to hear your thoughts on how we could improve this work so please get in touch via health-work-research@digital.cabinet-office.gov.uk. "
        }
    ]
}