{
    "url": "https://dcmslibraries.blog.gov.uk/2025/06/04/the-role-of-libraries-in-building-a-sustainable-economy/",
    "title": "The role of libraries in building a sustainable economy",
    "authors": [
        "Freya Wooding, BIPC Network, The British Library"
    ],
    "categories": [
        "Case study"
    ],
    "pub_date": "2025-06-04T12:16:43+01:00",
    "content": [
        {
            "text": "This year, Libraries Week is celebrating the vital role libraries play in building a sustainable economy. The Business & IP Centre’s National Network, based in libraries across the UK, drives and sustains economic growth by offering free impartial business support to local entrepreneurs."
        },
        {
            "text": "What does the Business & IP Centre network do?"
        },
        {
            "text": "The Business & IP Centre Network offers support to over 40,000 people every year to start, grow and protect their business ideas. Started in the British Library in 2006, the Business & IP Centre provides impartial business support and market intelligence to aspiring entrepreneurs, start-ups and scale-up businesses. The Business & IP Centre in the British Library is just one part of a large network of Business & IP Centres in libraries across the UK. "
        },
        {
            "text": "Each of the 21 regional centres runs its own programme of business support, including one-to-one appointments with business experts-in-residence, workshops and events with local entrepreneurs and business owners, and networking opportunities. With friendly teams of library staff and trusted accurate business information, wherever you are – your local Business & IP Centre is here to help. "
        },
        {
            "text": "Business & IP Centre staff are trained to meet the needs of small businesses by both the British Library and the Intellectual Property Office. The programme of activities for each Centre is designed specifically to suit local needs and opportunities. Each Business & IP Centre works within the local business support ecosystem, partnering with public and private sector organisations to co-deliver the services and ensure effective cross-referrals to relevant support. As well as busy programmes of events and one-to-one business support, Centres across the UK also have a range of facilities including maker spaces, podcast studios, photography studios and equipment, co-working spaces and meeting rooms."
        },
        {
            "text": "‘Having the support readily available in the north Tyneside area was incredibly helpful for me. Right from the initial conversations with the expert in residence, it was clear that he just understood the local context.’ – BIPC North East user Lesley Forrester, Founder of NAATA  "
        },
        {
            "text": "Libraries are the perfect space for Business & IP Centres as they are widely acknowledged as open and accessible spaces in the heart of local communities. Libraries are trusted hubs of information offering impartial advice which makes them ideally positioned for users who are unsure or nervous about accessing support. 43% of Business & IP Centre users were accessing business support for the first time, through their library."
        },
        {
            "text": "Case study – from start-up to scale-up with the Business & IP Centre"
        },
        {
            "text": "William Arinze, founder of The Drone Rules, used his local Business & IP Centre – BIPC Oxfordshire – to start his drone education and consultancy business. After leaving his job in 2021, William accessed BIPC Oxfordshire services and support to support his start-up journey, including business databases, the photography and lighting equipment available at BIPC Oxfordshire, and the centre’s meeting rooms for client discussions. "
        },
        {
            "text": "Having grown his business successfully and moved beyond the start-up stage, William has continued to use BIPC support. William has joined the Get Ready for Business Growth programme, a free three-month accelerator for scale-up businesses, where he’ll receive tailored support to help take his growing business to the next level."
        },
        {
            "text": "What impact does the Business & IP Centre have?"
        },
        {
            "text": "The Business & IP Centre Network drives economic growth, business creation and longevity, and inclusion. The Network aims to make starting a business accessible to anyone, with a proud track record of supporting a diverse group of entrepreneurs. Of Business & IP Centre users who went on to start a new business between 2020 – 2023, 72% were women, 26% identified themselves as from a minority ethnic community, 10% had a disability and 12% were from the most deprived areas."
        },
        {
            "text": "As well as reaching and supporting underrepresented groups, the Business & IP Centre has a 19-year history of helping businesses to grow and thrive. Businesses who use Business & IP Centre services are twice as likely to succeed and continue trading after three years than those who don’t. "
        },
        {
            "text": "The BIPC Network helps to boost and strengthen both businesses and the wider economy. Between 2020 and 2023, the Network helped to create over 18,175 new businesses and over 6,124 FTE jobs. The Business & IP Centre’s Democratising Entrepreneurship 2.0 report shows that libraries deliver unrivalled value for money and return on investment, standing at £6.63 generated for every £1 of public funding."
        },
        {
            "text": "With 21 regional centres and over 50 local hubs based in libraries across the UK, find your closest Business & IP Centre and discover the resources and support available here, using our interactive map."
        }
    ]
}