{
    "url": "https://socialcare.blog.gov.uk/2021/07/23/covid-19-vaccinations-protect-us-all/",
    "title": "COVID-19 vaccinations protect us all",
    "authors": [
        "Deborah Sturdy"
    ],
    "categories": [
        "Care and support",
        "Communities",
        "coronavirus",
        "Guidance",
        "Information sharing"
    ],
    "pub_date": "2021-07-23T09:47:54+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Big decisions"
        },
        {
            "text": "As care colleagues, the nation owes you the greatest thanks and respect for the amazing efforts you have made to keep our loved ones safe in the long and arduous journey to this moment."
        },
        {
            "text": "For many of you, particularly those of you working in care home settings, this final easing of restrictions has brought mixed emotions, I’m sure."
        },
        {
            "text": "On the one hand, you will be taking pleasure in restoring some sense of normality to the lives of residents, their families and friends (although we recognise challenges remain in managing visits safely in some settings)."
        },
        {
            "text": "On the other, you may well be wondering ‘what next?’ The virus is still out there, people are still falling ill, which means we must continue to keep our colleagues, residents and communities safe by following the highest standards of infection prevention and control, testing regularly and isolating when needed."
        },
        {
            "text": "The one big difference though, the game changer which has brought us to this point of restored liberty, and one which gives us all valuable and sustained reassurance, is this: vaccination."
        },
        {
            "heading": 2,
            "text": "Comprehensive protection"
        },
        {
            "text": "Many of you, your colleagues and residents will have already been vaccinated with one, hopefully two doses, of an approved COVID-19 vaccine."
        },
        {
            "text": "There are caveats to this of course. Vaccination has to be comprehensive to be truly effective as protection – particularly for those most vulnerable to infection. While the SAGE recommended levels of at least 80% of care home staff and 90% of residents have been reached and exceeded in many parts of England, we do see regional variation."
        },
        {
            "text": "While nationally, the majority of care home staff have been vaccinated, according to the latest published data, only 65% of older care homes in England are currently meeting this minimum level. Whilst we want to see all care homes pass the SAGE thresholds, the over-riding imperative is to maximise and maintain protection across the board."
        },
        {
            "text": "With this intent in mind, the Government, following wide consultation with the care sector, has taken the difficult decision to make vaccination a mandatory condition of deployment in care homes."
        },
        {
            "text": "I understand the misgivings some have expressed about this. However, I believe this is not about limiting freedom of choice, but about protecting those in society who are most vulnerable to the impact of COVID-19."
        },
        {
            "text": "Residents in care homes are particularly vulnerable to severe illness and death from COVID-19. As of 2nd April 2021, around a third of attributable deaths in England were care home residents. Making vaccination a condition of deployment in these settings will help make sure those at high risk due to age, underlying health conditions, or disability, are better protected against the virus."
        },
        {
            "heading": 2,
            "text": "The grace period begins"
        },
        {
            "text": "The new regulations come into force on 11  November this year. Care providers and their staff need time to prepare, which is why a 16-week grace period has begun, allowing colleagues who haven’t been vaccinated to make arrangements to have both doses.  Book or manage your vaccinations on the NHSE website. If you’re a care manager or care home colleague, yet to be vaccinated, or involved in helping others get theirs, here’s a handy timeline:"
        },
        {
            "text": "It is also worth noting care colleagues will likely be invited to have a third dose and a flu jab later this year – all in service to maximising protection of those at highest risk."
        },
        {
            "text": "I know that taking up the offer of vaccination  will still be a difficult decision for some of you, but I believe it is ultimately the right one. COVID-19 vaccination protects you, your colleagues and residents around the clock. In tandem with PPE, testing and all other IPC measures, you will be playing your part in creating a safer, happy, healthier future for us all."
        },
        {
            "text": "Speak to your managers, get all the information you need to reassure yourself about the vaccines, and book your jabs today. I feel confident it will be one of the best decisions you’ll ever make."
        }
    ]
}