{
    "url": "https://giaa.blog.gov.uk/2021/07/23/giaa-annual-report-and-accounts-2020-21-delivering-through-challenging-times/",
    "title": "GIAA Annual Report and Accounts 2020-21: Delivering Through Challenging Times",
    "authors": [
        "Elizabeth Honer - Chief Executive"
    ],
    "categories": [
        "Firm Foundations"
    ],
    "pub_date": "2021-07-23T11:32:58+01:00",
    "content": [
        {
            "text": "This week the GIAA laid it’s 2020-21 Annual Report and Accounts before Parliament. I invite you to take a moment to read through it."
        },
        {
            "text": "I am immensely proud of our organisation for all that we have achieved in the most extraordinary circumstances. When we began to work from home in March last year, we were not sure whether we would be able to continue to provide our services to our customers. How would we do our work when so much of it requires personal engagement and access to information?"
        },
        {
            "text": "We rose to the challenge and our Annual Report reflects the resilience, professionalism and dedication of our GIAA teams in internal audit, counter fraud and investigation, professional practice, corporate services and those that do our work for the European Commission. Feedback from our customers recognises the important contributions our people have made. In incredibly difficult professional and personal circumstances, we have delivered for our customers, with some of them at the very heart of the response to the pandemic, producing more impactful work and securing high ratings in two external assessments, including the External Quality Assessment conducted by the Institute for Internal Auditors."
        },
        {
            "text": "We have put our people at the heart of our own pandemic response, recognising the anxiety caused by the health emergency, and their own altered working environments. Some of our people have been shielding, some caring for relatives and others home schooling. Our regular surveys have told us that they have felt supported by our organisation. It is our people, their many kindnesses and care for each other, that have enabled us to deliver strong results in the past year."
        },
        {
            "text": "The GIAA is now well established, and the demand for our services is growing with regular approaches from government bodies keen to take advantage of a whole-of-government approach to internal audit. Our challenge as we look to the coming year is to continue to manage our growth whilst strengthening our customer offer and truly delivering on our vision of providing better insights so that our customers can deliver better outcomes. I look forward to working with our customers and other stakeholders, our people, including my executive team and our non-executives, as we continue to deliver our vision."
        }
    ]
}