{
    "url": "https://valuationoffice.blog.gov.uk/2021/07/23/how-we-value-ports/",
    "title": "How We Value: Ports",
    "authors": [
        "sophiekilgour"
    ],
    "categories": [
        "How We Value",
        "Valuation"
    ],
    "pub_date": "2021-07-23T12:35:51+01:00",
    "content": [
        {
            "text": "Jackie Jones and Robin Coulson are part of the National Valuation Unit at the Valuation Office Agency (VOA) where they are responsible for the assessment of ports and related occupations for business rates across England and Wales. Between them they have some 68 years of rating experience in the VOA. Here, they explain the process of valuing ports across England and Wales."
        },
        {
            "text": " "
        },
        {
            "heading": 4,
            "text": "An introduction to how we value"
        },
        {
            "text": "The rating system has been around for even longer than we have as an agency, with it dating back to the 1600s. The current primary legislation goes back to 1988 and is supported by constantly evolving secondary legislation."
        },
        {
            "text": "Individual occupations of all non-domestic property are assessed to a rateable value  - this is the rental value of the property at the time of the last Revaluation. These assessments are added to a local rating list for the calculation of business rate bills – much in the same way people receive a council tax bill every year for their domestic place of residence."
        },
        {
            "text": " "
        },
        {
            "heading": 4,
            "text": "The ports of the UK:"
        },
        {
            "text": "We are responsible for the valuation of approximately 200 ports ranging in size from small harbours in Cornwall to large deep sea terminals like Felixstowe. These can be container terminals, general ports, ferry terminals, local harbours or privately operated terminals such as those on London’s River Thames."
        },
        {
            "text": "Today, much of our work involves making regular visits to ports to observe any changes that may have taken place. As there are permitted development rights within ports, planning information is generally unavailable, so eyes on the ground are invaluable. We also meet regularly with the UK Major Ports Group and the British Ports Association, where we exchange views and keep up to date with any current issues they may wish to flag."
        },
        {
            "text": "A port cannot operate in a vacuum and relies on interaction between:"
        },
        {
            "text": "None of this would be possible without significant input from colleagues in other parts of the public sector such as UK Border Force, HMRC and Defra. Approvals from these organisations allow cargo to move in or out of a port."
        },
        {
            "text": "Ports are generally valued to the Receipts and Expenditure method of valuation - having regard to their income and expenditure. Accounts information is provided to us by individual port operators and is then reviewed and adjusted with the result being a rateable value used by the local authority to calculate the rates bill for the year."
        },
        {
            "text": "An individual port’s assessment will include all property that is occupied for operational purposes."
        },
        {
            "text": "There is an extensive range of properties within port estates which are subject to separate assessments as they are occupied by third parties and not the host port."
        },
        {
            "text": "Much like the ports themselves, the VOA is an integral for businesses around the country – we are in the business of providing a specific service which allows other people and organisations to get on with the work they need to be doing. In a constantly evolving industry this is a very interesting arena in which to work."
        }
    ]
}