{
    "url": "https://naturalengland.blog.gov.uk/2021/07/23/nature-based-solutions-for-climate-change-at-the-landscape-scale-a-new-12-5m-pilot-programme/",
    "title": "Nature-based Solutions for Climate Change at the Landscape Scale: a new £12.5m pilot programme",
    "authors": [
        "Mike Morecroft"
    ],
    "categories": [
        "Biodiversity",
        "Climate change",
        "Science and evidence"
    ],
    "pub_date": "2021-07-23T08:30:02+01:00",
    "content": [
        {
            "text": "Natural habitats, such as peatlands, forests, saltmarsh and grasslands contain large amounts of carbon and will play an important part in reaching net zero greenhouse gas emissions.  There are two aspects to this: stopping emissions from damaged habitats and starting carbon uptake by creating new habitats.  Nature-based solutions (NbS) for climate change have the advantage of tackling climate change at the same time as supporting biodiversity and providing a wide range of benefits to people, ranging from natural flood management to opportunities for recreation."
        },
        {
            "text": "In order to realise the potential of nature-based solutions for climate change, there are a number of scientific and practical challenges to overcome.  We still have a lot to learn about how carbon accumulates or is released from different habitats in different circumstances.  It is equally important to understand how to integrate nature-based solutions with other land management objectives and to make them financially viable."
        },
        {
            "text": "A new Defra - BEIS project supported by the Treasury’s Shared Outcomes Fund and led by Natural England, Environment Agency, RBG Kew and the Forestry Commission will tackle these challenges.  These public bodies will work closely with local partners and stakeholders across a number of study areas to ensure our work is not only technically rigorous but firmly rooted in the practicalities of farming and land management.  These pilot study areas will include some of the forthcoming Landscape Recovery pilot projects, we will also work with Kew’s ‘Wild Botanic Garden’ at Wakehurst in Sussex and two additional sites."
        },
        {
            "text": "Natural England will manage the project, including identifying the pilot study areas, establishing relationships with local partners and learning how best to support them in delivering NbS and the factors that make it easier or harder for them to do this.  NE will also carry out research and monitoring to compare carbon storage and uptake across different habitats of different ages and in different parts of the country.  When we carried out an in depth review of carbon storage and sequestration by habitats Carbon Storage and Sequestration by Habitat 2021- it became clear that although we can see broad differences between habitats there are still big gaps in the evidence base."
        },
        {
            "text": "Some habitats are understudied, and in many cases local variations and the effects of different management approaches are unclear.  This project will help to fill those gaps and allow us to identify strategies that optimise benefits for both climate change and biodiversity."
        },
        {
            "text": "The Environment Agency will work with the pilot areas to develop new governance and blended funding models for landscape scale action, which will provide a mechanism for managing our environment in a more holistic and integrated manner. We will develop a toolkit providing methodology for implementing a systems-approach for recovery of landscapes, incorporating blended funding, and ensuring new markets help achieve the multiple outcomes we want from our natural assets."
        },
        {
            "text": "The private sector is seeking opportunities for green investment, for example through the Financing Nature Coalition, and Water Industry investment through the Price Review process. Blending public and private monies is critical for delivering NbS at scale. Our project will develop methods for aligning actions across whole landscape areas, with an ambition to develop blended funding opportunities across existing siloes, such as flood, water and agriculture."
        },
        {
            "text": "Kew will undertake high resolution research into the ability of biodiverse habitats to sequester carbon at its Wakehurst site in Sussex. Wakehurst is home to the Landscape Ecology Programme and under scientific control, with research across a range of habitats. Focussing on grasslands and woodlands, Kew will combine a range of scientific expertise from remote sensing (the use of drones to measure plant health), gas flux (the flow of greenhouse gases in and out of the landscape) and belowground mycology."
        },
        {
            "text": "We need to understand how our landscape works holistically to build a full picture of how and where carbon is stored. Emerging evidence shows how pivotal fungi are in locking carbon away underground and Kew’s research will significantly enrich this evidence. Kew’s research partner University of Sussex will combine this data with social and economic data, incorporating it into a landscape modelling tool."
        },
        {
            "text": "Kew’s research will work with project partners on strengthening the data behind carbon calculation, support an evidence-base on investing in landscape transformation and nature-based solutions that benefit people and the local economy."
        },
        {
            "text": "FC will contribute its expertise in developing robust carbon standards, based on more than ten years of experience in developing and running the Woodland Carbon Code. FC will also facilitate and advise on woodland creation grant proposals in the pilot areas."
        },
        {
            "text": "The important evidence produced by this project will help towards delivery of the government’s 25 Year Environment Plan ambitions and carbon net zero goals, in particular through informing the development of the government’s new environmental land management schemes and carbon markets together with a wide range of other aspects of policy and delivery."
        },
        {
            "text": "Co-authors - Melissa Swartz (EA), Ed Ikin (Kew) and Mark Broadmeadow (FC)."
        }
    ]
}