{
    "url": "https://phescreening.blog.gov.uk/2021/07/23/new-fasp-handbook/",
    "title": "New ‘all-in-one’ FASP handbook published",
    "authors": [
        "Siobhan Alt",
        "Rebecca Al-Ausi",
        "Teresa Lardner"
    ],
    "categories": [
        "NHS Fetal Anomaly Screening Programme"
    ],
    "pub_date": "2021-07-23T12:12:56+01:00",
    "content": [
        {
            "text": "The NHS fetal anomaly screening programme (FASP) handbook is the ‘all you need to know’ guide for everyone involved in the programme."
        },
        {
            "text": "The biggest change you will notice is there is now one FASP handbook instead of 3 separate ones. Using HTML made this possible. We link to all our other publications to make it easier for you to find the information you need."
        },
        {
            "text": "We’ve also updated the language and terminology used throughout the handbook. This follows on from our work with parent support groups on public-facing information."
        },
        {
            "text": "All eligible pregnant women are offered screening for Down’s syndrome, Edwards’ syndrome, Patau’s syndrome and a number of physical conditions."
        },
        {
            "heading": 2,
            "text": "Changes to the handbook"
        },
        {
            "text": "Some of the major changes you will notice are in the departmental review of ultrasound images and prenatal diagnosis (PND) sections."
        },
        {
            "heading": 3,
            "text": "Departmental review of ultrasound images"
        },
        {
            "text": "We’ve updated this section for ultrasound practitioners by introducing a new tool to support the assessment of images and feedback to practitioners."
        },
        {
            "text": "The new tool supports the screening support sonographer (SSS) to:"
        },
        {
            "text": "This can help to improve the quality of ultrasound images."
        },
        {
            "heading": 3,
            "text": "Prenatal diagnosis"
        },
        {
            "text": "We’ve clarified guidance on PND following a higher chance result for Down’s syndrome, Edwards’ syndrome or Patau’s syndrome from the combined or quadruple test."
        },
        {
            "text": "For most women, the quantitative fluorescence-polymerase chain reaction (QF-PCR) result will be accurate for both chorionic villus sampling (CVS) and amniocentesis."
        },
        {
            "text": "The presence of a tri-allelic T21, T18 or T13 result indicates the chromosomal condition was present at conception and reflects the genotype of the baby."
        },
        {
            "text": "A bi-allelic T21, T18 or T13 QF-PCR result from a CVS sample may indicate the presence of confined placental mosaicism (CPM). This is a very rare occurrence, less than 0.5% of all CVS samples. CPM is the presence of a chromosomal condition in the placenta that is not present in the baby. Laboratory protocols minimise the risk of CPM from a CVS sample."
        },
        {
            "text": "Where CPM is suspected, the laboratory will perform further testing to interpret the initial QF-PCR result. This may be a karyotype to count the chromosomes or a further QF-PCR on cultured cells."
        },
        {
            "text": "There are 2 possible scenarios if the laboratory reports a bi-allelic T21, T18 or T13 QF-PCR result from a CVS sample indicating CPM."
        },
        {
            "heading": 4,
            "text": "Scenario 1"
        },
        {
            "text": "T21, T18 or T13 is suspected with findings on ultrasound scan consistent with any of these conditions."
        },
        {
            "text": "In this scenario, healthcare professionals should discuss pregnancy options with the woman, as further testing is not always required."
        },
        {
            "heading": 4,
            "text": "Scenario 2"
        },
        {
            "text": "T21, T18 or T13 is suspected with no unexpected findings on ultrasound scan consistent with any of these conditions."
        },
        {
            "text": "In this scenario, further testing on cultured cells is performed to interpret the initial QF-PCR result. This is to exclude the possibility of CPM. The offer of a further invasive test (amniocentesis) may be recommended after the analysis of the cultured cells."
        },
        {
            "text": "Results from the cultured cells must be received and discussed with the woman before any decisions are made regarding pregnancy options including continuing or terminating the pregnancy."
        },
        {
            "heading": 3,
            "text": "New sections"
        },
        {
            "text": "We’ve added the following new sections to the handbook:"
        },
        {
            "heading": 3,
            "text": "On the move"
        },
        {
            "text": "We have moved the ultrasound information relating to the Down’s syndrome screening quality assurance support service (DQASS). This information is now on the DQASS page. The DQASS page now includes information on:"
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "Keep an eye on the PHE Screening blog for information on the new image review tool and NHS FASP pathway requirements specifications."
        },
        {
            "text": "Please send any queries, suggestions or feedback about the updated handbook to the PHE Screening helpdesk."
        },
        {
            "heading": 2,
            "text": "PHE Screening blog"
        },
        {
            "text": "The PHE Screening blog provides up to date news from all NHS screening programmes. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new blogs. If you have any questions about this blog article, or about population screening in England, please contact the PHE Screening helpdesk."
        }
    ]
}