{
    "url": "https://phescreening.blog.gov.uk/2021/07/23/ultrasound-image-review-tool/",
    "title": "New image review tool for ultrasound practitioners",
    "authors": [
        "Teresa Lardner"
    ],
    "categories": [
        "NHS Fetal Anomaly Screening Programme"
    ],
    "pub_date": "2021-07-23T16:18:06+01:00",
    "content": [
        {
            "text": "We have updated the image review tool for the screening support sonographer (SSS). The tool was developed to help the SSS review ultrasound images of nuchal translucency (NT) and crown rump length (CRL)."
        },
        {
            "text": "The biggest change you will notice is that we have removed scoring the images. This puts more emphasis on providing constructive feedback to the ultrasound practitioners and helps the SSS to identify when further support is required."
        },
        {
            "heading": 2,
            "text": "Other changes"
        },
        {
            "text": "The 12 criteria for NT and CRL are mostly the same, apart from a change to one of the NT criteria. We clarify that the widest section of the NT should be measured with the callipers perpendicular to the NT lines as shown in the image below."
        },
        {
            "text": "There is a new section called report and image optimisation. This section helps the SSS to check the NT and CRL measurements recorded on the report correspond to the images stored. It also supports feedback on the use of image optimisation functions on the ultrasound machine."
        },
        {
            "text": "We have brought together the 2 NT and CRL review sheets so they are now on one page, making it much easier to complete the review."
        },
        {
            "text": "We have also added a drop-down box for the SSS to select the reason for performing the image review and a section to select what further support is needed."
        },
        {
            "heading": 2,
            "text": "New addition"
        },
        {
            "text": "We have developed a template for internal logging of the 3-monthly image review. The SSS may want to use this to record that regular departmental image review is performed and feedback to the ultrasound practitioners is given."
        },
        {
            "text": "The template is included as an attachment to the FASP handbook, along with the image review tool."
        },
        {
            "heading": 2,
            "text": "Why we need to review images"
        },
        {
            "text": "Reviewing ultrasound images and providing feedback can help ultrasound practitioners to make continuous improvements to their NT and CRL measurement techniques."
        },
        {
            "text": "We hope both the SSS and ultrasound practitioners will find the new format of the image review tool easier to use and the feedback more constructive."
        },
        {
            "heading": 2,
            "text": "PHE Screening blog"
        },
        {
            "text": "The PHE Screening blog provides up to date news from all NHS screening programmes. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new blogs. If you have any questions about this blog article, or about population screening in England, please contact the PHE Screening helpdesk."
        }
    ]
}