{
    "url": "https://ruralpayments.blog.gov.uk/2021/07/23/whats-next/",
    "title": "What's next?",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Agricultural Transition",
        "Basic Payment Scheme",
        "Countryside Stewardship",
        "Environmental Stewardship",
        "Socio-economic schemes"
    ],
    "pub_date": "2021-07-23T15:19:07+01:00",
    "content": [
        {
            "text": "We’re over half way through 2021 and there is a lot of activity going on across the RPA, as we work on current and new schemes, processing applications and agreements and preparing payments."
        },
        {
            "text": "31 May 2021 saw the final date for submission of claims for Round 3 of the Countryside Productivity Small Grant (CPSG) scheme. Over 3,000 claims, representing £17 million of investment into equipment and improving productivity and efficiency for farming and horticultural businesses, were received by the deadline. RPA teams are busy working through checking remaining claims, preparing them for payment."
        },
        {
            "text": "As part of the Agricultural Transition Plan, RPA are engaged in the development of the new Future Grants schemes, utilising and building on our experience of delivering the Countryside Productivity small and large grant scheme to feed into the design of the Farming Investment Fund. The new Farming Equipment and Technology Fund, and the Farming Transformation Fund grant schemes are due to open for applications later in 2021, with more details to be published nearer the time."
        },
        {
            "text": "11 June saw the final date for submission of Basic Payment Scheme (BPS) applications and the final date for Countryside Stewardship (CS) and Environmental Stewardship (ES) revenue claims. Over 85,000 BPS applications, around 20,700 CS claims and almost 9,450 ES claims have now been received and over the next few months, we will be working hard to prepare to make payments from 1 December 2021."
        },
        {
            "text": "RPA teams are also busy working on the first stages of the Sustainable Farming Incentive (SFI) pilot, where over 2,000 farmers who expressed an interest have now been invited to submit an application. It’s important to see a healthy take up on applications as the learning from the pilot will be critical in shaping the future. Feedback on the application process has been good so far."
        },
        {
            "text": "In addition, we are preparing for the early rollout of SFI 2022, following the Agricultural Transition Plan update published by Defra on 30 June, which set out plans to launch aspects of the new scheme, with details on which standards will be included and the benefits for those farmers taking up the offer."
        },
        {
            "text": "In light of this announcement, we extended the deadline for requesting an Online Application Pack for 2022 Countryside Stewardship Mid-Tier, to give individuals a chance to consider their options, now further information on SFI 2022 has been made available. Requests for Online Application Packs have now closed, and the final deadline for receipt of 2022 CS Mid-Tier applications remains 30 July 2021."
        },
        {
            "text": "We know it’s a busy time for many, and our customers have a lot to think about and decisions to make. Our teams across the RPA are focused on continuing to deliver our schemes and remain committed to supporting agricultural and rural communities, as we navigate changes over the coming months."
        },
        {
            "text": "As always you can contact us if you need help or advice."
        },
        {
            "text": "Email: ruralpayments@defra.gov.uk"
        },
        {
            "text": "Helpline: 03000 200 301"
        },
        {
            "text": "If you have any questions about our work, please comment below. To receive further updates you can subscribe to the blog"
        }
    ]
}