{
    "url": "https://ukhsa.blog.gov.uk/2021/07/23/why-we-are-preparing-for-a-worst-case-scenario-winter-season/",
    "title": "Why we are preparing for a worst-case scenario winter season",
    "authors": [
        "Jenny Harries"
    ],
    "categories": [
        "Coronavirus (COVID-19)",
        "Immunisation and vaccination"
    ],
    "pub_date": "2021-07-23T09:35:09+01:00",
    "content": [
        {
            "text": "Everyone has made huge sacrifices to bring COVID-19 under control."
        },
        {
            "text": "The whole country is reflecting on what has been achieved in suppressing the virus and getting to a point where we can start to regain some normality."
        },
        {
            "text": "We have learned important lessons from responding to the COVID-19 pandemic and there is a brilliant opportunity to ensure these lessons can be applied in the future, with the scale and capacity needed to save lives and protect us all and with the rapid and innovative ways of working we have developed together."
        },
        {
            "text": "COVID-19 has consumed so much of our attention for the last 18 months yet there remain many other serious threats that stretch our health and social care services every year."
        },
        {
            "text": "Right now, to ensure we plan for these as well as for the continuing pandemic, our attention is on autumn and winter, ensuring we prepare for the challenges this will bring as well as continuously monitoring through the summer for ‘unseasonal’ spikes in illness we would usually see later in the year."
        },
        {
            "heading": 2,
            "text": "Flu"
        },
        {
            "text": "In particular, we are worried about flu. Like COVID-19, flu is a dangerous virus that kills thousands of people a year and hospitalises many more, putting pressure on our health and social care services as well as causing bereavement to families and loved ones."
        },
        {
            "text": "Flu is unpredictable and the rates of flu vary each year. The number of deaths we see from flu-related complications each winter season can also vary significantly from year to year. For instance, in 2014/15, a bad flu year, there were 28,000 deaths. The type of flu that is in circulation and how easily it passes from one person to another also varies."
        },
        {
            "text": "The restrictions that were in place over the autumn and winter of 2020/21 have meant that we didn’t see much flu circulating last season. We therefore thankfully avoided the double threat of flu and COVID-19 circulating at the same time, which could have had disastrous consequences for individuals and for our health and care system."
        },
        {
            "text": "However, worryingly this may mean that more people are susceptible to the illness this year, potentially leading to a challenging flu season for our NHS colleagues and our health protection teams across the country."
        },
        {
            "text": "This, combined with the likelihood of continuing circulation of COVID-19, means this coming winter will again be highly unpredictable. Planning is already under way to ensure we are well prepared for a worst-case scenario and to limit the impact on the NHS."
        },
        {
            "heading": 2,
            "text": "Vaccination programme"
        },
        {
            "text": "The flu vaccine is safe, effective and protects millions of people each year from what can be a devastating illness."
        },
        {
            "text": "That is why, as part of our commitment to build back better from the pandemic, this year England’s world-leading seasonal flu immunisation programme is being expanded even further."
        },
        {
            "text": "We have announced that a record number of children and adults will be offered the flu vaccine  – over 35 million people in total – with every young person in years 7 to 11 in secondary school now eligible for the first time, building on the expansion of the vaccine programme to Year 7 children last winter."
        },
        {
            "text": "England’s world leading flu programme achieved record take up last year, a testament to the resilience of the NHS and to the public’s determination to protect themselves and others during a winter of unprecedented challenges."
        },
        {
            "text": "This coming season, the health system is determined to build on this fantastic achievement, alongside the staggering success of our COVID-19 vaccination programme, to ensure more of the population than ever get protected against flu."
        },
        {
            "text": "We will be closely watching the data from trials to make sure the flu jab can be given alongside the COVID-19 vaccines, following the interim advice from the Joint Committee on Vaccination and Immunisation (JCVI) on delivering a COVID-19 vaccine booster programme from September for those in the more vulnerable groups."
        },
        {
            "text": "Getting vaccinated against both viruses will not only help to protect us and our loved ones from flu and COVID-19 but will help protect the nation from a potentially devastating double threat this winter."
        },
        {
            "heading": 2,
            "text": "RSV"
        },
        {
            "text": "Another infection that we are concerned about as we approach autumn is Respiratory Syncytial Virus (RSV)."
        },
        {
            "text": "RSV is a common seasonal winter virus which causes coughs and colds and is the most common cause of bronchiolitis in children aged under 2 years It can be more severe in premature babies, babies under 2 months of age and vulnerable infants with certain underlying conditions that increase their risk of acute lower respiratory tract infection."
        },
        {
            "text": "The RSV season in the UK typically begins in the autumn, earlier than the adult flu season, and runs through winter."
        },
        {
            "text": "During the last year there has been a remarkable reduction in respiratory viral infections other than COVID-19. This means that there is an increasing number of young children who have never been exposed to these common viruses."
        },
        {
            "text": "As restrictions ease and people mix more, we are expecting to see a significant rise in the total number of RSV cases and admissions."
        },
        {
            "text": "We are working closely with the NHS and colleagues across the health system to monitor this closely, as well as ensuring that parents, carers and health professionals are aware of the symptoms of RSV and know what to do if they are concerned."
        },
        {
            "text": "Finally, let’s remember that we can and must all play our part to reduce the impact of infectious disease on individuals, their families and their communities and simultaneously to reduce the pressure on health and social care and other public services this coming winter, so everyone can continue to receive the support they need."
        },
        {
            "text": "The good hygiene habits that we have become used to in the COVID-19 pandemic are important defences against a range of other infections, including flu and RSV. We should continue to practice them."
        },
        {
            "text": "This includes washing our hands regularly for 20 seconds, using a tissue to catch coughs and sneezes and keeping away from others when feeling unwell."
        }
    ]
}