{
    "url": "https://dluhcdigital.blog.gov.uk/2023/03/01/dluhc-awards-local-planning-authorities-funding-to-improve-the-digital-services-they-use-for-planning-applications/",
    "title": "DLUHC awards Local Planning Authorities funding to improve the digital services they use for planning applications",
    "authors": [
        "Digital Planning"
    ],
    "categories": [
        "Digital Planning",
        "Planning Software"
    ],
    "pub_date": "2023-03-01T14:41:02+00:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "DLUHC is funding 19 more councils to lead and take part in digital projects that will encourage quicker planning decisions and improve digital planning software."
        },
        {
            "text": "The DLUHC Digital Planning Programme supports Local Planning Authorities (LPAs) to improve technology for the submission and processing of planning applications. "
        },
        {
            "text": "Our latest round of funding via the Planning Software Improvement Fund is supporting a further 19 LPAs to improve their software through collaborative projects. "
        },
        {
            "heading": 3,
            "text": "Funded LPAs"
        },
        {
            "text": "The programme's planning software team is taking a multifaceted approach to enabling Local Planning Authorities to adopt modern planning software, for this reason the £5.3 million fund was split into three tracks. LPAs could either:"
        },
        {
            "heading": 3,
            "text": "Track 1"
        },
        {
            "text": "Successful LPAs in track one will join the existing Open Digital Planning project teams to co-design and deliver new, open source software - PlanX and BOPS. "
        },
        {
            "text": "This is a fantastic opportunity for LPAs to have their own resident and council officer needs inform how the new services are built, to learn how to develop user centred software in an agile way, and to deliver working software to residents and council officers at regular intervals. "
        },
        {
            "text": "The successful LPAs are:"
        },
        {
            "heading": 3,
            "text": "Track 2"
        },
        {
            "text": "Successful LPAs in track two have been funded to build on their council’s existing planning software by adopting either PlanX or BOPS. This will enable LPAs to gradually adopt modern planning software whilst maintaining existing processes and services where needed. "
        },
        {
            "text": "The successful LPA for adopting BOPS and developing an integration with Planning Portal is:"
        },
        {
            "text": "The successful LPAs for Adopting Plan X and developing an integration with their existing back office software are:"
        },
        {
            "heading": 3,
            "text": "Track 3"
        },
        {
            "text": "Successful LPAs in track three have been funded to work with one or more of their existing suppliers to improve the interoperability between services already in place. "
        },
        {
            "text": "Workstream examples include a project to prototype how councils can automate the submission of quarterly reports on their planning service performance to DLUHC’s central data reporting system, and a project to create a Geographic Information System (GIS) linked online form that can advise applicants on the documents they need to include with their household planning application."
        },
        {
            "text": "LPAs receiving funding via this track are:"
        },
        {
            "text": "This inaugural round of the Planning Software Improvement Fund builds on the success of its previously funded projects to help leverage LPAs capability to adopt modern planning software products. Within the next year we hope to open this funding to subsequent LPAs who share ambition to progress towards improved planning software. "
        },
        {
            "heading": 3,
            "text": "Staying up to date "
        },
        {
            "text": "Beyond supporting the development of software and new digital services, the DLUHC Digital Planning Programme aims to make plan making faster and more effective, give better access to planning data and improve local community engagement through initiatives like the Planning Data Platform and PropTech Innovation Fund."
        },
        {
            "text": "To stay up to date with the work of the programme, find out about future funding rounds and read more on policy developments, follow us on LinkedIn and Twitter or visit our website. "
        },
        {
            "text": "You can find out more about the Open Digital Planning Project on its dedicated website or on Twitter. "
        }
    ]
}