{
    "url": "https://insidehmcts.blog.gov.uk/2023/03/01/improving-the-welsh-language-services-at-hmcts/",
    "title": "Improving the Welsh language services at HMCTS",
    "authors": [
        "Hywel Hughes"
    ],
    "categories": [
        "Court and tribunal reform",
        "Customer experience and research",
        "Digital services"
    ],
    "pub_date": "2023-03-01T10:09:46+00:00",
    "content": [
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "text": "As Head of the Welsh Language Unit, I want to share some of the exciting developments that are currently taking place in relation to the services we offer."
        },
        {
            "heading": 2,
            "text": "Welsh language services at HMCTS"
        },
        {
            "text": "At HMCTS, we’re committed to making sure that courts and tribunals users can communicate with us in Welsh if they choose to do so."
        },
        {
            "text": "Our Welsh Language Unit offers a service so our customers can talk to us or email us in Welsh, and the feedback we receive from Welsh speakers is positive. Many of our online services are available in Welsh and you can access our online Welsh language services on GOV.UK."
        },
        {
            "heading": 2,
            "text": "Developing online services"
        },
        {
            "text": "We’re working hard alongside our colleagues in digital teams to make sure that more online services are available in Welsh."
        },
        {
            "text": "Historically, Welsh services have been developed after the English service has gone live, but we want to change this."
        },
        {
            "text": "The new “submit a claim” service within the Employment Tribunal has been developed in Welsh at the same time as the English. This means that when the service is rolled out nationally, it will be available in both languages at the same time."
        },
        {
            "text": "We’ll also shortly be developing the Welsh language service for litigant-in-person vs legal representative which will be the first journey within civil reform to be available in Welsh."
        },
        {
            "text": "Another exciting development on the horizon is our “microservice”. This service will automatically provide Welsh translations for services on MyHMCTS. This opens up our services to more Welsh speaking professional users."
        },
        {
            "text": "Soon, we hope to offer webchat functionality in Welsh, meaning users will be able to access almost immediate guidance and support online."
        },
        {
            "heading": 2,
            "text": "Promoting our Welsh language services"
        },
        {
            "text": "Providing services in Welsh is important, but that’s only half the story. Our services need to be consumed by Welsh speakers."
        },
        {
            "text": "We’ve seen a near 50% upturn in the number of people calling our Welsh language helplines, but we can always do more."
        },
        {
            "text": "Over the next few months we will focus on raising awarness our Welsh language services and making sure that court and tribunal users who want to communicate with us in Welsh are aware of what we offer."
        },
        {
            "heading": 2,
            "text": "Welsh Language Scheme"
        },
        {
            "text": "In my first blog post, I wrote about our Welsh Language Scheme and how we take the obligations of the scheme very seriously. Our Welsh Language Scheme demonstrates our commitment to offering a Welsh language service for all courts and tribunals users who want to communicate with us in Welsh. It also explains how we’ll make sure that the English and Welsh languages are treated equally when we provide public services in Wales."
        },
        {
            "text": "Today (1 March 2023) we’ve published our revised Welsh Language Scheme, which we hope is more user-friendly in terms of explaining our Welsh language provisions."
        },
        {
            "text": "We’ve concentrated on strengthening our commitments to the Welsh language. We’ve introduced 3 standards that not only place a duty upon us not to treat the Welsh language less favourably than the English language, but also to ensure that any policy initiatives do not produce an adverse impact on the ability of people in Wales to use the Welsh language."
        },
        {
            "text": "This is the fourth iteration of the scheme since I joined HMCTS in 2016, and it’s encouraging to see the evolution of the scheme, and our commitment to providing a more consistent Welsh language service for our users."
        },
        {
            "text": "\n[English] - [Cymraeg]"
        },
        {
            "heading": 1,
            "text": "Gwella Gwasanaethau Cymraeg yn GLlTEF"
        },
        {
            "text": "Fel Pennaeth Uned yr Iaith Gymraeg, rwyf eisiau rannu rhai o'r datblygiadau cyffrous sy'n digwydd ar hyn o bryd mewn perthynas â'r gwasanaethau rydym yn eu cynnig."
        },
        {
            "heading": 2,
            "text": "Gwasanaethau Cymraeg yn GLlTEF "
        },
        {
            "text": "Yn GLlTEF, rydym wedi ymrwymo i sicrhau y gall defnyddwyr y llysoedd a’r tribiwnlysoedd gyfathrebu â ni yn Gymraeg os ydynt yn dewis gwneud hynny."
        },
        {
            "text": "Mae ein Huned Iaith Gymraeg yn cynnig gwasanaeth fel bod modd i'n cwsmeriaid siarad â ni neu anfon e-bost atom yn Gymraeg, ac mae'r adborth rydyn ni'n ei gael gan siaradwyr Cymraeg bob amser yn gadarnhaol ac yn ennyn canmoliaeth."
        },
        {
            "text": "Mae llawer o'n gwasanaethau ar-lein ar gael yn Gymraeg ac mae modd eu gweld yma: Defnyddio gwasanaethau'r llywodraeth yn Gymraeg."
        },
        {
            "heading": 2,
            "text": "Datblygu gwasanaethau ar-lein"
        },
        {
            "text": "Rydyn ni'n gweithio'n galed ochr yn ochr â'n cydweithwyr yn y timau digidol i sicrhau bod mwy o wasanaethau Cymraeg ar gael ar-lein. Yn hanesyddol, datblygwyd gwasanaethau Cymraeg ar ôl i’r gwasanaeth Saesneg gael ei gyflwyno’n genedlaethol, ond rydym eisiau newid hyn."
        },
        {
            "text": "Mae’r gwasanaeth \"cyflwyno hawliad\" newydd o fewn y Tribiwnlys Cyflogaeth wedi ei ddatblygu yn Gymraeg ar yr un pryd â'r Saesneg. Mae hyn yn golygu pan fydd y gwasanaeth yn cael ei gyflwyno yn genedlaethol, mi fydd ar gael yn y ddwy iaith ar yr un pryd."
        },
        {
            "text": "Byddwn hefyd yn datblygu'r gwasanaeth Cymraeg ar gyfer ymgyfreithwyr drostynt eu hunain v cynrychiolydd cyfreithiol yn y man. Hon yw’r siwrnai gyntaf o fewn y rhaglen ddiwygio ym maes gwaith sifil i fod ar gael yn Gymraeg."
        },
        {
            "text": "Datblygiad cyffrous arall ar y gorwel yw ein \"micro-wasanaethau\". Bydd y gwasanaeth hwn yn darparu cyfieithiadau Cymraeg yn awtomatig ar gyfer gwasanaethau ar MyHMCTS. Bydd hyn yn amlygu ein gwasanaethau i fwy o ddefnyddwyr proffesiynol Cymraeg."
        },
        {
            "text": "Yn fuan, rydym yn gobeithio cynnig y gallu i sgwrsio ar y we yn Gymraeg, sy'n golygu y bydd defnyddwyr yn gallu dod o hyd i ganllawiau a chefnogaeth ar-lein bron ar unwaith."
        },
        {
            "heading": 2,
            "text": "Hybu ein gwasanaethau Cymraeg"
        },
        {
            "text": "Mae darparu gwasanaethau yn Gymraeg yn bwysig, ond dim ond hanner y stori yw hynny. Mae angen i'n gwasanaethau gael eu defnyddio gan siaradwyr Cymraeg."
        },
        {
            "text": "Rydym wedi gweld cynnydd o bron i 50% yn nifer y bobl sy'n ffonio ein llinell gymorth Gymraeg, ond mae lle i wella bob amser."
        },
        {
            "text": "Dros y misoedd nesaf byddwn yn canolbwyntio ar hybu ein gwasanaethau Cymraeg a gwneud yn siŵr bod defnyddwyr y llysoedd a’r tribiwnlysoedd sydd eisiau cyfathrebu â ni yn Gymraeg yn ymwybodol o'r hyn rydym yn ei gynnig."
        },
        {
            "heading": 2,
            "text": "Cynllun Iaith Gymraeg "
        },
        {
            "text": "Yn fy mlog cyntaf, ysgrifennais am ein Cynllun Iaith Gymraeg a sut rydym yn cymryd rhwymedigaethau'r cynllun o ddifrif. Mae ein Cynllun Iaith Gymraeg yn dangos ein hymrwymiad i gynnig gwasanaeth Cymraeg i bob defnyddiwr llys a thribiwnlys sydd eisiau cyfathrebu gyda ni yn Gymraeg. Mae hefyd yn egluro sut y byddwn ni'n sicrhau bod yr iaith Gymraeg a'r Saesneg yn cael eu trin yn gyfartal pan fyddwn ni'n darparu gwasanaethau cyhoeddus yng Nghymru."
        },
        {
            "text": "Heddiw (1 Mawrth 2023) rydym wedi cyhoeddi ein Cynllun Iaith Gymraeg diwygiedig, â’r gobaith yw, y bydd yn haws i’w ddefnyddio o ran egluro ein darpariaethau Cymraeg."
        },
        {
            "text": "Rydym wedi canolbwyntio ar gryfhau ein hymrwymiad i'r Gymraeg. Rydym wedi cyflwyno 3 safon sydd nid yn unig yn rhoi dyletswydd arnom i beidio â thrin y Gymraeg yn llai ffafriol na'r Saesneg, ond hefyd i sicrhau nad yw unrhyw fentrau polisi yn creu effaith andwyol ar allu pobl yng Nghymru i ddefnyddio'r Gymraeg."
        },
        {
            "text": "Dyma bedwerydd fersiwn y cynllun ers i mi ymuno â GLlTEF yn 2006, ac mae'n galonogol gweld esblygiad y cynllun, a'n hymrwymiad  i ddarparu gwasanaethau Cymraeg cyson i'n defnyddwyr."
        }
    ]
}