{
    "url": "https://ipo.blog.gov.uk/2023/03/01/meet-the-ipo-board-deputy-ceo-andy-bartlett/",
    "title": "Meet the IPO Board: Deputy CEO Andy Bartlett",
    "authors": [
        "Jenny Manders"
    ],
    "categories": [
        "Innovation",
        "IPO",
        "Transformation"
    ],
    "pub_date": "2023-03-01T12:10:50+00:00",
    "content": [
        {
            "text": "In the second instalment of our ‘Meet the IPO Board’ series, we chatted to Deputy CEO and Director of Services, Andy Bartlett, about his time at the IPO and where he wants the IPO to be in the future."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "What led you to join the IPO?"
        },
        {
            "text": "Before joining the IPO I'd had a variety of jobs – including labouring, early morning Post Office shifts - but I was really lucky that when I was making some career choices, the IPO was just moving to Newport. As a Newport lad, that very much suited me."
        },
        {
            "heading": 3,
            "text": "Tell us about your time at the IPO  "
        },
        {
            "text": "Since joining the IPO, I've had a huge variety of roles, which has given me a really good understanding of what the IPO does and how important IP is to our customers."
        },
        {
            "text": "I started as a Patent Examiner, examining electrical subject matter and using my physics degree. But I've also done a variety of other roles, including in the policy area working on innovation policies – so, what the IP system can do to help businesses make the most of their creativity and their innovation.  "
        },
        {
            "text": "I've done some work on some really practical initiatives like the Patent Prosecution Highway, to help businesses who want to get that international protection."
        },
        {
            "text": "I’ve worked with IP Offices from Japan, from the US, South America, India, China, had some great opportunities to see things from different perspectives, to understand a bit about the markets that our businesses, our UK companies, want to operate in, and some of the problems that they're having. Then helping to take some practical steps to make those challenges a little bit easier to navigate."
        },
        {
            "text": "One of the most challenging but rewarding things I've done was when I was practice lead in the area of computer implemented inventions. That involved going to court and advising counsel to try to get clarity on the law and the way that we implement it in the UK. This was hugely challenging because it was really important to our customers who were trying to get protection that they might have been able to get in other countries. Unsurprisingly, they couldn't understand why they couldn't get it in the UK."
        },
        {
            "heading": 3,
            "text": "Tell us about leading the ‘One IPO Transformation’ programme"
        },
        {
            "text": "My priorities for the future of the IPO are that we continue to deliver the One IPO Transformation programme that we've already begun. It will revolutionise the way that we deliver services for our customers to really bring them into the 21st century. "
        },
        {
            "text": "As part of that, we will really want to deliver those systems more efficiently. That should then give us the opportunity to be able to do more things as an Office to support British businesses.  "
        },
        {
            "text": "My ambition, once we have transformed the services we offer within the UK, is for us to use the credibility that gives us to influence how the system might develop internationally, to make sure that the IP system stays relevant to businesses in the 21st century."
        },
        {
            "text": "That's really important because the way that businesses want to operate is now very different from the way that the system was originally set up back in the 19th century. People need to get global protection, they want to market their products across borders and collaborate with more partners internationally, so everything that we do to help remove obstacles and barriers to cross-border trade, would be hugely important for British businesses in future. "
        },
        {
            "text": " I really want the UK systems to be seen as an exemplar for what a great Office and a great IP system can deliver. That means fast, modern, flexible services delivered efficiently to give customers everything that they can reasonably expect from us."
        },
        {
            "heading": 3,
            "text": "What part will people play in the transformation of IPO’s services? "
        },
        {
            "text": "Our people play a critical role in helping us to deliver our services for our customers. IPO is a brilliant place to work. It gives people fantastic opportunities to work on and with the very latest technology. It gives people huge opportunities to be able to develop themselves and then to help contribute to UK economy. "
        },
        {
            "text": "I will be doing everything that I can to ensure that we give our people all the skills and the tools that they need to be able to operate most effectively, and of course to deliver fantastic service for our customers."
        },
        {
            "text": " "
        }
    ]
}