{
    "url": "https://aphascience.blog.gov.uk/2023/03/01/plant-passports/",
    "title": "How we are keeping plants healthy in the age of online sales",
    "authors": [
        "Dan Munro"
    ],
    "categories": [
        "Plant health"
    ],
    "pub_date": "2023-03-01T13:05:23+00:00",
    "content": [
        {
            "text": "An increase in online plant sales has brought an increased threat of plant pests and diseases. Dan Munro, Senior Technical Manager for Plant Passporting at the Animal and Plant Health Agency (APHA), explains what we are doing to reduce these risks:"
        },
        {
            "text": "The green shoots of my career in plant health coincided with the inception of Google in 1998. Back then, online trade was in its infancy, and social media sites were yet to come into existence."
        },
        {
            "text": "Fast-forward to the present day and online plant sales are booming. Plants provide the UK with an estimated annual value of £15.7 billion. But with the increase in plant sales comes an increased threat of plant pests and diseases."
        },
        {
            "heading": 3,
            "text": "Plant passporting"
        },
        {
            "text": "Plant passporting originated in 1993 as an EU initiative to ensure traceability and assurance around the movement of plants within the EU. To help address the challenges of online trading, the EU’s plant health legislation was updated in 2019 to include the regulation of distance contracts (including online sales, mail-orders, and direct-to-customer trade)."
        },
        {
            "text": "Following the UK leaving the EU the Department for the Environment, Food and Rural Affairs (Defra), introduced a UK plant passporting scheme. This scheme  requires any professional plant supplier (professional operator) in England or Wales selling plants by distance contract, or to other professional operators within Great Britain, the Isle of Man or the Channel Islands, to issue plant passports. To do this, professional operators must register on APHA’s database and then apply for authorisation, Scotland and Northern Ireland have similar schemes."
        },
        {
            "text": "Once authorised, the professional operator becomes an authorised operator (AO) and can then attach a plant passporting label (the plant passport) for each plant or batch of plants, which must travel with the plants. This means that if a pest or disease is found, APHA can easily and quickly trace all relevant plants to reduce the risk of an outbreak."
        },
        {
            "text": "APHA staff perform audits of AOs each year. As part of this, AOs need to demonstrate that they know where their plants have come from and where they have gone. They should also be able to show that they are aware of any risks associated with the plants they are trading and take steps to mitigate them."
        },
        {
            "heading": 3,
            "text": "Plant biosecurity strategy"
        },
        {
            "text": "The growth in online trade has become such a big issue that it was included in the new Plant Biosecurity Strategy for Great Britain, launched in January 2023."
        },
        {
            "text": "The strategy is a collaboration between the UK Government, Scottish Government, Welsh Government and the Forestry Commission and sets out a five-year vision for plant health. This positions the UK as a global leader in plant biosecurity and sets out our vision to create a new biosecurity regime and bio-secure plant supply chain, safeguarding food security and helping to mitigate the effects of climate change."
        },
        {
            "heading": 3,
            "text": "Internet Trading Unit"
        },
        {
            "text": "One of the important announcements in the Plant Biosecurity Strategy was the expansion of APHA’s Internet Trading Unit (ITU), which monitors online retailers and social media sites trading high-risk plant products. They offer guidance on everything from compliance to purchasing from certified suppliers and import with the aim of reducing the introduction of potentially devastating pests and diseases into the country."
        },
        {
            "text": "The ITU is now starting to engage and work with sales and social media platforms to ensure plants sellers on their sites are legitimate."
        },
        {
            "heading": 3,
            "text": "Find out more"
        },
        {
            "text": "If you enjoyed this blog, you might be interested in finding out more about plant health and plant passporting."
        },
        {
            "text": "For questions about plant passporting, contact PlantPassportRegistration@apha.gov.uk."
        },
        {
            "heading": 3,
            "text": "Subscribe to our science blog"
        },
        {
            "text": "Throughout the year, we publish blogs which highlight the breadth of scientific work we are involved in as well as sharing our latest news and events we have attended."
        },
        {
            "text": "Subscribing to our blog takes seconds and you will receive instant email alerts as soon as new blogs are published so why not subscribe today!"
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}