{
    "url": "https://despatch.blog.gov.uk/2023/03/01/why-were-thinking-about-raising-the-standards-check-pass-mark/",
    "title": "Why we’re thinking about raising the ADI standards check pass mark ",
    "authors": [
        "Nick Taylor"
    ],
    "categories": [
        "Driving instructors",
        "Helping someone to learn to drive?"
    ],
    "pub_date": "2023-03-01T11:33:08+00:00",
    "content": [
        {
            "text": "The format of the approved driving instructor (ADI) part 3 qualification test and the ADI standards check have been in place for several years. I believe they are a significant improvement on the previous assessments."
        },
        {
            "text": "They provide an opportunity for ADIs and trainee driving instructors to show their skills and how they can help pupils better prepare to drive safely and independently. However, it’s time to think about whether we need to make further changes to ensure all pupils are getting the highest standards of instruction from all ADIs."
        },
        {
            "text": "This survey asks for your feedback on the proposal to raise the pass mark of the standards check from 31 out of 51 to 33 out of 51. The pass mark for the ADI part 3 test will remain the same at 31."
        },
        {
            "text": "I want to use this blog to explain the reasons behind the suggestion and how I feel it can help to raise the standard of teaching for your pupils."
        },
        {
            "heading": 2,
            "text": "Teaching should improve with experience"
        },
        {
            "text": "It’s reasonable to think that as driving instructors become more experienced, their skills and competencies will improve and they should become better instructors, providing a higher standard of training to their pupils."
        },
        {
            "text": "We recommend that driving instructors undertake regular continuing professional development (CPD) throughout their career to support their growth as professionals. You can find driving instructor training on GOV.UK"
        },
        {
            "text": "As a result, we would expect experienced ADIs to perform at a higher level than an inexperienced potential instructor taking their qualification test."
        },
        {
            "text": "The proposed increase in the standards check pass mark is very achievable. It would help us all to continue raising standards within the driver training industry. It would also show to learner drivers and their parents that, once qualified, instructors not only maintain their skills but develop and improve them."
        },
        {
            "heading": 2,
            "text": "Other measures to help raise standards"
        },
        {
            "text": "Last year we introduced an engagement call for candidates with ADI examiners before standards checks."
        },
        {
            "text": "We recently added a compulsory engagement call to the official register of driving instructor training (ORDIT) assessments as well."
        },
        {
            "text": "This has had a positive response from those who have been able to take advantage of this opportunity. The impact of any increase in the standard check pass mark would feature in these conversations alongside support and advice on how to best prepare for the assessment."
        },
        {
            "heading": 2,
            "text": "Have your say"
        },
        {
            "text": "You can fill in the survey here."
        },
        {
            "text": "I encourage all ADIs to read it and share your thoughts with us, not just on raising the standards check pass mark but also on how we can best continue to raise professional standards of driver training."
        },
        {
            "text": "Improving the standard of teaching is an ongoing process and we need your support to help us make the right changes to offer the best level of training to your pupils."
        }
    ]
}