{
    "url": "https://mojdigital.blog.gov.uk/2023/03/01/womens-history-month-super-women-in-tech-in-networks-voice-video-services/",
    "title": "Women’s History Month : Super Women In Tech in Networks, Voice & Video Services",
    "authors": [
        "Lindsay Hancock"
    ],
    "categories": [
        "gender equality",
        "International Women's Day",
        "Our People",
        "Our services",
        "Women in Tech"
    ],
    "pub_date": "2023-03-01T16:05:29+01:00",
    "content": [
        {
            "text": "Kicking off Women’s History Month we have some inspiring stories of some very inspiring women, taking us through their career journeys, and how and why they ended up working here at Justice Digital."
        },
        {
            "text": "Lindsay Hancock – Delivery Manager – Deputy Director"
        },
        {
            "text": "In June 2021, I was part of the private Probation Service (CRC) harmonisation to the MoJ. I worked as the Head of Systems previously, which was my first role within the tech industry. Prior to, I was the Quality Assurance Lead within the CRC and worked as a Probation Service Officer directly before. My background has always been people focused and service improvement led. I never thought I’d work in tech, let alone enjoy it as much as I do."
        },
        {
            "text": "All my career I have worked within a role that acts to have a positive social impact on the lives of others. Tech has a crucial part to play in this. Working within Justice Digital is the perfect home to combine my passion for people and tech, getting it right makes a huge difference to the people we serve, and I believe that is embedded within the culture here."
        },
        {
            "text": "Faith Dina – Infrastructure Engineer Networks – WAN/EDGE Team"
        },
        {
            "text": "I have 7 years experience working in the technology industry. I started out as a pre-sales Engineer, then moving on to become a solutions architect. I then spent the next 2.5 years working as an Infrastructure Engineer installing, configuring and maintaining physical and virtual network devices. Working in this role helped me develop strong technical and business acumen, while meeting business requirements."
        },
        {
            "text": "I was attracted to Justice Digital as I wanted to be part of a team that made a difference in the lives of vulnerable people using technology. There are vast learning opportunities here, through training, getting hands-on experience and shadowing others. I also enjoy working with such a diverse team who are resourceful and have a great work ethics."
        },
        {
            "text": "Rebecca Canning – Associate Product Manager"
        },
        {
            "text": "I did my degrees in Architecture, of the construction variety not IT variety! I worked for a number of private practices after this. I decided to switch careers and joined the Civil Service Fast Stream on the Digital Stream. I worked in a variety of roles and departments, but loved the challenge of technical services and product management."
        },
        {
            "text": "I'd heard a lot of good things from other women Fast Streamers about how much they enjoyed their time in Justice Digital!"
        },
        {
            "text": "I like how tangible it is that my work will help someone going through the courts or prison, so to do a good job will mean that a user barely notices the tech they are interacting with. Video services have been in the media recently too, and in a very positive light about the visibility of justice and how helpful it is to have different ways to access the courts - so it's a refreshing change!"
        }
    ]
}