{
    "url": "https://marinedevelopments.blog.gov.uk/2023/03/01/world-seagrass-day-protecting-our-precious-marine-habitats-together-at-studland/",
    "title": "World Seagrass Day - Protecting our precious marine habitats together at Studland",
    "authors": [
        "Dan Cutler, Communications & Engagement Manager"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2023-03-01T12:57:35+00:00",
    "content": [
        {
            "text": "It’s World Seagrass Day and we’re eager to highlight the conservation work that’s underway to protect this vitally important habitat at Studland Bay in Dorset. "
        },
        {
            "text": "The United Nations General Assembly has proclaimed 1 March as World Seagrass Day. Their resolution highlights the urgent need to raise awareness, promote and facilitate actions for the conservation of seagrasses around the world. "
        },
        {
            "text": "  "
        },
        {
            "text": "At Studland Bay, the Marine Management Organisation (MMO) and Studland Bay Marine Partnership (SBMP) have developed a strategy to protect local seagrass beds for the future. Our work has included the introduction of a voluntary no anchor zone at Studland, to protect the seagrass habitat and the species that it supports from the damage caused by the dropping and weighing of anchors. A designated protected feature of the Studland Bay Marine Conservation Zone (MCZ), we want to ensure that marine activities, such as boating at this popular destination, can continue in a sustainable way.   "
        },
        {
            "text": " "
        },
        {
            "text": "Facts about seagrass  "
        },
        {
            "text": "Image below of deep snouted pipefish. "
        },
        {
            "text": " "
        },
        {
            "text": "What can you do? "
        },
        {
            "text": "You can help protect seagrass at Studland Bay and join others in the visiting and local boating community who have already made positive changes. With seagrass habitats being lost worldwide this is an opportunity to help conserve the seagrass meadow in Studland’s beautiful bay. "
        },
        {
            "text": "The MMO and SBMP, encourages everyone to avoid anchoring in seagrass beds located off South Beach out to Old Harry Rocks. Please also take care when moving in the nearshore area of South Beach as seagrass beds and the breeding areas for the legally protected long snouted seahorses, may be disturbed. We ask that you consider mooring in other areas to prevent damage to this precious habitat.  "
        },
        {
            "text": "We also recognise that this area is important safety refuge for vessels. Safety of life at sea will always come first. Everyone has the right to anchor under emergency conditions, or to avoid a genuine emergency situation, within Studland Bay. "
        },
        {
            "text": "Find out more about our work to manage the Studland Bay MCZ. "
        },
        {
            "text": " "
        }
    ]
}