{
    "url": "https://environmentagency.blog.gov.uk/2024/07/16/anglian-water-services-ltd-fined-50k-in-case-brought-by-the-environment-agency/",
    "title": "Anglian Water Services Ltd fined £50k in case brought by the Environment Agency",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Environment Agency",
        "Water"
    ],
    "pub_date": "2024-07-16T09:48:55+00:00",
    "content": [
        {
            "text": "We continue to work on our largest ever criminal investigation, to date, into potential breaches of environmental permit conditions by all water and sewerage companies discharging into English waters."
        },
        {
            "text": "The extent of potential non-compliance involves more than 2,000 wastewater treatment works."
        },
        {
            "text": "Last week the investigation team were in court for the sentencing hearing of Anglian Water Services Ltd. The company was ordered to pay over £50,000 in fines and costs in a case brought as part of our wider criminal investigation."
        },
        {
            "text": "This is the first conviction of its kind by the Environment Agency against a water company and sets a precedent for the regulation of non-compliant companies."
        },
        {
            "text": "Anglian Water Services Ltd were ordered to pay a £25,000 fine, £190 victim surcharge and £25,000 in costs for failing, without reasonable excuse, to comply with a requirement to provide records to the Environment Agency."
        },
        {
            "text": "The sentencing hearing took place on 5 July at Peterborough Magistrates’ Court after the water company was convicted on 24 May 2024."
        },
        {
            "text": "Since launching the investigation into Anglian Water Service Ltd.’s compliance, the Environment Agency has served several statutory requirements for records on the company. Anglian Water Services Ltd has been convicted of failing, without reasonable excuse, to respond to one of these notices, served between dates in January 2022 and January 2023."
        },
        {
            "text": "Anglian Water Services Ltd had entered not guilty pleas to the three charges laid, claiming that they had a reasonable excuse for non-compliance. Having heard the evidence in the case, District Judge Kenneth Sheraton rejected the water company’s claim for one charge, finding the charge proven and leading to the sentence above."
        },
        {
            "text": "This ruling is an important step forward in our regulation and driving transparency from the water industry. Our investigation into potential cases of non-compliance across the sector continues."
        },
        {
            "text": "Progress on the wider investigation"
        },
        {
            "text": "To date, the investigation team has reviewed over 30,000 exhibits and taken over 850 statements. The team is now approaching external witnesses for statements to help them further build their case."
        },
        {
            "text": "When the investigation is complete, we will consider all options available under our enforcement and sanction policy. Environmental permits exist to protect our environment and limit the impact of pollution; water companies have a legal responsibility to comply with their permit conditions."
        },
        {
            "text": "While our investigation continues, our teams continue to conduct normal water company regulation activity at wastewater treatment works including auditing their compliance records and responding to reports of pollution incidents."
        },
        {
            "text": "As with any live criminal investigation, we are very limited as to what we can share about our inquiries. However, we are committed to sharing information where we can."
        },
        {
            "text": "You can find more information about this investigation here."
        },
        {
            "text": " "
        }
    ]
}