{
    "url": "https://defraenvironment.blog.gov.uk/2024/07/16/celebrating-nature-on-our-doorstep-a-tale-of-seven-blackbirds/",
    "title": "Celebrating nature on our doorstep: a tale of seven blackbirds",
    "authors": [
        "Jess Everett"
    ],
    "categories": [
        "Biosecurity",
        "Nature"
    ],
    "pub_date": "2024-07-16T11:34:01+01:00",
    "content": [
        {
            "text": "My name is Jess, and I head up the Nature Comms team at Defra. It’s my team who looks after this blog."
        },
        {
            "text": "It’s not often that we publish truly personal stories on this blog, but this one is different. To be honest, part of my motivation for writing it was simply that I ran out of friends and family to bore with my endless updates."
        },
        {
            "text": "So, here goes. A simple celebration of the nature right on our doorsteps."
        },
        {
            "text": "On Saturday 4 May I discovered a bird nest in the hedge a couple of metres from my back door, just above head height."
        },
        {
            "text": "Lifting my phone up to snap a quick photo of its interior, I was delighted to see a cluster of chicks – their pink backs and grey wings folded over each other in such a way that you couldn’t tell where one chick ended and the next began."
        },
        {
            "text": "I immediately went online and ordered a doorbell-style camera, so that I could keep an eye on the nest. When it arrived the next day, I made it a wire cradle and quickly hooked it onto a branch overlooking the nest without disturbing its occupants."
        },
        {
            "text": "We were then treated to a constant stream of video clips (see the compilation video below). They revealed that the chicks’ parents – a sleek black male with yellow beak and eyes, and a rounder, greyish-brown female – were blackbirds."
        },
        {
            "text": "Just recently, the British Trust for Ornithology (BTO) published a press release stating that UK blackbird numbers in south-East England are in decline, linked to the recent appearance of a new mosquito-borne virus called Usutu. They need all the help they can get."
        },
        {
            "text": "Those first videos also revealed that there were 5 chicks in the nest. As a parent approached the nest, you could see their 5 beaks gaping open to present bright orange-yellow targets for the incoming food. (Did I mention I’d ordered a big bag of mealworms, too? I religiously distributed them around my garden every morning.)"
        },
        {
            "text": "The videos showed other interesting moments, too. I had read previously about how, to keep the nest clean and dry, baby birds will produce white sacs of poo that the parents can toss over the side of the nest. Ours opted to eat them instead, which I suppose is that bit neater (and presumably helps them to recoup some of the precious nutrients spent in their tireless work to feed the chicks)."
        },
        {
            "text": "They did seem to be excellent parents. They fed the chicks constantly, so they grew noticeably bigger each day. And, on the Monday when it rained all day, the mum sat patiently on the nest – wings spread to protect the chicks beneath her, squinting against the raindrops."
        },
        {
            "text": "But it turned out that all was going a little too well. On the Tuesday evening, we heard a cacophony of harsh alarm shouts from the parents, and discovered that a magpie had made off with 3 out of the 5 chicks – taking them to a nearby roof gutter and consuming them."
        },
        {
            "text": "When I’d first discovered the nest, I knew that it would be hugely unlikely to see all 5 chicks survive. I also knew that the magpie was only feeding itself, or even its own chicks, as is natural. But it was still heart-rending. And corvids are remarkably clever creatures, so I knew that it would be back – and quickly – to get the remaining chicks."
        },
        {
            "text": "Probably erroneously comparing myself to the BBC cameramen who intervened to save some stranded penguins, I felt that just a little bit of intervention in nature would be okay. I decided 3 out of 5 chicks was quite enough for that magpie."
        },
        {
            "text": "So I hurried off to make my third nest-related purchase: a large wire hanging basket, usually for plants. When both parents were safely off finding food, I placed the basket upside-down over the nest – effectively creating a cage with bars large enough to let the parents through easily, but small enough to hopefully keep out the magpie."
        },
        {
            "text": "(It turns out that I’d unwittingly stumbled across a reasonably established solution to nest protection. One of our resident ornithologists tells me that similar cages have been used successfully to protect the nests of ground-nesting birds like waders from predators or trampling.)"
        },
        {
            "text": "And, indeed, the new hanging basket cage worked perfectly. We consoled ourselves that the 2 remaining chicks were likely to have a greater chance of survival, now that their proportion of food had more than doubled."
        },
        {
            "text": "Then, a couple of days later, I saw only one chick in the nest. A video from earlier in the morning showed the other launching itself out and over into next door’s garden."
        },
        {
            "text": "The parents divided their duties. The dad looked after the remaining nest chick (who I’d now nicknamed Solo), and the mum fed the escapee."
        },
        {
            "text": "A couple more days passed, and now Solo looked ready for his own adventure beyond the nest (yes, I’d also labelled him as a boy, for no good reason whatsoever)."
        },
        {
            "text": "He looked properly birdlike now – no longer like something prehistoric. He perched on the edge of the nest, stretching his legs and testing his wings."
        },
        {
            "text": "(I made him a landing pad of grass trimmings and fern fronds on the patio on our side, like some sort of slightly crazed mother. He didn’t use it.)"
        },
        {
            "text": "After a cautious move to a branch just next to the nest, where he spent the night, the next morning he was gone. Out into the big, dangerous world, and away from my spy camera."
        },
        {
            "text": "(Above is a compilation video of footage from the camera. Watch with the sound on for the full effect.)"
        },
        {
            "text": "So, there’s our tale."
        },
        {
            "text": "Maybe it sounds silly, but I feel hugely privileged (and not a little smug) that those blackbirds chose to make their nest right there on my back doorstep."
        },
        {
            "text": "I live in the centre of a fairly large town, with a small patio garden. It’s not the best, but I’ve tried to make it a haven for wildlife. I’ve got pots everywhere, filled with mostly native plants, and I try to make sure there’s always something in flower to support the pollinators. I leave things just messy enough to provide cover and shelter for the garden’s inhabitants and visitors. It shows that anywhere can be made to work for nature."
        },
        {
            "text": "Hopefully I adequately repaid the blackbirds for my interferences with the endless supply of mealworms (and by shouting at the magpie every time it came into the garden, post-attack)."
        },
        {
            "text": "You can help blackbirds too. The BTO is asking for anyone with access to a garden to take part in a survey about blackbird sightings. Simply sign up online."
        },
        {
            "text": "I’ll be doing it – looking out especially for Solo and his parents."
        }
    ]
}