{
    "url": "https://ipo.blog.gov.uk/2024/07/16/first-patent-filing-in-ipos-new-digital-service/",
    "title": "First patent filing in IPO’s new digital service",
    "authors": [
        "Jenny Manders",
        "David Jenkins"
    ],
    "categories": [
        "Business",
        "Patents",
        "Transformation"
    ],
    "pub_date": "2024-07-16T14:08:39+01:00",
    "content": [
        {
            "text": "The One IPO Transformation Programme is the biggest services upgrade that the IPO has had in more than 170 years of its history. Commenced in 2021 we have just reached a significant landmark on our journey: the filing of the first patent application on the new fully digital patents service. This will make applying for, managing and monitoring patents far easier for our customers.  "
        },
        {
            "heading": 3,
            "text": "Patent filing pilot takes off soon – will you be on board?"
        },
        {
            "text": "The news of the first patent being filed comes as we’re ramping up piloting of the new service. We will be enabling early access for a limited number of customers to test and feed back on the new service before its official launch to all patent applicants in 2025. "
        },
        {
            "text": "If you would like to be among those included, email the team on pilot@ipo.gov.uk to register your interest. Find out more (link): Taking part in our patents pilot - GOV.UK (www.gov.uk) "
        },
        {
            "text": "The new service will enable our customers to: "
        },
        {
            "heading": 3,
            "text": "The first patent filing – how did it go?"
        },
        {
            "text": "We were anxious to find out how the first filing went, so we spoke to those involved. Here’s what they said: "
        },
        {
            "heading": 4,
            "text": "The customer:"
        },
        {
            "text": "As the first person to file a patent using the new service, Thomas Gibb, Chief Compliance Officer from global attorneys Murgitroyd was well aware of the significance of the occasion. We asked Thomas how he found the process.  "
        },
        {
            "heading": 4,
            "text": "The Deputy CEO: "
        },
        {
            "text": "IPO’s Deputy CEO, Andy Bartlett, has led on the Transformation Programme from the very beginning, so we knew this would be a special moment for him, too. It was no surprise when he described it as a “game changer” not only for the IPO but also for our customers.  "
        },
        {
            "heading": 4,
            "text": "The Programme Lead:"
        },
        {
            "text": "Natasha Chick, IPO’s Divisional Director of Transformation, has been programme lead on the Transformation journey since 2022. She was delighted: "
        },
        {
            "text": "View the video below:"
        }
    ]
}