{
    "url": "https://environmentagency.blog.gov.uk/2024/07/16/helping-farmers-get-ready-for-winter-with-slurry-storage-support/",
    "title": "Helping farmers get ready for winter with slurry storage support",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "agriculture",
        "Environment Agency"
    ],
    "pub_date": "2024-07-16T14:36:48+00:00",
    "content": [
        {
            "text": "Is your farm winter ready? "
        },
        {
            "text": "We know winter woollies are well packed away, crops are growing, combine harvesters will soon be in the fields and many of you will have fingers crossed for dry, settled weather. But time keeps moving forward. We are launching our winter ready campaign to encourage you to look ahead and start taking steps to make sure your slurry stores are ready.  "
        },
        {
            "text": "The weather and being prepared "
        },
        {
            "text": "We don’t need to tell you this: last winter it rained – a lot. And it carried on into spring. Many farmers reported concerns about managing volumes of slurry as the never-ending rainfall meant they were a) accumulating more of it and b) couldn’t get out on their fields to spread it when the time was right.   "
        },
        {
            "text": "We want to help farmers, landowners and the supply chain for materials such as sludge and digestate prepare for the possibility of another wet winter. Over the next few weeks we will be providing information and guidance so you can be confident you are winter ready.   "
        },
        {
            "text": "What are the challenges? "
        },
        {
            "text": "Many of you will have been dealing with these problems, but to be clear, we’re focusing on:  "
        },
        {
            "text": "How to meet these challenges "
        },
        {
            "text": "We can’t do a great deal to restrict or predict (very far anyway) the rainfall. What we can do is consider some steps to take for the short term, and peer across the fields for a long view.   "
        },
        {
            "text": "1. Don’t suffer in silence: above all else, we’d ask you to contact us if you’re worried about your storage capacity for slurry. We can help you decide the best options for managing it that are within the regulations and minimise the risk of pollution. We can also advise you on longer term solutions and contingency plans.   "
        },
        {
            "text": "2. Fix the roof whilst it rains less: have a look at drainage and guttering. Are they fit for purpose and ensuring good separation of rain water and washings from parlours, yard areas and barns? (Referred to as clean and dirty water separation.)   "
        },
        {
            "text": "Ensuring good separation of clean and dirty water will minimise the amount of rainwater mixing with manure, meaning less volume for your storage. This in turn will help you comply with requirements of Farming Rules for Water on spreading only to meet crop and soil need.    "
        },
        {
            "text": "3. Don’t take any waste – we know that you may take sludge, digestate or other materials from producers and possibly have a contract to do so. We’d ask you to consider carefully the impact this may have if you’re having to store these materials because you don’t have an immediate need for them. All producers have a responsibility to ensure by-products and waste are properly disposed of and should not be pushing you into non-compliance.   "
        },
        {
            "text": "4. Take the long view – are you confident you have enough storage capacity to see you through the winter without need to spread? Here’s what the regulations say:   "
        },
        {
            "text": "Tools and advice on assessing your requirements:  "
        },
        {
            "text": "What do the regulations say?  "
        },
        {
            "text": "There are two sets of regulations that apply to the spreading of slurry (and other organic manures) and its storage. We need to keep these in view when we’re planning ahead for the possibility of another wet winter.   "
        },
        {
            "text": "Why is being winter ready important? "
        },
        {
            "text": "The value of having good slurry storage and well-maintained drainage and guttering reaches across your farm.  "
        },
        {
            "text": "Don’t worry – get in touch  "
        },
        {
            "text": "We want to provide you with the advice and guidance you need if you are concerned about your storage. We are a regulator, but we will work with farmers who are willing to work with us and we will help you find the best solutions to your situation.  "
        },
        {
            "text": "You can call or email our National Customer Contact Centre and ask to be referred to an agriculture officer for your part of the country for advice on slurry storage.  "
        },
        {
            "text": "Tel. 03708 506 506 "
        },
        {
            "text": "Email: enquiries@environment-agency.gov.uk "
        },
        {
            "text": " "
        }
    ]
}