{
    "url": "https://openpolicy.blog.gov.uk/2024/07/16/launching-a-new-film-10-years-of-ethnography-in-government/",
    "title": "Launching a new film: 10 years of ethnography in Government",
    "authors": [
        "Kyna Gourley",
        "vanessalefton"
    ],
    "categories": [
        "Policy Lab"
    ],
    "pub_date": "2024-07-16T09:15:37+01:00",
    "content": [
        {
            "text": "Policy Lab is celebrating 10 years of bringing new methods into government. An important part of our story is our pioneering use of ethnography in policymaking. We have brought our ethnographic approach to independent reviews, the creation of strategies, the development and testing of policy and services and much more. A decade on, we are launching a new film to showcase examples of our film ethnography work across government. You can watch the three-minute film here: "
        },
        {
            "text": "‘Ethnography’ is a social research method which explores people’s everyday lives. It involves spending time with participants and really listening to the ‘what’, ‘why’ and ‘how’ - in their own worlds. You can read more about the ethnographic method, and how it can provide a compelling form of evidence, here. Ethnography is one of Policy Lab’s foundational methods, and we use this approach to gather lived experience insights for policy teams. "
        },
        {
            "text": "In 2015, Kyna Gourley joined as government’s first ever film ethnographer, setting up the first in-house capability to do this work and adapting the method to policymaking. Since then, Policy Lab has worked on thirty ethnographic film projects with more than a dozen departments, using the method to improve understanding and develop powerful ideas for policy change.  "
        },
        {
            "text": "The new film showcases some of the most compelling projects we have worked on. You’ll meet participants sharing their experiences of housing, homelessness, addiction, prison and being part of the Windrush generation.   "
        },
        {
            "text": "Wendy Williams, Chair of the Windrush Lessons Learned Review  "
        },
        {
            "text": "These stories have been used to bring people’s everyday experiences into strategies, public independent reviews, and policy proposals. We have seen how ethnographic films can shift both mindsets and policies.  "
        },
        {
            "text": "Policymaker, National Crime Agency "
        },
        {
            "text": "Reflecting on this portfolio of work, we can see that film ethnography can play specific beneficial roles in the policymaking process. These include: "
        },
        {
            "text": "We’ve been honoured to spend time with people around the country who have shared their stories with us, to make policy better.  "
        },
        {
            "text": "Participant, Disability Unit project "
        },
        {
            "text": "We’re continually experimenting and looking for new ways of using ethnography to improve policymaking. If this inspires you to explore how you can use ethnographic methods, please get in touch at team@policylab.gov.uk and see our broader methods, offer and impact in our prospectus here. "
        }
    ]
}