{
    "url": "https://hmlandregistry.blog.gov.uk/2024/07/16/well-need-the-original-deeds/",
    "title": "We’ll need the original deeds",
    "authors": [
        "Matthew Davison, Operations Process Lead, and Richard Connolly, Improvement Lead, Registration Services"
    ],
    "categories": [
        "Law and practice"
    ],
    "pub_date": "2024-07-16T16:36:15+01:00",
    "content": [
        {
            "text": "From October 2024 we will no longer accept conveyancer applications for first registration based entirely on certified copies of title deeds and documents. There will be no change to how citizens lodge their applications."
        },
        {
            "heading": 2,
            "text": "Background"
        },
        {
            "text": "When a first registration application is lodged at HM Land Registry, we ask the applicant to send us all the deeds and documents relating to the title that are in their control. However, in 2016 we introduced a new process which allowed conveyancers to lodge first registration applications made up entirely of certified copies of these deeds and documents, provided certain criteria were met. This allowed customers to hold onto the original documents. "
        },
        {
            "text": "From January 2021, we started to scan first registration applications containing original deeds and documents, which has allowed us to improve the quality of copies within our records while allowing us to return the (often precious) deeds and documents to our customers immediately following scanning. "
        },
        {
            "heading": 2,
            "text": "The change"
        },
        {
            "text": "Starting in October 2024, conveyancers will be no longer be able to lodge first registration applications made up entirely of certified copy deeds and documents. From talking to customers, we know this change will both simplify things and reduce the number of requests for information (requisitions) we need to send.  "
        },
        {
            "text": "Any applications lodged in accordance with our current direction before October 2024 will be dealt with on that basis. However, after that date all applications for first registration will need to be accompanied by the relevant deeds and documents that the property owner has in their possession. Paragraph 4.4.4 of practice guide 1 explains in more detail what deeds and documents should be sent with an application for first registration. "
        },
        {
            "text": "When a first registration application supported by original deeds is lodged by a conveyancer, the original deeds will normally be scanned, and the scanned applications will go through our casework systems to await processing. While the original documents are returned to the conveyancer immediately after scanning, each application will continue to be processed according to the date received – unless a request to expedite the application is submitted. If it is not possible to scan the original deeds, they will be retained by HM Land Registry until the application is completed – see paragraph 4.4.4 of practice guide 1 for more information.   "
        },
        {
            "text": "When the application is completed, subject to any requisition which might arise, the official copy of the title plan and register will normally be issued electronically for those customers who use Business e-services. For those customers who don’t use Business e-services, the official copy of the title plan and register will be issued by post. "
        },
        {
            "text": "While processing applications there may be occasional circumstances when we need to see the original deeds again, for quality assurance purposes, and we may also need to send a requisition. We would therefore request you ensure the original deeds are easily accessible until we confirm that the application has been completed.  "
        },
        {
            "text": "This change doesn’t affect applications lodged by citizens or applications lodged by conveyancers where the original title deeds and documents have been lost or destroyed, or applications for first registration based on adverse possession – see practice guide 2 and practice guide 5 for more information. "
        },
        {
            "heading": 2,
            "text": "Why are we making the change?"
        },
        {
            "text": "We are streamlining and simplifying the way in which customers lodge applications. We know this change will not only reduce the number of requisitions customers need to resolve but will also help us deal with these applications more efficiently. Following feedback, most customers were engaged with the change and understood our reasons for implementing it.  "
        },
        {
            "text": "As customers cannot send first registration applications via our digital services, sending us the original deeds means we can scan the highest quality copies for our records. We ask conveyancers to continue to check our guidance and the information available about all our business services. "
        },
        {
            "text": "You can find further guidance about first registration applications in our practice guide 1."
        }
    ]
}