{
    "url": "https://designnotes.blog.gov.uk/2023/07/31/cross-government-heads-of-design-update/",
    "title": "Cross government heads of design update",
    "authors": [
        "Laura Yarrow - Head of Design for GOV.UK, GDS"
    ],
    "categories": [
        "Community"
    ],
    "pub_date": "2023-07-31T09:00:08+01:00",
    "content": [
        {
            "heading": 2,
            "text": "July 2023"
        },
        {
            "text": "Now that there are over 40+ people in “heads of design/ head of user-centred design (UCD)” roles in government, we want to leverage that to empower our community of practitioners. Our heads of design come from not just ministerial departments, but arms length bodies, agencies and the NHS, too. Currently this does not extend to local government design leaders, as this would be an extremely large group of people. "
        },
        {
            "text": "As part of this initiative, we would love to find out more about your world, and what you need from us, so please use the contact details below to get in touch. We’re starting small, aiming to publish a short blog each month with details of what we are actively working on, and who is doing it."
        },
        {
            "heading": 2,
            "text": "What’s new?"
        },
        {
            "text": "Recently we met in person for our cross government heads of design meeting! This meeting was well attended (not just by the 4 people in the photo!) and productive. We now have a Trello board with a backlog of activities and tasks that different heads are taking responsibility for. We encourage all heads of design across government to attend this meeting held on the first Tuesday of every month, and engage with some of the shared topics that we are all focussing on (and bring your own ones too)."
        },
        {
            "text": "Although we meet monthly online, our next in-person meeting will be in Autumn, if you are heading up a design team in government please get in touch below to be added to the invite."
        },
        {
            "heading": 2,
            "text": "What happened in our cross gov design leadership meeting"
        },
        {
            "text": "In spring, heads of design across government met in London to formalise a number of things:"
        },
        {
            "text": "We got together to discuss a few initiatives in a lean coffee format — where people suggest topics and then vote on which they want to discuss. First up was to brainstorm all the shared initiatives we want to be working on. Now that we have grown the community of design leaders in government, the chance of duplicating our work is high so we want to avoid that where possible."
        },
        {
            "text": "One of these areas of potential duplication is shared training, so we want to  reduce the effort of producing courses and training across departments. Currently each department is producing its own training, for example: introduction to UCD, Figma training and so on, and we are not sharing or reusing it outside of our organisations which we want to change. We talked about how we can start to audit and log what training exists and which organisation has created it. We decided that an MVP (minimum viable product) could be to start matching learners to these organisations running the training rather than creating new training internally. The next phase would be whether we can start to centralise some of this training and how that might work."
        },
        {
            "text": "Another hot topic was working out what tools the heads of design can and cannot access across government. If we want to collaborate, we need to know what tools are available to all to enable us to work together. This is ongoing, but an audit has been done and we are now setting up the ways to collaborate."
        },
        {
            "text": "We meet to assess the progress on all these initiatives each month, and are looking forward to sharing more of our work with the design community going forward."
        },
        {
            "heading": 2,
            "text": "Useful information and events"
        },
        {
            "heading": 2,
            "text": "Who’s working on what?"
        }
    ]
}