{
    "url": "https://environmentagency.blog.gov.uk/2023/07/31/drought-explained/",
    "title": "Drought explained",
    "authors": [
        "pressoffice"
    ],
    "categories": [
        "Water"
    ],
    "pub_date": "2023-07-31T14:27:49+00:00",
    "content": [
        {
            "text": "What is drought? "
        },
        {
            "text": "There isn’t a single definition for drought so whilst it’s caused by a period of low rainfall, the nature, timing and impacts on people, the environment, agriculture or business will vary."
        },
        {
            "text": "Some droughts are short and intense, caused by a hot, dry summer. Others are long and take time to develop over multiple seasons due to low amounts of rainfall."
        },
        {
            "text": "The main types of drought, which may occur separately or together are:"
        },
        {
            "text": "The Environment Agency (EA) monitors various indicators (such as rainfall, river flows, groundwater levels, reservoir storage, ecology, public water supplies) and will decide the level of drought an area is in."
        },
        {
            "text": "The EA also chairs the National Drought Group, bringing together government, regulators, industry and other stakeholders to provide a multi-sector overview and strategic management of drought."
        },
        {
            "text": "We use four stages to describe and manage our response:"
        },
        {
            "text": "What is the current situation? "
        },
        {
            "text": "In late May and June, low rainfall and hot weather (with associated high demand) caused rivers levels to fall and caused ecological stress in a number of areas.  However, recent rainfall has helped to restore river flows in many parts of the country and reduced temperatures in the water environment, which has helped fish and other wildlife."
        },
        {
            "text": "The natural environment continues to take time to recuperate from the impacts of last summer. Parts of East Anglia also remain in drought (since August 2022) due to residual impacts on groundwater from last year’s drought. Devon and Cornwall also remain in drought (since August 2022) due to low water levels in two strategic public water supply reservoirs. The Environment Agency anticipates that these areas will not return to normal status until at least winter (subject to rainfall amounts)."
        },
        {
            "text": "The dry weather in May and early June meant that two Environment Agency areas – Cumbria and Lancashire, and the West Midlands – entered prolonged dry weather status. Rainfall over the last three weeks, has meant Cumbria and Lancashire has now returned to normal status. England has now seen rainfall over the long-term average for July."
        },
        {
            "text": "All other areas are currently in ‘recovering from drought’ or ‘normal’ status."
        },
        {
            "text": "The Environment Agency continues to regularly monitor the situation and provide regular updates on gov.uk, including weekly rainfall and river flow reports and monthly water situation reports by area."
        },
        {
            "text": "Environment Agency action during drought "
        },
        {
            "text": "All water companies are required to have drought plans and continue to plan for reasonable worst-case scenarios."
        },
        {
            "text": "The Environment Agency is responsible for:"
        },
        {
            "text": "Government action to boost supply and reduce demand "
        },
        {
            "text": "Through the Plan for Water, the government is taking a twin-track longer-term approach to boost supplies and reduce demand in order to tackle longer-term pressures."
        },
        {
            "text": "The Government, regulators and water companies are looking to increase our resilience to drought by:"
        },
        {
            "text": "We can all help to increase our resilience to drought by using less water. Every drop that comes from out from our taps has been taken from our environment. The government has committed to reducing public water use by 20% by 2038 - from 144 litres per person per day to 122 litres per person per day - and to reduce leakage by 50% by 2050. We are working towards this and reducing demand by:"
        }
    ]
}