{
    "url": "https://environmentagency.blog.gov.uk/2023/07/31/navigation-officers-doing-their-bit-for-climate-change-on-the-medway/",
    "title": "Navigation Officers doing their bit for climate change on the Medway",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Environment Agency"
    ],
    "pub_date": "2023-07-31T14:34:55+00:00",
    "content": [
        {
            "text": "Shaun Gage, Navigation Officer, explains how his team are managing the River Medway Navigation sustainably by cutting carbon, restoring nature, and ensuring the river is a great place to visit for local communities."
        },
        {
            "text": "The summer months are some of the most beautiful times to be working outdoors in Kent and I’m lucky enough to be working in an idyllic spot, pruning and clearing woodland on the River Medway Navigation. Sadly, there’s a lot to do following ash dieback. Who would have thought a Navigation Officer also does tree surgery! But that’s what I love about my job – the huge variation in my day-to-day work."
        },
        {
            "text": "I’ve been an Environment Agency Navigation Officer on the River Medway Navigation since 2021 following many years as a gamekeeper and self-employed tree surgeon."
        },
        {
            "text": "As one of a team of Navigation Officers, I look after all 10 of our lock sites, stretching along 29km/18 miles of navigable, non-tidal river from Allington to Tonbridge in Kent. An average day usually starts about 7.30am, visiting the lock sites, clearing rubbish, mowing and doing general maintenance – including the tree surgery - meeting the public, checking boat registrations and answering queries."
        },
        {
            "text": "Navigation team afloat carrying out routine maintenance (source: Environment Agency) <Original jpeg with editing rights>"
        },
        {
            "text": "But what I love most about my job is the difference the team and I are making to the ecology and sustainability of the Medway navigation.  I feel incredibly privileged to have used my previous work experience and passion for nature to help our biodiversity team come up with ecological site plans for all our lock sites."
        },
        {
            "text": "As a result, over the last year we’ve created several wildflower meadows, and planted over 2000 saplings including hawthorns, hazels and wild cherries."
        },
        {
            "text": "20 new crab apples trees at Allington lock island will now provide early pollen for bees and other insects and fruit for migrant and resident birds during winter. We’ve also planted native Kentish fruit trees at all the lock sites which we hope users of the Medway path will be able to enjoy as they mature."
        },
        {
            "text": "We've also introduced several bird boxes, and later in the year we’ll be installing barn owl boxes, artificial otter holts, and a bat maternity roost. We try to keep the public updated on the latest furry and feathered residents on the Environment Agency’s twitter account @EnvAgencySE."
        },
        {
            "text": "We’re also working hard to minimise carbon emissions from what we do on site. We started by calculating our emissions from vehicle mileage, machinery, contractors, fuel, materials, and waste. We then estimated the carbon captured by our site management works, like the tree planting and wildflower meadows."
        },
        {
            "text": "We worked out we emit over 93 tonnes of carbon a year and offset about 84 tonnes.  We’ve now looked at what more we can do to reduce our emissions even more."
        },
        {
            "text": "We've started changing our boats and vehicles to electric and hybrids, we’re planning for renewable energy production, and we’re phasing out all our fossil fuel driven mowers, trimmers, pole saw and chain saws with battery-powered machinery. We're also now using e-bikes to carryout inspections along the length of the navigation which we previously did by car."
        },
        {
            "text": "So that’s why I love my job. I get to see the positive impacts of what we’re doing every day on the river.  I enjoy taking the time to explain to passers-by why we’re leaving the grass to grow long on our lock sites, or why we’re planting trees."
        },
        {
            "text": "Please do pay the Medway Navigation a visit and come and say hello. It’s a beautiful place to be."
        },
        {
            "text": "Visit www.therivermedway.co.uk to find out more about the Environment Agency operated River Medway Navigation including how to register your river craft."
        },
        {
            "text": "PLEASE NOTE"
        },
        {
            "text": "All vessels on Environment Agency waterways are required by law to be registered. This includes any vessel with or without a motor, including narrowboats, cruisers and barges, canoes, paddle boards, rowing boats and dinghies. Failure to register your vessel can result in a £1000 fine and/or removal of the vessel from the waterway. Buy a daily, weekly or monthly registration from Allington Lock or Tonbridge Castle, or buy an annual registration at https://www.gov.uk/government/collections/river-medway-boat-registration-and-application-forms. Visiting craft can purchase a daily, weekly or monthly registration from Allington Lock or Tonbridge Castle. You are registered to use the River Medway if you are a member of British Canoeing."
        }
    ]
}