{
    "url": "https://actuaries.blog.gov.uk/2023/07/31/start-ready-extending-the-reach/",
    "title": "Start Ready - extending the reach",
    "authors": [
        "Andy Jinks - Chief Actuary"
    ],
    "categories": [
        "Climate change",
        "Insurance",
        "Investment",
        "Risk management"
    ],
    "pub_date": "2023-07-31T16:41:30+01:00",
    "content": [
        {
            "text": "As I begin my second year on the Start Ready Governance Committee, I can’t help but reflect that the name really does mean what it says. Bear with me on this!"
        },
        {
            "text": "The work we do is a key part of an organisation’s mission to create a new era of humanitarian action that will protect even more lives."
        },
        {
            "text": "The organisation looks to empower people on the frontlines to provide effective, locally led action before and when crises strike. This assistance is delivered through early and rapid financing and by driving a culture of innovation and learning. This brings relief to millions of people who are affected by disasters such as climate change."
        },
        {
            "text": "It’s our role, as the Start Ready programme’s Governance Committee, to look at applications (for pre-positioned finances) from vulnerable societies so they’re helped when there’s a crisis. To do this, countries that experience predictable climate-related disasters apply to be in a global risk pool."
        },
        {
            "text": "Once an application is successful, they know that if a certain crisis happens, they’ll be able to start helping their people in advance and be ready to rebuild and regenerate their communities."
        },
        {
            "text": "I spoke about my first year on the Committee in a blog last year. Now, as the Governance Committee gets into our year 2 stride, I thought I’d share how it’s going."
        },
        {
            "heading": 2,
            "text": "First year lessons"
        },
        {
            "text": "I think it’s safe to say that we are still on a journey, things are evolving and we’re all still learning."
        },
        {
            "text": "The Committee and everyone at Start Ready have reflected on the lessons of the first year and considered what we could do next and do better. In doing this we looked at both the technical side and how we make decisions."
        },
        {
            "text": "With those reflections in mind, the Governance Committee met in May 2023 to make decisions about the second risk pool. This year, we were able to make those decisions face-to-face, so I met fellow Committee members for the first time. They had flown in from various parts of the globe including Guatemala, Kenya, Democratic Republic of Congo, Bangladesh and Pakistan."
        },
        {
            "heading": 2,
            "text": "Risk Pool Two"
        },
        {
            "text": "When the Committee began planning for the second year, we had to decide how to allocate funding between the applicants."
        },
        {
            "text": "Most of the countries that we’re covering in the second risk pool were also covered by the first pool – in some ways it’s like insurance, your coverage is renewed. However, there were new applicants and new risks for us to consider and the Committee only has a set amount of money for use."
        },
        {
            "text": "In addition to deciding the different applications, we must also decide how to allocate donor funding across different pots of funding."
        },
        {
            "text": "Most of the money we receive from donors is set aside to cover pay-outs from a global risk pool. However, we can also pre-position national pots in some countries before disasters strike, which they can use to increase their preparedness."
        },
        {
            "text": "In addition, we needed to decide whether to buy reinsurance. This makes the global Start Ready pot go further by making available even more funds, which can be utilised if the initial sum is exhausted."
        },
        {
            "text": "So, basically our role is to decide how to split the funds, what the pay-outs will be and how to do this fairly. We decided how to do that and discussed our long-term strategy – which to be honest, we are still tweaking."
        },
        {
            "heading": 2,
            "text": "Balancing the risk"
        },
        {
            "text": "Start Ready receives money from donors who want us to make sure we’re getting money to the people that need it, when they need it. At the same time, we need to be measured in what we allocate to make sure we don’t run out of funds completely. So, our role as the Governance Committee (and my role as the actuary on the Committee) is to ensure that we balance enough risk but not too much risk."
        },
        {
            "text": "In truth, we’re still refining what that level is. With only one year of experience, it’s hard to know if the amounts we’ve paid out to date are typical or not. And of course, there will always be lots of considerations and different views when it comes to working out when and where to take risk."
        },
        {
            "text": "This year, the Start Ready risk pool is covered by a reinsurance policy, so that’s new! While we have £4.5 million from donors within the Global Risk Pool in case of activations, we've prepositioned funds up to £7.3 million after assessing the probability of risks that might happen."
        },
        {
            "heading": 2,
            "text": "Stretching the money"
        },
        {
            "text": "By taking out reinsurance and by pooling risks, we have stretched the £4.5 million set aside to provide cover worth £7.3 million to communities around the world."
        },
        {
            "text": "It’s worth saying that we will only pay out £7.3 million if everyone called on us – which is very unlikely. But that’s the beauty of a risk pool because it basically means that the Governance Committee can stretch the capital further as we’re sharing the risk across the countries and with a reinsurer. Ultimately it means we can cover more risks or regions and applications requesting larger amounts!"
        },
        {
            "text": "So, now that everything is in place and the decisions have been made, we wait to help affected communities. It’s fascinating work."
        },
        {
            "text": "I’m really pleased to be able to bring my actuarial skills to bear on the Start Ready Governance Committee. We ensure that we make the most of the money together with the people who need it be ready to start again."
        }
    ]
}