{
    "url": "https://space.blog.gov.uk/2023/07/31/uk-space-agency-to-bring-its-space-for-everyone-steam-tour-to-aberdeen/",
    "title": "UK Space Agency to bring its 'Space for Everyone' STEAM tour to Aberdeen",
    "authors": [
        "UK Space Agency"
    ],
    "categories": [
        "Championing Space",
        "Education",
        "Events"
    ],
    "pub_date": "2023-07-31T13:41:48+01:00",
    "content": [
        {
            "text": "The UK Space Agency is delighted to announce that it will be docking its 72 ft model rocket at the Queen Links, Aberdeen from 3 August to 7 August, bringing the awe-inspiring 'Space for Everyone’ tour to the region."
        },
        {
            "text": "This exciting initiative aims to captivate and educate the next generation, showcasing the UK's flourishing space industry and the diverse array of career opportunities available."
        },
        {
            "text": "Throughout the event, organisations including The World Wildlife Fund for Nature in collaboration with the British Antarctic Survey (BAS) and Scotland based leading launch providers Orbex and Skyrora, will be in attendance - highlighting the thriving space industry in Scotland and beyond. "
        },
        {
            "text": "The Space for Everyone tour will serve as a beacon of inspiration, shedding light on the pivotal role that space plays in enhancing life on Earth. Visitors including children, families, and teachers will have the unique opportunity to witness first-hand how space technologies benefit our daily lives and gain insights into the continuous efforts to explore the great unknown."
        },
        {
            "text": "UK Space Agency Deputy CEO, Ian Annett, said: "
        },
        {
            "text": "Space for Everyone promises an immersive experience, incorporating state-of-the-art virtual reality headsets to provide unparalleled insights into what a launch from the UK looks like, and the job roles involved in making it happen. Visitors will also have the opportunity to explore various interactive areas, learning about the crucial role of satellites and discovering the diverse career paths available within the UK space industry."
        },
        {
            "text": "British astronaut Tim Peake said:"
        },
        {
            "text": "Admission to the tour is free, no booking required, and while the event is primarily targeted towards children aged 9 to 18, it is guaranteed to ignite a passion for science, technology, engineering, arts and mathematics (STEAM) in individuals of all ages. Mums, dads, grandparents, and next-door neighbours are all invited to participate and experience the excitement of the Space for Everyone tour. "
        },
        {
            "text": "The tour kicked off in Southampton in June and will visit a further four locations around the UK after Aberdeen. For further information about the Space for Everyone tour, please visit https://spaceperson.co.uk/rocket-tour/ or follow @spacegovuk on social media."
        },
        {
            "text": " "
        },
        {
            "text": "The Space for Everyone tour will visit:"
        },
        {
            "text": "WWF (World Wildlife Fund for Nature) is a global environmental charity, and we’re bringing our world back to life. With nature in freefall, we’re urgently tackling the underlying causes that are driving the decline – including climate change. And we’re finding solutions so future generations have a world with thriving habitats and wildlife. "
        },
        {
            "text": "The British Antarctic Survey is the United Kingdom's national polar research institute, part of the Natural Environment Research Council. Its purpose is to be a world-leading centre for polar science and polar operations, addressing issues of global importance and using Polar Science for a Sustainable Planet. WWF and British Antarctic Survey (BAS) are looking for the public’s help with their Walrus from Space project, to search for and count walrus in thousands of satellite images taken from space, with the aim to learn more about how walrus populations are impacted by the climate crisis. "
        }
    ]
}