{
    "url": "https://opss.blog.gov.uk/2023/07/31/we-are-recruiting-enforcement-team-leaders-in-the-opss/",
    "title": "We are recruiting Enforcement Team Leaders in the OPSS",
    "authors": [
        "Simone King"
    ],
    "categories": [
        "Careers at OPSS",
        "Construction Products",
        "Online and Supply Chain Enforcement",
        "Vacancies"
    ],
    "pub_date": "2023-07-31T16:28:12+01:00",
    "content": [
        {
            "heading": 3,
            "text": "We are recruiting Enforcement Team Leaders to join our teams in Birmingham and Teddington"
        },
        {
            "text": "The enforcement team at the OPSS is made up of three Deputy Director areas, each with a unique regulatory focus, but they all work closely together in order to deliver effective enforcement that helps protect people and places and enable businesses to thrive."
        },
        {
            "heading": 3,
            "text": "Why you should apply"
        },
        {
            "text": "This is an exciting opportunity for a flexible and results-oriented individual with the energy to make positive change happen. In this purposeful, and multi-faceted role you will play a part in building our reputation as an exemplar regulator. Candidates will need to be flexible in approach and prepared to lead on a range of tasks."
        },
        {
            "text": "We want to hear from candidates that can contribute innovative regulatory approaches to deliver our objectives."
        },
        {
            "text": "The role will suit people who are confident, analytical, decisive and can develop relationships and networks quickly, with experience of operating within a compliance environment: for example, either as an Environmental Health Officer, Trading Standards Officer or any other roles that ensure goods, services or systems meet regulatory standards."
        },
        {
            "heading": 3,
            "text": "We have 5 roles available in the teams listed below"
        },
        {
            "text": "Energy and Product Enforcement – Enforcement Team Leader"
        },
        {
            "text": "The Energy and Product Enforcement Team, enforces a range of product, environmental and energy efficiency regulations across a wide variety of product types in a number of different sectors."
        },
        {
            "text": "This role will lead the team responsible for the enforcement of the Waste Electrical and Electronic Equipment, and the Battery Takeback Regulations. These are environmental regulations which aim to reduce the amount of batteries, electrical, and electronic equipment that go to landfill therefore protecting our environment. You will lead a team of two, and work closely with the other SEOS delivering other environmental regulations on behalf of DEFRA."
        },
        {
            "text": "This role is Birmingham based only."
        },
        {
            "text": "Online and Supply Chain Assurance – Enforcement Team Leader"
        },
        {
            "text": "The newly formed Online and Supply Chain Enforcement Team is responsible for ensuring that shopping online will be as safe as shopping on the high street. We regulate the full supply chain, from ports and borders through to online marketplaces, fulfilment houses and third-party sellers. We also provide enforcement expertise on safety studies into products of concern. As an SEO you will lead a small team of one to two staff."
        },
        {
            "text": "There are two posts which can be based in either Birmingham or Teddington."
        },
        {
            "text": "Construction Products – Senior Product Safety Officer"
        },
        {
            "text": "The Government has announced that the Office for Product Safety and Standards (OPSS) will host the new national regulator for construction products, driving the improvement of safety and performance standards and ensuring compliance with construction product regulations. The OPSS has begun operating under existing regulations and is currently transitioning to become fully operational under new legislation. The Business Compliance Team is the team responsible for setting and establishing the OPSS’ approach to drive business compliance with the construction product industry. We lead on the delivery of high-quality regulation of construction products placed on the UK market."
        },
        {
            "text": "There are two posts based in Birmingham only."
        },
        {
            "text": "Find out more and apply on the Civil Service Jobs website"
        },
        {
            "text": "Apply before 11:55 pm on Monday 21st August 2023"
        }
    ]
}