{
    "url": "https://hmlandregistry.blog.gov.uk/2022/09/28/digital-by-default/",
    "title": "Digital by default ",
    "authors": [
        "Eddie Davies, Deputy Director – Digital Services (Head of Product)"
    ],
    "categories": [
        "Digital services"
    ],
    "pub_date": "2022-09-28T12:47:15+01:00",
    "content": [
        {
            "text": "Automation is at the heart of our plans to develop efficient and resilient land registry services, as set out in our new Business Strategy. By automating services, we expect to significantly improve completion of straightforward transactions with an ambition to return to same day applications for many."
        },
        {
            "text": "To achieve the end-to-end automation we are striving for, we need more of our services to be ‘digital’. So, by 30 November 2022, all applications coming to HM Land Registry, other than first registrations, can be lodged digitally. HM Land Registry will be ‘digital by default’.  "
        },
        {
            "text": "We are working with customers to make sure they understand how to submit their applications digitally ahead of 30 November. They can either use our Digital Registration Service (DRS) which is available on our portal and is free for all of our business customers to use. Or, for customers who wish to invest in a more tailored experience, they can use one of the legal software providers which connect to our services through our range of ‘Business Gateway’ application programming interfaces (APIs).  "
        },
        {
            "text": "We have been working with customers to ensure the services meet their needs, and this work will continue in the run up to – and beyond – November. I wanted to give an update on the current situation with DRS and our upcoming plans.  "
        },
        {
            "heading": 2,
            "text": "The Digital Registration Service today"
        },
        {
            "text": "Currently, over 3,000 applications come through the DRS system every day and the service now supports 90% of simple applications to update the register. The service automatically checks the name entered in the form against the register and calculates the application’s fee before it is sent to HM Land Registry. As a result, we have seen almost 40% fewer requisitions on those two common errors, saving DRS users valuable time. "
        },
        {
            "text": "We have seen a huge increase in the use of the service since the beginning of the year. In August we saw 50,000 applications submitted through DRS, coming in from almost 10,000 customers.  "
        },
        {
            "heading": 2,
            "text": "Next steps"
        },
        {
            "text": "But the work doesn’t stop here. We will ensure all applications can be submitted digitally via the Digital Registration Service by 30 November this year. "
        },
        {
            "text": "We will be adding transfers of part and the removal of Form A restriction in the coming weeks, and all remaining non-lease transactions, change of name and address, and leases by the end of November. "
        },
        {
            "text": "We will also be updating how the portal looks to make it easier to navigate and use as we make these changes. This change will be introduced in November to coincide with our move to applications being ‘digital by default’. "
        },
        {
            "heading": 2,
            "text": "After November"
        },
        {
            "text": "While we have seen most customers giving us good feedback, we have listened to all customers and we are working on the following expansions to the service.  "
        },
        {
            "text": "In the months following the move to digital, we will update and refine the service in the portal, adding new features and enhancements regularly, including additional save points when building applications, and greater control over editing applications as they’re being constructed. We will also add a fee calculator for leases and transfers of part, to calculate the fee due automatically.  "
        },
        {
            "text": "In the longer term, we have already started to design DRS 2.0 which will go further than the current service and will have user need at the forefront of its design. But we won’t design ‘in the dark’. We are already analysing the data we have today and are talking to customers about how they would like to see the service develop. This might include enhancements to the current journey, or online support to practice guidance. We will also be working with the software industry to ensure the APIs we develop include some of the new features we intend to develop.  "
        },
        {
            "text": "We are committed to continuing to deliver quality digital services. View Applications in the portal is just one example of how, when we work with our customers, we can deliver value and make their jobs easier. We will continue to:"
        },
        {
            "heading": 2,
            "text": "Getting ready"
        },
        {
            "text": "Many of our customers have already become digital by default and the number is rising every day. For any who have not yet used either DRS or one of the legal software providers, further information on digital applications – including resources, events and support – can be found on our dedicated digital applications page. "
        }
    ]
}