{
    "url": "https://traderemedies.blog.gov.uk/2022/09/28/how-has-covid-affected-trade-remedies/",
    "title": "How has COVID affected Trade Remedies?",
    "authors": [
        "Bradley Tyler, Assistant Economist",
        "Jigar Amin, Assistant Economist",
        "Ryan Wilson, Assistant Economist"
    ],
    "categories": [
        "Analysis"
    ],
    "pub_date": "2022-09-28T15:52:48+01:00",
    "content": [
        {
            "text": "Two years since the onset of COVID-19 (COVID), we are starting to understand the impact it has had on the world economy. But what about its impact on the world of trade remedies? "
        },
        {
            "text": "The arrival of COVID in 2020 upended the globalised world and the norms we took for granted. Governments prioritised suppressing viral spread; people were obliged to socially-distance, and economies were placed under lockdown. As a result, the world came to a virtual standstill and productivity waned. So much so, that the Bank of England reported that global trade fell by around 9% in autumn 2020, the sharpest drop since the global financial crisis of 2007. "
        },
        {
            "text": "Accordingly, governments across the world introduced COVID-specific trade measures, including export subsidies and Foreign Direct Investment (FDI)-related measures. However, less clear is the relationship between COVID and the use of trade remedies.  "
        },
        {
            "heading": 2,
            "text": "What are trade remedies? "
        },
        {
            "text": "Trade remedies are governed by the World Trade Organisation (WTO) and typically use import duties to counter imports causing or threatening to cause injury to domestic industry. Injury is often measured through decreased sales, prices or market share. They are designed to temporarily protect domestic industry suffering from one of three specific trading practices, and their need is reviewed every few years.  "
        },
        {
            "text": "There are three types of trade remedies:  "
        },
        {
            "text": "We look at the potential interaction of COVID and trade remedies by considering the impact on:  "
        },
        {
            "heading": 2,
            "text": "Impact on the practicalities of a trade remedy investigation "
        },
        {
            "text": "The imposition of lockdowns led to disruption of business activities and a number of interested parties in our investigations requested extensions to deadlines for submission of evidence. The TRA, like many other investigating authorities, was flexible in accommodating these requests where possible. "
        },
        {
            "text": "Before COVID, many trade remedies authorities conducted on-site verification of business locations relevant to the industry under investigation, both domestically and in the exporting country. "
        },
        {
            "text": "With the onset of national lockdowns and legislation restricting the movement of people, travel was prohibited, and once lockdowns were lifted many businesses remained reluctant to allow non-staff onto their sites for fear of viral spread. This led to some trade remedies authorities suspending on-site verification, and increased pressure on WTO-mandated deadlines.  "
        },
        {
            "text": "To overcome these challenges, many trade remedies authorities quicky adapted to the new normal in several ways. For example, the UK’s Trade Remedies Authority equipped their staff with the means to conduct verification remotely and liaise with stakeholders using video-conferencing software.  "
        },
        {
            "text": "The shift to digital working brought its own set of challenges such as intermittent connectivity, establishing videoconferencing norms and the increased time required to conduct remote verification.  "
        },
        {
            "text": "However, the result of such efforts meant investigations continued to be undertaken in an evidence-based manner and stakeholder relationships continued to be furthered. In fact, in some ways COVID has changed working patterns permanently. For example, several stakeholders have cited the convenience of remote working when requesting remote verification. "
        },
        {
            "heading": 2,
            "text": "Impact on the number/type of investigation"
        },
        {
            "text": "To get a sense of the extent to which COVID impacted the number and type of trade remedy investigations globally, Figure 1 compares the average number of each of the three types of investigation  "
        },
        {
            "text": "Defining the pre-COVID time period as 2009-2019 allows us to estimate the average yearly use of trade remedies seeking to smooth out fluctuations attributable to confounding factors. Moreover, we avoided data coinciding with the Global Financial Crisis (2007-2009) given the economic volatility present at this time.  "
        },
        {
            "text": "Since we only have two years’ worth of post-COVID data, 2020-2021, it makes direct comparisons challenging and inferences less robust. As new data emerges in future years, re-examining this relationship may reveal currently unobservable trends. "
        },
        {
            "text": "Figure 1: Average yearly investigations initiated and measures imposed for types of trade remedies, pre-COVID and post-COVID, globally "
        },
        {
            "text": "Source: WTO.org (see ‘Goods’ section). "
        },
        {
            "text": "Figure 1 shows that, except for safeguards initiations, the average yearly count for both initiations and measures imposed was slightly higher for the three types of trade remedies post-COVID. The largest difference pre-COVID and post-COVID was in the initiations of anti-dumping cases. A simple comparison of pre- and post-COVID annual averages seems to indicate, at least on the face of it, a slight increase in the use of trade remedies. Potential reasons for this could include more producers applying to seek protection in the face of challenging economic circumstances or the impact of disruptions making it easier to demonstrate evidence of injury. "
        },
        {
            "text": "Digging deeper into which countries these trade remedy investigations focussed on revealed no notable change pre-COVID and post-COVID. "
        },
        {
            "text": "To determine the extent to which the increase in the initiations of trade remedy investigations post-COVID deviated from a longer-term trend, Figure 2 plots the data for the three types of trade remedies since 2009. "
        },
        {
            "text": "Figure 2: New investigations initiated yearly by type of trade remedy globally "
        },
        {
            "text": " "
        },
        {
            "text": "Source: WTO.org (see ‘Goods’ section). "
        },
        {
            "text": "Figure 2 shows AD and AS appearing to have a slightly upward, albeit volatile trend, both peaking in 2020. There is considerable variation between years rather than a consistent pattern over the period. Meanwhile, SG initiations do not show a discernible trend and peaked in 2019. Note also the correlation in AD and AS initiations, perhaps caused by the prevalence of simultaneous dumping and subsidisation.  "
        },
        {
            "text": "The average yearly investigations initiated post-COVID (20) were higher than the average over the entire pre-COVID period (2009-2019). This difference was driven largely by AD investigations which make up the majority of all investigations. However, the number of AS investigations post-COVID was not higher than the two-year period, immediately before COVID (2018-2019).  "
        },
        {
            "text": "Further, the post-COVID period does not follow a consistent trend either, with 2020 seeing a spike in initiations and 2021 seeing a significant decline. Therefore, we cannot infer causation between COVID and the number of investigations and it is likely that confounding factors are at play. "
        },
        {
            "text": "The 2021 fall in initiations could potentially be explained by complainant industries being in a weaker financial position and therefore focussing on other challenges rather than applying for trade remedies, not having robust data and evidence for the period of investigation (2020), or because of an uptick in economic activity and increased demand due to lifting of lockdowns. "
        },
        {
            "heading": 2,
            "text": "Impact on the sectors investigated "
        },
        {
            "text": "This section explores the impact of COVID on trade remedies by comparing the most frequent sectors subject to trade remedies. It should be noted that investigations can take up to 18 months to conclude, so some measures may not have arisen from initiations in the same period. "
        },
        {
            "text": "For both pre-COVID and post-COVID periods, the most frequent sectors investigated were base metals and articles, and chemicals and allied industries, with the addition of textiles for SG.  "
        },
        {
            "text": "Given the additional need for medical equipment to combat COVID this is also a sector of interest. However, there are limited examples of the use of trade remedies to support the medical sector during COVID. The exceptions being Brazil and Argentina which both suspended AD measures on medical instruments to combat COVID. In the case of Brazil, this concerned vacuum plastic tubes for blood collection, and for Argentina, ports of hypodermic syringes of plastic, disposable, sterile, with or without needle. Nevertheless, the data appears to reveal no trend at the aggregate level. "
        },
        {
            "text": "Further investigation of the three sectors most frequently subject to trade remedies is shown in Table 1 using data from the WTO, and provides the average number of initiations and measures imposed for these sectors across the three forms of trade remedy investigations for the years 2009-2019, 2020, and 2021. "
        },
        {
            "text": "Table 1: Most frequent sectors using trade remedies, 2009-2021   "
        },
        {
            "text": "Source: WTO.org (see ‘Goods’ section). "
        },
        {
            "text": "Note: WTO recorded initiations in the year the case began, and measures only count final determinations and not preliminary measures. "
        },
        {
            "text": "Table 1 reveals that the average yearly number of investigations initiated and measures imposed fluctuate between the time periods and the three different types of investigation. However, for AD and AS investigations, base metals and articles accounted for the largest share of trade remedy investigations and measures imposed in each time period. For base metals, comparing initiations in 2020 with the average over 2009-2019 it can be seen that there was an increase across all three types of trade remedies: over 75% for AD and over 100% for AS. "
        },
        {
            "text": "Except for SG initiations related to chemicals and allied industries, 2020 saw the most initiations across all sectors and types of investigations, whilst 2021 saw the most measures implemented (with the added exception of SG measures related to base metals and articles).  "
        },
        {
            "text": "The increase in investigations initiated in 2020 could perhaps be viewed as being linked to COVID, however, the decrease in initiations in 2021 does not support the possibility of a consistent longer-term trend or structural break in the data. Moreover, as trade remedy investigations usually last for a year the increase in measures imposed in 2021 is likely a consequence of the increase in initiations in 2020.  "
        },
        {
            "heading": 2,
            "text": "So, what can we conclude? "
        },
        {
            "text": "Well, as it turns out, not a great deal – yet. "
        },
        {
            "text": "Comparing annual average figures for the two post-COVID years that we currently have data for (2020 and 2021) with the pre-COVID period of 2009-2019, we see that there was a slightly greater use of trade remedies. Anti-dumping was the most frequently used trade remedy both pre-COVID and post-COVID. The sectors most frequently targeted by trade remedies were largely consistent across the three types of trade remedy and this was not impacted by COVID. "
        },
        {
            "text": "As more data emerges it is possible that a clearer trend in COVID and trade remedies emerges. Moreover, there are many confounding factors in the current economic climate which may be obscuring an underlying trend between COVID and trade remedies. Likely examples are the Russian invasion of Ukraine, supply chain bottlenecks and high inflation rates.  "
        },
        {
            "text": "Apart from the two examples of Brazil and Argentina cited previously, there are no observable trends at the aggregate level which suggest that trade remedies have been a tool employed to combat the economic impacts of COVID. "
        }
    ]
}