{
    "url": "https://civilservice.blog.gov.uk/2022/09/28/organ-donation-is-the-best-gift-of-life/",
    "title": "Organ donation is the best gift of life",
    "authors": [
        "Alex Taylor"
    ],
    "categories": [
        "A great place to work",
        "A Modern Civil Service",
        "An Ambitious Civil Service"
    ],
    "pub_date": "2022-09-28T08:29:12+00:00",
    "content": [
        {
            "heading": 3,
            "text": "To mark NHS Organ Donation Week (26 September to 2 October), civil servant Alex Taylor shares his journey and the challenges as he awaits a kidney transplant."
        },
        {
            "text": "Living through a global pandemic has brought home how fragile and important our health can be. Organ disease and organ failure are some of the leading causes of long-term illness and death in the UK, directly affecting the lives of millions of people and their loved ones."
        },
        {
            "text": "During NHS Organ Donation Week, the NHS and charities encourage people to register their wishes and talk with their loved ones about their organ donation decision."
        },
        {
            "heading": 4,
            "text": "My story"
        },
        {
            "text": "I didn’t know much about organ donation until it affected me personally. Two years ago, I was a healthy 27-year-old, when I began to feel queasy and increasingly ill over a period of weeks, until I was hospitalised. I was informed that my kidneys were irreversibly damaged as a result of a rare auto-immune condition named Goodpasture’s, and I later found out that my heart was also weakened."
        },
        {
            "text": "Living with organ failure is restrictive in numerous ways. I am dependent on dialysis, a machine to clean my blood, five days a week for five hours a session in order to live."
        },
        {
            "text": "Constantly tired"
        },
        {
            "text": "Thankfully, I can do this at home, which has been a huge advantage, but it’s still exhausting. It is difficult to remember what it is like not to feel constantly tired. I follow a low potassium and low phosphate diet: no tomatoes, cheese, chocolate, coffee (hard for an addict like me!), and I can drink very little fluid. I can’t travel or walk far without feeling breathless."
        },
        {
            "text": "Fortunately, there are things I can do to keep happy: I can walk short distances to the park and enjoy the fresh air, spend time with loved ones, and I work part-time in DLUHC with the Civil Service being an enormously supportive employer. "
        },
        {
            "heading": 4,
            "text": "Civil Service support"
        },
        {
            "text": "After I fell ill, my department and line manager supported me back into work through a phased return, and then to a more permanent move to working part-time. I’m able to work flexibly around my dialysis treatment and my hospital appointments. I am grateful for the opportunity to continue working as it benefited my recovery to focus on something other than my condition and treatment. "
        },
        {
            "text": "However, I miss the freedom of my old life, and I know that the only way I can get it back is through a kidney transplant and potentially a heart transplant."
        },
        {
            "heading": 4,
            "text": "What is organ donation?"
        },
        {
            "text": "Organ transplantation can involve a living donor or a deceased donor. Each year across the UK, around 1,000 people are living donors, usually to family or a friend, although there is also a growing number of altruistic donors. For those without a compatible living donor, the next option is joining the waiting list for a deceased donor."
        },
        {
            "text": "Unfortunately, the average waiting time for a kidney from a deceased donor is two to three years, with more than 6,000 people currently on the waiting list. For Black, Asian and Minority Ethnic patients, the waiting list is even longer due to a chronic shortage of donors. Sadly, hundreds of people die every year waiting for an organ transplant. "
        },
        {
            "text": "On 20 May 2020, thanks to the Department of Health and Social Care (DHSC), the Organ Donation (Deemed Consent) Act 2019 came into effect and introduced a new system of consent for organ and tissue donation in England, known as ‘opt-out'. The new legislation means that all adults over 18 will be considered potential organ and tissue donors after death, unless they decide they do not want to be a donor, have nominated a representative to make a decision on their behalf after death, or are in an excluded group."
        },
        {
            "text": "This is a hugely positive change that will enable many more organs from deceased donors to be transplanted. But although the system has changed, families are still consulted before donation goes ahead. For many families, making a decision where the deceased person’s wishes are unclear is deeply distressing. Fewer than half of families agree to organ donation going ahead if they’re unaware of their loved one’s decision to be a donor. This rises to 90% when the decision is known. "
        },
        {
            "text": "This is why the NHS is still asking people to register their wishes online on the NHS Organ Donor Register and to discuss the issue with their families. This means that, whatever a person’s decision, their family will be supported by knowing their wishes."
        },
        {
            "text": "Organ donation is one of the most personal decisions an individual can make, and there are many reasons why a person may or may not decide to be a donor.  I would encourage everyone to make their wishes known and speak with their family about their decision."
        }
    ]
}