{
    "url": "https://insidehmcts.blog.gov.uk/2022/09/28/preparing-our-courts-to-support-deaf-jurors/",
    "title": "Preparing our courts to support Deaf jurors",
    "authors": [
        "Maria Loizou-Griggs - Jury Team Leader",
        "Tamara Torrilla - Operations Manager"
    ],
    "categories": [
        "Court and tribunal reform",
        "Crime"
    ],
    "pub_date": "2022-09-28T10:59:55+01:00",
    "content": [
        {
            "text": "At a trial in Croydon Crown Court in July, Karen made history by being the first Deaf juror to serve in a trial aided by British Sign Language (BSL) interpreters. "
        },
        {
            "text": "Legislative changes to the Police, Crime, Sentencing and Courts Act allows BSL interpreters into the jury deliberation room as a 13th person. This opens up jury service to many adults in our society who rely on a BSL interpreter.   "
        },
        {
            "text": "We prepared tirelessly behind the scenes before Karen’s first day of jury service. We wanted to make sure the experience was as smooth as possible for Karen and other court users.  "
        },
        {
            "heading": 2,
            "text": "Working with Karen"
        },
        {
            "text": "Ahead of the trial, Maria, our Jury Team Leader at Croydon Crown Court, arranged for Karen to attend a pre-court visit. As part of the visit, Karen was shown around the building and observed 2 part-heard trials. Following the visit, Karen provided some useful feedback to be shared with other jurors, staff and judiciary.  "
        },
        {
            "text": "Maria and Karen kept in regular contact, continuing to share tips and useful documents on how to communicate with people who need an interpreter and sharing important bits of information about jury service and what to expect.  "
        },
        {
            "text": "We shared a written version of the jury induction speech with Karen before the trial, so she could review the information beforehand, which boosted her confidence in undertaking her jury service.  "
        },
        {
            "text": "Three interpreters and 2 ushers supported Karen throughout the trial."
        },
        {
            "heading": 2,
            "text": "Making adjustments to the court room "
        },
        {
            "text": "We reviewed the layout of the courtrooms and the deliberation rooms to plan where Karen and the interpreters would sit to best allow all jurors to follow the trail.  "
        },
        {
            "text": "We also reached out to the British Deaf Association for their advice on how we could best support Karen. "
        },
        {
            "heading": 2,
            "text": "Preparing other court users "
        },
        {
            "text": "Maria shared best practice and documents from her conversations with Karen with teams across HMCTS.  This helped us to develop our first guidance pack for jurors needing a BSL interpreter.  "
        },
        {
            "text": "As part of the jury induction, Maria explained to the jurors that Karen was serving, and went through the guidance document with them all. "
        },
        {
            "text": "We provided printed versions of our guidance document in all the deliberations room and the jury assembly area, so that other jurors were aware of how best to communicate with Karen and the interpreters.  "
        },
        {
            "text": "We placed printed interpreter oaths in all courtrooms. Finally, an email was sent to all staff and judges sharing best practice on how to engage with Karen.  "
        },
        {
            "heading": 2,
            "text": "Post trial and next steps"
        },
        {
            "text": "Karen was initially selected for trial on 18 July 2022, however the defendant changed their plea. Karen was invited back to court on 25 July 2022, where 3 new trials were due to start.  Karen was selected for another trial and undertook the role of Jury Foreperson – ticking off 2 historical firsts in one jury service! "
        },
        {
            "text": "Following Karen’s jury service, we held a feedback session with:  "
        },
        {
            "text": "Karen and the interpreters gave a resoundingly positive review of their experience, particularly of the support provided to her from employees at Croydon Crown Court: "
        },
        {
            "text": "Further recommendations were shared on the placements of the guidance documents and the setup of deliberation room, which include: "
        },
        {
            "text": "We’ll be using Karen’s feedback to shape future guidance and will share learnings and best practice with courts due to host Deaf jurors in the near future. Maria, Croydon Crown Court Jury Team Leader, will also meet with jury team leaders from across the court system to share her experience first-hand.  "
        }
    ]
}