{
    "url": "https://educationhub.blog.gov.uk/2022/09/28/return-to-university-what-you-should-know-this-autumn-term/",
    "title": "Return to university – what you should know this autumn term",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Universities"
    ],
    "pub_date": "2022-09-28T16:32:03+01:00",
    "content": [
        {
            "text": "The new university term started for most students this month."
        },
        {
            "text": "Whether you are a fresher or a returning student, we have pulled together answers to some of the important topics that you might have wondered about as you head into the autumn term."
        },
        {
            "heading": 3,
            "text": "What support is there for students who are worried about the cost of living?"
        },
        {
            "text": "To support students with living costs, we have increased maintenance loans every year, meaning disadvantaged students now have access to the highest ever amounts in cash terms. Students who are worried about making ends meet should speak to their university about the support they can access – this year we have made £261 million available for universities to boost their own hardship funds."
        },
        {
            "text": "In addition, student renters who pay their energy bills directly to a domestic supplier will benefit from the scheme that discounts £400 from their bill over six months from October."
        },
        {
            "text": "As part of a package of support, the Government is providing a rebate scheme that will provide a one-off payment of £150 to households living in a property in council tax bands A to D as their main home on 1 April 2022."
        },
        {
            "text": "This includes properties that are occupied by full-time students, aside from those living in student halls or in property that is not considered a House in Multiple Occupation for council tax purposes."
        },
        {
            "text": "When it comes to tuition fees – maximum tuition fees will be frozen until 2025, by which point fees have will have been frozen for seven years."
        },
        {
            "heading": 3,
            "text": "What support is available for students struggling with their mental health?"
        },
        {
            "text": "Student mental health is very important to us and we have made big investments to make sure students are getting the support they need."
        },
        {
            "text": "The Office for Students (OfS) has set aside £15 million for student mental health in this coming academic year to help students make that transition and target support for those most in need, which includes funding to close some of the gaps that exist between university and NHS mental health services."
        },
        {
            "text": "During the pandemic we launched Student Space, a mental health platform where students can access 1-2-1 web and text chat facilities. The platform has already been used by 275,000 students and we recently announced funding so it could continue for a further three years."
        },
        {
            "heading": 3,
            "text": "Will most teaching be in-person? "
        },
        {
            "text": "Students spend a lot of time and money on a university education and face-to-face learning should be the norm."
        },
        {
            "text": "Universities should give students the information they need to make informed decisions about a course, including about the balance between in-person and online teaching, and the Office for Students – which regulates universities – can investigate institutions which aren’t delivering high-quality education."
        },
        {
            "text": "If a student has concerns about their course, they should first get in touch with their university in the first instance, and if they are still not satisfied they can ultimately take their complaint to the Office for the Independent Adjudicator for Higher Education."
        },
        {
            "heading": 3,
            "text": "How are universities dealing with drink and needle spiking attacks reported last year?"
        },
        {
            "text": "Reports of attacks involving drinks being spiked – and even spiking with needles – caused concern last year. That’s why we launched a working group to help the higher education sector grip the issue and come up with practical advice for universities to support students."
        },
        {
            "text": "As a result, Universities UK has set out guidance which will help universities respond effectively to incidents of spiking and to work with police, night-time venues and other partners to stamp out spiking attacks against students."
        },
        {
            "text": "It supports universities with an ‘immediate actions’ checklist to respond to an incident, includes best-practice examples of successful initiatives at institutions, along with wider principles and considerations."
        }
    ]
}