{
    "url": "https://openpolicy.blog.gov.uk/2022/09/28/what-can-innovation-bring-to-place-based-policymaking/",
    "title": "What can innovation bring to place-based policymaking?",
    "authors": [
        "annienorman"
    ],
    "categories": [
        "Thought Pieces"
    ],
    "pub_date": "2022-09-28T08:00:57+00:00",
    "content": [
        {
            "text": "Policy Lab exists to radically transform policymaking through design, innovation and people-centred approaches. We’ve recently been scanning the horizon to identify the next wave of innovative methods with the potential to improve policymaking, which we’ve shared as a set of Experimental Policy Design Methods cards. As well as this, we’ve been looking at policy contexts where our innovation methods might play a useful role, for example our recent series on climate change. This blog shares emerging thinking about an area which can be a key enabler of cross-sector working and innovation on economic and social policy goals: place-based policymaking."
        },
        {
            "text": "What is place-based policymaking?"
        },
        {
            "text": "Place-based policymaking can mean different things to different people. It may be helpful to consider it in terms of:"
        },
        {
            "text": "Key ingredients of place-based policymaking may include: working across different levels of a system; understanding how local issues are experienced from multiple perspectives; and working across organisational boundaries to innovate."
        },
        {
            "text": "An emerging hypothesis"
        },
        {
            "text": "Over the summer we visited Imagination Lancaster for a Design in Place Based Policy Workshop with inspiring colleagues from government and academia. We looked at what is meant by place-based policy, the types of tools and methods that could be used in designing policies for different places and the potential to work in partnership to innovate in place-based policymaking. Through this visit and other conversations with people across the public sector, we are hearing that there is a need for more tools, blueprints and infrastructure to support new ways of working with, and in, different places. "
        },
        {
            "text": "How can Policy Lab's existing methods be applied to place-based policy work?"
        },
        {
            "text": "From work on over 170 policy innovation projects across government, Policy Lab has developed tools and methods which can be applied to place-based policy work. Film ethnography, for example, has proved particularly effective at understanding how national policy is experienced at the local level. Approaches such as speculative design and co-design can help bring together diverse groups to imagine or design different policies and futures. "
        },
        {
            "text": "We have already deployed these methods on a range of projects with a place-based angle. This includes our work to better understand people's experiences of National Parks and Areas of Outstanding Natural Beauty for the Landscapes Review. We convened users of the Department for Transport’s Manual for Streets to improve the use of guidance for street design. We supported local authorities to bid for Innovation in Democracy funding to run their own citizen assemblies. "
        },
        {
            "text": "We are now exploring how such tools can be used best, and what other methods or tools might be required, to support place-based policymaking."
        },
        {
            "text": "An opportunity for innovation?"
        },
        {
            "text": "We have created an exploratory visualisation of how the actions, interventions and influences of central government, regional government and local government may intersect and the implications for national and local services (below). The visualisation could be a useful starting point for reflection on how place-based policymaking works now and for exploring how it could be improved."
        },
        {
            "text": "We are currently running a cross-government project for the Changing Futures team in the Department for Levelling Up, Housing and Communities. This project explores how national government can better support local areas to deliver services for people facing multiple disadvantages. Our work will use film ethnography, co-design and systems innovation to join together lived experience, local services, local areas and national policy."
        },
        {
            "text": "We see several further opportunities for innovation in place-based policymaking. For example, there is space to help policymakers to innovate across system levels on specific policy issues. There is the potential to bring together learning and communities of practice to develop the tools, blueprints and infrastructure to enable more effective place-based policymaking in future. "
        },
        {
            "text": "If you have an idea for a place-based policy project, get in touch at team@policylab.gov.uk"
        }
    ]
}