{
    "url": "https://grantscommunity.blog.gov.uk/2023/08/15/find-a-grant-the-new-digital-service-to-find-and-apply-for-government-grants/",
    "title": "Find a Grant: the new digital service to find and apply for government grants",
    "authors": [
        "Lucia Webster"
    ],
    "categories": [
        "Civil Service",
        "Digital transformation",
        "Find a Grant",
        "Government Grants Management Function"
    ],
    "pub_date": "2023-08-15T15:55:32+01:00",
    "content": [
        {
            "text": "There is a new digital platform available now on GOV.UK that is revolutionising the way everyone can search for and apply for government grants. "
        },
        {
            "text": "Enter Find a Grant, a powerful tool designed to empower people and streamline the grant-seeking process."
        },
        {
            "text": "Imagine a world where passionate individuals, businesses or community groups have a user-friendly platform at their fingertips, dedicated to helping them navigate the often complex world of government grants. "
        },
        {
            "text": "That is what we did and Find a Grant is precisely that platform. "
        },
        {
            "heading": 2,
            "text": "Find a Grant"
        },
        {
            "text": "We have combined modern technology with a personal touch to transform the way people pursue their ambitions - be that to support others, to innovate, to make the world more environmentally friendly… Honestly, there is quite the spectrum of grants available from the government and now you can find them in one place, for the first time."
        },
        {
            "text": "One of the standout features of Find a Grant is its user-friendly interface. From the moment you land on the home page, you're greeted by a clear, simple and intuitive design that instantly puts you in the driving seat. The layout is clean, the navigation is straightforward, and the platform is optimised for both desktop and mobile devices, ensuring access for all users."
        },
        {
            "text": "What truly sets Find a Grant apart is its personalised approach, which we have co-created and tested with the members of our 1000-strong government grants community."
        },
        {
            "text": "Together, by putting grant applicants at the heart of the development, we have built a platform that understands that every grant seeker is unique but also time-poor. That's why Find a Grant offers a tailored experience - through the saved search function - presenting users with a curated selection of grants that aligns with their interests."
        },
        {
            "text": "Find a Grant analyses and then matches relevant grants for you, saving you countless hours of sifting through irrelevant options. So with Find a Grant, you can now spend less time searching and more time focusing on what truly matters - fulfilling your personal or professional ambitions. And it is free!"
        },
        {
            "heading": 2,
            "text": "Monday mornings email"
        },
        {
            "text": "Furthermore, Find a Grant goes the extra mile to offer you the opportunity to sign up for one weekly email that will list all the new grants that have been uploaded in the last seven days. "
        },
        {
            "text": "That way you will not miss out on any grants that you might not have added to your saved search. For example, two new grants were uploaded in the last 7 days - a government grant from the Environment Agency for Lowland Agricultural Peat Water discovery and from the Ministry of Justice a Legal Aid Training Grant. You might not have thought grants like these would be available. But by dipping into the weekly email you can check if there is something new that might be of interest out of the grants worth over £5.5bn that have already been advertised."
        },
        {
            "heading": 2,
            "text": "Developed for everyone"
        },
        {
            "text": "Our commitment to accessibility is another aspect worth highlighting. The platform has also been developed to ensure there are no barriers for individuals from diverse backgrounds and communities or who have particular accessibility needs. And, our pilot showed real levelling up benefits, with a higher proportion of funding awarded to organisations in the north of England."
        },
        {
            "text": "In a world where financial resources often dictate the extent of our aspirations, Find a Grant for many will be a beacon of hope. It levels the playing field, granting access to opportunities that might otherwise remain hidden. With its seamless user experience, personalised recommendations, and a weekly notification email, Find a Grant is transforming the grant-seeking landscape and empowering individuals to make their ambitions a reality, with the support of government grant funding."
        },
        {
            "text": "Find a Grant is not just another digital platform; it's a catalyst for change - and a great example of modernising the Civil Service. "
        },
        {
            "text": "By harnessing the power of technology and personalisation, it brings the world of government grants to everyone’s fingertips, empowering anyone to apply and pursue their passions with confidence. "
        },
        {
            "text": "So, check out Find a Grant, tell your friends, family and professional networks, and let it take you and them on a journey of simpler, faster and fairer grant-seeking..."
        },
        {
            "text": " "
        },
        {
            "text": "Lucia Webster"
        },
        {
            "text": "Delivery Director, Grants Efficiency Portfolio"
        }
    ]
}