{
    "url": "https://traderemedies.blog.gov.uk/2023/08/15/making-trade-defences-work-for-a-post-brexit-uk/",
    "title": "Making trade defences work for a post-Brexit UK",
    "authors": [
        "John Kirkpatrick, Investigations Delivery Director"
    ],
    "categories": [
        "Investigations"
    ],
    "pub_date": "2023-08-15T11:41:06+01:00",
    "content": [
        {
            "text": "The TRA’s Annual Report and Accounts, published last month, highlighted that our work falls into two categories. We conduct new cases in response to applications from companies – both UK producers and overseas exporters – who think they’ve been harmed by unfairly traded imports. We have made recommendations to the Secretary of State on the first three such cases and are discussing possible applications with half a dozen UK industries."
        },
        {
            "text": "But the bulk of our work to date has been transition reviews, unique to the UK. We are in the process of establishing whether measures put in place by the EU while the UK was a member and transitioned into UK law when we left the EU remain suitable.  If they are we recommend keeping them, sometimes adjusted for UK circumstances; if not, we We’re about half-way through that task, so it’s worth reflecting on what has driven our findings and what consequences they have had."
        },
        {
            "text": "In transition reviews we look at both whether the measure is right for the UK and whether it’s right for the present and future (rather than the past when it was imposed). To determine that, we have to ask ourselves whether we think dumped or subsidised imports would be likely to continue or resume if we removed the measure; if they would, whether UK industry would be harmed, and if so, whether maintaining the measure would be in the UK’s economic interests."
        },
        {
            "text": "On the basis of these tests, we are able to recommend maintaining, varying or revoking measures. And in the programme so far, we have done all three:"
        },
        {
            "text": "In all cases where a final decision has been made, the Government has accepted and implemented our recommendations."
        },
        {
            "text": "It’s important that measures are revoked where there is no risk of harm to UK industry, because those measures serve no purpose but to raise costs for UK consumers. For example, removing a tariff of £50 to £150 per tonne on HVO biodiesel used as heating oil has the potential to expand the market by making HVO more competitive. Removing measures on steel bars and rods could be expected to reduce costs for UK importers by over £100,000 a year at current levels of imports."
        },
        {
            "text": "But in many ways, varying a measure is more significant still. It requires us to understand the UK markets for these products in even greater detail – which domestically produced and imported products compete with one another and on what basis. The fact that we do not produce a product that is imported is not in itself decisive. The imports might substitute for domestic production, causing harm."
        },
        {
            "text": "But when we can be sure that there is no such competition, we can safely remove the measure. Imported glass fibre mats can’t be used where chopped strands or rovings are needed. The imported biodiesel product is 40% more expensive than the domestically produced one; it is hard to imagine many price-sensitive customers switching to it. In road wheels, the pattern is the other way round – it is hard to imagine customers who prefer to buy, say, a £100 product today when there is a £20 product readily available switching because the £20 product is reduced to £18. Whichever way round, we have judged in all these cases that a measure fit for the EU is not quite right for the UK and changed it to one that is. So we have avoided imposing costs on UK importers and consumers unless justified by the need to protect UK producers from harm."
        },
        {
            "text": "While we have adjusted the geographical scope of some measures or the range of products they cover, we have not changed the level of duty payable on any of the products we have investigated. We have the power to recalculate a level of duty appropriate for the UK – that is, one that would eliminate the harm to UK industry without distorting trade flows more than necessary – to replace the measure assessed by the EU. But we have not yet been able to assemble the data to enable us to do so accurately or credibly in any case to date. We expect that to be difficult, especially where the measures in force have reduced or eliminated imports. But we are still considering whether it may be possible in some of our current cases where imports have continued while measures have been in place. Watch this space for news of whether we achieve that."
        }
    ]
}