{
    "url": "https://defrafarming.blog.gov.uk/2023/08/15/small-rd-partnership-projects-competition-now-open/",
    "title": "Small R&D Partnership Projects competition now open",
    "authors": [
        "Joss Wallace"
    ],
    "categories": [
        "Payments for research and innovation"
    ],
    "pub_date": "2023-08-15T12:03:20+01:00",
    "content": [
        {
            "text": "Earlier this month, I blogged about 2 upcoming grants to support innovation in farming. I said I’d write again when each competition opened. "
        },
        {
            "text": "I’m pleased to say that the Small R&D Partnership Projects competition is now open. "
        },
        {
            "text": "Through this competition, we want to enable UK-based businesses to collaboratively develop solutions which improve productivity, sustainability, resilience in farming and realise our net zero ambitions. "
        },
        {
            "text": "We want to support solutions that have positive outputs for farmers, growers or foresters and accelerate adoption by sharing knowledge across the sector. "
        },
        {
            "text": "So, if you meet the eligibility criteria set out in the guidance, now’s the time to apply for a share of up to £9.8 million in grant funding to support your project. "
        },
        {
            "text": "I encourage you to read the Small R&D Partnership Projects competition guidance before starting your application.  "
        },
        {
            "text": "It includes the aim of the competition, the eligibility criteria and explains the application process. You’ll also find details of who to contact if you need help as you apply.  "
        },
        {
            "text": "This competition is part of the Industry-led R&D Partnerships Fund, which is, in turn, part of Defra’s Farming Innovation Programme, delivered by Innovate UK."
        },
        {
            "text": "I'll end by wishing applicants the best of luck! "
        }
    ]
}