{
    "url": "https://nationalscreening.blog.gov.uk/2023/08/15/uk-nscs-next-annual-call-for-topics-will-open-on-1-july-2024/",
    "title": "UK NSC’s next annual call for topics will open on 1 July 2024",
    "authors": [
        "Professor Sir Mike Richards"
    ],
    "categories": [
        "General"
    ],
    "pub_date": "2023-08-15T11:52:34+01:00",
    "content": [
        {
            "text": "The UK National Screening Committee’s (UK NSC’s) next annual call for new screening topics will open on 1 July 2024."
        },
        {
            "text": "This is our regular opportunity for you – our stakeholders – to submit proposals to the committee. During the 3-month annual call period, individuals or organisations can propose potential new screening programmes, the inclusion of new technologies in screening programmes we have not previously reviewed, modifications to current screening programmes, or early updates (following new evidence) to topics on our list of recommendations for regular review."
        },
        {
            "text": "Following the expansion of the UK NSC’s remit, proposals can cover targeted and stratified screening as well as population screening."
        },
        {
            "text": "In previous years, the annual call ran from 1 September to 31 December, and we received a record 30 submissions during the 2022 annual call."
        },
        {
            "text": "This will help align the UK NSC’s work with government budget and planning cycles. It will enable the committee to commission evidence review work more promptly and prioritise emerging matters fairly and equitably. It will also help us to pursue topics that feed into our strategic initiatives, putting them into an annual workplan in line with the setting of budgets and staffing."
        },
        {
            "text": "This means there is now a  gap before the opening of the 2024 annual call. This will give us time to recruit the new expert evidence team staff needed to manage an increasing workload. It will also enable us to complete the UK NSC screening evidence reviews that are already under way."
        },
        {
            "text": "We know this change may be disappointing. However, if you have previously been advised that the next annual call would start this September then we will accept your submission this autumn, although the process will be slower than in the past. We will, as usual, keep you up to date on the progress of your proposal."
        },
        {
            "text": "For more information, please see the UK NSC annual call submission process. You can also email screeninginformation@dhsc.gov.uk if you have any queries."
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK National Screening Committee. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, email screeninginformation@dhsc.gov.uk."
        }
    ]
}