{
    "url": "https://dragonsden.blog.gov.uk/2022/01/06/dragons-den-series-19-episode-1/",
    "title": "Dragons' Den, Series 19, Episode 1",
    "authors": [
        "Clare Saunders"
    ],
    "categories": [
        "Copyright",
        "Designs",
        "International",
        "Licensing",
        "Patents"
    ],
    "pub_date": "2022-01-06T21:01:23+00:00",
    "content": [
        {
            "text": "Happy new year to all readers of the blog! What better way to start 2022 than with the Dragons who are back for Series 19? It’s hard to believe this will be my 9th year of writing for this blog series where we spot all the Intellectual Property that appears in the pitches from the entrepreneurs. Way back in my first blog for series 12 I wrote about vegetable crisps and food has always had a strong presence in pitches. From peanut butter, gourmet marshmallows, cider, craft ale, tea and of course arguably the most famous product to come out of the Den – Reggae Reggae sauce, the entrepreneurs and Dragons alike are food obsessed."
        },
        {
            "text": "It’s gouda brie a good day in the Den"
        },
        {
            "text": "So it was an apt start that the opening pitch of Series 19 was from The Cheese Geek. Now my Christmas, like many other people’s I’m sure, was one where cheese boards featured heavily. Edward Hancock and Richard Simpson were looking to tempt the Dragons into a £150k investment for a 3% stake in their cheese subscription boxes. A delivery of cheese through my letter box is certainly something I could get on board with and seemingly so could the Dragons. But as the pitch unfolded they were less interested in the cheese and more interested in the technology that the duo had developed to help subscribers receive perfectly matched pairings each month."
        },
        {
            "text": "Generally things like software in computer programs and apps are protected by copyright. This protects literary or visual content and allows you to take action against anyone who tries to copy or recreate your work without permission. There are some instances where patent protection is possible for software, but in order to be patentable the software must be new and inventive. If you’re unsure whether your invention is patentable it is always worth seeking advice from an IP professional."
        },
        {
            "text": "Peter Jones also felt that the Cheese Geek model would be palatable around the world.  Intellectual property rights are mostly territorial so they only give protection in the countries where they are granted or registered. To protect their business from being infringed, Edward and Richard should consider protecting their IP rights in the countries they wish to trade in and also in those where they can grant licenses."
        },
        {
            "text": "In a well-run licensing program, the property owner maintains control over the brand image and how it's portrayed. They can then reap the benefits in additional revenue (royalties), but also from exposure in new channels, markets or countries."
        },
        {
            "text": "By the end of the pitch, Cheese Geek had three Dragons ready to invest, but it was new Dragon Steven Bartlett who won the cheese geek’s attention. At 28, Steven is the youngest ever Dragon but from his bedroom in Manchester, he built what would become one of the world’s most influential social media companies when he was just 21 years old. Steven offered all of the money for 7.5% of the business and secured himself his first investment in the Den."
        },
        {
            "text": "The Cheese Geek pitch had set the bar very high for the first episode back and the following pitch had a lot to live up to."
        },
        {
            "text": "A bright idea?"
        },
        {
            "text": "Grant Bruce’s tiny keyring torches were something that did light up an interest in me though. He was looking for a £40k investment for a 20% share of his business Flux Choice. While all the Dragons agreed the little torches were neat and nicely designed, none of them could really shine a light on what the market need for them would be, especially with most people already having a torch application on their mobile phone."
        },
        {
            "text": "Even if you think you’ve invented the next big thing, you must be realistic about its prospects. If you’re considering whether a patent will be right for you, ask yourself these questions:"
        },
        {
            "text": "A registered design can, in some cases, offer cheaper, quicker and more appropriate protection for your product than a patent. A design protects the visual appearance of a product. So, even if you can't protect its function with a patent, you could protect the way it looks."
        },
        {
            "text": "So there we have it, a taste of the IP in the Den from episode one. If you think you have an excellent brand, have invented the next must have gadget or designed something beautiful why not have a look at our IP Basics videos to find out more."
        }
    ]
}