{
    "url": "https://defrafarming.blog.gov.uk/2022/01/06/find-out-more-about-local-nature-recovery-and-landscape-recovery/",
    "title": "Find out more about Local Nature Recovery and Landscape Recovery",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Countryside Stewardship"
    ],
    "pub_date": "2022-01-06T14:20:26+00:00",
    "content": [
        {
            "text": "Today we published a blog post with news about our 3 environmental land management schemes and Countryside Stewardship payment rates. In that post, we explained how the 3 schemes fit together and the timings for them. "
        },
        {
            "text": "In this post, we'll share a bit more information about eligibility and what the schemes will pay for.  "
        },
        {
            "heading": 2,
            "text": "Local Nature Recovery "
        },
        {
            "text": "Local Nature Recovery will initially cover the following themes:   "
        },
        {
            "text": "The scheme will cover some land management actions that are equivalent to Countryside Stewardship Mid Tier offers, as well as more tailored activities on sensitive sites that are similar to Countryside Stewardship Higher Tier or Higher Level Stewardship offers. "
        },
        {
            "text": "Local Nature Recovery will be open to farmers, foresters and other land managers. "
        },
        {
            "text": "Farmers will be able to enter Local Nature Recovery and the Sustainable Farming Incentive – so long as the actions they commit to in both schemes are compatible and we’re not paying for the same actions twice. Farmers will be able to build an agreement that really works for them and their land. "
        },
        {
            "text": "We are also looking at more ways to encourage and enable farmers to coordinate their activities to deliver more and better outcomes in a local area on behalf of the public. We will continue to test different approaches to this throughout 2022 before we start to roll out the scheme in 2023. "
        },
        {
            "text": "Local Nature Recovery agreements will cover multiple years, with the length dependent on the activities being undertaken. There will be flexibility to allow people to add more options or land into their agreement over time. We will continue working with farming experts to make sure the scheme is accessible to tenant farmers and those farming commons. "
        },
        {
            "text": "Alongside this, we will work with farmers and other experts to set up a new facilitation offer that builds on the successes and lessons to be learned from the Countryside Stewardship Facilitation Fund. It will be open to anyone eligible for any of our new environmental land management schemes. Meanwhile, the latest round of funding for the Countryside Stewardship Facilitation Fund opened for applications in December. "
        },
        {
            "heading": 2,
            "text": "Landscape Recovery "
        },
        {
            "text": "Landscape Recovery is for landowners and managers who want to take a more radical and large-scale approach to producing environmental and climate goods on their land. "
        },
        {
            "text": "There is huge potential to make a significant positive impact through Landscape Recovery projects. The scheme will focus on biodiversity, water quality and net zero. We will fund projects that contribute to these outcomes over a long period and through changes and improvements to land use and habitats.  "
        },
        {
            "text": "The first round of projects will be focused on 2 themes:   "
        },
        {
            "text": "This round will be open to any individuals or groups who want to come together to deliver large (500 – 5000 hectares) scale projects. "
        },
        {
            "text": "We intend to launch a second round of pilot projects next year and will confirm the proposed theme(s) for that round in the first half of this year. "
        },
        {
            "text": "Subscribe to the Future Farming blog"
        },
        {
            "text": "We’ll update the blog whenever there is more detail to share about any of our new schemes, so do subscribe to the Future Farming blog."
        }
    ]
}