{
    "url": "https://defrafarming.blog.gov.uk/2022/01/06/get-ready-for-our-3-new-environmental-land-management-schemes/",
    "title": "Get ready for our 3 new environmental land management schemes",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Payments to better understand moorland",
        "Payments to improve animal health and welfare",
        "Payments to restore landscapes and ecosystems",
        "Sustainable Farming Incentive"
    ],
    "pub_date": "2022-01-06T14:17:47+00:00",
    "content": [
        {
            "text": "Today we published more information on Local Nature Recovery and Landscape Recovery – which, along with the Sustainable Farming Incentive, make up our 3 new and ambitious environmental land management schemes. "
        },
        {
            "text": "We also published a document summarising the environmental and climate outcomes we plan to achieve through the 3 schemes. "
        },
        {
            "text": "And, in case you missed it, we released more details about the Sustainable Farming Incentive in December last year. "
        },
        {
            "text": "The documents published today set out the next level of detail for our proposals for Local Nature Recovery and Landscape Recovery. They also include what we will do this year. The documents include information on eligibility, timings and what we are likely to pay for through the schemes. "
        },
        {
            "text": "They follow a speech given by the Environment Secretary, George Eustice, at the Oxford Farming Conference today. It sets the schemes in the wider context of the other exciting changes we’re making over the Agricultural Transition Period."
        },
        {
            "text": "In this post, we'll explain how the 3 schemes fit together, their timings and some news on Countryside Stewardship.  "
        },
        {
            "text": "We've also written a blog post with more detailed information about eligibility and what the schemes will pay for. "
        },
        {
            "heading": 2,
            "text": "The big picture "
        },
        {
            "text": "First, here’s how the 3 schemes fit together.  "
        },
        {
            "text": "All of our schemes will be voluntary – it will be for farmers to decide what the right combination of actions is for their particular setting. We are designing our schemes to be accessible and supportive with fair compensation. All of which should, in turn, incentivise high levels of uptake, leading to our ambitious outcomes. "
        },
        {
            "text": "There are 3 schemes:  "
        },
        {
            "heading": 3,
            "text": "The Sustainable Farming Incentive"
        },
        {
            "text": "This focuses on making agricultural activities more sustainable . It will pay for actions that all farmers can choose to take. This scheme will pay for actions that can be taken at scale across the whole farmed landscape in order to have the most impact. This includes reducing inorganic fertiliser and pesticide use, taking care of our soils and improving farmland biodiversity, water quality, air quality and carbon sequestration. "
        },
        {
            "heading": 3,
            "text": "Local Nature Recovery "
        },
        {
            "text": "This is the more ambitious successor to Countryside Stewardship. It will pay for the right things in the right places and supporting local collaboration to make space for nature in the farmed landscape. This scheme will particularly contribute to our targets for trees, peatland restoration, habitat creation and restoration and natural flood management.  "
        },
        {
            "heading": 3,
            "text": "Landscape Recovery "
        },
        {
            "text": "This will pay landowners or managers who want to take a more radical and large-scale approach to producing environmental and climate outcomes through land use change and habitat and ecosystem restoration. "
        },
        {
            "text": "We’re also working to support access and heritage through all 3 schemes. "
        },
        {
            "text": "Farmers will be able to enter a combination of schemes – so long as the actions they commit to in both schemes are compatible and we’re not paying for the same actions twice.  "
        },
        {
            "text": "People won’t have to navigate multiple schemes and forms to access different ways to get paid to produce public goods. You’ll be able to access the Sustainable Farming Incentive and Local Nature Recovery schemes through a single, simple service that shows all the available options in one place. "
        },
        {
            "text": "Landscape Recovery has a slightly different feel to the other schemes. It will support a smaller number of projects, for those who are considering more radical action at large scale. It will pay for longer-term land use change and habitat restoration. It will involve bespoke agreements tailored to each project. "
        },
        {
            "text": "While we are rolling out our new environmental land management schemes, we are encouraging farmers and land managers to look again at Countryside Stewardship. Countryside Stewardship is a proven mechanism for delivering environmental outcomes and has made a significant contribution to Biodiversity 2020 targets.  "
        },
        {
            "text": "Entering into a Countryside Stewardship agreement offers a great stepping-stone to the new schemes. The number of farmers applying for a Countryside Stewardship agreement increased by 40% this year which was great to see.    "
        },
        {
            "heading": 2,
            "text": "Timings for the 3 schemes "
        },
        {
            "text": "The Sustainable Farming Incentive will start in 2022 with 3 standards: "
        },
        {
            "text": "We will also pay for an annual health and welfare review for livestock. "
        },
        {
            "text": "We plan to introduce more standards incrementally between 2023 and 2025, with the full range available from 2025 onwards. "
        },
        {
            "text": "For Local Nature Recovery – later in 2022, we will publish detailed scheme information and test elements of the scheme, building on the tests and trials we have done so far with a small number of farmers and land managers. Subscribe to the Future Farming blog to find out when and how you can get involved. "
        },
        {
            "text": "In 2023, we plan to make an early version of Local Nature Recovery available to a limited number of people. We will then gradually roll out the scheme across England by the end of 2024. "
        },
        {
            "text": "We are planning to open applications for Landscape Recovery pilot projects in at least 2 rounds over the next 2 years. We will launch the application process for the first round of up to 15 Landscape Recovery pilot projects soon.  "
        },
        {
            "text": "While the new schemes are rolling out, existing schemes will continue to be available for some time, with the last applications for new Countryside Stewardship agreements in 2023, to start in 2024. Then, from 2025, it will only be possible to enter into new agreements through our new environmental land management schemes. "
        },
        {
            "text": "Here is a timeline of our new schemes. "
        },
        {
            "heading": 2,
            "text": "Countryside Stewardship will continue, including accepting new applications "
        },
        {
            "text": "We plan to open the Countryside Stewardship 2023 offer in February 2022 with offers for Higher Tier, Mid Tier, Wildlife offers, and Capital Grants. This is for revenue agreements starting on 1 January 2023. The scheme will also be open to new applicants in 2023 (for agreements starting in 2024).  "
        },
        {
            "text": "We’ve also reviewed Countryside Stewardship revenue payment rates. We will increase payment rates for the majority of revenue options, to reflect changes in agricultural market rates since payment rates were set in 2013. "
        },
        {
            "text": "Where rates have increased, we will increase payments rates for all existing agreement holders with effect from January 2022. Compared to 2013 rates, there is an average increase of around 30% but the changes vary for different options. "
        },
        {
            "text": "Some payment rates have stayed the same and rates for a minority of options have reduced – because in these cases costs have gone down. For these options, we will not reduce rates for existing agreements or those starting on 1 January 2022. We will apply the reduced rates to new agreements starting from 1 January 2023. "
        },
        {
            "text": "This will be the final review of Countryside Stewardship revenue payment rates.  "
        },
        {
            "text": "Here is a table of the full payment rate changes.  "
        },
        {
            "text": "We’ve also made some more improvements to how we operate the scheme, including making it easier to submit applications online.  And we’ve made some improvements to help increase delivery of environmental outcomes, including adding new lowland peatland options and including threatened species management such as stone curlew in Mid-Tier. We’ve made more options compatible in the uplands and expanded the Catchment Sensitive Farming offer.  "
        },
        {
            "text": "We will help farmers in Countryside Stewardship and Environmental Stewardship schemes make the transition to our new schemes from 2024. "
        },
        {
            "heading": 2,
            "text": "Keep up to date "
        },
        {
            "text": "We’ll publish posts whenever there is more detail to share about our new schemes, so do subscribe to the Future Farming blog."
        }
    ]
}