{
    "url": "https://educationhub.blog.gov.uk/2022/01/06/how-good-ventilation-can-help-stop-the-spread-of-covid-19-and-the-omicron-variant-in-schools-and-what-were-doing-to-help/",
    "title": "How good ventilation can help stop the spread of COVID-19 in schools and what we’re doing to help",
    "authors": [
        "Media Officer"
    ],
    "categories": [
        "Colleges",
        "Coronavirus",
        "Schools"
    ],
    "pub_date": "2022-01-06T11:45:45+00:00",
    "content": [
        {
            "text": "One of the key ways of helping to reduce the spread of COVID-19, including the Omicron variant, spreading in schools, colleges and early years settings is to make sure they are well ventilated. Here we look at why ventilation is important and what we’re doing to help schools"
        },
        {
            "heading": 3,
            "text": "Why is ventilation so important?"
        },
        {
            "text": "Good ventilation prevents the virus hanging in the air and infecting people. Many areas of schools are already well-ventilated with plenty of air movement but we want to help schools identify where ventilation can be improved. We took action in the autumn term by providing carbon dioxide (CO2) monitors to all state-funded education settings, including early years, schools and further education providers, backed by £25million in government funding. Across the the education estate we’ve delivered over 353,000 monitors. The new monitors enable staff to identify areas where ventilation needs to be improved and provide reassurance that existing ventilation measures are working, helping balance the need for good ventilation with keeping classrooms warm."
        },
        {
            "heading": 3,
            "text": "So how do these CO2 monitors help? "
        },
        {
            "text": "People exhale CO2 when they breathe. In areas where people congregate it can build up in the air if the spaces aren’t well ventilated. In this sort of situation the C02 itself isn’t harmful but using monitors to detect it helps identify areas where ventilation isn’t good. These are the same areas where if the virus is present it could hang around and infect people. If schools and other education settings know where these areas exist they can take action to ventilate them."
        },
        {
            "heading": 3,
            "text": "Ok so what should a school do when it finds an area that isn’t well ventilated?"
        },
        {
            "text": "The first steps are simple ones like opening doors and windows. Schools should first take these steps and see how it affects the CO2 reading in that area. The feedback we‘ve had from schools suggests they are finding the monitors helpful and that in the majority of cases existing ventilation measures are sufficient."
        },
        {
            "heading": 3,
            "text": "Does that mean children should be in classrooms with the windows wide open all the time in January? "
        },
        {
            "text": "No, in most cases that won’t be necessary. Opening windows regularly for 10 minutes, or a small amount continuously, can still reduce the airborne risk from COVID-19 substantially compared to spaces with no fresh air. The monitors will enable staff to know when the ventilation measures are working, helping to balance the need for good ventilation with keeping classrooms warm."
        },
        {
            "heading": 3,
            "text": "But what about areas where opening windows isn’t possible?"
        },
        {
            "text": "If the issue can’t be fixed easily, schools are advised to look at what works could be carried out to improve ventilation. This could include installing vents, doors or windows."
        },
        {
            "text": "Where it is not possible to maintain adequate ventilation, it may be appropriate to consider the use of an air cleaning unit while the underlying issue is addressed. When used properly, air cleaning units can help reduce the presence of viruses like COVID-19 in a poorly ventilated space. It is however important to note that air cleaning units are not a substitute for ventilation and they are not necessary in the majority of spaces where ventilation is already adequate. Air cleaning devices will not reduce CO2 levels."
        },
        {
            "text": "That’s why, based on the feedback we had from settings following the CO2 monitor programme, for the very few cases where maintaining good ventilation is not possible, we are supplying up to a total of 8000 air cleaning units."
        },
        {
            "text": "For information on the application process including the eligibility criteria and application forms, please see the ‘How to’ Apply for a DfE-funded air cleaning unit guidance. Applications will open on 4 January and close at 9am on 17 January."
        },
        {
            "text": "Although the new monitors should provide reassurance that existing ventilation measures are working, schools are still able to purchase air cleaning units if they wish to and to help them do this at competitive prices we’ve set up a special marketplace where they can work directly with suppliers."
        }
    ]
}