{
    "url": "https://socialworkers.blog.gov.uk/2022/01/06/responding-to-trauma-taking-pride-in-practice-and-celebrating-our-achievements-in-social-work/",
    "title": "Responding to trauma, taking pride in practice and celebrating our achievements in social work",
    "authors": [
        "Mandy Goodenough"
    ],
    "categories": [
        "Celebrating social work",
        "Wellbeing"
    ],
    "pub_date": "2022-01-06T12:51:50+00:00",
    "content": [
        {
            "heading": 4,
            "text": "Mandy Goodenough works for Leicestershire County Council as the Principal Child and Family Social Worker. Her role sits in the unique Practice Excellence team which focuses on supporting the development of the frontline workforce. Here, Mandy discusses how Leicestershire celebrates examples of great practice and the local authority’s ambition to become a trauma-informed organisation."
        },
        {
            "text": "I’ve been a social worker for 21 years. I had my children at a young age and I went back to education as an adult. I studied my A-Levels and then did a degree in Psychology before moving into social work. I think my own history had a role to play in my decision to be a social worker. My brother and I are both adopted. When his adoption broke down when he was 14 years old, he ended up going into care which sadly was not a good experience."
        },
        {
            "text": "This, as well as being a young mum on my own, gave me an understanding of living with trauma and in poverty. These are issues at the heart of social work. I've always been a person that’s interested in supporting others and understanding where they’re coming from. Before I came into child and family social work, I spent time in adult care as a carer for the elderly and ran a Saturday club for disabled children."
        },
        {
            "heading": 2,
            "text": "Our ambition to be trauma-informed"
        },
        {
            "text": "On a day-to-day basis, Leicestershire County Council is on a journey towards becoming a trauma-informed and trauma-responsive organisation. We know from research that many of the workforce come with their own histories of trauma. This brings with it lots of opportunities and understanding. However, working with families can also be triggering; practitioners can experience secondary trauma through the work itself. That’s why it’s important that we recognise, understand and have support in place for all of our staff."
        },
        {
            "text": "Practitioners often work with families who have a long and complex history of neglect, abuse and violence combined with pressing physical, mental, emotional and social needs. This trauma can influence the family’s relationships by impacting their ability to engage and build trust."
        },
        {
            "text": "Our ambition is to create a whole system that is trauma-informed. This needs to take into account leadership, language and communication, physical environment, workforce development, engagement and participation, policy and procedures, commissioning practice, supervision, staff wellbeing, partnership working, interventions, and recruitment."
        },
        {
            "text": "In February 2021, it was agreed by the Leicestershire, Leicester and Rutland (LLR) Strategic Partnership Board that this would be a cross-authority initiative. Here are a couple of examples of the things that we have put in place as part of this work:"
        },
        {
            "text": "We are starting to see the impact of what we are doing. I was talking to a team manager the other day who said they now keep seeing trauma everywhere; they are continually reflecting on what they might do differently to support the families and practitioners working with them. This is a big project, it will be a long journey but it’s very exciting."
        },
        {
            "heading": 2,
            "text": "Learning from what’s gone well"
        },
        {
            "text": "When social work comes up in the press, it’s often negative. Social work is a tough job made tougher by the pandemic. That’s why it's really important that all staff, including qualified social workers, are recognised and celebrated for their amazing practice. This has always been high on our agenda, our different teams have different approaches, for example:"
        },
        {
            "heading": 2,
            "text": "Taking pride in practice"
        },
        {
            "text": "Working remotely has made celebrations a bit trickier, but it’s still important that we all come together when we can. As a whole council, we hold three large conferences a year. One is focused on practice and it’s called ‘Pride in Practice’."
        },
        {
            "text": "We have seven award categories that are open to Children’s Social Care and the Child and Family Wellbeing Service:"
        },
        {
            "text": "Anybody within the organisation can nominate somebody else, as can our children, families and carers. Then a panel shortlists the nominations to create a group of finalists. Every year, the winners are chosen by our Children in Care Council and announced at the conference. Everybody who's nominated will get a certificate and the winners receive a plaque."
        },
        {
            "text": "Our 2021 event took place at the beginning of December and here is what some of the winners had to say:"
        },
        {
            "heading": 4,
            "text": "Cher Watkins, Outstanding ASYE"
        },
        {
            "heading": 4,
            "text": "Margarita Manning, Outstanding Team"
        },
        {
            "heading": 4,
            "text": "Joe Gaywood –  Children’s Advocate"
        }
    ]
}