{
    "url": "https://publicpolicydesign.blog.gov.uk/2022/01/06/what-do-policymakers-do-all-day/",
    "title": "What do policymakers do all day?",
    "authors": [
        "Jonathan Mills"
    ],
    "categories": [
        "Thought leadership"
    ],
    "pub_date": "2022-01-06T12:00:12+00:00",
    "content": [
        {
            "text": "Richard Scarry’s book “What do people do all day?” notably does not include any policy professionals. The lovely illustrations do give a good child-friendly insight into being a firefighter, a doctor, or a dressmaker. But the business of making public policy is sadly absent."
        },
        {
            "text": "There are probably a range of reasons for this – not least that a book written in the United States in the late 1960s, may not have been totally focused on the UK government’s professional definitions. It does however prompt an existential question that haunts lots of us who are policy professionals and have to explain our jobs to our families: what do we do all day? And more to the point, what should we do?"
        },
        {
            "heading": 2,
            "text": "Policymaking is maturing with age"
        },
        {
            "text": "Over the years that I’ve been working in public policy – and especially, for the last four years, as the head of the Policy Profession in the Department for Work and Pensions – I’ve mulled over this quite a lot. I think our sense of what we should be doing has developed and matured over time. As a profession, we are still quite young. While governments have been making policy for as long as they have existed, we only organised ourselves as a profession between 2008 and 2013. We are perhaps just getting to the point of emerging from our teenage years and into adulthood!"
        },
        {
            "text": "The oldest definitions of 'policy' focus on advising Ministers, thinking strategically, legislation, and so on. Often when people talk about 'policy' this is what they are thinking about – almost as the opposite of delivery, with policy being 'developed' and then 'delivered'."
        },
        {
            "text": "Over the last twenty years a lot of work has gone on to challenge this definition and particularly to emphasise the importance of thinking about delivery earlier in the process. Good policy professionals not only do the aforementioned things, they also think about how policy is going to be delivered and consult with delivery professionals when they do their strategic thinking."
        },
        {
            "text": "But this still leads to a rather sequential understanding of policymaking. It suggests that policy professionals think about the role that other professions should take, but infers that policy professionals set strategic direction earlier in a process, and then let delivery happen later in the process."
        },
        {
            "heading": 2,
            "text": "Policymaker as orchestrator"
        },
        {
            "text": "The establishment of the Policy Profession in recent years resulted in better conversations with other professions. This has helped us go further."
        },
        {
            "text": "The way that I now think of a policy professional is as an 'orchestrator'. They bring some specific skills and experience to a job, often in relation to working with Parliament, with Ministers, with stakeholders and with legislation. They should also know their subject area, its dynamics, and how it works. But fundamentally, they do their jobs by bringing other types of professional together and making the whole greater than the sum of its parts."
        },
        {
            "text": "They work to mobilise technical experts and cross-profession teams to get all the best expertise working in an aligned way on issues. And they don’t just do that when designing new policy or starting new initiatives: it is part of every bit of policy work, whether development, implementation, maintenance, or anything else."
        },
        {
            "heading": 2,
            "text": "Future direction for our profession"
        },
        {
            "text": "This is very much the sense of the policy professional that we have encapsulated in our new Policy Profession standards. They focus on ‘strategy’, ‘democracy’, and ‘delivery’ – and are based around the policy professional working in multidisciplinary teams."
        },
        {
            "text": "It’s also the approach we want to embed in the wider work of the Policy Profession, including through the work I am overseeing on organisational capability and how teams work together, rather than just focusing on individual skills. And it is very much in the spirit you can see in the Policy Design Community and the wide range of posts on this blog."
        },
        {
            "text": "I’m not sure Richard Scarry could have drawn it even if he’d wanted to, but this feels like what I do – or at least want to be doing – all day!"
        }
    ]
}