{
    "url": "https://cddo.blog.gov.uk/2023/11/22/from-red-tape-to-rapid-progress-how-digital-reform-is-reshaping-government/",
    "title": "From red tape to rapid progress: how digital reform is reshaping government",
    "authors": [
        "Angus Montgomery, Head of Strategic Projects, CDDO"
    ],
    "categories": [
        "CDDO",
        "Cross-government strategy",
        "Digital transformation"
    ],
    "pub_date": "2023-11-22T11:32:14+00:00",
    "content": [
        {
            "text": "Key to systemic reform is collaboration. The Central Digital and Data Office (CDDO), in partnership with Digital and Data, Commercial and Operational Delivery colleagues across government, is embarking on a journey towards a more efficient, empowered government that delivers better outcomes for all. "
        },
        {
            "text": "There are pockets of excellence in delivery across government, but we know there is more that we could do to support teams to collaborate and deliver at pace easily. We want to scale these pockets of excellence by addressing the systemic obstacles to digital transformation, as outlined in Mission six of our Transforming for a digital future strategy."
        },
        {
            "heading": 3,
            "text": "Why are we reforming the system?"
        },
        {
            "text": "Government’s current digital and data strategy, Transforming for a digital future, sets a bold ambition to transform public services, deliver world-class technology and attract and retain the best digital talent. We recently shared an update about the progress made so far. To make real and sustained change and deliver these goals, we need to address the blockers that inhibit digital delivery. "
        },
        {
            "text": "We need to work collaboratively to unlock governments digital potential, such as by speeding up our funding, procurement, and approval processes. Addressing these things will require radical and systemic reform. By doing this, we will not only enhance efficiency but also accelerate delivery."
        },
        {
            "heading": 3,
            "text": "Our focus"
        },
        {
            "text": "We’re honing in on four key pillars of work: funding, delivery, policy and commercial; "
        },
        {
            "text": "Redefining funding for digital success: Recent research carried out by CDDO, including working with operational departments, found that one of the most significant issues blocking delivery in digital teams was accessing and utilising funding. We want to move away from project-based and often slow and cumbersome processes to access funding, to funding consistent products, services, and user journeys based on the value they’re delivering to the public. We're collaborating with HM Treasury and departments to create a new delivery-focused and performance-dependent funding model that supports teams to deliver faster, more innovatively and more productively. "
        },
        {
            "text": "Agile and innovative delivery: Currently, multidisciplinary teams are working to deliver critical digital services to the public, but we plan to go further by focusing digital delivery in delivery teams that incorporate policy, digital, data, technology and operations. "
        },
        {
            "text": "We recently updated the Digital Functional Standard that defines and shapes what a successful digital organisation looks like and how it operates. We have also just released the accompanying Digital Assessment Framework, to help government organisations meet the expectations of the current digital landscape. "
        },
        {
            "text": "We’re also developing a target delivery structure, with processes and roles that will enable more agile ways of working at all levels within government departments, including working with departments to test and iterate the designs."
        },
        {
            "text": "Policy fit for the digital age: We want to help civil servants implement government’s policy objectives and outcomes in effective, efficient and user-focused ways by ensuring closer collaboration between policymakers and digital specialists. We are championing integrated, collaborative, and digitally-aware policy from the start. For example, we are developing a Digital Readiness Check for policy, a set of key principles and questions to work through when developing policy or legislation, to ensure policy is designed to be implemented digitally from the outset."
        },
        {
            "text": "Scaling up and driving down our commercial vision: We are making sure digital routes to market are faster and more flexible to rapidly capture new opportunities, such as the latest tech solutions, or utilising government’s scale to drive down unit prices and increase standardisation. We also want to make sure we’re set up to support continuous and agile teams by partnering with the Crown Commercial Service to agree on effective interventions to make it easier and faster to bring in what we need."
        },
        {
            "text": "Underpinning this, we are dedicated to enhancing digital and data capabilities and fostering collaboration beyond Government’s Digital and Data function to build capability between functions. This includes expanding the digital and data capability offerings and creating roles that are multidisciplinary across functional boundaries. "
        },
        {
            "heading": 3,
            "text": "Work with us"
        },
        {
            "text": "We know there's a growing interest in reform and making positive changes across government and we're enthusiastic about working together. We’re seeking others to pool our expertise and perspectives to make government more efficient, transparent, and delivery-focused. Join us in turning this shared vision into a practical reality that benefits everyone - if you're eager to be part of our work on piloting and implementing these approaches, please reach out and get involved by emailing us at cddo-system-reform@digital.cabinet-office.gov.uk"
        },
        {
            "text": "We’ll be sharing more about our approach to system reform in the next few months."
        }
    ]
}