{
    "url": "https://publicguardian.blog.gov.uk/2023/11/22/power-of-attorney-stories-kamlesh/",
    "title": "Power of Attorney stories: Kamlesh  ",
    "authors": [
        "rebeccaparker1"
    ],
    "categories": [
        "Future planning",
        "YourVoiceYourDecision"
    ],
    "pub_date": "2023-11-22T13:31:13+00:00",
    "content": [
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "text": "A lasting power of attorney (LPA) allows you to nominate someone you trust, known as an attorney, to step in if you lose the mental capacity to make certain decisions yourself. They are legal documents that cover decisions about health and welfare, or property and finance.    "
        },
        {
            "text": "In this blog Kamlesh, aged 49 from Leicester, shares why he decided to make an LPA and why family gatherings and celebrations could be a good place to start a conversation.  "
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "What's something you'd like people to know about you?  "
        },
        {
            "text": "I don’t take life too seriously. Outside of work I’m close to my family and friends and proud to belong to a thriving Asian community in Leicester. Diwali is upon us and it’s a time to reflect on what has gone by and what is to come in our new year. As I prepare to celebrate Diwali with my nearest and dearest, I am especially reminded of the importance of this quality time and what it means, but also the need to plan and how to take practical steps to do this. "
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Why do you think a family gathering or celebration like Diwali might be a good place to start a conversation about LPAs with loved ones? "
        },
        {
            "text": "It is important that the whole family are involved in the discussion process around LPAs so there are no shocks or surprises. Families usually gather around Diwali so it’s a great time to have this conversation.  "
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Why did you decide to make an LPA?  "
        },
        {
            "text": "I was an attorney for my parents previously and I made my own LPA last year as I had just gone through a divorce. This put into perspective the importance of getting my affairs in order. By profession I am also a Lawyer specialising in this area of law so have seen first-hand how having an LPA can support people.   "
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "How has having an LPA helped you and your family?  "
        },
        {
            "text": "Honestly, it has given me such peace of mind. It is assurance for me that my decisions are respected should anything happen in the future, and my family understand those wishes.  "
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Tell us about your relationship with your attorneys. How did you decide who your attorneys would be?  "
        },
        {
            "text": "My attorneys are my best friend and my eldest daughter. I have brilliant relationships with them both. I understand the importance of balancing the love you have for your family and friends with the practicalities of life. I would recommend, if you are able, to think about who that person or people are that you trust to make decisions for you, if you’re not able to.  "
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "When did you bring up the subject of an LPA and have the conversation with your loved ones?  "
        },
        {
            "text": "Obviously, my family and close friends know what I do for a job and were aware of my divorce and the changes this brought to my life. This made it a bit easier to start the conversation and they were all very supportive. We all talked about it together, and as my parents have LPA’s themselves, they understood my reasons and were pleased I was taking this step. "
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Why would you recommend others think about getting an LPA? "
        },
        {
            "text": "Being a member of the Asian community, I don’t think enough people know or understand what LPAs are and how they can help you. Without an LPA it’s not as straightforward as next of kin just stepping in. Having an LPA in place ensures that elders and loved ones have a final say and their decisions are respected.  "
        },
        {
            "text": "No one has a crystal ball, so you never know what, if anything, is going to affect your life later down the line. Having an LPA will give you that peace of mind that you have decided who will support you when you need it.  "
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Has anything surprised you about the LPA process?  "
        },
        {
            "text": "Although it took time to process, there was lots of information online and the journey from application to registration was simple.  "
        },
        {
            "text": " "
        },
        {
            "text": "It's never too early to talk about lasting powers of attorney with someone you trust. Start a conversation today.    "
        },
        {
            "text": "Find out more at  https://powerofattorney.campaign.gov.uk/.      "
        },
        {
            "text": " "
        },
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "text": "Mae atwrneiaeth arhosol (LPA) yn caniatáu i chi enwebu rhywun rydych chi’n ymddiried ynddo, a elwir yn atwrnai, i gamu i mewn os byddwch chi’n colli’r galluedd meddyliol i wneud rhai penderfyniadau eich hun. Dogfennau cyfreithiol ydyn nhw sy’n ymdrin â phenderfyniadau ynghylch iechyd a lles, neu eiddo a chyllid.    "
        },
        {
            "text": "Yn y blog hwn, mae Kamlesh, 49 oed o Gaerlŷr, yn rhannu pam y penderfynodd wneud atwrneiaeth arhosol a pham y gallai digwyddiadau a dathliadau teuluol fod yn lle da i ddechrau sgwrs.  "
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Beth hoffech chi i bobl ei wybod amdanoch chi?  "
        },
        {
            "text": "Dydw i ddim yn cymryd bywyd ormod o ddifrif. Y tu allan i’r gwaith, rwy’n agos at fy nheulu a’m ffrindiau ac yn falch o fod yn rhan o gymuned Asiaidd ffyniannus yng Nghaerlŷr. Mae Diwali ar ein gwarthaf ac mae’n amser i fyfyrio ar yr hyn sydd wedi digwydd a’r hyn sydd i ddod yn ein blwyddyn newydd. Wrth i mi baratoi i ddathlu Diwali gyda’r bobl sy’n annwyl i mi, rwy’n cael fy atgoffa o bwysigrwydd treulio amser gyda’n gilydd a beth mae hyn mae’n ei olygu, ond hefyd o’r angen i gynllunio ar gyfer y dyfodol a sut i gymryd camau ymarferol i wneud hyn. "
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Pam ydych chi’n meddwl y gallai digwyddiad neu ddathliad teuluol fel Diwali fod yn lle da i ddechrau sgwrs am atwrneiaethau arhosol gydag anwyliaid? "
        },
        {
            "text": "Mae’n bwysig bod y teulu cyfan yn rhan o’r drafodaeth ynghylch atwrneiaethau arhosol er mwyn osgoi unrhyw sioc neu syndod. Mae teuluoedd fel arfer yn dod at ei gilydd adeg Diwali felly mae’n amser gwych i gael y sgwrs hon. "
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Pam wnaethoch chi benderfynu gwneud atwrneiaeth arhosol?  "
        },
        {
            "text": "Roeddwn i’n atwrnai i fy rhieni cyn hyn ac fe wnes i fy atwrneiaeth arhosol fy hun y llynedd gan fy mod i newydd fynd drwy ysgariad. Fe wnaeth hyn ddangos i mi pa mor bwysig yw cael trefn ar fy materion. Hefyd, cyfreithiwr ydw i wrth fy ngwaith ac rydw i’n arbenigo yn y maes cyfreithiol hwn, felly rydw i wedi gweld yn uniongyrchol sut mae cael atwrneiaeth arhosol yn gallu cefnogi pobl.  "
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Sut mae cael atwrneiaeth arhosol wedi eich helpu chi a’ch teulu?  "
        },
        {
            "text": "Mae wedi rhoi tawelwch meddwl i mi. Mae’n rhoi sicrwydd i mi y bydd fy mhenderfyniadau’n cael eu parchu os bydd unrhyw beth yn digwydd yn y dyfodol, a bod fy nheulu’n deall y dymuniadau hynny. "
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Dywedwch wrthym am eich perthynas â’ch atwrneiod. Sut wnaethoch chi benderfynu pwy fyddai eich atwrneiod?  "
        },
        {
            "text": "Fy ffrind gorau a fy merch hynaf yw fy atwrneiod. Mae gen i berthynas wych â’r ddau ohonyn nhw. Rydw i’n deall pa mor bwysig yw cael cydbwysedd rhwng eich cariad at eich teulu a’ch ffrindiau, ac agweddau ymarferol bywyd. Byddwn yn argymell, os gallwch chi, eich bod yn meddwl pwy yw’r person neu’r bobl rydych chi’n ymddiried ynddyn nhw i wneud penderfyniadau ar eich rhan, os nad ydych chi’n gallu gwneud penderfyniadau eich hun. "
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Pryd gawsoch chi sgwrs â’ch anwyliaid am atwrneiaeth arhosol?  "
        },
        {
            "text": "Yn amlwg, mae fy nheulu a’m ffrindiau agos yn gwybod beth yw fy swydd ac yn ymwybodol o fy ysgariad a sut mae hynny wedi newid fy mywyd. Roedd hyn yn ei gwneud hi’n haws dechrau’r sgwrs ac roedden nhw i gyd yn gefnogol iawn. Buom i gyd yn siarad am hyn gyda’n gilydd, ac oherwydd bod gan fy rhieni atwrneiaethau arhosol eu hunain, roedden nhw’n deall fy rhesymau ac yn falch fy mod yn cymryd y cam hwn."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Pam fyddech chi’n argymell bod pobl eraill yn meddwl am gael atwrneiaeth arhosol? "
        },
        {
            "text": "Fel aelod o’r gymuned Asiaidd, dydw i ddim yn meddwl bod digon o bobl yn gwybod nac yn deall beth yw atwrneiaethau arhosol a sut gallan nhw eich helpu chi. Heb atwrneiaeth arhosol, nid yw mor syml â’r berthynas agosaf yn camu i mewn. Mae cael atwrneiaeth arhosol ar waith yn sicrhau bod llais pobl hŷn a’u hanwyliaid yn cael eu clywed a bod eu penderfyniadau’n cael eu parchu.  "
        },
        {
            "text": "Does neb yn gallu rhagweld y dyfodol, felly dydych chi byth yn gwybod beth sy’n mynd i effeithio ar eich bywyd yn nes ymlaen, os o gwbl. Bydd cael atwrneiaeth arhosol yn rhoi tawelwch meddwl i chi eich bod wedi penderfynu pwy fydd yn eich cefnogi pan fydd angen hynny arnoch.  "
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Oes unrhyw beth wedi’ch synnu am y broses atwrneiaeth arhosol?  "
        },
        {
            "text": "Er ei bod wedi cymryd amser i brosesu’r atwrneiaeth, roedd llawer o wybodaeth ar-lein ac roedd y daith o’r cam gwneud cais i’r cam cofrestru yn syml.  "
        },
        {
            "text": " "
        },
        {
            "text": "Dydy hi byth yn rhy gynnar i siarad am atwrneiaeth arhosol gyda rhywun rydych chi’n ymddiried ynddo. Dechreuwch sgwrs heddiw.    "
        },
        {
            "text": "Mae rhagor o wybodaeth ar gael yn  https://powerofattorney.campaign.gov.uk/.      "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}