{
    "url": "https://publicpolicydesign.blog.gov.uk/2023/11/22/share-your-views-on-public-design/",
    "title": "Share your views on public design",
    "authors": [
        "Serena Nϋsing"
    ],
    "categories": [
        "Events",
        "PublicPolicyDesign",
        "Research"
    ],
    "pub_date": "2023-11-22T17:06:02+00:00",
    "content": [
        {
            "text": "The UK Civil Service is undertaking a once-in-a-generation review of design in the public sector – an opportunity for all public designers to make their voice heard. We need you to complete the survey."
        },
        {
            "text": "In a recent blog post we introduced public design and made a call for all public designers in government and public organisations in the UK to come together and participate in the Public Design Review. Public design is a term used to describe all types of design practices in the public sector that intend to deliver public value. The review brings together a diverse mix of people from the areas of policy, public spending, design, digital and academia. The aim is to unite designers from all different disciplines around what we all have in common ­- driving public value through design."
        },
        {
            "text": "Design is needed as part of a multidisciplinary approach to better policy making and delivery. The review is taking stock and looking into how design has developed over the last 10 years in the public sector and how it might evolve in future. The review can only be credible and powerful if it amplifies the voice of all designers in the public sector, so it is very important that you take the time to complete the survey."
        },
        {
            "text": "To give you some inspiration, this post aims to give you a taste of some of the conversation we had so far."
        },
        {
            "heading": 2,
            "text": "A retreat for designers"
        },
        {
            "text": "A key milestone of the review to this point has been a retreat day for all co-authors of the review to come together and discuss, challenge, and explore the current and future state of public design in the UK."
        },
        {
            "text": "At the retreat day in October, we asked our 30 participants, design leaders and practitioners from government and academia: What might public design look like in 10 years’ time?"
        },
        {
            "text": "This is a question about how we want to grow as a community and practice, about our values, motivations, and visions. At the day we saw that what motivates people to explore this question is a great passion for making positive impact through design, and a hope that public design will be well understood and respected in the future."
        },
        {
            "heading": 2,
            "text": "Working together to span boundaries"
        },
        {
            "text": "Participants described public design as a process that helps you to get “from ministerial intent into the delivery of services leading into outcomes”. This is a complex process involving many actors with different needs interacting in different ways. Public design can “help you navigate that fog and do it safely”, as one workshop attendee framed it. It’s about avoiding assumption and providing certainty."
        },
        {
            "text": "Facilitating and engaging people were listed as a key activity of public design, bringing together multiple and sometimes conflicting actors to co-design. This also includes unlocking domain expertise in different contexts and turning experience and knowledge into insights and ideas. But designers cannot do this alone. Participants highlighted the importance of multidisciplinary and transdisciplinary teams, involving people inside and outside government, in central and local government, as well as collaborating with people in communities and academia - with the aim of all working together to co-design across services, systems, and sectors."
        },
        {
            "text": "The future of public design needs to “span boundaries” to build evidence, foster change and deliver better public outcomes. There are opportunities for designers of different types to influence the end-to-end journey. “The designer fills in the white space between the other teams” one attendee said."
        },
        {
            "heading": 2,
            "text": "Delivering more inclusive outcomes"
        },
        {
            "text": "Discussions at the retreat day also revealed some of the desired outcomes that public designers are currently working towards. Participants talked about greater inclusion in all aspects of our work from more inclusive communication to more inclusive outcomes to having more inclusive management structures. Public design should facilitate all of those as well as should be facilitated by all of those. A retreat day attendee said:"
        },
        {
            "text": "One important step to get us there, is a better integration of policy and delivery as mentioned by many participants. Therefore, we need better understanding and trust from both sides."
        },
        {
            "text": "But if we want public services and policies to be inclusive, we must fairly understand the needs of the people that will use them and be affected by them. At the retreat day participants highlighted the need for better representation – breaking down national and social barriers so design reflects everyone. One idea that was mentioned was about having open living spaces or ‘hubs’ to be able to interact and design with citizens in an open, shared physical space."
        },
        {
            "text": "Finally, people also talked about developing a planet-centred mindset and coherent long-term thinking to help us deliver more inclusive outcomes."
        },
        {
            "heading": 2,
            "text": "Imaginative leadership for future"
        },
        {
            "text": "In order to achieve these things, public designers need to be supported and enabled through better infrastructure, strong design leadership and a richer understanding of design across the sector. A good infrastructure as outlined by participants includes access to data, tools, and resources as well as clear progression paths. What does a career path for a public designer look like? Is there a future for more designers in public leadership positions? Participants described strong design leadership as having more design awareness from the top, and public design being championed and embedded as an organisational strategy."
        },
        {
            "text": "Design is about reframing and rethinking the problem to allow discovery of new possibilities. Given that our world is becoming increasingly complex, participants wish for leaders and decision makers with imagination. Imagination is what enables us to look beyond the world as it is and to imagine a better, more equal, and inclusive future. Participants talked about how public design can help making that bridge with democracy and helping make democracy better. So, one participant asked at the end: do we need a minister for design?"
        },
        {
            "heading": 2,
            "text": "Share your thoughts and take part in our survey!"
        },
        {
            "text": "There is much more to say about the role of public design and many more question about its value yet to be answered. To generate a comprehensive picture of the state of public design in the UK public sector we are launching a survey as part of the Public Design Review. If you are designing services, spaces, policies, or systems, we want to hear from you. What are the current capabilities, roles, and values of public design? Share your thoughts by completing this survey on the state of public design the UK public sector and help us better understand our current community and practice."
        }
    ]
}