{
    "url": "https://naturalengland.blog.gov.uk/2023/11/22/the-england-species-reintroduction-taskforce-the-story-continues/",
    "title": "The England Species Reintroduction Taskforce - the story continues",
    "authors": [
        "Andy Clements"
    ],
    "categories": [
        "Species re-introductions",
        "Species recovery"
    ],
    "pub_date": "2023-11-22T14:19:09+00:00",
    "content": [
        {
            "text": "By Dr Andy Clements, Chair of the England Species Reintroductions Taskforce"
        },
        {
            "text": "The England Species Reintroduction Taskforce is coming up to a year old and, having established membership, we held our first meeting (of four so far this year) in February 2023. In August this year, I wrote an introductory blog outlining the work of the Taskforce. This and future blogs will update progress and delve into more detail on the work we are doing and that which is planned."
        },
        {
            "text": "Like all new initiatives the Taskforce is in a period of ‘forming’, establishing our place in a busy sector. Because of the title ‘Taskforce’ some see us as a driver of species reintroductions and other conservation translocations, prioritising which species should be reintroduced, and those which should not. The recent EFRA Select Committee inquiry into species reintroductions clearly thought this was the case."
        },
        {
            "text": "We prefer to think of our role as a forum that can provide evidence-led advice and guidance to ensure that conservation translocations are carried out in the most effective way, for nature’s recovery and for the people and communities. This role is backed up by the diverse expertise in the members of our panel: a range of highly qualified and experienced professionals from the academic, farming, environmental NGO, and social and economic sectors. All of these members have other demanding roles and give their time voluntarily to help the Taskforce."
        },
        {
            "text": "The English Code and IUCN Guidelines are the core guiding principles for those proposing conservation translocations. However, we recognise that these may not be well known and are not adhered to consistently in proposals that come forward as a result. In addition, many conservation translocations take place ‘on the fly’ without reference to guidance and occasionally in contravention of the law."
        },
        {
            "text": "For these reasons, a key piece of current work of the Taskforce is to promote the England Code including not just biological and ecological matters, but also how introduced species might affect people and vice versa.  This will encourage best practice in achieving more and better conservation translocations in future and give confidence to those following the guidance. This should also reduce the likelihood of ill-planned conservation translocations and lessen the risk of unexpected spill-over impacts, for example, the accidental introduction of new pathogens, the release of individuals of inappropriate genetic provenance, or unacceptable socioeconomic damage."
        },
        {
            "text": "There is much information available both at home and internationally, and it is our mission to make this more accessible and useful. We are working on a public information repository to provide a single platform for storing and sharing evidence-led guidance on conservation translocations in England. This will be housed at (or signposted from) our GOV.UK website and will be the subject of a future blog. It will also include case studies like the case study summaries recently published to accompany the England Code."
        },
        {
            "text": "Our first blog elicited significant interest from stakeholders. This has reinforced our commitment to broaden our stakeholder engagement. During the autumn we have been meeting with groups with certain taxa and sectorial interests, such as entomologists and farmers and land managers, hearing their views, concerns and positive experiences of participating in conservation translocations."
        },
        {
            "text": "This will inform much wider stakeholder engagement, and we are interested in hearing from anyone reading this blog about how you would like the Taskforce to be listening to your views and experiences, both positive and negative, and building this into our evidence-led provision of advice and guidance. In due course a future blog will detail our experiences of engaging with our stakeholders and set out our plan for more and wider collaborations."
        },
        {
            "text": "We are currently beginning two more in-depth pieces of work, the first to provide guidance on delivering more and better conservation translocations, and the second to understand the ecological and social benefits and risks of broadening the predator guild of England. Will we devote a future blog to reporting the details of these initiatives."
        }
    ]
}