{
    "url": "https://healthmedia.blog.gov.uk/2023/11/22/what-were-doing-to-speed-up-clinical-trials-in-the-uk/",
    "title": "What we’re doing to speed up clinical trials in the UK",
    "authors": [
        "DHSC Media Team"
    ],
    "categories": [
        "Life Sciences",
        "Medicines",
        "NIHR",
        "Research"
    ],
    "pub_date": "2023-11-22T15:00:09+00:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "The government has published its full response to Lord O’Shaughnessy’s independent review into commercial clinical trials in the UK."
        },
        {
            "text": "The response outlines plans to make the UK one of the best places in the world to conduct clinical trials by implementing all of the recommendations made by Lord O’Shaughnessy."
        },
        {
            "text": "It follows an announcement in May this year to speed up clinical trials and make it easier for revolutionary healthcare treatments to get to NHS patients, which was backed by £121 million in government funding."
        },
        {
            "text": "The full government response is available here."
        },
        {
            "text": "In a joint foreword with the UK health secretaries, Health and Social Care Secretary Victoria Atkins wrote:"
        },
        {
            "text": " “The actions we are taking now to address the recommendations of the review will provide benefits for patients and the NHS across the UK; improve the environment for all types of clinical research; and drive forward improvements urgently to maintain our place as one of the most attractive places in the world to conduct industry clinical trials."
        },
        {
            "text": "“Our actions are supporting our fantastic life sciences sector, bringing investments into the UK and helping to build the economy. By delivering improvements across the whole clinical research pathway from early translation to late phase trials, we will ensure more people have access to innovative clinical trials that are relevant to them, and ultimately deliver better prevention, treatment, and care for all.”"
        },
        {
            "heading": 2,
            "text": "What was the aim of the independent review?"
        },
        {
            "text": "The government appointed Lord James O’Shaughnessy, former health minister, in February 2023 to carry out an independent review into UK commercial clinical trials."
        },
        {
            "text": "He made 27 recommendations where action should be taken by the government and delivery partners - NHS England, Medicines and Healthcare products Regulatory Agency (MHRA), the Health Research Authority (HRA) and the National Institute for Health and Care Research (NIHR) - to address key challenges and transform the commercial clinical trials environment."
        },
        {
            "text": "We are implementing his recommendations in full."
        },
        {
            "heading": 2,
            "text": "What are the main recommendations you are implementing? "
        },
        {
            "text": "Over the next two years the government will fully implement the five headline commitments announced in May 2023. These include:"
        },
        {
            "text": "The government is also committed to:"
        },
        {
            "heading": 2,
            "text": "What progress has been made since the review was published? "
        },
        {
            "text": "Since the publication of the review in May 2023, we have made strong progress in strengthening the clinical research system, including:"
        },
        {
            "heading": 2,
            "text": "Are you supporting this with new funding?"
        },
        {
            "text": "In May, we outlined the following funding commitments:"
        },
        {
            "text": "This £121 million will be funded by £20 million of new funding and £101 million from reprioritised DHSC budgets (NIHR)."
        },
        {
            "heading": 2,
            "text": "How will clinical trials benefit patients and the NHS?"
        },
        {
            "text": "Clinical research is the single most important way in which we improve our healthcare – by identifying the best way to prevent, diagnose and treat conditions."
        },
        {
            "text": "Evidence shows hospitals which undertake research have better patient care outcomes, improved staff retention and it benefits the whole health and care system. Clinical trials are part of the solution for reducing the strain on the NHS."
        },
        {
            "heading": 2,
            "text": "How do commercial clinical trials work? "
        },
        {
            "text": "Commercial clinical trials are fully funded by the companies developing new treatments and products and provide the NHS and patients with earlier access to innovation. The commitments we are announcing will make it quicker and easier for companies to trial more of their products in the NHS."
        },
        {
            "heading": 2,
            "text": "How can I sign up to research? "
        },
        {
            "text": "Anyone can take part in research whether you have a health condition or not. Over 370,000 have already signed up to Be Part of Research this year alone. You can also  take part in research at a local hospital, GP practice – or even at home."
        },
        {
            "text": "It's easy to get involved. Visit here and simply sign up online. You can choose the health conditions you are interested in. You will be sent details of approved studies that match your interests to decide if you want to take part."
        },
        {
            "heading": 2,
            "text": "Quotes "
        },
        {
            "text": "Professor Lucy Chappell, DHSC’s Chief Scientific Advisor, said: "
        },
        {
            "text": "“This programme of work sets out to provide benefit to patients and the public through improved access to clinical trials. The health needs of the UK and our research system are broad and diverse. We are committed to maintaining a rich and balanced research portfolio – early and late phase, commercial and non-commercial trials of varying sizes and with a range of methodologies. This will complement the strong scientific excellence across the UK, and the track record of our system in delivering research that has impact.”"
        },
        {
            "text": "Vin Diwakar, Interim National Director of Transformation, NHS England, said:"
        },
        {
            "text": "“We welcome the recommendations in Lord O’Shaughnessy’s Review and are working with the government to ensure the NHS remains a world leader in health research."
        },
        {
            "text": "“In the last year we’ve made it quicker than ever to set up clinical trials in the UK through the National Contract Value Review policy. Our Workforce Plan recognised the importance of research and we’ve committed to work with the NHS and partners to better support and encourage research workforce careers."
        },
        {
            "text": "“The development of the world’s first effective treatment for Covid-19 by securely using NHS data shows the vital role research plays in saving lives, and we’re committed to helping more people, and more diverse groups of people, get involved in research."
        },
        {
            "text": "“Our NHS DigiTrials service has helped recruit over 1 million people to large-scale, vital studies, and many more have volunteered to take part in research via the NHS App."
        },
        {
            "text": "“I’m delighted to see the number of studies and people taking part in them exceeding pre-pandemic levels, so that the research we carry out today can help save lives in the future.”"
        },
        {
            "text": "Lord James O’Shaughnessy said:"
        },
        {
            "text": "“There have been a number of positive changes since my report was launched. The MHRA is performing much better, there is significant progress towards a national approach to contracting and costing, and most importantly the number of – and patients recruited to – industry-sponsored trials in the UK is growing again."
        },
        {
            "text": "“There is still much to do, so I’m pleased to see a renewed commitment to delivering my recommendations and achieving the ‘double-doubling’ of commercial trials by 2027. This will be an essential part of supporting the life sciences ecosystem and making the UK one of the best places to deliver clinical research.\""
        },
        {
            "text": "Dr June Raine, MHRA Chief Executive said: "
        },
        {
            "text": "“We fully support the ambition for the UK to be one of the most attractive places in the world to conduct clinical trials and our total overhaul of the clinical trial regulations will help achieve this."
        },
        {
            "text": "“As the government response has highlighted, we have already made significant progress. We’re moving away from a one-size-fits all regulatory approach to a more flexible and risk-proportionate one, such as that underpinning our new notification scheme for the lowest-risk trials, that will see up to 20% of trials up and running quicker."
        },
        {
            "text": "“We are confident that our changes will cement the UK as a destination for trials that is innovative, inclusive and international, and will most importantly help get life-changing medicines to the people who need them sooner.”"
        },
        {
            "text": "Nicola Perrin MBE, CEO of AMRC (the Association of Medical Research Charities) said:"
        },
        {
            "text": "“Time matters when you need treatment. Delivering on the vision for clinical research is essential to speed up innovation for all trials including those led by charities. We are eager to take up the opportunity to work with Government and NIHR to raise awareness of the opportunity to participate in research – particularly to ensure that all communities can be reached.”"
        },
        {
            "text": "Darius Hughes, UK General Manager for Moderna, said:"
        },
        {
            "text": "“We welcome the progress made since the report’s publication, particularly on regulatory approval timelines and the introduction of a national mandatory costing approach. The restatement of the ambition to grow clinical trial activity in UK by 2027 to double that of the pre-pandemic baseline also provides an important boost to UK life sciences."
        },
        {
            "text": "“The commitment to increase transparency of UK clinical trial performance through a new suite of performance indicators and deliver large scale trials that recruit from diverse populations are also important deliverables that will widen access to research."
        },
        {
            "text": "“Through Moderna’s significant investment into clinical trials in the UK, we look forward to supporting the full implementation of the report. As well as bringing benefits to UK patients through increased opportunities to access commercial clinical trials, this will help reinvigorate the UK’s world class reputation in clinical research.”"
        }
    ]
}