{
    "url": "https://dfedigital.blog.gov.uk/2023/11/22/working-collaboratively-across-professions/",
    "title": "Working Collaboratively Across Professions",
    "authors": [
        "Laura Croft"
    ],
    "categories": [
        "Careers",
        "community of practice",
        "multidisciplinary teams",
        "professions",
        "research operations",
        "strategy",
        "technology",
        "user research"
    ],
    "pub_date": "2023-11-22T10:21:43+00:00",
    "content": [
        {
            "text": "Working in a multi-disciplinary team is important to deliver great services. Equally, it is important to make time for community."
        },
        {
            "text": "There are lots of ways we work in collaboration with our users and professionals in DfE (Department for Education). Our products and services cross over with those offered by local councils and different user groups."
        },
        {
            "text": "That’s why we have several types of communities of practice including:"
        },
        {
            "text": "Through working openly across government and with our local partners. Our work is more likely to be up-to-date with the latest government design and policy thinking."
        },
        {
            "heading": 2,
            "text": "DfE communities of practice"
        },
        {
            "text": "We have communities of practice for professions, including:"
        },
        {
            "text": "The main purpose is to drive the learning and development of the professions through the sharing of ideas, skills, and experience. This is supported by our Head of Profession team, who look across all DfE's portfolios."
        },
        {
            "heading": 2,
            "text": "Portfolio or business area profession meet-ups"
        },
        {
            "text": "We also use regular profession meet-ups within the vulnerable children and families’ portfolio. These differ from the larger DfE-wide community sessions because we're all working in the same context. This can be an excellent way to get support and advice from those working in the same space."
        },
        {
            "text": "I set up and manage the ‘user-centred design crew’ within the vulnerable children and families’ portfolio."
        },
        {
            "text": "We meet weekly and a typical agenda is:"
        },
        {
            "text": "We’re a team spread out across the country, so we do these calls on Teams. The purpose of the calls is to improve the standards of our services and ensure we are meeting user needs through our user-centred design (UCD) work. The meetings allow us to support each other with UCD conundrums, whilst offering a safe space to get feedback and review work."
        },
        {
            "text": "The group have fed into the DfE community of practice and central government guidance, along with contributing to components and patterns."
        },
        {
            "text": "The UCD crew has helped people to work with others in their profession to solve common problems for the whole portfolio. This has reduced duplication of effort to create more streamlined and sustainable services."
        },
        {
            "text": "And it also helps to make the portfolio a wonderful place to work!"
        },
        {
            "heading": 2,
            "text": "Combination of approaches"
        },
        {
            "text": "Within DfE, different communities and groups take different approaches. The key with all approaches is to establish:"
        },
        {
            "text": "You should keep a record of insights and developments that arise from the group and share them. You will need someone, or a few people, to take the lead to organise and help the group to move forward. It should not be too difficult or time consuming to set up - keep them casual and reactive to the needs of those who take part as they arise."
        },
        {
            "heading": 2,
            "text": "Setting them up"
        },
        {
            "text": "You need to understand the needs of the group, and this may vary or change depending on who is involved. For example, a small group of civil servants may have diverse needs to a larger group that includes both civil servants and contractors. You also need to consider things like behaviours and confidentiality to create a safe space."
        },
        {
            "text": "You can conduct regular retros to help make sure your group or community continues to meet the needs of those who attend and attracts new members."
        },
        {
            "heading": 2,
            "text": "Getting the right people involved"
        },
        {
            "text": "For communities of practice, you should aim to have a consistent and automated process to onboard new starters into their profession. This includes an introduction with their Head of Profession. Ensuring, new starters know about your community through induction packs and the ways you communicate."
        },
        {
            "text": "When setting up a group consider broad involvement of different people with different skills and experience."
        },
        {
            "heading": 2,
            "text": "Set the purpose and share the outcomes"
        },
        {
            "text": "Having an agreed purpose will help everyone to contribute constructively. Setting up some ground rules around ways you will communicate and offer feedback is essential."
        },
        {
            "text": "You should also agree how and with whom you will share the outcomes of your work as a group."
        },
        {
            "heading": 2,
            "text": "Document your approach"
        },
        {
            "text": "Share the details of the group and the purpose in a way that others can view and understand. You can do this through pinned items on Slack channels or through your product and service information."
        },
        {
            "text": "Explain who is involved and why, and where appropriate, share how others can get involved. Also share the outcomes at community meet-ups and show and tells. Through your communications with internal and external stakeholders."
        }
    ]
}