{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2023/06/23/celebrating-international-women-in-engineering-day-2023/",
    "title": "Celebrating International Women in Engineering Day 2023",
    "authors": [
        "Ciara Higham"
    ],
    "categories": [
        "Blog Series",
        "Diversity & Inclusion",
        "Guest Blog"
    ],
    "pub_date": "2023-06-23T09:29:03+01:00",
    "content": [
        {
            "text": "Today, 23rd June 2023, marks the 10th International Women in Engineering Day, brought to you by the Women’s Engineering Society (WES). As a woman working in Engineering, there are times I’ve noticed that I’m one of few women in the room. This isn’t surprising, with figures from June 2021 showing that just 16.5% of engineers are women. #INWED23 aims to give women engineers around the world a profile when they are still hugely under-represented in their professions. The theme for this year is #MakeSafetySeen, focusing on the women who keep us safe at work, home and online."
        },
        {
            "text": "What excites you about working in Engineering?"
        },
        {
            "text": "To highlight women working in Engineering, I asked the question “what excites you about working in Engineering?” to some academics working at the University of Leeds, where I am currently studying for my PhD."
        },
        {
            "text": "“Engineering the built environment to improve air quality needs to bring together lots of different perspectives. I really enjoy working collaboratively to combine technical solutions with understanding from other disciplines such as behavioural science, microbiology, mathematical modelling and architecture to improve buildings for both human health and sustainability.” – Prof. Catherine Noakes, Professor of Environmental Engineering for Buildings."
        },
        {
            "text": "“There is always room to be innovative in engineering. Not only in the way we develop products, processes, and solutions but in our approach to problem-solving and scientific discovery. As a mechanical engineer, I have always enjoyed observing and learning from nature’s innovations and their flexible yet elegant evolution. Driven by curiosity, this creates a constant organic flow from scientific discovery towards innovative solutions in our engineering approach.” – Dr Sepideh Khodaparast, University Academic Fellow."
        },
        {
            "text": "“What I love about engineering is that I never know the answer to a question before it gets asked. I sometimes don’t even know there was a question to be asked! So every day and every problem is interesting and a fun challenge. Plus, the answer always involves something technical and something about people – what a great mix!” – Prof. Barbara Evans, Professor of Public Health Engineering."
        },
        {
            "text": "We need to encourage more women and girls to take up engineering careers. Without doing so, we risk wasting potential talent in the field. If you want to get involved in INWED use the hashtags #INWED23 and #MakeSafetySeen on social media platforms and share your own story!"
        },
        {
            "text": "About me: I am a PhD student at the University of Leeds studying disease transmission that can occur when droplets and aerosols are produced by flushing the toilet. My work looks at how environmental factors, such as ventilation and room layout, can influence transmission. I am currently working at GO-Science on the GSE Profession team as part of the UKRI Policy Internship scheme. I have a strong interest in science policy, and I am keen to work in the field after my PhD."
        },
        {
            "text": " "
        }
    ]
}