{
    "url": "https://environmentagency.blog.gov.uk/2023/06/23/environment-agency-investigation-into-sewage-treatment-works-moves-to-next-phase/",
    "title": "Environment Agency investigation into sewage treatment works moves to next phase",
    "authors": [
        "pressoffice"
    ],
    "categories": [
        "Environment Agency",
        "Water"
    ],
    "pub_date": "2023-06-23T10:10:57+00:00",
    "content": [
        {
            "text": "The Environment Agency (EA) is conducting its largest ever criminal investigation into potential widespread breaches of environmental permit conditions at wastewater treatment works by all water and sewerage companies. As the investigation continues, we are very limited as to what we can share about our inquiries. However, we are committed to sharing information where we can. We can now tell you that the investigation is moving to its next phase which will include visits by EA investigators to sites where offending may have occurred."
        },
        {
            "text": "Since the investigation was launched, we have been working through thousands of documents relating to water company processes and actions at thousands of wastewater treatment works. Working through these documents has been a huge undertaking. Each document can contain large amounts of data which help give us a fuller picture of whether permit breaches have occurred or not. EA specialists have analysed over 2 billion pieces of data to build a comprehensive understanding of the scale of potential offending. Our initial assessment indicates that there may have been widespread and serious non-compliance of environmental permit conditions by all companies. We take the implications of this extremely seriously and are committed to understanding the scale and impact of any alleged offending."
        },
        {
            "text": "We have used the data to guide the next stage of our enquiries and to help us identify specific sites for further investigation. Throughout the coming months the EA will conduct site visits to wastewater treatment works with specialist investigators. The purpose of these visits will be to secure and preserve evidence relevant to our lines of inquiry. It is important to note that our investigation is focused on understanding the facts and these site visits will help us identify whether non-compliance has taken place."
        },
        {
            "text": "Environmental permits exist to protect our environment and limit the impact of pollution; water companies have a legal responsibility to comply with their permit conditions. If we find that water companies have breached their permit conditions, then we will consider all of the options available to us under our Enforcement and Sanctions policy."
        },
        {
            "text": "You can find more information about this investigation here."
        }
    ]
}