{
    "url": "https://deframedia.blog.gov.uk/2023/06/23/expanded-offer-of-the-sustainable-farming-incentive-to-roll-out-from-august/",
    "title": "Expanded offer of the Sustainable Farming Incentive to roll out from August",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Farming"
    ],
    "pub_date": "2023-06-23T09:31:20+01:00",
    "content": [
        {
            "text": "There has been widespread trade coverage in Farmers Weekly Farmers Guardian, Farming UK, Pig World, The Grocer and Business Green on yesterday’s announcement of changes to the Sustainable Farming Incentive (SFI) scheme."
        },
        {
            "text": "BBC Radio 4’s Farming Today programme also carried an interview with the Farming Minister, in which he was asked about the ability for farmers to ‘pick and mix’ and ‘stack’ actions, as well as the changes made to support tenant and upland farmers."
        },
        {
            "text": "The new and improved SFI 2023 will start accepting applications from August, offering farmers additional actions and more flexibility to choose the actions they want to get paid for."
        },
        {
            "text": "Farmers will get paid for taking actions that support food production and improve farm productivity and resilience, while also protecting and improving the environment. Additional actions under SFI 2023 will help ensure there is an offer that is attractive and workable for all types of farms."
        },
        {
            "text": "The 23 actions on offer cover existing themes including soil health and moorland, as well as new actions on hedgerows, integrated pest management, nutrient management, farmland wildlife, buffer strips, and low input grassland."
        },
        {
            "text": "When adopted at scale, these actions will support sustainable food production and contribute towards the environmental targets set out in the government’s Environmental Improvement Plan."
        },
        {
            "text": "Farming Minister Mark Spencer said:"
        },
        {
            "text": "SFI 2023: What’s on offer:"
        },
        {
            "text": "How we’ve simplified SFI:"
        },
        {
            "text": "The government’s flexible and accessible farming schemes, as well as the new measures announced at the Farm to Fork Summit last month, are supporting farmers to keep the nation fed while protecting and enhancing our environment – and are all part of the £2.4 billion annual farming budget ringfenced for the life of this parliament."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}