{
    "url": "https://prisonjobs.blog.gov.uk/2023/06/23/from-fitting-cars-to-steering-prison-wings-jacks-journey/",
    "title": "From fitting cars to steering prison wings - Jack’s journey",
    "authors": [
        "Ministry of Justice"
    ],
    "categories": [
        "operational support grade",
        "OSG",
        "Personal stories"
    ],
    "pub_date": "2023-06-23T15:22:29+01:00",
    "content": [
        {
            "heading": 3,
            "text": "We spoke to Jack, who recently joined the Prison Service as an operational support grade (OSG). After taking advice from his family, who also work in the Prison Service, Jack felt like it was the right time to take his first steps in the service as an OSG. "
        },
        {
            "text": "What did you do before you started work as an OSG?  "
        },
        {
            "text": " I was a fitter at Halfords, I enjoyed it, I like messing with cars."
        },
        {
            "text": "What attracted you to the OSG role?   "
        },
        {
            "text": "At Halfords there was not enough hours, I like to keep busy. There’s nothing better than doing that at a prison.  I get stuck in and like being involved with things. It’s a very varied role.  "
        },
        {
            "text": "What does a typical day as an OSG look like? Key tasks and responsibilities  "
        },
        {
            "text": "We are the frontline of the prison to the public. We search everyone and every vehicle that comes in and make sure they have nothing that is banned from the building. We give visitors the best experience that we can, we provide customer service. I try to be polite and be myself. We are the first faces they will see. The public may not know what the difference is between an OSG and a prison officer. When we give a good representation it’s good for everyone who wears the uniform."
        },
        {
            "text": " You see films and documentaries but it’s completely different to that. I went to an open evening and I thought “this could be a cool place to work at.”"
        },
        {
            "text": "What’s your favourite part of the role?  "
        },
        {
            "text": "My favourite thing is searching of staff and contractors. You get to meet people who you wouldn’t normally have interactions with. I like talking to people. Every person I have spoken to so far has given me advice and ways to do things."
        },
        {
            "text": "What progression opportunities are available to you as an OSG and where do you see your career taking you?   "
        },
        {
            "text": "The plan is to do a year or two as an OSG, get comfortable in the environment and then make that transition across to officer. There are so many doors that can open - it is a good career to get into. I’d like to see how far I can get up the ladder. "
        },
        {
            "text": "What makes HMP Long Lartin a great place to work?   "
        },
        {
            "text": "It’s so different to what you’d expect as a Cat A prison. All the prisoners that I have had interactions with have been respectful and polite, they know you are new and they will ask you about it.  You can have a chit chat about life. We talk to people a lot. There is nothing to be afraid of in this role, you’re not in a room with them on your own.  "
        },
        {
            "text": "You have to have your wits about you, your mind can wonder. I was a bit nervous in case something went wrong, if I got stuck in a room, a door wouldn’t open or something but that’s so unlikely to happen. My main worry was my first day, I didn’t know what to expect. Everyone made an effort to introduce themselves and let me know what their roles were. You’re not left on your own, you’re shadowing people and soon realise there’s a lot more going on behind the scenes. It’s a massive group effort which requires good communication. On my second day I felt like I belonged.  "
        },
        {
            "text": "I haven’t told a lot of people, my partner loves it, it’s a stable job and wage.  "
        },
        {
            "text": "There is a rugby team for Long Lartin, I’ve always played so that’s a big bonus. There are people I’ve played with and against in the prison which is great, some common ground. Even the governors play, it’s amazing. "
        },
        {
            "text": " "
        }
    ]
}