{
    "url": "https://educationhub.blog.gov.uk/2023/06/23/how-we-are-helping-families-with-healthy-eating-and-activities-in-the-school-holidays/",
    "title": "How we are helping families with healthy eating and activities in the summer holidays",
    "authors": [
        "media officer"
    ],
    "categories": [
        "Free School Meals",
        "School food",
        "school holidays"
    ],
    "pub_date": "2023-06-23T16:30:08+01:00",
    "content": [
        {
            "text": "We know that school holidays can be difficult for some families, with children at risk of missing out on healthy meals, activities, and learning opportunities."
        },
        {
            "text": "That’s why the Holiday Activity and Food Programme (HAF) has been supporting children and families in the school holidays since 2018."
        },
        {
            "text": "Here is everything you need to know about the programme and how it could help you and your child during school holidays."
        },
        {
            "heading": 3,
            "text": "What is the Holiday Activity and Food programme?"
        },
        {
            "text": "The Holiday Activity and Food Programme provides healthy food and enriching activities to children and young people, with free places available for those on free school meals during the Easter, summer, and Christmas holidays."
        },
        {
            "text": "School holidays can be a particularly difficult time for some families due to increased food and childcare costs and reduced incomes. It can mean that families struggle to provide food and activities for children."
        },
        {
            "text": "Good nutrition is essential to children’s health and development. This funding helps ensure that eligible children have access to healthy food and as well as fun activities to help keep them active throughout the school holidays."
        },
        {
            "text": "Families who take part in the programme will also be able to learn about nutrition and food budgeting."
        },
        {
            "heading": 3,
            "text": "How does the programme work?"
        },
        {
            "text": "HAF is funded by Government and run by councils who help deliver the holiday clubs."
        },
        {
            "text": "Clubs will offer activities such as arts, sports, drama, and music. Activities on offer can also include trips and other experiences. Clubs must also provide healthy free meals, nutritional education, and physical activities on a daily basis."
        },
        {
            "text": "Some councils may coordinate the clubs and others may to work with another organisation to provide clubs for children locally."
        },
        {
            "heading": 3,
            "text": "Who can benefit from the programme and how can I get involved?"
        },
        {
            "text": "HAF is primarily for children in primary or secondary school who receive benefits-related free school meals, though councils do have some flexibility to provide free access to other children."
        },
        {
            "text": "We also encourage councils to make the holiday clubs available to any children not eligible for and in receipt of free school meals, who can pay to attend."
        },
        {
            "text": "We want all children who attend the programme to benefit from:"
        },
        {
            "text": "For information on how you and your family can get involved, please contact your local council."
        }
    ]
}