{
    "url": "https://aphascience.blog.gov.uk/2023/06/23/international-women-in-engineering-day-2023/",
    "title": "From STEM curiosity to career: a story of success",
    "authors": [
        "Jenn Harris"
    ],
    "categories": [
        "Science Capability in Animal Health Programme",
        "Women in science"
    ],
    "pub_date": "2023-06-23T09:00:24+01:00",
    "content": [
        {
            "text": "In this blog to mark International Women in Engineering Day on 23 June, we hear from Jenn Harris as she talks about her journey to a career in construction and engineering and why the Science Capability in Animal Health (SCAH) programme has given her the perfect opportunity to combine her love of science and engineering."
        },
        {
            "text": "Writing a piece to mark International Women in Engineering Day is a privilege and something I can totally relate to but when I was initially asked to contribute, I felt an overwhelming sense of panic. It is an area I am particularly passionate about and have undertaken my own research on construction and engineering (now published), so why did I find the idea so daunting?"
        },
        {
            "text": "I realised the answer lay in my own personal journey to get to where I am today, maybe contributing to a sense that I was not a true engineer and therefore unqualified to share my views. Like many other women, my career progression has not followed a linear path; it is full of zig zags and turns. In school, I excelled at maths and science, so I was encouraged to study engineering even though teenage me did not really understand what that meant. My ambition at the time was to earn enough money to travel and have a job where I could wear a suit."
        },
        {
            "heading": 3,
            "text": "Building a strong academic foundation"
        },
        {
            "text": "I started university studying chemical engineering. Chemical engineers had the highest pay according to my school guidance counsellor, so it seemed the obvious choice at the time. I enjoyed the subject matter, especially organic chemistry, and I revelled in being the only woman in my sorority revising fluid mechanics."
        },
        {
            "text": "However, in my penultimate year, I was involved in a car accident that changed the course of my life. Instead of taking the rest of the year off to recover from the accident and a severe concussion, I went back to university, determined to continue with my studies. But something in me had changed. The accident made me realise that life is short, and you should spend those precious moments doing what interests you most – so I made some drastic changes."
        },
        {
            "text": "I moved away from engineering towards health sciences and toxicology (I wanted to work in public health). I decided to travel straight after university. My goal to wear a suit went out the window. Travel took me twice around the world before I settled in the UK. With not much money and desperate for work, I took the highest paid temporary role available: project administrator on a construction site. Little did I know that this seemingly inconsequential choice would lead to a rewarding career in construction and engineering."
        },
        {
            "heading": 3,
            "text": "Engineering for a sustainable future"
        },
        {
            "text": "But why is engineering important for society? Engineering applies scientific and mathematical principles to develop solutions for global problems we face, whether that be in creating homes, developing communications, combatting climate change, or tackling health or food security."
        },
        {
            "text": "Last year I jumped at the chance to join the Science Capability in Animal Health (SCAH) programme as it enabled me to combine my interest and experience in public health, science, research, construction and engineering."
        },
        {
            "text": "The programme, a major government investment in the UK’s leading science centre for animal health, is critical to ensure the Animal and Plant Health Agency (APHA) can continue to use the latest advancements in science and engineering to protect animal and plant health to benefit people, the economy and the environment."
        },
        {
            "text": "The much needed billion-pound investment will create a new science campus at APHA’s Weybridge site to future-proof the UK’s ability to respond to new and emerging animal diseases such as avian influenza, tuberculosis and rabies and secure over £12 billion of annual trade."
        },
        {
            "text": "The threat from zoonotic diseases (diseases that can be transmitted from animals to humans) is growing, a fact brought into stark contrast during the COVID-19 pandemic, highlighting the need for future-proofed facilities that can enable scientists at APHA to continue to strengthen our understanding of these diseases to safeguard both animal and public health and hopefully limit future outbreaks."
        },
        {
            "text": "The programme will provide specialist engineering and construction opportunities and it has a well-established Equality, Diversity and Inclusion strategy designed to attract people from a range of varying backgrounds including women who are underrepresented in the sector."
        },
        {
            "text": "Working on the SCAH programme has enabled me to collaborate with inspirational women engineers and scientists to improve the safety and wellbeing of society. On International Women in Engineering Day, we celebrate the work of women in engineering (whether formally qualified or not) who make the world a safer, better and brighter place for everyone."
        },
        {
            "text": "We are also embedding a Science Technology Engineering and Maths (STEM) Ambassador network within SCAH, to encourage young people to consider a career in this field, particularly in engineering and construction. This will complement the outreach activity that APHA scientists are already involved in."
        }
    ]
}