{
    "url": "https://cddo.blog.gov.uk/2023/06/23/introducing-dataconnect23/",
    "title": "Introducing DataConnect23",
    "authors": [
        "Sue Bateman, Chief Data Officer, CDDO"
    ],
    "categories": [
        "CDDO",
        "Cross-government strategy",
        "Data",
        "DDaT community",
        "DDaT events",
        "Digital strategy",
        "Digital transformation"
    ],
    "pub_date": "2023-06-23T14:19:09+01:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "Data-driven insight is important to drive performance and support improved decision making. As part of the Central Digital and Data Office (CDDO) cross-government digital and data strategy, Transforming for a Digital Future: Government's 2022-25 Roadmap for Digital and Data we know better data management will enable improved efficiency and public services. "
        },
        {
            "text": "To that end, we are bringing together data professionals to network, communicate and solve common problems as part of DataConnect23, a free, week long event series aimed at the cross-government data community."
        },
        {
            "heading": 3,
            "text": "Bringing data experts together"
        },
        {
            "text": "Mark your calendars for 25-29 September 2023 for the third DataConnect event series, held in collaboration between CDDO and the Data Quality Hub (DQHub) at the ONS."
        },
        {
            "text": "We created the event series to highlight the interesting data initiatives that often don't get the attention they deserve. DataConnect brings together data experts from across government and has a diverse agenda created for, and led by, the public sector data community."
        },
        {
            "heading": 3,
            "text": "Showcase your work and join us to present #BringItTogether"
        },
        {
            "text": "DataConnect is known for cross team collaboration and innovation. This week of free events offers an arena for anyone working with data in the public sector to:"
        },
        {
            "text": "This year’s theme #BringItTogether centres on the storytelling nature of the event. Led by colleagues at all grades, it will offer:"
        },
        {
            "text": "To realise our data ambitions, we need to work together as multidisciplinary teams, bridge different systems and maximise interoperability. DataConnect23 offers a unique opportunity to enable service delivery across organisations, and for all to share data, skills and insights."
        },
        {
            "heading": 3,
            "text": "Launch event "
        },
        {
            "text": "Our launch event provided a flavour of the topics and subject matter experts that you can hear from in September."
        },
        {
            "text": "Highlights included:"
        },
        {
            "heading": 3,
            "text": "Get ready for DataConnect23"
        },
        {
            "text": "There are many advantages to attending at DataConnect23. We encourage you to add the event series to your diaries now, it’s a fantastic opportunity to connect with like-minded professionals, upskill and learn new things, build your own network and be part of a community. "
        },
        {
            "text": "This event series is not only an opportunity to enrich what you are doing as a data professional but also share your learnings with others. By showcasing your work, you will enhance content, and broaden understanding for others."
        },
        {
            "heading": 3,
            "text": "Curating September’s event "
        },
        {
            "text": "As one team, CDDO and DQHub will help interested speakers curate, lead and take part in varied sessions. Previous sessions have seen enthusiastic participants create content ranging from API platforms to data ethics."
        },
        {
            "text": "We know the ground-breaking work you do, now it’s time to shout about it, and discuss how you overcome challenges. "
        }
    ]
}