{
    "url": "https://lifeathmrc.blog.gov.uk/2023/06/23/king-charles-iii-recognises-hmrc-employees-in-birthday-honours/",
    "title": "King Charles III recognises HMRC employees in Birthday Honours",
    "authors": [
        "Faye"
    ],
    "categories": [
        "General"
    ],
    "pub_date": "2023-06-23T10:51:25+00:00",
    "content": [
        {
            "text": "As King Charles III released his first Birthday Honours list last week, we were extremely proud to hear the news that several of our colleagues here at HMRC were recognised for their contributions to public service. We caught up with some of them to hear their reactions to the wonderful news. "
        },
        {
            "heading": 2,
            "text": "Member of the Order of the British Empire "
        },
        {
            "heading": 3,
            "text": "Diane Heighes, MBE, Government Banking Industry Lead, for services to the State Funeral of Her Majesty Queen Elizabeth II. "
        },
        {
            "text": "Diane received an MBE for services to the State Funeral. When HM The Late Queen died last year, Diane cut short her holiday to return to work to successfully implement plans to ensure that DWP and HMRC could safely pay over £700m of pension and benefits payments early, ahead of the Short Notice Bank Holiday. This meant that some of the UK’s most vulnerable citizens received their income, removing any risk of disruption during this historic event. Diane said:"
        },
        {
            "heading": 2,
            "text": "Medallist of the Order of the British Empire "
        },
        {
            "heading": 3,
            "text": "Gwynne Goodfield, BEM, Tax Specialist Programme Recruitment Lead, for services to graduate recruitment and to sport. "
        },
        {
            "text": "Gwynne has been awarded a BEM for saving taxpayer money in recruitment. He has made tax graduate recruitment in HMRC more sustainable and significantly more cost-effective, reducing the cost per hire from £2,900 to £1,300, saving £175,000 in 2022 alone. He was also given his award for his commitment to sport, where he has been a volunteer and chairman for the past 18 years at Telford and Wrekin Hockey Club. Gwynne said: "
        },
        {
            "heading": 3,
            "text": "Hetalban Patel, BEM, Compliance and Investigation Officer, for services to homeless people in Newcastle upon Tyne. "
        },
        {
            "text": "Hetal has been awarded a BEM for the work she does to help homeless people in Newcastle Upon Tyne. Her charity group is made up of over 116 families who help with donations or distribution. They go out every Thursday evening with food, hot and cold drinks, clothes, sleeping bags plus much more, and distribute them to the homeless people in the city. Hetal said: "
        },
        {
            "heading": 3,
            "text": "Emad Mirza, BEM, Caseworker, for services to mental health. "
        },
        {
            "text": "Emad saved the life of an elderly lady who had abandoned her mobility scooter and was stood precariously on the edge of a bridge. He pulled his car to a halt and rushed out to assist another passer-by who was struggling to keep hold of the lady and prevent her attempts to jump off the bridge. Emad took hold of the lady’s other arm to secure her and prevent her from jumping. When the police arrived, Emad was able to brief the officers and hand control of the situation over to them. Emad said: "
        },
        {
            "heading": 2,
            "text": "Our pride in social good "
        },
        {
            "text": "We are proud of all our colleagues who have received an award in King Charles’s III Birthday Honours List and would like to say a huge congratulations. "
        },
        {
            "text": "At the heart of our work, we are driven by a responsibility to deliver a service for an essential purpose, supporting the customer and enabling investment in providing the best for society and our public services.  "
        },
        {
            "text": "Visit HMRC Careers to find out more about what it’s like to work for us.  "
        }
    ]
}