{
    "url": "https://homeofficemedia.blog.gov.uk/2023/06/23/police-powers-stop-and-search/",
    "title": "Police powers: Stop and search",
    "authors": [
        "Home Office news team"
    ],
    "categories": [
        "Fact sheet"
    ],
    "pub_date": "2023-06-23T15:03:48+01:00",
    "content": [
        {
            "text": "Stop and search powers are a vital tool for the police to prevent violence and other crime."
        },
        {
            "text": "Every knife taken off our streets is a potential life saved - 100,000 knives and offensive weapons have been taken off our streets since 2019, 40,000 seized specifically through stop and search, and the remainder through other action like weapon surrender schemes and police sweeps of hotspot areas of violence."
        },
        {
            "text": "The government fully supports the police to use their full stop and search powers and have taken a range of action in recent years to ensure the police are confident using these powers."
        },
        {
            "text": "We have also strengthened the safeguards, transparency and scrutiny of stop and search, to improve the public’s confidence that the power is being exercised proportionately and legitimately."
        },
        {
            "text": "The powers"
        },
        {
            "text": "Prevention is at the core of stop and search. There are two types of stop and search powers: suspicion-based and suspicion-less stop and search."
        },
        {
            "text": "Suspicion-based stop and search applies to individuals. It allows a police officer to stop and search an individual if they have ‘reasonable grounds’ to suspect they are carrying: illegal drugs, a weapon, stolen property, or something which could be used to commit a crime, like a crowbar."
        },
        {
            "text": "Suspicion-less stop and search applies to specific areas. Called a Section 60 order, police can stop and search people in a designated area they deem may be at risk of violence, without reasonable suspicion, if an officer at Inspector level (or senior) believes people will be carrying weapons."
        },
        {
            "text": "The Public Order Act of 2023 also expanded stop and search powers so police can find items used for locking-on, improving the police’s ability to intervene before serious disruption is caused. This includes suspicion-less stop and search powers which can be used by officers when authorised within a tightly defined area for a limited period of time. We expect this measure to come into force in the coming months."
        },
        {
            "text": "We are also currently piloting Serious Violence Reduction Orders in four areas of the country – Thames Valley, West Midlands, Merseyside and Sussex. These Orders give the police powers to automatically search those previously convicted of weapons offences, to deter them from carrying knives again while ensuring that those who persist are more likely to be caught."
        },
        {
            "text": "Evidence shows that there is a cycle of reoffending when it comes to knife crime. 30% of offenders convicted or cautioned for a knife or offensive weapons offence in the year ending December 2022 already had at least one previous conviction or caution for knife or weapons offences."
        },
        {
            "text": "The effectiveness of stop and search"
        },
        {
            "text": "Stop and search is a key tactic for police to get dangerous weapons off our streets and protect communities from violence and other crime."
        },
        {
            "text": "Since 2019,100,000 weapons have been removed from our streets, 40,000 of those specifically seized through stop and search, also leading to over 220,000 arrests."
        },
        {
            "text": "Safeguards, transparency and scrutiny"
        },
        {
            "text": "In conducting a stop and search, police must adhere to strict safeguards that ensure the dignity of the individual they are stopping and searching and enhance public trust."
        },
        {
            "text": "These safeguards include codes of practice within the Police and Criminal Evidence Act 1984 (PACE) and the use of Body Worn Video to eliminate unlawful discrimination, harassment and victimisation, as well as to take steps to foster good relations with individuals and ensure the welfare of all under the age of 18."
        },
        {
            "text": "Community Scrutiny Panels, made up of members of the public and often chaired by an independent party, review randomly selected records and footage of incidents of stop and search and reflect on whether officers have acted appropriately, providing feedback to their local force."
        },
        {
            "text": "Panels provide continuous learning for forces, identifying good practice which can increase officers’ confidence and feedback that can lead to organisational changes within policing, improvement of police practices and communication."
        },
        {
            "text": "As committed to in the Government’s Inclusive Britain report, the Home Office is working with partners to develop a national framework for local community scrutiny, to improve standards and consistency across the country."
        },
        {
            "text": "FAQs"
        },
        {
            "text": "What training is given to police officers using these powers? "
        },
        {
            "text": "Police officers have stop and search training provided for by their force. This training is designed by the College of Policing and covers both the legislative training and the skills required by officers so they can conduct stop and search effectively."
        },
        {
            "text": "Officers also receive regular refresher training after they have started in post."
        },
        {
            "text": "What happens after a stop and search?"
        },
        {
            "text": "A stop and search is not an arrest. If an item is found following a stop and search then the officer conducting the search will make a decision on the next course of action. This will depend on the item found."
        },
        {
            "text": "If no item is found following a stop and search then the person will no longer be detained and can be released from the search."
        },
        {
            "text": "In either case the person being searched is entitled to a copy of the stop slip which shows the circumstances of the stop and the outcome."
        },
        {
            "text": "Can children be stopped and searched?"
        },
        {
            "text": "They can, as children can carry offensive weapons, but any search of a child must be in a manner appropriate to the child’s age and carried out in a way that de-escalates the situations. Stopping and searching a child must also be carried out in the presence of an appropriate adult."
        },
        {
            "text": "Extensive safeguards exist to protect children who are subject to stop and search, including the use of Body Worn Video and data collection, as well as a legal requirement to consider their safety and welfare, to ensure transparency and accountability."
        },
        {
            "text": "Are stop and search and strip searches used in the same way by police?"
        },
        {
            "text": "Stop and search powers are different to strip search powers, coming under different codes and safeguards."
        },
        {
            "text": "Strip search is one of the most intrusive powers available to the police that must not be conducted routinely, or as an extension of a less thorough search, simply because nothing is found in the course of the initial search."
        },
        {
            "text": "A strip search must be carried out by officers of the same sex as the person being searched and take place away from public view. Where a child is subject to a strip search under these powers, an appropriate adult must be present except in cases of urgency, or if the child signifies, they do not want the adult to be present and the adult agrees."
        },
        {
            "text": "What was the Best Use of Stop and Search Scheme (BUSSS) introduced in 2014?"
        },
        {
            "text": "The Best Use of Stop and Search Scheme placed restrictions on how police could use stop and search."
        },
        {
            "text": "It was a voluntary scheme brought in to achieve greater transparency and community involvement in stop and search. It did this by requesting that police forces provide annual data returns to the Home Office on all stop and search interactions, involve the community in ride along schemes and provide a clear process for the community to feedback into the force any needed improvements for this power."
        },
        {
            "text": "Why did the government remove the Best Use of Stop and Search Scheme?"
        },
        {
            "text": "The restrictions Best Use of Stop and Search Scheme introduced limited when officers could use the power and decreased their confidence in deploying it."
        },
        {
            "text": "Recent Home Secretaries have been keen to rebuild police officers’ confidence to use their full range of powers to seize more dangerous weapons, prevent more violence and save more lives. By removing the restrictions on stop and search officers have full operational flexibility to use stop and search."
        },
        {
            "text": "However, recognising the importance of transparency and community involvement for public confidence, the current Home Secretary has gone further to strengthen two of the former Best Use of Stop and Search Scheme conditions by putting them into law [this will be via PACE CODE A]:"
        },
        {
            "text": "The Home Office is also working with partners to develop a national framework for local community scrutiny, to improve standards and consistency across the country."
        },
        {
            "text": "Are some people disproportionately affected by stop and search?"
        },
        {
            "text": "Nobody should be stopped and searched because of their ethnicity but the government recognises that black males are disproportionately more likely to be stopped and searched."
        },
        {
            "text": "Black males are, however, also disproportionately more likely to killed by violence and knife crime, and the first priority of stop and search must be prevention and public safety."
        },
        {
            "text": "What are you doing to tackle the disproportionate impact of stop and search on this group?"
        },
        {
            "text": "Transparency is being strengthened to improve public trust. Alongside Community Scrutiny Panels and the safeguards that exist to tackle unlawful discrimination, strengthened data reporting and communication between forces and local communities about the use of Section 60 will improve trust and confidence in stop and search."
        },
        {
            "text": "The disparity in the use of stop and search is also gradually reducing, with a fall from 9.5 times higher in 2017/18 and 2018/19 to 4.9 times higher in 2021/22. However, we know there is more to do to close this gap. "
        },
        {
            "text": "Is stop and search the only way the government is hoping to prevent knife crime?"
        },
        {
            "text": "No. The government employs a twin-track approach to tackling knife crime and serious violence, combining tough enforcement to get dangerous weapons off the streets with programmes that steer young people away from crime, with Violence Reduction Units delivering early intervention and prevention programmes to divert young people away from crime."
        },
        {
            "text": "In the first three years of delivery, over 136,000 violence offences were prevented in the areas that operate hotspot policing and host Violence Reduction Units. And in their third year alone, they supported more than 215,000 vulnerable young people."
        }
    ]
}