{
    "url": "https://companieshouse.blog.gov.uk/2023/06/23/register-of-overseas-entities-where-we-are-now/",
    "title": "Register of Overseas Entities: where we are now",
    "authors": [
        "Sara Williams - Implementation Lead, Register of Overseas Entities"
    ],
    "categories": [
        "Companies House transformation",
        "Register of Overseas Entities"
    ],
    "pub_date": "2023-06-23T11:50:09+01:00",
    "content": [
        {
            "text": "It's been nearly a year since we launched the Register of Overseas Entities."
        },
        {
            "text": "The register forms a key part of the government’s strategy to tackle global economic crime. It requires overseas entities that own UK property or land to declare their beneficial owners or managing officers. Overseas entities cannot buy, sell, transfer, lease, or raise a charge against land in the UK unless they’ve registered with Companies House."
        },
        {
            "text": "We recently received an international award from the Corporate Registers Forum (CRF) for our work on implementing the Register of Overseas Entities. The judges described the introduction of the register as ‘a true display of agile innovation’. This was a very proud moment for everyone at Companies House."
        },
        {
            "heading": 2,
            "text": "Where we are now"
        },
        {
            "text": "Since the register was launched on 1 August 2022, we’ve been working hard on processing thousands of registrations and making improvements to the service based on user feedback and legislative changes."
        },
        {
            "text": "There are more than 28,000 entities on the register, and the information on the register has been searched more than 500,000 times. The data on the register can be accessed free of charge on the Find and update company information service, using our advanced search function. The high number of searches shows the register is meeting the policy intent of increasing transparency about who owns UK property and land."
        },
        {
            "text": "We’re now well and truly into the next phase of service development – building a digital service for the update statement, and preparing to issue financial penalties to entities that have not registered."
        },
        {
            "heading": 2,
            "text": "The update statement"
        },
        {
            "text": "All entities on the register need to file an update statement every year to confirm that the information we hold is correct and up to date. They must file an update statement even if nothing has changed."
        },
        {
            "text": "We told all overseas entities about this legal requirement in their registration confirmation email, and we’ll also be sending an email reminder to the email address we’ve got on record for each entity."
        },
        {
            "text": "It’s a criminal offence not to file the update statement, and entities may face prosecution or a financial penalty if they do not file. Overseas Entity IDs will become invalid if an entity does not file the update statement in time. They will not become valid again until they bring their record up to date and file their update statement."
        },
        {
            "text": "This means entities will not be able to buy, sell, transfer, lease or raise charges against property or land in the UK if they miss their filing deadline."
        },
        {
            "text": "The update statement is an important step in making sure the data on the register is as accurate as possible, and to make sure overseas entities continue to comply with their responsibilities."
        },
        {
            "heading": 2,
            "text": "Filing the update statement"
        },
        {
            "text": "Entities or their agents will be able to file their update statement online, unless there are any trusts involved in the overseas entity. This includes trusts that the entity has already told us about, and trusts that it needs to tell us about as part of this update statement. These entities will need to file a paper form which will be made available in the coming weeks."
        },
        {
            "text": "Entities will need to request an authentication code before they file to make sure everyone who files on behalf of the overseas entity is authorised to do so."
        },
        {
            "text": "If any information has changed since the entity registered, a UK-regulated agent must complete verification checks to confirm that the information is still accurate. If nothing has changed, no additional verification will be needed."
        },
        {
            "text": "Entities will be able to file their update statement online from the beginning of August."
        },
        {
            "text": "We’ll be publishing guidance on GOV.UK soon about filing the update statement, including how to request your authentication code."
        },
        {
            "heading": 2,
            "text": "Financial penalties"
        },
        {
            "text": "We’ll soon be issuing financial penalties to those who have not registered on the Register of Overseas Entities. We’ve published guidance on GOV.UK to explain our approach to financial penalties and other enforcement measures."
        },
        {
            "text": "Overseas entities that have not registered with Companies House already face restrictions on selling, transferring, leasing or raising charges against their property or land. Overseas entities also cannot buy any new UK property or land without an Overseas Entity ID."
        },
        {
            "text": "We're looking forward to implementing these important next steps for the Register of Overseas Entities, and we’ll publish more updates on our channels soon."
        }
    ]
}