{
    "url": "https://insidedvla.blog.gov.uk/2023/06/23/start-your-digital-career-with-dvlas-development-programmes/",
    "title": "Start your digital career with DVLA’s development programmes",
    "authors": [
        "Agnes Beviz",
        "Nathan Morris"
    ],
    "categories": [
        "Features"
    ],
    "pub_date": "2023-06-23T12:00:03+01:00",
    "content": [
        {
            "text": "At DVLA, we aim to be a Centre of Digital Excellence and the best place to start a career in digital. We have several development programmes which provide a structured path into the digital profession. If you’re looking to start or change your career, our programmes offer the latest training and professional certifications to build modern digital skills."
        },
        {
            "text": "We train and prepare individuals to become cloud engineers, business analysts, software test engineers and more. Students can develop their cloud skills in our Cloud Academy, build a high degree of in demand skills as part of the Business Analysis programme, or gain software testing skills within the Software Development Engineer in Test programme."
        },
        {
            "text": "Another example is our MSc programme, which allows students to study a master’s degree in software engineering, while gaining work experience and on-the-job mentoring. We caught up with 2 of our recent students, Agnes Beviz and Nathan Morris, to learn how the programme helped them move into a digital career."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "What attracted you to apply for the MSc Development Programme?"
        },
        {
            "text": "Agnes: I was inspired to apply for a role at DVLA after listening to the ‘How to start a career in tech’ podcast by the Government Digital Service. The chance to help provide a public facing, accessible digital service was interesting and motivating for me."
        },
        {
            "text": "As I had decided to change career, finding a course with learning and development opportunities was important to me. When I discovered the MSc programme, I found that the learning opportunities were much better than other entry level software engineering roles. I also liked the idea of starting my first software engineering role as part of a cohort, so we would be able to support each other."
        },
        {
            "text": "Nathan: I learned how to code about 6 months prior to applying for the programme. I intended on getting my skills to a level where I could apply for an entry level job. The MSc programme was a perfect fit for my career ambitions. Not only did it offer an MSc qualification, but it also provided valuable work experience."
        },
        {
            "text": "After reviewing the programme information, I realised that DVLA is a leading government agency when it comes to technological innovation with a big focus on staff training and development. This was a huge plus for me."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "What is your academic or professional background?"
        },
        {
            "text": "Agnes: I have a master’s degree in physics from the University of Manchester. After university, I started working in energy research for a small community interest company in the environmental sector. I learned to code in my spare time and completed the Manchester Codes Software Engineering FastTrack programme before joining DVLA."
        },
        {
            "text": "Nathan: I obtained a degree in accountancy and finance from Swansea University. After, I trained and qualified as a chartered certified accountant and worked in the industry for over a decade. Prior to joining DVLA, I was a finance manager but never felt fulfilled or challenged with my career choice, so I decided to change careers."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Have you always wanted to work in digital and technology?"
        },
        {
            "text": "Agnes: I’ve always had a passion for finding technical solutions to problems and have built websites for several community organisations. When I first came across programming as part of my degree, I was unsure about digital careers. However, seeing women and LGBTQIA+ people represented in digital gave me the confidence to make my career switch."
        },
        {
            "text": "I think it’s important that minority groups have a voice in technology. I push myself to speak at digital events and forums - it enables me to share my perspective and experience, while building my confidence and skills. Since starting my role at DVLA, I spoke at the Manchester Tech Festival and released a podcast episode with Queercore."
        },
        {
            "text": "Nathan: I’ve always been interested in technology. When I realised I no longer wanted to work in finance, I decided to switch to the digital and technology sector. Technology is used everywhere and I wanted to be a part of an organisation where it is at the forefront of its strategy."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "How have you found the programme so far?"
        },
        {
            "text": "Agnes: The MSc development programme has been a unique opportunity for me to learn whilst gaining practical experience in a software engineering team. I’ve found it very rewarding to apply my newfound knowledge within teams and working through the programme alongside a cohort has also added to the experience. The invaluable support we provide each other has been great and I’m looking forward to making greater contributions within my team and getting started on our thesis projects."
        },
        {
            "text": "Nathan: The programme has been an extremely enjoyable experience, and I find myself learning more and more each day. The skills and knowledge I’ve gained at university seamlessly translate into my role on the squad and have proved vital in my growth as a Software Engineer. I have now settled into my squad, and enjoy working collaboratively to complete tasks during sprints. Completing real-life tasks and learning from other members of the squad has been the most enjoyable part of the programme so far."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Learn more about our development programme"
        },
        {
            "text": "If you’d like to pursue a career in digital with us, find out more about DVLA digital professions and development programmes. We have a range of opportunities available including our Digital Academy – if this is something that interests you, read more and apply on Civil Service Jobs before 11:55pm on Monday 26 June 2023."
        },
        {
            "text": " "
        }
    ]
}