{
    "url": "https://gfie.blog.gov.uk/2025/08/05/building-bridges-between-prison-and-civil-service-employment/",
    "title": "Building Bridges Between Prison and Civil Service Employment",
    "authors": [
        "karlharvey1"
    ],
    "categories": [
        "#GFIEsuccessstory",
        "Break down barriers to opportunity",
        "Cabinet Office Life Chance pathway for People with Convictions",
        "Life Chance Recruitment"
    ],
    "pub_date": "2025-08-05T09:00:07+01:00",
    "content": [
        {
            "text": "In honour of National Opportunity Day on 7 August, we are celebrating efforts to create genuine, inclusive pathways to employment for all. Recently, we visited a prison and young offender institute to connect with women in custody and showcase the diverse career opportunities within the Civil Service, highlighting how pathways like Going Forward into Employment (GFiE) are helping to transform lives and open doors to future success."
        },
        {
            "text": "In June, we had the privilege of visiting HMP Downview, a female prison located in Sutton, London. Organised in collaboration with New Futures Network (NFN) and His Majesty's Prison and Probation Service (HMPPS), this visit brought together colleagues from various Civil Service departments, including the National Archives, Department for Transport, DVSA, Civil Service Commission, and Integrated Corporate Services (ICS), a Business Unit that supports Departments for Energy Security & Net Zero (DESNZ), Science, Innovation & Technology (DSIT), and Business and Trade (DBT)."
        },
        {
            "text": "The purpose of the visit was to demystify the criminal justice custodial environment and highlight the positive work carried out within UK prisons. Importantly, we aimed to connect with Prisoners interested in exploring future employment opportunities, specifically through our Going Forward into Employment (GFiE) ‘person with conviction’ pathway."
        },
        {
            "text": "During the visit, we engaged with women eager to learn about the Civil Service and the diverse range of roles available. Our colleagues talked about their departments and explained their roles."
        },
        {
            "heading": 3,
            "text": "Promoting Equal Opportunities and Diverse Talent"
        },
        {
            "text": "A highlight of the day was walking through the application process for Civil Service vacancies via the GFiE life chance pathway. We broke down the steps involved, ensuring participants understood how to approach their applications confidently."
        },
        {
            "text": "Positive stories from colleagues who have successfully navigated the pathway served as powerful examples. Their journeys demonstrated that a career within the Civil Service is an achievable and rewarding prospect, offering hope and inspiration.  Their stories serve as testament to the possibilities that exist for those currently in custody, reinforcing our commitment to fostering an inclusive and diverse workforce."
        },
        {
            "heading": 3,
            "text": "Lessons Learned and Next Steps"
        },
        {
            "text": "The visit included a tour of the prison, where we explored workshops providing meaningful employment and skills development for the women in custody. These workshops not only prepare individuals for life after release but also contribute to reducing reoffending, aligning with our broader social goals."
        },
        {
            "text": "This experience underscored the importance of outreach and collaboration in unlocking future talent."
        },
        {
            "heading": 3,
            "text": "Moving Forward"
        },
        {
            "text": "As we continue to develop our initiatives, we aim to strengthen our partnerships with prison establishments and support more individuals in realising their potential through GFiE employment opportunities."
        },
        {
            "text": "We extend our sincere gratitude to NFN, HMP Downview, and everyone involved for their dedication and cooperation in making this visit a meaningful step forward. "
        },
        {
            "text": "Together, we are opening doors to a future where diversity and inclusion are at the heart of the Civil Service."
        }
    ]
}