{
    "url": "https://mhclgmedia.blog.gov.uk/2025/08/05/sale-of-allotment-spaces/",
    "title": "Sale of allotment spaces",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "allotments"
    ],
    "pub_date": "2025-08-05T17:29:25+01:00",
    "content": [
        {
            "text": "Recent media reporting has criticised the government for allowing councils to sell allotment spaces. Allotments are a valuable and important community resource, and there are strict criteria in place to protect them. These rules on sales of assets have been in place since 2016 and they have not changed, and ministerial approvals were lower in 2024 than the average for previous years. For these sites to be sold, councils must get approval from the MHCLG Secretary of State and they can only be sold where this is absolutely necessary and where the legal threshold is met. Similar protections are in place for playing fields, where councils must get the Department for Education’s approval. Councils support having this flexibility, and there are strict criteria in place to protect statutory allotments – these are sites covered by the Allotment Act 1925 where local authorities can prove they were acquired to set up allotments. In one instance, an application by Elstree & Borehamwood Town Council to dispose of 54 allotment plots was to enable the construction of 186 homes – including 80 per cent affordable housing. As part of the application, an adjacent piece of land will be developed to deliver 100 allotment plots replacing those being disposed of. The National Allotment Society (NAS) has also been clear on the issue saying there has been “no change to the legal protections that apply to statutory allotments” and that “no statutory site can be sold or developed without going through a clearly defined legal process”. NAS said the eight approvals represented a slight decrease in allotment disposals in recent years, and that it had not challenged any of the applications as they had all met the legal threshold with either low take-up of plots or alternative allotment space provided elsewhere. An MHCLG spokesperson said: “Councils have been able to sell assets since 2016 and these rules have not changed. They should only do so where it is clearly necessary and offers value for money. “We know how important allotments are for communities, and that is why strict criteria is in place to protect them, as well as school playing fields.” Additional background on allotments:Year - Consents Granted2024 - 82023 - 62022 - 102021 - 62020 - 12"
        }
    ]
}