{
    "url": "https://deframedia.blog.gov.uk/2023/06/16/coverage-on-the-donation-of-flood-equipment-to-ukraine/",
    "title": "Coverage on the donation of flood equipment to Ukraine",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Flood",
        "water"
    ],
    "pub_date": "2023-06-16T13:09:05+01:00",
    "content": [
        {
            "text": "There is coverage in the Daily Express, Sky News and Reliefweb after an emergency convoy of lorries carrying flood equipment left the UK for Ukraine yesterday following the destruction of the Nova Kakhovka dam in the Kherson region last week. A broadcast feature on BBC Midlands Today showed equipment donated by the Environment Agency being prepared at a depot in Warwickshire, alongside an interview with the Environment Agency’s Director of Incident Management and Resilience Paul Clements."
        },
        {
            "text": "The donated equipment, which includes 3 high volume pumps, 6 mobile pumps and 15km of temporary barriers, will offer a significant capability to pump water out of flooded areas in Southern Ukraine, where over 42,000 civilians remain affected and an estimated 100,00 hectares of agricultural area have been submerged."
        },
        {
            "text": "Yesterday’s deployment follows the announcement on 10 June that the UK government is giving an extra £16million in humanitarian support as Ukraine deals with the aftermath of the destruction of the Nova Kakhova dam. This builds on our existing humanitarian support of £220 million which is allowing partners, such as the Ukraine Red Cross, to help evacuate civilians affected by the flooding."
        },
        {
            "text": "Environment Agency Chief Executive, John Curtin said:"
        },
        {
            "text": "Environment Secretary, Thérèse Coffey said:"
        },
        {
            "text": "Minister for Crime, Policing and Fire, Chris Philp said:"
        },
        {
            "text": "This aid package is part of the UK’s total support for Ukraine which so far totals £1.5 billion in economic and humanitarian support, which has paid for the delivery of more than 11 million medical items as well as food supplies, ambulances, and shelter kits. Additionally, we are providing military support in the form of air defence missiles and training for Ukrainian recruits and pilots."
        },
        {
            "text": " Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}