{
    "url": "https://forestrycommission.blog.gov.uk/2023/06/16/england-tree-planting-increases-for-2022-23/",
    "title": "England Tree Planting Increases for 2022/23",
    "authors": [
        "Mark Broadmeadow"
    ],
    "categories": [
        "Tree Planting",
        "Woodland creation"
    ],
    "pub_date": "2023-06-16T10:55:34+01:00",
    "content": [
        {
            "text": "On the 15 June we published the latest government tree planting statistics."
        },
        {
            "text": "Overall, tree planting rates in England have increased since last year and we continue to take action towards meeting our tree planting commitments, with 3,128 hectares reported as planted in England in 2022/23 – which is a 40 percent increase on the previous year."
        },
        {
            "text": "Working with colleagues in Defra and further afield, the Forestry Commission has been at the heart of this increase in tree planting, implementing the ambitions of the England Tree Action Plan which kickstarted tree planting across the country with a holistic approach to growing our tree cover."
        },
        {
            "text": "We know that the UK wide ambition of planting 30,000 hectares of new woodland annually from May 2024, and the statutory target of reaching 16.5% tree and woodland cover by 2050 is stretching. It is not as simple as just putting trees in the ground but ensuring that they grow to so that we have a resilient resource to help mitigate the climate and nature crisis we face.  This is achieved through making certain that woodlands are compliant with the UK Forest Standard (UKFS), thus enabling them to provide these important environmental gains and reducing the likelihood of the negative impacts pests, diseases, natural disasters and other threats can have on a habitat or area."
        },
        {
            "text": "As well as being an essential tool in climate change mitigation, trees have a large number of positive benefits such as boosting wildlife, providing shelter for livestock, preventing soil erosion, reducing flooding and improving mental health and wellbeing."
        },
        {
            "text": "Last year we faced some big challenges, very wet weather during the planting season, followed by drought through the summer, did not make it easy for tree planting and establishment. However despite these challenges, tree planting across England increased."
        },
        {
            "text": "Notable figures from today’s statistics include:"
        },
        {
            "text": "We know there is more work to do. This is why, we have a strong pipeline of planting projects supported through our Nature for Climate Fund tree programme, and we are working to increase the number of woods that are managed."
        },
        {
            "text": "As we continue on an upwards trajectory, our tree planting programme will help us reach net zero by 2050, reduce the impact of climate change and turn the tide on biodiversity decline."
        }
    ]
}