{
    "url": "https://gott.blog.gov.uk/2023/06/16/highlighting-digital-and-green-projects-in-gotts-autumn-knowledge-asset-grant-fund-round/",
    "title": "Highlighting digital and green projects in GOTT’s Autumn Knowledge Asset Grant Fund round",
    "authors": [
        "terryjones"
    ],
    "categories": [
        "Knowledge Asset Grant Fund",
        "Knowledge Assets Grant Fund"
    ],
    "pub_date": "2023-06-16T09:00:55+01:00",
    "content": [
        {
            "text": "The Government Office for Technology Transfer (GOTT) is pleased to announce that the Autumn call of the Knowledge Asset Grant Fund will prioritise projects in either of the following two themes:"
        },
        {
            "text": "1. A digital economy 2. Environment and sustainability."
        },
        {
            "text": "£5m has been committed in funding this year for these themed areas as well as other eligible projects. Specific eligibility criteria for the competition can be found in the competition guidance."
        },
        {
            "text": "The Knowledge Asset Grant Fund was established in 2021 to support the UK public sector to unlock the potential of its Knowledge Assets (KAs) to deliver value to the UK economy and society. Funding enables central government and its public sector organisations to explore the development, re-purposing, commercialisation, or expanded use of public sector Knowledge Assets. Up to £250k per project is available."
        },
        {
            "text": "Dates for your diary\nFriday 16th June: competition opens. Apply here. "
        },
        {
            "text": "5th July 1-1.50pm: GOTT will host a briefing webinar with government Chief Scientific Advisors Professor Tom Rodden from the Department for Culture, Media and Sport and Professor Paul Monks at the Department for Energy, Security and Net Zero."
        },
        {
            "text": "7th September: Competition closes."
        },
        {
            "text": "Why are we running themes for this round?"
        },
        {
            "text": "We want to encourage more applications from projects supporting the digital economy and environment and sustainability which are two of the key areas in the Science and Technology Framework."
        },
        {
            "text": "Supporting the digital economy\nThe digital economy is driving growth and security through digital technologies that boost productivity across the whole economy. There are many KAs related to data and technology held within central government departments and their arm’s length bodies which have huge potential to drive innovation across government and more widely. This may include new or improved processes through to disruptive business models which may help to develop platform technologies that can be deployed in multiple sectors from finance to manufacturing and drive the development of deep technologies of the future including AI, novel semiconductors, digital twins and quantum computing."
        },
        {
            "text": "Access to GOTT’s Knowledge Asset Grant Fund can help accelerate the adoption and use of digital technologies in the public sector so these benefits can be fully realised."
        },
        {
            "text": "For example we have supported a project from the Government Internal Audit Agency who are developing digital technologies such as their AI-powered Insights Tool to enable better use of knowledge and greater efficiency in the use of public money. We invite applications from other innovative projects ahead of the September 2023 deadline."
        },
        {
            "text": "What is in scope?"
        },
        {
            "text": "Digital technology KAs may include (but are not limited to):"
        },
        {
            "text": "Supporting green growth and sustainability"
        },
        {
            "text": "An environmentally sustainable and resilient UK will deliver on and contribute to a globally sustainable natural environment. Through the KAGF environment and sustainability theme we are seeking to support the development of Knowledge Assets that can contribute to delivering on the UK’s 2050 Net Zero goals."
        },
        {
            "text": "For example we have supported a project from the Science and Technology Facilities Council to develop green and sustainable ways to use ultraviolet light to purify water, surfaces and air of pollutants. This project not only addresses our ability to clean our environment in a sustainable way but directly feeds into goals 6, 9, 15 and 17 of the UN Sustainable Development Goals."
        },
        {
            "text": "What is in scope?"
        },
        {
            "text": "KAs associated with the management, monitoring, mitigation, alleviation, or adaption to major sustainability challenges, which might include (but is not limited to):"
        },
        {
            "text": "Get in touch\nGOTT is available to support your applications with advice from our grant fund team or our Technology Transfer Strategic Partners. We can also direct you to advice from our cross-government KA Champions network. Please drop us an email."
        }
    ]
}