{
    "url": "https://educationhub.blog.gov.uk/2023/06/16/kings-birthday-honours-list-2023-near-100-honoured-for-contributions-to-education-and-childcare/",
    "title": "King’s birthday honours list 2023: Near 100 honoured for contributions to education and childcare",
    "authors": [
        "media officer"
    ],
    "categories": [
        "Higher Education",
        "Schools"
    ],
    "pub_date": "2023-06-16T22:31:41+01:00",
    "content": [
        {
            "text": "For the King’s first Birthday Honours, we’re delighted that almost one hundred people have been recognised for their contributions to education."
        },
        {
            "text": "The list includes foster carers, campaigners, educators and fundraisers from across the country."
        },
        {
            "text": "“For the King’s first Birthday Honours, it’s truly inspiring to see almost one hundred awards given to those who are making a positive difference to the lives of families and people in education,\" said Education Secretary Gillian Keegan."
        },
        {
            "text": "“Honours include those for Junior Frood, for his work as an anti-bullying advocate and dance teacher, Asitha Panditharatna for his work helping get disadvantaged people on the path to employment with The Forward Trust, Siena Castellon, an anti-bullying campaigner and advocate for girls with autism, and David Upjohn, who has fostered children with severe disabilities for 19 years.”"
        },
        {
            "text": "Here are a few examples of some of the brilliant people who have made an outstanding contribution to education and childcare."
        },
        {
            "text": "Glenda Spencer MBE"
        },
        {
            "text": "The Chair of Governors at Trinity School in Essex, Glenda has supported the school to take it from an ‘Inadequate’ to ‘Good' Ofsted rating, including by setting up a scheme to support students at risk of permanent exclusion."
        },
        {
            "text": "After her son with special needs died, she has spent a 30-year career providing services to parents of disabled children."
        },
        {
            "text": "Junior Frood BEM"
        },
        {
            "text": "Aged just 19, Junior is an anti-bullying advocate who created the #boyscandance Point of Light award. Despite being bullied himself, Junior followed his dreams to become a dance teacher."
        },
        {
            "text": "Cheryl Bertschi BEM "
        },
        {
            "text": "A tutor at Southend Adult Community College, Cheryl has run a soup kitchen for the homeless for the past 9 years, as well as organising Christmas present donations for under-privileged children and volunteering at night to help signpost services to people suffering from addiction."
        },
        {
            "text": "Asitha Panditharatna MBE "
        },
        {
            "text": "As Executive Director of Employment Services at The Forward Trust and a trustee of several other charities, Asitha has helped the most people get access to employability and to fulfilling their potential."
        },
        {
            "text": "Jill Eton MBE "
        },
        {
            "text": "Jill is driven by desire to raise the aspirations of young people as Director of Sporting Futures Training."
        },
        {
            "text": "She has built one of the most successful School Sports Partnership in the country, developing sport, health, and wellbeing programmes. Under their leadership Sporting Futures grew from a pilot to supporting over 200 learners."
        },
        {
            "text": "Emma Cantrell MBE "
        },
        {
            "text": "As the founder of First Days Children’s Charity, Emma helps 9000 children in poverty a year by providing essential items and 1:1 coaching for families. She arranged food deliveries in lockdown and leads a community support hub."
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}