{
    "url": "https://cyberandspecialistoperationscommand.blog.gov.uk/2023/03/16/british-science-week-meet-sarah-wallace/",
    "title": "British Science Week | Meet Sarah Wallace",
    "authors": [
        "calumjenkins"
    ],
    "categories": [
        "Personnel",
        "Science",
        "Technology"
    ],
    "pub_date": "2023-03-16T08:46:59+00:00",
    "content": [
        {
            "text": "To celebrate British Science Week, we sat down with members of the UKStratCom Climate Change and Sustainability Team (CC&S) to learn a little more about their career, their motivations for working in CC&S, and the importance of understanding our connection to the environment. We also asked them for some of their top tips on how we can be more sustainable in our day-to-day lives."
        },
        {
            "text": "Meet Sarah Wallace – UKStratCom HQ Climate Change and Sustainability Assistant Head"
        },
        {
            "text": "Sarah, thank you for taking the time to speak to us and for helping celebrate British Science Week 2023. To begin with would you mind sharing some information on your background? In particular, what have you done in the past and what does your scientific background look like?"
        },
        {
            "text": "It is clear that previous experiences, in particular the time you spent in Africa, have shaped the way you view not only the environment but the natural world as a whole. What made you decide to pursue a career in CC&S?"
        },
        {
            "text": "What was it that made you want to pursue CC&S in Strategic Command? You’ve touched on the pioneers within our own HLBs – was there anything in particular that attracted you to a career in the Command?"
        },
        {
            "text": "Let’s turn our attention to the present day. Could you explain how your background and experiences influence how you approach your current work in CC&S? "
        },
        {
            "text": "The theme for British Science Week 2023 is ‘Connections.’ I think, we’re all increasingly aware of how we contribute to climate change. Can you tell us why it is so important that we understand how our actions affect the climate & environment around us?"
        },
        {
            "text": "You’ve mentioned the need to break the ‘norm’ and change our behaviours. How can we begin to be more sustainable in our day-to-day lives? Do you have any top tips you can share with us?"
        }
    ]
}