{
    "url": "https://educationhub.blog.gov.uk/2023/03/16/budget-2023-everything-you-need-to-know-about-childcare-support/",
    "title": "Budget 2023: Everything you need to know about childcare support",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Childcare",
        "early years"
    ],
    "pub_date": "2023-03-16T14:51:30+00:00",
    "content": [
        {
            "text": "Hundreds of thousands more working parents will be supported through an extension of the free childcare on offer, more than doubling the current support in place. This will help mums in particular to stay in work and keep the economy growing."
        },
        {
            "text": "We know that childcare is one of the biggest costs facing working households, which is why we want to make it cheaper and more accessible, to reduce the barriers preventing some parents from going back to work."
        },
        {
            "text": "Here we explain everything you need to know about childcare from the Spring Budget."
        },
        {
            "heading": 3,
            "text": "Who is eligible for 30 hours free childcare? "
        },
        {
            "text": "We’re extending free childcare to support more parents returning to work after their parental leave ends."
        },
        {
            "text": "Currently, parents who work more than 16 hours a week and earn less than £100,000 are entitled to 30 hours free childcare a week for children aged three to four."
        },
        {
            "text": "We’re now expanding the scheme so that working parents of all children over the age of nine months are also entitled to free 30 hours of childcare. This is a transformational change that will make a difference to families across the country."
        },
        {
            "text": "Some providers may ask for charges in addition to the free childcare. Visit childcarechoices.gov.uk for further information."
        },
        {
            "heading": 3,
            "text": "When will it start?"
        },
        {
            "text": "From April 2024, working parents of two-year-olds will be able to access 15 hours of free childcare."
        },
        {
            "text": "From September 2024, 15 hours of free childcare will be extended to all children from the age of nine months."
        },
        {
            "text": "From September 2025, working parents of children under the age of five will be entitled to 30 hours free childcare per week."
        },
        {
            "text": "This staggered approach will give childcare providers time to prepare for the changes, ensuring there are enough providers ready to meet demand."
        },
        {
            "heading": 3,
            "text": "How are you supporting nurseries, childminders and childcare providers?"
        },
        {
            "text": "We’re increasing the hourly rate paid to childcare providers by the government, to help them to deliver their existing 30 hours entitlement."
        },
        {
            "heading": 3,
            "text": "How many children can a childcare provider look after?"
        },
        {
            "text": "We are also increasing the number of children a member of staff can look after at the same time. This is known as the staff-to-child ratio. It means that from September 2023, one member of staff will be allowed to look after five children, up from four children which is the current rule. This is already the case in Scotland and follows a thorough consultation on the safety of this change."
        },
        {
            "text": "These changes to ratios are optional, giving providers more flexibility in how they run their businesses, and will also bring ratio requirements in line with those of other comparable countries."
        },
        {
            "heading": 3,
            "text": "What support is there for childcare before and after school? "
        },
        {
            "text": "Local authorities and schools will be given more funding for what’s known as “wraparound care”, so that parents of school-age children can access childcare in their local area from 8am – 6pm."
        },
        {
            "text": "This could include provision of activities that fall outside of school hours, via things like breakfast clubs and after-school clubs. We expect that by September 2026, most primary schools will be able to provide their own before and after school care."
        },
        {
            "heading": 3,
            "text": "What childcare support is available for people on Universal Credit? "
        },
        {
            "text": "Parents on Universal Credit are set to get further support too. Currently, up to 85% of childcare costs can be claimed back. However, by Summer 2023 parents will be able to access the funds upfront to make it easier for them to get a job or increase their hours. This removes any gap in funds and eases parents into the childcare costs payment cycle."
        },
        {
            "text": "The maximum amount of support will also be increased by almost 50%, to £951 for those with one child and to £1,630 for those with two."
        }
    ]
}