{
    "url": "https://apprenticeships.blog.gov.uk/2023/03/16/construction-and-the-built-environment-amelias-journey/",
    "title": "Construction and the built environment: Amelia's journey",
    "authors": [
        "Amelia Russell"
    ],
    "categories": [
        "Apprentices",
        "Construction and the Built Environment",
        "The Institute"
    ],
    "pub_date": "2023-03-16T16:46:18+00:00",
    "content": [
        {
            "text": "Hello, my name is Amelia Russell and I am a Product Manager in the Construction and Built Environment Team at the Institute for Apprenticeships and Technical Education (IfATE). My current role is to support the development of technical education products such as apprenticeships and T Levels for the construction industry. I also meet with trailblazer chairs to conduct regular interim review meetings."
        },
        {
            "heading": 2,
            "text": "Starting my career"
        },
        {
            "text": "Entering into my career coming from a care background was an incredibly challenging and rocky road. It was difficult to navigate through life and a career with no support or guidance from parents."
        },
        {
            "text": "Luckily, I was massively encouraged and supported by my foster parents, and I was able to develop more ambition and motivation from them."
        },
        {
            "text": "I left sixth form to do a nursing degree at Northampton University. As time went on, I really struggled to find my passion for it whilst working 36 unpaid hours on the hospital wards (on top of studying and attending lectures) whilst having no financial support from parents like most of my fellow students."
        },
        {
            "text": "I dropped out just over a year later. The feeling of being a disappointment was terrible. I had no money, no university degree like planned, or even some knowledge of what I was going to do next."
        },
        {
            "text": "In a moment that changed my life, I was offered a role at a local secondary school. I started to realise throughout my time there that I loved education and the opportunities it gives people. I knew quite quickly that I wanted to work in an area where I could help young people to dream and achieve big, like I wanted to do."
        },
        {
            "heading": 2,
            "text": "My apprenticeship and joining IfATE"
        },
        {
            "text": "After some time of working at a secondary school I had reached another crossroad. Where did I want to go next?"
        },
        {
            "text": "The answer to me was an apprenticeship."
        },
        {
            "text": "I knew an apprenticeship could give me experience as well as a qualification and wage. After searching for a long time, I found a level 3 business administration apprenticeship opportunity at IfATE. It was perfect. I could complete the apprenticeship and influence the world of education and help to support young people. I am proud to say I completed my apprenticeship and achieved a distinction."
        },
        {
            "text": "As part of my early career at IfATE I was privileged to manage the apprentice panel, which allowed me to become a visible ambassador for IfATE in the promotion of apprentices."
        },
        {
            "heading": 2,
            "text": "Construction and the built enviroment"
        },
        {
            "text": "Working within the construction team has been a highlight in my career and I have met a lot of inspiring and influential stakeholders. The construction industry is one of the most varied routes to work with and an industry where you appreciate all of the hard work that goes into it."
        },
        {
            "text": "Construction is a vital industry which creates and builds spaces that connects communities, provides jobs and improves society. It fills me with great pride to be able to support the development of training the future construction workforce."
        },
        {
            "text": "From being in care and feeling like a failure, to eventually finding a passion for education and a home at IfATE – it really feels like I’ve turned my life around. It’s been a rollercoaster but I’m proud of how far I’ve come and the challenges I’ve overcome."
        },
        {
            "text": "An apprenticeship has changed my life for the very best – it’s opened a huge number of doors and I’m very much looking forward to continuing this journey."
        }
    ]
}