{
    "url": "https://forestrycommission.blog.gov.uk/2023/03/16/discover-our-trees-on-farms-podcast-mini-series/",
    "title": "Discover our 'Trees on Farms' podcast mini-series",
    "authors": [
        "Jon Burgess"
    ],
    "categories": [
        "Tree Planting",
        "Woodland creation",
        "Woodland management"
    ],
    "pub_date": "2023-03-16T11:05:08+00:00",
    "content": [
        {
            "text": "As a Local Partnership Advisor and Woodland Resilience Officer, it’s my job to get out there and talk to people.  I answer questions, enthuse and motivate people to create new woodland or offer suggestions to help improve their existing woodland. I also make sure our woodlands are fit for the future, looking at things like pests and diseases, climate change, drought and advise people on how to make their woodlands more resilient and better able to cope with these threats. "
        },
        {
            "text": "Co-hosting a podcast was definitely a new approach for me! However, it was an absolute pleasure to be asked to join this podcast mini-series and have the opportunity to speak to a new audience, and try to encourage woodland creation and woodland management. "
        },
        {
            "text": "So, we teamed up with rural affairs journalist and podcaster, Ben Eagle, to produce a podcast mini-series about trees on farms. We wanted to highlight how farmers can make the most of the opportunities that are available and show the benefits that trees can provide in productive systems. Over three episodes on the Meet the Farmers podcast, Ben and I met foresters and farmers to explore those opportunities, and ask what more can be done to help farmers make the most from the trees on their land.  "
        },
        {
            "text": "We heard interesting case studies from a range of fantastic guests - all different types of land managers with different objectives and different experiences to share.  I really hope we inspired people to welcome trees on farms and see all the financial and environmental benefits they can bring.  "
        },
        {
            "text": "You can catch up on all three episodes now: "
        },
        {
            "heading": 3,
            "text": "'Making Money from Trees' "
        },
        {
            "text": "Jon and Ben are joined by Devon forester Sam Whatmore, and Jemima Letts from the Chatsworth Estate, to discuss their enterprises and highlight opportunities for making money from trees on farms. From grants to wood fuel and carbon credits to timber, the opportunities are diverse.  "
        },
        {
            "heading": 3,
            "text": "'Agroforestry and Trees in Regenerative Farming Systems' "
        },
        {
            "text": "Jon and Ben are joined by David Brass from The Lakes Free Range Egg Company in Cumbria, and Devon farmer, Andy Gray, to discuss the concept of agroforestry and how integrating trees into agricultural systems can benefit an entire farm business, as well as animal welfare and environmental resilience.  "
        },
        {
            "heading": 3,
            "text": "Woodlands and Wildlife "
        },
        {
            "text": "Jon and Ben are joined by Clive Thomas, Senior Advisor in Regenerative Forestry at the Soil Association, to discuss how to boost biodiversity on farms and in farm woodland, continuous cover forestry and how farmers can make the most of trees on their land.  "
        },
        {
            "text": "Meet the Farmers, ‘Trees on farms’ mini-series is available to download on Apple Podcasts, Spotify and most other podcast channels."
        }
    ]
}