{
    "url": "https://dragonsden.blog.gov.uk/2023/03/16/dragons-den-episode-11-series-20/",
    "title": "Dragons' Den, Episode 11 Series 20",
    "authors": [
        "Caitlyn Arthur"
    ],
    "categories": [
        "Business",
        "Patents",
        "Trade marks"
    ],
    "pub_date": "2023-03-16T21:05:07+00:00",
    "content": [
        {
            "text": "Intellectual property played a key part in the decisions made in the Den this week, with the Dragons ever keen to know more about how the entrepreneurs had protected their businesses. "
        },
        {
            "heading": 2,
            "text": "Cleaning up in the Den "
        },
        {
            "text": "First up was suction expert, Alan Gillett. Alan entered the Den with a clever invention (and DIY-ers dream) he has called the Xtra Hand. It’s a vacuum cleaner attachment that uses suction power to stick the vacuum to the wall. This helps conscientious trades people and keen but clean DIY enthusiasts catch any debris created by drilling a hole, while still having two hands free to focus on the drilling itself. Alan was hoping to secure a £40k investment from the Dragons, in return for a 10% stake in his business.   "
        },
        {
            "text": "One of the biggest hurdles faced by Alan when growing his business was that he was not able to get a patent for his invention. The Dragons were particularly interested in this fact, because not having a patent means that others could, in theory, copy Alan’s invention. "
        },
        {
            "heading": 2,
            "text": "But is it new? "
        },
        {
            "text": "When considering a patent application, patent examiners must establish whether an invention is new – so, it must not be publicly available elsewhere in the world and must be inventive. It can’t be an obvious change to something that already exists. In the Den, Alan gave a demonstration of products from competitors that work in a similar way to the Xtra Hand, which made me wonder if this could have been the issue he faced when applying for a patent. "
        },
        {
            "heading": 2,
            "text": "Doing the due diligence "
        },
        {
            "text": "If you’re the proud inventor of something you believe may be new, it’s well worth spending time on doing some research to see if your innovation is indeed unique, before applying for a patent. Before you begin an application, we recommend that you search the patent databases to see if a similar product to yours already exists. Your local patent library may be able to help you do this cost-effectively.   "
        },
        {
            "text": "Here are some handy links to help you on your way:  "
        },
        {
            "text": "Search for a patent: Search for a patent - GOV.UK (www.gov.uk) "
        },
        {
            "text": "Check the patents journal: Check the patents journal - GOV.UK (www.gov.uk) "
        },
        {
            "text": "And as for Alan? Well, I’m pleased to say that Peter Jones and Alan agreed on a 25% stake for the £40k investment in the Xtra Hand, leaving the rest of the Dragons for, dare we say, dust? "
        },
        {
            "heading": 2,
            "text": "Innovation on ice "
        },
        {
            "text": "This week’s episode saw former Olympic figure skater, Jenna McCorkell glide into the Den with her line of activewear specifically designed for professional figure skaters. She was pitching for £100k in return for a 7.5% stake in her business.  "
        },
        {
            "text": "Jenna explained how she had spotted a gap in the market after figuring that there were no clothes designed specifically for the elite performers within her sport. She demonstrated how her clothing features specialist touches perfect for pro skaters – such as leggings with a cut-resistant panel to prevent the skates from tearing the material. Chique Sport is now the largest figure skating clothing brand in the UK, she told the Dragons. "
        },
        {
            "text": "When questioned whether she had considered expanding and including other types of clothing in her range, Jenna explained that her brand was trade marked in co-existence with another casual-wear clothing brand. Her trade mark therefore prevented her from selling other clothing pieces under her brand, Chique Sport.   "
        },
        {
            "heading": 2,
            "text": "What are ‘coexistence agreements’? "
        },
        {
            "text": "Coexistence agreements are commonplace. They allow companies or individuals to co-exist and operate in a marketplace. "
        },
        {
            "text": "Read more about coexistence agreements and how they work with this handy fact sheet."
        },
        {
            "text": "Peter made the point that Chique Sport was an example of why it is important to do a clearance search for like products before applying for a trade mark. Searches can be done by trade mark attorneys who search the register for marks which are identical or similar, registered for identical or similar goods or services.  "
        },
        {
            "text": "Back in the Den, Jenna departed after the Dragons decided to put any thought of investment in Chique Sport on ice.  "
        },
        {
            "text": " "
        }
    ]
}