{
    "url": "https://naturalengland.blog.gov.uk/2023/03/16/update-on-the-hen-harrier-brood-management-trial/",
    "title": "Update on the Hen Harrier Brood Management Trial",
    "authors": [
        "John Holmes"
    ],
    "categories": [
        "Biodiversity",
        "Hen Harriers",
        "Licensing",
        "Protected sites and species",
        "Science and evidence"
    ],
    "pub_date": "2023-03-16T15:48:21+00:00",
    "content": [
        {
            "text": "By John Holmes, Strategy Director, Natural England"
        },
        {
            "text": "Natural England is involved in several initiatives under the Hen Harrier Action Plan, one of which is the brood management trial. Brood management involves taking the eggs or chicks of some Hen Harriers nesting on grouse moors into captivity, rearing them to fledging age, and releasing them back into the wild in the uplands of northern England. This reduces the density of active Hen Harrier nests on grouse moors and is thought to reduce predation pressure on red grouse during the breeding season. In theory, this should lead to changes in some of the negative perceptions and behaviours within moorland communities and reduce illegal persecution of Hen Harriers. Illegal persecution is the main threat to the recovery of this iconic and at-risk species in England, and Natural England is committed to working with partners to tackle this – see previous blogs for further details."
        },
        {
            "text": "The brood management trial was designed to test the theoretical assumptions behind the technique. The availability of brood management should change attitudes of grouse moor managers by reducing the perceived threat of nesting hen harriers to grouse shooting interests. This should result in lower levels of persecution, leading to increasing survival rates of hen harriers (measured by satellite tracking) and finally to increasing numbers of hen harrier nests. The trial aimed to measure changes in all of these things, compared to before the introduction of brood management. The trial was also intended to practically test the methods, and impact on the birds, of taking, captive-rearing and releasing hen harrier chicks, as this had not been done before in the UK."
        },
        {
            "text": "The trial is a partnership project, with activities led on the ground by the Moorland Association working with its members, and the International Centre for Birds of Prey leading the avicultural aspects. Natural England leads the monitoring and evaluation activities, and chairs the project board. The Game and Wildlife Conservation Trust and the Hawk and Owl Trust also sit on the group. All wild birds, their nests and eggs are protected by law. As such, a licence from Natural England is required in order for the trial to operate lawfully. As Natural England is involved in delivering the trial, a strict separation of roles within the organisation is maintained at all times between staff involved in the trial and staff involved in the licence application assessment process."
        },
        {
            "text": "The trial was initially envisaged as running for 5–10 years, and the first licence for brood management was issued in 2018. However, in that year there were no nests eligible for brood management, and no activity took place. By the end of 2022, while only four years of brood management activity had been carried out (in 2019, 2020, 2021 and 2022), the trial had reached the end of the initial five-year period, and the results to date were therefore reviewed by the NE Science Advisory Committee to inform a decision on the future role of brood management. The headlines from this review are given below:"
        },
        {
            "text": "Data summary and review"
        },
        {
            "text": "Numbers of hen harrier chicks brood managed during the trial:"
        },
        {
            "text": "\n*On occasion, chicks are released untagged for welfare reasons, for example if they are particularly light."
        },
        {
            "text": "One aim of the trial was to test the methods and impact of captive-rearing hen harrier chicks. This appears to have worked well, with the 35 captive-reared chicks surviving well to point of release (97%), showing good survival rates to one year and beyond (see graph below), and with five individuals going on to successfully breed and raise their own chicks in the wild."
        },
        {
            "text": "The graph below shows that 45% of the tagged and released brood managed birds (9 of 20) were still alive and being satellite tracked at one year old, representing a good survival rate for first-year hen harriers, and therefore not indicating any negative impact of captive rearing. (Note that this figure excludes the 2022 birds, since they are currently less than a year old). This survival rate is higher than for wild birds satellite tagged over the same time period (24% survival to one year old)."
        },
        {
            "text": " "
        },
        {
            "text": "First-year survival of tagged hen harriers during brood management trial"
        },
        {
            "text": " "
        },
        {
            "text": "The other aim of the trial was to test whether the availability of brood management leads to changes in attitudes and resulting positive impacts on hen harrier survival rates and numbers of nesting pairs. An interim social science study, led by NE, has provided some evidence of positive engagement with the trial and some positive signs of attitude change among participants. However, it has not been possible, to date, to test attitudes in the wider community beyond those participating in the trial."
        },
        {
            "text": "Further work to analyse survival rates of hen harriers over the period of the brood management trial is yet to be completed, but may confirm the markedly different survival rates of brood managed birds compared to wild-reared birds as shown in the graph above. This result was not predicted by the original theoretical framework, which stated that survival rates of all hen harriers should improve if brood management worked as expected. Details regarding the individual fates of all hen harriers tagged by Natural England, in the wild and under the brood management trial, can be viewed on this page."
        },
        {
            "text": "Numbers of nesting hen harriers in England have increased considerably since the start of the brood management trial, from only 12 nesting attempts in 2018, up to 49 in 2022 (see graphs below). Numbers of nesting attempts in land managed for forestry, and moorland not managed for grouse shooting, have remained roughly steady in that time, at around ten attempts per year, and the increases have mainly been seen in land managed wholly or partly for grouse shooting. While an increasing number of hen harrier nests have been recorded on estates intensively managed for driven grouse shooting, it is noted that land recorded as ‘grouse moor’ also includes less intensively managed areas, and that the effects of the availability of brood management on attitudes may be affected by the management regime in place at the site and whether driven grouse shooting is a primary objective."
        },
        {
            "text": " "
        },
        {
            "text": "Nesting attempts by habitat category:"
        },
        {
            "text": "Nesting habitat categories are assigned by Natural England field staff. ‘Other moor’ includes nature reserves and amenity moorland. ‘Water catchment / grouse moor’ refers to United Utilities water catchment land in Bowland, also managed for grouse shooting.  "
        },
        {
            "text": " "
        },
        {
            "text": "Numbers of hen harrier nesting attempts and chicks fledged:"
        },
        {
            "text": "In summary, the last five years have seen positive results including signs of changing attitudes among trial participants, apparently improved survival rates of some hen harriers (the brood managed individuals), and a clear increase in hen harrier breeding success since the start of the trial, including on land managed for grouse shooting. However, it is not yet possible to conclude how the availability of brood management may have influenced the observed increase, or to establish the effect of this availability on members of the wider grouse moor management community not directly associated with the trial."
        },
        {
            "text": "Next steps "
        },
        {
            "text": "Upon reviewing the evidence, the NE Science Advisory Committee has supported the view that an extension to the trial would be worthwhile, with the aim of investigating the mechanisms via which the availability of brood management influences the population size of hen harriers, via population modelling and wider scale social science. This has been endorsed by the Natural England board."
        },
        {
            "text": "The brood management organising group has therefore applied for a further scientific licence for brood management to cover the two years 2023 and 2024, for the purposes of continuing the trial. This licence application is currently being considered by the Natural England Wildlife Licensing Service, which will review the detailed rationale and, if a licence is issued, set conditions to ensure that any brood management activities meet their intended scientific purpose."
        },
        {
            "text": "While the licence assessment has not yet concluded, at this stage the Natural England board has agreed a series of principles to guide NE’s continued and wider work on hen harriers."
        },
        {
            "text": "These are:"
        },
        {
            "text": "Natural England remains committed to working with our partners on hen harrier recovery. We are encouraged by the possibilities demonstrated by the increase in nesting hen harrier numbers overall, including on intensively-managed grouse moors – and will continue to work to turn the tide on the illegal persecution of these at-risk birds."
        },
        {
            "text": " "
        },
        {
            "text": "Acknowledgements "
        },
        {
            "text": "The Brood Management Trial is a partnership project between the Moorland Association, the International Centre for Birds of Prey, Natural England, the Game and Wildlife Conservation Trust and the Hawk and Owl Trust."
        },
        {
            "text": "Data on nesting attempts on United Utilities land and RSPB reserves was provided by the RSPB. All other nesting attempts were monitored by NE staff in partnership with Raptor Study Groups and private estates, their staff and representatives. We are grateful for their work, and that of the many other groups and organisations working towards hen harrier recovery."
        }
    ]
}