{
    "url": "https://hmlandregistry.blog.gov.uk/2023/03/16/veyas-use-of-hm-land-registry-data-to-speed-up-property-transactions/",
    "title": "Veya’s use of HM Land Registry data to speed up property transactions",
    "authors": [
        "Jason Howarth, Founder, Veya"
    ],
    "categories": [
        "Data"
    ],
    "pub_date": "2023-03-16T10:38:29+00:00",
    "content": [
        {
            "text": "Veya was a participant in the Geovation Accelerator Programme in 2019 – a programme which provides geospatial and PropTech start-ups with grant funding and six months of intensive support, backed by HM Land Registry and Ordnance Survey."
        },
        {
            "text": "I’m Jason Howarth, founder of Veya. Veya provides an instant and comprehensive analysis of HM Land Registry title deeds – giving anyone access to a layperson understanding of property titles (the evidence of a person’s right to property). Through our system you gain insight into risks, opportunities or issues that may be present within any land/property title in England and Wales, so you can make the right decisions with confidence and clarity."
        },
        {
            "text": "Having been an estate agent, I was all too familiar with the frustration of discovering issues weeks into transactions that resulted in delays. By reading the title deeds from the outset, I could address issues early on to ensure a smoother and quicker sale. However, the legal jargon in the deeds often made it difficult to understand, and solutions or recommendations are not provided. I had to do a lot of additional research to understand the potential impact of certain title issues, and what to do next to resolve them."
        },
        {
            "text": "That’s why we developed Veya. The analysis Veya provides is invaluable to all involved in the sale of a property. Risks or issues associated with a property can be explained prior to listing, which leads to smoother and faster transactions for all."
        },
        {
            "heading": 2,
            "text": "How Veya uses data to speed up the homebuying process"
        },
        {
            "text": "With Veya, you can quickly get a comprehensive understanding of the key aspects of a property title's details in less than seven seconds. We use HM Land Registry’s Register Extract Service together with our proprietary scenario identification methods and scoring algorithm to generate the Veya Report."
        },
        {
            "text": "The report provides key information such as class of title, tenure (whether leasehold or freehold) and ownership details. Where possible, solutions to title issues are provided, and details on restrictions and charges are explained. Every report also includes our unique complexity score – a numerical ranking designed so you can quickly get an idea on where the property stands in terms of potential risks or complexities."
        },
        {
            "text": "Veya has been proven to significantly reduce transaction times by up to 25% through highlighting the key areas of focus right from the point of appraisal by the estate agent through to being able to allocate cases to the appropriate conveyancer. To date, more than 3,500 reports have been downloaded, saving those businesses a great deal of time. The return on investment is significant."
        },
        {
            "heading": 2,
            "text": "Benefits of the Geovation Accelerator Programme"
        },
        {
            "text": "Taking part in the Geovation programme was a pivotal moment for Veya. The workshops were incredibly insightful, and well positioned for startups looking to scale up."
        },
        {
            "text": "The main benefit for Veya was being able to create excellent relationships with key members of HM Land Registry. Their insight and knowledge are exemplary and if they didn’t have an answer, they always knew someone who did, quickly."
        },
        {
            "heading": 2,
            "text": "What’s next?"
        },
        {
            "text": "Up until now Veya has been focused on developing the business-to-business model for property professionals such as estate agents and conveyancers. Now, I'm thrilled to announce that we have launched our direct-to-consumer offering! This will give buyers/sellers or simply curious homeowners the ability to easily understand complex information about any property they are intrigued about."
        }
    ]
}