{
    "url": "https://prisonjobs.blog.gov.uk/2023/05/24/5-things-you-need-to-know-about-being-a-prison-officer/",
    "title": "5 things you need to know about being a prison officer",
    "authors": [
        "Ministry of Justice"
    ],
    "categories": [
        "Career progression",
        "Personal stories",
        "Prison officer",
        "Recruitment advice"
    ],
    "pub_date": "2023-05-24T14:51:48+01:00",
    "content": [
        {
            "heading": 3,
            "text": "Starting out as a prison officer 35 years ago, Dawn progressed up the ranks to governor, a role she’s held in several  prisons. She shares her thoughts and reflections on working as a prison officer, how it’s changed over the years, and 5 things worth knowing if you’re thinking of applying."
        },
        {
            "text": "I will always remember my very first day on the wings – I don’t think it’s something you forget. I was only 21 years old. After completing my 12 weeks training at HMP Wakefield, I was offered a position as a prison officer at HMP Cookham Wood women’s prison (now a Male Young Offenders Institution). At the time, only female prison officers could work in women’s prisons.   "
        },
        {
            "text": "I remember getting out of the car on my first day and standing in the staff car park. It was so loud – it was pretty frightening, but unbeknownst to me it was simply just yard time and that was the sound of 50 or so women chatting, laughing and exercising together outside.    "
        },
        {
            "text": "Moving on and moving up  "
        },
        {
            "text": "After 12 months at HMP Cookham Wood, the rules changed, and women were allowed to work in male prisons. I moved and was one of just two female officers working on the landings at the newly-opened HMP Swaleside. Thankfully there are many more female prison officers these days.   "
        },
        {
            "text": "Following that, and other stints at prisons around Kent including HMP Rochester, HMP Dover and HMP Elmley, I was promoted to governor. I transferred to HMP Standford Hill in 2017 to take up the role and was later governor at HMP Elmley and HMP Maidstone.   "
        },
        {
            "text": "Changing perceptions   "
        },
        {
            "text": "I can understand why people have so many misconceptions about what prisons are like, how they run and what kind of person it takes to be an officer. Prison officers work in a unique environment and the general public don’t often get to see behind the walls of a prison to know what it’s really like.  "
        },
        {
            "text": "Here are 5 things worth knowing if you’re considering applying to be a prison officer."
        },
        {
            "text": " "
        }
    ]
}