{
    "url": "https://ace.blog.gov.uk/2023/05/24/ace-research-network-growing-further-together/",
    "title": "ACE Research Network: Growing further together",
    "authors": [
        "Simon Carroll"
    ],
    "categories": [
        "Academia",
        "Data"
    ],
    "pub_date": "2023-05-24T13:34:48+01:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "The ACE Research Network (ARN) brings the latest academic thinking and expertise right into the heart of our commission work. As we actively grow this community, we want to make more connections and build a presence across the UK."
        },
        {
            "text": "As part of that effort, the first of a series of regional events recently took place at the Greater Manchester Digital Security Hub (DiSH). DiSH, which is operated by a consortium of Barclays Eagle Labs, ACE partner Plexal, Lancaster University and the University of Manchester, is focused on cybersecurity and offers business training and advice."
        },
        {
            "text": "The one-day event attracted more than 80 delegates, including representatives from four government departments, nine universities and more than 30 member companies – from start-ups to major multi-nationals – from both the Vivace and Plexal communities."
        },
        {
            "heading": 2,
            "text": "What people's digital footprint reveals"
        },
        {
            "text": "The event was themed around digital identity, and attendees were given an overview of the frontline impact created by ACE commissions for the NHS and the Department for Transport, with support from some of the suppliers from our Vivace community that were involved in the work."
        },
        {
            "text": "It was an opportunity for academics to showcase their latest work in this area. This included how much someone’s digital footprint, such as information shared or liked on Facebook, gives away about their identity– for example their sexual orientation or whether they use drugs – as well as what body movements and sensors can reveal about a person."
        },
        {
            "text": "The keynote speech was given by Professor Stacey Conchie of Lancaster University, who is also director of the ESRC National Centre for Research and Evidence on Security Threats (CREST) and co-lead of the EPSRC Security, Privacy, Identity and Trust in the digital economy Network Plus (SPRITE+)."
        },
        {
            "text": "Toby Jones, head of ACE, spoke about the ACE model, and explained how being part of commissions could lead to further work. This resulted in lots of valuable and practical conversations with both academics and businesses about how they could get involved."
        },
        {
            "heading": 2,
            "text": "Critical challenges facing society"
        },
        {
            "text": "Sam Brooks, who runs the ACE Research Network, said: “The academic community is absolutely vital for solving the most critical challenges facing society. By providing a rapid route to the right expertise, the ARN provides the foundation of knowledge on which impactful commissions are built."
        },
        {
            "text": "“I was thrilled to attend the recent event in Manchester, where bleeding-edge tech companies, world-class academics and HMG got a chance to form valuable connections and discuss key trends in the field of digital identity. I am already looking forward to our next event.”"
        },
        {
            "text": "ARN’s ambition is to grow to more than 500 members  and continue to attract more academics to its events around the country as well as in London."
        },
        {
            "text": "The next ARN regional event will be held at the urban sciences museum at Newcastle University in September, themed around how to harness data and innovation to help get to net zero, and another event is also being planned for the west of England."
        },
        {
            "text": "To find out more about the ARN, contact Sam Brooks on aceresearchnetwork@vivace.tech"
        }
    ]
}