{
    "url": "https://teaching.blog.gov.uk/2023/05/24/be-brave-be-you-how-i-learned-to-set-boundaries-as-a-school-leader/",
    "title": "Be brave, be you: how I learned to set boundaries as a school leader",
    "authors": [
        "Andrea William-Jones"
    ],
    "categories": [
        "Teacher mental health",
        "Teacher wellbeing",
        "Teachers' reflections"
    ],
    "pub_date": "2023-05-24T11:23:46+01:00",
    "content": [
        {
            "text": "Andrea William-Jones is an assistant headteacher at Winterbourne Academy, South Gloucestershire, part of the Olympus Trust. She tells us how coaching and setting positive boundaries for herself has improved her wellbeing."
        },
        {
            "text": "Wellbeing is about having the courage to do what works for you."
        },
        {
            "text": "As an assistant headteacher in a large secondary school, I am responsible for 960 young people along with a team of staff including support staff, 9 ECTs and a handful of trainees. As with anyone in the profession, it’s tricky to keep a good work-life balance."
        },
        {
            "text": "The pandemic brought positive advances in how we do many things in schools, a few of which are still with us - like virtual parents’ evenings and direct contact between parents and staff through email. Although these are great for building good working relationships between teachers and parents, frequently teachers receive requests outside of school hours. We encourage our staff to not access their emails outside of school hours or outside term time, but sometimes the boundaries can still be blurred. At our school, we sent a request out to parents that they only contact teachers during termtime, which has helped some members of staff manage an influx of requests."
        },
        {
            "text": "Setting your own boundaries "
        },
        {
            "text": "Education social media can be great for inspiration, you’ll no doubt recognise a feed of classroom set ups and display changes as well as some of the fantastic things colleagues get up to over the summer holidays. I love to look and add the odd like, but these days I try to spend my free time away from social media and the pressures that come with it."
        },
        {
            "text": "My summer holidays begin with summer school for our new year 7s – an opportunity for our incoming cohort to spend time getting to know each other and their new surroundings before key stage 3 learning begins in earnest come September. It’s great fun, and hugely appreciated by our learning community, but it’s a whole week of planning and delivery outside of normal school hours which is a big ask. Each year, I always feel a massive pressure to be able to switch off immediately at the end of the week. For me, being disciplined to activate the ‘out of office’ reply and give explicit directions to new parents regarding deadlines for queries has really helped.  I know that when I mix the Welsh cake dough for team breakfast on the last day that the holiday beckons!"
        },
        {
            "text": "Prioritising yourself"
        },
        {
            "text": "I focus on the wellbeing of my team but have been admittedly woeful at thinking about myself. We need boundaries. I needed boundaries – and that’s how I met Gemma Drinkall of HeadSphere, an educational wellbeing coach.  Gemma and I got talking at a WomenEd Southwest event and I was keen to know more about her work. Her approach was refreshing and the coaching impactful – there is nothing to compare with the power of having your own words reflected back at you. It really makes you think."
        },
        {
            "text": "As a working mum, I also instil in colleagues that family comes first.  My determination to have ‘the best holiday ever’ was becoming a pressure in itself, and Gemma helped me to see that. She also helped me find the courage to do what worked for me. To read if I wanted to read, to sit in the garden if I wanted to sit in the garden. To cancel plans and be selfish, if that’s what I needed at the time."
        },
        {
            "text": "So, once the summer holidays roll round, I’ll switch off emails and remove them from my phone. Boundaries have become part of my life and I am all the better for it. Never be afraid to say ‘no’ and be curious about what works for you. Be brave. Be you."
        },
        {
            "text": " "
        },
        {
            "text": "Find out more about the staff wellbeing charter"
        },
        {
            "text": "The education staff wellbeing charter is a declaration of support for, and a set of commitments, to the wellbeing and mental health of everyone working in education"
        },
        {
            "text": "Take a look at the staff wellbeing charter."
        }
    ]
}