{
    "url": "https://defradigital.blog.gov.uk/2023/05/24/building-a-better-future-for-our-teams/",
    "title": "Building a better future for our teams",
    "authors": [
        "Hermionie Blake"
    ],
    "categories": [
        "Defra digital",
        "Defra services"
    ],
    "pub_date": "2023-05-24T08:00:34+01:00",
    "content": [
        {
            "text": "For Learning at Work Week, Defra digital, data, and technology Academy Lead Hermionie Blake explains how our Skills Academy Programmes are enabling talent to shine."
        },
        {
            "text": "At Defra, we believe in investing in our people, empowering them to grow and develop within their roles, and in building a diverse and inclusive workforce. Attracting and retaining top talent can sometimes be a challenge for us, particularly in some of our ‘hard to fill’ roles."
        },
        {
            "text": "That’s why we recently partnered with Hays to create the Defra Academy programme, which is already proving to be a real success. The programme aims to attract applications from individuals who have the attitude, the aptitude for learning, and the motivation to learn the skills required to do the roles, rather than focusing on pre-existing experiences or academic qualifications."
        },
        {
            "heading": 2,
            "text": "Greeted with great enthusiasm"
        },
        {
            "text": "The response to our initial Cloud Programme, which was looking to recruit eleven people and the Security Programme (seeking five people) was overwhelming, with over 1,300 applicants in less than two weeks. The progressive recruitment process removed barriers to entry and encouraged innovation, allowing applicants to showcase their strengths in any way they wanted, whether it was through a CV, video, website, or other medium. We prioritised the level of motivation and capacity held by our applicants instead of experience and qualifications."
        },
        {
            "text": "Once the candidates, or “cadets” as we currently call them, were assessed, selected, and onboarded, they underwent rigorous training in both the hard skills required for their roles, and the soft skills needed to thrive in the workplace. Our Cloud Academy Programme went live in February, with the Security Academy following in March."
        },
        {
            "text": "The Cloud Programme covers everything from networking to cyber security, while the Security Programme includes rotations in corporate enablers, cyber security, personnel security, information security, and physical security."
        },
        {
            "heading": 2,
            "text": "Building their confidence"
        },
        {
            "text": "Midway through the training, we had a team-building event in Birmingham, with cadets from both academies, representatives from Hays, and Defra staff all on-site together. It was a fun two days, and everyone enjoyed getting to know each other better."
        },
        {
            "text": "Now, after months of hard work, the Cloud cadets have completed their ‘bootcamp’ training and have been working in their teams at Defra since the beginning of this month. It’s been exciting to see them progress and grow into their new roles."
        },
        {
            "text": "Those on the Security programme have been gaining hands-on experience from day one, with comprehensive learning blocks alongside their roles. And both of these two-year academies are supported by a comprehensive support programme that includes 1-1 support, mentoring, masterclasses, buddies, discover and learns, and wider organisational training."
        },
        {
            "text": "The impact of these programmes on the teams whom the cadets are part of has been profound. The teams appreciate the energy and enthusiasm they bring to their work and the diversity of people who are on the programme."
        },
        {
            "text": "We are committed to creating an inclusive and welcoming environment, and the Academy Programme is enabling us to take a major step forward in achieving that goal."
        },
        {
            "heading": 2,
            "text": "How YOU can get involved"
        },
        {
            "text": "We’re immensely proud of the cadets who have taken part in these programmes, and we look forward to seeing them thrive at Defra. We encourage anyone who is interested in finding out more about the Defra Academy programme to get in touch with me and I can provide more information."
        },
        {
            "text": "I also have a challenge for you, the reader. We had a competition to decide on the name for our academy candidates; unfortunately, none of the suggestions hit the mark that we wanted. We then decided on ‘cadets’ but were given feedback that this might dissuade future candidates who are more mature from applying, so we are in need of a new name! Can you help?"
        },
        {
            "text": "At Defra, we believe in investing in our people, and these programmes represent an exciting new chapter in our journey towards building a better future for our teams. We can’t wait to see what the future holds!"
        }
    ]
}