{
    "url": "https://socialcare.blog.gov.uk/2023/05/24/delegated-healthcare-activities-the-principles-of-great-care/",
    "title": "Delegated healthcare activities: the principles of great care",
    "authors": [
        "Deborah Sturdy"
    ],
    "categories": [
        "Care and support",
        "Integrated care",
        "Social care reform",
        "Workforce"
    ],
    "pub_date": "2023-05-24T14:39:51+00:00",
    "content": [
        {
            "heading": 2,
            "text": "The skills to care"
        },
        {
            "text": "What’s your definition of high quality care and support? Safe? Consistent? Person-centred? It is all these things and more. In fact, these qualities are as much a description of social care colleagues as they are the services they provide and the values they espouse."
        },
        {
            "text": "It’s why I’m so pleased to see the publication, this week, of ‘Delegated healthcare activities: guiding principles for health and social care in England’. This has been the culmination of close collaboration with our excellent colleagues at Skills for Care, whose insight, collaborative working and expertise has helped bring us to this point."
        },
        {
            "text": "For anyone not familiar with the term, in the context of care settings, delegated activities are clinical actions, often undertaken by NHS nurses, but which many social care colleagues are already very familiar with and well-practiced in delivering."
        },
        {
            "text": "These activities might include skin and wound care, insulin administration for people living with diabetes, and crisis plans for individuals struggling with their mental health."
        },
        {
            "text": "Given members of our profession have been providing comprehensive health and care support for many years, not to mention the ever closer alignment of clinical and social care services, the time feels right to share and embed this best practice across the sector."
        },
        {
            "heading": 2,
            "text": "Delegation for the nation"
        },
        {
            "text": "It’s important to emphasise, the benefits go two ways. This is not just about enhancing the skills sets of care colleagues but delivering even greater peace of mind - and choice - to care home residents and those receiving support in their own homes."
        },
        {
            "text": "I think most of us would prefer to build ongoing relationships with familiar faces taking care of our multiple care and support needs and not have to worry about delays or interruptions"
        },
        {
            "text": "It seems a no-brainer to have consistent, comprehensive care delivered by staff we know and trust – and who, more importantly, understand our circumstances and ways to make us feel most at ease. Person-centred care delivered safely, consistently and with respect."
        },
        {
            "text": "Indeed, as the foreword to the guidance attests, these principles “support safe and effective delegation with the person accessing care… at the heart of the process. The person’s choice, strengths, skills and preferences are essential to promoting health and wellbeing through person-centred care and support, with clinical oversight from a regulated healthcare professional, delivered by competent and skilled care workers.”"
        },
        {
            "text": "It’s important to stress that training and professional oversight of all and any delegated interventions will continue and be reviewed “with continuous improvements and adjustments made based on feedback, learning and emerging good practice.”"
        },
        {
            "text": "These guidelines must not and do not exist in a vacuum. As the needs of those we serve evolve, so too does our profession. As we move towards the closer integration of health and care services, the best interests of those we support will always matter most."
        }
    ]
}