{
    "url": "https://foresightprojects.blog.gov.uk/2023/05/24/demand-for-wireless-connectivity-addressing-a-complex-and-uncertain-future/",
    "title": "Demand for wireless connectivity: addressing a complex and uncertain future",
    "authors": [
        "martinglasspool",
        "jessicabode"
    ],
    "categories": [
        "Foresight projects"
    ],
    "pub_date": "2023-05-24T11:47:54+01:00",
    "content": [
        {
            "text": "“Wireless connectivity has become increasingly critical for different aspects of our lives, from keeping in touch, to getting around, to accessing a range of important services.” - Sir Patrick Vallance, former Government Chief Scientific Adviser."
        },
        {
            "text": "The Department for Science, Innovation and Technology’s (DSIT) recently published Wireless Infrastructure Strategy sets out a new and stretching ambition for the UK to have nationwide coverage of standalone 5G to all populated areas by 2030. How UK demand for this enhanced wireless connectivity might play out over the next decade, and what this might mean for public service delivery is uncertain. Therefore, while developing their Wireless Infrastructure Strategy, DSIT commissioned us here in the Government Office for Science’s (GO-Science) Foresight team to carry out a longer-term analysis, looking at how public-service demand for wireless could change in the future."
        },
        {
            "text": "Working with stakeholders from across government, industry and academia, we developed a set of high-level 2030 scenarios (Figure 1), which are described in the Wireless 2030 Foresight report. A combination of qualitative expert analysis and ‘light-touch’ quantitative modelling (in partnership with Decision Analysis Services Ltd) showed that some public-service uses of wireless connectivity do not require the upgraded network capability that standalone 5G provides. and could run on the UK’s current 4G network infrastructure. Meanwhile, other potential public-service uses, for example involving virtual reality or autonomous vehicles, could make a big contribution to demand in the future (Figure 2)."
        },
        {
            "text": "This analysis highlighted how important enhanced wireless connectivity could be for public services and helped us identify four key areas of consideration in the design of policies that develop or make use of wireless connectivity:"
        },
        {
            "text": "These findings are highlighted in the Wireless Infrastructure Strategy and reflected in DSIT’s plans to work to realise the full benefits of, and support areas across the UK to attract investment in, 5G and other advanced wireless connectivity, as outlined in chapters 5 and 6 of the strategy."
        },
        {
            "text": "Moving forward, the value of the Wireless 2030 scenarios lies in their use as a tool to aid policymakers in considering the policy implications of variation in supply and demand for wireless infrastructure in the digital age. They can be used to help policymakers develop practical, near-term steps to make the most of future wireless connectivity."
        },
        {
            "text": "We are currently using the Wireless 2030 scenarios to help other government departments test their policy and strategy development to encourage more resilient policymaking. We recently facilitated a workshop for the Environment Agency and Department for Environment, Food and Rural Affairs (Defra). This used the Wireless 2030 scenarios in combination with the recognised futures methodology of wind-tunnelling (or policy stress testing) to help explore ways of making environmental monitoring (e.g., real-time data monitoring provided by networked sensors) more resilient to future change. We are also working with colleagues from the National Infrastructure Commission as they consider the UK’s long-term strategic goals for wireless infrastructure as part of the second National Infrastructure Assessment."
        },
        {
            "text": "The future demand for telecoms is complex and uncertain; we cannot predict what demand for wireless connectivity will look like in 2030, but we can act now to create policy which will be resilient in the face of uncertainty."
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}