{
    "url": "https://environmentagency.blog.gov.uk/2023/05/24/ensuring-sustainable-decommissioning-of-nuclear-sites/",
    "title": "Ensuring sustainable decommissioning of nuclear sites",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Environment Agency",
        "Regulated industry"
    ],
    "pub_date": "2023-05-24T10:37:26+00:00",
    "content": [
        {
            "text": "James Heavingham from our Nuclear Regulation team writes about the growth in the Environment Agency’s role regulating decommissioning and clean up, as old nuclear facilities are shut down and sites cleaned up to a point where regulation is no longer required. "
        },
        {
            "text": "The Environment Agency is the independent environmental regulator for the nuclear industry in England. We make sure that nuclear companies and the sites they operate meet high standards of environmental protection throughout the stages of design, construction, operation and decommissioning."
        },
        {
            "text": "Why are nuclear sites being decommissioned?"
        },
        {
            "text": "Many of the UK’s older nuclear power and research stations are being switched off and closed. When we talk about decommissioning, we mean dismantling facilities and structures that are no longer needed. Clean-up means treating or removing contamination from leaks or spills on or around the site."
        },
        {
            "text": "The decommissioning of nuclear sites involves the management of large volumes of radioactive waste, as well as non-radioactive waste. UK government policy stated that the objective of decommissioning is to remove the hazard a facility poses in a safe and secure manner, to minimise waste generation and to provide for effective and safe management of wastes generated."
        },
        {
            "text": "In the UK, waste with higher levels of radioactivity needs to be moved into secure stores where it is kept safely under supervision until a geological disposal facility is built. Most of the anticipated waste from decommissioning and clean-up of UK nuclear sites has only relatively low levels of radioactivity. Much of this waste will be made up of materials like demolition rubble, scrap metal, building foundations, drains, pipelines and soil. All this waste needs to be managed safely and disposed of somewhere suitable."
        },
        {
            "text": "Our role"
        },
        {
            "text": "We regulate the disposal of radioactive waste from nuclear sites in England. Many nuclear sites are starting or considering plans for decommissioning, so we’ve developed new ways to regulate the changes to the industry."
        },
        {
            "text": "We have written guidance that clearly sets out the condition we expect a nuclear site to reach before it can be released from regulation. The emphasis is on waste management and determining “what’s the right thing to do with this waste?”"
        },
        {
            "text": "Our guidance was developed in parallel with plans by the government to change legislation affecting nuclear sites: the Government has “identified an opportunity to amend the regulatory framework that applies to the final stages of nuclear site decommissioning and clean-up in order to enable a more sustainable approach to waste management and land remediation.”"
        },
        {
            "text": "The operators of nuclear sites must tell us how all of the radioactive waste will be dealt with and explain why this is the best option. They must prove that for now and in future, the site will be safe for people and the environment."
        },
        {
            "text": "There are many disposal and treatment options available for radioactive waste including on-site disposal which may take the form of disposing of waste by leaving it where it is or using it to fill voids in the ground."
        },
        {
            "text": "On-site disposal could offer a more sustainable way to decommission a nuclear site but it must meet all the environmental safety criteria set out in our guidance and operators would need to prove that leaving waste on site is a better option than removing it for disposal elsewhere."
        },
        {
            "text": "Working with industry"
        },
        {
            "text": "Our nuclear, groundwater, waste and climate change specialists are providing advice to the nuclear industry. A team of specialists is in place to answer questions from industry and to support the technical knowledge and readiness of our own regulators."
        },
        {
            "text": "We engage with all operators of decommissioning nuclear sites to make sure that the impact to people and the environment is minimised and to encourage and support the development of sustainable working practices."
        },
        {
            "text": "Involving communities in our work "
        },
        {
            "text": "Operators of nuclear sites in England must have an environmental permit for radioactive substances activities. We also regulate other activities that could pollute the air, water or land, increase flood risk or adversely affect land drainage."
        },
        {
            "text": "Permit conditions are designed to make sure that the operator’s activities do not harm people or the environment."
        },
        {
            "text": "As the activities on the site change it is likely that the operator will need ask us to change the conditions and limits in the permit. When we receive the applications, we will consult with the public and carefully consider all the feedback we receive before making a decision."
        },
        {
            "text": "The operator of the site will involve local communities and other organisations in the site decommissioning choices."
        },
        {
            "text": "The local council will determine any planning applications required and the Office for Nuclear Regulation (ONR) will be consulted on all changes at site and will continue to regulate the nuclear site licence until it is surrendered."
        },
        {
            "text": "The first site in England"
        },
        {
            "text": "Winfrith in Dorset will be the first site in England to change their permit as a result of our guidance. Our nuclear specialists will also be supporting Natural Resources Wales in their assessments of proposals submitted for Trawsfynydd in Wales. The Winfrith site was built in 1957 as a research and development facility and operated until 1995. There were nine prototype nuclear reactors at Winfrith, but only two remain. Decommissioning and demolition of all the site structures is ongoing and the aim is to return the site to a mixture of heathland and natural acid wetland."
        },
        {
            "text": "Magnox will be applying to us to change their permits in 2024 for on-site disposals. They are beginning to engage with the community to gather opinions on what the restored land should look like including preferred routes for public footpaths. We’ll be attending the events so we can answer any questions about how we will be regulating the changes on site. You can also attend Magnox’s event online."
        },
        {
            "text": "We support sustainable decommissioning of nuclear sites and will scrutinise operators decommissioning plans to ensure safety for people and the environment, now and in the future."
        },
        {
            "text": "More information on this topic can be found on GOV.UK."
        },
        {
            "text": "Contact us"
        },
        {
            "text": "If you’ve got a question about our work on decommissioning email nuclear@environment-agency.gov.uk"
        }
    ]
}