{
    "url": "https://defrafarming.blog.gov.uk/2023/05/24/help-us-to-review-productivity-and-slurry-grant-items/",
    "title": "Help us to review productivity and slurry grant items ",
    "authors": [
        "Gordon Jones"
    ],
    "categories": [
        "Payments for equipment, technology and infrastructure"
    ],
    "pub_date": "2023-05-24T10:04:43+01:00",
    "content": [
        {
            "text": "In February, we invited people to apply for grants under the Productivity and Slurry theme of the Farming Equipment and Technology Fund (FETF)."
        },
        {
            "text": "The Farming Equipment and Technology Fund supports the purchase of equipment, technology, and infrastructure designed to improve agricultural, horticultural and forestry productivity in a sustainable way.   "
        },
        {
            "text": "Grants are offered towards the cost of specific items of equipment on a list. The items were compiled following a consultation with farmers, industry groups and other stakeholders between previous rounds. "
        },
        {
            "text": "We promised to review the list ahead of future rounds. We’re adopting the same collaborative approach now to update it. The next round is expected in early 2024. "
        },
        {
            "text": "To meet our aim of supporting farmers to lower costs and improve the environment, we want to make sure that the list is up to date, that we respond to feedback and include the items farmers want. "
        },
        {
            "text": "In this post, I’ll share some findings from that round and explain how you can shape the future list. "
        },
        {
            "heading": 2,
            "text": "Findings from the last round "
        },
        {
            "text": "The last round opened in February and closed in April 2023. We had a good response and will build on that for the next round. "
        },
        {
            "text": "You might remember that following the last consultation, we added 21 new items before that round opened. They included: "
        },
        {
            "text": "The full list of items can be found on GOV.UK. "
        },
        {
            "text": "Before we open the next round, we’d like you to review the list."
        },
        {
            "heading": 2,
            "text": "Share your opinion and shape future rounds "
        },
        {
            "text": "Through a survey, you can suggest productivity or slurry management equipment and tell us which specifications you’d like us to update."
        },
        {
            "text": " Specifications set out what the item must do. I’ll go into a bit more detail below. "
        },
        {
            "text": "Through the following surveys, we'd like you to tell us:  "
        },
        {
            "text": "The items you suggest must contribute to at least 1 or more of the objectives of the scheme: "
        },
        {
            "text": "In addition, for potential items to be eligible to be included they must: "
        },
        {
            "heading": 2,
            "text": "Suggest new items "
        },
        {
            "text": " When you complete the survey, linked above, you will be asked to provide:  "
        },
        {
            "text": "The deadline to complete this survey is Monday 3 July at midday. "
        },
        {
            "heading": 2,
            "text": "Review specifications "
        },
        {
            "text": "We'd also like your feedback on whether any of the items or specifications we offered are out of date because new products have entered the market.  You can do this by completing the survey linked above."
        },
        {
            "text": "We'll ask you to explain what needs to be changed and provide a revised specification, or whether it should be removed and why."
        },
        {
            "text": "Specifications ensure applicants understand what equipment is eligible for funding support. They are used to establish a standard cost for the item.  "
        },
        {
            "text": "The specification must be clear enough so that we can use it to set a standard cost for the item without favouring one manufacturer over another.  "
        },
        {
            "text": "It is important that you don’t provide too general a specification. "
        },
        {
            "text": "Doing so makes it harder for us to ensure that items we might include will be effective and high quality. It will also help us to ensure administration of the scheme is as straightforward as possible. "
        },
        {
            "heading": 2,
            "text": "Dates to note and further information "
        },
        {
            "text": "Please complete the surveys by midday on Monday 3 July."
        },
        {
            "text": "If you have any technical questions, please email the Rural Payments Agency fetfenquiries@rpa.gov.uk."
        }
    ]
}