{
    "url": "https://deframedia.blog.gov.uk/2023/05/24/nutrient-neutrality-coverage-continued/",
    "title": "Nutrient neutrality coverage continued",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Natural England"
    ],
    "pub_date": "2023-05-24T16:00:02+01:00",
    "content": [
        {
            "text": "Today there has been coverage in the Times newspaper inaccurately claiming that Natural England’s rules have prevented developers from building thousands of homes."
        },
        {
            "text": "The government has set stretching, legally binding targets to improve the environment. As nature and species face growing threats, the development of homes we need must go hand in hand with a better environment."
        },
        {
            "text": "Nutrient neutrality rules are based on environmental law and Natural England has been working in partnership with developers and planning authorities to create compensatory measures, including new wetlands, to mitigate the nutrient load of new developments and allow housebuilding to go ahead."
        },
        {
            "text": "‘Blame farmers, not builders’ for toxic river, p.20 "
        },
        {
            "text": "This article reports that nutrient neutrality rules, which outline that house builders must mitigate the impact of excess nutrients entering our waterways, have stalled the development of 120,000 homes, which includes over 4,000 homes in the Wye area."
        },
        {
            "text": "The coverage suggests that intensive practices on chicken farms, rather than builders, are to blame for pollution in the area and more should be done to address this."
        },
        {
            "text": "Pollution comes from multiple sources and Natural England is clear that all sectors need to be part of the solution to ensure we improve water quality and reduce the impact on our protected sites for nature."
        },
        {
            "text": "Mike Burke, director for sustainable development at Natural England, said:"
        },
        {
            "text": "‘New homes delayed for fear walkers will damage nature’ p.24 "
        },
        {
            "text": "This article claims that Natural England has blocked building in the Chiltern and New Forest areas because the developments could lead to increased pressures on the countryside and threaten populations of birds such as the Dartford warbler and the Nightjar."
        },
        {
            "text": "Laws to protect internationally important wildlife areas include the need to avoid damage arising from the disturbance of wildlife. This can be caused by increases in the numbers of people and their dogs visiting, because numbers of visitors can go up following new housing being built close to such places."
        },
        {
            "text": "Natural England provides advice to local planning authorities on how these impacts may be mitigated. For example, new green space can be created nearby where people live allowing greater recreation opportunities as well as reducing the pressure of additional visitors on existing green spaces."
        },
        {
            "text": "It is important to strike a careful balance between managing the New Forest for people to enjoy and protecting its natural features. An important role of the planning system is to ensure that new development does not compromise the integrity of legally designated sites."
        },
        {
            "text": "Natural England, Forestry England, and six local planning authorities commissioned research on potential impacts of new development in and in and around the New Forest on the park’s international nature conservation designations. It is Natural England’s advice that new residential development within this zone is likely to have a significant effect on the sites via recreational impacts, alone or in combination with other plans or projects, without suitable mitigation."
        },
        {
            "text": "Research has also been carried out to assess the impacts of pressure on Chilterns Beechwoods Special Area of Conservation which found that recreation is the greatest threat to this landscape so they must be managed well for people to enjoy while protecting its natural features. An important role of the planning system is to ensure that new development does not compromise the integrity of legally designated sites, which is why we continue to work closely with the council to support the production of their interim strategy."
        },
        {
            "text": "Edel McGurk, Regional Operations Director at Natural England said: "
        },
        {
            "text": " "
        }
    ]
}