{
    "url": "https://earlyyears.blog.gov.uk/2023/05/24/our-early-years-curriculum-roadshows-on-the-education-inspection-framework-eif/",
    "title": "Our early years curriculum roadshows on the education inspection framework (EIF)",
    "authors": [
        "Wendy Ratcliff HMI, Principal Officer, Early Education"
    ],
    "categories": [
        "Early years"
    ],
    "pub_date": "2023-05-24T15:00:28+01:00",
    "content": [
        {
            "text": "We’re on the final stretch of our journey around the country delivering our early years curriculum roadshows on the education inspection framework (EIF)."
        },
        {
            "text": "Now seems a good time to look at how far we’ve come and where we’re going to next."
        },
        {
            "text": "There were only 6 months of inspecting using the EIF before the pandemic. During those early months, we began a series of events for the early years sector. We sought to raise awareness of the new inspection handbook and explain how inspectors would look at the quality of education. We paused these events during the national lockdowns but, once it was possible, we refreshed and relaunched the programme. We are now focusing on the importance of communication and language. And we’re also now able to draw on the first of our early years research reports."
        },
        {
            "text": "What we talked about"
        },
        {
            "text": "In the roadshows, we have talked about:"
        },
        {
            "text": "The correlations between a child’s vocabulary size and their life chances are as firm as any correlations in educational research. The early years foundation stage (EYFS) framework states that:"
        },
        {
            "text": "Some children will understand and know more words than others simply because of the quality and quantity of the interactions they’ve had. Early years practitioners can help to improve children’s language with as many high-quality interactions as possible."
        },
        {
            "text": "That is why a deliberately thought-out curriculum for children’s communication and language development is so important. Children’s interactions form the foundations for language and cognitive development."
        },
        {
            "text": "The number and quality of the conversations they have with adults and peers throughout the day is crucial. By commenting on what children are interested in or doing, and echoing back what they say with new vocabulary added, for instance, practitioners will build children's language. Reading aloud and engaging children actively in stories, non-fiction, rhymes and poems are all important. Then providing children with extensive opportunities to use and embed new words in a range of contexts will give them the opportunity to thrive. These are just some of the messages we have shared through the roadshows."
        },
        {
            "text": "The impact we’ve had"
        },
        {
            "text": "Since we began the programme in June 2022, we have delivered more than 40 sessions. Nearly 3,000 practitioners from almost 2,000 providers have attended so far, with another 12 events planned over the summer."
        },
        {
            "text": "We recently asked attendees what they have done differently as a result of the roadshows, and what impact their actions have had. Practitioners told us that some of the things they’ve done include:"
        },
        {
            "text": "They also told us that some results of what they’ve done include:"
        },
        {
            "text": "Next steps"
        },
        {
            "text": "During the summer term, we are taking the roadshows to Newcastle, Manchester, Leeds, Blackburn, Maidstone, Bristol and Swindon."
        },
        {
            "text": "Over the summer, we will be planning our next round of roadshows. These will be based on the upcoming second part of our early years research review. We look forward to bringing a new area of learning to a roadshow near you. Look out for your invitations from your local authority."
        }
    ]
}