{
    "url": "https://mojdigital.blog.gov.uk/2023/05/24/part-iii-one-year-on-where-to-next/",
    "title": "Part III: One Year On, Where To Next?",
    "authors": [
        "Gina Gill"
    ],
    "categories": [
        "MoJ Digital Strategy 2025",
        "Our People",
        "Our services"
    ],
    "pub_date": "2023-05-24T10:55:18+01:00",
    "content": [
        {
            "text": "When we set out our digital strategy a year ago we, somewhat unusually, started from the bottom and summed up the impact of a lot of in-flight work and over 40 individual strategies. This isn’t the way that you might expect an organisation to approach strategy development, but it was right for us at the time."
        },
        {
            "text": "As you’ve hopefully seen from Part I and II, we are making good and demonstrable progress against that strategy. But.. (there’s always a but!)...2025 isn’t that far away now, advances in technology are marching on exponentially, and critically, our current strategy is missing something - a tangible articulation of our level of ambition: How do we envisage providing justice services in the future? "
        },
        {
            "text": "If we don’t understand or aren’t agreed on or can’t describe the future we’re trying to get to, it’s highly unlikely we will get there (or anywhere near). Instead, we will continue to iterate the way we do things today. This is fine where we have a good place to iterate from, but in many cases I think we need more fundamental change. So, my focus for the year ahead is to work with colleagues across the organisation to set out our future vision. It won’t be easy and it won’t be fast, but I think if we can navigate the following we will get there."
        },
        {
            "text": "Shedding constrained thinking"
        },
        {
            "text": "I have seen lots of plans and strategies since I’ve been in the civil service. And most (but not all) start from how we take what we do today and improve it. Most don’t start with what change in outcome or experience we want to deliver for the public. If we are to define an ambitious future that is where we must start (for all we do, not just public facing services)."
        },
        {
            "text": "We have seen a fundamental shift in the way that we consume many services in recent(-ish) times, from streaming TV to banking with organisations that didn’t exist until recently, to the way that we date. These shifts weren’t created by starting from a set of constraints and working within them. They were created by imagining a different outcome or experience for a user. I firmly believe that we need a real shift in the way that we deliver public services. We might not have a competitive incentive to do so, but we do have an imperative to deliver the right outcomes and experience for citizens; we do have a duty to provide value for money to the taxpayer; and we do need to be a place where people want to work. That shift can only happen if we shed the constraints we operate within and imagine a different way of doing things, starting with the perspective of the people who have to use our services."
        },
        {
            "text": "You’ve heard me say this before, but I think that will only happen if we start to develop policy options in a more collaborative, multi-disciplinary fashion."
        },
        {
            "text": "It’s not just about policy"
        },
        {
            "text": "Having spent most of my career in the private sector, I see the department that we work in as a business, and my role as a leader in running that business well. So, I expect Ministers (or the Chairman in my mind) to set direction and policy, hopefully informed by unconstrained and multi-disciplinary thinking! But I also expect operational leaders to set out a compelling vision for how we are going to operate and continually improve as a business."
        },
        {
            "text": "I think too often we can either conflate big policy decisions and running our services well or focus on one to the detriment of the other. The former usually results in huge programmes of work that are trying to deliver ministerial policy while replacing ageing technology delivering critical services, and changing our operating model and processes all at the same time (what could possibly go wrong?). The latter usually results in conversations about whether we should focus resources on making our processes or technology more efficient or effective if it’s not a Ministerial priority - I’ve yet to meet a Minister (or Chairman) that would prefer to talk about operational issues over policy/strategy issues. "
        },
        {
            "text": "Either way, we ultimately make it harder to deliver policy change quickly. I therefore think there are many parts of our future that we can and should define independently of policy direction - namely those that are about the basics of operating our core services and making them more modern, efficient, cost-effective and adaptable."
        },
        {
            "text": "We’re not special"
        },
        {
            "text": "Too often, I hear colleagues say, but we’re different because…, therefore we can’t… "
        },
        {
            "text": "I find it vexing, I think in part because it’s something I’ve heard in all the industries and places I’ve worked. The reality is when you break down most of our services, at their core they aren’t so different from those that you find in many other businesses. We have lots of apply-assess-pay services in government. At its core how different is that to what a bank does when you apply for a loan or mortgage? You might expect prisons to be different, but many of the services there from booking a visit to scheduling shifts for colleagues and prisoners are at a basic level the same as services we see outside of government.  "
        },
        {
            "text": "Therefore, I wonder how much time we spend on solving problems or at least the bits of our problems that someone else has already solved? How much time could we get back to focus on the really hard, unique or complex stuff? How much faster might we be able to deliver if we took the time to look laterally and re-use?"
        },
        {
            "text": "To sum up I guess what I’m saying is that my focus over the coming months has to be on trying to change ways of thinking, working and doing, which is obviously much easier said than done, particularly in large complex organisations with many, many years of history. And particularly in a world that continues to evolve at an ever changing pace - whether that’s technology, economics, demographics, or reaction to environmental issues. Turbulent is the word that comes to mind. Which brings to mind a quote from Peter Drucker - “The greatest danger in times of turbulence is not the turbulence - it is to act with yesterday’s logic”."
        }
    ]
}