{
    "url": "https://childrenssocialcare.blog.gov.uk/2023/05/24/providing-a-safe-nurturing-environment-through-foster-care/",
    "title": "Providing a safe, nurturing environment through foster care",
    "authors": [
        "Maria Ekeke"
    ],
    "categories": [
        "Foster care"
    ],
    "pub_date": "2023-05-24T13:41:33+01:00",
    "content": [
        {
            "text": "Maria and Robert have been foster carers since 2010 and have fostered over 50 children and young people to date. "
        },
        {
            "text": "Maria tells us about their journey and shares her advice for anyone considering becoming a foster carer."
        },
        {
            "text": "Robert and I became involved in fostering after hearing about the shortage of foster families. It saddened my heart to learn about the shortage of fostering homes for children and young people and I immediately felt we had the skills, experience, and compassion to make a positive difference for the lives of children in need."
        },
        {
            "text": "Following our application, we went through a rigorous training and approval process, and soon became approved foster carers for an independent fostering agency. In the 12 years that followed, we have looked after over 50 children, with each child being unique and special in their own way."
        },
        {
            "heading": 4,
            "text": "Providing a safe, stable and loving family environment"
        },
        {
            "text": "Our approach to fostering is centred around providing a safe and nurturing environment for the children in our care. We understand that children who have experienced trauma or abuse may have difficulty trusting adults, so we take time to build a strong relationship with each child through listening to their needs and concerns, and helping them to feel valued and accepted as part of our family."
        },
        {
            "text": "Many of the children and young people who have been placed in our care have come from difficult backgrounds and as a result have struggled with emotional, behavioural, and developmental issues. However, after spending time in our care, many of these children have shown significant progress and have become more confident, happy, and resilient."
        },
        {
            "text": "With help from the Royal Borough of Greenwich fostering department and our supervising social worker, we have continued to provide unwavering support, encouragement, guidance and nurture to our young people. This has helped many of these children and young people to overcome their difficulties and achieve their full potential, with some who have moved on to independent and semi-independent living placements to come back home to appreciate the time they spent growing up in our home."
        },
        {
            "text": "Over the years, we have made huge impact on the lives of children and young through our ability to maintain stability and consistency for the children placed in our care, ensuring that each child feels secure with a sense of belonging and sees our home as their secure base."
        },
        {
            "heading": 4,
            "text": "Collaboration and specialised training "
        },
        {
            "text": "As foster carers, we understand the importance of teamwork. We work closely with other professionals involved in the children's lives, such as teachers, social workers, and therapists, nurses and the young people’s birth families to ensure they maintain contact with their roots, where appropriate."
        },
        {
            "text": "We also regularly sought feedback from the children in our care to listen to how they felt in our care, ensuring that they feel they are being well looked after and that they feel part of the family."
        },
        {
            "text": "At the moment, we are lucky enough to be fostering for Royal Borough of Greenwich who are very proactive in providing the necessary training, support and development opportunities to enhance our skills and knowledge to carry on doing what we love. I have had the opportunity to take part in valuable training courses on attachment, trauma and child development training, strategies for de-escalating anger and aggression in children and young people to name but a few. This covers areas of my day to day work with some of the children in my care so it’s important to being able to apply theories practically."
        },
        {
            "heading": 4,
            "text": "The Mockingbird model"
        },
        {
            "text": "Robert and I are also one of the Mockingbird Hub carers in Greenwich. The Mockingbird family model has worked really well for us and the young people we look after. For example, one of the young people in our care came to us with a lot of trust issues and trauma and didn’t want to engage with any activity or anyone. However, he is now a changed person, engaging and hosting other young people in the constellation as a result of being in a hub home."
        },
        {
            "text": "The Mockingbird family model has worked very well for us and the members of our constellation because of the practical and emotional support system that is available, not only for the satellite families, but also for the hub carers and everyone within the household. As a hub carer you are never socially isolated as you have a community of other foster carers and their children around you all the time."
        },
        {
            "text": "Above everything else, seeing the gradual positive impact our daily work has on the young people in our care is the rewarding factor why we continue to do what we do. It will be good to see new people coming into fostering and retained as long-term foster carers. Although it can be daunting at first, it is very rewarding and I’d advise new and prospective foster carers to just take the leap and register. You will not regret it."
        },
        {
            "heading": 4,
            "text": "Additional information: "
        }
    ]
}