{
    "url": "https://minimumwage.blog.gov.uk/2023/05/24/the-nlw-and-protected-characteristics-living-wages-and-ethnic-pay-gaps/",
    "title": "The NLW and protected characteristics: Living wages and ethnic pay gaps",
    "authors": [
        "josephwilkinson"
    ],
    "categories": [
        "Research"
    ],
    "pub_date": "2023-05-24T09:07:27+01:00",
    "content": [
        {
            "text": "We have long been concerned with understanding the minimum wage’s impact on different groups of workers. Since 2021, the Government has formally specified this requirement in our remit, asking us \"to gather particular evidence on groups of low paid workers with protected characteristics.\" We have recently published two research projects commissioned for our 2021 report. This blog discusses one of those projects, by Nikhil Datta and Stephen Machin, which uses an innovative approach to show how the minimum wage affects pay gaps between different ethnic groups. A second blog on the other project, by Abigail McKnight, will be published shortly."
        },
        {
            "text": "Since 2016 the National Living Wage (NLW) has increased the wage floor further and faster than in preceding periods. The evidence suggests this hasn’t cost jobs overall, but the risks are not evenly distributed. We know that certain groups of workers are more likely to work in low-paid jobs and to be paid less than their counterparts. This is the case for women, for some ethnic minorities and for disabled workers. We track employment rates for these groups, but there is room for more sophisticated approaches to assess whether the minimum wage actively reduces inequality between groups."
        },
        {
            "heading": 2,
            "text": "Using data from one company"
        },
        {
            "text": "We commissioned researchers at the London School of Economics to develop one such approach. They used data from a single (anonymous) employer to examine what happened when the firm varied its rates of pay in different parts of the UK. The employer delivers services for local authorities, some of whom require their contractors to pay the Living Wage Foundation’s rates, while others do not."
        },
        {
            "text": "The researchers had access to the company’s complete HR records. This rich dataset enabled the researchers to study exposure to an effective minimum wage set at a level considerably higher than the NLW. This provides clues as to how firms may react to a higher minimum wage. About one in five of the company’s workers were classified as Black, Asian and Minority Ethnic (BAME), meaning there was room to examine in detail how different wage levels affected their treatment."
        },
        {
            "heading": 2,
            "text": "What the study found"
        },
        {
            "text": "The study found that in the areas where the Living Wage Foundation’s rates were used, entry-level workers earned about 7 per cent more than those in establishments not subject to the higher rates. The introduction of the Living Wage increased average wage bills by 1.5 per cent but reduced the BAME wage gap within the organisation by around half, from 7 per cent to 3.5 per cent."
        },
        {
            "text": "Despite the increase in the wage bill, the research found no evidence of negative employment effects, whether measured by the number of positions, headcount employment, hours and the BAME employment gap. Instead, the evidence suggested some positive effects in terms of number of positions and headcount employment. The researchers suggested this was consistent with monopsony, which is where employers have more wage-setting power than they would in a competitive labour market. That conclusion was further strengthened by establishments In a more competitive environment, the opposite would be expected - an increase in the relative wages of entry-level workers would be expected to lead to a reduction in their relative employment."
        },
        {
            "text": "The introduction of the Living Wage also led to a reduction in the number of points on the pay scale, compressing the pay distribution. There was also evidence of spillover effects on to non-minimum wage jobs. However, there was no evidence of differences in the likelihood of promotion between the Living Wage establishments and others."
        },
        {
            "heading": 2,
            "text": "Conclusions"
        },
        {
            "text": "Overall, the results from this study are encouraging. They suggest that a higher minimum wage has aggregate benefits for BAME workers with minimal employment losses. However, it should also be noted that these results are estimated from data for a single firm and so may not be generally applicable."
        },
        {
            "text": "For more findings, including how the firm responded in other ways, including progression, pay structures, skill composition and how these varied by ethnicity, see the full report (Datta and Machin) here."
        }
    ]
}