{
    "url": "https://traderemedies.blog.gov.uk/2023/05/24/trade-economics-at-the-tra-a-quick-tour-behind-the-scenes/",
    "title": "Trade economics at the TRA – a quick tour behind the scenes",
    "authors": [
        "Daniel Robertson, Economist"
    ],
    "categories": [
        "Analysis",
        "hybrid working",
        "People"
    ],
    "pub_date": "2023-05-24T12:49:02+01:00",
    "content": [
        {
            "text": "You may be wondering what an Economist does when it comes to trade remedies and whether this role is for you. Here’s an insight into what it is like working as an Economist at the TRA."
        },
        {
            "heading": 2,
            "text": "Economic analysis and trade remedies"
        },
        {
            "text": "As an Economist, my main responsibility is conducting the Economic Interest Test (EIT) on our anti-dumping, anti-subsidy, and safeguard investigations. This is to test whether a proposed measure (i.e. a tariff on an imported good) is in the wider economic interest of the UK. My other responsibilities include ensuring effective use of data across the organisation, assisting with the procurement of new data sources and engaging with stakeholders."
        },
        {
            "text": "I work on a wide range of analysis. Currently I am working on an economic model to estimate cost increases for a downstream industry as part of one of our anti-dumping investigations. This will help me determine whether the measure we’re looking at is in the wider economic interest of the UK."
        },
        {
            "text": "One of my favourite aspects of my role is that it’s very collaborative. I work across teams here at the TRA and even with international counterparts. I am currently working with investigator colleagues to ensure good use of data in our investigations. We are looking at finding data from sources that we’re currently not using to support our conclusions, and making more effective use of data visualisations to communicate trends and patterns."
        },
        {
            "text": "Recently, I had the opportunity to meet with representatives of a foreign government as part of one of our transition reviews. I feel very fortunate to be able to interact with people from around the world as part of my role, and to build the international profile of the TRA."
        },
        {
            "heading": 2,
            "text": "Organisational and personal development"
        },
        {
            "text": "I’m also a TRA Learning Champion. Part of my role is to help train new starters on subsidies. It is a great way of meeting people from different teams and the training sessions usually include a mixture of analysts, investigators, and policy advisors. The training covers both the theory and the calculations, with some group exercises included to make it interactive."
        },
        {
            "text": "I enjoy delivering training because I get to interact with new joiners, as well as develop my own skills (such as presenting and tailoring my communication to the needs of the audience). It also gives me an area of organisation-wide knowledge to be responsible for, so I need to stay up-to-date with real world developments in this area."
        },
        {
            "text": "I’m a big advocate of hybrid working – it’s been of huge benefit to my productivity, my wellbeing and my carbon footprint. To keep in touch with the team we have a weekly Analyst Huddle, where the whole team comes together and we update each other on our main 2-3 responsibilities for the week. I also have regular catch-ups with my line manager and this is good for staying in touch on things like learning and development, objectives, upcoming workstreams, and wellbeing."
        },
        {
            "text": "It is nice to come together with colleagues in the office for in-person team meetings once a week. Thursdays tend to be the day where we all come together as a team in the office. The agenda for our team meetings is always varied. It can cover anything from monthly reviews of ongoing workstreams, where we discuss any project updates and emerging risks. We also make sure to grab lunch or coffee and catch-up on things happening in the world of trade and economics when we are all in the office."
        },
        {
            "text": "The TRA is very supportive of the continuous learning and development of everyone in our organisation. I’m currently doing an MSc Economics Apprenticeship that requires committing 20% of my weekly working hours and my managers have enabled me to pursue this development opportunity. My apprenticeship consists of a mixture of recorded lectures and live seminar classes where we discuss economic theories and solve problem sets."
        },
        {
            "text": "This is an example of what it is like behind the scenes as a TRA Economist, but in truth there are no two weeks or even two days that are the same. This is one of the things that I love most about my job – it’s dynamic, varied and challenging."
        },
        {
            "text": "Find out more about working for the Trade Remedies Authority."
        },
        {
            "text": "Find out more about what an apprenticeship at the TRA looks like."
        }
    ]
}