{
    "url": "https://deframedia.blog.gov.uk/2022/04/11/countryfile-showcases-natural-englands-seagrass-restoration-project/",
    "title": "Countryfile showcases Natural England’s seagrass restoration project",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Weekly stories"
    ],
    "pub_date": "2022-04-11T12:11:02+01:00",
    "content": [
        {
            "text": "Last night’s episode (Sunday 10th April) of BBC Countryfile was a ‘Plant Britain by the Sea’ special and featured Natural England’s work to restore seagrass."
        },
        {
            "text": "Fiona Crouch, from Natural England, explained to presenter, Ellie Harrison, why seagrass is so incredible."
        },
        {
            "text": "People often do not think of our seas when we talk about nature recovery because much of it is hidden but seagrass has massive potential. Healthy, undisturbed seagrass meadows can be as effective at absorbing and storing carbon as our woodlands."
        },
        {
            "text": "Disease, pollution, and physical disturbance, such as anchoring, mooring and launching of recreational boats, as well as trampling from walkers and bait collectors, have all contributed to the loss of seagrass."
        },
        {
            "text": "The programme also showed the teams of volunteers packing the seed bags and then them being deployed out in the Solent."
        },
        {
            "text": "The work featured is part of LIFE Recreation ReMEDIES which is a £2.5million project and involves a four-year partnership (to October 2023) to protect and restore sensitive seabed habitats. Natural England leads the partnership – which brings together a number of local and national organisations who have an interest in conservation. It is part of England’s largest seagrass planting effort which will see a total of 8 hectares of seagrass meadows planted."
        },
        {
            "text": "You can watch the programme again on BBC iPlayer here: BBC iPlayer - Countryfile - Plant Britain by the Sea"
        }
    ]
}