{
    "url": "https://deframedia.blog.gov.uk/2022/04/11/coverage-of-new-government-crackdown-on-fly-tipping/",
    "title": "Coverage of new Government crackdown on fly-tipping",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Weekly stories"
    ],
    "pub_date": "2022-04-11T13:36:20+01:00",
    "content": [
        {
            "text": "There has been widespread coverage today in BBC Online, the Daily Express, the Guardian, The Independent, the Daily Mirror, the Times, the Daily Mail, ITV Online and Sky News Online of our announcement that the UK Government is launching a series of measures in a bid to crack down on waste crime."
        },
        {
            "text": "There was further coverage across regional media, including the Yorkshire Post, Isle of Wight Country Press,  Nottinghamshire Post, Eastern Daily Press, and Lincolnshire Live, as well as in trade titles including Circular and Let’s Recycle."
        },
        {
            "text": "Environment Secretary George Eustice was interviewed about the plans by BBC Breakfast, LBC, Talk Radio and the Today Programme, where he highlighted how the new measures will tackle waste crime and cut down on fly-tipping, which has risen during the pandemic."
        },
        {
            "text": "The Express also carried a comment piece from Minister Churchill which outlined that our plans will make sure disposing of waste properly is as accessible as possible."
        },
        {
            "text": "The Government’s plans, revealed in a new consultation, set out to change the rules so that households no longer pay to get rid of DIY waste. Around a third of Local Authorities currently charge households for the disposal of certain types of DIY waste, using rules designed for construction waste."
        },
        {
            "text": "A call for evidence on the use of booking systems at recycling centres has also been launched. Some booking systems were brought in when restrictions were imposed during the pandemic. There are concerns these systems could be making it harder for people to dispose of their waste and increasing the risk of fly-tipping."
        },
        {
            "text": "A number of councils in England will also be awarded grants to tackle fly-tipping through trial projects, including CCTV to target hotspots."
        },
        {
            "text": "Environment Minister Jo Churchill said:"
        },
        {
            "text": "The action comes after plans to reform the waste industry were launched in January. Digital waste tracking will mean those handling waste will record information from the point waste is produced to the stage it is disposed of, recycled or reused, making it easier for regulators to detect illegal activity and tackle fly-tipping and other waste crime."
        },
        {
            "text": "Our reform of the licensing system for waste carriers, brokers and dealers will increase the competence and background checks needed to operate as a waste carrier, broker or dealer, and make it easier for regulators to enforce against non-compliant operators whilst making it harder for un-registered operators to find work in the sector."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}