{
    "url": "https://dfedigital.blog.gov.uk/2022/04/11/design-culture/",
    "title": "Show the design culture",
    "authors": [
        "Jaskiran Kang, Head of Design"
    ],
    "categories": [
        "Careers",
        "community of practice",
        "culture",
        "design"
    ],
    "pub_date": "2022-04-11T12:12:31+01:00",
    "content": [
        {
            "text": "Our service and interaction design community is almost 1 year old. We’ve grown a lot in a year but we are still a comparatively small group within a big complex organisation with lots of teams and leaders."
        },
        {
            "text": "Showing and talking about our culture, motivations and values is important especially if we want to attract great people to join our community."
        },
        {
            "text": "We’ve already blogged about the open design sessions we ran to explain how the application process differs in the Civil Service to other sectors."
        },
        {
            "text": "In this post we share more about our community of practice and what it means to us."
        },
        {
            "heading": 2,
            "text": "Bringing designers together as a community of practice"
        },
        {
            "text": "Each designer works in a service team and on a day-to-day basis does work specific to a particular service. Our services are varied, serving users in range of sectors from further education to social care."
        },
        {
            "text": "If we didn't have a community, we would risk our brilliant designers working in silos in their service teams, not linking up with other design colleagues."
        },
        {
            "text": "Our community brings all the service and interaction designers together, laterally across the department. Being a member gives us valuable time to look sideways, join up, have shared tasks, and grow together as professionals."
        },
        {
            "heading": 2,
            "text": "We focus on 3 things known as our 'imperatives'"
        },
        {
            "text": "Within our community we’ve decided on 3 strands of important work. We call these our imperatives. These are separate to the design work we do in our service teams. Imperatives help us strengthen and grow our community and its capability."
        },
        {
            "text": "The community made posters for the design imperatives which create the conditions for designers to experiment and develop."
        },
        {
            "text": "By doing this work we strengthen the bonds between our designers within the community. We enjoy working laterally across the DfE as well as within each of our service teams. This sets us up to solve the right problems and to build good services that work for people. Here are our imperatives."
        },
        {
            "heading": 3,
            "text": "Grow design capability"
        },
        {
            "text": "We attract, find and keep talented people from diverse backgrounds."
        },
        {
            "text": "We grow our knowledge and expertise."
        },
        {
            "text": "As a group, we support our skilled professionals to develop and grow."
        },
        {
            "heading": 3,
            "text": "Make design standards visible"
        },
        {
            "text": "We follow the design principles and adhere to good practice."
        },
        {
            "text": "We make sure handovers and inductions are done in a consistent way."
        },
        {
            "text": "We are led by insight and research, which we keep centrally so everyone can find it easily."
        },
        {
            "heading": 3,
            "text": "Talking in the open about our work"
        },
        {
            "text": "We share learnings and experiences with each other."
        },
        {
            "text": "We communicate and explain the problem space using evidence."
        },
        {
            "text": "We run training."
        },
        {
            "heading": 2,
            "text": "Next steps"
        },
        {
            "text": "In our next post we'll talk about the direct link between imperatives and what our design community does. And we'll share how this work had benefitted users, line managers and the wider DfE."
        },
        {
            "heading": 2,
            "text": "Get in touch"
        },
        {
            "text": "If you’d like to know more about our culture, our imperatives, how we work, or if you have any questions, please get in touch. You can follow Jas on Twitter."
        }
    ]
}