{
    "url": "https://civilservice.blog.gov.uk/2022/04/11/icymi-round-up-of-blogs-from-week-of-winners/",
    "title": "ICYMI: Round up of blogs from Week of Winners",
    "authors": [
        "Civil Service Blog Team"
    ],
    "categories": [
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Ambitious Civil Service"
    ],
    "pub_date": "2022-04-11T10:47:36+00:00",
    "content": [
        {
            "heading": 3,
            "text": "In December, the Civil Service handed out its very own Oscars equivalent - the Civil Service Awards. Below are our most-read blogs from our Week of Winners campaign, celebrating (and virtually high-fiving) the winners and the amazing stories behind them. "
        },
        {
            "text": "Winds of change"
        },
        {
            "text": "Imagine the Civil Service 30 years ago. Back then, you often joined straight from school and got paid in cash with a weekly brown pay-packet. Junior grades had their own office and there wasn't a computer in sight, just a clunky fax machine. Since then, civil servants across the country have broken barriers and blazed new paths to climb the career ladder. Our six extraordinary Lifetime Achievement Award winners reveal some of the biggest changes they have seen in the workplace."
        },
        {
            "text": "‘No secret sauce to leadership’"
        },
        {
            "text": "Steve Glass topped the Cabinet Secretary’s Outstanding Leader category for leading his team to rise to the challenge of COVID-19. Steve won for his ‘incredible leadership’ as Programme Director within the Vaccine Taskforce, and there’s no doubt the supply of vaccines to enable the mammoth jab rollout has been a steamrolling triumph."
        },
        {
            "text": "Keeping up with the Jones "
        },
        {
            "text": "The Rising Star category is typically associated with youth, making it inspiring and refreshing that the award was snapped up by Andrew Jones, at the relatively mature age of 45. “It’s amazing to get such recognition after only 16 months in the job,” says a rightly chuffed Andrew. “It’s obvious age isn’t an issue in the Civil Service, which is heartening. It shows you’re never too late to change career and make a success.”"
        },
        {
            "text": "DWP's evolution of inclusion"
        },
        {
            "text": "‘Diversity’ and ‘inclusion’ may look to some like a dance group or corporate buzzwords - but what does it mean in reality, and how is it done well? Wonder no more. DWP’s Diversity and Inclusion team paves the way for civil servants in the North East to achieve successful careers, and scooped the Diversity and Inclusion Award for recognising the tangible outcomes that an effective D&I strategy can have."
        },
        {
            "text": "Is AI helping you go on holiday?"
        },
        {
            "text": "From augmented reality to NFTs and the impending arrival of the Metaverse, we’d be forgiven for getting bamboozled in this digital age. But for the Digital Application Processing Project team in HM Passport Office, winners of the Best Use of Data and Technology Award, the power of tech is being harnessed to help fly you to sunnier climes!"
        },
        {
            "text": "PM's Award for Exceptional Public Service"
        },
        {
            "text": "Rizwan Ahmad paved the way to help more than 5,500 young East Londoners join the Kickstart scheme. Rizwan was “proud, privileged and humbled” to scoop the inaugural Prime Minister's Award for Exceptional Public Service, having seen off stiff competition in his hard-fought category."
        },
        {
            "text": "All aboard the data train"
        },
        {
            "text": "The Analyst and Data teams from the Department for Transport are fiendishly clever number crunchers responsible for helping us navigate our journey through the unpredictable behaviours of coronavirus, winning the Evaluation and Analysis Award in the process."
        },
        {
            "text": "Why victory is ‘over the rainbow’"
        },
        {
            "text": "The Civil Service LGBT+ Network, led by John Peart, triumphed in the Developing and Supporting People category for its groundbreaking LGBT+ mentoring scheme, one of the largest of its kind across the Civil Service. What makes it even more remarkable is that John set the programme up in his spare time, working from his living room over evenings and weekends."
        },
        {
            "text": "Vaccines victorious"
        },
        {
            "text": "The AstraZeneca and Pfizer Project Team forms part of the Vaccine Taskforce in the Department for Business, Energy and Industrial Strategy. The team was crowned worthy winner in the Excellence in Delivery category."
        },
        {
            "text": "Data modelling isn't a crystal ball"
        },
        {
            "text": "The government has often talked about “following the science” - but how? Well, one way is by utilising the Scientific Pandemic Influenza group on Modelling (SPI-M), all made possible by a small team of brilliant civil servants which won the Science and Innovation Award. The SPI-M Secretariat bridges the crucial link between world-class mathematical epidemiologists and government."
        },
        {
            "text": "Vaccines rollout, call to arms"
        },
        {
            "text": "The primary call to action for the last two years has been to roll up your sleeves and get jabbed, but how much do you know about the team behind the needles? Time to find out more about Programme of the Year Award winners: the Vaccines Programme."
        },
        {
            "text": "Big win for the caring collaborators"
        },
        {
            "text": "The Department of Health and Social Care’s ventilator team received the One Civil Service Award for best Civil Service-wide collaboration - despite remarkably, never even meeting each other. "
        },
        {
            "text": "The team responsible for the COVID-19 Oxygen, Ventilation, Medical Devices and Clinical Consumables Programme has worked tirelessly over the last two years pulling all aspects of the Civil Service together to provide life-saving equipment to patients across the country."
        },
        {
            "text": "Helping Welsh businesses survive the pandemic"
        },
        {
            "text": "During the pandemic, the Economic Resilience Fund in the Welsh Government freed up more than £2 billion which, in many cases, gave a vital lifeline to help support businesses, communities and families. Here's how they did it - and won the Project Delivery Award.\n"
        }
    ]
}