{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2022/04/11/opss-analytical-laboratory-technician-seo/",
    "title": "OPSS: Analytical Laboratory Technician- SEO",
    "authors": [
        "Jamal Arabi"
    ],
    "categories": [
        "GSE Opportunities"
    ],
    "pub_date": "2022-04-11T13:19:13+01:00",
    "content": [
        {
            "text": "About the Team"
        },
        {
            "text": "We are a multidisciplinary team of scientists and engineers delivering testing capability across the whole portfolio of OPSS regulatory requirements. The team works across our new laboratories at the Centre of Product Testing and Research which include metrology, mechanical, electrical, chemical and flammability facilities. We seek to implement fit for purpose practices and procedures to deliver robust, scientific outputs. In collaboration with other internal evidence teams including those in science, engineering, research and analysis, our outputs inform the development of policy, and the delivery and enforcement of product regulations across the OPSS remit."
        },
        {
            "text": " "
        },
        {
            "text": "About the Role"
        },
        {
            "text": "We require an Analytical Laboratory Technician to manage the day-to-day operation and maintenance of specialist equipment, which predominately sits within our chemical and flammability laboratories. You will have a strong focus on providing hands on technical support for analytical instrumentation, implementing routine checks, procedures and training to ensure laboratories run efficiently and are maintained to a suitable standard. This is a key post at our newly refurbished Teddington site, working closely with our lab-based teams and reporting directly to the Laboratory Manager."
        },
        {
            "text": "Further information can be found on our Careers website https://opss-careers.co.uk/ or by contacting the HR & People Team at opss.recruitment@beis.gov.uk."
        },
        {
            "text": " "
        },
        {
            "text": "Vacancy reference: 200563, Teddington; closing date:  11:55 pm on Sunday 1st May 2022."
        },
        {
            "text": " "
        }
    ]
}