{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2022/04/11/opss-senior-chemical-risk-assessor-seo/",
    "title": "OPSS: Senior Chemical Risk Assessor- SEO",
    "authors": [
        "Jamal Arabi"
    ],
    "categories": [
        "GSE Opportunities"
    ],
    "pub_date": "2022-04-11T13:17:23+01:00",
    "content": [
        {
            "text": "About the Team"
        },
        {
            "text": "As part of our OPSS Science Team, you would be involved in providing access to robust and relevant scientific advice and novel research for the development of policy, and the delivery and enforcement of product safety regulations across the OPSS remit, including toys, cosmetics and new responsibilities in construction products. We work closely with other evidence teams including those in engineering, research, analysis and testing. We are a multidisciplinary team including scientists covering specialisms including analytical chemistry, materials science and toxicology. The team is also responsible for chemical risk assessment advice and leads the Office’s access to independent scientific experts in the space of chemicals and materials."
        },
        {
            "text": "About the Role"
        },
        {
            "text": "We are looking for an experienced toxicologist to join our Chemical Risk Assessment Team! You will be working as part of the secretariat for our Scientific Advisory Group, researching and preparing papers relating to the risks of chemicals in consumer products. Prior experience within a scientific secretariat would be valuable, however, training can be provided on this aspect. The post holder will work flexibly on other activities across the Science Team including on projects in OPPS’ strategic research programme. You will be an excellent communicator with a good record of building and maintaining strong working relationships as you will be working closely with others across OPSS, other government departments and external experts and contractors."
        },
        {
            "text": "Further information can be found on our Careers website https://opss-careers.co.uk/ or by contacting the HR & People Team at opss.recruitment@beis.gov.uk."
        },
        {
            "text": " "
        },
        {
            "text": "Vacancy reference: 197125, London or Teddington; closing date:  11:55 pm on Sunday 8th May 2022."
        }
    ]
}