{
    "url": "https://cspl.blog.gov.uk/2022/04/11/standards-bodies-whos-who-3/",
    "title": "Standards Bodies: Who's who? (3)",
    "authors": [
        "Professor Gillian Peele"
    ],
    "categories": [
        "Business Appointments",
        "Lobbying",
        "Transparency"
    ],
    "pub_date": "2022-04-11T10:36:42+01:00",
    "content": [
        {
            "text": "In the third blog of our ‘Who’s Who?’ series, looking at role and remits of the various standards regulators, Committee independent member Professor Gillian Peele examines the Advisory Committee on Business Appointments and the Register of Consultant Lobbyists."
        },
        {
            "text": "Advisory Committee on Business Appointments (ACOBA)"
        },
        {
            "text": "The independent Advisory Committee on Business Appointments (ACOBA) considers applications for advice on post-government employment for former Ministers, Senior Civil Servants and other Crown servants at the most senior levels under the Business Appointments Rules.  The Rules themselves are set by the government. Applications from those leaving government service at lower levels are considered by their employing Department."
        },
        {
            "text": "The Business Appointment Rules are owned by the Cabinet Office, which has overall responsibility for propriety and ethics in government."
        },
        {
            "text": "The Ministerial Code prohibits former Ministers from lobbying government for up to two years after leaving office, and specifies that they must also seek and abide by any advice from ACOBA about any appointments or employment they wish to take up within this time frame.  Similarly, the Rules apply to Crown servants by virtue of the relevant codes of conduct."
        },
        {
            "text": "ACOBA is a non-statutory advisory body. The Committee Chair is subject to a pre-appointment hearing with the Public Administration and Constitutional Affairs Select Committee. ACOBA is currently comprised of three members nominated by three political parties, one of whom is currently the Chair after being appointed through a fair and open competition, and six independent members, who are appointed for five years."
        },
        {
            "text": "The Committee and the Government’s Rules aim to ensure that former Ministers and officials are not influenced while in office by the prospect of future appointments, and cannot improperly profit from their knowledge, and contacts of influence gained in office; nor provide improper advantages to subsequent employers."
        },
        {
            "text": "The CSPL’s first report—the Nolan Report—recommended that Ministers and Special Advisers should be subject to similar rules to those already applied to Senior Civil Servants on seeking employment on resigning from public office."
        },
        {
            "text": "Since 1995, Ministers (but not Special Advisers, until 2010) had to seek the advice of the Committee when taking up roles within two years of leaving office. This was strengthened in 2007, with the inclusion in the Ministerial Code of an expectation that Ministers were to abide by the advice and strengthened again in the 2018 Ministerial Code to clarify that, “Former Ministers must ensure that no new appointments are announced, or taken up, before the Committee has been able to provide its advice”"
        },
        {
            "text": "Any former Ministers intending to take up an appointment or employment within two years of leaving office must submit an application to ACOBA, and the Committee then considers the appropriate advice to give in each case. There have been no cases in recent years where restrictions or conditions have not been imposed and these include either a delay in taking up the appointment or that on taking up the appointment the former Minister should not be involved in certain activities for a specified time. The Committee may also advise that the proposed appointment or activity is unsuitable. For Cabinet Ministers, Permanent Secretaries and their equivalents leaving office, there is also a minimum waiting period of three months before taking up employment. ACOBA can reduce the general rule that there is a two-year lobbying ban in some circumstances, or recommend that it need not prevent communication with government on matters that are “an integral part of the normal course of business for the organisation concerned”."
        },
        {
            "text": "All communication is confidential until the appointment is taken up or announced, at which point the Committee publishes its advice letter to the applicant."
        },
        {
            "text": "The Rules and the work of the Committee have been the subject of a number of previous PACAC Select Committee reports. The current and previous Chair have increased transparency of the Committee’s work, including publicly writing to government if they are made aware that a breach of the Rules has occurred. The current Chair gave evidence to our recent review ‘Upholding Standards’ and called for there to be sanctions where the Rules are not followed."
        },
        {
            "text": "Government has committed to reviewing the Business Appointments Rules and is expected to respond to the CSPL report and the Boardman report shortly, which both made recommendations for reform."
        },
        {
            "text": "Office of the Registrar of Consultant Lobbyists"
        },
        {
            "text": "The Transparency of Lobbying, Non-Party Campaigning and Trade Union Administration Act 2014, provided statutory regulation of parts of the lobbying industry for the first time in the UK with the establishment of the Register of Consultant Lobbyists.  The Government’s intention behind the introduction of the Register was to increase transparency of those seeking to lobby Ministers and Permanent Secretaries on behalf of a third party."
        },
        {
            "text": "The Office of the Registrar is an independent statutory body, sponsored by the Cabinet Office, but accountable to Parliament."
        },
        {
            "text": "Under the Act, the Registrar:"
        },
        {
            "text": "Only certain communications are subject to registration; these include direct communications with a UK government Minister or Permanent Secretary (or equivalent) that relate to government business. They do not include communications with a government department or Special Adviser."
        },
        {
            "text": "The Register is published online and includes both the current year and previous years. The main obligations of those engaged in consultant lobbying activity are to (1) register as a consultant lobbyist before conducting any consultant lobbying; and (2) to provide quarterly updates of the lobbyists’ clients."
        },
        {
            "text": "When joining the Register, basic information about the lobbyist or organisation must be declared, including whether they are signed up to a relevant Code of Conduct and where that Code can be found. There is no specific Code to which they have to abide."
        },
        {
            "text": "The name of the client on whose behalf the lobbying has taken place needs to be recorded in the quarterly information return, although the individual communications made on behalf of the client do not need to be listed."
        },
        {
            "text": "When investigating whether a person or organisation should be on the Register, the Registrar may issue a statutory Information Notice, requiring the provision of relevant information. The Registrar can issue a civil penalty notice where a person or organisation has not complied with the requirements of the Act."
        },
        {
            "text": " "
        },
        {
            "text": "Read our Standards Mapping Research"
        },
        {
            "text": "Follow us on Twitter"
        },
        {
            "text": "Watch a short film about the work of the Committee"
        }
    ]
}