{
    "url": "https://food.blog.gov.uk/2022/04/11/what-the-new-fsa-strategy-means-for-fsa-science/",
    "title": "What the new FSA Strategy means for FSA Science",
    "authors": [
        "Michelle Patel, Deputy Director, Analysis and Insight",
        "Rick Mumford, Deputy Director, Science Evidence and Research, Deputy CSA"
    ],
    "categories": [
        "Science"
    ],
    "pub_date": "2022-04-11T10:00:03+01:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "Michelle Patel and Rick Mumford reflect on how the new FSA strategy builds on the organisation's commitment to science and what the strategy means for FSA science going forward."
        },
        {
            "text": " "
        },
        {
            "text": "The new FSA Strategy sets the direction and ambition for the FSA over the next five years - what as an organisation we'll do and why."
        },
        {
            "text": "It's our mission to ensure that food is safe, and what it says it is. The strategy introduces a new focus for the FSA for food to be healthier and more sustainable. It's sometimes not easy to see how high-level strategies connect to day-to-day work, but in this case I think it absolutely is."
        },
        {
            "heading": 2,
            "text": "Science supporting regulation and policy-making"
        },
        {
            "text": "Science is front and centre of all that the FSA does. First and foremost, we are a regulator and a policymaker. It's important to remember that food being safe and what it says it is, is at the core of what the FSA is here for."
        },
        {
            "text": "We're already well down the road on food safety and authenticity; building our risk assessment teams up to meet the huge ask since Brexit, getting really good at horizon scanning, surveillance and sampling, and providing evidence on consumer and business behaviour to support FSA’s regulatory work."
        },
        {
            "text": "The changes for us in the Science team will be about being more influential, building out our evidence base to include the other important things when it comes to food – like health and sustainability, and working more with others to make the most of it."
        },
        {
            "heading": 2,
            "text": "Collaboration across our scientific work"
        },
        {
            "text": "The new strategy talks about the various roles that the FSA can play. The first on the list is all about being an evidence provider. That connects directly into the work that our science teams do to make sure that the decisions we take are based in science and evidence. By providing evidence and working closely with others, we can support better decisions elsewhere too."
        },
        {
            "text": "It also frames us in the role of convenor, bringing like minds together to solve complex problems. For example, the PATH-SAFE (Pathogen Surveillance in Agriculture, Food and the Environment) project brings together the FSA, Food Standards Scotland, Defra, Department of Health and Social Care, the Health Security Agency and the Environment Agency to test the application of genomic technologies in the surveillance of foodborne pathogens and antimicrobial resistant microbes. This involves working across all four nations of the UK."
        },
        {
            "text": "Through this collaboration we’ll develop a pilot national surveillance network, using the latest DNA-sequencing technology and environmental sampling to improve the detection and tracking of foodborne and antimicrobial-resistant pathogens through the whole agri-food system from farm to fork. This is a really good illustration of the power of FSA science as a convenor, co-ordinating relevant bodies and expertise to bring about real innovation and change in the food system."
        },
        {
            "heading": 2,
            "text": "Using research to protect the consumer interest"
        },
        {
            "text": "Another of the roles set out in the new strategy is watchdog – this means that the Board considers that it’s our job to speak out publicly about areas of consumer interest when we have evidence or expertise that could make a difference."
        },
        {
            "text": "This doesn’t mean simply calling out risks in food (but we will, of, course, always do that). It means telling the truth about food more generally in the consumer interest. The past few years have been hard for people. We publish a unique dataset on household food insecurity. We have done this, regularly, since 2016, updating our statistics monthly through the pandemic to understand people’s lived experiences, synthesising the evidence we and others have. We will continue to set out the impacts of the rising cost of living on people's health and lives when it comes to food. There are also many others working in this space; working with others we can have a greater impact with our data than we can alone."
        },
        {
            "heading": 2,
            "text": "Food that’s healthy and more sustainable"
        },
        {
            "text": "We have always had a research interest in healthy diet because of our responsibilities in Northern Ireland, but we are planning to publish a new Area of Research Interest around climate change. Some new work has already started. Both our Science Council and the Advisory Committee for Social Science have work packages looking at the potential food risks from changes to food because of climate change; however, last week we published a package of work looking at what influences consumer behaviours around high fat and high sugar diets, and around consumption of meat, dairy and alternatives (that last one is particularly fascinating!)."
        },
        {
            "text": "We've commissioned a new evidence review to find out what consumers themselves mean when they think about sustainable food, which should be reporting soon. In the meantime, we are running two behavioural trials testing interventions around sustainable choices, supporting the recently announced Schools Food Standards pilot with expert analysis, while bringing together a network of industry, Non-Governmental Organisations, and partners across Government in the four nations to talk about where we can go next, together, to tackle this huge challenge through the application of behavioural science."
        },
        {
            "heading": 2,
            "text": "Next steps for FSA Science"
        },
        {
            "text": "The new FSA Strategy will cascade down into everything we do over the next 5 years. We’ll be reviewing our Science Strategic Plan and publishing revised Areas of Research Interest, which align with the direction of travel. In doing so, we will make sure we have access to the right science capabilities and research to underpin the FSA’s strategic needs."
        },
        {
            "text": "Across all our scientific disciplines, whether we’re working with others to build the impact of our work, building innovation, taking a wider view of how we think about risks (including thinking more consistently about risks to the environment or to social equity), or thinking about how our knowledge of consumers and behaviour can contribute to the huge challenges around a healthy sustainable diet, our science teams stand ready to make a significant contribution to all the roles that the FSA can play."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "heading": 1,
            "text": "Beth mae Strategaeth newydd yr Asiantaeth Safonau Bwyd (ASB) yn ei olygu i Wyddoniaeth yn yr ASB"
        },
        {
            "text": "Mae Strategaeth newydd yr Asiantaeth Safonau Bwyd (ASB) yn gosod cyfeiriad ac uchelgais yr ASB ar gyfer y pum mlynedd nesaf – yr hyn y byddwn yn ei wneud fel sefydliad a pham."
        },
        {
            "text": "Ein cenhadaeth yw sicrhau bod bwyd yn ddiogel, a’i fod yn cyd-fynd â'r hyn sydd ar y label. Mae'r strategaeth yn cyflwyno ffocws newydd i'r ASB, sef sicrhau bod bwyd yn iachach ac yn fwy cynaliadwy. Nid yw bob amser yn hawdd gweld sut mae strategaethau lefel uchel yn cysylltu â gwaith o ddydd i ddydd, ond yn yr achos hwn rwy'n meddwl ei bod yn gwbl glir."
        },
        {
            "heading": 2,
            "text": "Gwyddoniaeth yn cefnogi gwaith rheoleiddio a llunio polisi"
        },
        {
            "text": "Mae gwyddoniaeth yn ganolog i bopeth y mae'r ASB yn ei wneud. Yn gyntaf oll, rydym yn rheoleiddiwr ac yn wneuthurwr polisi. Mae'n bwysig cofio mai sicrhau bod bwyd yn ddiogel ac yn cyd-fynd â'r hyn sydd ar y label yw diben greiddiol yr ASB."
        },
        {
            "text": "Rydym ni eisoes wedi gwneud cynnydd mawr o ran diogelwch a dilysrwydd bwyd; gan adeiladu ein timau asesu risg i ateb y galw enfawr sydd arnom ers Brexit, mireinio ein sgiliau sganio’r gorwel, gwyliadwriaeth a samplu, a darparu tystiolaeth ar ymddygiad defnyddwyr a busnesau i gefnogi gwaith rheoleiddio’r ASB."
        },
        {
            "text": "Bydd y newidiadau i ni yn y tîm Gwyddoniaeth yn ymwneud â dod yn fwy dylanwadol, adeiladu ein sylfaen dystiolaeth i gynnwys y pethau pwysig eraill o ran bwyd – fel iechyd a chynaliadwyedd, a gweithio mwy gydag eraill i fanteisio i’r eithaf arni."
        },
        {
            "heading": 2,
            "text": "Cydweithio ar draws ein gwaith gwyddonol"
        },
        {
            "text": "Mae'r strategaeth newydd yn sôn am y rolau amrywiol y gall yr ASB eu chwarae. Y cyntaf ar y rhestr yw bod yn ddarparwr tystiolaeth. Mae hynny’n cysylltu’n uniongyrchol â’r gwaith y mae ein timau gwyddoniaeth yn ei wneud i sicrhau bod y penderfyniadau a wnawn yn seiliedig ar wyddoniaeth a thystiolaeth. Drwy ddarparu tystiolaeth a chydweithio’n agos ag eraill, gallwn gefnogi penderfyniadau gwell mewn mannau eraill hefyd."
        },
        {
            "text": "Mae hefyd yn ein galluogi i fod yn gynullydd, gan ddod â phartneriaid â meddylfryd tebyg at ei gilydd i ddatrys problemau cymhleth. Er enghraifft, mae’r prosiect PATH-SAFE (Gwyliadwriaeth Pathogenau mewn Amaethyddiaeth, Bwyd a’r Amgylchedd) yn dod â’r ASB, Safonau Bwyd yr Alban, Defra, yr Adran Iechyd a Gofal Cymdeithasol, yr Asiantaeth Diogelwch Iechyd ac Asiantaeth yr Amgylchedd ynghyd i brofi’r defnydd o dechnolegau genomig wrth oruchwylio pathogenau a gludir gan fwyd a microbau ymwrthedd gwrthficrobaidd. Mae hyn yn golygu gweithio ar draws pedair gwlad y DU."
        },
        {
            "text": "Drwy gydweithio ar y prosiect hwn, byddwn yn datblygu rhwydwaith gwyliadwriaeth cenedlaethol peilot, gan ddefnyddio’r dechnoleg ddiweddaraf ym maes dilyniannu DNA a samplu amgylcheddol i wella’r broses o ganfod ac olrhain pathogenau a gludir gan fwyd a phathogenau ymwrthedd gwrthficrobaidd trwy’r system fwyd-amaeth gyfan, o’r fferm i’r fforc. Mae hwn yn enghraifft dda iawn o bŵer gwyddoniaeth yr ASB fel cynullydd, gan gydgysylltu arbenigedd a chyrff perthnasol i sicrhau arloesedd a newid gwirioneddol yn y system fwyd."
        },
        {
            "heading": 2,
            "text": "Defnyddio ymchwil i ddiogelu buddiannau defnyddwyr"
        },
        {
            "text": "Un arall o'r rolau a nodir yn y strategaeth newydd yw rôl y corff gwarchod – mae hyn yn golygu bod y Bwrdd yn ystyried bod cyfrifoldeb arnom i siarad yn gyhoeddus am feysydd o ddiddordeb i ddefnyddwyr pan fo gennym dystiolaeth neu arbenigedd a allai wneud gwahaniaeth."
        },
        {
            "text": "Mae a wnelo hyn â mwy na dim ond tynnu sylw at risgiau mewn bwyd (ond, wrth gwrs, byddwn bob amser yn gwneud hynny.) Mae'n golygu dweud y gwir am fwyd yn fwy cyffredinol er budd y defnyddiwr. Mae'r blynyddoedd diwethaf wedi bod yn anodd. Rydym ni’n cyhoeddi set ddata unigryw ar ddiffyg diogeledd bwyd mewn cartrefi. Rydym wedi gwneud hyn, yn rheolaidd, ers 2016, gan ddiweddaru ein hystadegau bob mis drwy gydol y pandemig er mwyn deall profiadau bywyd pobl, gan gyfuno’r dystiolaeth sydd gennym ni ac eraill. Byddwn yn parhau i nodi effaith costau byw cynyddol ar iechyd a bywydau pobl o safbwynt bwyd. Mae llawer o gyrff eraill hefyd yn gweithio yn y maes hwn; drwy weithio gydag eraill yn hytrach nag ar ein pen ein hunain, gall ein data gael mwy o effaith."
        },
        {
            "heading": 2,
            "text": "Bwyd sy'n iach ac yn fwy cynaliadwy"
        },
        {
            "text": "Rydym ni bob amser wedi bod â diddordeb ymchwil mewn deiet iach oherwydd ein cyfrifoldebau yng Ngogledd Iwerddon, ond rydym yn bwriadu cyhoeddi Maes o Ddiddordeb Ymchwil newydd, yn ymwneud â newid hinsawdd. Rydym ni eisoes wedi dechrau ar rywfaint o waith newydd. Mae gan ein Cyngor Gwyddoniaeth a'r Pwyllgor Cynghori ar Wyddor Gymdeithasol becynnau gwaith sy'n ystyried y risgiau bwyd posib sy’n deillio o newidiadau i fwyd oherwydd newid hinsawdd. Fodd bynnag, yr wythnos diwethaf, cyhoeddwyd pecyn o waith gennym yn edrych ar yr hyn sy'n dylanwadu ar ymddygiadau defnyddwyr ynghylch deiet sy’n cynnwys lefelau uchel o fraster a siwgr, ac ynghylch bwyta cig, cynnyrch llaeth a chynnyrch amgen (mae'r un olaf yn arbennig o ddiddorol!)."
        },
        {
            "text": "Rydym ni wedi comisiynu adolygiad tystiolaeth newydd i ddarganfod beth mae defnyddwyr eu hunain yn ei feddwl wrth sôn am fwyd cynaliadwy, a dylai’r adroddiad fod ar gael yn fuan. Yn y cyfamser, rydym yn cynnal dau dreial ymddygiad sy’n profi ymyriadau ynghylch dewisiadau cynaliadwy, gan gefnogi’r peilot Safonau Bwyd Ysgolion a gyhoeddwyd yn ddiweddar, gyda dadansoddiad arbenigol, gan ddod â rhwydwaith o bartneriaid diwydiant, Sefydliadau Anllywodraethol, a phartneriaid ar draws y Llywodraeth yn y pedair gwlad at ei gilydd i drafod y ffordd ymlaen, i fynd i’r afael â’r her enfawr hon drwy gymhwyso gwyddor ymddygiadol."
        },
        {
            "heading": 2,
            "text": "Y camau nesaf ar gyfer Gwyddoniaeth yn yr ASB"
        },
        {
            "text": "Bydd Strategaeth newydd yr ASB yn llywio popeth a wnawn dros y 5 mlynedd nesaf. Byddwn yn adolygu ein Cynllun Strategol Gwyddoniaeth ac yn cyhoeddi Meysydd o Ddiddordeb Ymchwil diwygiedig, a fydd yn cyd-fynd â'r cyfeiriad y byddwn yn mynd iddo. Wrth wneud hynny, byddwn yn sicrhau bod gennym fynediad at y galluoedd gwyddoniaeth ac ymchwil cywir i ategu anghenion strategol yr ASB."
        },
        {
            "text": "Ar draws ein holl ddisgyblaethau gwyddonol, p’un a ydym yn gweithio gydag eraill i wella effaith ein gwaith, adeiladu arloesedd, cymryd golwg ehangach ar y ffordd rydym yn meddwl am risgiau (gan gynnwys meddwl yn fwy cyson am risgiau i’r amgylchedd neu i degwch cymdeithasol), neu'n meddwl sut y gall ein gwybodaeth am ddefnyddwyr ac ymddygiad gyfrannu at yr heriau enfawr sy'n ymwneud â deiet cynaliadwy iach, mae ein timau gwyddoniaeth yn barod i wneud cyfraniad sylweddol i'r holl rolau y gall yr ASB eu chwarae."
        }
    ]
}