{
    "url": "https://socialcare.blog.gov.uk/2017/06/19/the-social-care-debate-its-not-just-about-the-money/",
    "title": "The social care debate: it’s not just about the money",
    "authors": [
        "Alex Fox"
    ],
    "categories": [
        "Care and support",
        "Communities",
        "Guest author"
    ],
    "pub_date": "2017-06-19T10:15:30+00:00",
    "content": [
        {
            "text": "‘Social care was, for perhaps the first time, a defining issue in a general election,’ reflects Alex Fox Chief Executive of Shared Lives Plus and Chair of the Joint voluntary, community and social enterprise (VCSE) Review. The debates about social care and the NHS were frequently focused on the issue of money. ‘But,’ says Alex, ’how much money is spent by whom, is only one of the questions facing all of us who work in health and care.’"
        },
        {
            "text": "Alex Fox: '[We need to] to offer people who need long term support a new deal, which is honest not just about what people are charged for formal care, but also the responsibilities individuals and relatives take on themselves.'The money is vital, but at the heart of the challenges we face is a question about the kind of relationship we want between people and services."
        },
        {
            "text": "Public services were born in an age of deference: we took what was offered by experts and were grateful. More recently, we have expected choice."
        },
        {
            "text": "The language of ‘customer service’ has taken hold. Some have taken charge of their support entirely through personal budgets or personal health budgets."
        },
        {
            "text": "Greater choice and control are themes running through these changes and the merits of both are much debated."
        },
        {
            "text": "But with greater choice and control comes a shift in responsibilities, which is talked about much less frequently."
        },
        {
            "text": "The existing responsibility to pay for social care came as a surprise to many voters, but as well over six million unpaid family carers know, there have always been many more responsibilities hidden within our public service system."
        },
        {
            "text": "These responsibilities will always feel challenging, but they are not necessarily a sign of service failure. Few of us would want to live in a world where we were under no obligation to care for our loved ones."
        },
        {
            "text": "These responsibilities become unmanageable, however, when they are invisible and unsupported. Too many families are told there are no resources available for them, until the pressure of managing a long term condition without information, back up and breaks, leads to catastrophe or a medical need, at which point services costing thousands a week can swing into action."
        },
        {
            "text": "We can leave struggling families to find this out the hard way. Or we can make this the time to offer people who need long term support a new deal, which is honest not just about what people are charged for formal care, but also about the responsibilities individuals and their relatives take on themselves."
        },
        {
            "text": "This informal care cannot all be paid for or replaced with services, and that would not be many families’ first choice in any case. But it can be met with an offer of information, training, emergency back up and breaks to make it safe and sustainable, alongside maintaining part time employment wherever possible."
        },
        {
            "text": "This new relationship between people and long term support services would need a final element: to bring the ‘social’ back into social care, and to introduce it into medical services for the first time. Where we need support for an extended period, we do not want it from a succession of strangers."
        },
        {
            "text": "Nor do people want to be isolated and lonely at any point in their lives. In later life, that isolation can be a killer. The solution to these social challenges lies within our communities, and it is time that the role of community groups, along with community-rooted charities and social enterprises, was properly resourced."
        },
        {
            "text": "Many are currently small scale, but social models of support like Shared Lives, Homeshare and Local Area Coordination challenge the traditional professional/client transaction, which is well-suited to brief, technical interventions, but which can undermine our skills, wellbeing and citizenship if applied to long term support relationships."
        },
        {
            "text": "For most of us, happiness is not achieved through choice, quality or professionalism, but through our relationships. 14,000 people now receive personal care as part of a Shared Lives household they have chosen and in which they feel like a person, not a customer. That’s not an expensive add-on, it’s an integral part of achieving wellbeing within a model that costs on average £26,000 per person less than care homes and other regulated care models."
        },
        {
            "text": "Long term support which feels like it shares responsibility fairly, and which is as social as it is caring might also feel like a public service system we’d all be willing to pay – and vote – for."
        },
        {
            "text": "Alex Fox OBE is the Chief Executive of Shared Lives Plus and Chair of the Joint VCSE Review."
        }
    ]
}