{
    "url": "https://queensawards.blog.gov.uk/2022/12/22/expand-your-global-reach-with-a-queens-awards-for-enterprise/",
    "title": "Expand your global reach with a Queen’s Awards for Enterprise",
    "authors": [
        "The Queen's Awards for Enterprise"
    ],
    "categories": [
        "International trade",
        "Queen's Award",
        "Uncategorized",
        "Winners"
    ],
    "pub_date": "2022-12-22T14:29:36+00:00",
    "content": [
        {
            "text": "Being awarded with The Queen’s Award for Enterprise for International Trade in both 2019 and 2022 has helped Coltraco Ultrasonics expand their global reach.  "
        },
        {
            "text": "Coltraco Ultrasonics achieved their second Queen’s Award for Enterprise for International Trade in 2022 as a demonstration of outstanding success and resilience during the unprecedented times of COVID-19. The company exports over 89% of its output to 120 countries and Coltraco has delivered their three years of increased international trade by opening new sectors in markets where they already have a presence. "
        },
        {
            "text": "Coltraco Ultrasonics’ global network of 150 distributors has recently expanded in the USA as a result of achieving The Queen’s Award. Their Award success has also attracted new clients; in October 2022, they signed an agreement with Saelig Co. Inc to become a new exclusive distributor in the USA for Fluids Handling and Defence. Saelig approached Coltraco Ultrasonics after seeing that they had won their award, in the 2022 listings. "
        },
        {
            "text": "Founded by a British engineer, Saelig Co. Inc. (Fairport, NY) has been promoting UK products in USA for more than 35 years.  "
        },
        {
            "text": "Alan Lowne (Saelig CEO) stated: “One of our prominent suppliers of test equipment (Pico Technology) won a second Queen’s Award in 2022, and we know that this prestigious recognition represents an accolade denoting a worthy and stable enterprise. We are always looking to expand our novel offerings to introduce to American engineers, especially from British firms since I myself am a Brit. We looked at the new Queen's Award 2022 list to discover any businesses that would both match our customer base for test equipment but also fit in with our corporate business philosophy. We found a great match in Coltraco and will be commencing our work in creating new markets for them in North America immediately.” "
        },
        {
            "text": "Carl Stephen Patrick Hunter OBE (Coltraco Chairman) said, “The prominence and influence of The Queen’s Award for Enterprise for International Trade is an international one. I am delighted to see The Queen’s Award playing its part in the United Kingdom’s Global Force for Good objectives.” "
        },
        {
            "text": "For more information, visit https://www.gov.uk/queens-awards-for-enterprise"
        },
        {
            "text": "Contact our helpline if you have any questions: queensawards@beis.gov.uk or 020 7215 6880 "
        }
    ]
}