{
    "url": "https://dfedigital.blog.gov.uk/2022/12/22/senior-civil-servant-recruitment/",
    "title": "Podcast – Think digital, act human: some insight for people applying to be a senior civil servant",
    "authors": [
        "Adaobi Ifeachor, Product Manager"
    ],
    "categories": [
        "Careers",
        "culture",
        "recruitment"
    ],
    "pub_date": "2022-12-22T12:57:06+00:00",
    "content": [
        {
            "text": "Here’s our 4th episode of the second series of our ‘Think digital, act human’ podcast."
        },
        {
            "text": "This episode is all about recruitment into the senior Civil Service (SCS). (For useful context here are the Civil Service grade structures (look at the far left column of this table.)"
        },
        {
            "text": "We hear from former colleagues Emma Stace, Chief digital and technology officer until January 2022, and Jack Collier, Head of digital for schools services until September 2022.  "
        },
        {
            "text": "This is an honest and personal look at Emma and Jack's experiences and what they’ve learnt along the way. Not everyone is comfortable with networking and here they talk about alternative ways to getting yourself known, headhunting, other people's expectations, and leadership more broadly."
        },
        {
            "text": "They share top tips for those starting in a SCS role. So if you’re considering applying, this is a great episode for you. "
        },
        {
            "text": "Let us know what you think."
        },
        {
            "text": "If you’re short on time, fast forward to:"
        },
        {
            "text": "You can read a transcript and subscribe to future DfE Digital, Data and Technology podcasts on Podbean."
        },
        {
            "text": "Follow DfE Digital, Data and Technology, Adaobi Ifeachor, Jack Collier and Emma Stace on Twitter."
        }
    ]
}