{
    "url": "https://civilservice.blog.gov.uk/2022/12/22/top-of-the-blogs-2022/",
    "title": "Top of the Blogs - 2022",
    "authors": [
        "Lorraine McBride"
    ],
    "categories": [
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Innovative Civil Service",
        "Uncategorized"
    ],
    "pub_date": "2022-12-22T11:40:34+00:00",
    "content": [
        {
            "heading": 3,
            "text": "It’s that time of year again when we can finally unveil the Civil Service’s most popular blog posts of 2022. Time to reveal all!"
        },
        {
            "text": "As we prepare to clear our inbox and set that out-of-office message before the Christmas break, we want to take this opportunity to look back and celebrate our top 5 most best-read blogs of the last 12 months. Here they are."
        },
        {
            "heading": 3,
            "text": "Simple Guide on Words to Avoid in Government "
        },
        {
            "text": "Taking the coveted top spot was Sam Gregory’s Simple Guide on Words to Avoid in Government which was a huge hit with down to earth tips. "
        },
        {
            "text": "Sam’s on a mission to root out jargon and cliches in government, exploring the worst offenders and offering the best alternatives. Sam encourages civil servants to ‘keep it simple’ and has a hit-list of words and phrases to avoid. "
        },
        {
            "text": "“We never 'land' anything, unless it's an aircraft,” said Sam who works on the Intranet Team at Department for Education. “‘Dialogue' is a needlessly fancy way of saying 'spoke to', and both 'collaborate' and 'liaise' really mean 'work with.”"
        },
        {
            "text": "When we broke the good news that Sam had written the Civil Service’s most popular blog he said: “I’m thrilled that my blog was so popular, but I’m not surprised: our daily lives are now inundated with technical jargon, corporate gibberish and bad writing, and people have had enough! "
        },
        {
            "text": "“In government we can lead the way in communicating plainly and clearly, which helps everyone understand what we do and how they can access our services.” You can read Sam’s blog here."
        },
        {
            "heading": 3,
            "text": "We’re levelling up careers in the Civil Service"
        },
        {
            "text": "Taking third spot in our most-read blogs was one written by Cabinet Office Permanent Secretary Alex Chisholm. He explored how moving thousands of Civil Service roles and creating more opportunity around the country will help us build a truly modern Civil Service. "
        },
        {
            "text": "The Civil Service has ambitious plans to level up career opportunities for people across the UK by moving 22,000 roles outside of London, including 50% of Senior Civil Servant roles. The strategy will continue to provide better career opportunities across the UK, offering varied roles for diverse talents that reflect the people we serve. Read the full blog here."
        },
        {
            "heading": 3,
            "text": "My only guaranteed hot meal was my free school lunch"
        },
        {
            "text": "From part-time AO to successful Civil Service senior leader, Vicky McGurk’s moving personal story on how she smashed the glass ceiling is living proof you can overcome childhood struggles and make life a success. "
        },
        {
            "text": "Lorraine McBride’s interview uncovered Vicky’s moving story. Born and raised in one of Blackburn’s poorest council estates, life was tough being the eldest of five, with parents on benefits, who couldn’t read, write, or help with homework. "
        },
        {
            "text": "With no quiet spaces or money for a computer, Vicky shared a cramped bedroom with two younger sisters.Vicky joined the Civil Service aged 17 when she joined the DWP as a part-time administrative officer. "
        },
        {
            "text": "It was her first grown up job and where Vicky “realised I could aspire to be the person I want to be.” Since then, Vicky has steadily scaled the ladder, landed a coveted place on the Future Leaders Scheme and proved a hit inspirational speaker at this summer’s Civil Service Live. You can read Vicky’s story here. "
        }
    ]
}