{
    "url": "https://naturalengland.blog.gov.uk/2024/11/11/birds-of-a-feather-restoring-habitats-for-seabirds-in-the-solent/",
    "title": "Birds of a Feather: Restoring Habitats for seabirds in the Solent",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Biodiversity",
        "Climate change",
        "Coast and access",
        "Marine environment",
        "National Nature Reserve",
        "Natural England",
        "Nature Recovery",
        "Seabirds",
        "Species recovery",
        "Wildlife"
    ],
    "pub_date": "2024-11-11T12:00:00+00:00",
    "content": [
        {
            "text": "Jessica Taylor, Marine and Coastal Senior Officer at Natural England, talks about some of the work the Thames Solent team are doing to support our breeding seabirds in the Solent."
        },
        {
            "text": "Located on the New Forest coastline, our North Solent NNR is one of our largest nature reserves. It includes a series of waterbodies, protected by a sea wall, that are regularly visited by a range of birds. As the nights get darker and colder, the reserve comes to life with a whole host of grazing and foraging waders and wildfowl, and in spring, the air is thick with the calls of avian residents, including lapwing, avocets and spoonbills."
        },
        {
            "text": "Amongst these friendly feathered visitors are the terns. Four species of tern have been recorded in the Solent: common, sandwich, little and roseate, all of which are designated in the Solent as part of Solent and Southampton Water Special Protection Area (SPA)."
        },
        {
            "text": "This used to be one of the key sites for breeding terns in the Solent, and terns are regularly seen feeding in the area. However, no terns have successfully bred on this site for several years. My team set out to explore the reasons why, and hopefully change this."
        },
        {
            "text": "The hunt for shingle - what makes a tern return?Our starting point was answering the question: what does it take to make a tern want to come back to your site? In April our breeding seabirds, including terns, undertake the long migration from West Africa in the hunt for suitable shingle areas to nest. Shingle – made up of small, rounded pebbles and rocks - makes an ideal nesting habitat for terns, and other breeding seabirds, as they can create scrapes in the stones to lay their eggs which are then camouflaged by the pebbles. However, around the UK coastline suitable natural shingle habitat is in decline as a result of multiple factors, including sea level rise, increasing tidal surges and disturbance. This means that in the Solent there are only a handful of places left where our seabirds can successfully nest and raise a chick without the risk of being disturbed. We knew that restoring this habitat would be key."
        },
        {
            "text": "Testing the theory.On a rather wet and windy day in April 2024, our incredible North Solent NNR staff and volunteers, working alongside the landowner, installed a single shingle topped raft into one of the lagoons on North Solent NNR. We wanted to test the theory that if shingle was available, breeding seabirds would use it. The rafts included some tern decoys, created in partnership with the local Countryside Education Trust, to further encourage terns to nest."
        },
        {
            "text": "Our experiment proved to be a success, with the first common terns to successfully breed on North Solent NNR for around 20 years nesting on the raft this spring / summer. This demonstrated that by putting suitable nesting habitat into this lagoon, terns would come. The next question was, can we scale this up?"
        },
        {
            "text": "Creation of shingle islands"
        },
        {
            "text": "In September 2024, funded by The Solent Seascape Project, work began on the creation of six shingle islands in two waterbodies located on North Solent NNR, one of which is where the raft was installed earlier in the year. This narrow window of time was chosen to ensure that the works did not disturb the final breeding birds leaving the site, or the overwintering birds soon to be arriving. To do this safely, the lagoons had to be fully drained, and diggers brought in to create mud islands topped with shingle, which is no small feat."
        },
        {
            "text": "These waterbodies are located just behind a sea wall and on a restricted access site and so will not only be protected from rising sea levels but also from high levels of disturbance. It is hoped this will provide the perfect habitat for when our terns start to return in Spring 2025."
        },
        {
            "text": "It's not just for the summer…"
        },
        {
            "text": "During the winter, vast numbers of wading birds, including black-tailed godwits, dunlin and oystercatchers, make the long migration from their breeding grounds to the Solent and need a safe place to rest and recover. Therefore, whilst these islands have been created to provide suitable habitat for breeding seabirds, it is hoped that they will also provide protected high tide roosting sites for our overwintering birds."
        },
        {
            "text": "What’s next"
        },
        {
            "text": "Our fantastic staff and volunteers working on North Solent NNR will monitor the islands to see how they are being used by birds throughout the year, and, if successful, we have the potential to create more nesting islands on North Solent NNR as part of the Solent Seascape Project.  "
        },
        {
            "text": "It’s also great to be connecting two externally funded projects together. Through our work with Ocean Conservation Trust as part of the EU funded LIFE Recreation ReMEDIES project, we have started to turn the tide on the loss of seagrass in the area through a restoration trial at the mouth of the Beaulieu River. Seagrass provides a really important nursery function for many fish species and so may help provide some much-needed prey to feed any seabird chicks.  "
        },
        {
            "text": "The work to increase the number of suitable sites for our breeding seabirds follows the excellent work that RSPB have been doing elsewhere in the Solent and so the Solent Seascape Project’s aim to create 10 seabird nesting areas is well underway. If you’d like to know more about the project or how you can get involved, please visit Get Involved - Solent Seascape."
        },
        {
            "text": "Solent Seascape Project "
        },
        {
            "text": "The Solent Seascape Project (SSP) is an exciting five-year, 10-partner project lead by Blue Marine Foundation that is seeking to restore four of the most vulnerable marine habitats - seagrass meadows, oyster reefs, saltmarsh, and seabird nesting habitat - across the Solent region of the UK’s south coast. East Head Impact and the Endangered Landscapes & Seascapes Programme (ELSP), managed by the Cambridge Conservation Initiative and funded by Arcadia, support the Solent Seascape Project."
        },
        {
            "text": "To find out more about the Solent Seascape Project, watch our video! "
        }
    ]
}