{
    "url": "https://nationalscreening.blog.gov.uk/2024/11/11/timely-detection-of-thousands-of-cancers-underlines-benefits-of-a-national-lung-cancer-screening-programme/",
    "title": "Timely detection of thousands of cancers underlines benefits of a national lung cancer screening programme",
    "authors": [
        "Charlotte Smith"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2024-11-11T09:05:27+00:00",
    "content": [
        {
            "text": "Lung cancer causes more deaths than any other cancer in the UK, almost as many as breast, bowel and prostate cancer combined.  Lung cancer has a lower rate of early diagnosis than these common cancers."
        },
        {
            "text": "There are usually no signs or symptoms of lung cancer at an early stage. The Targeted Lung Health Check (TLHC) programme aims to find lung cancer early, before any symptoms and when treatment is more likely to be successful."
        },
        {
            "text": "Smoking causes more than 7 out of every 10 cases of lung cancer, which means people who currently or used to smoke are at higher risk of developing the disease."
        },
        {
            "text": "People diagnosed with lung cancer at stage 1 through screening have an average 5-year survival of over 90%. This contrasts with a 5-year survival rate of only 4% for those diagnosed at stage 4."
        },
        {
            "text": "The TLHC programme offers lung cancer screening to people who have a history of smoking, are aged 55 to 74 and found to be at a high risk of having or developing lung cancer. The programme is currently available across more than 25% of England."
        },
        {
            "text": "Work is now under way to scale up this programme into a consistent high quality national screening programme following the positive recommendation from the UK National Screening Committee (UK NSC) and the Westminster government announcement of June 2023."
        },
        {
            "text": "Lord Darzi's report on the state of the NHS in England, published on 12 September, praised the impact the programme has already made, resulting in ‘notable improvements in the early detection of lung cancer’. The report recommended these improvements are celebrated and lessons applied to other areas."
        },
        {
            "heading": 2,
            "text": "What the screening programme involves"
        },
        {
            "text": "The programme aims to find lung cancer earlier."
        },
        {
            "text": "People who attend a lung health check appointment are asked questions about their health and lifestyle, for example their smoking history, height, and weight."
        },
        {
            "text": "People who do not reach the programme’s risk threshold are currently discharged from the programme and all participants who are current smokers are offered a referral to a smoking cessation service."
        },
        {
            "text": "Individuals found to be at higher risk of lung cancer are then invited for a CT scan that takes detailed pictures of their chest."
        },
        {
            "text": "Some people have changes on their CT scans and are asked to return after 3 and 12 months for further scans. Most of these scans will be reassuring."
        },
        {
            "text": "People who have findings that may be indicative of lung cancer on any CT scan are referred to their local hospital for diagnosis and treatment. Less than 50% of the people referred to hospital are found to have lung cancer."
        },
        {
            "heading": 2,
            "text": "Tackling health inequalities through screening"
        },
        {
            "text": "There is a clear link between smoking and inequality. People living in England’s most deprived areas are 4 times more likely to smoke than people living in the least deprived areas (ONS, 2018)."
        },
        {
            "text": "Rollout of the national screening has been prioritised first in the most deprived areas of England and it will continue to expand to the rest of the country to provide full coverage of the eligible population by 2029."
        },
        {
            "text": "The programme, delivered in local communities, is helping to reduce health inequalities in cancer outcomes. Data shows that people living in the most deprived areas are now more likely to be diagnosed with lung cancer at an earlier stage, compared to their counterparts in less deprived areas."
        },
        {
            "text": "Between 1 April 2023 and 31 March 2024, more than a third of people diagnosed with lung cancer in the 20% most disadvantaged areas were diagnosed at stage 1 or 2 (34.5%, up from 30% in 2019)."
        },
        {
            "heading": 2,
            "text": "Campaign materials focus on importance of early detection and treatment"
        },
        {
            "text": "NHS England’s national programme team has been working with the Roy Castle Lung Cancer Foundation on a communications campaign, which includes case studies, posters and social media adverts."
        },
        {
            "text": "The campaign aims to highlight the importance of detecting lung cancer early, and that people who have an early-stage cancer often do not have signs or symptoms. The campaign has been developed following feedback from people who chose not to attend a check because they believed their lungs were fine."
        },
        {
            "text": "Materials include a short film, Targeted Lung Health Checks – why you should attend even if you feel well, and compelling case study stories to demonstrate how the programme is saving lives."
        },
        {
            "text": "People can find out if lung health checks are available where they live by visiting the NHS website."
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK National Screening Committee. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, email screeninginformation@dhsc.gov.uk."
        }
    ]
}