{
    "url": "https://ruralpayments.blog.gov.uk/2024/11/11/understanding-the-sustainable-farming-incentive-sfi-rotational-actions-declaration/",
    "title": "Understanding the Sustainable Farming Incentive (SFI) rotational actions declaration",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Sustainable Farming Incentive"
    ],
    "pub_date": "2024-11-11T12:40:56+00:00",
    "content": [
        {
            "text": "There are some Sustainable Farming Incentive (SFI) actions in the SFI 2023 offer which are ‘rotational’."
        },
        {
            "text": "As explained in the handbook for the SFI 2023 offer, in the second or third year of an SFI agreement these rotational SFI actions can:"
        },
        {
            "text": "Tell the RPA about the future location and area of your rotational SFI actions"
        },
        {
            "text": "If your SFI agreement includes rotational SFI actions, you will have told us about their location and area for the first year of your agreement in your application."
        },
        {
            "text": "You need to complete a ‘rotational actions declaration’ to tell us about the location and area of your rotational SFI actions for the second and third years of your SFI agreement. This is necessary even if you’re not making any changes to the location or area of these actions."
        },
        {
            "text": "You can move the location of a rotational SFI action to an eligible land parcel that’s linked to your Single Business Identifier (SBI). This can be land that’s not already in your SFI agreement."
        },
        {
            "text": "Rotational SFI actions in the SFI 2023 offerYou’ll need to complete a rotational actions declaration if your SFI agreement includes any of the following SFI actions in the SFI 2023 offer:"
        },
        {
            "text": "Action for soilsSAM2 - Multi-species winter cover cropsSAM3 - Herbal leys"
        },
        {
            "text": "Actions for integrated pest managementIPM2 - Flower-rich grass margins, blocks, or in-field stropsIPM3 - Companion crop on arable and horticultural landIPM4 - No use of insecticide on arable crops and permanent crops"
        },
        {
            "text": "Actions for nutrient managementNUM2 - Legumes on improved grasslandNUM3 - Legume fallow"
        },
        {
            "text": "Actions for farmland wildlife on arable or horticultural landAHL1 - Pollen and nectar flower mixAHL2 - Winter bird food on arable and horticultural land"
        },
        {
            "text": "Actions for farmland wildlife on improved grasslandIGL2 - Winter bird food on improved grassland"
        },
        {
            "text": "When to complete your rotational actions declaration"
        },
        {
            "text": "You need to complete your rotational actions declaration towards the end of the first and second years of your SFI agreement."
        },
        {
            "text": "Your rotational actions declaration will be available in the Rural Payments service once you’ve submitted your annual declaration. We will tell you when it’s available."
        },
        {
            "text": "It’s important that you complete and submit your rotational actions declaration as soon as it’s available. We can’t pay you for the relevant agreement year until you submit it."
        },
        {
            "text": "How to complete your rotational actions declaration"
        },
        {
            "text": "After you’ve submitted your annual declaration, you need to sign in to the Rural Payments service and complete your rotational actions declaration as soon as possible."
        },
        {
            "text": "If you want to make changes to any of your rotational actions, complete:"
        },
        {
            "text": "If you do not want to change the area or location of your rotational SFI actions, complete:"
        },
        {
            "text": "Check your details are up to date"
        },
        {
            "text": "To make sure we can deal with any queries quickly, it’s important that your personal and business details are up to date in the Rural Payments service. Sign in to the Rural Payments service to check and update them if necessary."
        },
        {
            "text": "Where to find more information"
        },
        {
            "text": "Read more about your SFI agreement’s terms and conditions in the SFI Handbook for the SFI 2023 offer. It provides information about what to do if your circumstances change or if you cannot deliver your agreement."
        },
        {
            "text": "If you have any questions, please contact us at:"
        },
        {
            "text": "ruralpayments@defra.gov.uk (please make sure that you add ‘SFI 23’  to the subject title of your email) or call us on 03000 200 301 (Monday to Friday, 8.30am to 5pm)."
        },
        {
            "text": "Please don’t forget to add your Single Business Identifier (SBI) and agreement number on your email."
        },
        {
            "text": "Thank you for your ongoing commitment to the Sustainable Farming Incentive and the environmental improvements it brings."
        }
    ]
}