{
    "url": "https://socialcare.blog.gov.uk/2023/08/17/honour-stories-a-passion-for-supporting-care-colleagues/",
    "title": "Honour stories: a passion for supporting care colleagues",
    "authors": [
        "Barbara Johnson MBE"
    ],
    "categories": [
        "Care and support",
        "Recognition",
        "Workforce"
    ],
    "pub_date": "2023-08-17T15:12:41+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Anything is possible"
        },
        {
            "text": "When I learned I had been awarded the MBE for my contribution to social care, I was truly humbled by it. To have national recognition for my years of hard work was something I had never contemplated. My family and friends were so excited and the support from my colleagues at Risedale Nursing Homes has been overwhelming."
        },
        {
            "text": "I have been a Registered Nurse for 42 years, 32 of them spent working in social care. Throughout this time, I have worked ceaselessly to prove to anyone who would listen that social care is not a second-class service. My mantra has always been “we need the best nurses not the worst”."
        },
        {
            "text": "I also believe that anything is achievable if you want it enough and use your passion, determination and true grit to fight for it. I have applied these values to a nurse training programme within Risedale Nursing Homes. We now have over 30 nurses registered and a further 46 in training. We will be self sufficient in nurses for many years to come."
        },
        {
            "text": "I wanted our carers to be able to progress to Registered Nurse status as many would have been unable to do so through traditional routes. They have rewarded my faith in them every single day with their commitment, passion and enthusiasm. I believe the standard of nurse we employ is second to none and the beneficiaries of this are the most important people within the company: the residents."
        },
        {
            "heading": 2,
            "text": "MBE-lieve in yourself!"
        },
        {
            "text": "My sense of pride in my colleagues has given me is a lovely, warm feeling and I am grateful to all the people around me who say, “you deserve this” for the support I have given them."
        },
        {
            "text": "The media coverage was so much more than I expected and it was so lovely to see a positive story about social care on the front page of our local newspaper, rather than the negativity often associated with our sector."
        },
        {
            "text": "There are many unsung heroes in social care. I would encourage anyone who admires their colleagues for going the extra mile to nominate them for an honour without delay."
        },
        {
            "text": "This is a once in a lifetime experience, and I am sure there will be a few happy tears when my family see me receive the MBE. It means the world to me,and my family and proves hard work and determination can change social care for the better."
        }
    ]
}