{
    "url": "https://actuaries.blog.gov.uk/2023/08/17/ministerial-department-seeks-actuarial-secondee/",
    "title": "Ministerial department seeks actuarial secondee",
    "authors": [
        "Jason Ronad - Senior Trainee Actuary"
    ],
    "categories": [
        "Actuary",
        "Analysis",
        "Modelling"
    ],
    "pub_date": "2023-08-17T13:20:21+01:00",
    "content": [
        {
            "text": "For the past year or so, I’ve been working at the Department of Health and Social Care. I was in the unit which provided analysis for policy areas relating to indemnity and patient safety."
        },
        {
            "text": "I wanted to give an overview of the work I undertook while working on secondment – especially where my actuarial background helped. I’ll offer an insight into some of the main projects which occupied my time. I will also shed a light on a couple of common outputs that are vital to the government’s decision-making process."
        },
        {
            "heading": 2,
            "text": "Actuarial background -> Analysis                ->Policy"
        },
        {
            "text": "One of the pillars of a successful policy is the evidence that backs up that policy. This is an area where analysts assist, in forming a sound evidence base."
        },
        {
            "text": "The analytical team I worked in was embedded in a policy directorate. This meant analysts and policy colleagues worked closely together to achieve this goal."
        },
        {
            "text": "With the analysis and use of evidence, I found that my actuarial training and secondment role complemented each other on 3 fronts."
        },
        {
            "text": "First, knowledge of insurance products and the insurance market meant I could share a unique view when it came to the generation and appraisal of policy options."
        },
        {
            "text": "Second, financial modelling comes hand-in-hand with actuarial work, so I was able to draw on my experience to assess the impact of policy options. Lastly, the communication of analysis is important and a key skill for an actuary."
        },
        {
            "text": "Adhering to professional standards gave me sense of what is best practice, such as making it second nature to note limitations by caveating the numbers produced."
        },
        {
            "text": "My secondment gave me plenty of opportunities to enhance this skill, for instance when selecting the most appropriate data source, justifying an assumption, or managing uncertainty."
        },
        {
            "heading": 2,
            "text": "Projects galore"
        },
        {
            "text": "At the start, I worked on a project related to appropriate clinical cover. Clinical negligence cover provides assurance for healthcare professionals and their patients. For any NHS treatment, the government provides this cover, through NHS Resolution."
        },
        {
            "text": "The policy team I worked with focused on the indemnity arrangements for non-NHS treatment, like private dental care, where cover is offered by medical defence organisations and insurers."
        },
        {
            "text": "I heard about an impact assessment for the first time through this project."
        },
        {
            "text": "I also worked with a policy team on a scheme that would make compensation payments. This was similar to estimating the liability of an insurance product or pension scheme. The potential cost of this scheme boils down to answering fundamental questions on the number of payments that could be made and potential size of the payments."
        },
        {
            "text": "As part of this project, I contributed towards completing a business case."
        },
        {
            "text": "Green Book guidance published by HM Treasury has more details on developing an impact assessment and business case."
        },
        {
            "heading": 2,
            "text": "Final reflection"
        },
        {
            "text": "Returning to my initial point on the pillars of a successful policy, a sound evidence base is not considered in isolation. After my secondment, I now have a greater understanding and appreciation for the complexities in delivering the policy itself and factoring in the political context while doing so."
        },
        {
            "text": "Disclaimer"
        },
        {
            "text": "The opinions in this blog post are not intended to provide specific advice. For our full disclaimer, please see the About this blog page."
        }
    ]
}