{
    "url": "https://charitycommission.blog.gov.uk/2022/02/25/charities-bill-the-next-steps/",
    "title": "Charities Bill: the next steps",
    "authors": [
        "Aarti Thakor"
    ],
    "categories": [
        "Charities Bill"
    ],
    "pub_date": "2022-02-25T10:01:27+00:00",
    "content": [
        {
            "text": "Earlier this week, the Charities Bill received Royal Assent, and passed into law as the Charities Act 2022."
        },
        {
            "text": "This is a moment for celebration. We welcome the provisions of the legislation, which originated with recommendations from the Law Commission and are primarily aimed at making life easier for trustees, helping them maximise the benefits their charity delivers. While the changes are largely technical, they are designed to make a positive, practical difference to charities, and the Commission as regulator."
        },
        {
            "heading": 2,
            "text": "What changes?"
        },
        {
            "text": "In a previous blog, I outlined the key changes and what they mean for charities."
        },
        {
            "text": "As a quick reminder, and for example, the provisions make it more straightforward for charities to change their governing documents, grant more flexibility in using ‘permanent endowment funds’, allow greater flexibility around the advice needed when selling land, and allow trustees to be paid for goods provided to a charity in certain circumstances."
        },
        {
            "text": "In summary, the changes aim to be largely enabling and empowering for trustees."
        },
        {
            "heading": 2,
            "text": "What happens next?"
        },
        {
            "text": "Royal Assent is not the end of the process for us – it marks the beginning of the next stage of hard work, as it now falls on the Commission  to implement many of the legislative changes. Indeed, implementing the Charities Act is one of our business priorities in the year ahead."
        },
        {
            "text": "We will not be able to make all of the necessary changes in one go - not least because some of the changes require secondary legislation and others changes to our systems and processes. We have developed a plan that will see us aiming to gradually implement the changes between now and the autumn of 2023 (not all the provisions though are dependent on the Commission and may be brought into force earlier)."
        },
        {
            "heading": 2,
            "text": "What’s involved in implementing the Bill"
        },
        {
            "text": "We’re talking here about changes to our guidance for trustees, our desk guidance for case workers within the Commission, and some of our online digital services for charities. We will also need to make sure all relevant staff are trained on the changes."
        },
        {
            "text": "Some of the changes are quite simple – such as updating some of our guidance; others require ongoing input from a range of technical experts within the Commission to ensure the final product is fit for purpose."
        },
        {
            "heading": 2,
            "text": "What charities can expect"
        },
        {
            "text": "You can read the implementation plan for the Charities Act 2022, which sets out an indicative timetable for when provisions in the Act are expected to come into force."
        },
        {
            "text": "We will let charities know when each of the relevant provisions come into force and we have consequently updated certain pieces of guidance, or amended an online service."
        },
        {
            "text": "We will also be clear about when the process has concluded – so when all the provisions that require changes from us have been implemented."
        }
    ]
}