{
    "url": "https://ukhsa.blog.gov.uk/2022/02/25/covid-19-moving-towards-recovery-for-schools-colleges-and-universities/",
    "title": "COVID-19: Moving towards recovery for schools, colleges and universities",
    "authors": [
        "Catherine Falconer"
    ],
    "categories": [
        "Coronavirus (COVID-19)"
    ],
    "pub_date": "2022-02-25T16:02:00+01:00",
    "content": [
        {
            "text": "The COVID-19 pandemic and the restrictions it has made necessary have had a significant impact on the education, health and social development of our children and young people."
        },
        {
            "text": "Throughout the pandemic, UKHSA has worked closely with the Department for Education, Directors of Public Health and Local Authorities, delivering scientific evidence and advice on COVID-19 control measures to help minimise disruption for our children and young people in education settings."
        },
        {
            "text": "Schools, colleges and universities have undertaken huge efforts to respond to the pandemic, implementing measures such as mass routine asymptomatic testing at pace."
        },
        {
            "text": "Since the education testing programme began in January 2021, over 116 million LFD tests have been reported - making educational settings the most tested of all ‘low-risk’ settings. Testing has been crucial in enabling the education of our children and young people to continue safely and has taken the much-needed support of staff, students, and families."
        },
        {
            "text": "Fortunately, we now have a strong body of evidence to show that the risks of COVID-19 to children and young people are low. This is due to the fantastic response of the public, including our young people, in taking up the offer of vaccination, which provides high levels of protection from infection and illness."
        },
        {
            "text": "Our data has also shown that Omicron is less clinically severe than previous variants of COVID-19. As a result, it is sensible to now focus testing and resources towards people more at risk of becoming seriously unwell and people in high-risk settings such as hospitals and care homes."
        },
        {
            "text": "This means that it is now time to end twice-weekly routine testing in mainstream education settings,  bringing education in line with the rest of society and other low-risk environments. Twice-weekly routine testing will continue in certain education settings that may be considered at higher risk, such as special educational needs and disabilities (SEND) schools and in children’s social care."
        },
        {
            "text": "Local Directors of Public Health and Health Protection Teams will continue to support schools, college and universities that have an identified COVID-19 outbreak which is impacting on the schools ability to run."
        },
        {
            "text": "If staff are concerned, they should contact their local director of public health or health protection team, who will give advice on whether to implement any measures outlined in the Contingency Framework to help manage transmission. These measures could include the reintroduction of asymptomatic testing or face coverings for short periods of time."
        },
        {
            "text": "Important mitigations, such as good ventilation and hand hygiene, will continue to help reduce the risk of transmission and maintain face-to-face learning."
        },
        {
            "text": "In line with the general population, staff and students will be able to access testing for specific circumstances via the online portal or their local pharmacy. Education establishments that have stocks of tests can continue to distribute them if they wish."
        },
        {
            "text": "Vaccines remain our best form of defence against severe disease. We continue to urge everyone who is eligible to get a vaccine. The booster dose of the COVID-19 vaccine is available to everyone aged 16 and over who has already had their first and second dose, and all children aged 12 to 15 can get a first and second dose of the COVID-19 vaccine."
        },
        {
            "text": "A third primary dose and booster are available to people aged 12 and over who have severely weakened immune systems. All children aged 5 to 11 can also get a first and second dose of the COVID-19 vaccine, particularly important if they have a condition that means they are at high risk of getting seriously ill from COVID-19, or they live with someone who has a weakened immune system."
        },
        {
            "text": "As we move towards a more normal life for our children and young people in education, we will continue to monitor the data closely and keep our advice under review.  As ever, our advice to ministers will be built on a solid foundation of sound data and the close observation of trends, combined with our ever-increasing understanding of COVID-19 and its clinical and societal effects."
        }
    ]
}