{
    "url": "https://socialcare.blog.gov.uk/2022/02/25/health-and-social-care-integration-local-perspectives/",
    "title": "Health and social care integration: local perspectives",
    "authors": [
        "Paul Najsarek"
    ],
    "categories": [
        "Care and support",
        "Communities",
        "Integration",
        "Leadership",
        "Social care reform",
        "Workforce"
    ],
    "pub_date": "2022-02-25T10:41:05+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Integration depends on playing to our strengths"
        },
        {
            "text": "Developing policies and setting out an ambition which seeks to improve outcomes for the people and places we serve is one thing, delivering on the ground and making a real difference to peoples’ lives right across the country is quite another."
        },
        {
            "text": "‘Joining up care for people, places and populations’ is not just the title of the Government’s Integration White Paper, but an aspiration for us all. While ‘integration’ is a technical term, the concept will only be relevant to our residents if it empowers our health and social care staff to work more effectively and efficiently together, and, ultimately, provide people with better care in the right place, at the right time."
        },
        {
            "text": "I, along with my local government colleagues across the country, am a strong believer in the potential for councils to make a real, positive difference to the lives and life chances of our residents."
        },
        {
            "text": "But we are also clear, it will only be by working together with health, voluntary and community sector partners, and playing to our respective strengths, that we will be able to deliver meaningful change by better treating and preventing illness, improving public health, and addressing inequalities."
        },
        {
            "text": "There are examples of this happening already. A recent joint report by Solace and the NHS called ‘Delivering Together for Residents’ highlights a handful of case studies which demonstrate the power of partnerships outside traditional health and care services."
        },
        {
            "text": "For example, an alliance has been formed in Doncaster to support people with complex lives after an assessment of the impact on local public services found 57 people were costing the public purse at least £1m. When scaled to the estimated total cohort of 4,200 people experiencing multiple disadvantages in Doncaster this totalled almost £50m a year of mostly reactive costs."
        },
        {
            "text": "Since launching in 2017, the alliance has helped more than 100 rough sleepers to settle in stable accommodation. Supported by key workers and wraparound plans, people are reducing offending behaviours, drug and alcohol misuse, while also improving physical and mental health."
        },
        {
            "text": "In Gloucestershire, several councils and NHS Gloucestershire CCG pooled resources to cover the cost of external wall insulation for 90 park homes after data analysis found hospital admission rates for park home residents were higher than the average, particularly for respiratory and circulatory conditions."
        },
        {
            "text": "Aside from the very newest properties, park homes are built without insulation, leaving only board and render between the occupier and the elements. While the average cost of installing insulation was £6,000 per property, the project is expected to deliver savings to the NHS of around £400,000 and wider society of around £7m over the next five years."
        },
        {
            "heading": 2,
            "text": "Local solutions"
        },
        {
            "text": "A strong theme running through every success story is the importance of place. Understanding our areas and developing local solutions that work for the communities we serve is crucial. That is why I am especially supportive of the White Paper’s proposal for a single accountable person for shared outcomes."
        },
        {
            "text": "It could be argued that local authority chief executives will often be the right people to take on such roles. They have a crucial and unique part to play in bringing together disparate funding streams in a place and galvanising not just their councils but essential local stakeholders to contribute to this incredibly important agenda –."
        },
        {
            "text": "But it is just as important that each place has the flexibility to choose who they think best fits the bill – and I welcome the Government adopting that adaptable approach."
        },
        {
            "text": "The response to the coronavirus crisis has shown the importance – and power – of partnership working. And I am sure that by continuing to work in close collaboration, we can collectively deliver better services, improve the health and wellbeing of the nation, and address the many health inequalities which have been further exposed and exacerbated by the pandemic."
        }
    ]
}