{
    "url": "https://educationhub.blog.gov.uk/2022/02/25/help-for-teachers-and-families-to-talk-to-pupils-about-russias-invasion-of-ukraine-and-how-to-help-them-avoid-misinformation/",
    "title": "Help for teachers and families to talk to pupils about Russia’s invasion of Ukraine and how to help them avoid misinformation.",
    "authors": [
        "Media Officer"
    ],
    "categories": [
        "Schools"
    ],
    "pub_date": "2022-02-25T22:12:39+00:00",
    "content": [
        {
            "text": "Russia’s invasion of Ukraine is distressing and concerning, and we understand children and young people may have questions or be seeking reassurance. We know that schools are well placed to talk to pupils about the images they are seeing and help them navigate the concepts and issues this brings up but we’re also aware that it raises issues some schools and teachers may never have encountered before."
        },
        {
            "text": "Here we share some useful advice and resources for schools and teachers – but they may also be useful for families and young people themselves."
        },
        {
            "heading": 3,
            "text": "How to talk to young people about distressing complex, emotive news stories"
        },
        {
            "text": "The Educate Against Hate website is a useful resource when dealing with a range of issues relating to conflict, difficult classroom conversations and more. A post by Tom Bigglestone, a former Head of Humanities and now Online Learning Manager at The Economist Educational Foundation, encourages teachers to:"
        },
        {
            "text": "Educate against hate also has a range of teaching resources aimed at promoting dialogue in the classroom that can support students to achieve a greater understanding of complex and sensitive topics."
        },
        {
            "heading": 3,
            "text": "How to spot mis- and disinformation and how to help pupils do the same"
        },
        {
            "text": "Mis- and disinformation are particularly prevalent during times of conflict and the risk posed by misleading narratives and information becomes more severe. Educate Against Hate hosts content produced by Be Internet Citizens,  an educational programme developed by the Institute of Strategic Dialogue and YouTube. Covers topics including:"
        },
        {
            "text": "Educate Against Hate also hosts a one hour lesson plan from the Economist Educational Foundation that explores why conspiracy theories are more common in times of crisis, why people spread them and how they should be debunked."
        }
    ]
}