{
    "url": "https://deframedia.blog.gov.uk/2022/02/25/tony-juniper-reappointed-as-natural-england-chair/",
    "title": "Tony Juniper reappointed as Natural England Chair",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2022-02-25T12:07:14+00:00",
    "content": [
        {
            "text": "Today we are looking at a media interview on Tony Juniper’s recent reappointment as Natural England chair."
        },
        {
            "text": "There is positive coverage today in the Guardian following Tony Juniper’s recent reappointment as Chair of Natural England."
        },
        {
            "text": "Tony Juniper was interviewed on a range of topics and his goals for his second term. He commented on how Biodiversity Net Gain will help create new wildlife sites and discussed the importance of both bigger, better, more connected nature-rich places and improving the environment around where people are living. Biodiversity Net Gain will help communities, planners, developers and Local Planning Authorities ensure new developments are “nature positive” and deliver a 10% boost to the area’s biodiversity."
        },
        {
            "text": "He also discussed the importance of a coherent Nature Recovery Network to help connect habitats to have the biggest strategic impact – piecing together Biodiversity Net Gain, new agricultural schemes and existing protected areas."
        },
        {
            "text": "Tony Juniper, Chair of Natural England, told the Guardian:"
        },
        {
            "text": "“There’s limited semi-natural habitat around here so creating more of it to be able to serve that population makes sense. But doing it in the best possible way to get the biggest strategic impact is the key thing. We don’t want little pocket parks scattered all over the place randomly. We’d like to see the coherent construction of a nature recovery network which is not only taking account of biodiversity net gain but also the existing protected areas and blend that with the new agricultural schemes. It’s a jigsaw to piece together.”"
        },
        {
            "text": "Over the next three years, Tony Juniper commented how the aim is for Natural England is to deliver on the task of nature recovery, create for more national nature reserves and increase the supply of and access to nature."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}