{
    "url": "https://dcmslibraries.blog.gov.uk/2022/01/05/libraries-sector-in-the-new-year-honours-list-2/",
    "title": "Libraries sector in the New Year Honours list",
    "authors": [
        "Cheryl Shorter, Libraries Team, DCMS"
    ],
    "categories": [
        "Library news",
        "Library workforce"
    ],
    "pub_date": "2022-01-05T12:54:56+00:00",
    "content": [
        {
            "text": "It’s time for our traditional New Year post."
        },
        {
            "text": "Congratulations to the 13 library sector people who were awarded Honours.  It is great to see these recipients recognised for continuing to help improve and support a wide range of libraries work across England, particularly through the challenges of the COVID pandemic.  You can read more below about some of the work they have done."
        },
        {
            "text": "A national Honour is one of the highest recognitions a person can receive. "
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Officer of the Order of the British Empire (OBE)"
        },
        {
            "text": "Ann Cleeves. Author. For services to Reading and Libraries."
        },
        {
            "text": "A prolific crime writer, Ann Cleeves' novels have been translated into 20 languages. For the National Year of Reading, Ann was made reader-in-residence for three library authorities. She went on to set up reading groups in prisons as part of the 'Inside Books' project, and became Cheltenham Literature Festival's first reader-in-residence. In 2015, Ann was the Programming Chair for the Theakstons Old Peculiar Crime Writing Festival & the Theakston's Old Peculiar Crime Novel of the Year Award. In 2015, she was shortlisted for the Dagger in the Library UK Crime Writers' Association award for an author's body of work in British libraries (UK). She was appointed as a National Libraries Day ambassador for 2016. In 2017, Ann was presented with the Diamond Dagger of the Crime Writers' Association, the highest honour in British crime writing."
        },
        {
            "heading": 2,
            "text": "Member of the Order of the British Empire (MBE)"
        },
        {
            "text": "Karen Napier. Chief Executive Officer, The Reading Agency. For services to reading and public libraries."
        },
        {
            "text": "Karen is an experienced and well-regarded leader in the arts, cultural and education sectors, and as CEO of The Reading Agency (TRA) has a significant role in promoting the power of reading, and the vital role public libraries play in developing this. She led TRA through the COVID period, rapidly adapting the 2020 Summer Reading Challenge from physical to digital operation, enabling it to take place despite all the challenges facing it. Karen then provided vision and leadership to extend the model for 2021 to pilot work linking public libraries with local authority social care teams, food banks and other organisations to reach children from the most disadvantaged families. "
        },
        {
            "text": "Karen also teamed up The Reading Agency with Costa Coffee to give out 100,000 books ahead of Christmas 2020 to those hardest hit by the pandemic; and has been working with DfE to promote reading for pleasure, setting up and coordinating the successful Reading Together Day in July 2020, which involved public libraries."
        },
        {
            "text": "Karen and her team also worked with DCMS Libraries team to secure £3.5m of government funding to combat loneliness and its consequences, extending the reach of Reading Well Books on Prescription lists for adults, young people and children to all library branches in England, and extending training to run Reading Friends book groups to the majority of library services in England. "
        },
        {
            "text": "Under her leadership TRA has also broadened its offer, piloting exciting new schemes such as Reading Sparks, working with major science institutions across the country to support the growth of science among young people through reading, and to draw closer links between reading and STEM subjects. "
        },
        {
            "text": " "
        },
        {
            "text": "Rob Perks. Lead Curator for Oral History, British Library.  For services to libraries and national archives during COVID-19."
        },
        {
            "text": "Rob led the formation and delivery of a multi-format collecting programme to archive the national experience of COVID-19. Over the past year, this included a project working with the University of Manchester to archive over 2000 interviews with NHS patients, professionals and policymakers to capture their experiences at an unprecedented moment in the history of the NHS. The programme is archiving a large sample of broadcasts from 17 television, as well as major UK televised news, specials and world coverage, broadcasts from 60 radio stations and COVID-themed podcasts.  The programme also includes UK Web Archiving, with over 6,500 identified target sites collected so far.  This project will ensure our national memory of the pandemic is collected, preserved and made available to researchers in the years to come and which will play a major role in supporting society to understand and draw insight from the experience of this pandemic. "
        },
        {
            "text": " "
        },
        {
            "text": "David Smith. Chair, Community Managed Libraries Network.  For services to libraries."
        },
        {
            "text": "Following retirement, David became involved in the provision of community managed libraries in his local area (Dorset). David then went on to be involved in the foundation of the Community Managed Libraries National Peer Network, a volunteer-led organisation which aims to help community managed libraries (CMLs) to run effectively and successfully.  "
        },
        {
            "text": "As Chair, he has boosted the effectiveness of the Network, establishing programmes to help CMLs share good practice and provide them with a stronger voice.  During the COVID pandemic, David’s contribution was critical in supporting CMLs, representing their interests in national working groups, assisting DCMS to make the case for including CMLs in funding packages, and developing relationships with Libraries Connected so CMLs could access advice and guidance from them on COVID regulations. "
        },
        {
            "heading": 2,
            "text": "British Empire Medal (BEM)"
        },
        {
            "text": "Zoinul Abidin. Head of Universal Services, London Borough of Barking and Dagenham.  For services to public libraries."
        },
        {
            "text": "Zoinul has been instrumental in changes that put the library service at the heart of delivering and supporting the council’s priorities. He successfully integrated libraries, children’s centres, nurseries and healthy lifestyles teams, bringing together 19 services and over 630 staff.  He extended the libraries’ ability to work with the community by partnering with a range of services, from job shops and local police to youth clubs. Bringing these services together improved outcomes for residents, saved the council money and rebuilt trust between residents and the council. "
        },
        {
            "text": "He has developed partnerships with NHS colleagues to implement and embed social prescribing and he worked with ‘Talking Therapy’ integrating them into libraries – this has been especially beneficial in coping with the impact on mental health and wellbeing due to the pandemic. "
        },
        {
            "text": "During the COVID-19 pandemic, he retrained 61 library staff to deliver resident conversations, providing welfare checks, supporting food parcels and the delivery of medicines to vulnerable residents.  He also helped to promote volunteering across the borough, with 184 people volunteering at the new vaccine centre.  "
        },
        {
            "text": "In 2011 he established ‘ReadFest’ which aimed to get a borough with very low literacy rates engaged with reading books and using libraries.  Building on the festival’s success, he established  Pen and Print in 2014, a not-for-profit library organisation, to support creative writing and the festival.  Zoinul was recently appointed as a trustee for The Reading Agency."
        },
        {
            "text": " "
        },
        {
            "text": "Lesley Davies. Senior Development Manager, Communities, Sefton Library Service.  For services to public libraries and the community in Sefton, Merseyside."
        },
        {
            "text": "Lesley has made a significant contribution to the library sector spanning 25 years. She co-ordinates approximately 160 library volunteers at Sefton Library Service, helping the library deliver projects, including the work she has undertaken with the Home Visit Service. This is delivered entirely by volunteers to some of the most vulnerable residents in Sefton who are unable to leave their homes. She is the library representative on the Sefton Volunteer Involving Project group and the Sefton Dementia Alliance and was instrumental in getting all library staff trained as Dementia Friends. She is the library lead for the Arts Council supported The Human Libraries project, a cultural programme delivering activities that support socially isolated groups in the community. "
        },
        {
            "text": "Lesley has been instrumental in the Merseyside network of Reader Development and Programme Manager librarians, who come together on a regular basis to share good practice and find ways to work together. She also contributes to Time to Read, a network of Reader Development librarians spanning the North West. She volunteers on project working groups such as Shakespeare 400, Jane Austen, New Words, and she sits on the Time To Read steering group."
        },
        {
            "text": " "
        },
        {
            "text": "Stewart Parsons. Director, Get it Loud in Libraries.  For services to the music and library sectors."
        },
        {
            "text": "Stewart developed Get it Loud in Libraries (GILIL) from a small project at Lancaster library into an organisation which has national and international recognition.  GILIL is an award-winning project designed to give people who love music the chance to see top-grade artists in their local library, bringing  high quality music and culture to towns not on the traditional touring network.  Stewart introduced matinee gigs to audiences including families, children and 12-16-year olds bringing quality music to new audiences. "
        },
        {
            "text": "GILIL has also developed a partnership with the Girls Against campaign to create safe spaces for girls and young women at gigs. Stewart’s carefully considered programme curation offers live opportunities to women in music, either solo artists or female fronted bands to help close the gender gap of opportunity in the music industry. Stewart was recognised by the Bill and Melinda Gates Foundation as a library innovator, and for sharing his experience and enthusiasm internationally. In 2019, he was awarded the National Lottery Local Legend Award, recognising the impact his work has on communities. "
        },
        {
            "text": " "
        },
        {
            "text": "Nick Partridge. Head of Libraries, Sheffield City Council.  For services to public libraries."
        },
        {
            "text": "Nick joined Sheffield Libraries and archives service in 2014, facing challenges resulting from a need to reconfigure services in the light of budget constraints, and changing local needs. He developed a supportive relationship between the library authority and community managed libraries across the area; the approaches pioneered in Sheffield have been adopted widely across the country. He also encouraged co-design approaches, involving communities in helping to shape their local library services. "
        },
        {
            "text": "He has been especially active in developing the role of public libraries in business support, chairing the network of local library services working with British Library that make up the Business and Intellectual Property Centre network across the country."
        },
        {
            "text": "Locally he led and developed an innovative project which brought together the libraries and archives service, local football clubs and tourism and heritage bodies across the area to create a Football Trail, using technology in a new way via a walking app exploring locations It encapsulated Sheffield’s claim to be the home of Association football; and tied into a major city exhibition."
        },
        {
            "text": " "
        },
        {
            "text": "David Rowe. Founder, Libraries Hacked.  For services to public libraries."
        },
        {
            "text": "David founded Libraries Hacked, a project to work with library services who are willing to release open data, to use that data in new ways by creating software and data tools. All of his work for Libraries Hacked is done voluntarily. He is acknowledged as a driving force behind the development of library sector open data, which is something that both the Libraries Taskforce, and now DCMS, believe is critical to help library services to build a shared culture of service improvement and innovation. Examples of his more recent work include using existing open data on places and locations, combined with map tools, to share information on mobile library service provision. "
        },
        {
            "text": "He worked closely with DCMS, supported by other nationally recognised library open data experts, to create and test a common model for the Libraries Taskforce core data set to improve the sharing of libraries data to support service planning and innovation. "
        },
        {
            "text": "He collected data on library online activities and events across the country which Libraries Connected used to enhance its online offering during the coronavirus period. He shares his expertise through speaking at national and international conferences to build enthusiasm and draw more people into contributing to this initiative. "
        },
        {
            "text": " "
        },
        {
            "text": "Nina Simon. Manager, Redbridge Schools Library Service.  For services to education in the London Borough of Redbridge."
        },
        {
            "text": "Nina leads on library services for children and young people in Redbridge and personally initiated a number of schemes to bring this provision to life, including setting up and organising an annual local Book Awards for the children and young people of the Borough. About 300 children attend the awards each year but many more take part in reading and voting on  their favourite books. "
        },
        {
            "text": "As well as her core School Library Service work she also runs training programmes for teachers alongside adult writing groups including Write Next Door and Pen to Print, aimed at helping people express their previously uncovered creative talents.  A founder of the London SLS campaign, Nina has helped develop a strong social media and online communications presence.  She was instrumental in the development of SLS-UK; she chairs this group, creating a network enabling heads of school library services to support and learn best practice from each other. "
        },
        {
            "text": "During the pandemic Nina continued to attend and contribute to ASCEL virtual meetings and to chair SLS-UK virtual meetings. She is also the ASCEL representative on Achievement for All, a leading not-for-profit organisation that works in partnership with early years settings, schools and colleges to improve outcomes for all children and young people."
        },
        {
            "text": " "
        },
        {
            "text": "Darren Smart. Strategic Manager (Operations) Libraries, Registrars & Archives, Kent County Council.  For services to public libraries."
        },
        {
            "text": "An advocate for both public libraries and their digital future, Darren has written, presented and commented on these topics widely, including working with CILIP, IFLA, SCL and the Libraries Taskforce. He chaired the CILIP public and mobile libraries group for 2 years and pioneered community hub approaches for library services in his period as service manager in Essex, and also positioned mobile libraries effectively in the county’s rural agenda, as well as innovative outreach services for groups such as the homeless and women’s refuges, and teenage boys in a pupil referral unit.  "
        },
        {
            "text": "In Kent, he led the development of a new Libraries Strategy across the biggest library service in England, developing innovative customer service, health and wellbeing and digital initiatives.  In 2016 he was seconded to the Libraries Taskforce, where he led work to develop the national digital agenda for public libraries, as well as leading related pilots and partnerships, which have now established themselves successfully across the country.  "
        },
        {
            "text": "Darren has also been a leading figure in establishing more systematic and effective impact measurement approaches, which he has shared across the sector. "
        },
        {
            "text": " "
        },
        {
            "text": "Krystal Vittles. Innovation and Development Manger, Suffolk Libraries.  For services to public libraries."
        },
        {
            "text": "Krystal has been a trailblazer in exploring alternative delivery models and brokering partnership working, using her expertise in working with young people to enhance and improve library services in East Anglia. She joined Suffolk Libraries (the first library public sector mutual) as Libraries Innovation and Development Manager. She played a critical role in its establishment and success, integrating libraries’ work into wider strategic agendas and reaching diverse audiences to transform their understanding of what libraries can offer, and as part of this built and developed an unparalleled network of active and dynamic Friends Groups.  "
        },
        {
            "text": "Krystal  led Suffolk Libraries’ successful bid to become an Arts Council National Portfolio Organisation that is focussed on the library’s role in building closer relationships with young people. She co-designed a programme with young people and local artists to increase youth access and involvement with culture. BLOC (Building Libraries On Creativity) is now successfully running a vibrant and dynamic outreach programme across the county."
        },
        {
            "text": " "
        },
        {
            "text": "Fiona Williams. Chief Executive Officer, York Explore.  For services to libraries."
        },
        {
            "text": "Fiona began working in public libraries in 1988 for Dorset and joined York in 2004, where she developed the Explore vision.  Explore Centres aim to inspire everyone to challenge their imagination, explore their potential and connect with each other.  She led them into becoming a public sector mutual and recently negotiated a contract extension. "
        },
        {
            "text": "She served nationally as President of the Society of Chief Librarians, advocating the power of libraries at Government level, and also as their national lead for learning, digital and information – shaping the role of libraries and building partnerships. "
        },
        {
            "text": "As a member of York Cultural Leaders group she has developed partnerships with other arts organisations to demonstrate the key role that libraries have in bringing the best culture into people’s lives."
        },
        {
            "text": " "
        },
        {
            "text": "Andrew Wright. Library Development Manager, Kirklees Council.  For services to public libraries."
        },
        {
            "text": "Andy has 30 years’ experience in the public library sector. He is part of the Libraries Connected Universal Health Offer national committee, and in 2016 represented the Society of Chief Librarians (now Libraries Connected) on secondment at the Wellcome Trust developing the Engaging Libraries scheme bringing together  staff from across the sector to explore his ideas to develop libraries.  "
        },
        {
            "text": "Engaging Libraries is a partnership between the Carnegie UK Trust and Wellcome to encourage public libraries to engage local people in imaginative and interactive projects exploring health and wellbeing. It has led to a range of innovative approaches being adopted across the country, and has been influential in developing public libraries' role in supporting healthier and happier communities."
        },
        {
            "heading": 3,
            "text": "Other honours"
        },
        {
            "text": "DCMS Libraries is part of a wider team, so we are pleased to see our Deputy Director for Arts and Libraries, Louise Smith, awarded an OBE for her work to support cultural organisations.  Louise led the that delivered the Cultural Recovery Fund, a £1.57 billion package of financial support for the cultural sector. Without this support, the sector would have faced widespread insolvencies and a critical loss to this country’s cultural heritage. "
        }
    ]
}