{
    "url": "https://digitaltrade.blog.gov.uk/2022/01/05/new-year-new-strategy/",
    "title": "New year, new strategy",
    "authors": [
        "Jason Kitcat, DDaT Director"
    ],
    "categories": [
        "Culture",
        "Data",
        "Digital Services",
        "People and Skills"
    ],
    "pub_date": "2022-01-05T15:00:21+00:00",
    "content": [
        {
            "text": "Since the Department for International Trade’s (DIT) creation just over 5 years ago, the Digital, Data and Technology (DDaT) team have been busy."
        },
        {
            "text": "During this period, we have:"
        },
        {
            "text": "When the Transition Period ended in January 2021, we took the chance to reflect on our first 5 years and consider what the next 5 should look like."
        },
        {
            "heading": 3,
            "text": "Looking towards the future"
        },
        {
            "text": "As the DDaT Director I could see how much amazing work had been done, but also how we had been quite tactical in growing teams and how processes had emerged. Now we had a moment to be more mindful of how we deliver our work moving forward."
        },
        {
            "text": "The pace of delivery continues to be high, but the fundamentals are now clear: the nature of our trading relationship with the European Union (EU), our Export Strategy and the newly launched Office for Investment. All this and more is clearly set out in DIT’s Outcome Delivery Plan. This means we didn’t need to spend so much time thinking about the ‘what’ but more on the ‘how’."
        },
        {
            "heading": 3,
            "text": "Our new vision"
        },
        {
            "text": "The DDaT team have explored and reflected on how we want to be, as a team working for DIT. We collectively did this through a series of virtual internal workshops, virtual internal ‘DDaT-Fest’ focused team-building activities, and with our stakeholders across the department."
        },
        {
            "text": "We concluded collectively on a simple vision, clear values, and missions. It was important that this would be simple enough for us to remember and use in daily working life as a useful framework. And naturally, we expect to keep iterating and learning as we go on."
        },
        {
            "text": "We have summarised our approach with an infographic:"
        },
        {
            "text": "Most important of all are the values we have collectively agreed to champion and further. They show how much as a team we care about doing the right thing, in the right way:"
        },
        {
            "text": "We came up with them as a team, and together we are going to hold each other accountable to them."
        },
        {
            "text": "We have put additional focus on people development and support because we recognise there are specific needs and challenges in the DDaT professions. Extra focus and resources will be going into:"
        },
        {
            "text": "These will be in addition to the significant work DIT is already doing centrally. For example, there is a strong Diversity and Inclusion team in DIT Human Resources (HR). However, we feel the challenges DDaT professions face are above and beyond those of general DIT roles, so we are putting extra attention on it from our own resources."
        },
        {
            "heading": 3,
            "text": "DDaT’s mission"
        },
        {
            "text": "To try and sum it all up, we’ve set out our mission as follows:"
        },
        {
            "text": "Beneath this lies more detail on Data, Digital, User-Centred Design and Technology Professions which future blog posts will explore."
        },
        {
            "text": "While this strategic approach is long-lasting, we will need to ensure that it remains aligned to the department’s business planning priorities and the Spending Review for financial years 2022-2025 for this period."
        },
        {
            "text": "I would welcome feedback and comments on our approach as we continue to learn, improve and iterate in all that we do."
        }
    ]
}