{
    "url": "https://competitionandmarkets.blog.gov.uk/2022/01/05/secondment-opportunities-for-competition-lawyers-in-2022/",
    "title": "Secondment opportunities for competition lawyers in 2022",
    "authors": [
        "Marianna Filippakopoulou"
    ],
    "categories": [
        "Life at the CMA"
    ],
    "pub_date": "2022-01-05T14:00:42+00:00",
    "content": [
        {
            "text": "We are launching a new round of secondment opportunities for competition lawyers, to start on 7 March 2022."
        },
        {
            "text": "Since its launch in June 2018, more than 40 secondees from over 20 law firms have taken part in the programme and we are now accepting applications for the next round which will start on 7 March 2022."
        },
        {
            "text": "We invite you to consider whether your firm and any of your associates wish to participate."
        },
        {
            "text": "The deadline for applications is Friday, 21 January 2022."
        },
        {
            "text": "We believe our programme offers an exciting opportunity for competition lawyers:"
        },
        {
            "heading": 2,
            "text": "Comments from previous secondees:"
        },
        {
            "text": "\"I have really enjoyed my secondment to the CMA Policy & International team. It has been a valuable opportunity to work with great people in a supportive team on really interesting legislative and policy projects (at a time when there is a lot of change and reform going on!) and I know that I’ll be able to use a lot of the insights I’ve gained when I return to private practice.\""
        },
        {
            "text": "\"Working within the Digital Markets Unit has been fantastic. I am so grateful for the opportunity and have learned a lot. It has been fascinating working on the shaping of future legislation.\""
        },
        {
            "text": "\"I have really enjoyed my secondment at the CMA sitting in the mergers team. I have worked on interesting and complex cases with very clever and friendly colleagues. The secondment programme has also provided me with unique insights and experience in merger control that cannot be replicated anywhere else. My message to competition lawyers in private practice considering whether to apply for the secondment programme: do it. It will be a great experience and you will return to your firm a much better competition lawyer afterwards.\""
        },
        {
            "heading": 2,
            "text": "Application details"
        },
        {
            "text": "Secondments are open to all UK and EU qualified lawyers currently employed in a law firm, and with previous experience working on competition law matters."
        },
        {
            "text": "Additionally:"
        },
        {
            "text": "Firms that would like to put candidates forward should email a CV and covering letter for each candidate by Friday, 21 January 2022 to Simon Harms, Helen Townley, Marianna Filippakopoulou and Michael Speer."
        },
        {
            "text": "As part of their covering letter, candidates should confirm that they are able to start their secondment on 7 March 2022 for a 6 month period."
        },
        {
            "text": "Candidates should also express any preference for particular types of work within the CMA which we will do our best to accommodate, including with a view to maximising a firm’s exposure to different CMA tools among their associates seconded over time."
        },
        {
            "text": "Candidates should be available to have a meeting or call with the CMA during the weeks of either 24 January 2022 or 31 January 2022 to discuss the secondment."
        },
        {
            "text": "Please note we will not consider applications via agencies."
        },
        {
            "text": "If you have any questions or would like to discuss the benefits of the programme, please contact any of Simon Harms, Helen Townley, Marianna Filippakopoulou and Michael Speer."
        },
        {
            "heading": 3,
            "text": "Contact details for secondment programme queries"
        },
        {
            "text": "Simon Harms "
        },
        {
            "text": "Legal Director Simon.Harms@cma.gov.uk 020 3738 6473"
        },
        {
            "text": "Helen Townley"
        },
        {
            "text": "Legal Director Helen.Townley@cma.gov.uk 020 3738 6869"
        },
        {
            "text": "Marianna Filippakopoulou"
        },
        {
            "text": "Legal Adviser Marianna.Filippakopoulou@cma.gov.uk 020 3738 6347"
        },
        {
            "text": "Michael Speer"
        },
        {
            "text": "Legal Adviser Michael.Speer@cma.gov.uk 020 3738 6950"
        },
        {
            "heading": 2,
            "text": "For more information"
        },
        {
            "text": "Find out more about the CMA and the work we do."
        }
    ]
}