{
    "url": "https://cspl.blog.gov.uk/2022/01/05/standards-commission-for-scotland-honesty-and-trust/",
    "title": "Standards Commission for Scotland: Honesty and Trust",
    "authors": [
        "Standards Commission for Scotland"
    ],
    "categories": [
        "Ethical standards"
    ],
    "pub_date": "2022-01-05T14:09:50+00:00",
    "content": [
        {
            "text": "The Standards Commission for Scotland is an independent public body, responsible for encouraging high standards of behaviour by local government councillors and those appointed to the boards of devolved public bodies. Its role is to strengthen ethical standards in public life; including promoting the Codes of Conduct and issuing guidance to councils and devolved public bodies; and to adjudicate on alleged breaches of the Codes of Conduct, and where a breach is found, to apply a sanction."
        },
        {
            "text": "It’s fair to say there has been a great deal of press coverage recently about the honesty of our leaders.  The conduct of politicians and others in public life is under intense scrutiny, with many questions asked of their integrity."
        },
        {
            "text": "Of course, putting a “spin” on matters is seen as part and parcel of politics. There is, however, a difference between highlighting issues or facts to suit your argument (or omitting to talk about ones that don’t) and deliberately and knowingly misleading the public."
        },
        {
            "text": "One of the key principles of public life (commonly known as the ‘Nolan principles’) is honesty. It is a short and simple principle, merely stating that “holders of public office should be truthful”."
        },
        {
            "text": "There is often a feeling amongst many members of the public that politicians exaggerate, dissemble and even lie, which can lead, at best, to indifference and at worst an expectation of dishonesty."
        },
        {
            "text": "So - where is the harm if members of the public generally understand and accept that politicians or others in public life may not always be truthful?"
        },
        {
            "text": "The answer relates to trust. A lack of trust in those in public life does not just affect the reputation of any one individual; it can also erode confidence in public messaging, public bodies and the delivery of public services. Guarding against such an erosion of confidence is especially important during a pandemic or in other times of crisis."
        },
        {
            "text": "Recent polling paints a stark picture – 63% of the public believe that politicians are mainly in politics for themselves [1]. The polls show a steady decline in public trust over the last 77 years – the question was first posed in 1944 – with only 5% of those polled believing our elected officials are in it for the country’s best interests."
        },
        {
            "text": "A loss of trust and confidence in elected officials, and consequently in their messaging, can lead to the spread of misinformation with some people even turning to conspiracy theories. In turn, that can lead to those trying to debunk such theories and ensure prominence of the facts often having to face abuse and mistrust.  As has been noted in the press, mistrust can also affect adherence to the guidelines and rules. If members of the public don’t trust the reasons given for such rules, they are less likely to follow them."
        },
        {
            "text": "So not only is it important that politicians and others in public life are honest, but also that they demonstrate another Nolan principle - that of leadership. The leadership principle asks that holders of public office should exhibit all of the key principles in their own behaviour, and take an active part in promoting them and in challenging poor behaviour where it occurs."
        },
        {
            "text": "“Tone from the top” is a good way to encapsulate this principle – if we have good role models endorsing and promoting high ethical standards in the upper echelons of public life, it is more likely that those high standards will be replicated by those below them."
        },
        {
            "text": "If all those in public life acted with honesty, and embodied the principle of leadership by promoting honesty and challenging falsehoods where they arise, we might see a corresponding increase in public confidence and trust in our elected officials."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": "Find out more about the work of Committee on Standards in Public Life."
        },
        {
            "text": "This blog was first published by the Standards Commission for Scotland and is republished with permission."
        },
        {
            "text": "[1] IPPR paper, Trust issues: dealing with distrust in politics, 5 December 2021"
        }
    ]
}