{
    "url": "https://ukhodigital.blog.gov.uk/2022/01/05/using-design-thinking-to-innovate/",
    "title": "Using design thinking to innovate",
    "authors": [
        "Dave Alexander"
    ],
    "categories": [
        "UKHO",
        "User Experience",
        "User Experience"
    ],
    "pub_date": "2022-01-05T15:15:53+00:00",
    "content": [
        {
            "text": "To explore new ideas in addressing user problems in the maritime industry staff from across the UKHO have recently completed a week-long Innovation Challenge, using the Design Sprint methodology."
        },
        {
            "text": "The organisation welcomed ideas from people all around the business - to solve an established user problem. Ideas were submitted, ranging from, addressing issues facing the user in the maritime sector and ideas that sought improvements, to internal processes. Cross-functional teams were formed around three successful ideas and volunteers from departments across the organisation, including: operations, technology, defence, customer and government. Our Research, Design & Innovation team facilitated the week from initial concept or hypothesis to functional prototype."
        },
        {
            "text": "The winning idea is now being further researched and scoped in a Discovery phase with our User Experience (UX) and Product team, ahead of potential development in 2022."
        },
        {
            "heading": 2,
            "text": "The Design Sprint process "
        },
        {
            "text": "Our UX team were central in setting up and facilitating the week-long design sprint. UKHO colleagues taking part in the Innovation Challenge came from a diverse range of professions and all focused on the core design thinking principles central to a design sprint. For many it was the first experience of working in this collaborative way, testing a hypothesis through the 5 stages of design thinking: empathise, define, design, develop and test."
        },
        {
            "text": "End users were engaged throughout the challenge to greater understand their use cases, pain points and requirements. Teams learned new skills in defining problems, undertaking task analyses and storyboarding, through to running the user testing required to validate if the idea and proposed solution was viable. Stacy Walker, UKHO Government Relationship Manager said"
        },
        {
            "text": "In fact, for many, this was the first time they had worked face-to-face with colleagues in a very long time since the pandemic and this was enhanced by the addition of digital platforms for reaching users, that had now become commonplace."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Innovating for the future"
        },
        {
            "text": "At the UKHO we are committed to innovating to find solutions to our end users’ problems. Enabling our staff to collaborate and take time away from day-to-day work to try something new, to solve problems together, using expertise and discovery to support our values as an organisation. For the week each team had a sponsor from the Executive Leadership team and coaches to ensure they understood how their ideas met user needs, but also helped further the work of the organisation."
        },
        {
            "text": "Our UX team, User Researchers and User Interaction Designers facilitated the event, guiding colleagues through the process and engaging users in designing their solutions. The design sprint enabled quick learning to be gained from users about potential solutions – minimising resource and time taken to achieve insight. It was working with colleagues from around the organisation that Jake Williams, UKHO User Interaction Designer most enjoyed:"
        },
        {
            "heading": 2,
            "text": "Encouraging user-centred problem solving"
        },
        {
            "text": "Innovation and the promotion of user-centred techniques to solve problems are regular parts of the UX team’s role at the UKHO, especially as the landscape of the industry is changing. Undertaking events such as these, helps to encourage customer and user-centred problem solving across our organisation."
        },
        {
            "text": "As we grow, there is currently a vacancy for the role of User Interaction Designer in the UX team, if you are interested in expanding user-centred practices in this innovative working environment find out more and apply now."
        }
    ]
}