{
    "url": "https://space.blog.gov.uk/2022/12/01/a-good-day-in-the-office-four-uk-astronauts/",
    "title": "A good day in the office: four UK astronauts",
    "authors": [
        "Libby Jackson"
    ],
    "categories": [
        "European Space Agency",
        "Events"
    ],
    "pub_date": "2022-12-01T17:09:17+00:00",
    "content": [
        {
            "text": "Last week, the 22 European Space Agency (ESA) member states met in Paris for the three-yearly council meeting at ministerial level.  "
        },
        {
            "text": "Ministers come armed with carefully considered instructions based on extensive discussion and negotiation on where to invest funds most effectively.  "
        },
        {
            "text": "We arrived prepared and confident, testament to the hard work that’s been going on across the UK Space Agency and BEIS as well as other government departments and industry to prepare us for this long-awaited event.  "
        },
        {
            "heading": 2,
            "text": "Time to negotiate "
        },
        {
            "text": "Arriving on a very grey Paris morning, we were hosted at a large venue close to the Eiffel Tower and geared up for a day of negotiations.  "
        },
        {
            "text": "Across the space industry – and the world – it's been a difficult time considering the war in Ukraine, inflation and energy price increases, and these factors came together to present an economic landscape that was difficult for ESA when asking for significant increases in funding from member states. The general notion was that it’s a set of good programmes, but there were concerns that there may not be enough money to go around."
        },
        {
            "text": "As the UK Space Agency’s Head of Space Exploration, it was my job to ensure that Rosalind Franklin, the UK-built Mars rover – which was thrown off course due to cutting ties with Russia over its invasion of Ukraine – was saved, as well making sure that the UK could continue to contribute to other exploration missions such as the International Space Station, the Lunar Gateway and Mars Sample Return.  "
        },
        {
            "text": "I spent a large portion of my time seeking out delegates from Italy, France and Belgium and trying to ascertain their intentions so that we could make the right decisions for the UK. "
        },
        {
            "heading": 2,
            "text": "Successful outcomes "
        },
        {
            "text": "When 5pm came around, it was becoming clear that there were some difficulties in securing money for certain areas of programmes, which would suffer as a result. Exploration was one of these areas, and although there was a collective will to save these missions and find solutions, it was challenging in the financial environments we currently find ourselves in.  "
        },
        {
            "text": "There was a lot of talking that it continued well into the night. In a scene captured by ESA and then further commented on in a tweet from Jonathon Amos, the UK delegation (including me, UK Space Agency CEO Paul Bate and UK Science Minister George Freeman) sat down with colleagues from countries including Italy, Germany, France, Spain and Switzerland.    "
        },
        {
            "text": "After finishing up in the early hours of the morning, everyone had a rough idea in place on what money would go where, so we headed to bed and got up bright and early the next morning to put the money on the table. As is always the case, there were last minute deals and negotiations to be had, some larger than others. "
        },
        {
            "text": "At lunchtime on Wednesday, the ministers all gathered in the meeting room for the last time. Final subscription values were read out, one last sudden pause to iron out a deal in a different programme, and then the job was done. A round of applause from all the delegations was quickly followed by a real sense of satisfaction and relief of a job well done. "
        },
        {
            "text": "Across the entire programme that ESA put to their member states for consideration, there were no projects that had to be cancelled and everything we planned to go forward with was approved to go ahead.    "
        },
        {
            "text": "It was a very successful outcome for the UK, with our key ambitions for Rosalind Franklin, Vigil and TRUTHS all secured, along with a whole host of other contributions that will bring growth, new jobs, and new technologies to all who use space as part of their daily lives. "
        },
        {
            "text": "Read more about the outcomes for the UK here. "
        },
        {
            "heading": 2,
            "text": "UK astronauts "
        },
        {
            "text": "However, it wasn’t the end. The media wanted to know what had been agreed by all the Ministers with ESA, and one announcement still had to be made. "
        },
        {
            "text": "We all gathered to watch the press conference and the announcement of ESA’s astronaut class of 2022. Through the last 18 months, it’s been my job to follow the selection process, and to champion the UK’s interests.  "
        },
        {
            "text": "Behind the scenes, I worked with ESA and other member states before the selection process started, all wanting to open the doors wide, to reach as many people as possible and show that space really is for everyone.  "
        },
        {
            "text": "It was quite a moment, to go from the pressure and gravity of intense negotiations and securing the funding for all the programmes that were important to the UK, to suddenly seeing the first immediate results of our hard work, within hours of those negotiations concluding. The astronauts are the visible beacons that can only exist if the underlying programmes are in place, meaning they have somewhere to live and work. "
        },
        {
            "text": "A countdown, an introduction, and the curtain rose on 17 smiling faces, from right across Europe. It was time to find out who they were, and where they were from. Of these 17 people, there would be career astronauts, who would start working for ESA; reserve astronauts, who would remain in their careers but were fully qualified to head to space; and the world’s first parastronauts. Who was who?  "
        },
        {
            "text": "First to be introduced was John McFall, from the UK. My spine tingled; I applauded as hard as I could. I knew this was an important moment, another small step towards expanding the diversity in the space sector."
        },
        {
            "text": "Another name was added to the list of UK astronauts shortly afterwards, when Rosemary Coogan was confirmed as career astronaut. Cue more clapping and cheering, and more grinning. And Meganne Christan, our reserve astronaut, completed the trio of Brits on the stage."
        },
        {
            "text": "Before the new astronauts had their first encounters with the world’s media, I had the immense privilege to meet them all, tucked away in a backstage room.   "
        },
        {
            "text": "Alongside the Minister, I walked into this small backstage room to meet Rosemary, John and Meganne. There I was, with our current astronaut Tim Peake, our three new astronauts, the Minister, and Dave Parker, ESA’s director of Human and Robotic Exploration – I don’t mind admitting that the magnitude of what we had all achieved as a team, and what it meant, hit me like a steam train and the emotions bubbled up for a moment."
        },
        {
            "text": "As the Minister said a few words I must have been grinning like the Cheshire Cat. I then offered my congratulations. I’m not old enough to have lived through them, but nonetheless it was the stories and images from the Apollo era that captured my imagination when I was young. "
        },
        {
            "text": "However, after Helen Sharman’s flight in 1991, the UK government made it very clear that the UK would not be focusing on human spaceflight, so whilst I studied maths and science, and dreamed of a career working as part of these missions, I understood that this was not something I could ever be a part of in my home country.  "
        },
        {
            "text": "To be able to then walk into a room of four astronauts, one of them being an unconventional and brilliant parastronaut, after being part of the team that signed off on £1.84 billion of deals that are going to do ground-breaking things in the space sector that will benefit everyone through those missions – from better solar weather forecasting to telecommunications – it was a very special moment. "
        },
        {
            "text": "The inspiration these new astronauts can foster, the experiments they can go on to do in their missions, and what the resulting technology will do for the UK positions us as the leading country in exploration for the next decade. "
        },
        {
            "text": "We’re already seeing what a beacon these new astronauts are for the space sector and how much of a positive impact having John on board will have regarding championing everybody. I cannot wait to see what the future will bring."
        },
        {
            "text": "All in all, it was a good day at the office. "
        }
    ]
}