{
    "url": "https://socialcare.blog.gov.uk/2022/12/01/improving-outcomes-through-shared-lives/",
    "title": "Improving outcomes through Shared Lives",
    "authors": [
        "Ewan King",
        "Tom Milnes"
    ],
    "categories": [
        "Care and support",
        "Communities",
        "Leadership",
        "Social care reform"
    ],
    "pub_date": "2022-12-01T14:32:15+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Going for growth"
        },
        {
            "text": "The word ‘growth’ has attracted a bit of negative press in recent months. We have seen growth in bad things: cost of living, instability at home and abroad, and care worker turnover. But I want to talk about good growth, in this case, the growth of Shared Lives."
        },
        {
            "text": "It’s an approach where an adult or young person, who needs long term support, is matched with a carefully approved Shared Lives carer. Together, the person needing support and the Shared Lives carer share the carer’s family and community life."
        },
        {
            "text": "Although Shared Lives has not grown as rapidly in recent years (with the pandemic a contributing factor), it has shown remarkable resilience. Our workforce remains stable, with a 12% turnover amongst scheme workers."
        },
        {
            "heading": 2,
            "text": "What makes a difference?"
        },
        {
            "text": "We highlight some key steps in a new guide on Growing Shared Lives."
        },
        {
            "text": "Leadership commitment: Strong leadership is crucial for any improvement to social care systems. When Tom and I visited the Bradford Shared Lives scheme, we were joined by Strategic Director of Health and Wellbeing, Iain MacBeath. He said:"
        },
        {
            "text": "Making the case for investment: As business cases go, Shared Lives is a good one – it is a proven model for reducing costs and improving outcomes, as well as being the highest rated form of social care, with 96% of all schemes rated ‘Good’ or ‘Outstanding’."
        },
        {
            "text": "Integration: People working in social care sometimes tell me they feel somewhat hidden and easily forgotten - they need to be part of the mainstream social care service. This means raising awareness of Shared Lives within social work teams, so they are on hand to make more referrals."
        },
        {
            "heading": 2,
            "text": "Dedicated focus on carer recruitment"
        },
        {
            "text": "One of the biggest barriers to growth is carer recruitment. There is much to learn from areas leading on recruitment. Joining up with foster agencies can help target potential new carers. Having a dedicated officer focusing on recruitment, can make sure the focus is maintained. Also being part of campaigns ‘bigger than us’, including DHSC’s Made With Care resources."
        },
        {
            "text": "Shared Lives is just one example of the good things happening in social care, but there are plenty of others, many of which are listed in the Directory of Community Centred Support."
        },
        {
            "text": "Right now, our focus is to find ways to reinvigorate Shared Lives and return to an upward trajectory. So next time someone talks about growth, don’t think of all the negatives. Think ‘good growth’, think Shared Lives growth."
        }
    ]
}