{
    "url": "https://buyingforschools.blog.gov.uk/2022/12/01/teaching-vacancies-putting-money-back-into-the-classroom/",
    "title": "Teaching Vacancies: Putting money back into the classroom",
    "authors": [
        "Will Bourke, Outreach and Engagement Manager, Teaching Vacancies"
    ],
    "categories": [
        "Services"
    ],
    "pub_date": "2022-12-01T11:16:30+00:00",
    "content": [
        {
            "text": "Find a job in teaching - Teaching Vacancies - GOV.UK (teaching-vacancies.service.gov.uk)"
        },
        {
            "text": "Will Bourke is the Outreach and Engagement Manager for Teaching Vacancies. Will has thirteen years’ experience of being a teacher, five of which are as a Deputy Headteacher in an 'Outstanding' secondary school. Here he provides an update on the work the team has been doing to reduce the admin and cost burden for trusts when advertising vacancies."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Making it easier and quicker for trusts to fill vacancies"
        },
        {
            "text": "Teaching Vacancies is the free national service for state schools in England to list teaching, leadership, and education support roles. The service is quick and easy to use and 86% of hiring staff would recommend the service to a colleague."
        },
        {
            "text": "The service has been built around user needs and feedback. The team received this ’ask’ from a number of the larger trusts: ‘could we make it even quicker to bulk upload vacancies’?"
        },
        {
            "text": "Over the last six months we have been exploring how we can meet this user need and automate the upload of jobs to Teaching Vacancies through integrating two interfaces."
        },
        {
            "heading": 2,
            "text": "What is ATS integration?"
        },
        {
            "text": "Put simply it is a programme that allows vacancies to be pulled automatically from a Trust’s Application Tracking System (ATS) through to Teaching Vacancies and getting two systems to talk to each other. The aim is to reduce the time it takes for hiring staff to post vacancies, streamline recruitment, and do it with no cost to the trust – all helping put money back into the classroom."
        },
        {
            "heading": 2,
            "text": "Case Study"
        },
        {
            "heading": 2,
            "text": "How to get access"
        },
        {
            "text": "If you are interested in how ATS integration could benefit your multi-academy trust, or would like to find out more about how Teaching Vacancies is able to save schools money on teacher recruitment, please contact william.bourke@education.gov.uk"
        }
    ]
}