{
    "url": "https://companieshouse.blog.gov.uk/2022/12/01/the-register-of-overseas-entities-why-the-verification-process-means-you-should-act-now/",
    "title": "The Register of Overseas Entities: why the verification process means you should act now",
    "authors": [
        "Nick Lindsay, CEO of Elemental",
        "Tobias Latham, solicitor and fellow of the Chartered Institute of Governance"
    ],
    "categories": [
        "Company guidance",
        "Legislative reform"
    ],
    "pub_date": "2022-12-01T09:53:07+00:00",
    "content": [
        {
            "text": "31 January 2023 is fast approaching. This is the deadline when all overseas entities need to have registered with Companies House. The new verification process takes time, so it’s critical that overseas entities register as soon as possible."
        },
        {
            "text": "Overseas entities cannot verify themselves. They must have their details verified by a UK-regulated agent. This is a new requirement and it’s creating challenges in the real estate sector and for UK-regulated agents."
        },
        {
            "heading": 2,
            "text": "What the Register of Overseas Entities is"
        },
        {
            "text": "In August 2022, the UK government, together with Companies House, launched a public Register of Overseas Entities. The move was an important step in the fight against economic crime and was one of several measures taken by the UK in the wake of Putin’s invasion of Ukraine."
        },
        {
            "heading": 2,
            "text": "Time to verify"
        },
        {
            "text": "At Elemental CoSec, we are currently processing hundreds of applications. Each takes a few weeks at least. This means it’s important that all overseas entities act as soon as possible to meet the deadline for registration on 31 January 2023."
        },
        {
            "text": "In this blog post we will look at some of the reasons why applications may take longer than expected."
        },
        {
            "heading": 2,
            "text": "Identifying beneficial owners"
        },
        {
            "text": "Before making an application, an overseas entity must take reasonable steps to identify its registrable beneficial owners or, where there are no beneficial owners, its managing officers."
        },
        {
            "text": "The beneficial owner can be unexpectedly difficult to identify because the rules on identifying beneficial owners are based on the rules around ‘people with significant control’ (PSCs)."
        },
        {
            "text": "Some UK-regulated agents, including Elemental, will provide advice on who the beneficial owner is, but others will expect the overseas entity to have done their own analysis."
        },
        {
            "heading": 2,
            "text": "Gathering information"
        },
        {
            "text": "As part of the reasonable steps to identifying beneficial owners, the overseas entity is required to serve them an information notice under section 12 of the Economic Crime (Transparency and Enforcement) Act 2022. This is the case even if the overseas entity knows who its beneficial owners are."
        },
        {
            "text": "The section 12 notice can help with the information-gathering process, especially for larger and more complex structures. The beneficial owner has up to a month to respond to this notice. Although this timeline can be streamlined, it should be built into your timeframe for registering by 31 January 2023."
        },
        {
            "text": "Information filed on the register must be correct. There are consequences for filing incorrect information. Examples of information required include country of incorporation, registered office, service address, email address, legal form and public register details. For beneficial owners, name, residential address, service address, date of birth, nationality and nature of control are all required."
        },
        {
            "heading": 2,
            "text": "Appointing a UK-regulated agent"
        },
        {
            "text": "Before the overseas entity can make an application to register on the Register of Overseas Entities, the relevant information must be verified by a UK-regulated agent, such as Elemental, which takes time. Some overseas entities have initially struggled to find a UK-regulated agent, so Companies House has provided a list of UK-regulated agents on GOV.UK."
        },
        {
            "heading": 2,
            "text": "UK agent capacity"
        },
        {
            "text": "As of 25 November 2022, there were 4,844 registered overseas entities. However, land registry figures suggest that over 31,000 overseas entities still need to register by 31 January 2023."
        },
        {
            "text": "We are aware that many UK-regulated agents are already struggling with capacity given the complexity of the work. It seems likely that there will be a bottleneck around January 2023. We would recommend that you quickly appoint an agent you’re happy to work with, if you have not already started the process."
        },
        {
            "heading": 2,
            "text": "Providing evidence"
        },
        {
            "text": "The UK-regulated agent will verify your information by obtaining independent evidence. It’s the responsibility of the overseas entity to provide evidence to the regulated agent. If the overseas entity does not provide the required evidence then the UK-regulated agent cannot verify the information."
        },
        {
            "text": "UK-regulated agents will use different processes based on legal requirements. Typically, Elemental requires passports, recent utility bills and signed statements, ideally from a qualified lawyer in the relevant jurisdiction. Other independent professionals may be able to assist but this can make the process slower, as can providing documents in languages other than English. However, where an entity is listed on a public register in English, it can be straightforward."
        },
        {
            "heading": 2,
            "text": "Trust issues"
        },
        {
            "text": "When a trust ultimately owns the overseas entity, the amount of information that needs to be provided increases significantly. The entity needs to provide basic details on the trust and details of all the trustees since the trust was created, as well as each beneficiary and others who may have control over the trustees."
        },
        {
            "text": "This can raise several issues, especially with beneficiaries, who may be:"
        },
        {
            "text": "The issues around verifying trusts can be complex, so allow more time if information about a trust is required."
        },
        {
            "text": " "
        },
        {
            "text": "About the authors"
        },
        {
            "text": "Nick Lindsay is the founder and CEO of Elemental. He is a qualified solicitor and chartered company secretary. Nick began his career at the law firm Olswang (now CMS), and also worked in-house for Visa and BBC Worldwide."
        },
        {
            "text": "Tobias Latham is a qualified solicitor and trained at Linklaters and practiced at Macfarlanes. He has also taught future city lawyers at BPP Law School. He is also a Fellow of the Chartered Institute of Governance."
        },
        {
            "text": "Both authors have presented and written extensively on the Register of Overseas Entities to audiences in the UK and overseas jurisdictions."
        },
        {
            "text": "About Elemental "
        },
        {
            "text": "Elemental is an integrated corporate services provider that specialises in supporting law firms and corporate service providers. They are an independent UK specialist, and the CGI awarded them Service Provider of the Year 2021 and again in 2022. Elemental is the market leader for Register of Overseas Entities services and are advising a number of law firms, corporate service providers and other UK-regulated agents on the new regime."
        }
    ]
}