{
    "url": "https://publicpolicydesign.blog.gov.uk/2022/12/01/the-value-of-public-design/",
    "title": "The value of public design",
    "authors": [
        "Andrew Knight"
    ],
    "categories": [
        "PublicPolicyDesign",
        "Thought leadership"
    ],
    "pub_date": "2022-12-01T12:00:30+00:00",
    "content": [
        {
            "text": "Design is the practice of making and improving things. This is important for governments because their primary business is to make policies and services that provide meaningful outcomes for citizens. Designers take seed ideas and iteratively transform them into the best possible, fully realised outcomes …or in the language of government reform ‘improving real-world outcomes on the ground’."
        },
        {
            "text": "Design is inherently multidisciplinary, but at its core it utilises a common set of skills like problem-solving, empathy and technical skills."
        },
        {
            "text": "There are well established professional branches of design for communication, and industry like architecture and engineering. Over the past 10 years new design practice has emerged, including in the public sector. Initially service design, which has already transformed transactional public digital services. More recently strategic policy design, which seeks to design public sectors or organisations at system-level."
        },
        {
            "text": "Although commercial models of design are useful comparators, they are insufficient for the public sector. What governments do is just more difficult. Whereas industrial innovation or MBA-style models essentially drive to a financial bottom line, the outcomes that governments seek are multifaceted, often including changed public behaviour or equity share across society. Consequently, policy designers work to a triple-bottom line that seeks to understand and make trade-offs against 3 bases: intent (what elected representatives and leading officials want to change in the world), systems (the environment that the policy or service will need to survive and thrive within, including finance, legal, process, stakeholders), and citizens (what do the public need and what will they respond to)."
        },
        {
            "text": "There are 5 important reasons why governments should adopt a design-centred approach to making its policies and services..."
        },
        {
            "heading": 2,
            "text": "Increase public value"
        },
        {
            "text": "The traditional way of making public policy and services is for a policy idea to be implemented, then its impact is tested and reported on. Design turns this on its head, advocating for evidence-led policy policymaking and iteration through a research-design-test-build process. In practice, this guides policymakers to only commit to build or implement once they have confidence that the initiative is deliverable and it will produce the expected effect. This ensures the investment choices that we make as a nation are of the highest quality possible and that they maximise public value and give citizens meaningful outcomes. Perversely, officials often perceive experimental design as high risk, but in fact it is an exercise in controlled risk management through incremental reduction of uncertainty. This kind of design-led risk assurance model already has a foothold at the heart of government through implementation of Sir Michael Barber’s thinking, both in HM Treasury on Public Value Framework and Number 10’s network of delivery units through their ‘deliverology’ model."
        },
        {
            "heading": 2,
            "text": "Make sense of the world"
        },
        {
            "text": "Government increasingly faces complex or wicked problems and opportunities like climate change, Brexit, COVID-19, and place. These can only be effectively addressed if its officials have the capability for navigating complexity and reducing uncertainty. Jonathan Slater says, “Civil servants’ contribution to the blunders of the sort catalogued by King and Crewe will continue until they openly acknowledge their disconnectedness from delivery and the public, as well as the flaws inherent in the dominant Whitehall culture of studied neutrality, and tackle these head-on”. National Audit Office say, “Organisations need to take a whole system approach to achieving government outcomes …our evidence shows that the greatest influence on improvement capability comes from giving people opportunities to innovate, and ensuring that they are clear about how their work benefits the end user.” Design practice provides a holistic, systematic process and toolkit to tackle these issues at the macro-level of systems alongside the micro-level of citizens."
        },
        {
            "heading": 2,
            "text": "Provide government’s multidisciplinary nervous system"
        },
        {
            "text": "It is rare to meet a leader in HM Government who does not advocate for multidisciplinary working. It is seen as essential for delivery of its work. The government’s 2021 declaration on reform states, “We will make sure that the teams devoted to overcoming the most complex public policy challenges are drawn from a range of disciplines and backgrounds, fostering originality and system-wide approaches”. Institute for Government further define the need saying, “The model of ‘generalist’ policy officials is outdated and should be replaced …Building capability to make more effective policy is a matter of combining subject-matter knowledge with the relevant skills to create a high-performing multi-disciplinary team”. But in practice, the selection and use of the right tools and people can be labyrinthine and bewildering for the average official. They are faced with a barrage of terminology, like systems thinking, user centred design, agile project management, amongst a myriad of other competing ideas that are promoted across government. Design practices provide an umbrella framework or mental model to understand the value and place of these approaches in the process of making policies and services. It has a unique cross-cutting function in government because it provides a mechanism for all other professions and functions to constructively collaborate. It provides the lingua franca for everyone to work together."
        },
        {
            "heading": 2,
            "text": "Increase public sector productivity"
        },
        {
            "text": "Sir Michael Barber reported in 2017 that “To maximise the ‘good’ that government can do, demands that government and public services demonstrate their productivity and set out systematically to improve these”. In straightened times, with pressures on headcounts, design is an under-exploited lever for increasing productivity. The prize for organisations that invest in design are tangible and real. The case is strongly made by Innovate UK, and the McKinsey Design Index shows businesses that invest in design outperform their industry counterparts by 200%. Design practices guide officials to focus on delivery and outcomes. It is the most effective way to join-up policy and delivery. The headline, high cost of public policy and services that fail should also be noted (for a list of failures that were made without design expertise see The Blunders of Our Governments). The weakest initial policy ideas are often based on assumption and bias. Design practice recognises the value of using assumptions to get policymaking kick-started, but guides policymakers to quickly and systematically prove or disprove them, so that government’s solutions are grounded in reality, increasing the likelihood they will provide meaningful outcomes for citizens."
        },
        {
            "heading": 2,
            "text": "Build public trust"
        },
        {
            "text": "Finally, there is a broad, less tangible benefit that is nonetheless important. It is about social contract in society. Nesta and IDEO say that although citizens sometimes have declining trust in their government, design thinking can put this relationship “back in balance”. The more that policymakers and citizens work together to make public policies and services, the more transparency and trust there is in society, which improves everyone’s wellbeing and delivers on this social contract. What Works Wellbeing say, “Personal agency, power, responsibility and control are a part of our wellbeing: freedom to choose what we do in our life is the second biggest driver of wellbeing. How organisations work with people to feel control and agency over their lives and communities can make a difference. Joint decision-making encompasses or overlaps with concepts like democracy, devolution, open policy making, community empowerment, co-creation, co-production, inclusion and diversity, voice and accountability, rights, power and responsibilities, agency and control.” Designers are government’s experts on shaping policies and services to respond to citizen need."
        },
        {
            "heading": 2,
            "text": "Imagining a future design-led government"
        },
        {
            "text": "My ambition is for HM Government to make public polices and service in a way that fully exploits the value of design."
        },
        {
            "text": "There are 3 component parts for realising this: championing design, nurturing design skills, and building design infrastructure."
        },
        {
            "text": "Champion design - across the UK public sector this will generate interest and understanding on the value of design for making public policies and services, with a view to attracting more investment in design. By seeking to align design language, proposition and effort of important national stakeholders, the public sector design workforce could have an impact much greater than the sum of its parts."
        },
        {
            "text": "Nurture design skills – this will result in everyone in government being better at making public policy and services. Design skills are important at 3 levels: design basics for everyone, technical design experts, and design leaders. Design basics for everyone include ‘hygiene factor’ fundamentals on end-to-end design and delivery, and multidisciplinary working. When design challenges are too big or difficult for generalist officials to tackle, they need design experts to turn to, so we also need to invest in deep technical skills of designers. Finally, we need to invest in the skills of senior leaders who commission and create the conditions for success for design."
        },
        {
            "text": "Build design infrastructure – to improve the efficacy of people who make public policies and services. The design community will continue to lay down the foundational building blocks for design like theory-to-practice networks with universities, technology to support research and analysis for policymaking, pipelines for design careers, plus identification and exploitation of leverage points for design in the government system."
        }
    ]
}