{
    "url": "https://ukhsa.blog.gov.uk/2022/12/01/world-aids-day-get-tested-get-treated/",
    "title": "World AIDS Day: get tested, get treated",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Sexual health"
    ],
    "pub_date": "2022-12-01T14:40:40+01:00",
    "content": [
        {
            "text": "World AIDS Day (1 December) provides an opportunity to remember those who have died from an AIDS-related illness and show support for those living with HIV."
        },
        {
            "heading": 2,
            "text": "The latest data in England"
        },
        {
            "text": "The latest data shows that whilst new HIV diagnoses in England fell by nearly a third between 2019 and 2021 and transmission of the virus continued to decline among gay, bisexual and other men who have sex with men (GBMSM), the COVID-19 pandemic has slowed progress towards HIV elimination – especially in heterosexual adults."
        },
        {
            "text": "In 2021, there were an estimated 4,400 people unaware of their HIV infection, which is around 5% of all people estimated to be living with HIV in England (95,900). An estimated 1,500 GBMSM were living with an undiagnosed HIV infection compared with 1,100 heterosexual men and 1,500 heterosexual women."
        },
        {
            "text": "HIV prevention hinges on reducing the number of people with a transmissible HIV infection through testing, which in turn will reduce the number of undiagnosed individuals."
        },
        {
            "text": "Gay, bisexual and men with have sex with men should have an HIV test and STI screen at least annually, or every three months if they are having sex without condoms with new or casual partners. Black African men and women are advised to have an HIV test, and a STI screen regularly, if they are having sex without condoms with new or casual partners."
        },
        {
            "heading": 2,
            "text": "Knowing your status"
        },
        {
            "text": "Getting tested is the only way to know if you have HIV, and that knowledge is vital so you can get the right support and treatment for your own health, as well as protect health in local communities."
        },
        {
            "text": "In England, HIV and wider STI testing is free, confidential, and more convenient than ever, including online self-sampling services. This means you can take samples in the comfort and privacy of your own home and then send the kit away to get your results. You can also find a local sexual health service on the NHS website via their sexual health service locator."
        },
        {
            "text": "Gay, bisexual and men who have sex with men (GBMSM) and black African men and women are disproportionately at risk of acquiring HIV, which is why knowing your status is one of the most powerful tools you can have for your own health, and to help in the fight ending HIV."
        },
        {
            "heading": 2,
            "text": "The importance of PrEP"
        },
        {
            "text": "It’s important for those eligible to take up the offer of PrEP (pre-exposure prophylaxis) if you are at risk from HIV (for example having sex with new or casual partners). PrEP is a small tablet that with consistent use can stop someone from getting HIV during sex without condoms."
        },
        {
            "text": "In 2021, 61,092 people started or continued taking PrEP but inequalities in access still exist – London residents, GBMSM and people over 35 are more likely to have a need for PrEP identified, which leaves those outside of London and younger age groups trailing behind the capital."
        },
        {
            "text": "While highly effective at preventing HIV, PrEP won’t protect you against other STIs like chlamydia or gonorrhoea and won’t prevent pregnancy."
        },
        {
            "heading": 2,
            "text": "Getting support"
        },
        {
            "text": "If you are HIV positive, starting treatment early means you can live a full and healthy life and avoid passing on HIV to others."
        },
        {
            "text": "In 2021, an estimated 11,985 people living with HIV had transmissible levels of the virus. Only 37% of these were undiagnosed, the remainder were not in care, not on treatment or had not yet achieved undetectable status. You may have heard the phrase U=U (Undetectable=Untransmissable) used, where HIV levels are extremely low in the blood menaing you’re undetectable or virally suppressed and at this stage, you can’t pass on HIV during sex."
        },
        {
            "text": "Engaging with HIV services and attending appointments will help ensure that you’re on effective treatment – keeping you healthy and keeping detectable levels of HIV in your blood undetectable."
        },
        {
            "text": "Whilst PrEP or an undetectable HIV status has revolutionised sex lives for those at risk from HIV or living with HIV, it's also important to remember other safe sex practices, like using condoms, stop other STIs from spreading."
        },
        {
            "heading": 2,
            "text": "More information on HIV"
        },
        {
            "text": "You can find out more about HIV, testing and treatment on the NHS website. Charities such as the Terrence Higgins Trust also have a wide range of resources and information on HIV and other sexual health issues."
        },
        {
            "heading": 2,
            "text": "More information on STI testing"
        },
        {
            "text": "Read our blog on using a self-sampling STI kit."
        }
    ]
}