{
    "url": "https://environmentagency.blog.gov.uk/2024/10/03/a-day-in-the-life-of-a-fisheries-enforcement-officer/",
    "title": "A day in the life of a Fisheries Enforcement Officer",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Environment Agency",
        "Fisheries and biodiversity"
    ],
    "pub_date": "2024-10-03T12:57:00+00:00",
    "content": [
        {
            "text": "My name is John Groves, and I am a Fisheries Enforcement Officer (FEO) for the Environment Agency in East Anglia."
        },
        {
            "text": "Today I was out on the Norfolk Broads with a fellow Fisheries Enforcement Officer and the Broads Authority checking anglers’ fishing licences."
        },
        {
            "text": "We started at Wroxham where we found two young anglers enjoying their summer holidays on the riverbank. We stopped to see if they had caught anything and asked their ages. One was 13 which meant he needed a fishing licence, which he had. The junior fishing licence is free for those between 13 and 16 years old. The other angler was 12 so therefore didn’t need a licence but he was keen to order one in a few weeks’ time when he turned 13. It’s lovely to see young anglers and interact with them."
        },
        {
            "text": "We then met the ranger from the Broads Authority and went out on patrol in his boat.  We often work together on the Norfolk Broads.  Whilst I make sure everyone is fishing legally, they check boaters have the correct licence for their paddleboards and vessels and ask people to slow down if they are going too fast among other things."
        },
        {
            "text": "We travelled from Wroxham down to Salhouse, keeping our eyes peeled for anglers.  It wasn’t long before we saw an angler, so we approached him on the boat and chatted to him about his catches before checking his licence. He had the correct senior licence and is a regular angler on the broads. It is important to us to build good relationships with the anglers. We continued our journey onto Woodbastwick, where we found two more anglers and were pleased to find they had correct valid licences."
        },
        {
            "text": "Salhouse Broad was our next stop.  We found three more anglers all with valid licences –  two of them were on holiday in Norfolk. It is always nice to see people visiting the Broads from further afield who enjoy fishing.  We moved onto Black Horse Broad but found no anglers before travelling to Horning Broad.  We checked three more anglers who all had valid fishing licences and were pleased to see us out and checking them!"
        },
        {
            "text": "As we had been out patrolling for nearly five hours at this point, we started our return journey back to Wroxham.  We saw another angler who was fishing legally but then the last angler of the day was fishing without a licence, so I issued him with an Offence Report Form (ORF).  While I was completing the details, they purchased a one-day fishing licence (just £7.10) and I added this detail onto the report.  I don’t decide what happens next – this is determined by our Enforcement Once Team and may involve prosecution with a fine up to £2,500.  Fishing without a valid rod licence is a criminal offence and if dealt with by the courts, you’re likely to end up with a criminal record."
        },
        {
            "text": "Is fishing without a licence worth the risk?  No!  A day licence can be as little as £7.10 (the price increases if you are salmon or sea trout fishing) whilst an annual licence starts at £23.80 for a senior and £35.80 for an adult licence. Again, the price can increase depending on how many rods you have and the type of fishing you want to do. The price for a licence is far cheaper than the fine and prevents you from having a criminal record. Income from fishing licence sales is used to fund vital work to improve and protect our fish and fisheries. Income generated is invested directly back into our angling community, improving fish stocks, boosting opportunities for anglers as well as undertaking fisheries enforcement, habitat improvement and fish rescues when needed."
        },
        {
            "text": "Rod licence checking isn’t the only element to my job.  The Environment Agency has a 24-hour 7-days a week incident hotline number which members of the public can use to report any illegal fishing to us - the Hotline number 0800 80 70 60. I am on a roster alongside other FEOs, which means I receive, assess and deal with reports of illegal fishing.  This is an important duty as the public uses our hotline to report fish being taken from rivers and fisheries, illegal nets / traps and more.  Some days are busier than others but whatever plans I had before the phone rings are put to one side as these reports often mean there is a danger to the fishes’ life and welfare."
        },
        {
            "text": "I visit various lakes and fisheries, using intelligence we have gathered or from reports made by members of the public.  Using this intelligence means we can target the locations across East Anglia where anglers are potentially evading the law. I patrol two to four locations a day depending on how many anglers are present and how many licences there are to check.  Recently, I attended a lake and there were 76 anglers, so as you can imagine that took some time to check them all!  I found three fishing without a rod licence and issued each with an Offence Report Form.  Sometimes, an angler will have a valid fishing licence but won’t have it with them, or they panic because they can’t find their digital licence in their emails. This isn’t a problem, because we have a phone app we can use to find a fishing licence as a last resort.  I always advise anglers to have their licence handy before they get on the riverbank, so it’s easy to find if you’re asked for it."
        },
        {
            "text": "When I’m out doing my job, I wear a stab proof vest and a life jacket if I’m out on a boat.  I also carry handcuffs and a baton.  Environment Agency Fisheries Enforcement Officers have the same powers as a Police Constable for the enforcement of the fisheries legislation, including the power of arrest, but thankfully this isn’t something we have to do too often!"
        },
        {
            "text": " The full details for buying a rod fishing licence can be found here: Buy a rod fishing licence: Buy a rod fishing licence for England and Wales - GOV.UK (www.gov.uk). "
        },
        {
            "text": "Subscribe to receive updates from the Environment Agency or follow us on X. "
        }
    ]
}