{
    "url": "https://mhclgmedia.blog.gov.uk/2024/10/03/annual-statutory-homelessness-statistics/",
    "title": "Annual Statutory Homelessness statistics",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Homelessness"
    ],
    "pub_date": "2024-10-03T14:41:51+01:00",
    "content": [
        {
            "text": "This morning, we published our Annual Statutory Homelessness statistics for the financial year 2023-24."
        },
        {
            "text": "It gives a high-level picture of homelessness in England and an analysis of the ways local authorities help prevent homelessness and provide support, including the use of temporary accommodation."
        },
        {
            "text": "The figures show the scale of the challenge we face, with increases in the number of households needing homelessness support from their local authority, record numbers of households in temporary accommodation and rising numbers of rough sleepers."
        },
        {
            "text": "We are taking action with a new dedicated Inter-Ministerial Group chaired by the Deputy Prime Minister which brings together ministers from across government to develop a long-term strategy, working with mayors and councils across the country to get us back on track to ending homelessness once and for all.  "
        },
        {
            "text": "More widely, we are tackling the root causes of homelessness by abolishing Section 21 ‘no fault’ evictions and we are delivering the biggest increase in social and affordable housing in a generation."
        },
        {
            "text": "Minister for Homelessness Rushanara Ali said:"
        },
        {
            "text": "“These numbers are more than just statistics. They show the devastating impact homelessness has on peoples’ lives and it is shocking that so many, including families with children, are spending years without a place to call home."
        },
        {
            "text": "“We are taking action to tackle the root causes of homelessness – not just its symptoms – putting in place lasting solutions rather than quick fixes."
        },
        {
            "text": "“We are reversing the worst housing crisis in living history by building 1.5 million new homes and are changing the law to abolish Section 21 ‘no fault’ evictions – immediately tackling one of the leading causes of homelessness. In addition, we’ve announced a new dedicated cross government group, tasked with creating a long-term strategy to end the disgraceful levels of homelessness.”"
        }
    ]
}