{
    "url": "https://civilservice.blog.gov.uk/2024/10/03/civil-service-mental-health-and-wellbeing-conference/",
    "title": "Civil Service Mental Health and Wellbeing Conference",
    "authors": [
        "Dawn Lennie"
    ],
    "categories": [
        "Health & Wellbeing"
    ],
    "pub_date": "2024-10-03T07:19:05+00:00",
    "content": [
        {
            "text": "Angela MacDonald, HMRC Deputy CEO and Second Permanent Secretary, talks about how the 6th annual Civil Service Mental Health and Wellbeing Conference, plays a vital role in raising awareness and making a meaningful impact on our mental health.  "
        },
        {
            "text": "Angela leads the operational colleagues in HMRC who deliver customer service and compliance and enforcement activity across all taxes. In addition, she is accountable for the transformation and change programmes which ensure the implementation of government policy and a modern, digital tax system."
        },
        {
            "text": "\"Earlier this year I was asked to join the board for the Charity for Civil Servants and have been able to see first hand some of the work they are doing and what a huge role they play in supporting civil servants. Looking after your mental health and wellbeing is something we should think about regularly and invest in. The annual Mental Health and Wellbeing conference aims to kick start conversations and raise awareness about this including how important it is that we support ourselves and others.’\""
        },
        {
            "text": "Building on the success of last year’s conference, in which 13,000 civil servants registered, this year's event includes talks from the OCD, DHSC Men’s Mental Health and the Deaf and Hard of Hearing staff networks. There are also a few external speakers including Sophie Bostock, the Sleep Scientist.  "
        },
        {
            "text": "Dawn Lennie from Government People Group, added; "
        },
        {
            "text": "\"This year we have been sharing ideas to help you navigate life’s daily challenges. Just making some small changes can make a big difference to how we feel. Although you may have seen some of these resources on your intranet, the Charity has included some of the most useful tools on their website. As a Mental Health First Aider, being able to have the Charity for Civil Servants as part of my ‘signposting toolbox’ has been invaluable.\""
        },
        {
            "text": "Jonathan Freeman, CEO of the Charity, explained"
        },
        {
            "text": "\"Times are particularly tough for so many people in our Civil Service community at the moment. We want to do everything we can to be there for civil servants when they might be struggling and need some help. That’s why this Conference is so important. We can only continue to provide our support for all civil servants, past and present, and their families with your help. Why not take a look at the Charity’s website and find out how you can get involved?\""
        },
        {
            "text": "Angela concludes by saying \"I believe that we all bring our whole selves to work, and that includes our mental health. One of the many things we can take pride in while working for the Civil Service is the value we attach to looking after ourselves and each other\""
        },
        {
            "text": "The Mental Health and Wellbeing Conference, hosted by the Charity for Civil Servants, is open to all civil servants from 7th - 11th October. The majority of the sessions will be pre-recorded and will be available to watch on the Charity’s website if you are unable to join. To register for the Conference, visit the Charity for Civil Servants’ website."
        }
    ]
}