{
    "url": "https://ipo.blog.gov.uk/2024/10/03/dame-carol-robinson-pioneering-mass-spectrometry-in-biomedical-research/",
    "title": "Dame Carol Robinson – pioneering mass spectrometry in biomedical research",
    "authors": [
        "Nathan Llewellyn"
    ],
    "categories": [
        "Business",
        "Europe",
        "Inclusion and diversity",
        "Innovation",
        "International",
        "IP research",
        "Patents",
        "STEM career"
    ],
    "pub_date": "2024-10-03T15:19:48+01:00",
    "content": [
        {
            "text": "British chemist, Professor Dame Carol Robinson (DBE FRS FMedSci) has received the honour of being the first British person to be presented with the European Patent Office (EPO) Lifetime Achievement Award at the European Inventor Awards in Malta."
        },
        {
            "text": "Carol was recognised for her 'extensive contributions to blood analysis and drug development and a career that has broken new ground in biochemical research’.  She is a pioneer in the field of mass spectrometry and has several patents to her name. Her work has led to significant advances in the discovery of new drugs and personalised, targeted medicine. "
        },
        {
            "text": "As the first British recipient of the prestigious Lifetime Achievement Award, Carol Robinson’s career exemplifies a deep commitment to scientific discovery, innovation, and fostering diversity in STEM."
        },
        {
            "text": "Mass spectrometry and biomedical innovation"
        },
        {
            "text": "Mass spectrometry, a technique at the core of Robinson’s work, enables scientists to analyse molecules such as proteins by measuring their mass and interactions. This tool has become pivotal in understanding how proteins behave in various disease states, specifically by detecting abnormal protein interactions that may signify disease development. Robinson explains that mass spectrometry allows researchers to examine proteins’ “clumping” behaviour. This can indicate changes in molecular interactions that could be precursors to conditions such as neurodegenerative diseases or cancer."
        },
        {
            "text": "Robinson’s work focuses on examining these molecular structures intact, avoiding the high-energy fragmentation that often characterises traditional mass spectrometry methods. By preserving protein interactions, her research has provided new insights into disease mechanisms, particularly in diseases where proteins aggregate or interact abnormally. Her team’s ability to gently probe these interactions has led to the identification of potential drug targets. This significantly impacts biomedical research and health outcomes."
        },
        {
            "text": "A lifetime of achievement and contributions"
        },
        {
            "text": "Robinson’s scientific journey began with a chance encounter at Pfizer, where she took a job as a laboratory technician at the age of 16. Despite having no prior knowledge of mass spectrometry, she was drawn to the complexity and hands-on nature of the technology. As Robinson progressed in her career, she developed a passion for the technique and dedicated her work to uncovering its full potential. Robinson went on to study chemistry at Swansea, Oxford and Cambridge universities."
        },
        {
            "text": "The significance of her research is not only recognised through prestigious awards but also through practical applications in the healthcare sector. Robinson co-founded OMass Therapeutics, a spin-out company based on her lab’s research that has successfully raised over $100 million in investment. The company holds multiple patents and focuses on translating mass spectrometry innovations into new therapies for unmet medical needs. This achievement underscores the real-world impact of Robinson’s work and her dedication to bridging the gap between laboratory research and clinical application."
        },
        {
            "text": "The role of intellectual property in scientific advancements"
        },
        {
            "text": "Robinson’s work is also a powerful testament to the role intellectual property (IP) plays in driving innovation. While initially finding the process of filing patents to be a task, she soon recognised the critical importance of IP protection in securing investment and ensuring that discoveries could be commercialised."
        },
        {
            "text": "That company, OMass Therapeutics, has benefited enormously from a robust patent portfolio, which attracted investors and helped the company develop a competitive edge. Robinson’s experience highlights the importance of IP in research, particularly in STEM fields. This is an area where turning academic findings into tangible healthcare solutions often requires significant financial backing."
        },
        {
            "text": "Advocating for women in STEM"
        },
        {
            "text": "Beyond her scientific achievements, Carol Robinson is a vocal advocate for women in STEM. Her own career trajectory serves as an inspiration for young women pursuing science, particularly in fields like chemistry where women have historically been underrepresented."
        },
        {
            "text": "Robinson’s research group, which maintains an equal gender balance, exemplifies her commitment to diversity and inclusion. She believes that diverse teams make better decisions and contribute to more innovative solutions. Her leadership in advocating for women and minorities in STEM extends beyond her lab, influencing broader conversations about gender equality in scientific research."
        },
        {
            "text": "The future of mass spectrometry and drug discovery"
        },
        {
            "text": "Looking forward, Robinson remains excited about the future of mass spectrometry and its potential to revolutionise drug discovery. Her lab is now focused on exploring new directions, particularly in understanding the molecular differences in tissues affected by disease. These discoveries could lead to the identification of new drug targets, helping to address diseases that currently lack effective treatments."
        },
        {
            "text": "Robinson’s contributions to science have not only advanced the field of mass spectrometry but have also paved the way for future generations of scientists. Her ability to blend academic research with practical applications in drug development continues to inspire and push the boundaries of what is possible in biomedical research."
        },
        {
            "text": "Carol Robinson’s remarkable career serves as an inspiring case study in perseverance, innovation, and the power of interdisciplinary collaboration. Through her pioneering work in mass spectrometry, Robinson has had a lasting impact on both science and medicine, while creating more opportunities for women in STEM. As she continues to explore new frontiers in research, her work promises to unlock new possibilities for the diagnosis and treatment of diseases. This has the potential to benefit people across the world."
        }
    ]
}