{
    "url": "https://marinescience.blog.gov.uk/2024/10/03/early-adoption-of-remote-electronic-monitoring-on-uk-fishing-vessels/",
    "title": "Fish, Camera, Action: Early adoption of Remote Electronic Monitoring on UK fishing vessels ",
    "authors": [
        "Ross Robertson",
        "Martin Arris",
        "Rebecca Skirrow",
        "Thomas Catchpole"
    ],
    "categories": [
        "AI",
        "data",
        "Fisheries",
        "Monitoring",
        "Policy",
        "Science",
        "Technology"
    ],
    "pub_date": "2024-10-03T09:22:31+01:00",
    "content": [
        {
            "text": "Authors: Ross Robertson (Defra), Martin Arris (MMO), Rebecca Skirrow (Cefas) and Thomas Catchpole (Cefas)"
        },
        {
            "heading": 2,
            "text": "What is REM and what are our plans?  "
        },
        {
            "text": "Remote Electronic Monitoring, or REM for short, is a data collection tool that can be installed on vessels to collect information on fishing activities and catches. A REM system typically consists of sensors and cameras collecting various data (video, GPS etc.), that can then be interpreted to generate information on when and where a vessel is fishing and what it is catching.  "
        },
        {
            "text": "The Department for Environment, Food and Rural Affairs (Defra)’s vision, underpinned by the Fisheries Act (2020) and the Joint Fisheries Statement, is for fully documented fisheries ensuring a well-evidenced, sustainable future for the fishing industry. As part of delivering this, Defra plans to expand the use of REM in English waters over the next five years. The introduction of REM, initially in selected priority fisheries, demonstrates Defra’s commitment to addressing data gaps and concerns that have been highlighted in relation to fishing activity in English waters. Working with ‘early adopters’ in each priority fishery will enable us to refine our objectives for using REM, and the approaches which work best for fishers allowing us to meet our data needs. "
        },
        {
            "text": "The information delivered through REM will support the long-term profitability of the sector and help to build the UK’s food resilience and security, as well as providing invaluable data on fishing activity. "
        },
        {
            "heading": 2,
            "text": "The First Step – The Early Adopter Phase "
        },
        {
            "text": "The Defra Group has started work with our first early adopter vessel within the large pelagic trawl fishery: the Frank Bonefaas. This is the largest vessel in the UK fleet, primarily targeting mackerel, herring and blue whiting."
        },
        {
            "text": "The installation of the REM system aboard the Frank Bonefaas took place over 18 days, split into 2 periods between June and August this year. The installation was led by expert delivery partners from Centre for Environment Fisheries and Aquaculture Science (Cefas) and Marine Management Organisation (MMO), along with support from specialist engineers, TecMarine, and the North Atlantic Fisheries Company (NAFC) - owners of the vessel. Following the completion of the installation, the vessel set sail for its maiden REM voyage."
        },
        {
            "text": "The aim of this early adopter phase is to test and refine the REM monitoring objectives for this fishery, particularly concerning analysing the full catch and observing any interactions with sensitive species. It also allows us to build our capacity to deliver the wider programme to maximise the benefits of REM and make sure it’s use is based on any lessons learned."
        },
        {
            "heading": 2,
            "text": "A Collaborative Effort"
        },
        {
            "text": "The success of this first installation is thanks to the collaboration between Defra, Cefas and the MMO, along with support from specialist engineers, TecMarine, and the North Atlantic Fisheries Company."
        },
        {
            "heading": 2,
            "text": "The Next Steps"
        },
        {
            "text": "This is the first step of our journey towards the implementation of REM across five priority fisheries over the next five years. We aim to begin working with vessels from the second priority fishery in 2025, and then each year with the next priority fishery. During this time, we will continue to refine our approaches and ways of working to ensure that when mandatory REM requirements are introduced, these are fit for purpose."
        },
        {
            "text": "Once monitoring objectives have been finalised and the REM systems are demonstrated to be working well, REM systems will become mandatory for all vessels in those fisheries – including non-UK vessels."
        }
    ]
}