{
    "url": "https://forestrycommission.blog.gov.uk/2024/10/03/into-the-woods-fungi-season-in-streatham-common/",
    "title": "Into the woods: fungi season in Streatham Common",
    "authors": [
        "Emily Robinson"
    ],
    "categories": [
        "Into the woods series",
        "Nature"
    ],
    "pub_date": "2024-10-03T08:45:00+01:00",
    "content": [
        {
            "heading": 2,
            "text": "An impulsive move"
        },
        {
            "text": "I still remember the first time I visited Streatham Common - I was working on a project to improve habitats for amphibians in London. I was sent to Streatham to assess the site for interventions to secure a stronghold for smooth newts, common frogs and toads. We also aimed to install holding ponds to prevent the small, sloped woodland from becoming a muddy mess in the winter. It was 2020, mid-pandemic, so off I went in an Uber, face mask and hand sanitiser in tow."
        },
        {
            "text": "Compared to my cramped council estate which I’d been confined to for most of the first lockdown, this tiny patch of urban woodland felt like freedom. I imagined walking my dog among the trees, free from the anxiety of roads and listening to birdsong. I lingered for hours, enchanted by the sound of a saxophonist playing amidst the trees as I explored the different nooks, feeling the pull of these towering giants. "
        },
        {
            "text": "I could not believe this was what London could feel like, so a month later I made an impulsive decision; I packed up and moved next door to this newly discovered haven."
        },
        {
            "heading": 2,
            "text": "Distractions and yearning"
        },
        {
            "text": "Living near the woods made the woes of the pandemic somewhat tolerable. The trees offered relief from anxiety and depression; every time I was there I felt as though they were pillars, holding me up during that difficult period. I learned to navigate the muddy trails and followed my dog, Gatsby, admiring how intimately he knew the oaks, greeting each with a sniff and a wee. Oddly through this, I felt a yearning that I too, needed to know these trees on a deeper level (though as a human, perhaps not through a sniff and wee)."
        },
        {
            "text": "Learning from Gatsby, I began slowing down. I stopped to observe each tree with care and noticed fungi everywhere in the autumn. How had I missed these strange beings all my life? I had to know more."
        },
        {
            "heading": 2,
            "text": "Seeing the woods for the fungi"
        },
        {
            "text": "The fungi constantly teach me new things. I discovered that when fungi cause parts of a tree to die, it is not always harmful. Heartwood rot can make trees sturdier and better able to withstand winds. Fungi softens wood for woodpeckers to carve out nests, and later as the cavities expand and the woodpeckers move out, the bats can move in, and then the owls. I realised that trees, aided by fungi, are entire ecosystems in themselves."
        },
        {
            "text": "I learned to appreciate the messiness of autumn leaves, understanding that death creates life and imperfections in trees foster tiny worlds. The constant interaction between fungi and trees, above and below ground has revealed to me just how alive and nourishing our woodlands truly are. I no longer walk through them mindlessly - everything has become multidimensional."
        },
        {
            "text": "I now lead fungi walks to help others experience this same revelation. For three years, I've been compiling lists of the fungi I have identified, continually learning and discovering new species. Each specimen sparks my curiosity and I share my lists annually with the park’s management. These lists have revealed the rich biodiversity in a small area and have influenced woodland management; dead wood is now keenly kept on site, which also saves on removal costs."
        },
        {
            "heading": 2,
            "text": "Interconnectivity"
        },
        {
            "text": "Fungi season begins progressively later each year, a clear sign of our changing climate. Becoming attuned to the weather has made it impossible to ignore the deep cracks in the ground during summer droughts, while autumn brings an anxious wait for rain. This awareness of fungi has heightened my connection to nature, a full-circle journey for a city girl now deeply in tune with the land."
        },
        {
            "text": "I have noticed that different woodlands are often interconnected, even when they are far apart. When I visit a new woodland and find a specific fungus that I know is also present in my own woodland, it is a good indicator that I will likely spot it in my area within the week. This interconnectedness shows how fragmented patches of habitat are all part of a whole that used to exist without the divides of our cities and towns. Each of our green spaces can help us to better understand and foster our relationships with the landscapes closest to us."
        }
    ]
}