{
    "url": "https://healthmedia.blog.gov.uk/2024/10/03/update-to-the-raac-list/",
    "title": "Update to the RAAC list",
    "authors": [
        "DHSC Media Team"
    ],
    "categories": [
        "New Hospital Programme",
        "Uncategorized"
    ],
    "pub_date": "2024-10-03T09:18:12+01:00",
    "content": [
        {
            "text": "*Updated on 3 October 2024*"
        },
        {
            "text": "This fact sheet sets out our position on the presence of reinforced autoclaved aerated concrete (RAAC) in the NHS. RAAC is a lightweight form of precast concrete, frequently used in public sector buildings in the UK from the mid-1950s to the mid-1990s."
        },
        {
            "text": "A Department of Health and Social Care spokesperson said:"
        },
        {
            "text": "“We have inherited a broken NHS, with many hospitals in a state of disrepair, meaning patients have not been able to access the care they so desperately need."
        },
        {
            "text": "“We are committed to fully removing RAAC from the NHS estate whilst working to keep facilities open, with patient safety at the forefront."
        },
        {
            "text": "“Repairing and rebuilding our crumbling hospital estate is a vital part of our ambition to create an NHS that is fit for the future through our Ten-Year Health Plan.”"
        },
        {
            "text": "Q&A"
        },
        {
            "text": "How many sites are affected?"
        },
        {
            "text": "Which new hospitals have been added to the list?"
        },
        {
            "text": "Why has RAAC been identified at further NHS sites since February 2024?"
        },
        {
            "text": "What about the worst affected sites?"
        },
        {
            "text": "What kind of mitigations are in place?"
        },
        {
            "text": "Why is your approach different to schools?"
        },
        {
            "text": "Could there be instances of RAAC in hospitals that you are not yet aware of?"
        },
        {
            "text": "What exactly is the NHS doing to make sure hospitals are safe for staff and patients?"
        },
        {
            "text": "What about other parts of the health estate – for example, GPs/primary care services?"
        }
    ]
}