{
    "url": "https://food.blog.gov.uk/2025/10/16/a-message-from-fsa-chair-susan-jebb-3/",
    "title": "A message from FSA Chair Susan Jebb",
    "authors": [
        "Professor Susan Jebb, FSA Chair"
    ],
    "categories": [
        "Our mission"
    ],
    "pub_date": "2025-10-16T12:52:04+01:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "heading": 3,
            "text": "Driving innovation in food safety: launching the FSA’s Market Access Innovation Research Programme"
        },
        {
            "text": "I was pleased to speak recently at the launch of the FSA’s new Market Access Innovation Research Programme, alongside Science Minister Lord Vallance. The programme has been designed to strengthen the FSA’s capabilities in regulating the emerging food technologies that are reshaping the food system, with a particular focus on precision fermentation. It will support safe, sustainable innovation, helping the FSA build the specialist expertise needed to assess novel products and provide clear guidance to innovators and investors who want to sell their foods in the UK."
        },
        {
            "text": "At the FSA, our mission is to ensure food is safe, authentic, and trustworthy – no matter how it’s made. We need to keep pace with innovation which means streamlining our processes, applying risk-based approaches, and ensuring our regulation supports public health and economic growth."
        },
        {
            "text": "We’re already making progress. From piloting blockchain for supply chain transparency to developing AI tools that help local authorities prioritise food hygiene inspections, we’re embracing technology to improve how we work. Our regulatory sandbox for cell-cultivated products is another example of how we’re enabling safe innovation while expanding consumer choice."
        },
        {
            "text": "We’ve been very clear that public safety remains our top priority. Our work on new technologies is designed to accelerate our knowledge about these products, not our safety assessment. Our evidence-based approach will continue to ensure that every novel food technology is rigorously assessed for safety and authenticity before it reaches the market and we will consider the consumer interest and hold a public consultation for each new product."
        },
        {
            "text": "As a non-ministerial department, we’re uniquely positioned to convene across government and industry, and to make sure that consumer interests remain at the heart of innovation. The launch of this programme reflects our belief that innovation and public protection must go hand-in-hand."
        },
        {
            "text": "If you would like to stay up to date with the latest news form the FSA, you can sign up here."
        },
        {
            "heading": 1,
            "text": "Neges gan Susan Jebb, Cadeirydd yr ASB"
        },
        {
            "heading": 3,
            "text": "Ysgogi arloesedd mewn diogelwch bwyd: lansio rhaglen ymchwil arloesedd yr ASB ym maes mynediad i’r farchnad"
        },
        {
            "text": "Roeddwn i’n falch o siarad yn ddiweddar wrth i’r Asiantaeth Safonau Bwyd (ASB) lansio ei rhaglen ymchwil arloesedd newydd ym maes mynediad i’r farchnad, ochr yn ochr â’r Gweinidog Gwyddoniaeth, yr Arglwydd Vallance. Mae’r rhaglen wedi’i chynllunio i gryfhau galluoedd yr ASB wrth reoleiddio’r technolegau bwyd sy’n dod i’r amlwg ac sy’n ail-lunio’r system fwyd, gan ganolbwyntio’n benodol ar eplesu manwl. Bydd yn cefnogi arloesedd diogel a chynaliadwy, gan helpu’r ASB i feithrin yr arbenigedd sydd ei angen i asesu cynhyrchion newydd a darparu canllawiau clir i arloeswyr a buddsoddwyr sydd am werthu eu bwydydd yn y DU."
        },
        {
            "text": "Yn yr ASB, ein cenhadaeth yw sicrhau bod bwyd yn ddiogel, yn ddilys, ac yn ddibynadwy – ni waeth sut y caiff ei wneud. Mae angen i ni gadw’n wastad ag arloesedd, sy’n golygu symleiddio ein prosesau, cymhwyso dulliau sy’n seiliedig ar risg, a sicrhau bod ein gwaith rheoleiddio’n cefnogi iechyd y cyhoedd a thwf economaidd."
        },
        {
            "text": "Rydym eisoes yn gwneud cynnydd. O dreialu technoleg cadwyn flociau (‘blockchain’) ar gyfer tryloywder yn y gadwyn gyflenwi i ddatblygu offer deallusrwydd artiffisial sy’n helpu awdurdodau lleol i flaenoriaethu arolygiadau hylendid bwyd, rydym yn croesawu technoleg i wella sut rydym yn gweithio. Mae ein blwch tywod rheoleiddiol ar gyfer cynhyrchion a wneir drwy feithrin celloedd yn enghraifft arall o sut rydym yn galluogi arloesedd diogel wrth ehangu dewis defnyddwyr."
        },
        {
            "text": "Rydym wedi bod yn glir iawn mai diogelwch y cyhoedd yw ein blaenoriaeth gyntaf o hyd. Bwriad ein gwaith ar dechnolegau newydd yw cynyddu ein gwybodaeth am y cynhyrchion hyn, nid cyflymu ein hasesiadau diogelwch. Bydd ein dull sy’n seiliedig ar dystiolaeth yn parhau i sicrhau bod pob technoleg bwyd newydd yn cael ei hasesu’n drylwyr am ddiogelwch a dilysrwydd cyn iddi gyrraedd y farchnad, a byddwn yn ystyried buddiannau defnyddwyr ac yn cynnal ymgynghoriad cyhoeddus ar gyfer pob cynnyrch newydd."
        },
        {
            "text": "Fel adran anweinidogol, rydym mewn sefyllfa unigryw i alw’r llywodraeth a’r diwydiant ynghyd, ac i sicrhau bod buddiannau defnyddwyr yn parhau i fod wrth wraidd arloesedd. Mae lansio’r rhaglen hon yn adlewyrchu ein cred bod yn rhaid i arloesedd a diogelu’r cyhoedd fynd law yn llaw."
        },
        {
            "text": "Os hoffech chi gael y newyddion diweddaraf gan yr ASB, gallwch chi gofrestru yma."
        }
    ]
}