{
    "url": "https://socialcare.blog.gov.uk/2025/10/16/adult-social-care-nurse-prescribing-pilot/",
    "title": "Adult Social Care Nurse Prescribing Pilot",
    "authors": [
        "Deborah Sturdy"
    ],
    "categories": [
        "Care and support"
    ],
    "pub_date": "2025-10-16T09:32:55+00:00",
    "content": [
        {
            "text": "Upskilling Adult Social Care Nurses"
        },
        {
            "text": "DHSC has made £461,000 available for the Adult Social Care (ASC) Nurse Prescribing Pilot, to fund nurses across the country to undertake an Nursing and Midwifery Council (NCM) approved prescribing qualification. This will qualify them to prescribe medicines within their ASC setting and provide nurses with credits towards the advanced practice Masters."
        },
        {
            "text": "Following an Expression of Interest process, we have selected the following 6 Integrated Care Boards (ICBs) to take part in this pilot:"
        },
        {
            "text": "Upskilling nurses in ASC is fundamental to improving practice, achieving better outcomes for the people we support and reducing avoidable hospital admissions. I am delighted that we received a fantastic response from ICBs to take part in the Pilot. The calibre of applications was outstanding, and I am very much looking forward to working closely with the six ICB Chief Nurses to help make this pilot a success."
        },
        {
            "text": "Throughout the pilot, we will be measuring the impact of increasing the number of nurses with prescribing qualifications on the sector and whether this leads to improved outcomes for those being cared for, supports safe discharge, and contributes towards addressing capacity issues, by freeing up clinicians’ time and streamlining care delivery."
        },
        {
            "text": "This initiative marks an important milestone on the journey towards advanced practice in social care nursing. It aligns with the NMC work on Advance Practice and the work of the Queen's Institute of Community Nursing on standards for social care nursing. "
        },
        {
            "text": "This pilot follows Skills for Care's undergraduate placement strategy for social care nursing published in July, funded by DHSC. This strategy is designed to provide students with placements in social care to enhance their knowledge and clinical skills in a supportive environment. By embedding learning in practice we're helping to shape a nursing workforce that is better informed, highly skilled and truly person-centred.  At the same time, we are encouraging students and professionals alike to see social care as a rewarding area of specialist practice. "
        },
        {
            "text": "This pilot sits alongside a series of measures the government has announced to support the strengthening of a professionalised social care workforce and provide more opportunities for learning and development."
        },
        {
            "text": "If successful, the pilot could pave the way for more adult social care nurses across the country to be offered the qualification, recognising the critical role they will play in the delivery of neighbourhood health services."
        }
    ]
}