{
    "url": "https://aphascience.blog.gov.uk/2025/10/16/aphas-salmonella-lab/",
    "title": "Science in action: how APHA’s Salmonella lab protects what we eat",
    "authors": [
        "Francesca Martelli"
    ],
    "categories": [
        "Bacterial diseases"
    ],
    "pub_date": "2025-10-16T09:00:00+01:00",
    "content": [
        {
            "text": "APHA’s Lead Scientist for Bacterial Diseases and Food Safety, Dr Francesca Martelli, spotlights Salmonella’s stealthy spread and its impact on animal and public health, diagnostics, and disease control strategies."
        },
        {
            "heading": 2,
            "text": "World Food Day – 16 October 2025"
        },
        {
            "text": "Every year on 16 October, World Food Day reminds us of the vital role food plays in our health, communities, and global sustainability. At the Animal and Plant Health Agency (APHA), this day is more than symbolic, it is a celebration of the science and dedication that goes into keeping our food supply safe. From the lab bench to the farm gate, our teams work tirelessly to protect public health by tackling threats like Salmonella."
        },
        {
            "text": "In this blog, I will take you behind the scenes of our Science Directorate to explore how APHA safeguard livestock and, in turn, the food on your plate."
        },
        {
            "heading": 2,
            "text": "From pets to public health: a vet’s journey"
        },
        {
            "text": "When I began training as a veterinarian, I imagined a future caring for pets in a small animal practice. But, during my studies, I discovered a deeper calling: the role vets play in public health. I became fascinated by zoonotic diseases (those shared between animals and humans) and how controlling them can protect entire communities."
        },
        {
            "text": "Food has always been a personal passion, so I decided to specialise in microorganisms that cross the animal-human barrier through food. I have been working on Salmonella for over 15 years now, and it still surprises me! There is always more to learn about this complex and resilient bacterium."
        },
        {
            "heading": 2,
            "text": "What is Salmonella?"
        },
        {
            "text": "Salmonella has been with us for millennia, evolving alongside humans and animals since the Neolithic shift from foraging to farming. Today, we can identify over 2,700 types based on their surface structures, and that number keeps growing."
        },
        {
            "text": "All Salmonella types have the potential to infect both animals and people. Transmission can occur through direct contact, contaminated materials and, most commonly, food."
        },
        {
            "text": "Most of us have heard of Salmonella, or even experienced it first-hand. In healthy individuals, infection is usually confined to the gastrointestinal tract and resolves on its own. But for vulnerable groups, such as young children, the elderly, or those with weakened immune systems, Salmonella can pose a much greater risk."
        },
        {
            "text": "In these cases, the bacterium can move beyond the gut, entering the bloodstream and lymphatic system, leading to an infection through the entire body. Symptoms may include high fever, joint pain, and severe fatigue, and treatment might require antibiotics to prevent further complications."
        },
        {
            "heading": 2,
            "text": "Salmonella and the food chain: why “One Health” matters"
        },
        {
            "text": "Salmonella does not just affect people, it is a shared challenge between animals, humans, and the environment. Animals can become infected in several ways: they may acquire it from their parents before birth, pick it up through contact with other infected animals (or even people), or encounter it in contaminated surroundings."
        },
        {
            "text": "This interconnected cycle is known as the One Health approach, a concept that recognises the link between human, animal, and environmental health. Getting it right is essential to keeping our food safe."
        },
        {
            "text": "When an animal is infected, its products, like meat and eggs, can become contaminated. This can happen at the farm or later along the food chain. That is why abattoir hygiene is critical: it is a frontline defence in preventing contamination before food reaches our plates."
        },
        {
            "text": "But the responsibility does not end there. Safe food handling at home is just as important. Avoiding cross-contamination and cooking food thoroughly are simple yet powerful steps we can all take to protect ourselves and our families."
        },
        {
            "heading": 2,
            "text": "Safeguarding livestock, securing food"
        },
        {
            "text": "Healthy livestock is the foundation of safe food. At APHA, we work with the private sector and global partners to prevent and control Salmonella outbreaks."
        },
        {
            "text": "Our research spans multiple livestock sectors, including poultry and pigs. We investigate practical solutions to stop Salmonella from entering farms and spreading within them. For example, we test disinfectants in real-world conditions on farms and in lab-designed models to evaluate their effectiveness."
        },
        {
            "text": "We also support farmers in clearing infections by offering targeted sampling and expert advice. Salmonella can persist in the farm environment, surviving in a dormant state. Identifying these hidden hotspots is key to eradication, and our specialists are skilled at this microbial detective work."
        },
        {
            "text": "We keep abreast of the latest technology, for example using whole genome sequencing (a way of obtaining the full genetic code of each Salmonella isolate). By analysing the full genome, we gain deep insights into the epidemiology of infection, understanding how it spreads, mutates, and clusters. This level of detail empowers us to pinpoint where outbreaks are most likely to occur, so we can respond swiftly and effectively."
        },
        {
            "heading": 2,
            "text": "Global collaboration for a safer future"
        },
        {
            "text": "Our laboratory is one of just six worldwide accredited by the World Organisation for Animal Health (WOAH). Through this role, we collaborate with international reference labs, host visiting scientists, and conduct joint research projects."
        },
        {
            "text": "This global exchange of knowledge strengthens our collective fight against Salmonella. Personally, I find international work especially rewarding as it broadens our perspectives and connects us with passionate professionals around the world."
        },
        {
            "heading": 2,
            "text": "Teamwork at the heart of Salmonella reference lab activities"
        },
        {
            "text": "At APHA’s national and international reference laboratory for Salmonella, our greatest asset is our people. Every individual brings a unique set of skills and expertise that powers our mission to protect public health."
        },
        {
            "text": "From scientists working hands-on with Salmonella in the lab, to molecular biologists decoding its genome, to veterinarians offering guidance on farms and beyond, our strength lies in our team. It is this multidisciplinary teamwork that drives innovation and impact."
        },
        {
            "text": "We are proud of the work we do and the difference it makes: safeguarding food, supporting livelihoods, and protecting the health of animals and people alike."
        }
    ]
}