{
    "url": "https://naturalengland.blog.gov.uk/2025/10/16/celebrating-green-infrastructure-progress-major-mapping-database-update-launched/",
    "title": "Celebrating Green Infrastructure Progress: Major Mapping Database Update Launched",
    "authors": [
        "Martin Moss"
    ],
    "categories": [
        "Connecting People with Nature",
        "Development",
        "Mapping",
        "Natural England",
        "Nature",
        "Science and evidence"
    ],
    "pub_date": "2025-10-16T14:49:21+01:00",
    "content": [
        {
            "text": "By Martin Moss, Senior Officer - Green Infrastructure Mapping Team"
        },
        {
            "text": "As recognition grows of the importance of nature to our health and wellbeing, understanding green infrastructure provision is vital to ensuring everyone can benefit from nature wherever they live. Natural England's mapping tools are widely used by urban planners to maximise green spaces so that nature and people thrive together."
        },
        {
            "text": "The Green Infrastructure Mapping team are pleased to announce the launch of Version 2.2 of the England Green Infrastructure Mapping Database, bringing enhanced accessibility data and urban habitat mapping to support better environmental decision-making."
        },
        {
            "text": "Following five years of development and collaboration, this update provides robust, evidence-based tools to support green infrastructure planning and environmental policy development."
        },
        {
            "heading": 4,
            "text": "Enhanced Accessibility Mapping for Better Community Understanding"
        },
        {
            "text": "The standout feature of Version 2.2 is the comprehensive update to our Accessible Green Infrastructure and Accessible Greenspace Standards modules. The new release incorporates fresh data from the People and Nature Survey, providing us with more accurate insights into how communities interact with green spaces."
        },
        {
            "text": "A particularly exciting addition is the new module developed using Defra data to support the “Access to Nature Official Statistic in development”. This innovative tool presents greenspace scenarios at Output Area level, including Doorstep, Local, Neighbourhood, and Partial Combined scenarios. "
        },
        {
            "text": "What makes this especially valuable is its ability to identify communities that appear well-served by green infrastructure but have limited practical access due to connectivity barriers."
        },
        {
            "text": "The existing Greenspace Buffers are actually \"zones of proximity\" and the scenario data allows us to see where households that fall within greenspace buffers face challenges reaching actual access points – crucial intelligence for targeting future investments and interventions."
        },
        {
            "heading": 4,
            "text": "Urban Habitat Mapping Reaches Full Maturity"
        },
        {
            "text": "After half a decade of methodological refinement, we're proud to present the complete suite of Urban Habitat Maps at Broad Class level on our website. These maps represent an evolution through three pilots and successive trials, with each iteration strengthening our mapping methodology and data quality."
        },
        {
            "text": "While generalised versions are publicly available online, organisations with Public Sector Geospatial Agreement licencing can access the detailed data, including fine-grained Detailed Urban Habitat Class information, through Natural England's data sharing arrangements."
        },
        {
            "text": "The mapping now includes innovative Urban Habitat Summary Grids using 250m cells, providing comprehensive data on habitat distribution across urban areas such as grasslands, agricultural land, wetlands and woodlands."
        },
        {
            "heading": 4,
            "text": "Pioneering \"Naturalness\" Assessment"
        },
        {
            "text": "Version 2.2 introduces experimental mapping of \"Naturalness\" as a physical quality factor – a groundbreaking approach to understanding how the public might perceive management intensity in green spaces. "
        },
        {
            "text": "Accessible Green Infrastructure parcels receive \"Naturalness Factors\" ranging from 1 (most natural, lowest management intensity) to 6 (least natural, highest management intensity). These maps cover urban areas within the North West, Midlands, North East and South East and West of England. "
        },
        {
            "text": "This work is still in development but offers exciting possibilities for assessing the aesthetic and experiential quality of green infrastructure, along with city-wide \"Naturalness Heat Maps\" that will be included in future updates."
        },
        {
            "heading": 4,
            "text": "Looking Ahead: Exciting Developments on the Horizon"
        },
        {
            "text": "The team is already working on significant improvements for future releases. Version 2.3, planned for early 2026, will include integration with the new Outdoor Recreation Valuation Tool (ORVal 3) and updated woodland access data from the Forestry Commission's England Woodland Action Plan."
        },
        {
            "text": "Major data access improvements are also underway, with migration to the Defra Data Sharing Platform enabling individual dataset downloads rather than the current comprehensive package approach."
        },
        {
            "heading": 4,
            "text": "Tutorial"
        },
        {
            "text": "We have created a short tutorial demonstrating how to use version 2.2 of the mapping tool:"
        },
        {
            "heading": 4,
            "text": "Acknowledgements"
        },
        {
            "text": "This significant achievement has been supported throughout by the Natural Capital and Ecosystem Assessment programme, demonstrating the value of sustained investment in environmental data and mapping capabilities."
        },
        {
            "text": "The Green Infrastructure Mapping Database continues to strengthen our evidence base for nature-based solutions and supports colleagues across government in delivering better outcomes for both people and the environment. "
        },
        {
            "text": "For more information visit the Green Infrastructure Framework or contact Senior Officer, Martin.Moss@naturalengland.org.uk"
        }
    ]
}