{
    "url": "https://dragonsden.blog.gov.uk/2025/10/16/dragons-den-ip-blog-series-22-episode-12/",
    "title": "Dragons Den IP Blog - Series 22 Episode 12",
    "authors": [
        "Laurien Webb"
    ],
    "categories": [
        "Designs",
        "Patents",
        "Trade marks"
    ],
    "pub_date": "2025-10-16T21:00:00+01:00",
    "content": [
        {
            "text": "As I settle into my sofa with a cup of tea, I couldn't help but get excited about diving into the latest Dragons' Den episode from an intellectual property (IP) perspective. Working at the Intellectual Property Office means I'm always watching these pitches through a particular lens, and this week delivered two absolute crackers that had me scribbling notes faster than Peter Jones could say \"I'm out.\" "
        },
        {
            "text": "Carolyn Asome and Business Partner Phil Moore’s L’Hood® presentation was everything I love about smart IP strategy. Here were two entrepreneurs who understood that in today's fast moving fashion world, having robust IP protection isn't just advisable, it's necessary. With a patent already secured (GB2594246) and £150,000 sought for 15% equity, this wasn't just another fashion accessory story. It was a masterclass in how IP can transform a simple Christmas dinner conversation into a genuinely scalable business proposition.  "
        },
        {
            "text": "The patent itself covers what appears to be a genuinely innovative hands-free alternative to umbrellas, designed for those caught in downpours who need the use of both hands. From festivals like Glastonbury to Wimbledon spectators, the market potential seemed global. Industry leaders including Jimmy Choo had apparently expressed interest, which speaks volumes about the commercial viability of properly protected innovation. "
        },
        {
            "text": "Design registration: fashion's secret weapon "
        },
        {
            "text": "While the Dragons’ debated whether L'Hood® was a novelty item or the next big fashion revolution, I found myself thinking about Touker's mention of \"lots of different designs.\" Whereas L’Hood’s patent protects the way the product works, the overall look of the item could be protected by design registration."
        },
        {
            "text": "Brand building through trade marks "
        },
        {
            "text": "Guest Dragon Emma Grede’s early exit and the subsequent discussion about celebrity collaborations reminded me why trade mark strategy matters so fundamentally in fashion. Memorable phrases and taglines can become registrable marks that follow brands through festivals, fashion weeks, and beyond. When Deborah Meaden questioned whether this was high end fashion or a novelty product, she was really interrogating brand positioning, and that's precisely where your IP portfolio tells your commercial story. "
        },
        {
            "text": "The sustainability angle with deadstock (surplus) materials also opens fascinating opportunities that could differentiate L’ Hood in an increasingly environmentally conscious marketplace. Smart businesses are learning to leverage every aspect of their IP strategy to build competitive advantage. "
        },
        {
            "text": "Unfortunately the duo received no offers from the Dragons’. However, as someone who's spilled more tea on herself than she'd care to admit while juggling an umbrella, a handbag, a pushchair (and her sanity!) in a sudden shower, I'll absolutely be stalking their website faster than you can say \"predictably unpredictable weather\". "
        },
        {
            "text": "Francisco's hair revolution "
        },
        {
            "text": "If Caroline's pitch was IP Strategy 101, Francisco Gimenez ‘s yuv® Beauty presentation was a masterclass in advanced IP thinking. His automated smart hair dye mixing system claimed to be the biggest innovation in hairdressing since the hairdryer, a bold statement backed by what he described as \"a couple of patents\" such as US11918098B2 "
        },
        {
            "text": "The £500,000 validation "
        },
        {
            "text": "When Francisco requested £250,000 for just 1% of his company, the Dragons' initial laughter was audible nationwide. But his eventual deal, accepting offers from both Sara Davies and Steven Bartlett for £500,000 combined, made Dragons' Den history as the biggest deal ever struck in the Den.  "
        },
        {
            "text": "Francisco's strategy was brilliant, retaining 98% ownership while gaining two Dragons’ with complementary expertise who could accelerate both market penetration and further development. It demonstrated perfectly how IP can become the foundation for extraordinary business valuations. "
        },
        {
            "text": "The bigger picture "
        },
        {
            "text": "Both pitches reminded me why I'm passionate about the work we do at the IPO. Whether it's Caroline's fashion innovation or Francisco's beauty tech revolution, IP protection transforms ideas into assets, concepts into competitive advantages, and inventors into entrepreneurs. Sometimes the most innovative ideas need time to find their market, but when they do, having robust IP protection makes all the difference between success and watching someone else profit from your creativity. "
        }
    ]
}