{
    "url": "https://companieshouse.blog.gov.uk/2025/10/16/making-identity-verification-simple-secure-and-trusted/",
    "title": "Making identity verification simple, secure and trusted",
    "authors": [
        "Identity Verification Team"
    ],
    "categories": [
        "Changes to UK company law",
        "Companies House transformation",
        "Digital transformation"
    ],
    "pub_date": "2025-10-16T16:02:54+01:00",
    "content": [
        {
            "text": "From 18 November 2025, directors and people with significant control (PSCs) will be legally required to verify their identity. We’ll be phasing this in over 12 months and we’re contacting companies with guidance on what to do and when."
        },
        {
            "text": "Identity verification will help make sure that the people setting up, running and controlling companies are who they say they are. This will help boost business, and support growth."
        },
        {
            "text": "We’re proud of the work we’ve done to make sure that identity verification standards are as high as they need to be, while the process is as simple as it can be. We estimate that 6 to 7 million people will need to verify their identity by mid-November 2026. We’ve done lots of testing with users to make the process straightforward, and most people will only have to verify once. There are 2 ways to verify your identity:"
        },
        {
            "heading": 2,
            "text": "Using the ‘Verify your identity for Companies House’ service"
        },
        {
            "text": "You can prove your identity free of charge using GOV.UK One Login. You’ll be asked some simple questions to find which of the 3 options is the best way to verify your identity:"
        },
        {
            "text": "The identity verification process can usually be completed in minutes. The average completion time for the GOV.UK Identity Document (ID) Checking App is less than 2 minutes 30 seconds."
        },
        {
            "text": "You’ll receive a personal code through the service as soon as your identity is verified. It’s unique to you, so keep it secure. You may need to share it with people you trust to file on your behalf."
        },
        {
            "text": "From 18 November, you’ll need to link your verified identity to each company role you hold by providing your personal code and a verification statement for each role."
        },
        {
            "text": "The Companies House register will be updated on 18 November 2025 to show the due dates for each role you hold."
        },
        {
            "text": "Read our guidance for more information on when you need to verify and provide your personal code."
        },
        {
            "heading": 2,
            "text": "Help with the process"
        },
        {
            "text": "It's possible for a family member or someone else you trust to support you through the digital journey. You can also use someone else’s device to complete the verification process."
        },
        {
            "text": "The GOV.UK One Login customer contact centre and technical service desk provide customer support every weekday for those who are less confident online or get stuck along the way. The contact centre has a user satisfaction score of 85%, with calls being answered in just 7 seconds on average, as of November 2024."
        },
        {
            "text": "GOV.UK One Login will ask you a few simple questions to work out the best way for you to verify your identity online. You may be directed to verify your identity in person at the Post Office. While this route is still digital at the start and end, it provides extra support for those who need it."
        },
        {
            "text": "Alternatively, you may wish to seek the services of an ACSP, such as an accountant or solicitor, to verify your identity."
        },
        {
            "heading": 2,
            "text": "Tips to prepare for identity verification"
        },
        {
            "text": "Make sure you have your documentation to hand. The easiest way to verify is using a passport, through the GOV.UK One Login app."
        },
        {
            "text": "We encourage you to verify your identity as early as possible. Since April 2025, hundreds of thousands of individuals have already verified their identities during the voluntary period."
        },
        {
            "text": "Read more about verifying your identity for Companies House."
        },
        {
            "text": "We've designed our identity verification processes to be simple, secure and robust. We'll verify identities using existing forms of identities, such as a passport or driving licence. Our identity verification requirements will not create a digital ID for company directors or people with significant control (PSCs). It's designed solely to prove that people are who they say they are."
        },
        {
            "text": "GOV.UK One Login follows the highest security standards for government and private sector services. It's fully compliant with UK data protection and privacy laws."
        },
        {
            "text": "Read this privacy notice to find out how information is stored when you verify with GOV.UK One Login."
        },
        {
            "text": "Read more about Companies House reforms and our identification verification rollout."
        }
    ]
}