{
    "url": "https://gfie.blog.gov.uk/2025/10/16/sourcing-opportunities-across-the-civil-service/",
    "title": "Sourcing opportunities across the Civil Service",
    "authors": [
        "karlharvey1"
    ],
    "categories": [
        "Break down barriers to opportunity",
        "Collaboration",
        "Life Chance Recruitment",
        "Military Spouses & Partners",
        "Veterans"
    ],
    "pub_date": "2025-10-16T12:00:05+01:00",
    "content": [
        {
            "text": "Have you ever wondered how the Going Forward into Employment (GFIE) team works with departments to source opportunities?"
        },
        {
            "text": "In this blog we spotlight a department that we work with regularly - His Majesty’s Revenue and Customs (HMRC) - to tell you a little bit more about what goes on behind the scenes before, during and after a vacancy is shared with our team. "
        },
        {
            "heading": 3,
            "text": "Before - Collaboration and defining skills"
        },
        {
            "text": "The Civil Service employs over 500,000 people across a range of different departments and locations. This means that sharing messages and developing relationships with different recruitment teams and business areas is an ongoing focus, and the GFIE team spend time raising awareness of the talent and potential that candidates from our pathways bring. "
        },
        {
            "text": "GFiE aims to find the best outcome for both the recruiting business area and the candidate. This often boils down to finding the right role to fit the candidate. We do this by working closely with the recruiting department to find out who they are looking for - what skills do they need? Is experience necessary or will training be provided? What strengths do candidates need to have to thrive in a role?"
        },
        {
            "text": "The GFIE team then works with the department to produce a vacancy advert; removing any jargon or acronyms and clearly setting out information that candidates need to decide whether a vacancy is right for them. "
        },
        {
            "heading": 3,
            "text": "During - networks and outreach"
        },
        {
            "text": "Networking and outreach are a great way to promote a department's vacancies.  An example of this was when HMRC worked with GFIE to find candidates for a number of Criminal Investigation Officer vacancies, recognising that many of the skills required may be found within the Veteran and Military spouse/partner communities. "
        },
        {
            "text": "GFiE organises regular engagement activities throughout the year, including attending in-person jobs fairs and delivering online drop-in sessions. This provides an insight into what working for the Civil Service is like, and what to expect from the GFIE application process. "
        },
        {
            "text": "However, hearing directly from people who work in departments like HMRC is the best way to understand what a day in their working life looks like. "
        },
        {
            "text": "Recognising the importance of this, colleagues from HMRC joined us at an online drop-in session for veterans organised by Career Transition Partnership (CTP); giving attendees the opportunity to find out more. The vacancies were also promoted at a Silverstone Veterans engagement event, where one of our Engagement Leads shared details of the opportunity face-to-face with attendees, answering questions and encouraging applications."
        },
        {
            "heading": 3,
            "text": "After - the importance of peer support"
        },
        {
            "text": "As HMRC continues to recruit through GFiE pathways, the number of colleagues who join through these routes increases and in turn their contribution to outreach activities have a positive impact. If someone doesn't believe that the Civil Service is for them, perhaps because of their background or perceived worries about what it'll be like, hearing from a peer who has followed that path already can be the deciding factor in whether or not to submit an application."
        }
    ]
}