{
    "url": "https://competitionandmarkets.blog.gov.uk/2019/08/09/working-with-us-to-tackle-cartels/",
    "title": "Working with us to tackle cartels",
    "authors": [
        "Sean McNabb, Director - Cartels"
    ],
    "categories": [
        "Competition Act 1998 and cartels",
        "Competition law compliance"
    ],
    "pub_date": "2019-08-09T12:05:38+01:00",
    "content": [
        {
            "text": "In this blog I’ll be detailing the investigation process here at the Competition and Markets Authority (CMA) when it comes to business cartels and protecting those who ‘blow the whistle’ on them."
        },
        {
            "text": "Cartels cheat customers out of a fair deal by forcing prices up and reducing quality, choice and innovation. They mean other, honest, businesses aren’t able to operate on a level playing field."
        },
        {
            "text": "People who take part in cartels (called ‘cartelists’) often go to great lengths to cover their tracks. They operate in secret, making them difficult to spot and pursue."
        },
        {
            "text": "That’s why we value whistleblowers who can provide us with valuable inside information to help us stop cartels. In fact, as part of our recent #stopcartels campaign, we’ve seen tip offs rise by over 30%, and we’ve been working to make it even easier to report cartels and cartel activity."
        },
        {
            "heading": 2,
            "text": "We’ve made reporting cartels easier"
        },
        {
            "text": "We’re encouraging more informants to come forward and help us in our investigations. As part of this we have made key information easily available to people who think they’ve spotted something that isn’t right, but don’t know what to do next."
        },
        {
            "text": "We’ve published:"
        },
        {
            "heading": 2,
            "text": "What happens when you report something"
        },
        {
            "text": "When you notify us we will always respond to confirm we’ve received the information."
        },
        {
            "text": "Next, we consider the information you give us. We may also get in touch with you to talk about it further, and possibly organise a face-to-face meeting to understand more."
        },
        {
            "text": "Making a complaint is just the start of a process, and people who inform us are expected to stay in touch and co-operate."
        },
        {
            "heading": 3,
            "text": "Protecting you during an investigation"
        },
        {
            "text": "Once we have established there is a case that needs investigating, we will discuss identity protection with you."
        },
        {
            "text": "If you want your identity to remain secret, make this clear to us early on and we will do everything within our power to ensure this. We have specially trained officers who will check-in on you regularly to offer reassurance and be a constant point of contact if you have any questions or concerns. Our officers are also mindful to establish means of communication that can’t be detected by others."
        },
        {
            "heading": 3,
            "text": "You won’t be called to court"
        },
        {
            "text": "We will treat anyone who reports cartel activity to us on a confidential basis as a 'source of intelligence' rather than a witness; this means you won’t be asked to appear in court. The intelligence you give us will guide how we investigate and unearth valuable evidence. To ensure the protection of your identity is watertight we will put in place what we call a ‘sterile corridor of evidence’; this means that the investigation team will be unaware that tip offs are coming from a whistleblower. Only the CMA intelligence team will know if a whistleblower is involved in a case."
        },
        {
            "text": "All of this adds up to keeping the identity of the whistleblower secret before, during and post-investigation."
        },
        {
            "heading": 2,
            "text": "Why you should come forward"
        },
        {
            "text": "Although business crimes may look victimless, they are not. They can cause significant harm to people, creating higher prices and reducing the quality of products and services. That’s why reporting illegal behaviour is morally the right thing to do."
        },
        {
            "text": "However, we know making the leap to report isn’t always easy which is why we have incentives in place to encourage reporting."
        },
        {
            "text": "For those outside a cartel, who haven’t been involved in illegal behaviour, we can offer financial rewards up to £100,000 in exchange for information."
        },
        {
            "heading": 3,
            "text": "When you’ve been involved in a cartel"
        },
        {
            "text": "If you’re an individual or company who has participated in illegal cartel activity, you will not qualify for a financial reward. We would not protect your identity in this scenario either. That said, there are benefits to coming forward and admitting your participation in a cartel:"
        },
        {
            "text": "When a company is the first to bring the cartel to our attention:"
        },
        {
            "text": "Even if a company is not the first to come forward, other members of the cartel which confess and cooperate with the CMA can get a reduction in fines and may be eligible for protection for their employees."
        },
        {
            "text": "The cooperating directors of companies which qualify for immunity or a reduction in fines may also qualify for protection from director disqualification. That’s why it’s definitely worth coming forward to the CMA, and doing so as early as possible."
        },
        {
            "heading": 2,
            "text": "Get in touch"
        },
        {
            "text": "I hope this blog gives you more confidence in reaching out to us."
        },
        {
            "text": "If you have information about a cartel or wish to report cartel activity, you can contact the CMA by using our online form, calling the cartels hotline on 020 3738 6888 or emailing cartelshotline@cma.gov.uk."
        },
        {
            "text": "You can also visit our 'Cheating or Competing?' website for information on what cartels look like and how best to report them."
        }
    ]
}