{
    "url": "https://phescreening.blog.gov.uk/2021/09/20/hpvalidate-sites-live/",
    "title": "HPValidate sites go live",
    "authors": [
        "Ruth Stubbs"
    ],
    "categories": [
        "NHS Cervical Screening Programme"
    ],
    "pub_date": "2021-09-20T11:58:27+01:00",
    "content": [
        {
            "text": "In April, we blogged about recruiting primary care and colposcopy sites to take part in the HPValidate study. We are pleased to inform you that, after being inundated with expressions of interests, we have selected 32 sites: 25 primary care sites and 7 colposcopy sites."
        },
        {
            "text": "Having completed HPValidate inductions and initiation visits, sites are now recruiting individuals into the study."
        },
        {
            "heading": 2,
            "text": "How HPValidate will work"
        },
        {
            "text": "Individuals attending their GP practice for cervical screening will be invited to take part in the self-sampling study to test the specificity of self-sampling devices. If they agree to take part, they will carry out a self-test before their clinician takes their sample. They will also be asked to complete a short survey about their user experience."
        },
        {
            "text": "To test the sensitivity of the self-sampling devices, individuals attending colposcopy will also be invited to take part in the study. If they agree to take part, they will carry out a self-test before their colposcopy appointment."
        },
        {
            "text": "Over the course of the study we will collect 5,000 samples from general practice and 1,750 from colposcopy clinics. Since we last blogged, the laboratories selected to participate in HPValidate have been busy refining sample processing workflows and are in discussions with the self-sampling device manufacturers."
        },
        {
            "heading": 2,
            "text": "Residual sample archive"
        },
        {
            "text": "As part of HPValidate, we are asking laboratories to send residual samples (subject to consent) to an archive at the National Infection Service laboratories based at PHE Colindale."
        },
        {
            "text": "The study archive is the first of its kind for the programme and will serve as an invaluable resource for the evaluation of new tests that may enhance cervical screening and disease management in the future."
        },
        {
            "heading": 2,
            "text": "The view from early adopter sites"
        },
        {
            "text": "The HPValidate study team has worked hard to prepare the 32 sites. Mendip Vale Medical Group (Bristol) was one of the first primary care sites to complete the online induction. Katherine White, practice/research nurse at Mendip Vale, said:"
        },
        {
            "text": "Among the 7 colposcopy sites taking part in the study, the colposcopy unit at Barts Health NHS Trust (London) was one of the first to complete the HPValidate induction and is recruiting patients to take part in the initiative. Linda Leitch-Devlin, a clinical nurse specialist at the trust, said:"
        },
        {
            "heading": 2,
            "text": "Thank you"
        },
        {
            "text": "We would like to express our thanks to all of the sites taking part in this exciting journey, working together to inform the future of self-sampling in the NHS cervical screening programme."
        },
        {
            "text": "Please keep an eye on the PHE Screening blog for further HPValidate updates."
        },
        {
            "heading": 2,
            "text": "PHE Screening blog"
        },
        {
            "text": "The PHE Screening blog provides up to date news from all NHS screening programmes. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new blogs. If you have any questions about this blog article, or about population screening in England, please contact the PHE screening helpdesk."
        }
    ]
}