{
    "url": "https://insideDIO.blog.gov.uk/2021/09/20/rising-to-the-sustainability-challenge-through-recycling-and-waste-reduction-on-the-defence-estate/",
    "title": "Rising to the sustainability challenge through recycling and waste reduction on the Defence Estate",
    "authors": [
        "DIO communications team"
    ],
    "categories": [
        "Glen Mallan jetty",
        "Land Management",
        "Landmarc",
        "Northern Ammunition Jetty",
        "RAF Lossiemouth",
        "Skanska",
        "Sustainability"
    ],
    "pub_date": "2021-09-20T14:03:45+00:00",
    "content": [
        {
            "text": "Landmarc staff play a vital role in keeping the Defence estate clean and recycling waste [Copyright Landmarc Support Services Limited, 2018]It’s Recycle Week, the nation’s annual celebration of recycling and an opportunity for us all to consider how we can ‘Step It Up’ in our efforts to recycle and re-use more of the right things, more often."
        },
        {
            "text": "Recycling and waste management forms a key part of the UK Government’s ambition to bring greenhouse gas emissions in the UK to net zero by 2050. To support this, in March this year the Ministry of Defence (MOD) published its Climate Change and Sustainability Strategic Approach, which sets out how Defence will redouble its efforts to reduce its carbon emissions and protect the environment."
        },
        {
            "text": "As the infrastructure provider for Defence, DIO is committed to becoming an expert in sustainability, climate change and the environment. At the heart of this is our work building and maintaining infrastructure in the most efficient and sustainable way possible. Here are some examples of where we are recycling and re-using materials in major projects across the Defence estate."
        },
        {
            "heading": 2,
            "text": "Re-constructing the Northern Ammunition Jetty"
        },
        {
            "text": "The Northern Ammunition Jetty is being refurbished to make it suitable for the Royal Navy’s new aircraft carriers [Crown Copyright/MOD2020]One of the biggest projects currently underway across the UK Defence estate is the redevelopment of the Northern Ammunition Jetty in Glen Mallan, Scotland to support the Royal Navy’s surface fleet and aircraft carriers in loading and unloading ammunition."
        },
        {
            "text": "Since August 2020, our partners VolkerStevin have recycled 97.5% (1,113 tonnes) of waste taken from the Northern Ammunition Jetty, including construction waste, concrete, woods and metals. Waste is transported on barges to recycling facilities on the Clyde, reducing the carbon footprint associated with transporting waste materials to disposal sites by road."
        },
        {
            "heading": 2,
            "text": "Runway resurfacing at RAF Lossiemouth"
        },
        {
            "text": "Earlier this year, runway resurfacing works were completed at RAF Lossiemouth to support the arrival of the RAF’s new Maritime Patrol Aircraft."
        },
        {
            "text": "Concrete and asphalt were recycled and re-used to provide material for new runway pavements, vehicle reception areas, and other works around the station. An aircraft rinse facility was also installed, which recycles around 80% of the water used. In addition, lighting which was replaced in the runway resurfacing works was provided for reuse across the Defence estate."
        },
        {
            "heading": 2,
            "text": "Redeveloping Worthy Down through Project Wellesley"
        },
        {
            "text": "The new Defence College of Logistics, Policing and Administration at Worthy Down. [Skanska]Through Project Wellesley, a major redevelopment at Worthy Down has been completed which included the flagship tri-service Defence College of Logistics, Policing and Administration."
        },
        {
            "text": "In the last 12 months at Worthy Down, 1,114 tonnes of waste – 99.5% of all waste produced – has been diverted from landfill. Over the whole project, a total volume of 75,000m³ of demolition material was saved, crushed and re-used on site for features such as crane and piling mats, temporary haul roads, pavements and other landscaping. The re-use of material through crushing also resulted in 33.17 tonnes of carbon dioxide equivalent (CO2e) savings due to not having to transport demolition waste to disposal sites."
        },
        {
            "heading": 2,
            "text": "Landmarc's support to recycle waste"
        },
        {
            "text": "Our partners Landmarc have achieved a 75% recycling rate for non-construction waste across the Defence training estate in 2020-21, diverting 98% of waste from landfill in the same year. This remarkable achievement has been due to the hard work of Landmarc teams and waste partner GPT."
        },
        {
            "text": "In addition, for Plastic Free July 2021, over 250 Landmarc staff made pledges to reduce their consumption of single-use plastics."
        },
        {
            "heading": 2,
            "text": "Step It Up this Recycle Week"
        },
        {
            "text": "We all need to act in the fight against climate change, whether as organisations such as DIO in delivering major projects to help meet the Government’s sustainability targets, or on a more individual basis through our everyday behaviors. Here are some small actions that can make a big difference:"
        },
        {
            "text": "You can read about award-winning efforts by teams and individuals to reduce waste and improve sustainability across the Defence Estate in this year’s Sanctuary Magazine. Keep an eye out on our blog as well for more information about how DIO is delivering and managing military infrastructure in the most effective, efficient and sustainable way possible."
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}