{
    "url": "https://environmentagency.blog.gov.uk/2021/09/20/working-with-international-partners-to-promote-natural-flood-management/",
    "title": "Working with international partners to promote natural flood management",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Flood"
    ],
    "pub_date": "2021-09-20T14:45:18+00:00",
    "content": [
        {
            "text": "On 16 September 2021 the United States’ Army Corps of Engineers (USACE) published an international guide on using Natural and Nature Based Features (NBBF) to reduce flood and coastal erosion risks. This guide is for river and coastal managers worldwide – to inspire them, showcasing nature-based approaches to flood and coastal management."
        },
        {
            "text": "NNBF is an American term - used to describe measures that can be used to restore the natural function of rivers, estuaries and coasts - providing flood risk management benefits. In the UK, this approach is known as Natural Flood Management (NFM)."
        },
        {
            "text": "We have been privileged to be a partner in this project. Working closely with our peers at USACE and Rijkswaterstaat we have co-authored chapters on rivers, coasts and community engagement – sharing our science, knowledge and case studies from across the UK. Here we reflect on some of the innovative solutions being taken forward and the benefits of working with our international partners."
        },
        {
            "text": "We are united by our similarities"
        },
        {
            "text": "NFM measures help to slow the flow of water across the landscape – encouraging the infiltration of water into the soil and temporary storage of water in salt marshes, floodplains and ponds.  NFM measures restore natural processes to rivers, estuaries and coasts. They are an important tool which helps reduce flooding and coastal erosions risks whilst providing a wide range of co-benefits for people and wildlife. The right solution in the right place can improve water quality, stop soil erosion, increase biodiversity and improve habitats."
        },
        {
            "text": "Through the development of this guide, we’ve been lucky to work with many interesting people from all corners of the globe. We found that whilst the countries we work in are in many ways very different, the environmental challenges we face and the approaches we use to resolve them are surprisingly similar."
        },
        {
            "text": "Since Hurricane Sandy in 2012 USACE have been increasingly promoting the use of natural approaches to help address flooding and coastal erosion problems. In the Netherlands the inspiring ‘Room for the river’ and ‘Sand motor’ projects have demonstrated innovative solutions to flooding and coastal erosion problems."
        },
        {
            "text": "Here in England, the floods of 2007 have led to an increased use of NFM measures alongside traditional forms of engineering to improve resilience to flood and coastal erosion risk."
        },
        {
            "text": "NFM now forms an important part of our national flood and coastal erosion risk management strategy and there has also been much investment from Defra in testing out and piloting innovative approaches to flood management."
        },
        {
            "text": "NFM also has an important role to play in helping absorb our carbon emissions by harmlessly locking it away and creating vital new habitats. As part of our plans to achieve net zero by 2030 we plan to use a combination of nature-based and engineered solutions to reduce the risks of flooding and coastal erosion."
        },
        {
            "text": "Sharing our examples "
        },
        {
            "text": "Our flood risk strategy sets out our ambition to be world leader in researching and managing flooding and coastal change. Working on this project we have been able to share our knowledge, science  and practical case study examples with others globally."
        },
        {
            "text": "We are extremely proud that the international guidelines show case 10 case studies from across the UK that illustrate a range of different approaches to river and coastal management."
        },
        {
            "text": "The Beam Washlands (London) project has provided a large, habitat-rich community parkland - it includes 12.6ha of habitat that helps reduce the risk of flooding to 570 homes and 90 businesses. The Eddleston Water (Scotland) project showcases a wide range of NFM measures in a rural setting. Flood modelling shows that different NFM measures will reduce peak flows and delay flood peaks - providing £2.85 million of avoided flood damages."
        },
        {
            "text": "We have also been able to work with other UK partners to share the findings from their long-term NFM studies such as Belford Burn and the Making Space for Water projects in Pickering and the Peak District."
        },
        {
            "text": "Learning from others"
        },
        {
            "text": "One of the best parts of working on this project was the chance to learn from other global experts – hearing about their successes and seeing their projects."
        },
        {
            "text": "One of the stand out moment for us was hearing from Minni Jain at the Flow Partnership who talked to us about her work which involves collaborating with communities in India and Colombia empowering them to build natural measures in their watersheds - restoring the natural environment so that it can adapt to both the impacts of flood and drought."
        },
        {
            "text": "We also heard from one of our graduate engineers who worked with Engineers without Borders and Kounkuey design initiative to implement sustainable drainage measures in Nairobi (Kenya)."
        },
        {
            "text": "Through our involvement on this project I think we can say with confidence that globally we all agree that creating, restoring and preserving habitats is vital. It helps our catchments and coasts adapt and become more resilient to the impacts of climate change and provides a wide range of co-benefits to local communities."
        },
        {
            "text": "How do I find out more?"
        },
        {
            "text": "Read International guide on using Natural and Nature Based Features."
        },
        {
            "text": "Watch the virtual launch event to hear from USACE and other guest speakers such as our Executive Director of flood and coastal risk management Caroline Douglass."
        },
        {
            "text": "We have developed guidance to help you find out how you can use natural options to reduce flooding in your area."
        },
        {
            "text": " "
        },
        {
            "text": "Authors: Jo Guy, Environment and Sustainability Manager and Lydia Burgess-Gamble, Principal Scientist, Environment Agency"
        },
        {
            "text": " "
        }
    ]
}