{
    "url": "https://insideDIO.blog.gov.uk/2024/06/03/dio-commemorates-80-years-since-d-day/",
    "title": "DIO commemorates 80 years since D-Day",
    "authors": [
        "DIO Communications Team"
    ],
    "categories": [
        "D-Day 80"
    ],
    "pub_date": "2024-06-03T16:08:27+00:00",
    "content": [
        {
            "text": "This year, the UK will commemorate the 80th anniversary of the Normandy Landings on 6 June 1944. There will be a series of major events across the UK and in France."
        },
        {
            "text": "D-Day saw the Allied Forces mount a large-scale invasion of Nazi-occupied France that ultimately tipped the course of the Second World War in the Allies' favour."
        },
        {
            "text": "Here at DIO, we have been reflecting on what we do to preserve this heritage."
        },
        {
            "heading": 2,
            "text": "How this wall was used to prepare for the Normandy landings"
        },
        {
            "text": "Hidden away deep in the Surrey countryside sits a piece of iconic British history. A structure that Defence Infrastructure Organisation (DIO) proudly cares for that helped the Allies prepare for the D-Day landings in 1944.  "
        },
        {
            "text": "A replica of the Nazi-built Atlantic Wall can be found on Hankley Common on the MOD training estate. The reinforced structure measures 100m long, 3m high... read more"
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Op Nightingale: Digging Band of Brothers"
        },
        {
            "text": "Defence Infrastructure Senior Archaeologist Richard Osgood led an Op Nightingale Dig at a site in Aldbourne, Wiltshire which has significant links to the preparations for the  D-Day landings. "
        },
        {
            "text": "The dig, which aligns with the 80th anniversary year of D-Day landings, excavated where the US Army’s 506th regiment of the 101st Airborne Division were... read more"
        },
        {
            "text": " "
        }
    ]
}