{
    "url": "https://insidedio.blog.gov.uk/2024/06/03/operation-nightingale-digging-band-of-brothers/",
    "title": "Operation Nightingale: Digging Band of Brothers",
    "authors": [
        "DIO Communications Team"
    ],
    "categories": [
        "Archaeology",
        "D-Day 80",
        "Operation Nightingale"
    ],
    "pub_date": "2024-06-03T14:35:22+00:00",
    "content": [
        {
            "text": "Defence Infrastructure Senior Archaeologist Richard Osgood led an Op Nightingale Dig at a site in Aldbourne, Wiltshire which has significant links to the preparations for the  D-Day landings. The dig, which aligns with the 80th anniversary year of D-Day landings, excavated where the US Army’s 506th regiment of the 101st Airborne Division were stationed in 1943 and 1944. This included now famous Easy Company who were portrayed in the TV series Band of Brothers.  "
        },
        {
            "text": "This Op Nightingale dig, which was carried out by a team of volunteers including current and ex-UK and US service personnel, found several interesting artefacts such as combat knifes, ammunition, and equipment from the period. Finds like these help us further our understanding of the time and keep the amazing stories of these soldiers in the minds of current and future generations. "
        },
        {
            "text": "The stories of people such as Sgt. Otto May..."
        },
        {
            "text": "The dig discovered the dog tags of Otto May of ‘Fox Company’ of the 506th Parachute Infantry Regiment; Fox Company most likely lived in the hut being excavated. Sgt May left Aldbourne on 5th June 1944 to go to Upottery airfield near Exeter and he jumped into Normandy on the 6th of June 1944 at the age of 29. Sgt May returned to Aldbourne and went on leave to Edinburgh and then took part in Operation Market Garden. In 1945, at Foy near Bastogne, while fighting in the Battle of the Bulge, he received a leg-wound from artillery and was medically discharged.  "
        },
        {
            "text": "Otto May was from Brooklyn, New York and died in 2000.  "
        },
        {
            "text": "As we approach the 80th anniversary of D-Day, there are many activities happening on and off the estate. These look to commemorate the efforts and sacrifices made by those involved and celebrate the role Defence played in enabling the landings. . Operation Nightingale helps us  to archaeologically explore and better understand the many different aspects of the event. "
        },
        {
            "text": "This award-winning scheme sees wounded, injured and sick service personnel and veterans taking part in archaeological digs on the Defence estate. The participants are guided by professional archaeologists from the Defence Infrastructure Organisation, which manages the MOD’s land and buildings, as well as partner organisations."
        }
    ]
}