{
    "url": "https://hmlandregistry.blog.gov.uk/2021/12/03/5-top-tips-to-keep-your-property-safe/",
    "title": "5 top tips to keep your property safe",
    "authors": [
        "Suzanne Earl, Senior Product Manager"
    ],
    "categories": [
        "Buying and selling property"
    ],
    "pub_date": "2021-12-03T16:28:19+00:00",
    "content": [
        {
            "text": "Combating fraud is a key priority for us at HM Land Registry. Over the past 5 years we’ve prevented fraud on properties to the tune of more than £100m. Our counter-fraud teams work to detect and prevent fraud, and we work closely with conveyancers to minimise the risk."
        },
        {
            "text": "Property fraud is rare, with an average of 0.001% of transactions being fraudulent. But we know that vigilance is key to combating fraud, so we encourage homeowners to sign up to our award-winning Property Alert service. With property fraud hitting the headlines, we’ve seen record numbers signing up, including over 75,000 registrations in November alone."
        },
        {
            "heading": 2,
            "text": "Why you should sign up to Property Alert"
        },
        {
            "text": "So, let’s look at how our free service can help protect you and your home."
        },
        {
            "text": "You can put an obstacle in a potential fraudster’s way by signing up to our award-winning Property Alert fraud detection service. It doesn’t cost anything and it’s quick and easy to sign up: you’ll have peace of mind in the time it takes to make a cup of tea."
        },
        {
            "text": "Once you’ve joined, we’ll send you email alerts about certain activities involving the property, such as an application to change the register, so you can take swift action if necessary. We’ll also send you emails every six months just to confirm whether any applications have been made in that period."
        },
        {
            "text": "You don’t have to own the property in question to set up an account, and unless you’re the registered proprietor you won’t be able to do anything other than monitor it. This allows you to keep an eye on your family or friends’ homes for them - and you can monitor up to 10 properties."
        },
        {
            "heading": 2,
            "text": "Top tips when setting up your Property Alert account"
        },
        {
            "text": "Our 5 top tips for using the service are:"
        },
        {
            "text": "Signing up to Property Alert won’t automatically stop fraud from happening, and not all alert emails will mean fraudulent activity is taking place, but it does provide an early warning system and, if you’re worried or something doesn’t seem right, the alert email will tell you who to contact."
        },
        {
            "text": "Please see the GOV.UK guidance for further information on protecting your land and property from fraud."
        }
    ]
}