{
    "url": "https://companieshouse.blog.gov.uk/2021/12/03/business-support-helpline-supporting-and-celebrating-small-business/",
    "title": "Business Support Helpline: supporting and celebrating small business",
    "authors": [
        "Natalie Black - Business Support Helpline Tier 2 adviser"
    ],
    "categories": [
        "Business stories",
        "Company guidance"
    ],
    "pub_date": "2021-12-03T14:13:25+00:00",
    "content": [
        {
            "text": "Coronavirus (COVID-19) has had, and is still having, a huge impact on the lives of people worldwide. Almost everyone has been affected, whether that’s in a domestic or commercial capacity, or even both. The impact on business has been huge and the business support landscape has had to change dramatically and quickly to support this. "
        },
        {
            "text": "At the Business Support Helpline, we’ve been at the forefront of supporting anyone with a business need throughout the pandemic. Delivering a contract on behalf of the Department for Business Energy and Industrial Strategy (BEIS), covering England, we offer a multi-channel service, providing free advice and information.  "
        },
        {
            "text": "For business based in Wales, Scotland and Northern Ireland, you can get advice and financial help from other government-backed schemes. "
        },
        {
            "heading": 2,
            "text": "Supporting businesses throughout the pandemic"
        },
        {
            "text": "Recognising the impact the global pandemic would have on business, a decision was made by BEIS that our resource to support business would need to increase to cope with a rise in demand.  A rapid expansion plan was prepared quickly."
        },
        {
            "text": "As well as having available staffing resources it was important for advisers to have access to accurate and current information that we could signpost business enquiries to. A dedicated COVID-19 response team was set up to provide this and a great working relationship was formed between all parties involved."
        },
        {
            "text": "It was not long before we found ourselves in the depths of delivering business support. Whether businesses were looking for funding, looking for support with implementing new health and safety measures, or looking for help with understanding newly introduced regulations, they were relying on us. In fact, in March 2020 alone, we dealt with a record number of 23,070 contacts, all from businesses across England that had queries relating to COVID-19."
        },
        {
            "text": "We continued to work extremely closely with BEIS and their dedicated COVID-19 response team.  They made sure we had the most current information published by central government and gave us comprehensive overviews of government schemes, such as:"
        },
        {
            "text": "This meant we were able to signpost businesses to the relevant packages of support."
        },
        {
            "text": "On a more interpersonal level, a lot of the businesses that we spoke to throughout the pandemic were in crisis. As well as the huge impact on business, we recognised the impact this was having on individuals. Some were tired, worried, and suffering emotionally."
        },
        {
            "text": "We recognised that these businesses were more than just bricks and mortar and numbers on a spreadsheet. These businesses belonged to real people who at times, just needed an empathetic ear to be at the other end of the phone. Someone to speak to and someone to listen. Through recognising these things, we were able to highlight and signpost individuals to personal support delivered by charities such as Mind, the Samaritans, and Citizens Advice."
        },
        {
            "text": "Almost 2 years have passed since the first case of COVID-19 was reported. Over the last couple of months we have experienced a refreshing reduction in the volumes of COVID-19 related enquiries. But we’ve also received many more enquiries from individuals who throughout the pandemic have had a change in work circumstances and are looking to start their own businesses."
        },
        {
            "heading": 2,
            "text": "Small Business Saturday"
        },
        {
            "text": "It’s great to take the opportunity to celebrate both the contribution of small businesses to the UK, and the overwhelming support from the public throughout the pandemic. One event that does this is Small Business Saturday UK. Held this year on 4 December, this grassroots, non-commercial campaign celebrates small business success and encourages consumers to 'shop local' and to support businesses in their communities."
        },
        {
            "text": "Now in its ninth year, Small Business Saturday is the UK's most successful small business campaign, which last year saw a record-breaking £1.1 billion spent with small businesses across the UK on the day, according to estimates."
        },
        {
            "text": "This year the campaign is calling on the nation to share a ‘big thank you’ with small firms to recognise their vital role throughout the pandemic.  As small firms face different challenges to get back on their feet, support from the public can make a huge impact in helping these small, independent firms who are at the heart of our communities and have been vital to getting us through the pandemic."
        },
        {
            "text": "Upon reflection, the last 2 years have no doubt been a learning curve for us all. Despite the uncertainties that businesses have faced this far and despite the challenges that might arise for businesses in the future, here at the Business Support Helpline we'll continue to be supportive and signpost businesses in the direction of the resources that they need."
        }
    ]
}