{
    "url": "https://marinescience.blog.gov.uk/2021/12/03/cefas-and-industry-science-collaboration-commercial-catch-sampling-in-the-age-of-covid/",
    "title": "Cefas and Industry science collaboration: commercial catch sampling in the age of COVID",
    "authors": [
        "Jon Elson"
    ],
    "categories": [
        "Field Research",
        "Fisheries"
    ],
    "pub_date": "2021-12-03T11:43:21+00:00",
    "content": [
        {
            "text": "This is the third in a series of short blogs focussing on Cefas’ fisheries science work in partnership with the fishing industry. Cefas Scientist, Jon Elson, who is responsible for the Cefas commercial catch sampling programme, is the next of our blog authors."
        },
        {
            "text": " "
        },
        {
            "text": "This time last month, Rob Forster, one of our observers, was down on Brixham quay to meet the beam trawler, Emilia Jayne, returning from a 6-day trip south of Start Point, Devon. The weather had been unpleasant (southerly 7-9) but the skipper and crew had kindly agreed to bag up and store samples representative of the unwanted catch from eight hauls for us to process ashore. This was the 72nd trip co-sampled this year, when Cefas observers, who would normally go out to sea, have been working onshore to sample fish and commercial shellfish for age, sex and maturity data."
        },
        {
            "text": "The commercial catch sampling programme is currently the only source for these data and are crucial for stock assessments by the International Council for the Exploration of the Seas (ICES) that feed into advice for fisheries management. They provide overall discard rates by stock/species and fleet; and quarterly estimates of discarded numbers at age and/or size by stock/ species and fleet."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Tackling a data shortage during the pandemic…"
        },
        {
            "text": "We are rapidly closing in on our 20th anniversary for a continuous offshore monitoring programme, and until March last year it was dependent on observers sampling commercial catches at sea for biological data on fishing vessels. Collecting these data has always been reliant on the goodwill of fisherman and vessel owners who agreed to take an observer onboard one of their commercial fishing trips to collect biological data from both the retained and discarded components of their catch. As a consequence of the COVID pandemic, both the industry activity and our sampling were seriously affected. Thankfully the industry were able to begin fishing again as their markets reopened, but it was not immediately possible to find an effective way of managing the COVID risk and returning to sampling at sea. Although some at sea sampling is now possible with sufficient mitigations in place, it is still limited to short trips and vessels with sufficient space for our observers to work safely with the crew. As observers started to return to sea, it was obvious that the data from these trips was not going to cover the range and extent of all the English fisheries we usually monitor."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "With the help of industry"
        },
        {
            "text": "The co-sampling programme was piloted towards the end of 2020 in consultation with the National Federation of Fisherman’s Organisations (NFFO) and local industry. The programme was seen as a potential alternative to the at-sea programme. It was essential to identify such an alternative because the growing gap in data from the at-sea programme risked impacting ICES stock assessments and fisheries management advice. Co-sampling relies more heavily on the involvement of the industry who have to select and bring samples ashore for our observers to sample. Skippers are briefed by our observers and protocols are agreed for selecting the hauls we need the samples from, how to calculate the sample ratios and the additional haul and catch information we require."
        },
        {
            "text": "At the start of the co-sampling programme, Barrie Deas of NFFO commented:"
        },
        {
            "text": "\"The COVID crisis has disturbed the way in which scientists collect the data that provides the raw material for fish stock assessments. Without good data we cannot expect good management decisions and the risk of tighter restrictions through the application of a precautionary approach is increased."
        },
        {
            "text": "“There is potential, however, to turn this problem into an opportunity by increasing the industry’s direct involvement in the provision of data. The result could be greater industry confidence that they have had a part in undertaking.\""
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "One year on "
        },
        {
            "text": "Nearly a year has passed since the first co-sampling pilot in 2020 and 243 samples later (with more to come this calendar year), we will be able to provide estimates for catch rates and catch at age compositions for most of our key fisheries and stocks for the next round of ICES fish stock assessments in 2022. It’s not been plain sailing with hiccups and pauses on the way dealing with changes in COVID guidance and restrictions on travel and access to venues to carry out the sampling, managing fish welfare, and complexities around waste disposal and regulations on landing unwanted catch."
        },
        {
            "text": "For the fishing industry to bring back samples for scientific purposes, each fishing vessel taking part in the programme is required to carry dispensations from national and regional landing restrictions and, because of the potential number of vessels involved, authority from the European Commission was also required until the end of 2020. The national dispensations required regular communication with Inshore Fisheries and Conservation Authorities (IFCAs) and the Marine Management Organisation (MMO) to update vessel lists and extend the sampling to different fisheries. Without their authority this programme would have not started and without their help, cooperation and patience this programme would have been far less successful."
        },
        {
            "text": "The co-sampling programme draws on our observers well-established working relationships with the fishing industry but also drew in the communications team to design and circulate leaflets and tweets in a call for volunteers. The publicity helped gain support and contact from additional vessels interested in taking part, including interest in the scheme from skippers in other countries."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Challenges and progress"
        },
        {
            "text": "Our observers are used to working with the industry around the clock, but this programme has demanded more of both the industry and our observers. The programme has demanded more of skippers and crew whether at sea or tied up alongside; it’s demanded more from the port staff who help out and allow us access to their facilities and waste disposal when they can. Most of the observers work from remote offices (closed during the pandemic) or home without lab facilities. They have had to be flexible and resourceful, adapting quickly to changes in landing times, access to storage and venues. Where feasible the industry has allowed access to market and quayside facilities to process samples, where other facilities aren’t available."
        },
        {
            "text": "The original expectation was that this programme would be for the short-term, but the co-sampling programme’s achievements mean that it could continue in some fisheries to enhance a sea-going programme beyond the COVID restrictions. The programme has demonstrated that representative data for the fisheries sampled can be collected successfully by the fisherman. It is dependent on trust and an understanding between the observer and fisherman of what is needed and a strict adherence to agreed protocols to minimise any potential bias in how and what data are collected. It is reliant on the fisherman’s experience and ability to judge the size of the catch and to determine the total quantities discarded.  However, because of the legal restrictions on the activities of a commercial fishing vessel and logistical issues relating to bringing some fish ashore, there will still be some gaps in the biological data for some species and fisheries. To resolve these may need a change in approach including more involvement of skippers and crew. This would need further consultation and testing."
        },
        {
            "text": "COVID and concerns around managing infection and duty of care to our staff and skippers will continue to affect our ability to get back to sampling at sea for some time to come. The co-sampling approach will need to continue, and whether we can confidently get the same level of access to the fleets that we used to for at-sea sampling or not, co-sampling, will likely be used to enhance any ongoing observer programme in the future."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "And in their own words"
        },
        {
            "text": "Commenting on her experience of the co-sampling programme, Cefas Fisheries Observer, Ruth Hicks based in Weymouth, said:"
        },
        {
            "text": "“It was good to get back out in the field and talking to and working with industry, we were champing at the bit to get back out sampling."
        },
        {
            "text": "“After initial briefings, skippers seemed happy enough to collect samples for us, and their paperwork that supported samples was completed to a high standard."
        },
        {
            "text": "Cefas Fisheries Observer, James Lamb, processing co-samples on North Shields fish market"
        },
        {
            "text": "James commented:"
        },
        {
            "text": "“With not being able to go to sea due to covid restrictions, the co-sampling programme allowed us (observers) to maintain industry relationships. "
        },
        {
            "text": "“As a recently qualified observer, COVID could have interrupted my development, but the co-sampling kept my skills fresh. Which meant when I did get back to sea, it went a lot smoother than I expected.”"
        },
        {
            "text": "Industry engagement levels are high, with all skippers understanding the core motivation for collecting catch data and keen to be personally involved. Feedback was positive with the following feedback from involved fishermen:"
        },
        {
            "text": "Peter Clark, skipper of the LUC, fishing out of North Shields: \"I think it is an important programme and cooperation with Cefas is key for sustainability and the industry’s future\"."
        },
        {
            "text": " "
        },
        {
            "text": "Graham Doswell (pictured above), skipper of Halcyon, fishing out of Eastbourne: “I was very happy to take part in the programme.”"
        },
        {
            "text": "Steve Moseley, skipper of the beamer, Karen N fishing out of Penzance: “We’re glad to help, keeps the data on the stocks coming in, and we know that needs to happen."
        },
        {
            "text": "“It’s easy enough for us to do, John handles the deck sampling, I tell him when to sample and he takes random amounts from the conveyer, bags it up, tags it - job done. I record the bulk catch and the fish [retained] we have from that tow, easy. And we get paid!"
        },
        {
            "text": "“Really pleased to hear the results from this [co-sampling] matches with your sampling, shows we’re doing it right.”"
        }
    ]
}