{
    "url": "https://insideDIO.blog.gov.uk/2021/12/03/celebrating-international-day-of-people-with-disabilities/",
    "title": "Celebrating International Day of People with Disabilities",
    "authors": [
        "Kate Harrison"
    ],
    "categories": [
        "Inclusion",
        "Wellbeing",
        "Working at DIO"
    ],
    "pub_date": "2021-12-03T15:47:51+00:00",
    "content": [
        {
            "text": "Today we are celebrating International Day of People with Disabilities. The day is about promoting the rights and well-being of people with disabilities at every level of society, and raising awareness of challenges, barriers and opportunities for those who live with disabilities. This has been more important than ever throughout the COVID-19 pandemic and is reflected in this year’s theme: “Fighting for rights in the post-COVID era.”"
        },
        {
            "text": "To mark International Day of People with Disabilities this year, I’d like to share some personal reflections on the insights I’ve gained through my participation in DIO’s mutual mentoring scheme."
        },
        {
            "heading": 2,
            "text": "About mutual mentoring "
        },
        {
            "text": "Mutual mentoring at DIO has been driven by a desire to improve inclusion and help colleagues understand the issues that people face in the workplace. Once we understand these issues from a more personal level, we can actively do something about them."
        },
        {
            "text": "I was paired with someone with a disability  who is junior to me. Although my teams work closely with hers, she isn’t in my direct reporting line which has helped in terms of allowing us to be very open with each other."
        },
        {
            "text": "This scheme doesn’t just involve people with physical disabilities. It’s also about raising awareness of the lived experiences of those with hidden disabilities, those who are neurodiverse, people with caring responsibilities, those with children and people from different backgrounds."
        },
        {
            "heading": 2,
            "text": "The benefits of talking about disabilities "
        },
        {
            "text": "There are some obvious benefits to mutual mentoring. I’ve met a new friend and I now have a better understanding of some of the barriers that people face in the workplace, as well as the attitudes that disabled people encounter, both good and bad."
        },
        {
            "text": "My mentor has raised my awareness by sharing research and analysis that shows how differently people with disabilities are treated in the workplace and how this affects them.  Within the ‘safe space’ provided, we’ve been able to talk openly about difficult issues such as knowing when and how to offer help to someone with a disability. One of the biggest lessons I’ve learnt from mutual mentoring is that it’s okay to ask."
        },
        {
            "text": "Inspired by our conversations, I now have an ‘inclusion moment’ at the beginning of meetings, which gives everyone an opportunity to talk about a time they’ve felt excluded, or indeed where they have made a particular effort to include someone. It’s proven to be a great way to raise awareness while bringing us closer together."
        },
        {
            "text": "My mentor has also seen the benefits. She co-chairs the organisation’s disability network in addition to her day job and was struggling to juggle both. I raised the issue at our executive committee with a view to changing our policy to give people the opportunity and time to do both."
        },
        {
            "text": "What happens at work naturally seeps into our personal lives and the mutual mentoring scheme now means that I’m more aware, wherever I go, whatever I do about how I and others can make things easier for people with disabilities."
        },
        {
            "heading": 2,
            "text": "How DIO is supporting people with disabilities"
        },
        {
            "text": "There are many places that are still not as inclusive or accessible as they could be, but we are making positive changes at DIO."
        },
        {
            "text": "Our recently opened new Head Office has been designed with a strong focus on supporting those with disabilities. It is fully accessible and provides a range of workplace adjustments, from ergonomic chairs to specialist IT equipment. In addition, as we move into the post-COVID-19 era, DIO will continue to support hybrid working. This will ensure that our people have the flexibility to manage their health and wellbeing, working in ways which reflect and support their personal needs."
        },
        {
            "text": "Just having something as simple as a safe space between two colleagues has really opened my mind to the barriers that can affect people with disabilities. This International Day of People with Disabilities, I encourage us all to have open conversations about how we can continue to support diversity and inclusion, both in our working and personal lives."
        }
    ]
}