{
    "url": "https://deframedia.blog.gov.uk/2021/12/03/coverage-of-the-environment-secretarys-announcement-food-and-farming-industry-crucial-to-governments-levelling-up-agenda/",
    "title": "Coverage of the Environment Secretary’s announcement: Food and farming industry crucial to Government’s levelling-up agenda",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Farming",
        "Weekly stories"
    ],
    "pub_date": "2021-12-03T11:24:07+00:00",
    "content": [
        {
            "text": "There has been widespread coverage in the Daily Mail, Sky News, Financial Times, iNews, Western Morning News (p.6), East Anglian Daily Times, Farming UK, Pig World, Business Green and Farming Today of the Environment Secretary’s speech at the Country Land and Business Association conference yesterday (Thursday 2 December). Broadcast coverage last night included from BBC Spotlight, Channel 4 News and ITV News. The announcement was also trailed yesterday in The Times (p.6), BBC Online, Daily Mail, Telegraph (p.31), The Guardian, Farming Today and Farmers Weekly."
        },
        {
            "text": "In his speech, Environment Secretary George Eustice set out his vision for farming, pointing out the importance of the food industry to the Government’s levelling-up agenda. He outlined opportunities to enhance profitable agricultural production and increase food security, alongside delivering on environmental priorities to tackle biodiversity loss and climate change. He said:"
        },
        {
            "text": "The Environment Secretary also shared further details of the Sustainable Farming Incentive – the first of the new environmental land management schemes – which will be rolled out next year. Crucially, farmers will be free to choose the elements of the scheme that work for them."
        },
        {
            "text": "Setting out his priorities for the scheme, Eustice said:"
        },
        {
            "text": "The Environment Secretary also announced that farmers would be able to access funding for an annual health and welfare visit – a fully funded vet visit once a year which can help to reduce endemic diseases and conditions within livestock – providing further financial support and helping to raise animal welfare standards even further."
        },
        {
            "text": "Mark Tufnell, President of the Country Land and Business Association said:"
        },
        {
            "text": "Further details on the Sustainable Farming Incentive are available here. A video of the Secretary of State speech at the CLA is available at this link."
        },
        {
            "text": "Information on the Landscape Recovery and the Local Nature Recovery schemes – the other two new environmental land management schemes which will complement the SFI – will be provided in the new year."
        }
    ]
}