{
    "url": "https://equalities.blog.gov.uk/2021/12/03/covid-disparities-report-key-findings-and-next-steps/",
    "title": "COVID disparities report: key findings and next steps",
    "authors": [
        "Race Disparity Unit",
        "Kemi Badenoch, Minister of State for Equalities"
    ],
    "categories": [
        "GEO team"
    ],
    "pub_date": "2021-12-03T19:04:47+00:00",
    "content": [
        {
            "text": "One of the most pressing questions posed by the pandemic has been why ethnic minorities have been so disproportionately affected?"
        },
        {
            "text": "It was evident from the outset that these communities appeared to be more vulnerable. "
        },
        {
            "text": "We saw that in the faces of many doctors, nurses and NHS staff who tragically lost their lives while saving others. "
        },
        {
            "text": "It was also evident in high rates of hospitalisation and high death rates among ethnic minority patients. "
        },
        {
            "text": "The pandemic has undoubtedly shone a spotlight on existing health inequalities, but it was clear that we needed to do more to understand the experience of ethnic minority communities to help us respond better to the virus. "
        },
        {
            "text": "That is what the quarterly report on the ‘Progress to address COVID-19 health inequalities’ being published today helps us to achieve. "
        },
        {
            "text": "It is the fourth and final and in a series of reports looking into this vital issue which I have led at the Prime Minister’s request. "
        },
        {
            "text": "It points to two factors as the reason for the higher risk of infection that ethnic minorities face. "
        },
        {
            "text": "First, these communities are more likely to live in built-up areas – towns and cities – where the virus is more easily transmitted. "
        },
        {
            "text": "It is obvious that somebody living in a densely populated London borough is more at risk than someone living in the rural Lake District. "
        },
        {
            "text": "However, this risk is compounded by the fact that ethnic minorities are also more likely to live with other members of their family. So, if a daughter or son contracts COVID-19, it’s likely that they’ll then pass it on to their parents or grandparents.  "
        },
        {
            "text": "Second, ethnic minorities are more likely to work in frontline, public-facing jobs. "
        },
        {
            "text": "They are more likely to be nurses, doctors, police officers, delivery drivers – jobs which demand day-to-day public interaction. "
        },
        {
            "text": "These essential workers have become synonymous with the quiet sacrifice and selflessness that saw us through the worst of the pandemic, but it has come at a very high cost. "
        },
        {
            "text": "People in these jobs are more likely to be exposed to the virus during the working day and more likely to accumulate a higher viral load of COVID-19 as a result. "
        },
        {
            "text": "Recent evidence published in this report suggests that genetics also plays a part. "
        },
        {
            "text": "We know that at least 60 per cent of south Asian people carry a gene which doubles the risk of respiratory failure from COVID-19. "
        },
        {
            "text": "This gene is only carried by two percent of Afro-Caribbean people and 16 per cent of people with European ancestry. "
        },
        {
            "text": "So, there’s no hiding from the fact that some ethnic minority groups are more vulnerable than others. "
        },
        {
            "text": "As this particular gene affects the lungs - not the immune system – we know that the increased risk is largely cancelled out by the COVID vaccine."
        },
        {
            "text": "Therefore, while we can’t alter our genes, we can certainly alter our immunity by making sure we get vaccinated and get the booster jab. "
        },
        {
            "text": "That’s one of the reasons why the Government has worked flat out to identify at-risk ethnic minorities so that vulnerable people could be vaccinated sooner. "
        },
        {
            "text": "This builds on our relentless efforts, to reach out to ethnic minority groups and ensure that guidance was communicated as clearly and quickly as possible. We now need to ensure that those at greater risk take up their booster jabs to ensure continued protection from the virus."
        }
    ]
}