{
    "url": "https://ukhsa.blog.gov.uk/2021/12/03/five-years-of-the-uk-public-health-rapid-support-team/",
    "title": "Five years of the UK Public Health Rapid Support Team",
    "authors": [
        "Ben Gannon"
    ],
    "categories": [
        "Global health"
    ],
    "pub_date": "2021-12-03T11:34:33+01:00",
    "content": [
        {
            "text": "The UK Public Health Rapid Support Team (UK-PHRST) was created five years ago after the Ebola outbreak in West Africa in 2014-16 to support Low- and Middle-Income Countries (LMICs) to prepare for and respond to public health outbreaks. In those five years, the team has achieved a great deal. We have deployed to outbreaks 23 times and commissioned 40 research projects."
        },
        {
            "text": "Reflecting on my experience in the team, I am struck by how much I have learnt from first working as a senior microbiologist to now working as the Interim Director. I continue to learn every single day, and the actions UK-PHRST takes always begin with learning – we rely on the experiences of our colleagues, our multidisciplinary team and overseas partners."
        },
        {
            "text": "It is these groups and individuals, and how we collaborate, which makes the difference. Their tireless work, passion and commitment bring together multiple institutes, programmes and countries to achieve common goals. We have made substantial gains by collaborating, but there is always room to improve how we work together to prepare for and respond to outbreaks."
        },
        {
            "heading": 2,
            "text": "Adapting ways of working"
        },
        {
            "text": "The pandemic has meant we have had to take stock of how we work. The onset of the COVID-19 has radically changed the world we live in and brought outbreak preparedness to the forefront of public health and public consciousness – UK-PHRST has never been more relevant than it is today."
        },
        {
            "text": "COVID-19 has challenged the world and challenged the team. But we have adapted quickly to ensure we continue to provide multidisciplinary support, in-person and delivered remotely, to aid many nations in their actions across a wide range of technical areas. Those areas include:"
        },
        {
            "text": "UK-PHRST has succeeded on multiple fronts. We have supported and strengthened outbreak responses across the world. Our research and our projects have flexed to the needs and concerns of Low- and Middle-Income Countries and the unique challenges COVID has presented to these nations. We have carried out rapid research to address knowledge gaps when studying outbreaks, including questions about the barriers to vaccine rollouts or the importance of addressing mental health and psychosocial support during outbreaks."
        },
        {
            "text": "There are exciting developments on the horizon, and I look forward to continuing our work with the same passion and in the same spirit of curiosity and collaboration. I see three core elements shaping our future work: partnerships, impact and learning."
        },
        {
            "text": "Developing and strengthening partnerships means we can act when and where it is needed. Working with the UK government, the World Health Organization (WHO) and the Global Outbreak Alert and Response Network  (GOARN), we have created a global network that shapes policy and frames the outbreak responses of the future. Our partnerships within Low- and Middle-Income Countries are the most critical, tackling disease at the frontline and enabling progress in preparing for the next epidemic and working together to ask key questions to allow us to respond better in the future."
        },
        {
            "heading": 2,
            "text": "Looking ahead"
        },
        {
            "text": "In the years ahead, the expertise of regional and national partners will continue to provide substantial gains by sharing their knowledge and cultural insights. The advantages from partnerships are clear: the bringing together of ideas, expertise and experiences support deployment, research and capacity development projects. In turn, this enables UK-PHRST and our partners to meet mutual goals and improve responses – the impact of our work is increased as it is aligned ever more closely to local needs. This work will continue to be strengthened by embedding Equity and Human Rights, Monitoring and Evaluation into the programme."
        },
        {
            "text": "Our research programme continues to ask critical questions on how operational responses can be better managed and put into practice. We plan to improve our strategy by addressing critical evidence gaps that we identify through systematic appraisal. This, taken together with the learning from 5 years of this programme and from the pandemic, will ensure our actions are tailored, specific and more impactful."
        },
        {
            "text": "There are challenges ahead; we work in a challenging environment. But I am incredibly optimistic. Global capacity for disease monitoring and response has never been higher and our challenge now is to seize the opportunities, to work together, and to further strengthen surveillance and public health systems to enable better outbreak response."
        },
        {
            "text": "If what we have achieved in five years is a measure of what we will achieve in the future, then the UK-PHRST will continue to demonstrate the practical benefits of close partnerships for Low- and Middle-Income Countries around the world."
        }
    ]
}