{
    "url": "https://insolvencyservice.blog.gov.uk/2021/12/03/international-volunteer-day-volunteering-through-the-insolvency-service/",
    "title": "International Volunteer Day: Volunteering through the Insolvency Service",
    "authors": [
        "Lisa Scott"
    ],
    "categories": [
        "People",
        "Volunteering",
        "Working for the Insolvency Service"
    ],
    "pub_date": "2021-12-03T09:48:00+00:00",
    "content": [
        {
            "text": "I'm Lisa, and I'm an Accredited Financial Investigator here at the Insolvency Service. I'm also passionate about my voluntary work, so early last year, I wrote a blog about volunteering at my local foodbank."
        },
        {
            "text": "To mark the United Nations International Volunteering Day, I thought it was the right time to share some updates about how I’ve been getting on at the foodbank."
        },
        {
            "heading": 2,
            "text": "Volunteering at the foodbank "
        },
        {
            "text": "In October 2019, as part of The Church in Great Notley’s outreach project we opened a foodbank distribution centre. We came under The Braintree Area Foodbank, which is overseen by the Trussell Trust."
        },
        {
            "text": "The Insolvency Service gives staff the opportunity to volunteer in their communities for 5 days a year. I make sure I put that benefit to good use and the allowance enables me to volunteer a morning a month at the centre."
        },
        {
            "text": "Not only do we have volunteers in the centres, but also in the warehouse, weighing in food donations, sorting them into their individual categories and then packing the food into boxes. The boxes are then picked up by our drivers who deliver the parcels to the centres and then collect the food donations from various churches and shops. We also have numerous office volunteers who deal with fund raising, admin, PR & everything and anything that people throw at them!"
        },
        {
            "heading": 2,
            "text": "An increase in volunteers "
        },
        {
            "text": "During the first wave of the pandemic, our volunteer numbers shot up. We saw a huge number of people who found themselves furloughed or back from university, offering to volunteer with us. In fact, at one point we had to say ‘thank you but no thank you’ as we didn’t have any volunteer slots left."
        },
        {
            "text": "Initially, we distributed three times more food than we had donated which meant our supplies would eventually run out. Then the supermarkets stepped up and donated essential food supplies and delivered them direct to us. Thankfully, this allowed us to continue to operate, and our first shop donation weighed in at just under a tonne."
        },
        {
            "text": "Once again, the public stepped up and in December 2020 we had the equivalent of three months of donations donated to us in one month. This was amazing, despite the stress it put on the warehouse volunteers and our shelves."
        },
        {
            "heading": 2,
            "text": "Making a difference"
        },
        {
            "text": "On my walk home from work, I would walk through town and I would always pop into a little local independent coffee shop. I began chatting to the staff and we got onto talking about the foodbank. Out of that conversation, the coffee shop now donates jams and spreads to the foodbank every 6 months. Yes, our clients need staple foods but a little treat like jam, honey or peanut butter makes a big difference."
        },
        {
            "text": "As life slowly returned to normal, all the centres reopened but with one difference; we still didn’t feel safe letting clients in through the doors.  Some centres had 13 clients a day and if one person had COVID-19 without knowing, the knock-on effect would be huge. We addressed the clients at the door, which was protected by a screen, signposted them as well as we could and then delivered their food to another door."
        },
        {
            "text": "Overall, the need for foodbanks in our area is lower than we anticipated. This could be because some community food hubs opened, where if you need something you just pop along and get what you need."
        },
        {
            "text": "At our foodbank we like to make sure you are getting the help you need so that you don’t become reliant on foodbanks. We prefer to use a referral voucher system, therefore providing vital signposting to other agencies and support groups."
        },
        {
            "text": "Since April, our centre at Great Notley has actioned 53 vouchers. This has fed 75 adults and 97 children, totalling some 1,548 meals. For me, it’s been such a bonus the Insolvency Service is happy for me to volunteer my time once a month. It’s certainly something I recommend anybody enquiring about."
        },
        {
            "text": "One of our centres has just started offering a Citizens Advice advisor who can provide help and support immediately, for simple things like making sure you’re claiming all the benefits you’re entitled to."
        },
        {
            "text": "I love volunteering at the foodbank. Sometimes we’ll help one person that day, or one family, sometimes with children, sometimes on their own, but it’s support they needed, and we were able to offer it."
        },
        {
            "heading": 3,
            "text": "Further information"
        }
    ]
}