{
    "url": "https://insidehmcts.blog.gov.uk/2021/12/03/local-court-initiatives-making-a-difference-to-our-recovery/",
    "title": "Local court initiatives making a difference to our recovery",
    "authors": [
        "Mark Stewart"
    ],
    "categories": [
        "COVID-19",
        "Working at HMCTS"
    ],
    "pub_date": "2021-12-03T11:00:07+00:00",
    "content": [
        {
            "text": "Responding to, and recovering from, the impact of the pandemic has been a real team effort. Whether it’s large scale national projects running at pace to deliver more capacity for court hearings, or creative solutions to challenges faced by individual courts – the ingenuity and commitment of HMCTS staff and those they work with has been incredible to see."
        },
        {
            "text": "And, while some of our bigger initiatives have been part of national announcements, I want to use this blog to recognise the work happening at courts across our estate around England and Wales."
        },
        {
            "text": "Working with others to increase court capacity"
        },
        {
            "text": "HMCTS staff have worked tirelessly over the last 18 months to increase court capacity via Nightingale courts, additional rooms and Portakabin units.  That work has often been supported behind the scenes by colleagues across the justice system."
        },
        {
            "text": "Our operational teams across Wales worked with their area’s Police and Crime Commissioners (PCCs) to establish extra capacity. For example, the South Wales PCC, Alun Michael, has worked in partnership with HMCTS to expedite and secure the use of the Civic Centre in Swansea and the City Hall in Cardiff to provide extra rooms for the local Crown Courts."
        },
        {
            "text": "Elsewhere, our court and regional staff have been working with the judiciary and other key stakeholders to conduct ‘trial blitzes’ in Magistrates’ courts as social distancing restrictions ease. This combines opening up some additional court rooms, as well as repurposing under-listed courts into trial courts.  These involve listing 4 to 5 short and routine trials per day sitting with two judges and one bench over a period of one or two weeks. For example, we have moved traffic trials for Lincolnshire and Northamptonshire cases into dedicated trial courts in Leicestershire, releasing approximately 200 hours of court time for higher priority trials in those locations. The dedicated traffic trial courts are clearing 24 traffic trials per court."
        },
        {
            "text": "Modifications for cases with multiple defendants"
        },
        {
            "text": "Hearing cases involving multiple defendants has been a challenge during the pandemic when social distancing has limited space within courtrooms. We’ve opened two 'super courtrooms' in Manchester and Loughborough. Elsewhere work across England and Wales has continued to accommodate trials with a number of defendants, their legal representatives, witnesses, security and others, often using two or three courtrooms. These have included large murder trials in Crown Court buildings at Leeds (6 defendants), Preston and Reading (both 8 defendants)."
        },
        {
            "text": "Meanwhile Lincoln Crown Court, in the grounds of Lincoln Castle, is a small and unique site where courtrooms have limited flexibility and space is restricted. Recently, the court staff have worked with the Prisoner Escort and Custody Services (PECS) to re-evaluate dock space and introduce new ways of working that allow for more defendants in the dock. This means the court can hear cases with two or three defendants and start to make inroads into outstanding multi-handed cases."
        },
        {
            "text": "It’s not just docks that are being modified to increase capacity. At Snaresbrook Crown Court this winter we’re adding a secure unit to accommodate an additional 12 defendants in custody when they’re at court."
        },
        {
            "text": "Hearing fraud cases through the pandemic"
        },
        {
            "text": "Throughout the pandemic, courts have prioritised cases of the utmost seriousness where the safety of the public or individuals is a concern. But we’re still dealing with other cases that impact people’s lives. Fraud is an example. Between 1 April 2020 and 30 June 2021, a total of 3,569 cases have been dealt with across England and Wales where a fraud charge was the primary offence. Of these cases, 110 were dealt with by Southwark Crown Court and its Nightingale court annex, Prospero House. These courts support some of the longest and most complex fraud cases, despite the challenges imposed by the pandemic."
        },
        {
            "text": "Southwark Crown Court has also heard complex people trafficking cases. In these, remote hearing technology has come into its own, with witnesses giving evidence from abroad via video link. This means trials, like one recently where five people were convicted of ‘modern slavery’ offences’, can continue despite any travel restrictions that might be in place."
        },
        {
            "text": " Improving access to justice "
        },
        {
            "text": "In Wales, vulnerable victims and witnesses of domestic abuse and sexual violence can go to thirteen sites to give evidence via video as an alternative to physically attending a courtroom.  Some sites, such as one in Llanelli, are already available and others, such as Cardiff, will be opened over the next few months.  The sites are in secure locations, away from court, and based in supportive surroundings so that vulnerable victims and witnesses feel safe."
        },
        {
            "text": "In Newcastle, the new Civil & Family Courts and Tribunals Centre – officially opened in July 2021 – has opened up opportunities. It now accommodates Civil, Family and Tribunal hearings and supporting teams, which has freed up space within Newcastle Combined Court to create four more magistrates’ courtrooms, cells suitable for defendants on remand and better facilities for witnesses, victims and defendants. This means local cases can be heard within the city centre improving access to justice for all."
        },
        {
            "text": "In the South East, staff have looked at trends in complaints so that they could identify problems – and resolve them more quickly. The team in Chelmsford County Court found a better way to keep court users informed about the listing process to proactively manage expectations."
        },
        {
            "text": "Many locations, including St Albans and Peterborough Crown Courts, have used video links to allow the public to observe hearings, supporting the principle of open justice, despite the challenges the pandemic poses."
        },
        {
            "text": "Finding creative ways to increase Crown Court work"
        },
        {
            "text": "Two additional Crown Court rooms have been created in Cloth Hall Court, the Nightingale venue in Leeds. Last year, it was used for business and property court work (freeing up courtroom space in the main combined court) and in September 2021 it also began hearing Crown Court cases from across the West Yorkshire area."
        },
        {
            "text": "In Teesside Magistrates’ Court, Court 1 is being used for non-jury Crown Court work up to three days a week, enabling capacity for an additional jury trial court at Teesside Crown Court."
        },
        {
            "text": "Meanwhile, Sheffield Crown Court has now increased the use of fully remote hearings, dealing with more than 1,000 cases since its introduction."
        },
        {
            "text": "And in the south east, Luton and St Albans Crown Courts are using two courtrooms at Huntingdon Law Courts for an additional two jury trial rooms."
        },
        {
            "text": "Working towards a common goal"
        },
        {
            "text": "Every court and tribunal, service centre and support office is working towards our common goal of improving access to justice for all. I couldn’t list every effort being made, but this gives a glimpse of the commitment, creativity and determination of HMCTS staff to achieve a common purpose."
        }
    ]
}