{
    "url": "https://space.blog.gov.uk/2021/12/03/the-night-sky-in-december-2/",
    "title": "The night sky in December",
    "authors": [
        "Derek Smale"
    ],
    "categories": [
        "Astronomy"
    ],
    "pub_date": "2021-12-03T11:33:08+00:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "The Winter Solstice falls on 21 December, marking the point where the Earth’s north pole reaches its maximum tilt away from the Sun."
        },
        {
            "text": "This brings the shortest day and longest night of the year – and with more than 16 hours of darkness, it’s the perfect time for some stargazing!"
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Stars and constellations"
        },
        {
            "text": "The constellations of Pisces, Andromeda, Pegasus and Cetus dominate the southern sky after dark, with distinctive Cassiopeia almost directly overhead."
        },
        {
            "text": "As night falls, the constellations of Aquila and Cygnus can be seen dropping low in the west, while in the east, the beautiful winter constellations of Auriga, Taurus and Orion climb quickly into the evening sky."
        },
        {
            "text": "All of these sit within the great galactic arms of our Milky Way galaxy which arches high overhead, and are packed with stars, making it a great time of year to try to view the night sky from darker, less light-polluted skies."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Meteor showers this month"
        },
        {
            "text": "December hosts one of the most spectacular meteor showers in the calendar, the Geminids, which peaks this month between 13 and 14 December."
        },
        {
            "text": "Often producing over 100 meteors an hour, this shower will likely be at its most visible after midnight, allowing the 80% illuminated Moon to move lower into the western sky."
        },
        {
            "text": "The meteors we see are tiny fragments of rock and dust left behind the 6km (3.5 mile)-wide rocky asteroid known as 3200-Phaethon."
        },
        {
            "text": "The asteroid’s orbit means that every year and a half, it travels in from beyond the orbit of planet Mars, to pass remarkably close to the Sun, heating up as it does so, leaving a trail of dust and fragments of rock that Earth passes through."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "The Moon and Planets"
        },
        {
            "text": "Planets Venus, Saturn and Jupiter continue their spectacular early evening line up, low in the south after sunset."
        },
        {
            "text": "By the end of the month, they are joined by Mercury, which sits just below brightest planet Venus in the last week of the month."
        },
        {
            "text": "Mars reappears low in the south-east just before dawn, and will sit just to the left of an 8% illuminated Moon on the last day of the year."
        },
        {
            "text": "The full Moon will appear on the boundaries of Orion, Auriga and Gemini on 19 December, while the darker nights of the month will occur around the time of the new Moon on 4 December."
        },
        {
            "text": "While some parts of the world will experience a solar eclipse on 4 December, sadly it won’t be visible from the UK.  We’ll have to wait until October next year for the next chance to see a partial eclipse of the Sun."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Space Exploration"
        },
        {
            "text": "There are a number of exciting space missions in progress at the moment."
        },
        {
            "heading": 4,
            "text": "James Webb Space Telescope"
        },
        {
            "text": "December sees the launch of the much-anticipated James Webb Space Telescope, which is scheduled to lift off from French Guiana on 22 December."
        },
        {
            "text": "The telescope, which is the largest ever sent into space, will study the first stars and galaxies to form in the Universe, and examine the physical and chemical properties of planets and solar systems outside of our own."
        },
        {
            "text": "It is highly complex, and has been in development for many years, so the launch and subsequent unfolding of the telescope’s panels and sunshield will be an exciting, but nerve-wracking couple of weeks – you can find out more here."
        },
        {
            "text": "JWST is widely seen as the successor to the Hubble Space Telescope, and its significantly larger light-gathering capability makes it many times more powerful than Hubble, which launched in 1990."
        },
        {
            "heading": 4,
            "text": "‘DART’ asteroid impact mission"
        },
        {
            "text": "NASA’s ‘Double Asteroid Re-direction Test’ mission launched on 23 November, targeting a pair of asteroids that orbit each other - known as a binary."
        },
        {
            "text": "The larger of the two objects, called Didymos, measures around 780 metres across, while its smaller companion - Dimorphos - is around 160 metres wide."
        },
        {
            "text": "The Dart spacecraft will smash into Dimorphos next year at a speed of around 24,000km/h (15,000mph), which should slightly alter the smaller asteroid’s speed and orbit around Didymos.  This will allow scientists to see if this ‘kinetic impactor technique’ is a viable solution to the threat of any Earth-bound asteroids we may discover in the future."
        },
        {
            "text": "In 2024, the European Space Agency’s ‘HERA’ mission will launch to fully investigate the impact of the DART mission on the asteroid pair."
        },
        {
            "heading": 4,
            "text": "Meanwhile on Mars"
        },
        {
            "text": "The remarkable helicopter ‘Ingenuity’ is still performing flights across the Martian surface."
        },
        {
            "text": "NASA hoped it would achieve three flights to demonstrate that the technology could work in Mars’ thin atmosphere, following its landing on board the Perseverance Rover back in February."
        },
        {
            "text": "Last month, however, the plucky 1.8kg helicopter completed its 16th flight!  You can keep up with its latest adventures here."
        },
        {
            "heading": 4,
            "text": "The International Space Station"
        },
        {
            "text": "The first week of December will see some high, bright, evening passes of the International Space Station, with the better passes later in the month occurring in the mornings.  Thankfully, with having more hours of darkness this month, you don’t have to get up too early to see it!"
        },
        {
            "text": "On many passes, the Space Station can be visible for five or six minutes - visit https://www.heavens-above.com/ for a full list of the passes for your location."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Did you know - early January has another spectacular meteor shower!"
        },
        {
            "text": "With Christmas coming up, January’s blog may go up a little late!  But don’t forget to look out for the Quadrantids meteor shower at the start of January."
        },
        {
            "text": "This is another prolific and spectacular meteor shower, that’s expected to peak around 3 – 4 January."
        },
        {
            "text": "This falls at the time of a new Moon, and the darker skies this provides means you’ll be much more likely to see some of the fainter meteors as they zip across our night sky!"
        },
        {
            "text": "Wishing you a happy, peaceful holiday season, clear skies and plenty of meteors!"
        }
    ]
}