{
    "url": "https://environmentagency.blog.gov.uk/2021/12/03/the-furniture-upcycler-who-fixed-his-mistake-after-illegally-entering-the-waste-trade/",
    "title": "The furniture upcycler who fixed his mistake after illegally entering the waste trade",
    "authors": [
        "elenaholmes"
    ],
    "categories": [
        "Regulated industry",
        "Waste"
    ],
    "pub_date": "2021-12-03T16:54:05+00:00",
    "content": [
        {
            "text": "Ed Troughton, Waste Crime Engagement Specialist at the Environment Agency, provides his insights into tackling the handling of illegal waste without a permit. "
        },
        {
            "text": "My three-year-old son spends most of his time making a mess. Sometimes he’ll spill food or his milk by accident (or possibly negligence). Because he’s young and learning about life, we give him a chance to sort it out. Having shown him how to mop up a spill, he will now run to get the towel or cloth and gleefully clean up himself – proudly telling us when he’s done."
        },
        {
            "text": "As adults, when we hear of wrongdoing we automatically think it is the job of a court of law to punish the culprit and set the record straight. But not every wrongdoing needs to be dealt with in court. This is one of those stories where someone made a mistake and was given a chance to clear up their own mess before any lasting harm was done."
        },
        {
            "text": "Our waste team had a tip-off that someone in Somerset was handling waste without a permit, which is illegal. The team ran some checks, found the site and business owner and paid him a visit."
        },
        {
            "text": "On arrival, the officers were met with threats and abuse from the business owner, who was running a small business 'upcycling' furniture - creatively restoring value to old goods - and had branched out into collecting waste for the last 6 or 7 weeks. He was told to cease his waste activity and clear what he had accumulated from the site using proper disposal services."
        },
        {
            "text": "Meanwhile, the council confirmed there was no planning permission for a waste operation at the site and the landlord was not aware his tenant was running an unpermitted waste business. He agreed to amend the tenancy agreement to forbid such activity."
        },
        {
            "text": "Shortly afterwards the furniture upcycler got in touch, accepting responsibility and expressing remorse for threatening and abusive behaviour on the day of the site visit. During interview, he said that he stopped bringing waste onto the site as soon as he was aware he needed a permit. He admitted that he had been naïve and negligent and was not aware of the cost or regulatory requirements for running a permitted waste facility."
        },
        {
            "text": "With all the evidence and an admission of guilt, we could have gone to court. But the remorse was genuine and the businessman showed evidence he had cleaned up his own mess properly at his own cost. So we chose not to prosecute and instead issued a formal warning."
        },
        {
            "text": "Environmental threat from this offending was low, so the greater problem was the undermining of legitimate businesses. Someone who works illegally can undercut costs significantly by not paying for registrations or permits, having no administrative overheads and not paying proper costs and tax for waste disposal. Our early intervention paid dividends."
        },
        {
            "text": "By acting on the intelligence we received, and carrying out a thorough investigation, we were able to prevent further illegal activity. We ensured that legitimate businesses were not undercut while stopping the operator from escalating his illegal operations to the point where prosecution would have been necessary."
        },
        {
            "text": "Taking a case to court takes time, resources and money. We have to consider whether a prosecution is proportionate to the offence, and the response of the defendant. Who, in this case, recognised his wrongdoing, stopped once we intervened and cooperated fully with the investigation. Not unlike my son."
        }
    ]
}