{
    "url": "https://forestrycommission.blog.gov.uk/2021/12/03/theres-more-to-trees-than-meets-the-eye/",
    "title": "There’s more to trees than meets the eye",
    "authors": [
        "Chris Waterfield"
    ],
    "categories": [
        "Woodland creation"
    ],
    "pub_date": "2021-12-03T08:00:16+00:00",
    "content": [
        {
            "text": "When you think of a quintessential English farm, the value of trees and woodlands may not be the first thing that springs to mind. However, with accelerating interest in sustainable and environmentally-friendly land management, that perception is changing."
        },
        {
            "text": "Planting trees on your farm can bring a wealth of benefits for your land and importantly, your bottom line. That’s why we’ve put together 10 compelling reasons to consider woodland creation."
        },
        {
            "text": "Tree planting can present opportunities to diversify, generate additional income, increase farm productivity, and enhance your land – whilst also supporting wider environmental goals. Here’s how."
        },
        {
            "heading": 2,
            "text": "Top 10 reasons farmers should consider planting trees"
        },
        {
            "heading": 3,
            "text": "1. Prevent soil erosion"
        },
        {
            "text": "An estimated 2.9m tonnes of topsoil is eroded in the UK due to wind and rainfall – planting tree shelterbelts around your farm lowers windspeed to help reduce that erosion. Creating woodland between the field edge and a river can reduce sediment run-off by 90-100%, nutrient losses by 20-80%, and reduce pesticide loss in run-off by 60-100%."
        },
        {
            "heading": 3,
            "text": "2. Protect livestock and crops"
        },
        {
            "text": "Trees help protect your livestock and crops against more frequent extreme weather conditions that we’ve seen over the recent past. Planting a shelterbelt of trees gives protection that could reduce lamb losses by up to 30% and increase overall productivity."
        },
        {
            "text": "Planting tree shelterbelts can also help to safeguard crops from strong crosswinds and heavy rainfall and even prolong the growing season for grass by raising the soil temperature during colder months. Integrating trees into your landscape can also protect crops during periods of drought, by reducing wind speeds and helping to reduce moisture lost to the air."
        },
        {
            "heading": 3,
            "text": "3. Get paid for creating and managing woodlands"
        },
        {
            "text": "You can get financial support through the Forestry Commission and via our partners, helping to make woodland creation a reality for you. Our flagship England Woodland Creation Offer supports new woodland creation by:"
        },
        {
            "text": "You can also retain Basic Payment Scheme payments and receive a contribution towards the costs of access infrastructure."
        },
        {
            "text": "The Woodland Creation Planning Grant (WCPG) enables you to assess the suitability of your land for woodland creation, and to design a UK Forestry Standard (UKFS) compliant woodland. Up to £30,000 per application is available and a Forestry Commission Woodland Creation Officer can assist in the production of a plan."
        },
        {
            "heading": 3,
            "text": "4. Generate reliable income streams"
        },
        {
            "text": "With timber in high demand now and into the future, you could benefit from reliable short or long -term revenue streams: planting and harvesting fast-growing trees that can be coppiced or felled on a frequent cycle can provide a quicker turnover. Local woodfuel production can provide efficient on-farm energy savings to heat your buildings or give you an income from sales."
        },
        {
            "text": "There are also other wood products to consider, such as the production of Christmas trees, wood for construction and furniture, as well as coppice materials or wood chippings and temporary fencing."
        },
        {
            "text": "A working woodland is also subject to a range of tax reliefs, including:"
        },
        {
            "heading": 3,
            "text": "5. Diversify your business"
        },
        {
            "text": "Now is a good time to branch out – woodland creation can help you diversify your farm practices, helping to strengthen business resilience and generate alternative income streams. With that in mind, woodlands can provide the perfect setting for recreation and leisure activities, including glamping, game shoots, and mountain biking. You could also consider alternative crops to produce and sell fruits and nuts – and avoid having all your eggs in one basket."
        },
        {
            "heading": 3,
            "text": "6. Cut farm pollution"
        },
        {
            "text": "The Environment Agency has recorded that approximately 25% of phosphates and 50% of nitrates found in our rivers come from agricultural practices. Planting woodland shelterbelts around your farm can reduce spray drift up to 90%, as well as helping to capture pesticide run-off and ammonia released from livestock units. The England Woodland Creation Offer supports planting shelterbelts down to 10 metres in width."
        },
        {
            "heading": 3,
            "text": "7. Offset your carbon emissions"
        },
        {
            "text": "Woodlands play an important role in addressing climate change. Trees act as a natural ‘carbon sink’ by removing and storing carbon dioxide from the atmosphere."
        },
        {
            "text": "Registering your new woodland with the Woodland Carbon Code allows you to sell carbon units for every tonne of carbon dioxide (CO2) sequestered as early as 5 years after planting, validating, and verifying your woodland through the code. This could help you to generate revenue through their sale or help to offset your farm business’ carbon emissions to help meet increasing demand for net zero supply chains."
        },
        {
            "heading": 3,
            "text": "8. Increase farm productivity"
        },
        {
            "text": "Combining trees with crops and livestock can result in healthier soil, which could lead to more sustainable yields and enhanced biodiversity. Agroforestry can also help increase farm productivity and better utilise your land. Finding the right areas on your farm to plant trees (where grazing is poor, or the land requires more fertiliser) could reduce inputs and improve overall productivity."
        },
        {
            "heading": 3,
            "text": "9. Create natural flood management and improve water quality"
        },
        {
            "text": "Woodland in the right place helps slow run-off from your land as well as helping to reduce water pollution in our streams, rivers, and lakes. The England Woodland Creation Offer can provide contributions up to £2,500/ha for flood mitigation, improving water quality, and riparian buffers – you can also qualify for extra nature recovery contributions on top of that."
        },
        {
            "heading": 3,
            "text": "10. Boost biodiversity"
        },
        {
            "text": "As custodians of just over 9 million hectares of our English countryside, you can play a pivotal role in boosting nature recovery. All woodlands are home to a wealth of wildlife, from red squirrels to goldcrests, and create a habitat for a rich array of plant and fungi species."
        },
        {
            "text": "Making smaller woodlands bigger or connecting existing woodlands with one another can help expand habitats and encourage vital wildlife corridors. The England Woodland Creation Offer can provide contributions up to £2,800/ha for contributing to nature recovery with new woodland in the right place and with the right features."
        },
        {
            "heading": 2,
            "text": "Why plant now?"
        },
        {
            "text": "Now is the time to put down roots and create a legacy that benefits you and the generations to come. There is a range of support and funding available from the Forestry Commission and other organisations, designed to help make woodland creation a reality for you."
        },
        {
            "heading": 3,
            "text": "You may also be interested in our partner woodland creation grants"
        },
        {
            "text": "England's Community Forests Trees for Climate Fund: Expert support and up to 100% flexible and bespoke grant funding for up to 15 years. Open to all landowners within any Community Forest area."
        },
        {
            "text": "The National Forest: Generous grants and support for tree planting, forest creation and habitat management in the Midlands, available to landowners within the 200 square miles of the National Forest. Grants schemes offer funding to cover design, planning and up to 100% of implementation costs."
        },
        {
            "text": "Northern Forest: A partnership between the Woodland Trust, Mersey Forest, Manchester City of Trees, White Rose Forest and HEYwoods, with funding from the government’s Nature for Climate Fund. You can secure up to 100% of the capital costs of woodland creation and a generous maintenance budget."
        },
        {
            "text": "Woodland Trust: Offers three national grants: MOREwoods and MOREhedges covering up to 75% of planting costs for a range of woodland creation, starting from 1.25 acres or 100 metres of new hedging, and Trees for Your Farm, funding up to 100% of costs for bespoke agroforestry schemes."
        },
        {
            "text": " "
        }
    ]
}