{
    "url": "https://deframedia.blog.gov.uk/2023/10/02/coverage-of-the-introduction-of-restrictions-on-a-range-of-single-use-plastics/",
    "title": "Coverage of the introduction of restrictions on a range of single-use plastics",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Pollution",
        "waste"
    ],
    "pub_date": "2023-10-02T13:06:27+01:00",
    "content": [
        {
            "text": "Bans and restrictions on a range of polluting single-use plastic items came into force on Sunday 1 October. Single-use plastic cutlery, balloon sticks and polystyrene cups and food containers can now no longer be sold in England, and the supply of single-use plastic plates, trays and bowls has also been restricted."
        },
        {
            "text": "There has been widespread national coverage of the restrictions, including on the Today Programme, Good Morning Britain, BBC Online, Sky News, ITV News, the Telegraph, I News, the Independent, the Daily Mail, and the Mirror, as well as in trade and regional media."
        },
        {
            "text": "Research shows people across England use 2.7 billion items of mostly plastic single-use cutlery and 721 million single-use plates every year, but only 10% of these are recycled. If 2.7 billion pieces of cutlery were lined up, they would go round the world more than eight-and-a-half times."
        },
        {
            "text": "Environment Minister Rebecca Pow said:"
        },
        {
            "text": " "
        },
        {
            "text": "The single-use plastics ban is part of the Government’s wider world-leading action to tackle the scourge of plastic pollution and eliminate all avoidable plastic waste by 2042. The Government has already banned microbeads in rinse-off personal care products in 2018 and restricted the supply of plastic straws, stirrers and cotton buds in 2020."
        },
        {
            "text": "The Government also introduced the Plastic Packaging Tax in April 2022, a tax of more than £200 per tonne on plastic packaging manufactured in or imported to the UK that does not contain at least 30% recycled plastic."
        },
        {
            "text": "Elsewhere, the Government’s hugely successful single-use carrier bag charge has cut sales in the main supermarkets by more than 98% since its introduction in 2015, taking billions of bags out of circulation."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}