{
    "url": "https://grantscommunity.blog.gov.uk/2023/10/02/find-a-grant-six-months-into-making-it-mandatory-for-uk-exchequer-funded-government-grants/",
    "title": "Find a Grant: Six months into making it mandatory for UK exchequer-funded government grants",
    "authors": [
        "Lucia Webster"
    ],
    "categories": [
        "Civil Service",
        "Digital transformation",
        "Find a Grant",
        "Government Grants Management Function",
        "User research"
    ],
    "pub_date": "2023-10-02T10:09:10+01:00",
    "content": [
        {
            "text": "Six months ago, ministers took a significant step. They made Find a Grant mandatory for departments and arms’ length bodies - and in doing so making it the sole place to advertise eligible government grants."
        },
        {
            "text": "As of today a phenomenal 144.3k people have used Find a Grant to search and apply for grants - which is a massive uptick. So if you have promoted Find a Grant to your professional and personal networks - thank you. Please keep it up - we do want everyone to know it exists."
        },
        {
            "text": "Also the Senior Functional Leadership in the Government Grants profession, departments and arm’s length bodies are working hard to make sure all of their government grants are uploaded.  "
        },
        {
            "text": "So far over £6.3bn worth of grants from over 269 schemes have been advertised through Find a Grant. And each week more are added."
        },
        {
            "text": "I promise none of us will rest until every single eligible government grant is on Find a Grant. We are at about 58% right now. But we will achieve and sustain 100%  -  so that prospective applicants can have full confidence that all eligible government grants are all in one place. "
        },
        {
            "text": "We are also being asked by applicants if local authorities can put theirs on it too. The answer is yes. Just drop us a line if you administer grants in a local authority."
        },
        {
            "heading": 2,
            "text": "So why are we doing all of this?"
        },
        {
            "text": "The new digital platform has brought unprecedented efficiency to government operations. That benefits government officials. It also benefits applicants. They no longer need to endure lengthy - and sometimes fruitless - searches for support. "
        },
        {
            "text": "Find a Grant plays a pivotal role in making grants accessible to all citizens and organisations, regardless of their location, size or status. It has levelled the playing field."
        },
        {
            "heading": 2,
            "text": "Free access for all applicants"
        },
        {
            "text": "And there is more. Find a Grant is - and always will be - free for applicants to search and apply. In the past many organisations have relied on paying for search services - a significant barrier for individuals and organisations with limited financial means. That is no longer the case. "
        },
        {
            "heading": 2,
            "text": "Saving and efficiency"
        },
        {
            "text": "But the BIG prize we have our eyes on is the cost saving and efficiency we can deliver across government. We estimate our work over the next two years could save up to £270 million through efficiencies and fraud prevention. "
        },
        {
            "text": "So what are we doing behind the scenes right now? "
        },
        {
            "heading": 2,
            "text": "Modernising grant administration"
        },
        {
            "text": "Find a Grant not only builds and hosts grant adverts:  we have also built and tested an application form builder to create tailored application forms. Seamlessly integrated with Find a Grant, grant administrators can simply add their own questions for each grant scheme, while also benefiting from universal mandatory questions for essential due diligence checks. "
        },
        {
            "text": "Want to have a look?"
        },
        {
            "text": "If you are a grant administrator in government, a devolved administration or a local authority, you too can access the application builder now by registering with us. "
        },
        {
            "text": "And if we all used it, applicants would only have to use one way of applying for grants. Simple!"
        },
        {
            "heading": 2,
            "text": "One Login is now live on Find a Grant"
        },
        {
            "text": "For those who use the Apply for a Grant feature, you may notice the next time you log on that One Login has been added - the new universal login for all government services. Users have just one account, one username, one password and one identity. It can now be used by businesses and other organisations, as well as individuals."
        },
        {
            "text": "It also saves applicants time too as they only have to enter their details once, be that for Find a Grant, or their passport application or a myriad of other government services. "
        },
        {
            "heading": 2,
            "text": "New integration capabilities"
        },
        {
            "text": "Furthermore, we have built new integration capabilities - enabling Find a Grant to link to other systems via an open application programming interface (API). This will further increase efficiency, reduce risk of fraud and error and improve quality of data;  all with the right controls, security and authorisations in place. It will also allow other government administrators to set up their own integrations without the need or cost of a technical partner.  More savings!"
        },
        {
            "text": "The benefit to applicants of all of us across government using one approach is to make it simpler, faster and fairer for them - as currently they have to ‘learn’ how each department or scheme wants them to apply through a plethora of different application systems. "
        },
        {
            "text": "The first wave of integrations will be tested with Spotlight, the Government Grants Management Function’s due diligence tool that runs a number of required checks on applicants; and more widely with other grant management systems across government."
        },
        {
            "text": "We will keep you updated as this work progresses - right here."
        },
        {
            "text": "If you haven’t already visited, go and have a look at Find a Grant today!"
        },
        {
            "text": "Lucia Webster"
        },
        {
            "text": "Delivery Director, Grants Efficiency Portfolio"
        }
    ]
}