{
    "url": "https://forestrycommission.blog.gov.uk/2023/10/02/introducing-the-woodland-ambassador-programme/",
    "title": "Introducing the Woodland Ambassador programme",
    "authors": [
        "Forestry Commission"
    ],
    "categories": [
        "Woodland creation",
        "Woodland management"
    ],
    "pub_date": "2023-10-02T12:41:00+01:00",
    "content": [
        {
            "text": "Trees and woodlands are at the heart of our landscapes across England. They provide a unique and diverse habitat for thousands of species, capture carbon, help to tackle the effects of climate change, and improve our land, all while connecting us to green spaces, supporting our health and wellbeing. These woodlands are not just part of our environment; they are an essential part of our heritage and a lifeline for future generations."
        },
        {
            "text": "Last week, we were excited to launch our new Woodland Ambassador programme – a programme that will connect farmers, landowners, and industry professionals with similar goals to support woodland creation and management."
        },
        {
            "text": "Steph Rhodes, Delivery Director at the Forestry Commission said:"
        },
        {
            "text": "The Woodland Ambassadors are a diverse group of individuals who share a passion for trees, woodlands, and forests. From your local farmer with generational knowledge and experience to an industry professional who understands the intricacies of woodland management, our ambassadors bring a wealth of knowledge and enthusiasm for trees to the table."
        },
        {
            "text": "Each ambassador is committed to:"
        },
        {
            "text": "Over the coming months, we’ll be sharing individual profiles of each ambassador, but for now you can read about them on our Woodland Ambassador GOV.UK page. Their range of backgrounds and experiences represent the diversity in how woodland can integrate with your land."
        }
    ]
}