{
    "url": "https://equalities.blog.gov.uk/2023/10/02/managing-the-menopause-in-the-workplace-top-tips/",
    "title": "Top tips for managing menopause in the workplace",
    "authors": [
        "geostrategiccomms"
    ],
    "categories": [
        "Equalities",
        "GEO team",
        "Women"
    ],
    "pub_date": "2023-10-02T09:00:21+01:00",
    "content": [
        {
            "text": "To mark Menopause Awareness Month, the Equality Hub is working with employers and professional membership bodies like the Chartered Management Institute (CMI) who have surveyed their members to identify what good support looks like for women experiencing menopause in the workplace."
        },
        {
            "text": "Menopause symptoms, along with a culture of silence, are affecting progression, retention and staff attendance in the workplace."
        },
        {
            "text": "There is a lack of awareness and support on menopause in the workplace. CMI’s research [1] found that 43% of managers either said their organisation does not have any initiatives, resources or mechanisms in place to support employees who are experiencing menopause symptoms or they do not know."
        },
        {
            "text": "CMI shares some top tips for how managers and leaders can support their employees experiencing symptoms of menopause. These include:"
        },
        {
            "text": "CMI is the only chartered professional body for management in the UK, with a membership community of over 200,000. As a charity incorporated by a Royal Charter, CMI is driven by its mission to increase the number and standard of professionally qualified managers and leaders."
        },
        {
            "text": "Additional resources on menopause in the workplace can be found on CMI's menopause support page."
        },
        {
            "text": " "
        },
        {
            "heading": 5,
            "text": "[1] Managers, Voice poll of 1,365 managers, conducted between 24th November and 2nd December 2022"
        }
    ]
}