{
    "url": "https://childrenssocialcare.blog.gov.uk/2023/10/02/my-kinship-care-journey/",
    "title": "My kinship care journey",
    "authors": [
        "Shanayd Warren"
    ],
    "categories": [
        "Kinship care"
    ],
    "pub_date": "2023-10-02T10:42:15+01:00",
    "content": [
        {
            "text": "Shanayd Warren tells us about her personal experience of kinship care, and how she supported her elder sister and her niece in unexpected circumstances."
        },
        {
            "text": "My journey into kinship care"
        },
        {
            "text": "On my journey to becoming a kinship carer, like many in my situation the term was alien to me. Even though I had seen kinship care arrangements within my own family, we had never given it a label."
        },
        {
            "text": "Most would react instinctively to stepping in to care for a loved one in unexpected circumstances. To support a child who is unable to remain in the long-term care of their birth parents and prevent them from having to enter or remain in the care system."
        },
        {
            "text": "In my case, my eldest sister had struggled with long-term, unmanaged mental health issues and traumatic childhood experiences which led to a chaotic lifestyle in her adulthood. In 2019 social services contacted my family to inform us about my niece who had been born and placed into foster care whilst care proceedings were underway."
        },
        {
            "text": "I took on the role supporting my sister and her daughter without hesitation because I wanted to help them both."
        },
        {
            "text": "Challenges along the way and how I overcame them"
        },
        {
            "text": "The most challenging part of my journey was navigating through the process with little and lack of accurate information to fully support me in my caring role and I had to fight for my family to get the help we needed."
        },
        {
            "text": "I wrote to many MPs and local councillors outlining the early challenges I had to overcome as a kinship carer and the importance of recognising and better supporting kinship families, like mine. I wanted to develop allyship with those in the position of power and leadership who could take action to address the needs of children and young people in kinship care arrangements."
        },
        {
            "text": "I had meetings with individuals from the senior leadership team within the local authority, and started to develop a relationship with professionals in my local kinship team. I wanted to encourage working in partnership with professionals and use my lived experience to influence and inform improvements to the core support and information offered to kinship families at a local level."
        },
        {
            "text": "I have continued to campaign and advocate for kinship carers and their families and taken up volunteering roles, starting with charity Kinship as a Someone Like Me peer volunteer. This service helped me early on in my kinship journey, and despite my many difficulties I felt a sense of comfort from those in the same boat as me."
        },
        {
            "text": "I now co-chair The Kinship Care Alliance (KCA), a group of organisations who campaign together internationally. KCA aim to prevent children from being unnecessarily raised outside of their family network, amongst other things."
        },
        {
            "text": "My advice for new or prospective kinship carers"
        },
        {
            "text": "It may seem scary and confusing along the way but remember you're not alone! There is no reward other than the joy and happiness that you will experience seeing your loved one growing and thrive in their own family. The role we play is invaluable and we do it with such courage and determination despite the fact kinship care is not yet fully understood."
        },
        {
            "text": "The most important thing you must remember is to take care of yourself along the journey, and strongly urge finding a local peer-support group to meet others in similar circumstances to support you through the highs and lows. Togetherness is the most powerful force we have to influence positive change."
        },
        {
            "text": "Support for kinship carers "
        },
        {
            "text": "Further information about The Kinship Care Alliance (KCA)"
        },
        {
            "text": "Other blogs about Kinship Care"
        }
    ]
}