{
    "url": "https://naturalengland.blog.gov.uk/2023/10/02/nutrient-mitigation-scheme-continues-to-unlock-new-homes-and-protect-our-waterways/",
    "title": "Nutrient mitigation scheme continues to unlock new homes and protect our waterways.",
    "authors": [
        "Mike Burke"
    ],
    "categories": [
        "Biodiversity",
        "Development",
        "Natural England",
        "Protected sites and species",
        "Species recovery",
        "Wildlife"
    ],
    "pub_date": "2023-10-02T12:17:42+01:00",
    "content": [
        {
            "text": "By Mike Burke, Director of Sustainable Development, Natural England."
        },
        {
            "text": "Government confirmed recently that the Nutrient Mitigation Scheme is still open for business. We hope this is welcome news for developers and Local Planning Authorities (LPAs) as it will provide the certainty needed to enable homes to be built, and for landowners who are keen to enter this market and be rewarded for providing much needed solutions to tackling pollution."
        },
        {
            "text": "In this blog I want to reinforce that Natural England will not only continue to deliver the Nutrient Mitigation Scheme – an initiative to create new wetlands which will mop up existing pollution - but seek to accelerate and widen it. We will work with government and partners more widely to explore all avenues to add pace to the delivery of the full suite of solutions to improve the state of our most important rivers and so enable housebuilding, pollution mitigation and nature recovery to go hand in hand, which is what society needs and wants."
        },
        {
            "text": "Nature and Cleaner Rivers: the context for nutrient mitigation"
        },
        {
            "text": "Our rivers and wetlands in this country are important for wildlife and of huge cultural significance to people. Some of our rivers, wetlands and estuaries affected by pollution are amongst the most precious and wildlife rich in the country. These habitats are home to a wide variety of internationally important species from wading birds to insects and from fish to special plants. They are hugely valued by people and protected by UK law. Natural England remains committed to working with our stakeholders to protect these special sites and deliver nature recovery."
        },
        {
            "text": "Campaigns in the press, on social media and in person have highlighted the issues we face with river pollution. Excess pollution, as a result of issues like an aging sewage network and agricultural intensification, is causing serious damage and if we are to meet our legally binding national and international obligations for nature recovery, it is vital we take concerted, coordinated action to protect them now."
        },
        {
            "text": "There is a lot of good happening for our rivers, and I want to reiterate that Natural England is taking a multi-pronged approach to addressing the pollution problem – from working with the agricultural sector on farm advice and use of incentives like land management schemes, to working with Environment Agency and Water Companies on improvements to water treatment infrastructure. We also work with government to advise on policy as to what measures are needed in sectors as diverse as transport, tree planting and livestock farming. The Government’s Plan for Water, in which Natural England is a delivery partner, makes clear just how much needs to be, and will be, done."
        },
        {
            "text": "Unfortunately, the reality is that the current trend is one of declining health of our rivers. This really is an environmental issue where we need to ‘bend the curve’ towards recovery. This is why the nutrient mitigation scheme is so important to ensure that new housing doesn’t make the situation worse. In previous blogs we have set out why housebuilding needs to play its part in solving this environmental challenge. I should like to emphasise that this is not only the responsibility of housebuilders and many other changes will be needed form other sources of pollution."
        },
        {
            "text": "The nutrient neutrality policy was therefore established by Government to tackle pollution to help meet the government’s legal commitments to restore species abundance whilst enabling sustainable development of new homes. As part of that policy Natural England was asked by the Environment Secretary to deliver the nutrient mitigation scheme. Our role is to deliver practical solutions on the ground - such as funding the creation of new wetlands that will absorb pollution – which offset additional pollution from new houses. We then “sell” these benefits as credits to developers so they can quickly get planning permission and enable much needed homes. The nutrient mitigation scheme works alongside other measures and provides a lasting, sustainable solution that delivers wider public benefits, such as new nature reserves and greenspaces."
        },
        {
            "text": "Housebuilding and Nutrient Pollution - Achievements so far…\nSince being directed by Government to set up a credit scheme in July 2022, we have:"
        },
        {
            "text": "Many developers see the need for shared solutions. Marie Kiddell, at Homes England says, “The proposed nutrient mitigation strategy for Burtree Garden Village, Darlington principally utilises on-site mitigation options. However, a small number of credits were required to deliver a strategy which achieves Nutrient Neutrality and avoids additional impacts to protected habitats. The availability of credits through the Natural England Nutrient Mitigation Scheme, along with measures to be introduced through the Levelling Up and Regeneration Bill, have opened a proportionate, deliverable and cost-effective pathway to this complex issue being resolved. This will enable housing delivery and place making ambitions to be brought to fruition whilst work is undertaken to bring protected habitats back to a favourable condition”."
        },
        {
            "text": "…but there is much more to do."
        },
        {
            "text": "Next steps"
        },
        {
            "text": "Natural England will continue to explore how we can accelerate and expand the delivery of solutions that enable the new homes and nature recovery that people need. This will include:"
        },
        {
            "text": "Investment in a healthy natural environment underpins sustainable economic growth, public health and prosperity. For example it is widely acknowledged that new homes in nature-rich settings have greater economic value. The recent House of Lords Built Environment Committee Report also emphasised that development and environment can and should be delivered hand in hand. We passionately believe that too and are committed to finding solutions that can accelerate development and nature recovery together. Integrated delivery of environmental, social and economic objectives is the only way we will create the conditions for our children to prosper. We certainly need integrated solutions to come faster and at scale – and we will play our full part in making that happen."
        },
        {
            "text": "For further updates, including the release of our new credit round see - How to apply for nutrient mitigation credits from Natural England - GOV.UK\nMore information can be found here;\n• Nutrient Mitigation Natural England Blog March 2023\n• Nutrient Mitigation Natural England Blog July 2022\n• Nutrient Mitigation Natural England Blog November 2022\n• Nutrient Neutrality: A Summary Guide"
        },
        {
            "text": "If you cannot find the answer to your question in the guidance above, please email us.\nNatural England cannot provide comment on the proposed changes to the Levelling-Up and Regeneration Bill. Defra and DLUHC have set up mailboxes. For questions regarding nutrient mitigation and landowners, contact Defra\nFor questions regarding planning and development, contact DLUHC"
        }
    ]
}