{
    "url": "https://medregs.blog.gov.uk/2023/10/02/the-role-of-genetics-in-medicine-safety/",
    "title": "The role of genetics in medicine safety",
    "authors": [
        "George Mitchell"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2023-10-02T11:31:01+01:00",
    "content": [
        {
            "text": "Dr Alison Cave, Chief Safety Officer at the Medicines and Healthcare products Regulatory Agency (MHRA) highlights how genetics could play an important role in minimising the risk of adverse drug reactions (ADRs), and how the MHRA are working with partners across the system to make this a reality with their new Yellow Card biobank."
        },
        {
            "text": "At the MHRA, it’s vital that we identify, assess and act on ADRs to strengthen the safety of medicines and medical devices for UK patients. Last year, ADRs resulted in or contributed to 16.5% of total hospital admissions, estimated to cost the NHS in England £2.21 billion per year. Gaining a better understanding of why people have adverse reactions, therefore, may enable us to prevent ADRs and in doing so save money and, most importantly, lives."
        },
        {
            "text": "We already know genetic factors play a significant role in many ADRs, with research suggesting that an estimated 20-30% could be prevented through pharmacogenetic testing."
        },
        {
            "text": "This led to the NHS ambition to embed pharmacogenomics into routine clinical care by the end of the decade, in its Long Term Plan. Great strides have been made in this area already, for example, testing being available for patients before the prescription of the HIV treatment, Abacavir, and most recently the antibiotic Gentamycin."
        },
        {
            "text": "But we need to accelerate the development of more pharmacogenomic tests. The MHRA first received a report of a potential aminoglycoside-induced ototoxicity (serious and irreversible damage to ear function caused by antibiotics such as Gentamycin), over 50 years ago. 20 years later, the MT-RNR1 m.1555A>G gene variant was confirmed as a genetic cause for this reaction, and this year, NICE provisionally approved a bedside test for infants at risk of sepsis, to help reduce the number of severe reactions to a drug that could save their lives, and is expected to save the NHS £5-7m per year. But it took nearly 50 years to translate that first Yellow Card report into a bedside diagnostic test."
        },
        {
            "text": "Abacavir was first approved for HIV in 1999 but up to 12% of patients suffered severe hypersensitivity, an allergic reaction which can prove fatal. Over a decade later, the hypersensitivity was linked to the HLA-B*5701 allele and subsequent analysis showed that testing for the allele reduced incidences of hypersensitivity to <2%. Today, all UK patients need to be pre-tested for HLA-B*5701 prior to prescription of Abacavir."
        },
        {
            "text": "However, to make examples like these more mainstream, we need to identify the genomic markers that put people most at risk of specific side effects, so that we can identify those patients most likely to suffer harm while maintaining access to life-saving medications for those at lowest risk and who can benefit most. Ultimately, with a better understanding of genetics, we can deliver on the vision of precision medicine, with treatments tailored to the unique needs of each individual."
        },
        {
            "text": "This is why, in June this year, we launched a pilot of the Yellow Card biobank, in collaboration with Genomics England. The biobank will support our work towards more personalised treatment approaches, by ultimately housing a repository of pseudonymised genetic information linked to healthcare information, to enable researchers to determine whether an ADR was caused by a specific genetic trait. Doctors in the UK could then screen for specific genetic traits to ensure patients receive the safest medication for them."
        },
        {
            "text": "The biobank will use the Yellow Card Scheme to help identify patients who have suffered a specific ADR. The Yellow Card scheme is our flagship system for collecting information on safety concerns, including suspected side effects or adverse incidents involving medicines, vaccines and medical devices. Set up in 1964, it forms a critical part of the well-established systems and procedures in place for vigilance in the UK and now holds information on over 1.5 million suspected ADR reports. Using this information, with appropriate consent, we will be able to identify and approach patients who have suffered specific ADRs to invite them to participate in the Yellow Card biobank."
        },
        {
            "text": "The initial phase of the pilot will concentrate on a medicine called Allopurinol, used to treat gout, kidney stones and other types of kidney problems, and the related but rare side effect of severe skin reactions, including Steven Johnson Syndrome (SJS) and Toxic Epidermal Necrolysis (TEN)."
        },
        {
            "text": "Participant recruitment will begin in November, and once enrolled, they will be visited at home by a nurse, who will take a blood sample that will be added to the biobank and genetically sequenced. Data will be de-identified and added to a secure research environment led and managed by Genomics England, with initial findings from the pilot due to be published in 2025."
        },
        {
            "text": "Ultimately the information collected could transform the way we manage side-effects of medicines by allowing us to prevent ADRs, thus easing the burden on the NHS and making medicines safer for everyone."
        },
        {
            "text": "Our hope is that the biobank will become a valuable resource for pharmacogenomic research in the UK by ensuring patients receive the safest medicine for them."
        },
        {
            "heading": 2,
            "text": "Taking part"
        },
        {
            "text": "If you’re a healthcare professional who has submitted a Yellow Card report on behalf of a patient, relevant to a research topic in the pilot, we may ask for your assistance contacting them to see whether they would be interested in participating."
        },
        {
            "text": "If you’re a patient who has submitted a Yellow Card report relevant to a research topic in the pilot, we may follow up with you directly to see if you’d be interested in volunteering to participate."
        }
    ]
}