{
    "url": "https://digitaltrade.blog.gov.uk/2023/10/02/ux-scotland-2023-my-highlights/",
    "title": "UX Scotland 2023: my highlights",
    "authors": [
        "Laura Wood, User Researcher"
    ],
    "categories": [
        "People",
        "Professions"
    ],
    "pub_date": "2023-10-02T10:00:40+01:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "My name is Laura Wood, I am a User Researcher within the Data Infrastructure team in the Department for Business and Trade (DBT). I help my team build a deep understanding of our users so that we can design services that meet their needs. Read this blog to find out more about my team. "
        },
        {
            "heading": 2,
            "text": "What is UX Scotland?"
        },
        {
            "text": "UX Scotland is a 3-day conference held at Dynamic Earth in picturesque Holyrood Park, Edinburgh. As a first-time attendee, I was blown away by the engaging speakers, inspiring workshops, and the overall experience. Breaks between sessions offered scenic views of Arthur's Seat and delicious food. "
        },
        {
            "text": "Attending UX Scotland on behalf of DBT, I discovered different strategies and approaches for conducting UX and working in Agile. I shared my learnings with my team and the (DBT) User Research community. This blog is an opportunity to share some of the highlights and key themes from the 2 incredible days I spent at this event. "
        },
        {
            "heading": 2,
            "text": "The power of communities"
        },
        {
            "text": "This was a resounding message that emerged from the sessions. I value belonging to various communities -  UX Glasgow, the (DBT) User Research Community (which is mentioned in this blog). I appreciate the support, learning and networking opportunities these communities provide. "
        },
        {
            "text": "Day one of UX Scotland was kicked off by Kara Kane, Head of the Design Profession at Government Digital Service (GDS). She delivered a captivating keynote on the role of communities of practice. Kara believes that communities are the \"glue\" that help us collaborate, accomplish meaningful work, and create impact. Leadership, visibility, and support are essential in nurturing thriving communities, and their flexibility and adaptability resemble the essence of a well-designed solution. "
        },
        {
            "text": "This theme continued during a Lean Coffee discussion led by Kat Husbands and Neil Scott. Lean Coffee is a structured but agenda-less meeting. To begin, attendees wrote topics of interest on post-it notes. These topics were then grouped, and we were each given dots to vote on the most intriguing ones for discussion. The topic with the most votes and first up for discussion was \"how do we make communities of practice engaging?\" "
        },
        {
            "text": "Attendees agreed that to create an engaging community, it is crucial to carve out a unique space that diverges from routine meetings. Mixing up session formats, fostering interactivity, and openly sharing agendas were recurring suggestions. Inspired by this experience, I am eager to organise a Lean Coffee discussion within our User Research community. "
        },
        {
            "heading": 2,
            "text": "Visual storytelling"
        },
        {
            "text": "As a User Researcher, one of the most impactful sessions was Rashmi Kakde’s talk on persuasive visual storytelling. She showcased the power of using visuals, such as comic book strips and storyboards, to make research findings more impactful, memorable, and actionable.  "
        },
        {
            "text": "Rashmi highlighted that we often produce wordy reports that nobody reads, due to time constraints and cognitive load. She emphasised the importance of visual storytelling, noting that 65% of us are visual learners and visual presentations are 43% more persuasive. Visuals are also simpler, easier to digest and more engaging. "
        },
        {
            "text": "There are 4 key elements to visual storytelling: "
        },
        {
            "text": " Rashmi provided examples of impactful storyboards she created whilst working for the National Health Service (NHS). "
        },
        {
            "text": "The first image illustrates the user journey of a new service. It is packaged with insights and emotions. This visual, supported by statistics, prompted senior leadership to allocate more time and resources to address pain points."
        },
        {
            "text": "The second image shows the impact this had on improving the service. By comparing the initial user journey against the current journey and seeing the progress that had been made, Rashmi’s work had a strong impact. This session inspired me to be more creative with my outputs to make them more engaging and impactful. These slides from Rashmi’s presentation are shared with her permission. "
        },
        {
            "heading": 2,
            "text": "Developing my UX skills"
        },
        {
            "text": "Jenny Bjӧrkman’s workshop highlighted the importance of allocating time to professional development. She talked through her career development plan which included developing a personal brand, getting qualified, networking, seeking mentorship, and embracing public speaking. "
        },
        {
            "text": "We developed our own plans throughout the session. I am making time for reflection (hence this blog!) and I have recently started a course with the UX Design Institute. This course will develop my existing user research skills, teach me new skills in design and I will attain a Professional Diploma in UX Design. I am very grateful to Jenny for signposting me to this course."
        },
        {
            "heading": 2,
            "text": "Effective teamwork"
        },
        {
            "text": "Effective teamwork was a theme that came out of several sessions.  Mark Cruth highlighted the importance of creating a collaborative atmosphere in meetings. He emphasised factors such as creating a safe space, trust, inclusion, and an intentional agenda. The session stressed the significance of psychological safety in fostering a team mentality and how this saves meeting time, generates better ideas, and boosts engagement. I left with tips to make meetings more collaborative. These included using an agenda, incorporating intentional icebreakers, and investing time in learning how to improve meetings. "
        },
        {
            "text": "Ceri Newton-Sargunar's session provided valuable insights into fostering growth and improving design maturity by giving effective feedback. She emphasised the importance of constructive feedback and approaching conversations with curiosity.  "
        },
        {
            "text": "Ceri’s top tips for giving feedback are: "
        },
        {
            "text": "The end note for day one left a profound impact on me. Heldiney Pereira talked about designing high-performing and inclusive teams. He spoke about encouraging vulnerability and shared personal experiences to emphasise the strength that diverse perspectives bring to the workplace. Heldiney highlighted the importance of mutual trust, self-reflection, and creating a safe environment to discuss difficult topics. His talk inspired me to be more open and vulnerable in my work. In his words, “everything about you matters”. "
        },
        {
            "heading": 2,
            "text": "Choosing the right work environment"
        },
        {
            "text": "At the end of day 2, I attended Tricia Okin’s session about finding a workplace culture that aligns with your work style and goals. She noted that we spend 35% of our time at work, excluding commuting or thinking about work outside of our working hours. This affects the energy that we have left for our lives. Our work has an impact on our mental and physical health, our social lives and family. Tricia asked, ‘so why not have our work fit our lives and approaches instead of vice versa?’ "
        },
        {
            "text": "She explained several types of organisational cultures: "
        },
        {
            "text": "There are various sub cultures within these cultures."
        },
        {
            "text": "By understanding different organisational cultures, we can make informed decisions about the environments that suit us best. This session prompted me to reflect on the workplace culture in which I thrive and feel most energised by. Tricia kindly gave us permission to share a couple of her slides. "
        },
        {
            "heading": 2,
            "text": "Conclusion"
        },
        {
            "text": "Attending UX Scotland was a fantastic experience that had a significant impact on my professional journey. I returned to my work with a renewed sense of purpose and an array of ideas to explore and implement. These learnings will help me to be more creative and effective in solving our user needs. I am grateful for the opportunity to attend this event on behalf of DBT. "
        },
        {
            "text": "If you ever have the chance to attend UX Scotland, don't hesitate! You will find yourself immersed in captivating ideas and surrounded by passionate individuals. "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}