{
    "url": "https://deframedia.blog.gov.uk/2023/10/02/water-company-draft-business-plans-published/",
    "title": "Water company draft business plans published",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "water",
        "Weekly stories"
    ],
    "pub_date": "2023-10-02T10:19:24+01:00",
    "content": [
        {
            "text": "Today (Monday 2 October), water companies are publishing draft business plans which set out their proposed spending on infrastructure and improvements to the water system from 2025-2030. We expect Ofwat, the regulator, to scrutinise these plans to ensure they meet legal requirements and government targets, to check families are not paying for what companies should already have done, and to give customers the best value for their money. Final plans will be agreed by Ofwat in December 2024 with changes to bills taking effect from April 2025."
        },
        {
            "text": "The plans include how companies propose to invest in improving water supply resilience and the environment, helping to make rivers and beaches cleaner, reducing leaks and supply interruptions and tackling issues like storm overflows. In turn, this investment boosts economic growth and creates more jobs across England and Wales."
        },
        {
            "text": "The Government’s Plan for Water is transforming the water sector through more investment, stronger regulation, and tougher enforcement to deliver the clean and plentiful water the public expects. We have given our regulators additional powers on bonuses and dividends so that billpayers are not rewarding poor performance, and last week it was confirmed that the worst performing water companies must return money to consumers through their bills."
        },
        {
            "text": "Environment Secretary Thérèse Coffey said:\n"
        },
        {
            "text": "There have been claims about customers paying twice for investment – that is not the case. Ofwat has been clear that customers won’t pay twice for investment that should already have happened. The money that customers have paid through previous bills has been used for existing improvements, with £200 billion invested in the water system since privatisation. Where improvements still need to be made for which companies have already received funding, they will not be granted that funding again. This money from 2025 – 2030 will be used to pay for new improvements – including tackling building new reservoirs, cutting leakage and investing to reduce sewage spills."
        }
    ]
}