{
    "url": "https://apprenticeships.blog.gov.uk/2023/10/02/what-are-t-levels/",
    "title": "What are T Levels?",
    "authors": [
        "Institute for Apprenticeships"
    ],
    "categories": [
        "Employers",
        "T Levels",
        "Technical education"
    ],
    "pub_date": "2023-10-02T09:18:57+01:00",
    "content": [
        {
            "text": "It's T Levels week, a week that focuses on continuing to raise awareness of the many T Level subjects now available and showcase the success of the programme. So we thought in this blog post we'd revisit what T Levels are, while on our social media channels showcasing the wide range available."
        },
        {
            "text": "T Levels are 2-year courses for 16–19-year-olds who have completed their GCSEs. Whether students want to move into skilled employment or continue their studies – the T Level is a nationally recognised certificate that opens doors!"
        },
        {
            "text": "T Levels combine classroom learning with hands-on experience and include an integrated 45-day industry placement. This means 80% of a student’s time is spent in a classroom, and the other 20% in a working environment."
        },
        {
            "text": "Farmer having agriculture session with T Level students."
        },
        {
            "text": " "
        },
        {
            "text": "For prospective learners:"
        },
        {
            "text": "T Levels are an alternative to A Levels, apprenticeships, and other post-16 courses. It is a qualification designed by leading businesses and employers to provide you with the knowledge and skills needed to thrive in your chosen career."
        },
        {
            "text": "While T Levels prepare you for the working world, they can also be a stepping stone into higher education. Each T Level is the equivalent to 3 A Levels, with a T Level Distinction* being equal to 3 A*s at A Level. The T Level can be converted into UCAS points, meaning that you can go on to apply to study at university."
        },
        {
            "text": " "
        },
        {
            "text": "For employers:"
        },
        {
            "text": "Taking on T Level students is an opportunity to shape the future of your industry with talented individuals. T Level industry placements are a free government scheme – so you do not need to pay to take on a learner."
        },
        {
            "text": "Employers benefit from offering these placements as you get to train new talent up to your professional standards – which can be useful for filling skills gaps in the existing workforce, and for future recruitment."
        },
        {
            "text": " "
        },
        {
            "text": "You can find more information about T Levels on a dedicated government website."
        },
        {
            "text": "All Apprenticeships, Higher Technical Qualifications, and T Levels are based on occupations recognised by employers. The Occupational Maps bring these together to show where technical education can lead. There are 15 maps, one for each route."
        },
        {
            "text": "You can also find out more about the wide range of available T Levels on our social media channels all week (2 October to 6 October, 2023)"
        },
        {
            "text": "LinkedIn"
        },
        {
            "text": "Twitter"
        },
        {
            "text": "Facebook"
        },
        {
            "text": "Instagram"
        }
    ]
}