{
    "url": "https://designnotes.blog.gov.uk/2023/03/27/from-me-to-you-collaborating-to-design-the-unknown/",
    "title": "From me to you – Collaborating to design the unknown",
    "authors": [
        "Tom Hughes – Content Designer, Government Digital Service",
        "Rachel Spillane – Content Designer, Disclosure and Barring Service"
    ],
    "categories": [
        "Content Design"
    ],
    "pub_date": "2023-03-27T12:45:41+01:00",
    "content": [
        {
            "text": "GOV.UK One Login launched as a private beta in June 2022 as a way for users to prove their identity when applying for a basic DBS (Disclosure and Barring Service) check. Here’s how 2 content designers from DBS and GDS (Government Digital Service) worked together to design this version of the journey."
        },
        {
            "heading": 2,
            "text": "First things first, get to know one another"
        },
        {
            "text": "From the outset, we took part in group calls. These were great for meeting the wider team and understanding the team make up, but they aren't a substitute for getting to know who you’ll be working with on a one-to-one basis. \n\nAs GOV.UK One Login is a new service, we want to make sure users understand what it is and how it can help them do the task they need to do. Clear and concise content is key to this, so we had to make sure we worked closely together from the beginning."
        },
        {
            "text": "We didn’t do anything too formal to kick this off. We simply set aside half an hour one afternoon, brew in hand and had a chat. "
        },
        {
            "text": "We found out a lot about each other’s strengths and expertise, which helped us decide on how to divide and conquer different design challenges."
        },
        {
            "heading": 2,
            "text": "Understanding each other’s needs"
        },
        {
            "text": "Coming from two different organisations meant we each had different requirements from our teams.  "
        },
        {
            "text": "It was important to understand both what the 'Request a basic DBS check' service would need from GOV.UK One Login, and GDS’ need to design a product that would be flexible enough to work for multiple services. It was useful to set this context early on as it helped both of us design the respective parts of the user journey."
        },
        {
            "text": "Whether it’s a small component or the action of an entire page, it’s vital to listen to each other’s needs."
        },
        {
            "text": "We made sure to share any Miro or Mural boards which showed full journey flows of each other's live service. By sharing each other's service history, we could better relate to where the other person was coming from."
        },
        {
            "heading": 2,
            "text": "Staying looped in"
        },
        {
            "text": "It’s important to be transparent on what you’re working on and talk to each other regularly. We often caught up, even if it was just sharing user journey maps or screenshots over Slack."
        },
        {
            "text": "We shared our design decisions and when something changed within our service, we made sure to tell each other. "
        },
        {
            "text": "We made sure we had the opportunity to attend each other's user research sessions and playbacks. This helped build understanding across the teams about what we'd discovered and what changes we were planning to make based on these findings."
        },
        {
            "text": "Content designers never work in isolation. Content is always created on the back of a user need which is influenced by the work of our user research and performance analyst colleagues. "
        },
        {
            "text": "We all made a point of including other disciplines in most of our design sessions. If we had a question the other team couldn’t answer we’d go away with that ask and be sure to follow up. "
        },
        {
            "text": "GOV.UK One Login has been frequently iterated since it launched as a private beta last year. We made sure to stay in touch with each other to discuss any potential design changes that could have been needed when adding new features and journeys to GOV.UK One Login."
        },
        {
            "heading": 2,
            "text": "Don’t be afraid to critique"
        },
        {
            "text": "A lot of the time in content design you can look painstakingly over one simple sentence structure, sometimes even one word for hours, even a full day asking yourself, ‘Is this as simple as it could be?’ "
        },
        {
            "text": "So, whenever this happened in the design process, we always welcomed a fresh pair of eyes!"
        },
        {
            "text": "This would sometimes give us the reassurance we were after or, on occasion, we’d come up with something new together."
        },
        {
            "heading": 2,
            "text": "From us to you"
        },
        {
            "text": "Being a part of a multi-disciplinary digital team means you rely on the skills of your colleagues daily. Those connections impact the work you do. This should be no different if you step further afield. The joy of collaborative design is that you get to meet new colleagues with different skill sets, different ideas and from different backgrounds. Ultimately, the relationships you build are the key to the success of your project."
        }
    ]
}