{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2023/03/27/gse-diversity-and-inclusivity-action-group-diag/",
    "title": "GSE Diversity and Inclusivity Action Group (DIAG)",
    "authors": [
        "Evelyn Toalster"
    ],
    "categories": [
        "Blog Series",
        "Diversity & Inclusion"
    ],
    "pub_date": "2023-03-27T13:28:35+01:00",
    "content": [
        {
            "text": "The GSE Diversity and Inclusivity Action Group (DIAG) works to embed equity, diversity and inclusivity across GSE. The group reports to the GSE Project Board, is volunteer-led and chaired by Evelyn Toalster from the Intellectual Property Office. DIAG is always looking for new members from GSE to be involved and progress its aim of making the profession as diverse and inclusive as it can be."
        },
        {
            "text": "DIAG meets every 8 weeks and its remit includes developing and driving forward the Diversity and Inclusion (D&I) strategy within GSE. DIAG is currently structured around working groups focussing on those with disabilities, minority ethnic groups, social mobility, and women."
        },
        {
            "text": "Disability Working Group (DWG)"
        },
        {
            "text": "The Disability Working Group (DWG) is led by David Kenyon who is based in the Scottish Government. Over the past year we have had joint priorities. First, to promote the use of the employee passport which is fundamental in making initial conversations with new line managers and colleagues easier and ensuring workplace adjustments are in place ahead of someone starting a new role. Secondly, we wanted to spotlight the lived experiences of disabled colleagues focusing on both the issues and barriers that they have faced but also in many cases how easy these would or have been to overcome."
        },
        {
            "text": "Ethnic Minorities Working Group (EMWG)"
        },
        {
            "text": "The Ethnic Minorities Working Group (EMWG) drives forward improvements in diversity and inclusivity for ethnic minority staff. We run a series of events focusing on improving representation across government and develop links with other cross government networks to increase collaboration efforts and our visibility. With more volunteers we could extend our programme of events and a more ambitious programme."
        },
        {
            "text": "Social Mobility Working Group (SMWG)"
        },
        {
            "text": "The Social Mobility Working Group (SMWG) is our newest working group and has high ambitions. In its most basic definition, social mobility refers to the link between our starting point in life, and where we end up (State of the Nation 2022, Social Mobility Commission). The range and roles available within government science are not always visible, so we aim to break down barriers to accessing relevant information and enable true social mobility. To achieve these goals, the SMWG would like to start information exchanges, support, and mentorship to members of the profession. So far, our members have identified they would like to take part in school outreach and raising awareness of entry to further education schemes as attainable goals to champion. We would also like to send regular guides, links to training and mentorship through our newsletters and group support meetings."
        },
        {
            "text": "Women’s Working Group (WWG)"
        },
        {
            "text": "The Women’s Working Group (WWG) meets monthly to discuss and develop interventions to benefit women across the GSE Profession. We currently run a calendar of cross-government “Inspiring Women in STEM” virtual talks, with highlights in 2022 including a talk by Dr Shabana Haque, OBE (Deputy Director of Research Infrastructure in the Department of Business, Energy & Industrial Strategy) for International Women in Engineering Day (INWED) and a special conversation with Professor Christine Maggs (Chief Scientist of Joint Nature Conservation Committee) as we said farewell and thank you for her many years of service as Chair of our working group. This year, we had the pleasure of hosting Professor Sarah Sharples (Chief Scientific Adviser for the Department of Transport) for the International Day of Women and Girls in Science and are currently in the process of organising celebrations for the International Women in Engineering Day (INWED) 2023. As well as these events we have also developed GSE Connect, a scheme to support women in the GSE profession by providing peer support and networking opportunities. Having recently expanded our membership, over the next year we are hoping to organise more focused activities and go beyond our current programmes of work."
        },
        {
            "text": "The Future of DIAG"
        },
        {
            "text": "DIAG is looking to expand the working groups over the next year, create a more proactive programme which reaches more communities, and develop more cross-cutting activities across all workstreams."
        },
        {
            "text": "To do this, we need more volunteers. DIAG currently has volunteers from around 10 government organisations, but we aim to have representation from all organisations across the whole GSE network so we can be a true reflection of the diversity across our profession."
        },
        {
            "text": "If you would like to represent your organisation on DIAG, offer advice on areas of our work and help spread news and information about DIAG work within your organisation please get in touch. Anyone can be an ally, no matter on their background. If you would like to be involved, have any activities or project suggestions for DIAG or just wish to be on our mailing list, we would love to hear from you. Please contact gse@go-science.gov.uk or speak to your Head of Science and Engineering Profession (HoSEP)."
        }
    ]
}