{
    "url": "https://forestrycommission.blog.gov.uk/2023/03/27/how-were-supporting-tree-and-seed-suppliers-to-boost-domestic-tree-production/",
    "title": "How we're supporting tree and seed suppliers to boost domestic tree production.",
    "authors": [
        "Megan Shirley"
    ],
    "categories": [
        "Tree Planting"
    ],
    "pub_date": "2023-03-27T14:43:46+01:00",
    "content": [
        {
            "text": "The Tree Production Capital Grant (TPCG) will reopen for applications in Spring 2023. The grant was launched last year to support tree and seed suppliers with capital investments to improve, expand, automate, or mechanise their operations. It’s part of a wider package of measures under the Nature for Climate Fund aimed at boosting domestic tree production, including the Seed Sourcing Grant and the Tree Production Innovation Fund, which is currently open for applications."
        },
        {
            "text": "We had a brilliant response to the first round of the TPCG, with 43 projects awarded funding. We were particularly struck by the diversity of organisations who applied. These ranged from well-established nurseries to complete newcomers, commercial operations to community ventures, and bare root to cell grown suppliers."
        },
        {
            "text": "The successful projects should lead to a significant increase in production capacity for the sector, but we were also delighted by the other benefits they will bring. Given the extreme weather events of 2022, it’s encouraging that a number of nurseries applied for irrigation systems to improve their resilience to future droughts. Many of the projects will also allow suppliers to produce more diverse stock, whether that be through investing in seed storage that allows them to collect and grow from local seed, or growing systems which are more suited to broadleaved species. This will help to create diverse, resilient, and wildlife-rich woodlands."
        },
        {
            "text": "We’re looking forward to building on the success of the first round when we reopen for applications soon. In the meantime, we wanted to share a few examples of the projects funded in round one:"
        },
        {
            "heading": 2,
            "text": "RJ Trees and Hedging"
        },
        {
            "text": "RJ Trees and Hedging Ltd was established in 2021 on agricultural land formerly used for grazing cattle. The nursery grows bare root hedging and trees, with a focus on native broadleaves. After a successful first year as a start-up, the nursery applied to the TPCG to help them scale up."
        },
        {
            "text": "Through their project, they are replacing some of the old or borrowed equipment that they had used to get going in their first year, and are adding new machinery to increase the efficiency of processes such as seed sowing, lifting, spraying, and grading. To enable them to grow across a large field area and ensure the nursery is resilient to drought, they are also installing an irrigation system. With these improvements they aim to double their tree production over the next 3-5 years and expand the range of species they grow."
        },
        {
            "text": "Ray Jenkins, Managing Director, commented:"
        },
        {
            "heading": 2,
            "text": "Oakover Nurseries"
        },
        {
            "text": "Oakover Nurseries are an established supplier of forestry and native tree species and have been growing cell grown stock under protection since 2014. In 2022, the nursery was awarded TPCG funding for a water treatment and filtration system that uses nano-bubble technology. The system will help clean, enrich, and disinfect the reservoir water that they use to irrigate cell grown stock. This should minimise the presence of weeds, pests, and diseases, including damping off: a fungal disease which can cause significant losses."
        },
        {
            "text": "Increased nutrient availability and dissolved oxygen in the water will also create optimal conditions for root growth and reduce the need for fertiliser. The nursery hope that the system will boost their biosecurity and improve survival and establishment of crops by an estimated 12.5%, thereby increasing overall production."
        },
        {
            "text": "Brian Fraser, General Manager, commented:"
        },
        {
            "heading": 2,
            "text": "More Trees BANES"
        },
        {
            "text": "More Trees BANES is a not-for-profit organisation that runs a community tree nursery with a unique set up. They have a central hub nursery where they process tree seed - largely from local ancient and semi-natural woodlands - and grow tree seedlings. These seedlings are then distributed to a network of community and school-based nurseries across Bath and North East Somerset for growing on."
        },
        {
            "text": "They successfully applied to the TPCG to help expand their network from 9 to 16 satellite nurseries and develop a new central hub. The funding is supporting them to buy items such as seed processing and storage equipment, polytunnels, deer fencing, and a van. With this support, they will be able to process and stratify more seeds, grow more seedlings, and produce higher quality trees. The project will also benefit the local community, providing volunteer and training opportunities."
        },
        {
            "text": "Sandra Tuck, Development Manager, commented:"
        }
    ]
}