{
    "url": "https://defrafarming.blog.gov.uk/2023/03/27/making-the-rules-for-farming-easier-to-find/",
    "title": "Making the rules for farming easier to find",
    "authors": [
        "Tania MacDonnell"
    ],
    "categories": [
        "Content design",
        "Things we're doing"
    ],
    "pub_date": "2023-03-27T11:58:30+01:00",
    "content": [
        {
            "text": "Farming legislation affects all farmers and land managers. As part of continuing work to improve the experience on GOV.UK, we asked a group of farmers, land managers and advisers in England to share their experience finding these rules. "
        },
        {
            "text": "Over the past few months, we set up a series of video calls with those who volunteered. In this post, I’ll share a summary of what they told us and our work to improve things."
        },
        {
            "heading": 2,
            "text": "What we heard"
        },
        {
            "text": "Members of the group shared that it was difficult for them to find the rules relevant to them. The number of rules and how they were grouped made them difficult to navigate. "
        },
        {
            "text": "Usability would be improved if the legislation was grouped by activity."
        },
        {
            "text": "We heard that even when the relevant piece of legislation was found, the wording made it difficult to work out what action needed to be taken to comply."
        },
        {
            "text": "In addition, information was sometimes mixed up with best practice or content for the general public. "
        },
        {
            "text": "They explained that pages often contained words that aren’t normally used."
        },
        {
            "heading": 2,
            "text": "Our improvements \n"
        },
        {
            "text": "We created a single page on GOV.UK called ‘Rules for farmers and land managers’. It went live today. "
        },
        {
            "text": "This page groups together rules for farmers in England in one place. It’s arranged in a more intuitive way, by the activities that you do. For example, using pest control products. "
        },
        {
            "text": "It links to all the pages that contain ‘must dos’ in law so you can follow the link and find rules and more detail. "
        },
        {
            "text": "We tested the wording and groupings with our research group by asking them to look at the new page with us. We also asked for any regulated farming activities they thought were missing from the page. "
        },
        {
            "heading": 2,
            "text": "Tell us what you think"
        },
        {
            "text": "Now that the Rules for farmers and land managers page is live, we’re keen to hear your views."
        },
        {
            "text": "You can share your thoughts by clicking on the feedback link on the page. I've circled the link to look out for below. "
        },
        {
            "text": "We’ll use your feedback to improve the page over time and improve the content on the linked pages."
        },
        {
            "text": "Throughout our work, we’ll make sure that the content is:"
        },
        {
            "text": "For updates on our work and the work of the programme, don’t forget to subscribe to the Farming Blog.  "
        }
    ]
}