{
    "url": "https://marinedevelopments.blog.gov.uk/2023/03/27/marine-protected-areas-consultation-and-call-for-evidence-closes-tomorrow/",
    "title": "Marine protected areas consultation and call for evidence closes tomorrow",
    "authors": [
        "Dan Cutler, Communications & Engagement Manager"
    ],
    "categories": [
        "marine conservation"
    ],
    "pub_date": "2023-03-27T15:48:52+01:00",
    "content": [
        {
            "text": "We want you to have your say on our proposals for managing fishing activities and protecting valuable marine habitats and species in England’s marine protected areas (MPAs)."
        },
        {
            "text": "Our latest MPA consultation and call for evidence closes tomorrow night (Tuesday 28 March 2023 at midnight), which is why we’re encouraging you to take part, inform our approach and share your views before we progress with our next steps."
        },
        {
            "text": "Over the last 10 weeks we’ve been working hard to encourage fishers and other marine stakeholders to share their views on a proposed byelaw to ban bottom towed gear in 13 of the most sensitive MPAs, as part of our Stage 2 formal consultation. The MPAs include:"
        },
        {
            "text": "As part of our Stage 3 call for evidence, we’ve also be asking for input and views on the evidence and analysis of the impacts of fishing on seabed features in English MPAs."
        },
        {
            "text": "MPAs protect habitats and species essential for healthy, functioning marine ecosystems. Effective management of these MPAs can help habitats and species in English coastal waters recover from damage caused by human activities and contribute to ensuring a sustainable future for all marine users."
        },
        {
            "text": "We thank everyone who has taken part, shared their views and submitted evidence to date. However, for those who haven’t yet participated, please don’t miss this opportunity to share your views and support our evidence led approach to managing fishing activities within our MPAs."
        },
        {
            "text": "Following the completion of the Stage 2 formal consultation and Stage 3 call for evidence, we will review all the information that has been received and issue further updates on the next steps as soon as possible."
        },
        {
            "text": "To find out more, please visit: Managing Fishing in Marine Protected Areas: Consultations - GOV.UK (www.gov.uk)"
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}