{
    "url": "https://cddo.blog.gov.uk/2023/03/27/strengthening-outcomes-for-the-public-through-better-data-maturity/",
    "title": "Strengthening outcomes for the public through better data maturity",
    "authors": [
        "Megan Lee Devlin, Chief Executive, CDDO"
    ],
    "categories": [
        "CDDO",
        "Cross-government strategy",
        "Data",
        "Digital strategy",
        "Digital transformation"
    ],
    "pub_date": "2023-03-27T13:27:04+01:00",
    "content": [
        {
            "text": "Harnessing data is crucial to the effective delivery of policies that shape our economy, businesses and lives, and to ensuring our public services deliver consistently simple and fast outcomes. Often, it is our ability to effectively use data that is the difference between someone getting the right outcome in months or moments."
        },
        {
            "text": "The data landscape has evolved significantly over the last decade as Cloud computing has grown, data has been democratised, powerful tools like machine learning have accelerated at an unprecedented pace, and data privacy regulations have strengthened the ability of all organisations to responsibly, safely and effectively use data to achieve outcomes never before imaginable. These trends have meant that the volume, sources and uses of data have grown at an exponential rate."
        },
        {
            "text": "The key to unlocking the vast potential of that data is through effective data capabilities - development of the skills, systems, tools, technology, processes and policies that underpin data maturity. "
        },
        {
            "text": "We have launched the Data Maturity Assessment for Government to enable public sector organisations to measure and understand their ability to use data to achieve core business objectives. "
        },
        {
            "text": "The Data Maturity Assessment (DMA) will enable departments, and government as a whole, to assess their data environments and focus resource and energy on the right data initiatives based on their current capability and effectiveness. "
        },
        {
            "heading": 4,
            "text": "A collaborative development process "
        },
        {
            "text": "The DMA’s development has been a truly collaborative effort across and beyond government, involving departments and agencies of all sizes as well as recognised external leaders in data maturity. The Data Quality Hub at the Office for National Statistics led the design and piloting of the DMA with eleven public sector organisations on behalf of government, and the model is endorsed by Data Orchard and validated through testing."
        },
        {
            "text": "Using the same maturity assessment model across the public sector will help build shared language, metrics and goals for measuring and understanding how reliable, robust and effective our data ecosystems are. "
        },
        {
            "heading": 4,
            "text": "Next steps towards actionable insight "
        },
        {
            "text": "Permanent Secretaries, Chief Digital and Information Officers and Chief Data Officers across government have endorsed the DMA and committed to using it in a core part of their organisation within the first year."
        },
        {
            "text": "UK National Statistician Professor Sir Ian Diamond, Executive Sponsor for the data mission of the Transforming for a Digital Future Roadmap, has said: "
        },
        {
            "text": "Over the coming months CDDO will work across government to:"
        }
    ]
}