{
    "url": "https://educationhub.blog.gov.uk/2023/03/27/what-are-t-levels-and-how-can-they-benefit-me/",
    "title": "What are T Levels and how can they benefit me?",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Further education",
        "T Levels"
    ],
    "pub_date": "2023-03-27T12:01:09+01:00",
    "content": [
        {
            "text": "This article was first published on 10th February 2023."
        },
        {
            "text": "First launched in 2020, T Levels are proving increasingly popular."
        },
        {
            "text": "As more and more young people opt to take a T Level, we’re giving schools and colleges a funding boost of around £30 million to help more of them offer top quality T Levels to their students. On top of this, an Employer Support Fund worth up to £12 million over the next two years will allow more businesses of all sizes to provide students with industry placements."
        },
        {
            "text": "Here’s everything you need to know about T Levels:"
        },
        {
            "heading": 3,
            "text": "What are T Levels?"
        },
        {
            "text": "T Levels are the gold standard vocational course, and a high-quality alternative to A levels. One T Level is worth the same UCAS points as three A Levels. They are two year programmes with 80% of that time spent in the classroom, and 20% on a minimum nine-week industry placement with an employer."
        },
        {
            "heading": 3,
            "text": "Why should I do T Levels?"
        },
        {
            "text": "Focussing on professional skills, T Levels have been designed with leading employers to give you the knowledge and skills you need to progress into work, further study or an apprenticeship."
        },
        {
            "text": "T Levels combine class-based learning with an industry placement, giving you the chance to get hands-on experience and learn what a real career is like while you continue your studies."
        },
        {
            "text": "You’ll also get a nationally recognised qualification when you pass. Your certificate will show the grade you achieve and give details of what you learned on the course, helping you to take the first steps in your career."
        },
        {
            "heading": 3,
            "text": "Do you have to pay to do T Levels?"
        },
        {
            "text": "T Levels are free if you start when you’re under the age of 19 and have not already enrolled in another type of post-16 education."
        },
        {
            "heading": 3,
            "text": "What T Level subjects are available?"
        },
        {
            "text": "There are 16 T Levels already available to study in a range of exciting subject areas including digital, education, health, science, construction finance and accounting. More courses will be available from September 2023 including legal services and agriculture."
        },
        {
            "heading": 3,
            "text": "Where can I do a T Level?"
        },
        {
            "text": "T Levels are available at schools and colleges across the country."
        },
        {
            "text": "Visit this link to find a school or college offering T Levels near you."
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}