{
    "url": "https://educationhub.blog.gov.uk/2025/11/autumn-budget-for-children-with-send/",
    "title": "Autumn Budget: what is the government doing to improve outcomes for children with SEND?",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Schools",
        "SEND"
    ],
    "pub_date": "2025-11-28T12:22:57+00:00",
    "content": [
        {
            "text": "The government is making changes to the Special Educational Needs and Disabilities (SEND) system. These changes aim to improve how children with SEND receive support. It’s clear the SEND system is in dire need of reform. It is failing children and families at every turn, where outcomes for young people are nowhere near good enough.Our reforms are about improving outcomes for young people, but speculative projections from the Office of Budget Responsibility (OBR) are causing confusion about how these reforms will be funded. Here is everything you need to know."
        },
        {
            "heading": 3,
            "text": "How will SEND costs be funded? "
        },
        {
            "text": "While the Office for Budget Responsibility has published projections about SEND costs alongside the Budget, these were hypothetical illustrations."
        },
        {
            "text": "What they have set out regarding the impact on school budgets is fundamentally wrong. The OBR suggests funding could be taken from the core schools budget. It will not.  And their projections do not account for the detail of our reforms. "
        },
        {
            "text": "We have committed to a period of  co-creation before we publish our Schools White Paper early next year and are working with children, parents and the education sector to improve experiences and outcomes – helping make the system more sustainable in the long run.  "
        },
        {
            "text": "The Treasury has made clear that the costs will be absorbed by the overall government budget. Funding will be determined at the next Spending Review, which will take place in 2027. "
        },
        {
            "heading": 3,
            "text": "What changes are being made to the SEND system? "
        },
        {
            "text": "We are making it our mission to transform outcomes for all children, including those with SEND. Our SEND reforms which are being designed with parents, teachers, health teams and experts are relentlessly focused on improving outcomes for young people."
        },
        {
            "text": "The reforms will be based on the following five principles:"
        },
        {
            "text": "We’ve already started by creating 10,000 more specialist places in mainstream schools, providing more training for teachers, introducing earlier intervention for speech and language needs, and placing SEND professionals in Best Start Family Hubs in every local area. "
        },
        {
            "text": "A full plan for reform will be published early next year through the Schools White Paper. "
        },
        {
            "heading": 3,
            "text": "What will the reforms mean for schools and school funding? "
        },
        {
            "text": "Any changes we make in future will improve support for children and young people, mean parents won’t have to fight for support, and protect effective provision which is currently in place. There will always be a legal right to additional support for children and young people with SEND."
        },
        {
            "text": "In addition, it’s important that mainstream schools are properly equipped and expected to welcome all pupils, including those needing additional support. "
        },
        {
            "text": "Investment in schools is a priority. School budgets rose by £3.7bn this year and they will rise by £1.7bn next year."
        },
        {
            "heading": 3,
            "text": "When will more details be available? "
        },
        {
            "text": "Full plans will be set out through the Schools White Paper early next year. Work is continuing with parents, teachers and local authorities as these plans are developed. "
        },
        {
            "heading": 3,
            "text": "What about local authority funding? "
        },
        {
            "text": "Local authorities currently cover the costs of the SEND system, with the Dedicated Schools Grant statutory override ensuring they can do this without reducing other services. "
        },
        {
            "text": "From 2028 onwards, future costs will be managed, in full, within the overall government budget. Local authorities will not need to cover SEND costs from their general funds after the end of 2027-28. "
        },
        {
            "heading": 3,
            "text": "What happens next? "
        },
        {
            "text": "We will continue to work closely with families, teachers, local authorities and experts to complete these reforms.  "
        },
        {
            "text": "Full reform plans will be published early next year and engagement will continue with children and families about what they need from the SEND system. "
        }
    ]
}