{
    "url": "https://companieshouse.blog.gov.uk/2025/11/28/collaborating-with-the-insolvency-service-to-tackle-economic-crime/",
    "title": "Collaborating with the Insolvency Service to tackle economic crime",
    "authors": [
        "Integrity and Enforcement Team"
    ],
    "categories": [
        "Changes to UK company law",
        "Companies House transformation"
    ],
    "pub_date": "2025-11-28T10:52:12+00:00",
    "content": [
        {
            "text": "The Economic Crime and Corporate Transparency Act 2023 continues to have a real-world impact. The new powers this act gives Companies House are necessary to combat organised crime and misuse of the UK companies register."
        },
        {
            "text": "The act has also strengthened how Companies House collaborates with other government partners. One of our key collaborators in this field is the Insolvency Service."
        },
        {
            "text": "We now work more closely with the Insolvency Service to fight back against people who take advantage of corporate structures to hide their crimes. These include money laundering, deliberate exploitation of the companies register and businesses going into liquidation, leaving debts unpaid, and then re-emerging as a new company."
        },
        {
            "heading": 2,
            "text": "Stronger structures and shared intelligence"
        },
        {
            "text": "Significant structural improvements to our collaborative processes mean that information can now be shared between agencies more quickly and securely.We now share and analyse information about directors, addresses and filings which helps us to identify patterns of suspicious activity. This helps to uncover the links between companies whose connections have been purposefully blurred to appear unrelated."
        },
        {
            "text": "This collaborative work also creates a means for Companies House to make rapid referrals to the Insolvency Service when uncovering filings that are believed to be false or fraudulent. "
        },
        {
            "text": "The Insolvency Service is then able to use its powers to petition the courts to wind up companies which are failing to operate within the public interest, disqualify rogue directors, and prosecute fraudsters and other economic criminals. The agency can also secure compensation and separate confiscation orders under the Proceeds of Crime Act."
        },
        {
            "heading": 2,
            "text": "Shared success"
        },
        {
            "text": "Recently, 5 companies that were identified as having filed false and forged accounts were successfully shut down in the public interest, as a result of our shared partnership in action. They were:"
        },
        {
            "text": "They all filed fraudulent accounts claiming to have generated hundreds of millions of pounds in turnover and profits but had not carried out any genuine business activity."
        },
        {
            "text": "The companies were listed at shared office addresses across South London and Croydon and claimed to trade with local car dealerships and major supermarkets. There was no evidence of any such dealing having ever taken place."
        },
        {
            "text": "Investigations led by the Insolvency Service in collaboration with Companies House found wildly inaccurate accounts from these businesses."
        },
        {
            "text": "These accounts were not only factually incorrect but also misused the names of legitimate accountancy firms to create a false impression of credibility."
        },
        {
            "text": "Referrals made by Companies House informed the Insolvency Service’s investigation and the eventual petitioning of the High Court in Manchester to shut down these companies. The court agreed, and the businesses were later shut down in July 2025."
        },
        {
            "heading": 2,
            "text": "Protecting the integrity of the register"
        },
        {
            "text": "It’s thanks to our rich partnerships with agencies like the Insolvency Service that Companies House is now able to fully use its powers and take decisive action when suspicious activity is detected."
        },
        {
            "text": "The speed at which we can identify misuse of the register and make referrals to partners and law enforcement has increased exponentially. Protecting the integrity of the companies’ register is crucial, so that this data can be used to make informed decisions in our joint efforts to eliminate rogue companies from the UK corporate landscape."
        },
        {
            "heading": 2,
            "text": "Building confidence in the UK business environment"
        },
        {
            "text": "The ongoing collaborative efforts of Companies House and the Insolvency Service demonstrate how the Economic Crime and Corporate Transparency Act has empowered government agencies to act swiftly."
        },
        {
            "text": "Our shared intelligence, data analysis and enhanced enforcement powers will continue to target networks of organised criminals and accelerate the removal of inaccurate information from the register, disrupting the flow of criminal currency."
        },
        {
            "text": "These actions form part of a broader approach across several UK government departments to combat and prevent economic crime. Together, we're strengthening the UK’s company register and helping to build a more transparent and trustworthy business environment."
        }
    ]
}