{
    "url": "https://childrenssocialcare.blog.gov.uk/2025/11/28/families-first-for-children-pathfinders-family-help-lead-practitioner/",
    "title": "A day in the life of a Family Help Lead Practitioner",
    "authors": [
        "Warrington Borough Council’s Families First for Children Pathfinder Team"
    ],
    "categories": [
        "Social Work",
        "Working in children's social care"
    ],
    "pub_date": "2025-11-28T10:39:12+00:00",
    "content": [
        {
            "text": "When we visit a family, we're not there as social workers – but that doesn't mean we're offering a different standard of support. As Family Help Lead Practitioners with a range of professional backgrounds, we bring specialised skills to children's social care, working alongside social workers as part of a single team."
        },
        {
            "text": "This new way of working is being tested in Warrington Borough Council, one of 10 Families First for Children Pathfinder areas, providing key learning for national reform. The Pathfinders are exploring how bringing together social workers and practitioners from backgrounds like education, health, and youth work can create better outcomes for families. Our Family Help teams match each family with the right practitioner for their needs.Here, we share the combined experiences of several Family Help Lead Practitioners to illustrate what a typical day looks like for alternatively qualified practitioners in our roles."
        },
        {
            "heading": 2,
            "text": "Preparing for child in need meetings"
        },
        {
            "text": "I begin my morning in the office, preparing for a child in need meeting - a 'child in need' is someone needing extra support from a local authority to stay healthy, develop well or who has a disability. I summarise my recent work with the family, making sure the child's own words and wishes are at the heart of our discussion. I review the minutes from our last meeting – it's always powerful to see how far a family has come when we track progress together."
        },
        {
            "heading": 2,
            "text": "Direct work with children and families"
        },
        {
            "text": "After my morning preparation, I visit a child at school. Being in his familiar environment helps him feel comfortable talking to me about life at home. I draw on techniques I've developed over years in education – using creative activities and age-appropriate communication methods – to understand his wishes and feelings."
        },
        {
            "text": "Later, I visit his mother at home. We talk through the routines and boundaries we discussed at my last visit, celebrating what’s working and problem-solving together where things were harder. I also help her complete some paperwork for Citizens Advice. As I leave, she says: \"Your help makes things feel much less overwhelming.\""
        },
        {
            "heading": 2,
            "text": "Collaboration between social workers and Family Help practitioners"
        },
        {
            "text": "Our Family Help teams aren’t siloed. When cases escalate, a social worker takes the lead but I continue to provide specialist intervention support."
        },
        {
            "text": "This afternoon, I have a case discussion with a social worker colleague and our team manager about a family where the mother has experienced domestic abuse. Drawing on my specialist training, I deliver targeted sessions with her while my social worker colleague oversees the case."
        },
        {
            "text": "Later, I join another social worker visiting a family in crisis. While my colleague has difficult conversations with the parents about safeguarding concerns, I work with the children to understand their feelings and wishes. Afterwards, we debrief together, agreeing how to move forward as a team."
        },
        {
            "heading": 2,
            "text": "Using education experience in children's social care"
        },
        {
            "text": "My years in education gave me a deep understanding of child development and strategies for building trust. The biggest difference in this role is the supervision I receive. Having regular, protected time to discuss cases and reflect with experienced colleagues has transformed how I work."
        },
        {
            "text": "If safeguarding concerns escalate, I know I can draw on my social work colleagues' expertise. We play to each other's strengths."
        },
        {
            "heading": 2,
            "text": "The impact of Family Help teams"
        },
        {
            "text": "In this role, I've seen how the Family Help approach makes a real difference. Families value consistent support as it allows time to build strong relationships. Children respond well to practitioners who understand child development and the Family Help team structure means we can all focus our specialist skills where they're most needed."
        },
        {
            "text": "If you're an education professional, youth worker, or from another relevant background passionate about supporting children and families, the Family Help model might open up new career opportunities. The Families First Pathfinders are showing us what's possible when we think differently about who delivers children's social care."
        },
        {
            "heading": 2,
            "text": "Find out more"
        }
    ]
}