{
    "url": "https://ruralpayments.blog.gov.uk/2025/11/28/how-rpa-uses-remote-monitoring-technology-to-monitor-environmental-land-management-agreements/",
    "title": "How RPA uses remote monitoring technology to monitor environmental land management agreements",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Countryside Stewardship",
        "Sustainable Farming Incentive"
    ],
    "pub_date": "2025-11-28T14:20:52+00:00",
    "content": [
        {
            "text": "If you have a Sustainable Farming Incentive (SFI) agreement or a Countryside Stewardship (CS) agreement with RPA, you’ll be aware that we use a range of methods to monitor environmental outcomes."
        },
        {
            "text": "One of the techniques we use is referred to as remote monitoring. This is in the form of satellite imagery to monitor agricultural land from above."
        },
        {
            "heading": 2,
            "text": "Why we use remote monitoring"
        },
        {
            "text": "We can use remote monitoring to view the land surface at a national scale, on a daily basis using satellites. This helps us to monitor aspects of rural land use such as land cover, vegetation condition and soil erosion risk. "
        },
        {
            "text": "This approach means we can:"
        },
        {
            "heading": 2,
            "text": "Findings from remote monitoring and feedback for farmers"
        },
        {
            "text": "If we identify something using remote monitoring that suggests an action or option is not going to be delivered as expected, we may ask you to provide us with additional evidence of what is happening or has happened on the ground."
        },
        {
            "text": "This may include a summary of the situation and specifically the following information:"
        },
        {
            "text": "It is important that you carefully review any request for further information. If we don’t hear from you, or your evidence is not accepted, your agreement and payment will be amended."
        },
        {
            "text": "In some cases, we may ask one of our Field Officers to visit to confirm the action or option can be delivered. The Field Officer will provide advice and guidance during the visit."
        },
        {
            "heading": 2,
            "text": "Change of circumstances"
        },
        {
            "text": "As a reminder if, for any reason, you are unable to achieve the requirements of your agreement, it is important to let us know as soon as possible. For more information about what to do if there has been a change of circumstances that may affect your agreement, follow the instructions in the relevant GOV.UK guidance for your agreement year and scheme."
        },
        {
            "heading": 2,
            "text": "More information about managing your agreement"
        },
        {
            "text": "You can read more about how to manage your SFI or CS agreement on GOV.UK by following the relevant link below."
        },
        {
            "text": "For information about SFI:"
        },
        {
            "text": "Sustainable Farming Incentive: guidance for applicants and agreement holders - GOV.UK"
        },
        {
            "text": "For information about CS:"
        },
        {
            "text": "Existing agreement holders’ information: Countryside Stewardship - GOV.UK"
        },
        {
            "heading": 2,
            "text": "Contact us"
        },
        {
            "text": "If you have a general question about your agreement, contact us by:"
        },
        {
            "text": "All the information contained in this blog was correct at the time of publishing."
        }
    ]
}