{
    "url": "https://environmentagency.blog.gov.uk/2025/11/28/improving-inland-bathing-waters-why-progress-takes-time/",
    "title": "Improving inland bathing waters: why progress takes time",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Cleaner Seas",
        "Water"
    ],
    "pub_date": "2025-11-28T11:54:16+00:00",
    "content": [
        {
            "text": "This week we published the 2025 Bathing Water Classifications here: 87% of bathing waters rated ‘Excellent’ or ‘Good’ as new reforms come into law - GOV.UK."
        },
        {
            "text": "From the results it's evident that England’s coastal bathing waters tell a strong story of what long-term regulation, sustained investment and effective partnership working can achieve. Decades of targeted partnership action by the Environment Agency, water companies, local authorities and communities have transformed many of our coastal bathing waters, leading to consistently high standards of water quality. "
        },
        {
            "text": "Today, most designated coastal sites are classified as Good or Excellent (87% in the recently released 2025 classifications) – a success built over time through targeted investigations, focused improvements and clear regulation."
        },
        {
            "text": "As bathing water designation has expanded to reflect the places where people now swim, paddle and enjoy the water recreationally, more inland sites are being formally recognised. This is a positive step: designation brings routine monitoring, clearer public information and a stronger foundation for improving water quality where action is needed."
        },
        {
            "text": "However, it is important to recognise that inland waters - particularly rivers - face different and more complex challenges than those on the coast. Improvements will take time because the starting conditions are very different. In fact, in the same 2025 Classification results 12 of the 14 river bathing waters were rated ‘poor’."
        },
        {
            "text": "Why rivers are more challenging"
        },
        {
            "text": "Rivers sit much closer to the sources of contamination that can affect water quality – and there are usually multiple sources. Agricultural run-off, urban drainage, wildlife, misconnected plumbing and treated and untreated wastewater can all contribute. Unlike the sea, rivers usually lack the long travel distances where dilution and natural processes act to reduce bacteria. By contrast, coastal waters benefit from:"
        },
        {
            "text": "• Natural disinfection from saltwater• Wave action and tides that disperse pollution quickly• Greater dilution"
        },
        {
            "text": "Designation is the first step, not the final outcome"
        },
        {
            "text": "Once a river becomes a designated bathing water, we begin detailed monitoring to understand exactly what is affecting water quality and when. Prior to designation a river bathing water will not have been managed for faecal indicator organisms (FIO’s) before. FIO’s are bacterial indicators of faecal contamination that have been linked to people becoming ill. They can come from a variety of sources including sewage, agricultural livestock or wildlife. This evidence is essential before the right measures can be identified."
        },
        {
            "text": "Identifying pollution sources in a river catchment is complex and can take time – often more than one year’s worth of monitoring. Where improvements are needed – which can range from land management to upgrading wastewater infrastructure – these actions often require significant planning, investment and collaboration and can take several years to implement."
        },
        {
            "text": "Progress Will Build Over Time"
        },
        {
            "text": "The success seen at coastal bathing waters shows what is possible. Those improvements did not happen overnight; they were the result of many years of consistent partnership working. Through co-ordinated effort from water companies, industry, the agricultural sector, communities and individuals along with monitoring, regulation and investment. Rivers will follow the exact same journey."
        },
        {
            "text": "As more sites become designated, we gain better insight into how people use them and what actions will make the biggest difference. Over time, as measures are put in place to address river bathing water quality, we hope to see catchments respond, but we must acknowledge the inherent complexity of river systems present challenges."
        },
        {
            "text": "England’s rivers are valued places for recreation and nature, and designation marks the beginning of a long-term commitment to improve them."
        }
    ]
}