{
    "url": "https://opss.blog.gov.uk/2025/11/28/small-batteries-big-solutions-the-science-driving-button-battery-safety/",
    "title": "Small batteries, big solutions: the science driving button battery safety  ",
    "authors": [
        "The Evaluation and Research Team"
    ],
    "categories": [
        "Careers at OPSS"
    ],
    "pub_date": "2025-11-28T16:57:23+00:00",
    "content": [
        {
            "text": "Hidden away in many toys, gadgets and novelty items, button and coin batteries provide a tiny source of power for everyday products that we all have in our homes. While their small, shiny appearance may seem harmless, these batteries can be deceptively hazardous when in the hands of curious young children and vulnerable adults, due to risk of swallowing them. "
        },
        {
            "text": "The growing recognition of these dangers has been driven by tragic incidents, most notably the death of Harper-Lee Fanthorpe in 2021. Her legacy has spurred increased awareness and regulatory support for improved safety standards, with OPSS sponsoring a new battery safety standard in 2021 and leading ongoing consumer safety campaigns to educate about their potentially life-threatening consequences.  "
        },
        {
            "text": "Although ‘button’ and ‘coin’ batteries differ, with coin batteries being larger and lithium-ion powered, presenting a greater risk, they are often used interchangeably. For simplicity, we use the term ‘button battery’ to cover both types.  "
        },
        {
            "text": "Due to growing concern among the public and government, OPSS has been involved in wide ranging work to review and improve button battery safety. Scientists working in OPSS have conducted a review of technologies designed to address the risks associated with button batteries.   "
        },
        {
            "text": " This overview summarises the research publication, including each innovation, their potential to make everyday products safer and the challenges faced when adopting them in products sold in the UK.   "
        },
        {
            "text": "Bitterant-based and diagnostic safety methods   "
        },
        {
            "text": "To help prevent harm before it happens, batteries can be coated in a bitter-tasting chemical substance to deter children from swallowing them. However, evidence remains limited on this methods effectiveness.  "
        },
        {
            "text": "From the moment a button battery is swallowed, the clock is ticking. Tissue damage can occur in as little as two hours. Unfortunately, the symptoms are rarely obvious. This has driven research into innovative detection methods, such as dyes that alert caregivers by changing saliva colour if a battery has been swallowed, and markers that make batteries stand out on x-rays to reduce misdiagnosis with similar objects like coins. While dye-based methods are potentially effective and affordable, more research outside of the laboratory is needed. Researchers are exploring the use of X-ray markers, and this idea is still in its early stages.   "
        },
        {
            "text": "Reactive safety technologies    "
        },
        {
            "text": "While diagnostic methods act as a ‘last line of defence’ to swiftly identify ingestion, innovative reactive safety technologies may reduce harm even after a battery is swallowed. These clever solutions spring into action when exposed to bodily fluids.  "
        },
        {
            "text": "   Approaches include:    "
        },
        {
            "text": "  While these advances are promising, bringing these technologies into everyday products requires costly advanced materials and engineering.    "
        },
        {
            "text": "Safe-by-design methods    "
        },
        {
            "text": "The final group of technologies discussed aim to reduce risks at the design stage, which requires advanced manufacturing.  This includes creating smaller batteries, which are less likely to become lodged in the oesophagus if swallowed, using fewer toxic materials, alternative power sources and lowering the battery’s energy capacity. "
        },
        {
            "text": " While new technologies sound exciting, could button batteries become a product of the past?    "
        },
        {
            "text": " The report explores whether alternative power sources, like solar-power, could replace button batteries. However, for now, this is unlikely to completely remove the need for button battery safety technologies.   "
        },
        {
            "text": "What’s next?  "
        },
        {
            "text": "OPSS will use this latest research to guide future work. Although the technological advances to prevent, alert and reduce harm are promising, the challenges of bringing them into everyday products make it vital to promote education and awareness campaigns to consumers about the undesirable consequences of existing batteries. OPSS continues to lead in this area through initiatives like the ‘small hazards big harms’ campaign.    "
        },
        {
            "text": "We also continue to hold businesses that supply products containing button batteries, particularly for children, accountable and support them in meeting their legal responsibilities. OPSS shares insights and new developments, like those in this blog, with stakeholders including businesses, charities and health services, to raise awareness of approaches that can further reduce button battery risks.  "
        },
        {
            "text": "Want to find out more?   "
        },
        {
            "text": "This report was authored by OPSS researchers. If you are interested in a research career with OPSS, read about our teams and keep an eye out for vacancies or openings in our Research Fellowship Scheme.    "
        },
        {
            "text": "Read the full report.  "
        }
    ]
}