{
    "url": "https://nationalscreening.blog.gov.uk/2025/11/28/uk-nsc-opens-consultation-on-draft-prostate-cancer-screening-recommendation/",
    "title": "UK NSC opens consultation on draft prostate cancer screening recommendation",
    "authors": [
        "Mike Harris"
    ],
    "categories": [
        "Adult screening"
    ],
    "pub_date": "2025-11-28T15:03:09+00:00",
    "content": [
        {
            "text": "The UK National Screening Committee (UK NSC) is today opening a public consultation on prostate cancer screening."
        },
        {
            "text": "It is consulting on its 2025 review of updated evidence and a draft updated recommendation."
        },
        {
            "text": "The UK NSC reviews evidence against detailed criteria to weigh up the balance of risks and benefits. It only recommends a screening programme if published peer-reviewed evidence shows that an end-to-end screening pathway, including diagnostic tests and treatment, would do more benefit than harm to the overall group of people who are invited."
        },
        {
            "text": "The committee commissioned the Sheffield Centre for Health and Related Research (SCHARR) to develop the updated 2025 prostate cancer screening modelling study. The SCHARR report predicts the potential impact of various screening strategies, including population screening and targeted approaches aimed at high-risk groups including black men, men with a family history and men with a BRCA gene variation."
        },
        {
            "text": "We have opened a 12-week public consultation period to ask individuals and organisations to provide feedback on this study and its conclusions, and on the draft recommendation below."
        },
        {
            "heading": 2,
            "text": "Draft recommendation"
        },
        {
            "text": "The UK NSC’s draft recommendation is to:"
        },
        {
            "heading": 2,
            "text": "How to respond"
        },
        {
            "text": "The UK NSC secretariat and SCHARR team will review the consultation responses to determine whether the model and literature review need amending. If no further work is required then final evidence reports and feedback from the consultation will go to the 26 March 2026 UK NSC meeting when members are expected to agree a final updated recommendation."
        },
        {
            "text": "If the consultation responses identify a requirement to revisit the modelling and evidence summary, then it will be updated and considered by the UK NSC at the earliest possible opportunity."
        },
        {
            "heading": 2,
            "text": "About prostate cancer"
        },
        {
            "text": "Prostate cancer is the most common cancer in men, the second most common cause of cancer deaths in men (after lung cancer), and the most common cancer not to have a national screening programme."
        },
        {
            "text": "Each year in the UK, there are about 55,000 new cases and 12,000 deaths from the disease."
        },
        {
            "text": "The risk of getting prostate cancer increases with age. About 75% of prostate cancer deaths are in men aged 75 and over. The condition is very rare in men under 50."
        },
        {
            "text": "Men may also be at higher risk if they:"
        },
        {
            "heading": 2,
            "text": "PSA testing, screening and treatment"
        },
        {
            "text": "The UK NSC does not currently recommend a national screening programme for prostate cancer."
        },
        {
            "text": "Its previous evidence reviews found that the harms of screening outweighed the benefits due to:"
        },
        {
            "heading": 2,
            "text": "The 2025 modelling study"
        },
        {
            "text": "The updated 2025 SCHARR model has been informed by published peer-review evidence, national databases, input from experts and patient representatives, and workshops attended by a wide range of stakeholders."
        },
        {
            "text": "The model has been validated against data from 2 major, long-term, randomised controlled trials into the effectiveness and harms of using PSA testing to screen for prostate cancer: the Cluster Randomised Trial of PSA Testing for Prostate Cancer (CAP) and the European Randomised Study of Screening for Prostate Cancer (ERSPC)."
        },
        {
            "text": "The model assumes the PSA test is the initial test for all screening strategies followed by further tests, such as an MRI scan and biopsy, if the PSA level is high. It assessed each screening strategy for a one-off screening test. If that looked likely to be effective, the researchers also modelled regular repeat screening test scenarios."
        },
        {
            "heading": 2,
            "text": "The TRANSFORM trial"
        },
        {
            "text": "The UK NSC welcomes last week’s announcement that the first men have been invited to join the TRANSFORM screening trial."
        },
        {
            "text": "This randomised control trial, backed by £42 million of funding from Prostate Cancer UK and the government, will compare multiple screening options to each other and the current system."
        },
        {
            "text": "The UK NSC worked with Prostate Cancer UK on the design of TRANSFORM. It will liaise closely with the trial team to get timely access to any trial data that might help fill evidence gaps and inform future modifications to the UK NSC’s prostate cancer screening recommendation."
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK NSC. You can register to receive updates direct to your inbox, so there is no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, please email uknsc@dhsc.gov.uk. "
        }
    ]
}