{
    "url": "https://socialcare.blog.gov.uk/2024/01/15/academy-hopes-for-more-award-winning-care/",
    "title": "Academy hopes for more award winning care",
    "authors": [
        "Arron Bolland"
    ],
    "categories": [
        "Care and support",
        "Innovation",
        "Leadership",
        "Workforce"
    ],
    "pub_date": "2024-01-15T13:59:04+00:00",
    "content": [
        {
            "heading": 2,
            "text": "A centre of excellence"
        },
        {
            "text": "I’m the Learning Development and Quality Manager at specialist dementia care provider, Vida Healthcare’s training centre, Vida Academy, which was recently opened to support the career progression of our current and future colleagues. We’re always looking for new and innovative ways to support our workforce in their career progression and provide the highest quality of care to our residents."
        },
        {
            "text": "My journey at Vida began over a decade ago after graduating from Sheffield Hallam University, with an advanced diploma in Mental Health Nursing Studies. It was whilst on placement I realised I wanted to work in dementia care. I found this to be a hugely rewarding experience and wanted to continue in the field. Working for an organisation committed to innovation and championing alternative approaches to health and wellbeing was hugely important to me."
        },
        {
            "text": "I have since progressed through numerous roles at Vida Healthcare, including Team Leader, Registered Nurse, Clinical Lead and Quality Manager, before taking on my latest role as head of the Vida Academy."
        },
        {
            "text": "The Academy was opened to establish a permanent base for our training department, following the growth of our team. The department invests in staff by promoting lifelong learning to provide opportunities for career progression and establish staff as dementia ambassadors."
        },
        {
            "text": "I am responsible for managing the facility and the learning, development and performance team, as well as overseeing the creation and implementation of continuous training programs. My duties vary day-to-day. Some days are spent leading on courses and meeting new starters, while others are focused on ensuring Vida Healthcare’s certified PIDC programme is always meeting Restraint Reduction Network standards, focusing on behaviour support and interventions for residents."
        },
        {
            "heading": 2,
            "text": "The freedom to deliver success"
        },
        {
            "text": "My favourite part of the job has to be seeing practices taught in our courses being demonstrated across the three homes and making a positive change for residents. We offer a range of courses, from the induction programme for new starters and Care Certificate, to specialist training courses and apprenticeships from Level 2 to Level 6."
        },
        {
            "text": "I’m honoured to have the opportunity to lead the learning, development and performance department and give other colleagues the opportunity to progress in their careers. I have worked at Vida Healthcare for years now and it really feel like we're a family."
        },
        {
            "text": "I feel privileged to have the freedom to be creative, innovative and really make a difference to the lives of residents. Vida Healthcare recently received The Three R’s award for innovation practices in Recruitment, Retention, and Recognition at the Great British Care Awards 2023."
        },
        {
            "text": "The importance of dementia education within care cannot be overstated. While immediate care needs must be met, it is also important to consider the long-term wellbeing of both care providers and residents. Careers in dementia care can be both challenging and rewarding and education is necessary in equipping carers with the knowledge and skills to adapt to the unique needs of each individual."
        },
        {
            "text": "Click here to find out more about career development opportunities."
        }
    ]
}