{
    "url": "https://environmentagency.blog.gov.uk/2024/01/15/bolder-leadership-for-surface-water-flooding/",
    "title": "Bolder leadership for surface water flooding",
    "authors": [
        "defrablogs"
    ],
    "categories": [
        "Environment Agency",
        "Flood"
    ],
    "pub_date": "2024-01-15T15:03:34+00:00",
    "content": [
        {
            "text": "Article written by Julie Foley, our Director of Flood Risk Strategy and Natural Adaptation, Environment Agency"
        },
        {
            "text": "Surface water flooding happens when there is heavy rainfall and there is so much rainwater that it overwhelms drainage systems. Instead, rainwater collects over the ground causing surface water flooding also known as flash flooding."
        },
        {
            "text": "Currently 3.4 million properties in England are in areas at risk from this kind of flooding. Of those at surface water flood risk, over 368,000 properties are in areas at the highest risk – meaning there is a more than a 60 per cent chance they will flood in the next 30 years."
        },
        {
            "text": "Short duration intense thunderstorms cause significant damage and disruption particularly across our towns and cities. And they have also tragically led to fatalities when people have become trapped in floodwaters."
        },
        {
            "text": "Communities at risk, or those who have been flooded, want to understand what is being done and by whom. Lead local flood authorities (local councils) are responsible for managing surface water flood risks on the ground. But we also recognise the important ‘strategic leadership’ role the Environment Agency can play, alongside our day-to-day operational role for managing flood risk from rivers and the sea."
        },
        {
            "text": "We are actively leaning into this leadership space. The Environment Agency is uniquely placed to take a convening role, working with government, local authorities and water companies to share best practice and to promote innovation."
        },
        {
            "text": "What have we done already?"
        },
        {
            "text": "We have already taken positive actions through our Roadmap for delivering the national Flood and Coastal Erosion Risk Management Strategy."
        },
        {
            "text": "We’ve supported 41 lead local flood authorities to enhance local surface water flood risk mapping, following £3.5 million in grants from government. This new mapping will provide 4.6 million people with more detailed information and enable more targeted action. All is freely available from our Check Your Long Term Flood Risk service. And later in 2024 we will be overhauling our National Assessment of Flood Risk, which will provide a much better assessment of future surface water risk for every place in the country, taking climate change into account."
        },
        {
            "text": "Predicting surface water flooding is challenging as the events are often very localised, develop quickly and only last for short periods of time. And that is why the Flood Forecasting Centre, the joint venture between the Environment Agency and the Met Office, has made this a priority. We have been exploring how to improve our capabilities for surface water flood forecasting so that we give emergency responders and communities as much time to prepare as possible."
        },
        {
            "text": "We have developed strategic alliances to help grow and develop the skills that practitioners need. For instance, we have taken a collaborative approach with the Town and Country Planning Association to provide training and guidance for local authority planners. We will continue to improve our digital service - Flood Map for Planning – so that developers and planners can undertake high quality flood risk assessments and in doing so avoid the risks associated with surface water flooding."
        },
        {
            "text": "What are we going to do in the future?"
        },
        {
            "text": "We want to be bolder and support the delivery of more surface water projects through our flood and coastal investment programmes. Our existing £5.2 billion flood investment programme is providing funding for hundreds of projects that will help to mitigate the impacts of surface water flooding to local communities. Many of these projects involve installing sustainable drainage systems (SuDS) that help control surface water runoff by mimicking natural drainage as closely as possible. And in doing so, they provide wider benefits such as reducing pollution runoff and improving water quality."
        },
        {
            "text": "Surface water projects are generally led by local authorities who we recognise have to balance many priorities. To help with this we have streamlined our processes to make it easier for smaller scale surface water flood risk projects to access funding. We will also be updating our guidance to help enable groups of SuDs measures across larger geographies or catchments, where they can be most effective at slowing the flow and protecting communities."
        },
        {
            "text": "Alongside this, we will also support the Regional Flood and Coastal Committees  to innovate and find new and better ways of managing surface water flood risks. We’ll be piloting new ways of working with the London Surface Water Strategic Group, a partnership between the Environment Agency, Greater London Authority, London Boroughs, Transport for London, London Fire Brigade, Thames RFCC and Thames Water. And in other major city regions we will also be looking to encourage new local strategic partnerships."
        },
        {
            "text": "At the end of the day, flooding is devastating no matter what the source of risk is. It’s vitally important that we take a shared ownership across public authorities and the water sector to collectively step up to the challenges of creating a more flood resilient nation."
        }
    ]
}