{
    "url": "https://insidedio.blog.gov.uk/2024/01/15/how-dio-discovered-a-mysterious-painting-of-the-falklands-war/",
    "title": "How DIO discovered a mysterious painting of the Falklands War",
    "authors": [
        "Jon Rickman-Dawson"
    ],
    "categories": [
        "Defence Estate",
        "Royal Navy",
        "Working at DIO"
    ],
    "pub_date": "2024-01-15T16:32:41+00:00",
    "content": [
        {
            "text": "Jon Rickman-Dawson found the painting in a former classroom at HMS Raleigh. [MOD Crown Copyright]I’m the DIO Facilities Manager for HMS Raleigh, a training establishment for new recruits to the Royal Navy. A while ago, I found something a rather unusual painting hidden away in one of the rooms and now I’m on a mission to find out more about it.  "
        },
        {
            "heading": 2,
            "text": "How the painting was found"
        },
        {
            "text": "Following a series of demolition projects at HMS Raleigh, I decided to do a ‘wind and weatherproof’ check of nearby buildings – which had been unused for some time. I’d seen a lot of contractors accessing the buildings for repair works, so it seemed an opportune time to look inside and check the buildings. "
        },
        {
            "text": "When I walked into Building 110, affectionately known as ‘Fieldhouse Block’, I saw something hanging on the wall something that would later become re-adopted as part of life at HMS Raleigh.  "
        },
        {
            "text": "I was greeted by a six-metre long by 1.5 metre tall oil painting.  "
        },
        {
            "text": "At first, I didn’t know what the painting depicted, but I’ve since learnt that it tells the story of a quiet day at Bluff Cove, that, as you look from left to right, all breaks down within seconds as the area was attacked. Jet engines, bombs and explosions descend on the cove and the day turned into a fiery nightmare. It is the bombing of the RFA Sir Galahad during the Falklands War.  "
        },
        {
            "text": "Naval recruits look at the painting. [MOD Crown Copyright]HMS Raleigh was built initially for World War 2.  For recruits who passed out after it was rebuilt in the 1970s, the Falklands War was the first conflict that they might have known.  "
        },
        {
            "heading": 2,
            "text": "‘I need you to find me a wall where we can hang this’ "
        },
        {
            "text": "The Captain in charge of the base was thrilled to see that a new piece of Raleigh history had been discovered; she knew that this was something very special and needed to be on display.  "
        },
        {
            "text": "She said to me, “I need you to find me a wall where we can hang this.”  "
        },
        {
            "text": "I looked all over HMS Raleigh to find somewhere for this to go, and it was no easy feat to find somewhere with an empty seven-metre wall that seemed appropriate for this piece to be displayed.  "
        },
        {
            "text": "The only place I found was the back wall of the trainees’ bar, which had only recently had a generous grant from the Royal Navy and Royal Marines Charity (RNRMC) to refurbish it and, whilst beautifully appointed, had only one picture on its walls – it was a blank canvas.  "
        },
        {
            "text": "A team known as the ‘Buffers’ took great care in dismantling the solid wood frame and wrapping the two sections of the canvas before taking them to the workshop where the frame was cleaned and prepared – removing flaking varnish and years of grime, before re-staining and treating the wood. They re-sited the picture and its refurbished frame in the dead centre of the wall where the seating and lighting frames it perfectly.  "
        },
        {
            "text": "I let the Captain and Commander of HMS Raleigh know that the picture was up and ready for viewing and they brought a small crowd with them.  "
        },
        {
            "text": "I had been unsure if this were the right place for this to hang – the picture is stunning but there are images within that some may find a little disturbing. But the Captain commented that in her view, this was the right place."
        },
        {
            "text": "The picture has since become a source of local interest. The recruits see it, the bar is used for meetings during the day, allowing attendees to experience it too. The General Manager of ESS, one of our contractors, makes a point of showing it to people when she interviews for positions too.  "
        },
        {
            "text": "Part of working for DIO is about being respectful of Defence and its history, and that is exactly what we’re trying to do with the painting. We want to showcase the importance of works like this, while reflecting the sacrifices made in conflicts throughout history. "
        },
        {
            "text": "As yet we still do not know who the artist was or whether the painting comes from imagination and interpretation or from someone’s memory.  "
        },
        {
            "text": "For now, this has pride of place in the Trainees’ Bar, making a commanding presence in the room and forever providing a talking point to visitors. "
        },
        {
            "text": "Anybody who knows who may have painted the artwork is urged to get in touch with DIO by emailing dio-corporatecomms@mod.gov.uk, or via our social media channels."
        }
    ]
}