{
    "url": "https://defradigital.blog.gov.uk/2024/01/15/new-year-new-you-why-were-focusing-on-continuous-improvement/",
    "title": "New year, new you: why we’re focusing on Continuous Improvement",
    "authors": [
        "Chris Thorn"
    ],
    "categories": [
        "Defra digital",
        "Strategy"
    ],
    "pub_date": "2024-01-15T09:26:16+00:00",
    "content": [
        {
            "text": "Chief Digital Officer for Defra Group Chris Thorn shares his thoughts on the value of Continuous Improvement and why it’s important to him."
        },
        {
            "text": "Over the next few weeks in Defra Digital Data and Technology we will be focusing on the topic of Continuous Improvement as part of our staff-driven culture programme; continuous improvement is a collaborative and engaging way of improving our products, services, and processes by increasing efficiency and maximising value for customers."
        },
        {
            "heading": 2,
            "text": "Why Continuous Improvement is important to me"
        },
        {
            "text": "All of my roles, for the last 25 years, have involved working within the triangle of: customer needs, business objectives, and technology opportunities. If I had to put these in order, I would prioritise them in this way; without understanding customer needs (internal or external) it is difficult, if not impossible, to meet business objectives."
        },
        {
            "text": "Once you understand both of these, it is then possible to see how technology can be used to achieve the desired result - meet customer needs and achieve business objectives. Therefore, the strong focus on delivering customer needs is a really important element of continuous improvement, for me."
        },
        {
            "text": "Although projects and programmes are sometimes needed to kick-start and implement large scale change, I’m a strong believer in a service orientated, continuously improving approach. Most strategic services will significantly outlast any project or programme that was initiated to create the service in the first place."
        },
        {
            "text": "Without continual iteration and improvement of the service it will become out-dated over time.  It will likely no longer meet customer expectations, and may not be optimally achieving business objectives, outcomes, or policy intent. The underlying technology may become harder and more costly to support and become more vulnerable to cyber-attack."
        },
        {
            "text": "Continuous improvement and iteration helps to mitigate these issues and move away from the IT system ‘boom and bust’ cycle. This can (and often does) happen when lots of money and effort is put into developing and implementing a new system, which is launched to great fanfare.  The project/programme team move onto something else, no continual improvement happens, and over time the systems become obsolete, and a new project/programme is stood up to replace the system. And then the whole cycle starts again!"
        },
        {
            "heading": 2,
            "text": "Having a strategy helps to guide us"
        },
        {
            "text": "At the heart of our new digital and data transformation strategy is a move towards a different way of working – where we become a more service-orientated organisation, focused on our customers and outcomes (rather than output), and where we have service owners who are responsible for the performance of our priority services and their continual improvement and iteration."
        },
        {
            "text": "The strategy aims to transform our digital services in line with the central government digital, data and technology roadmap. It outlines six missions that cover how we design services, how we leverage technology, how we use data, how we attract and grow digital skills, and how we are changing the way we work to make it easier to deliver our outcomes."
        },
        {
            "heading": 2,
            "text": "Continuous Improvement month - what’s in it for our people?"
        },
        {
            "text": "The purpose of our focus on continuous improvement during this month is to create curiosity, and to start building the foundations of continuous improvement knowledge and culture wider across our organisation.  This will make our workplace a place where our people find it easier and more rewarding to thrive and succeed. There are a few specific things that I, my senior leadership peers and wider colleagues hope to achieve from this focus on continuous improvement though, including:"
        },
        {
            "text": "Winston Churchill is famously reported to have once said “To improve is to change; to be perfect is to change often.” In that regard, we must always try to be realistic and acknowledge that progress isn’t necessary a linear journey; yes, there will often be setbacks, it’s important to be realistic about that."
        },
        {
            "text": "Ultimately our goal, through this focus on improvement, is to make continual improvement an integral part of the way we work, - something we all do. It shouldn’t necessarily be an add-on, rather it should be a natural extension of our normal ways of working. For many it already is; the challenge is to tip the balance more in that direction because we want continuous improvement to become part of the DNA of our organisation, constantly seeking value at the lowest cost to the taxpayer while empowering and energising our staff."
        }
    ]
}