{
    "url": "https://dluhcmedia.blog.gov.uk/2024/01/15/our-message-to-rochdale-boroughwide-housing/",
    "title": "Our message to Rochdale Boroughwide Housing",
    "authors": [
        "dluhcpress"
    ],
    "categories": [
        "Housing"
    ],
    "pub_date": "2024-01-15T13:39:03+00:00",
    "content": [
        {
            "text": "Several national and regional outlets reported this weekend about residents living in homes managed by Rochdale Boroughwide Housing (RBH) who are still suffering from dangerous damp and mould."
        },
        {
            "text": "Coverage across BBC News, Manchester Evening News, Daily Mirror, Daily Express focus on tenant experiences with RBH – including one family who were told that the damp and mould issues in their properties was a result of ‘breathing too much at night’."
        },
        {
            "text": "While the RBH has said the health and wellbeing of residents is their ‘top priority’, it is clearly not the case for this group of tenants who are now suffering from various health problems. It is absolutely unacceptable that three years since the tragic death of two-year-old Awaab Ishak, their residents are still facing serious issues with damp and mould."
        },
        {
            "text": "Following the death of Awaab, the Housing Secretary contacted the Chair and Chief Executive of RBH to demand an explanation for the tragedy."
        },
        {
            "text": "The Regulator of Social Housing found RBH was in breach of its consumer standards – meaning the Government has been able to ban them from bidding for new funding under the Affordable Homes Programme until the breach has been resolved."
        },
        {
            "text": "Last year, the Housing Secretary also announced that £15 million has been allocated to the Greater Manchester region – including Rochdale – to help make improvements and address social homes riddled with damp and mould, as well as other dangerous hazards."
        },
        {
            "text": "It is crucial that social landlords like RBH are held accountable if they do not carry out their basic responsibilities to provide safe and decent homes for tenants. That is why the Government is bringing forward life-changing reforms following Royal Assent of the Social Housing (Regulation) Act."
        },
        {
            "text": "This includes launching our Awaab’s Law consultation last week, which will introduce strict time limits forcing social landlords to fix dangerous hazards, including damp and mould. It proposes new legal requirements to investigate hazards within 14 days, start fixing within a further 7 days, and make emergency repairs within 24 hours."
        },
        {
            "text": "Through these measures, landlords who fail to dangerous hazards could be taken to court and ordered to pay compensation for tenants. Subject to the outcome of the consultation, we will introduce those regulations as soon as possible."
        },
        {
            "text": "Responding to media reports, a Department for Levelling Up, Housing & Communities spokesperson said:\n"
        }
    ]
}