{
    "url": "https://marinescience.blog.gov.uk/2024/01/15/safeguarding-global-coral-trade/",
    "title": "Safeguarding Global Coral Trade: The Power of a New Visual Guide for Border Inspections",
    "authors": [
        "Joanna Murray"
    ],
    "categories": [
        "biodiversity",
        "International",
        "Monitoring",
        "Science",
        "Vulnerable species",
        "Wildlife trade"
    ],
    "pub_date": "2024-01-15T09:35:14+00:00",
    "content": [
        {
            "text": "It’s a dark, damp evening in February 2023 when staff from UK Border Force’s CITES team are called to Heathrow’s Animal Reception Centre to inspect a shipment of hard coral. A mismatch between the CITES permit and its packing list has been flagged. In the darkness, the inspection is done under red light, but despite the difficulties, Border Force needs to make sure that the coral pieces in the box are what they said they are on the permit and in the right quantities, and importantly, all in good time as they are dealing with live animals."
        },
        {
            "text": "It’s not easy when ‘frags’ of coral are packed individually, sometimes within bags that obscure the contents, and even for those corals which are easily seen, distinguishing features can be absent after the long flight. On this occasion, inspectors had access to a new visual guide “Identification of CITES-listed live stony coral in the aquarium trade” which they used to confirm it was just a paperwork error rather than an attempt to illegally import CITES-listed coral."
        },
        {
            "text": "But why are these corals in bags at borders anyway?"
        },
        {
            "text": "Corals have been used and traded for 1000s years for building materials, jewellery and, more recently, live for the international aquarium trade. The live coral trade can provide important local livelihoods, it can incentivise the protection of reef ecosystems because collectors want to have access to high quality coral, and it can drive the development of mariculture initiatives as it has done in Indonesia. Wild collection of corals is relatively low volume and a study in Australia found substantial numbers of species, which are targeted for the aquarium trade, even after sustained collection (Pratchett et al 2020)."
        },
        {
            "text": "However, there is evidence of over collection in some areas and localised reductions in the abundance of in-demand taxa, which prompted concerns about the sustainability of the international trade of corals. In the mid 1980’s, all Scleractinian spp. were listed under Appendix II of the Convention on International Trade in Endangered Species of Flora and Fauna (CITES) as a mechanism to regulate global trade through a permitting system to address these concerns."
        },
        {
            "text": "Key to the success of CITES in regulating trade is accurate species identification, something which is especially challenging for hard corals with over 440 different types in trade, and over 15 million pieces exported internationally between 2016 and 2022 (CITES Wildlife Tradeview)."
        },
        {
            "text": "Creating a guide to support coral inspections"
        },
        {
            "text": "Inspecting staff at borders aren’t coral specialists. Their day job requires them to inspect and verify shipments of live fish, snakes, insects and more, so having easy to use resources to help them confirm what they are looking at is essential. There are some amazing resources available for identifying corals in the field, including Veron’s “Corals of the World” (Vol. 1, 2, 3) and “Coral Finder” but corals often look very different in trade compared to in the wild. Some which are seen as large boulders out on the reef may look like an encrusting coral when a piece has been removed for the aquarium trade."
        },
        {
            "text": "Scientists from the Centre for Environment, Fisheries and Aquaculture Science (Cefas), working with the Indonesian Coral Reef Foundation (TERANGI) and the Indonesian Nature Foundation (Yayasan Alam Indonesia Lestari - LINI) set out to develop a guide to identify corals in trade. We (the authors) wanted to consider how they may have been cut or grown for trade, how their key features may look after a long flight, to provide clues to help distinguish between wild collected and maricultured pieces and most importantly, we needed to produce a guide which is based on CITES accepted taxonomy to avoid confusion when checking lists of species on permits."
        },
        {
            "text": "How did we develop it?"
        },
        {
            "text": "The first thing we needed to do was to establish a list of taxa based on which genera are most traded live. I say taxa because most of the time, corals are traded at the genus level due to the difficulties in accurately identifying coral to species even by an expert with a microscope, but there are some occasions when traders are required to list species level for example Euphyllia."
        },
        {
            "text": "We used CITES trade data (between the years 2010 and 2019) which is freely available on the CITES Wildlife Tradeview online platform. All genera with more than 10,000 pieces of live coral traded during that period were included in our initial list of taxa for the guide. We then shared this list with various stakeholders including importers and exporters, scientific authorities, and coral experts to ensure we had captured all key taxa in trade."
        },
        {
            "text": "Once we had our taxa list, we began the discussion about how to group the corals into chapters using something intuitive to a non-specialist. After much discussion, we settled on gross shape being the key character to group taxa. Importantly, the five shape groupings are as they would be seen in trade and not in the wild, so most taxa fall into one of two groups of “encrusting” as it is often the case that a small piece is taken from a larger wild individual and placed or grown onto a concrete base. This final guide was widely consulted on and reviewed externally by coral taxonomist Professor Bert Hoeksema."
        },
        {
            "text": "How to use it"
        },
        {
            "text": "There are two ways to use the guide. For routine inspections, there will be a CITES permit accompanying the shipment which lists all taxa present within the box. In this scenario, inspectors would look up each of the named taxa using the contents page at the start of the guide which directs them to the page needed. However, where corals have been imported without the correct paperwork and there is no list of taxa included, inspectors must begin by looking at the shape of the piece in front of them and turning to the most appropriate shape chapter to begin the identification process."
        },
        {
            "text": "Once they have matched the piece in front of them to a shape chapter, they will be presented with an overview page which has photos of all the genera listed within it. Now inspectors can look for the most likely candidates for the piece in front of them and turn to the genus level page to begin checking specific distinguishing features and comparing it with its look-alikes."
        },
        {
            "text": "Checking for signs of mariculture"
        },
        {
            "text": "For each chapter and shape type, information is provided on signs of mariculture production to support inspectors in distinguishing between coral pieces which have been collected from the wild or produced in mariculture initiatives. Details relating to the artificial base including fouling and maturity of the cement and glue are relevant across shapes, but other features are specific to certain shapes such as the symmetry of the piece following mariculture or the size of the coral piece relative to the artificial base. It can be very difficult to differentiate between maricultured corals (Source code F) and wild collected corals."
        },
        {
            "text": "Watch list"
        },
        {
            "text": "We included a watch list in the guide which contains taxa which may be subject to current or previous trade suspensions or other restrictions, or which may be slow-growing, have a high value or are traded in high volumes. UK border teams have requested that this watch list be produced as a poster which can be displayed where inspections take place as a quick reference to taxa which may require closer examination."
        },
        {
            "text": "The guide also provides 14 context pages providing useful information on CITES source codes, mariculture, shipment red flags and references to other important resources like CITES accepted taxonomy."
        },
        {
            "text": "International launch"
        },
        {
            "text": "The guide was launched during a Defra-hosted side event at the CITES Convention of the Parties (CoP19) in November 2022. The event was open to international delegations, non-government organisations and industry bodies. The panel, which was convened by Defra, included presentations by Guy Clarke from Border Force, Dominic Whitmee from OATA, Nichola Burnett from JNCC and myself, on the challenges of monitoring corals in trade and how this guide can help."
        },
        {
            "text": "Around 150 copies of the A5 version of the guide were made available at the side event and all were snapped up, with requests for us to provide hard copies for use at borders. We have since provided around 100 physical copies of the guide in English to border staff in the UK and The guide has also been shared with the Korean scientific authority who have now produced the document in Korean."
        },
        {
            "text": "Training sessions"
        },
        {
            "text": "On 5th October 2023 staff from Quarantine, BPSPL technical units, the CITES Management Authority, the Ministry of Environment and Forestry and the Coral Association attended a short training course with accompanying resources."
        },
        {
            "text": "Gayatri Reksodihardjo-Lilley (founder of LINI) who organised the training said"
        },
        {
            "text": "“The feedback from the training session was overwhelmingly positive, with participants expressing a keen interest in further sessions at their respective offices. Moreover, they expressed a willingness to distribute the guidebooks to their field staff for wider utilization.”"
        },
        {
            "text": "We hope that together, the guide and the training will support quicker, more accurate identification and verification of corals in trade to secure sustainable coral trade and to safeguard corals on the reefs."
        },
        {
            "text": "Collaboration is key"
        },
        {
            "text": "This initiative began back in January 2022 with a 3-day online stakeholder workshop to share knowledge on current processes in monitoring coral trade and identify the key challenges faced by different stakeholders. We all shared in the commitment to develop a resource that could practically support staff at borders, industry, and scientific authorities who want to ensure coral trade is sustainable into the future. The guide would not have been possible if it were not for dedicated project partners and a large team of committed collaborators who provided expert advice, photographs, and reviews."
        }
    ]
}