{
    "url": "https://ukhsa.blog.gov.uk/2024/01/15/should-we-be-worried-about-the-new-covid-19-variant/",
    "title": "Should we be worried about the new COVID-19 variant?",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Coronavirus (COVID-19)"
    ],
    "pub_date": "2024-01-15T11:04:15+01:00",
    "content": [
        {
            "text": "With the emergence at the end of last year of COVID-19 variant JN.1, there are questions about how it compares to the many other variants that have been identified."
        },
        {
            "text": "JN.1 descends from variant BA.2.86 and has an additional mutation in the spike protein. It has recently become the most widely circulating variant in the US as well as in France. As of January 2024, approximately 60% of English cases are caused by JN.1."
        },
        {
            "text": "UKHSA is continuing to monitor data relating to variants both in the UK and internationally, including close monitoring of the JN.1 variant, and assessment of severity and vaccine effectiveness. There is no change to the wider public health advice at this time."
        },
        {
            "text": "There are no reports of people becoming more ill with this COVID-19 variant than with previous ones."
        },
        {
            "text": "It is important to note that we will need more data to draw any conclusions about the effect of these mutations on transmissibility and severity of the variant. In this blog post we’ll outline what we know so far and what action we are taking."
        },
        {
            "text": "It’s normal for viruses to mutate and change, and more widely we’re still getting to grips with how the healthcare system responds to the ebb and flow of seasonal cases. As more data becomes available on this variant, we’ll have a better understanding of how it interacts with our immune systems and how to optimise our protection and as well as actions we can take to keep the most vulnerable safe and live our lives as normally as possible."
        },
        {
            "heading": 2,
            "text": "If people become unwell, and are unsure if they have COVID-19, what should they do?"
        },
        {
            "text": "If you have symptoms of a respiratory infection, such as COVID-19, and you have a high temperature or do not feel well enough to go to work or carry out normal activities, you should avoid contact with vulnerable people and stay at home if possible."
        },
        {
            "text": "For those of us who absolutely can’t stay at home, our Living with COVID guidance is unchanged, and outlines how to prevent transmission to others."
        },
        {
            "heading": 2,
            "text": "Why should people come forward for their vaccine?"
        },
        {
            "text": "Vaccines remain our best defence against severe disease and hospitalisation from flu and COVID-19. That’s why we’re asking over-65s, anyone in a clinical risk group, and anyone living in a household with someone who is in a clinical risk group, to come forward for their vaccination. Their protection since their last vaccination will have waned and they remain at increased risk from a respiratory infection this winter. It’s also important to note that COVID-19 isn’t a special case; respiratory infections can be unpredictable, and we’re asking similar groups to get vaccinated against flu."
        },
        {
            "text": "The last date that the seasonal COVID-19 vaccination will be available is 31 January 2024."
        },
        {
            "heading": 2,
            "text": "What surveillance systems are in place?"
        },
        {
            "text": "We publish the latest surveillance data for COVID-19 and other respiratory illnesses weekly, to the UKHSA data dashboard. We’re also getting vital data from those who are admitted to hospital with symptoms, and we are utilising genome sequencing to understand which variants people are most vulnerable to."
        },
        {
            "text": "There are also specific surveillance programmes in place, where small sample groups are tested regularly. These allow us to monitor trends in the wider community."
        },
        {
            "text": "Hospital is where we will see the more severe cases, and we will be monitoring the numbers of people attending with COVID-19 symptoms very carefully. This will help us understand the growth rate and transmission potential of the new variant."
        },
        {
            "text": "We continue to collaborate globally with health organisations in other countries, the World Health Organisation and initiatives such as the Global Influenza Surveillance & Response System (GISAID) to ensure that we have the most current data."
        },
        {
            "heading": 2,
            "text": "What is the UKHSA doing to tackle the new variant?"
        },
        {
            "text": "When a new variant appears on our radar, at the initial stages it is often quite difficult to know whether the mutations provide any advantages to the virus. Genetic mutations happen all the time, and in some cases have been known to make a virus less transmissible or cause a milder reaction in people."
        },
        {
            "text": "At these early stages our scientists at the Vaccine Development and Evaluation Centre (VDEC) are busy growing a stock of the JN.1 variant in our high containment facilities, so that we can begin testing."
        },
        {
            "text": "At the same time, scientists in our COVID-19 Vaccine Unit work hand in glove with vaccine developers to get samples of new, as yet unlicensed, vaccines to assess whether they will give better protection against the virus."
        },
        {
            "text": "Vaccinations for flu and COVID-19 help to keep vulnerable people out of hospital and carrying on with their day-to-day lives, as well as reduce pressure on our NHS which is always critical in the winter. If you’re eligible for the jabs, please don’t hesitate, book your vaccine and get winter strong."
        }
    ]
}