{
    "url": "https://ruralpayments.blog.gov.uk/2024/01/15/your-grants-introducing-you-to-2/",
    "title": "Your Grants 'Introducing you to...'",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Grants",
        "Introducing You To"
    ],
    "pub_date": "2024-01-15T14:08:31+00:00",
    "content": [
        {
            "text": "RPA offers a wide range of grants and rural payments to farmers, businesses and local authorities. In this series of blogs, we look at the grants available in more detail, using case studies to showcase those who have taken advantage of these opportunities, as well as highlighting the work of the RPA Grants Service Team in administering them. In this blog we meet Jen Walker who works on the appraisal stage of grants."
        },
        {
            "text": "Hi, I’m Jen and I’m a Caseworker in Grants Service, focussing on the appraisal stage of the grant application. My main role is to assess the full applications that come in through the Farming Transformation Fund (FTF) and make a recommendation on whether the grant should be approved or not, before passing it on to the next stage. I also carry out a ‘sponsorship’ role, which is when customers who’ve been invited to full application stage are allocated a sponsor, such as myself, who are there to answer any queries they may have."
        },
        {
            "text": "I particularly enjoy this aspect of my role as I love talking to people and helping businesses to improve. I like to pick up the phone to farmers and talk them through any queries they may have, giving them the correct information they need to apply for the grants that will help them develop and improve their business."
        },
        {
            "text": "The Farming Transformation Fund provides grants of £25,000 to £500,000 towards large capital items to help businesses improve productivity, profitability, and environmental sustainability. There are currently five competitive grants available through the FTF and I work on three of them. The ones I deal with are:"
        },
        {
            "text": "I’ve worked in this role in the appraisals team for two years, but I’ve been in Grants Service since 2018 – and moved into this role from the claims and contracting team."
        },
        {
            "text": "Before joining RPA, I was at the Department for Work and Pensions (DWP) for 14 years, and before DWP I worked in a department store in Newcastle’s Metro Centre and in the duty free shop at the airport. It’s totally different within Grants Service – it’s been a very positive move for me."
        },
        {
            "text": "I’m based in Newcastle and outside of work my life revolves around football. My husband and two sons, aged 11 and 15, are all fanatical Newcastle United supporters, and season ticket holders. One son is a referee, both play on a Sunday and my husband coaches, so my whole life is scheduled around them. Obviously I do it for them, but don’t tell anyone – I’m not that interested in football - I’d rather be shopping!"
        },
        {
            "text": "When I do get time, I love being outside and the housework can be left. But in winter, when the weather isn’t very good, in my spare time I like to sew small items like bags and bunting and then give them to charity. I used to sew as a child but lost interest in my 20s but I’ve discovered it again and it’s wonderful."
        },
        {
            "text": "Please visit https://www.gov.uk/guidance/funding-for-farmers  regularly for more information as this page sets out every payment on offer, with links to learn more."
        }
    ]
}