{
    "url": "https://educationhub.blog.gov.uk/2022/09/back-to-school-week-everything-you-need-to-know-about-school-attendance/",
    "title": "Back to school week – Everything you need to know about school attendance",
    "authors": [
        "media officer"
    ],
    "categories": [
        "Attendance"
    ],
    "pub_date": "2022-09-02T12:05:59+01:00",
    "content": [
        {
            "text": "Face-to-face education is important in helping pupils to fulfil their potential."
        },
        {
            "text": "During school time we believe pupils should be in class with their teachers and peers and enjoying all the benefits that brings."
        },
        {
            "text": "Parents or carers of a child have a legal responsibility to ensure their child receives a suitable education. This is usually achieved through regular attendance at school."
        },
        {
            "text": "Here will look at everything you need to know about school attendance."
        },
        {
            "heading": 3,
            "text": "Why is regular attendance so important?"
        },
        {
            "text": "Being in school every day that it is open, is important to your child’s achievement, wellbeing, and their wider development."
        },
        {
            "text": "With millions of pupils set to return to schools and colleges over the coming days, there will be a renewed focus on maximising pupils’ time in the classroom, as evidence shows that the students with the highest attendance throughout their time in school gain the best GCSE and A Level results."
        },
        {
            "text": "Here’s what the data shows:"
        },
        {
            "text": "There are only a small number of circumstances where missing a school day is permitted."
        },
        {
            "heading": 3,
            "text": "When can my child be absent from school? "
        },
        {
            "text": "When you register your child at school, you have a legal duty to ensure your child attends that school regularly."
        },
        {
            "text": "This means that your child must attend every day that the school is open, unless:"
        },
        {
            "text": "These are the only circumstances where schools can permit your child to be absent."
        },
        {
            "heading": 3,
            "text": "What do I need to do if my child needs to be absent from school for one of those reasons? "
        },
        {
            "text": "You should contact their school as early as possible to explain why. If not, your child’s school will contact you on the first morning of their absence to find out why."
        },
        {
            "text": "All parents can request a ‘leave of absence’ for their child which gives them permission to be absent from school. Leaves of absence must be applied for before your child will be absent and will only be granted in exceptional circumstances."
        },
        {
            "text": "Your child’s headteacher has the final say over whether to approve the request and how long your child can be absent."
        },
        {
            "text": "Their decision will be made after considering the specific facts and circumstances behind your request."
        },
        {
            "heading": 3,
            "text": "Can I take my child on holiday during term time?"
        },
        {
            "text": "Parents should plan their holidays around school breaks and avoid requesting leaves of absence for holidays unless it is unavoidable."
        },
        {
            "text": "As leave of absence is only granted in exceptional circumstances, it is unlikely that your child’s headteacher will agree a leave of absence for a family holiday."
        },
        {
            "text": "If permission is refused and you keep your child off school on the days requested, you are likely to be committing an offence and be issued a fixed penalty notice or be prosecuted by your local authority."
        },
        {
            "heading": 3,
            "text": "Where can I get support to help my child attend school?"
        },
        {
            "text": "Children may struggle to attend school for a wide range of reasons."
        },
        {
            "text": "If your child is struggling to attend school, both their school and your local authority also have responsibilities to help you to support your child’s attendance."
        },
        {
            "text": "In most cases, if your child’s attendance level is falling, their school will contact you to explore the reasons and discuss what help can be put in place to help you overcome the barriers they are facing."
        },
        {
            "text": "If your child is struggling to attend school, you can expect the school to meet with you and your child if they are old enough.  The school will want to understand the reasons for their absence and what support you or they need to overcome the barriers to attendance they are experiencing."
        },
        {
            "text": "If the barriers to your child’s attendance are in school – such as they are having friendship problems – the school is responsible for working with you to help overcome the issues."
        },
        {
            "text": "Information on who in school you can contact for help, including the school’s senior leader responsible for attendance, can be found in the school’s attendance policy on its website or available in hard copy from the school itself."
        },
        {
            "text": "If the barriers to attendance you or your child are facing go beyond the remit of the school – such as a transport or a mental health issue – both the school and local authority have a responsibility to help you. This includes helping you to access the wider support you might need, for example from the school nurse or from local housing or transport teams."
        },
        {
            "text": "As part of the conversation you have with your child’s school you will agree a set of joint actions you will all take to help overcome any barriers to attendance."
        },
        {
            "text": "This agreement will often include a commitment to refer or help you to access support services in exchange for an agreement from you to engage and take part in the support offered. They will also arrange mutual convenient times for you to come together to review these and your child’s progress."
        },
        {
            "text": "This agreement may take the form of an informal action plan, an early help plan, or a parenting contract – depending on the complexity of the reasons for your child’s absence."
        },
        {
            "heading": 3,
            "text": "What else are you doing to help combat unauthorised absence? "
        },
        {
            "text": "We are launching a three-year 1-2-1 attendance mentoring pilot from this term, aimed at tackling the factors behind non-attendance such as bullying or mental health issues."
        },
        {
            "text": "It is being launched in Middlesborough this year, before expanding to other areas of the country next year. The pilot will provide tailored support to over 1,600 persistently and severely absent pupils over the three-year period."
        },
        {
            "text": "Schools, academy trusts, local authorities and the government will also have access to a powerful new attendance data visualisation tool is also being launched to help to spot and respond to issues."
        },
        {
            "text": "This data is supporting the launch of the new, interactive national attendance dashboard alongside the publication of the first full fortnightly attendance data of the term. This is expected later in September and will providing ongoing transparency and vastly improved potential for insight and analysis of daily, weekly and termly trends."
        },
        {
            "text": "The majority of schools are now sharing daily register data with the department, where it is aggregated and presented back in dashboards to schools, academy trusts and local authorities."
        },
        {
            "text": "This enables teachers to analyse attendance with greater ease, allowing issues with individual pupils, or groups such as children on free school meals, for example, to be spotted more quickly."
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}