{
    "url": "https://ipa.blog.gov.uk/2022/09/02/being-lgbt-in-government-project-delivery-delivering-for-a-diverse-country-requires-a-diverse-civil-service/",
    "title": "Being LGBT+ in government project delivery: “delivering for a diverse country requires a diverse civil service”",
    "authors": [
        "laurenvamplew"
    ],
    "categories": [
        "Project Delivery"
    ],
    "pub_date": "2022-09-02T12:50:24+01:00",
    "content": [
        {
            "text": "This blog is part of the Infrastructure and Project Authority’s Role Models Campaign, which aims to increase diversity at all grades in the Project Delivery Profession."
        },
        {
            "text": "Karl Briggs is a Grade 6 Senior Project Manager in the Home Office. He works as part of a response team which involves being deployed into any area where a programme or project requires urgent assistance. He started his civil service career within HMRC as an Assistant Officer, working his way through grades in various professions before choosing a career in the Project Delivery Profession."
        },
        {
            "text": "My Royal Navy career and accepting my sexuality"
        },
        {
            "text": "I live in St. Helens, which is a small town in Merseyside, North West England with my husband Matthew. I love travelling, adventure sports and going to the theatre. I started my working career in the Royal Navy at the age of 18 in the Communications and Weapons Engineering Department. At the time, I was still exploring my sexuality and didn’t give it a second thought that I was gay, especially during the 1990s when being gay in the Navy was illegal. During the course of my time in the Navy, I accepted my sexuality but kept it a secret as I felt unconformable ‘coming out’, especially when I had to share a room with 30 other men and therefore was worried about how they might have treated or viewed me differently. Due to the nature of my job, I was also regularly away from the security of home, family and friends. During my last year of service, the law changed allowing people who identified as LGBT+ to join the armed forces, and whilst it took a while for the culture to change, this was an important step forward. "
        },
        {
            "text": "Leaving the Royal Navy and entering project delivery"
        },
        {
            "text": "After leaving the Navy I joined Cheshire Police as a civilian, which then led me to join the Civil Service and begin a career in project management. I didn’t set out to do this, but through various roles, I eventually found myself as a Project Business Analyst, which then led to a Project Manager role. I have been very lucky within the Civil Service and never experienced any discrimination due to my sexuality. One aspect that I enjoy about my current role is that I get to deploy and experience all areas of the Home Office, but that does come with the challenge of frequently having to ‘come out’ to new people. I generally feel that one of the most difficult aspects of being LGBT+ is having to ‘declare’ your sexuality every time you meet new people or join new teams. While I have struggled with this in the past, in recent years I don’t give it much thought and this could be attributed to the fact that when coming out I have been fortunate to not experience any negativity."
        },
        {
            "text": "Diversity in the profession"
        },
        {
            "text": "The Project Delivery Profession delivers change for not only a diverse Civil Service workforce but also a diverse country. It is therefore essential that the Project Delivery Profession continues to have people within it that represent all walks of life."
        },
        {
            "text": " "
        }
    ]
}