{
    "url": "https://childrenssocialcare.blog.gov.uk/2023/03/06/bringing-specialists-to-children-not-children-to-specialists/",
    "title": "Bringing specialists to children not children to specialists",
    "authors": [
        "Natalie Byron"
    ],
    "categories": [
        "Alternative Provision"
    ],
    "pub_date": "2023-03-06T13:53:23+00:00",
    "content": [
        {
            "text": "Natalie Byron is the team manager for the City of Birmingham School’s Alternative Provision Specialist Taskforce (APST), a Department for Education (DfE) pilot programme involving teams of multi-disciplinary specialists co-located in school. Here she explains her team's role in re-engaging children in their education and protecting those who are at risk of serious violence and exploitation."
        },
        {
            "heading": 3,
            "text": "Specialist support across the city"
        },
        {
            "text": "I work within the City of Birmingham’s Pupil Referral Unit. It offers specialised provision for up to 464 children across 7 campuses in the city."
        },
        {
            "text": "Most children come to this school because they have been permanently excluded from a mainstream school. This means they are likely to be disengaged from education and have challenging behaviour. They may also have suffered trauma or adverse childhood experiences and have poor school attendance, and the majority have Special Educational Needs and Disabilities (SEND)."
        },
        {
            "text": "Every child or young person referred to the team is assessed on entry to determine their needs. Working onsite together means the team can draw on their range of specialist expertise to agree how to meet those needs, reducing the number of referrals and waiting times."
        },
        {
            "text": "Our primary focus is to reduce the child or young person’s risk of serious youth violence and exploitation and improve their school attendance and engagement. Once support is put in place, the multi-disciplinary team approach helps to build a holistic understanding of children’s needs and develop trusting relationships so we can put in place early and appropriate support. We regularly review each child’s progress and assess if changes are required."
        },
        {
            "heading": 3,
            "text": "Tailored support that builds trusting relationships"
        },
        {
            "text": "My team’s expertise is embedded throughout the school, so that staff across all sites can draw on specialist knowledge and advice. The taskforce works hard to develop positive working relationships between parents and carers, other schools, and local and regional partner agencies to better understand the children’s lived experience."
        },
        {
            "text": "The APST team consists of:"
        }
    ]
}