{
    "url": "https://buyingforschools.blog.gov.uk/2023/03/06/buying-quality-school-meals-using-dfe-approved-frameworks/",
    "title": "Buying quality school meals using DfE-approved frameworks",
    "authors": [
        "Charlotte Springthorpe, Customer Relationship Manager at ESPO"
    ],
    "categories": [
        "Services"
    ],
    "pub_date": "2023-03-06T14:33:23+00:00",
    "content": [
        {
            "text": "International School Meals Day 2023 is on 9 March and as we celebrate, you might be thinking about retendering your own catering contracts ready for the next academic year. You can use our Find a Framework tool to explore the range of DfE-approved frameworks that offer catering solutions."
        },
        {
            "text": "In this blog post, Charlotte Springthorpe, Customer Relationship Manager at Eastern Shires Purchasing Organisation (ESPO), highlights two new, DfE-approved, ESPO catering frameworks – Catering services and Grocery, fresh, chilled and frozen foods."
        },
        {
            "text": "Research shows that a healthy diet is essential for the wellbeing of children to support their development. Our focus at ESPO is firmly on delivering high quality meals at a reasonable price and ESPO’s DfE-approved Catering services framework provides fantastic choice. With over 40 quality-checked suppliers that can provide extensive menus, support and training, it truly offers value for money. If you have an in-house catering provision, ESPO’s DfE-approved Grocery, fresh, chilled and frozen foods framework is available, offering customers a simple and competitive route to a wide range of food items including grocery provisions, frozen foods, fresh meat and fresh fruit and vegetables. All suppliers have passed the same quality checks and can offer product guidance, menu planning and assistance with Food for Life awards."
        },
        {
            "text": "With an increasing popularity in vegan and vegetarian diets, rising allergies and the diversity of our schools, providing a range of meals to suit dietary, religious and allergy requirements can be difficult. The responsibility of ensuring that children in your care are eating healthy, safe and suitable food is a huge task. ESPO’s frameworks are designed with you in mind and aim to make sourcing goods as easy as possible. Our Catering services framework caters to ethnicity, cultural and religious needs, as well as providing innovative menus in line with current food trends. Our Grocery, fresh, chilled and frozen foods framework can also help with special diets."
        },
        {
            "text": "As with any organisation, schools play a crucial part in creating an environmentally friendly planet. Every little helps and we are seeing changes such as less printing, more recycling and increased education on the topic. ESPO suppliers can support you to be more sustainable with your catering solutions, offering a variety of options including compostable, biodegradable and recyclable catering consumables via our DfE-approved Catering equipment framework."
        },
        {
            "text": "So, as we celebrate International School Meals Day 2023, why not start your procurement journey with ESPO and make the most of our catering frameworks to provide your students with high quality, great value products and services."
        },
        {
            "text": "If you want to find out more and get the chance to ask us your questions, register now to join our webinar this week:"
        },
        {
            "text": "Buying catering services for your school through ESPO – Wednesday 8 March, 9.30am"
        },
        {
            "text": "If you’ve found this article useful and want to learn more about how we’re supporting schools, click ‘sign up and manage updates’ to subscribe to our blog and receive notifications when we next post."
        }
    ]
}