{
    "url": "https://deframedia.blog.gov.uk/2023/03/06/defra-calls-for-more-action-to-protect-the-worlds-ocean/",
    "title": "Defra calls for more action to protect the world’s ocean",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Fisheries"
    ],
    "pub_date": "2023-03-06T11:57:35+00:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "There was national and regional coverage following our announcement of new projects under the Blue Planet Fund to boost marine conservation efforts worldwide, fight climate change, and support vulnerable coastal communities."
        },
        {
            "text": "The Independent reported the UK has pledged nearly £75 million to marine conservation projects, while the Express ran an op-ed from the Environment Secretary on World Wildlife Day (3 March) in which she called on the rest of the world to help us protect nature for future generations, including managing our whole ocean sustainably."
        },
        {
            "text": "The announcements were made by the Environment Secretary Thérèse Coffey at the ‘Our Ocean’ conference last week where she called for countries around the globe to join together, raise ambition and act faster to protect and restore nature on both land and sea."
        },
        {
            "text": "The UK has renewed support through its ambitious £500 million Blue Planet Fund to protect and restore important marine habitats such as mangroves, coral reefs and seagrasses, including an additional £24 million to the Global Fund for Coral Reefs. Meanwhile, the UK will become the first donor to the Blue Carbon Action Partnership, committing £4 million to support countries unlock and mobilise finance to protect and restore blue carbon ecosystems."
        },
        {
            "text": "The Environment Secretary also announced £45 million to the new ‘Blue Tech Superhighway’ project to support small-scale fishers and aquaculture farmers and encourage collaboration between countries across Asia and Africa, as well as £1.5 million to the Asian Development Bank’s new Blue Pacific Finance Hub to support climate resilient, sustainable blue economies for Pacific Small Island Developing States."
        },
        {
            "text": "Alongside this, Therese Coffey urged more countries to join forces to tackle Illegal, Unreported and Unregulated (IUU) fishing, one of the most serious threats to the world’s ocean. The UK, US and Canada launched the world’s first global alliance to tackle IUU fishing last year - more members signed up at the ‘Our Ocean’ conference including the EU, Panama and New Zealand."
        },
        {
            "text": "The Environment Secretary, Thérèse Coffey said:"
        },
        {
            "text": "“It is almost impossible to overstate the importance of stepping up our efforts to bolster the resilience of the marine environment and, in turn, the economies and communities that depend on it."
        },
        {
            "text": "“At the UN nature summit in Montreal, we made a commitment to manage our whole ocean sustainably and set a target to protect at least 30% of the world’s ocean by 2030. The UK is leading, co-leading, and supporting global coalitions of ambition to drive forward this mission, and I urge countries to come together to deliver coordinated, impactful action on the ground.”"
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}