{
    "url": "https://defradigital.blog.gov.uk/2023/03/06/how-being-planet-centric-can-really-make-a-difference-when-designing-services/",
    "title": "How being planet-centric can really make a difference when designing services",
    "authors": [
        "Ned Gartside"
    ],
    "categories": [
        "Defra digital"
    ],
    "pub_date": "2023-03-06T09:29:00+00:00",
    "content": [
        {
            "text": "In the latest from our ‘Sustainability Heroes’ series, service designer Ned Gartside talks about the work of Defra’s planet-centred design working group, which has focused on creating a set of principles to guide the design of lower-environmentally impacting services."
        },
        {
            "text": "Like many of us, my concerns about climate change and the environmental crises facing the planet go back quite a way. At various points, I have found myself joining discussion groups, doing a bit of volunteering for environmental charities, and even (very ambitiously) co-founding a climate ‘think tank’, composed solely of me and some of my student friends."
        },
        {
            "text": "Time was when I wondered about going back to university to study environmental science. But design was always my thing, and that’s the path I chose."
        },
        {
            "text": "However, when a role in service design came up at Defra, meaning I had the chance to place my design skills (such as they are) at the service of projects that aimed to improve our environmental situation, I absolutely leapt at the chance."
        },
        {
            "text": "Even better, once I was here, I heard tales of a ‘planet-centred design working group’. I signed up right away!"
        },
        {
            "heading": 2,
            "text": "Designers, encountering a problem"
        },
        {
            "text": "Once I had got to know my colleagues in the working group, it seemed pretty clear we were all grappling with what was essentially the same issue."
        },
        {
            "text": "We were aware that digital wasn’t green by default. That digital had real and tangible impacts on our planet, whether from all the energy used, and therefore carbon produced, by data centres and networks, or the damage caused by the resource extraction, manufacture, distribution and then disposal of electronic devices."
        },
        {
            "text": "At the same time, we were frequently reading about lofty aspirations for design, in its various guises, to contribute to our societies to becoming net-zero on greenhouse gas emissions, to the transition to circular economies, and to even be regenerative and play a part in helping to restore the planet’s natural ecosystems."
        },
        {
            "text": "What we wanted to understand was where our work, as designers and researchers in the (mostly) digital sphere, could practically fit in with enabling these goals."
        },
        {
            "text": "The dominant paradigm in design was and is, of course, user-centricity, meaning focusing on user needs alongside organisational goals and technical feasibility. What it seemed was needed was to radically broaden this scope to also include consideration of the needs of the planet as a key stakeholder."
        },
        {
            "text": "Our problem though, was that we didn’t really know where to begin. Our problem was also that we didn’t’t know enough about the environmental impacts of the digital ‘materials’ we were working with, and the infrastructure that enabled them, to really drive conversations, let alone start being ‘planet-centric’."
        },
        {
            "heading": 2,
            "text": "Coming together as the Planet-centred design working group"
        },
        {
            "text": "The working group was formed in response, so we could start educating ourselves on the topic and create opportunities for more conversations around these within the user-centred design community."
        },
        {
            "text": "In terms of outputs, our primary focus over the last six months or so has been drafting a set of principles to illustrate what ‘good’ looks like for the design of services from an environmental point of view."
        },
        {
            "text": "The following examples give some flavour and context to our principles. It’s worth saying that many of the environmental wins are also wins for usability, accessibility, inclusivity, and cost as well."
        },
        {
            "heading": 2,
            "text": "Ten examples of our planet-centred design principles:"
        },
        {
            "heading": 2,
            "text": "The importance of holistic collaboration on digital projects "
        },
        {
            "text": "We are also very aware that to really deliver lower-environmentally-impacting services, we are going to need to think holistically and collaborate closely across all the disciplines involved in digital projects."
        },
        {
            "text": "Sustainable ICT policy, across government and the wider public sector, is owned by Defra. Strategy, guidance, and tools all sits on gov.uk and this includes reference to architecture, data, and development, as well as team practices, and the Technology Code of Practice, all of which compliment what we have on the design side."
        },
        {
            "text": "Our ultimate hope is for the creation of a one-stop shop, (created perhaps through collaboration between Defra and Cabinet Office) where anyone working on a digital project can go and see guidance for their discipline, and also read about how best to collaborate with colleagues from other disciplines."
        },
        {
            "heading": 2,
            "text": "Where are we going from here?"
        },
        {
            "text": "There is so much more work to be done! From here, there are numerous avenues that we are pursuing:"
        },
        {
            "text": " "
        }
    ]
}