{
    "url": "https://marinescience.blog.gov.uk/2023/03/06/monitoring-uk-seas-how-smart-data-and-teamwork-are-key-to-cefas-success/",
    "title": "Monitoring UK seas: how smart data and teamwork are key to Cefas success",
    "authors": [
        "Michelle Devlin",
        "Naomi Greenwood",
        "Chris Read",
        "Paul Nelson"
    ],
    "categories": [
        "data",
        "Monitoring",
        "Policy",
        "Science",
        "Technology"
    ],
    "pub_date": "2023-03-06T09:37:37+00:00",
    "content": [
        {
            "text": "Scientists love a bit of data, but it’s not just dry numbers and graphs. To celebrate International Open Data Day on March 5th, Cefas scientists, Michelle Devlin, Chris Read, Naomi Greenwood and Paul Nelson tell us about their work under the UK Marine Eutrophication Monitoring Programme, which monitors water quality in UK seas. They talk about the importance of teamwork, and the challenges and rewards of working with real-time data collected by Cefas SmartBuoys and the RV Cefas Endeavour research vessel."
        },
        {
            "text": " What are SmartBuoys and why is the data collected so important? "
        },
        {
            "text": "Michelle: Cefas Smartbuoys are highly sophisticated pieces of equipment that are used to collect data on our seas. They are deployed on surveys four times a year by our research vessel, the RV Cefas Endeavour. We currently have three located across the UK and they collect real-time data on a range of things, from the salt content, temperature, turbidity, oxygen levels, chlorophyll fluorescence and nitrate concentration. Water samples are also collected and preserved onboard for later analysis of nutrients and phytoplankton species.  "
        },
        {
            "text": "Cefas SmartBuoys have made a huge contribution to monitoring and improving water quality in the UK, feeding into UK and the Convention for the Protection of the Marine Environment of the North-East Atlantic (OSPAR) assessments on eutrophication (the measurement of nutrients and other pollutants in our water), which is helping us to understand real time changes to the marine environment, and how we can manage them. "
        },
        {
            "text": "Can you tell us a bit more about your specific roles? "
        },
        {
            "text": "Naomi: There is a lot to organise before a SmartBuoy even hits the water. My role is to help coordinate the operational and logistical aspects of the programme. I work with colleagues to ensure that the surveys for deploying SmartBuoys and the collection of water samples are planned and go ahead on time, identifying potential challenges and changes to the approach. "
        },
        {
            "text": "Chris: I’m a Marine Engineer and my role is maintaining and developing the systems that are deployed on our Smartbuoys. Surveys can last anywhere between 2.5 to 7 days and so it’s important that Cefas engineers and scientists have all the tools and equipment they need aboard the ship during recovery and deployment operations. "
        },
        {
            "text": "Paul: I run the biogeochemistry lab, which is responsible for analysing the water samples, collected by the SmartBuoys. I look for things like chlorophyll, dissolved oxygen, salinity and dissolved inorganic nutrients. Once analysed, I then submit discrete sample data to a central database to ensure that the UK meets its mandatory monitoring requirements under the Oslo and Paris Convention for OSPAR and Joint Assessments and Monitoring Programme (JAMP). "
        },
        {
            "text": "Michelle: I work with Defra and a wide range of people across Cefas to lead the delivery of the UK’s Marine Eutrophication Monitoring Programme. I am also responsible for delivering on the UK’s eutrophication assessment for the UK Marine Strategy and OSPAR, and feed in the data collected to support UK policy. Within the eutrophication and data team, we also explore new and existing technology to collect data, work with our partners for a more joined up catchment to coast approach, and support science innovation for national and international programmes. "
        },
        {
            "text": "What are the most interesting and rewarding parts of the role? "
        },
        {
            "text": " Michelle: Seeing the whole process from start to finish: data collection, analysis, and assessment. Every data point is part of a bigger story, helping us to understand what is changing, and why."
        },
        {
            "text": "Naomi: I agree. It has been incredibly rewarding to be part of a programme creating a data rich time series where changes and the drivers of change can be observed at various timescales from hours, days, to seasons, decades."
        },
        {
            "text": "Paul: Simply put it’s the people, past and present. Integrated and interdisciplinary science is at the heart of this monitoring programme, which means we have a multitude of people with very different skills sets and having the opportunity to work with those people is what keeps it interesting."
        },
        {
            "text": "Chris: For me, it’s maintaining equipment that spends a great deal of its life in a very harsh environment. It’s very satisfying to see it come back having collected data and done its job. I’m particularly proud of having kept some 20-year-old equipment going strong over the years."
        },
        {
            "text": "What is the most challenging part of your role/the programme?"
        },
        {
            "text": "Naomi: There is such a wide range of people involved in this programme; from the maintenance of instruments, hardware and moorings; database and IT development; to surveys and deployments, sample collection and analysis, logistics; to project management, and more besides, so a challenge is to ensure that we are communicating effectively across the team to ensure the programme maintains a consistent approach, and also to do that whilst adopting new technology."
        },
        {
            "text": " Michelle: Keeping the data flows consistent and up to date. There are challenges with working with lots of different types of data. Our in-situ data (what we collect at sea) is the key data set that helps deliver our assessments, but we are looking at lots of different ways of processing that data, and also what the different types of data tell about the processes and variability that influence our marine environment. "
        },
        {
            "text": "Chris: Ensuring the programme is efficient and delivers value for money is always a challenge given the costs and maintenance involved. However, on the positive side, new technologies such as anti-biofouling innovations for our sensors (which stop them clogging up with debris), has enabled our SmartBuoys to stay out at sea longer between servicing, saving on ship time and costs."
        },
        {
            "text": "Paul: Yes, keeping all our instruments running smoothly is a challenge. Some of them, we suspect, may have developed personalities and we must be careful when talking about them. I love them all equally…"
        },
        {
            "text": "What excites you about technological advances and the future of the programme?"
        },
        {
            "text": "Michelle: There is a lot happening right now; better sensors, different types of systems, such as Wave gliders, or drones; higher resolution satellite data to enable monitoring across bigger areas, joined up catchment to coast monitoring that will generate new information to improve catchment management; and increased action from governments and their citizens wanting to see a reduction in marine pollution. What could be more exciting than that?!"
        },
        {
            "text": "Chris: There is some interesting innovation from Cefas’ in-house electronics development unit (EDU). They are developing a new data logger which can trigger the collection of water samples when the onboard sensors detect conditions of interest - for example, a decrease in salinity levels could indicate a large flooding event. This work has led to smaller and more power efficient equipment with greater reliability and versatility. It’s great to be working with this home-grown equipment and advancing data collection technology."
        },
        {
            "text": " What would you say to anyone wanting a career working with data?"
        },
        {
            "text": " Michelle: Get ready to deal with a lot of numbers, be good at coding, but also good at problem solving. A lot of the issues can be resolved with some common sense and a great team around you. Be adventurous, and ready to take on the challenges of using environmental data to help us understand what is changing and where, and use that information to help protect our marine environment."
        },
        {
            "text": "Chris: It’s not just about numbers in a download or a spreadsheet, but also data collection which can take many forms, so the career paths are varied. I have a retort for people who come down to our workshop and complain about the odour of equipment that’s been at sea for months…. ‘that’s the smell of raw data’….and there is nothing quite like it."
        },
        {
            "text": " Naomi: If you can get some field experience by going on surveys, it’s invaluable for understanding the environment in which the data is collected and its limitations - and it’s a fantastic experience too!"
        },
        {
            "text": "If you are interested in the work of the UK Marine Eutrophication Monitoring Programme  team, please contact michelle.devlin@cefas.gov.uk"
        },
        {
            "text": " "
        }
    ]
}