{
    "url": "https://educationhub.blog.gov.uk/2023/03/06/national-careers-week-2023-where-young-people-advice-choosing/",
    "title": "National Careers Week 2023: Where young people can get advice on choosing the right career",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Careers"
    ],
    "pub_date": "2023-03-06T13:05:01+00:00",
    "content": [
        {
            "text": "Making decisions about your future career can seem overwhelming but National Careers Week (6th to 11th March 2023) is a great time to start thinking about it, whether you’re at school, college or university."
        },
        {
            "text": "To help young people get the information they need to make an informed decision about their future, we support schools to deliver top quality careers guidance, as well as developing a range of free career advice tools that are available all year round."
        },
        {
            "text": "Here we explore some of the ways pupils and students can get valuable information about careers from trusted sources."
        },
        {
            "heading": 3,
            "text": "What’s the point of seeking out career advice?"
        },
        {
            "text": "There’s no one route into a career, and taking A Levels and going on to university is not the right choice for everyone. From T Levels to supported internships, there are lots of different ways to get the skills you need for an inspiring career."
        },
        {
            "text": "Talking to a careers adviser or taking advantage of job guidance offered by your school, college or university gives you the opportunity to chat through your options and find the best path for you."
        },
        {
            "heading": 3,
            "text": "Can children get career advice at school?"
        },
        {
            "text": "Yes, they can. All state-funded secondary schools must provide independent careers guidance to all pupils. Every school and college also has a Careers Leader who is in charge of the careers programme. Students can speak to them about their options and how to navigate next steps."
        },
        {
            "text": "Schools must also offer their pupils at least one work experience opportunity by the age of 16 and a second by the age of 18, to give them a sense of the skills that are valued in the workplace."
        },
        {
            "text": "It is also now a legal requirement for all year 8 to 13 pupils to have at least six opportunities to meet a range of providers of technical education and apprenticeships. This will help pupils gain an understanding of the full range of opportunities that are available to them, including apprenticeships, T Levels and Higher Technical Qualifications - not just a traditional academic route."
        },
        {
            "heading": 3,
            "text": "What else are you doing to support career advice in schools?"
        },
        {
            "text": "The Careers and Enterprise Company (CEC) works with secondary schools, colleges and employers to improve careers education and give young people the best chance of success in work."
        },
        {
            "text": "The CEC trains and supports in school Careers Leaders, brings employers, educators and providers together through a network of careers hubs and provides a range of free advice tools and resources. You can find out more about the CEC here."
        },
        {
            "text": "We’re also funding the Apprenticeship Support & Knowledge for schools and colleges programme (ASK programme), which aims to increase awareness of apprenticeships and T Levels. So far, over 2 million students have received support from ASK."
        },
        {
            "heading": 3,
            "text": "Where else can you find careers advice?"
        },
        {
            "text": "The National Careers Service provides free and impartial careers advice, information and guidance. It’s available to anyone aged 13 and older."
        },
        {
            "text": "‘Get The Jump’ section of the National Careers Service website outlines the different available training routes and shows how they compare."
        },
        {
            "text": "You can also look at over 800 job profiles, with important information on things like salary levels, typical responsibilities and the best route into each job or career."
        },
        {
            "text": "You can also:"
        },
        {
            "text": "If you’d like personalised advice from a qualified careers adviser then there are lots of ways to get in touch including by phone, webchat or in person."
        },
        {
            "heading": 3,
            "text": "Other resources include:"
        },
        {
            "text": "To keep up to date with National Careers Week events, follow the National Careers Service on Twitter, Facebook, LinkedIn and Instagram and visit their NCW page here."
        }
    ]
}