{
    "url": "https://vmd.blog.gov.uk/2024/02/01/2023-student-extramural-studies-placement/",
    "title": "2023 Student Extramural Studies Placement",
    "authors": [
        "Claire Gilbert"
    ],
    "categories": [
        "Training",
        "VMD News"
    ],
    "pub_date": "2024-02-01T13:13:03+00:00",
    "content": [
        {
            "text": "During summer 2023, we were delighted to host a one-week study placement for veterinary students at our offices in Surrey. This was the third year we had offered this popular training opportunity."
        },
        {
            "text": "Students participated in a wide-ranging programme of presentations and workshops, showcasing the breadth of the VMD’s activities. Topics featured included:"
        },
        {
            "text": "Students joined the course from universities across the UK and had the opportunity to share ideas and experiences during workshops and group sessions."
        },
        {
            "heading": 2,
            "text": "Positive feedback from students"
        },
        {
            "text": "There was a focus on making the course relevant to new graduates in clinical practice, with feedback received that “It was useful to use scenarios seen in the workplace that we might actually encounter. Nowadays when I see an SPC, I think quite fondly of it.”"
        },
        {
            "text": "One student reported that “The week at the VMD has been full of interesting and helpful discussions with vets in unique positions. I'm really grateful to have had the opportunity to hear about their work first-hand, and having other students there brought up great questions.”"
        },
        {
            "heading": 2,
            "text": "Your opportunity for the 2024 placement"
        },
        {
            "text": "We are thrilled to host the Student EMS placement again from 8 to 12 July in Addlestone, Surrey. We are inviting veterinary students who are in their final two years of study to attend our one-week placement."
        },
        {
            "text": "For more information and how to apply see our news item on GOVUK ."
        },
        {
            "text": "Please send your completed application forms to ems@vmd.gov.uk."
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}