{
    "url": "https://ruralpayments.blog.gov.uk/2024/02/01/come-and-meet-rpa-at-shows-and-events-across-the-country/",
    "title": "Come and meet RPA at shows and events across the country",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "External engagement"
    ],
    "pub_date": "2024-02-01T16:40:00+00:00",
    "content": [
        {
            "text": "It’s going to be a busy 2024 for RPA, ensuring its external engagement is as successful, if not more so, than last year’s. We’ll be engaging with even more farmers and rural communities across the country, with a presence at 30 agricultural shows and events."
        },
        {
            "text": "If you’re attending any, come and have a conversation with us. We’ll primarily be there to talk to farmers and agents about all current and future schemes and will also be specifically promoting the Sustainable Farming Incentive (SFI), Farming Investment Fund grants and Countryside Stewardship."
        },
        {
            "text": "At various engagements we’ll also be delivering presentations, for example - the Farm Update North, Dartmoor Hill Farming Network, Farm Cornwell, Northumberland National Park and FWAG Farmer Workshop."
        },
        {
            "text": "We’ll also be joined by relevant experts, such as the Grants Service team at the ag machine shows."
        },
        {
            "text": "Visiting our stand at an event is often the only face-to-face contact people have with RPA, and for us, being able to meet farmers and agents provides unique feedback which influences the way we write guidance and design processes. It’s also a chance for us to gain some early insight into how you feel about our existing and future schemes."
        },
        {
            "text": "At a number of stands we’ll also be co-locating with the Defra Farming and Countryside Programme, offering a one stop shop for Defra. You can check out the FCP events page here: Talk to us in 2024 - Farming (blog.gov.uk)"
        },
        {
            "text": " "
        }
    ]
}