{
    "url": "https://defraenvironment.blog.gov.uk/2024/02/01/connecting-businesses-with-nature-projects/",
    "title": "Connecting businesses with nature projects",
    "authors": [
        "Justin Francis"
    ],
    "categories": [
        "Green finance",
        "Nature"
    ],
    "pub_date": "2024-02-01T10:01:47+00:00",
    "content": [
        {
            "text": "Projects for Nature is a pioneering new online platform that connects businesses and other donors with 23 nature recovery projects across England (all of which have been screened by experts)."
        },
        {
            "text": "I’m Justin, the nature lead for The Council for Sustainable Business. We came together with Accenture, Crowdfunder, Defra, Natural England and the Environment Agency to address an urgent gap in the nature finance landscape by bringing Projects for Nature to life."
        },
        {
            "text": "Why does nature need finance?"
        },
        {
            "text": "Nature is one of our most valuable assets. We all rely on it to produce food, shelter, medicine and clean water. Land-based and marine ecosystems also play a vital role in regulating our climate. The World Economic Forum estimates that more than half of the world’s total GDP ($44 trillion) is moderately or highly dependent on nature."
        },
        {
            "text": "To successfully restore nature, we must both limit our negative impacts and actively fund its recovery – to create bigger, better, and more joined-up space for nature."
        },
        {
            "text": "The government set out its approach to improve the state of nature through its Environmental Improvement Plan (EIP) in January last year, aligned and supporting progress towards the international goals and targets agreed under the Global Biodiversity Framework late in 2022."
        },
        {
            "text": "Private finance has an important role to play in delivering this plan. However, current levels of private finance in nature are far from the scale needed to achieve its ambition."
        },
        {
            "text": "To address this, government has set a goal that, by 2027, £500 million of private investment must go into nature recovery every year. This target rises to £1 billion each year by 2030. The urgency of nature loss leaves little time for delay – action is needed from all sectors of society to dramatically scale up the amount of finance into nature recovery."
        },
        {
            "text": "Businesses are beginning to measure and address their impacts on nature, with 320 companies becoming early adopters of the Taskforce for Nature-related Financial Disclosures (TNFD) and 17 companies setting targets to reduce their nature impact through the Science Based Targets Network (SBTN) pilot. However, more action is needed to fund large-scale species recovery and ecosystem restoration. This is where Projects for Nature comes in."
        },
        {
            "text": "Introducing Projects for Nature"
        },
        {
            "text": "Projects for Nature is a pioneering partnership that aims to close the nature funding gap in England. Our platform connects businesses and other donors with nature recovery projects that have been screened by experts."
        },
        {
            "text": "We are engaging a growing number of large corporations that show leadership in addressing their nature impact. Lloyd’s Banking Group and Scottish and Southern Electricity Networks have already committed to fund a number of our nature projects."
        },
        {
            "text": "Projects for Nature builds on other nature financing opportunities. Investment in projects on the platform could be used to contribute towards a \"response disclosure metric\" under TNFD or used to meet the “Landscape Engagement” target of SBTN."
        },
        {
            "text": "Projects for Nature enables businesses to invest with confidence in early-stage nature recovery projects. Any investment is above and beyond their work to reduce their own impacts and offset impact through nature markets, such as Biodiversity Net Gain."
        },
        {
            "text": "And to avoid any greenwashing, businesses on the platform are screened to establish whether their investment is in addition to, and not instead of, actions to reduce the carbon emissions and negative-nature impacts of their operations and supply chains. Businesses can’t claim that investment in Projects for Nature makes them “Net Zero” or “Nature Positive” – they have to be taking meaningful action to reduce their impact first."
        },
        {
            "text": "How we select the nature projects"
        },
        {
            "text": "From bringing back rare bumblebees to restoring seagrass meadows, our projects were screened from a long list sourced through our collaborator, Wildlife and Countryside Link."
        },
        {
            "text": "Projects will be delivered by trusted organisations, such as the Wildlife Trusts and National Trust. Defra Group screening ensures projects align with local and national nature recovery priorities."
        },
        {
            "text": "A diverse portfolio of 23 projects, totalling over £10 million, has been selected for our first phase of Projects for Nature. They are a mix of scale, desired outcomes, and geographic spread across England. Many of our projects also provide a variety of social benefits, such as job creation, community engagement and improving access to nature."
        },
        {
            "text": "Ways to get involved"
        },
        {
            "text": "We invite businesses to register their interest to join Projects for Nature and demonstrate their commitment to restoring nature in England."
        },
        {
            "text": "We also invite individuals to donate directly to any of our projects. Explore our projects now to find projects that inspire you, align with your personal interests or are located in your local area."
        },
        {
            "text": "Finally, if you are a land manager or eNGO, with a project that meets our eligibility criteria, we invite you to subscribe to Projects for Nature updates and stay informed of potential opportunities to get involved in the future."
        },
        {
            "text": "We’ll also regularly post updates about Projects for Nature, and other activities supporting nature recovery, on this blog. Please subscribe to receive an email notification when we publish a new post."
        }
    ]
}