{
    "url": "https://publicpolicydesign.blog.gov.uk/2024/02/01/designing-the-worlds-most-effective-border/",
    "title": "Designing the world's most effective border",
    "authors": [
        "Patrick O'Shea"
    ],
    "categories": [
        "Case study",
        "PublicPolicyDesign"
    ],
    "pub_date": "2024-02-01T12:00:47+00:00",
    "content": [
        {
            "text": "I recently spoke to pupils at my local high school, as part of the Cabinet Office schools outreach programme, to inspire them to consider a career in the Civil Service."
        },
        {
            "text": "To bring my presentation to life, rather than talk through my Civil Service career history interspersed with key highlights and challenges over the last 27 years or so, I decided to focus on my current Policy Adviser role. I did this because my team and I have achieved so much within a relatively short time working on an important review – against a backdrop of the Covid-19 pandemic."
        },
        {
            "text": "This helped demonstrate to the students how varied and interesting Civil Service work can be, and how by working in policy you can help make a positive difference to the lives of our citizens!"
        },
        {
            "heading": 2,
            "text": "So, first things first - what am I working on?"
        },
        {
            "text": "When the UK left the European Union (EU), it had the opportunity to re-imagine how it manages its borders. My team, called the Presence at the Border review team, was established to work on one of the many commitments in the UK Border Strategy."
        },
        {
            "text": "My team was tasked to help the government by creating an efficient and effective border to serve not only the needs of the people and businesses who use it, but also benefit the frontline border staff at ports by improving outdated paper-based processes and procedures in relation to goods movements (not passengers) and recommending new innovations and practices - without compromising border security."
        },
        {
            "text": "We know from prior research that border industry stakeholders want us to improve checks, ensure consistency between location and increase the flow of goods. And from day one we were clear, our focus was to ensure we took a user centric approach to developing improvements – to help better deliver smarter checks, ensure traders experience an improved coherent government presence and overall customer service experience - while also ensuring we deliver the government's objectives."
        },
        {
            "heading": 2,
            "text": "Identifying the big challenges at the border"
        },
        {
            "text": "We undertook extensive engagement with border users and industry, researched international best practice, undertook various visits to ports (across Great Britain and in the Netherlands), spoke with all departments and agencies with a border role and responsibility and we embedded staff at Heathrow Airport and the maritime ports of Immigham and Southampton for 10 weeks."
        },
        {
            "heading": 2,
            "text": "What did I do?"
        },
        {
            "text": "As part of the research stage, I was initially tasked with agreeing our definition of the border as well as determining how many departments, agencies and public bodies have a role at the border. This involved me researching who might be involved – aided by old National Audit Office reports - and contacting numerous departments, agencies, public bodies and devolved administrations. Once I identified the right contacts, I was able to use a combination of persuasion and influence to help them to understand why this review was so important and their engagement was essential - to help gather the required information and inform next steps."
        },
        {
            "text": "With guidance from a tech-savvy colleague, I was able to illustrate all the different government departments, agencies and public bodies who have a presence or an interest at the border in a Venn diagram – which helps to show the complex system at the UK border."
        },
        {
            "heading": 2,
            "text": "Our review indentified challenges to address "
        },
        {
            "text": "The research evidence obtained enabled us to identify that our existing border processes, structure and culture currently prevent us from becoming the most effective border in the world, highlighting the following challenges:"
        },
        {
            "heading": 2,
            "text": "Making a difference"
        },
        {
            "text": "We made the following key recommendations to address these challenges:"
        },
        {
            "text": "As well as progressing these key recommendations we are working on a number of interesting activities including:"
        },
        {
            "text": "We are confident from our analysis of the options that once the recommendations and activities are realised, frontline government border staff, traders, hauliers - and indirectly members of the public - will notice a positive difference thanks to our review (as well as other initiatives) and they will agree that our border is one of the most effective in the world. However, we are not complacent, and as part of our continuous improvement approach we are looking to develop mechanisms to help ensure that our review is a success and it sustains improvements - but only time will tell…"
        },
        {
            "heading": 2,
            "text": "Want to know more?"
        },
        {
            "text": "We developed a Reform Toolkit – which is designed to help colleagues across the Civil Service discover how we used the principles behind phase one of the Modernisation and Reform programme to inspire us to use a number of innovative policy techniques to underpin our review. For example, our use of port partnership leads in three ports, our steering group chaired by our Minister with responsibility for borders, and the use of the Policy School to develop and test some innovative new ideas."
        },
        {
            "text": "To find out more about the work of the Presence at the Border review team or the Reform Toolkit, you can contact:"
        }
    ]
}