{
    "url": "https://dragonsden.blog.gov.uk/2024/02/01/dragons-den-ip-blog-series-21-episode-5/",
    "title": "Dragons' Den IP Blog - Series 21 Episode 5",
    "authors": [
        "Nathan Llewellyn"
    ],
    "categories": [
        "Business",
        "Confidentiality",
        "Copyright",
        "Designs",
        "IP",
        "Patents",
        "Trade marks"
    ],
    "pub_date": "2024-02-01T21:00:10+00:00",
    "content": [
        {
            "text": "Innovative ventures and intellectual property set the stage alight on Dragons' Den this week, with a wide variety of businesses seeking investment and advice from the Dragons' experienced judging panel. From a hair care revolution to dental hygiene for cats, the Den saw a variety of presentations, each with their own unique challenges and opportunities."
        },
        {
            "text": "A 'hair' brained invention, or revolutionary hair and scalp care?"
        },
        {
            "text": "First up were Tim and Dani Binnington, the dynamic husband-and-wife duo behind Manta Hair. With a product aimed at minimising hair breakage and loss, the couple sought £240,000 for a 4% equity stake in their company. The Dragons, mindful of a previous miss with a similar product, Tangle Teezer, scrutinised the invention's uniqueness."
        },
        {
            "text": "You can view the patent for the Binningtons' flexible brush through this link."
        },
        {
            "text": "Peter Jones acknowledged the couple's meticulous approach to intellectual property, lauding their investment in patents and other protective measures, commenting \"You have done all of the right things, getting all your patents and doing all your IP\"."
        },
        {
            "text": "Deborah Meaden expressed regret over passing on a comparable product in the past:"
        },
        {
            "text": "Despite multiple enticing offers, the Binningtons declined, leaving with their innovative hairbrush and a testament to the power of strategic IP planning."
        },
        {
            "text": "Dental Wand: the cat's whiskers?"
        },
        {
            "text": "Victor Carpio entered the Den with a solution to a peculiar problem – cleaning a cat's teeth. Seeking £45,000 for a 10% share in Dental Wand, Victor faced early challenges as the product broke during the demonstration. However, Deborah Meaden, a lifelong cat owner, recognised the potential and offered all the money for 40% of the business. Touker Suleyman matched the offer, and Victor sealed the deal with fellow feline enthusiast Deborah."
        },
        {
            "text": "Touker was feline sceptical:"
        },
        {
            "text": "A quick check shows that Dental Wand has secured design rights for Dental Wand, showcasing the importance of protecting not only the functionality but also the visual aspects of a product."
        },
        {
            "text": "Sooper Books: a literary twist in the tale"
        },
        {
            "text": "In a literary finale, husband-and-wife duo Charlene and Simon Mitchell-Hood presented Sooper Books, an online collection of stories for children. With an ask of 1% for £1, the couple aim to translate their fourteen million views into a Den success story."
        },
        {
            "text": "The Dragons, in a collective effort, gave a pound for 1%, resulting in the couple giving away 5% of their business but walking away with the support of all five Dragons. Along with royal investment in Princess Beatrice, and the Dragons' unanimous support, this showcased a fairy-tale ending for Sooper Books. History books are made with the lowest valuation and the smallest ask."
        },
        {
            "text": "For those inspired by the Den, it's crucial to recognise the importance of intellectual property in safeguarding innovative ideas. Trade marks, patents, and copyright play a pivotal role in securing a brand's identity and ensuring its longevity in the competitive market. As showcased in the Den, protecting assets and understanding the marketplace are vital steps for any business aiming to make their own mark in the ever-evolving world of entrepreneurship."
        },
        {
            "text": "Don’t forget to keep a look out for more upcoming editions as we follow the BBC Dragons' Den series."
        },
        {
            "text": " "
        },
        {
            "text": "Disclaimer:"
        },
        {
            "text": "The purpose of the IPO's Dragons' Den IP blog is to help identify the IP in entrepreneurs’ pitches and highlight how IP works, or could work, in the real-life examples featured. IPO’s authorship of this blog does not constitute its endorsement or sponsorship of any products, individuals or businesses referenced within it."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}