{
    "url": "https://homeofficemedia.blog.gov.uk/2024/02/01/electronic-travel-authorisation-eta-scheme-factsheet-february-2024/",
    "title": "Electronic Travel Authorisation (ETA) scheme factsheet – February 2024",
    "authors": [
        "Home Office news team"
    ],
    "categories": [
        "Fact sheet"
    ],
    "pub_date": "2024-02-01T09:50:37+00:00",
    "content": [
        {
            "text": "The government’s number one priority is keeping the UK safe. To strengthen the security of our border and improve travel, the UK has launched an Electronic Travel Authorisation (ETA) scheme - an ETA is a digital permission to travel to the UK."
        },
        {
            "text": "ETAs are being introduced as part of our transformation and digitisation of the UK border. They will enable a more efficient customer experience and cement the UK as a world leader in border security."
        },
        {
            "text": "The ETA scheme is broadly for visitors who do not need a visa for short stays to the UK, or who do not already have a UK immigration status prior to travelling."
        },
        {
            "text": "On 1 February 2024, the scheme opened for nationals of Bahrain, Kuwait, Oman, United Arab Emirates, Saudi Arabia and Jordan, who will require an ETA to travel to the UK from 22 February 2024. Qatari nationals already need an ETA. Other nationalities cannot and do not need to apply yet."
        },
        {
            "text": "An ETA costs £10, permits multiple journeys and is valid for two years or until the holder’s passport expires – whichever is sooner.​​"
        },
        {
            "text": "The ETA scheme will be introduced worldwide for visitors to the UK who do not currently need a visa for short stays, including European nationals."
        },
        {
            "text": "We will confirm the timings in due course for when remaining eligible nationalities will need an ETA, and we will ensure they have sufficient time to prepare."
        },
        {
            "text": "How much will an ETA cost?"
        },
        {
            "text": "How do people apply for an ETA?"
        },
        {
            "text": "How many visitors will this impact?"
        },
        {
            "text": "How will an ETA help UK border security?"
        },
        {
            "text": "What will happen if someone is refused an ETA?"
        },
        {
            "text": "How will the scheme work in the context of the Ireland-Northern Ireland border?   "
        },
        {
            "text": "Will Electronic Visa Waivers still be valid?"
        },
        {
            "text": "Are ETAs needed by those transiting through the UK? If so, why? "
        }
    ]
}