{
    "url": "https://defraenvironment.blog.gov.uk/2024/02/01/get-to-know-rebecca-pow-minister-for-nature/",
    "title": "Get to know Rebecca Pow, Minister for Nature",
    "authors": [
        "Minister Rebecca Pow"
    ],
    "categories": [
        "Minister Pow",
        "Nature"
    ],
    "pub_date": "2024-02-01T14:57:34+00:00",
    "content": [
        {
            "text": "Growing up on my parents' mixed livestock, dairy and arable farm in Somerset, I liked nothing better than to be out feeding the calves, moving cattle from field to field, and hauling bales during summer harvest. All of this while running my own small chicken business and a bed and breakfast enterprise in the farmhouse."
        },
        {
            "text": "Being immersed in the countryside, where lapwings nested in the open fields, hares lolloped across permanent grasslands and swallows returned every year to nest in the barn, was something to truly raise the spirits and bring joy. Every field and green lane was bounded by fulsome hedgerows burgeoning with blossoms, berries and wildlife, on account of my father’s foresight in only trimming the hedges each side every other year."
        },
        {
            "text": "It was a nature-filled landscape and it kindled my passion for the natural world, especially as it links to our farming landscapes, and it has informed and inspired my career path. It was a working farm, part tenanted, and of necessity had to be profitable, and I was acutely conscious of the value of the farmers’ raw material – soil – and the need to treasure it. Drawing on my experience, my first university project was on farmers’ attitudes to conservation, something barely talked about in those days."
        },
        {
            "text": "I would describe myself as a traditional Conservative with a twist of the contemporary and my own added touch of environmental green. I vowed that, should I be honoured to become our MP in Taunton Deane, as well as doing all I could for my home area, I would focus on environmental issues in Parliament. In 2018, I was pleased to be awarded a Green Heart Hero Award by The Climate Coalition, for being the \"Greenest New MP\" for my environmental work. And I am still proud to have held the first debate ever held in our Parliament on soil!"
        },
        {
            "text": "When I was a backbencher, several of my environmental campaigns influenced Government policy, including the ban on plastic microbeads, gaining extra protection for ancient woodland and veteran trees, legislating for net zero carbon and getting soil health firmly embedded into the future farming agenda."
        },
        {
            "text": "I was also proud to co-edit the first publication from the Conservative Environment Network, called: \"Thinking differently about our environment: a holistic approach to policy\". Many of its recommendations have now been included in legislation."
        },
        {
            "text": "I joined Defra in 2019 as Environment Minister, working on a range of subjects from animal welfare issues to flood protection. I also steered the world-leading Environment Act 2021 through Parliament, working with over 350 officials and introducing legislation that sets us on a course for a sustainable future. It was a huge honour. And later in that role, I instigated and put in place the comprehensive Plan for Water."
        },
        {
            "text": "Now, as Minister for Nature, my focus is on biodiversity and nature recovery. It’s an extensive brief, covering wide-ranging topics such as funds to support our wildlife, habitat creation, National Parks and all our protected sites, tree planting targets and measures to protect bees and other vital pollinators. And I stress that working with our farmers remains a key to success – drawing on the experience I gained growing up and working on our family farm."
        },
        {
            "text": "Already there are many projects that I’m thrilled to have worked on. You can read about Defra’s achievements in more detail, but my personal favourites since I took over this brief have been:"
        },
        {
            "text": "And there’s so much more to come this year. You can keep up to date with all the latest news on this blog (don’t forget to subscribe!)."
        }
    ]
}