{
    "url": "https://healthmedia.blog.gov.uk/2024/02/01/pharmacy-first-what-you-need-to-know/",
    "title": "Pharmacy First: what you need to know",
    "authors": [
        "DHSC Media Team"
    ],
    "categories": [
        "Pharmacy"
    ],
    "pub_date": "2024-02-01T11:40:45+00:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "Patients can now get treatment for seven common conditions directly from their local pharmacy, without the need for a GP appointment or prescription."
        },
        {
            "text": "The Pharmacy First scheme was launched by the government and NHS England on 31 January 2024 to give patients quick and accessible care and ease pressure on GP services."
        },
        {
            "text": "But what does it cover and who will benefit? Here's everything you need to know."
        },
        {
            "heading": 2,
            "text": "What is Pharmacy First? "
        },
        {
            "text": " Pharmacy First will enable community pharmacists to supply prescription-only medicines, including antibiotics and antivirals where clinically appropriate, to treat seven common health conditions without the need to visit a GP."
        },
        {
            "heading": 2,
            "text": "What are the seven common conditions?"
        },
        {
            "heading": 2,
            "text": "How can I access treatment from my pharmacy?"
        },
        {
            "text": "You can get treatment for these conditions by walking into the pharmacy or contacting them virtually. GP receptionists, NHS 111 and providers of emergency care will also be able to direct patients to pharmacies, that offer the service, if contacted."
        },
        {
            "heading": 2,
            "text": "What will happen when I arrive at the pharmacy?"
        },
        {
            "text": "The pharmacist will be able to speak to you privately in a separate consultation room. They may perform an examination or ask to access your medical records. The pharmacist will be able to recommend the best course of action on an individual patient basis, including by issuing prescriptions for antibiotics or antivirals where necessary."
        },
        {
            "heading": 2,
            "text": "How will this reduce NHS waiting times? "
        },
        {
            "text": "By reducing the number of patients with common conditions, needing blood pressure checks or oral contraception visiting a GP, Pharmacy First aims to free up 10 million GP appointments a year by next winter for more complex diagnosis"
        },
        {
            "text": "This will give GPs time and space to see patients with more complex conditions."
        },
        {
            "text": "Four in five people in England can reach a community pharmacy within a 20-minute walk and there are twice as many pharmacies in the most deprived communities, making access to care quicker and more convenient."
        },
        {
            "heading": 2,
            "text": "How do I know if my local pharmacy is offering the service? "
        },
        {
            "text": "More than 10,000 pharmacies have already signed up to Pharmacy First – that’s over 95 per cent of all those in England."
        },
        {
            "heading": 2,
            "text": "Will I have to pay for my medication? "
        },
        {
            "text": "Usual prescription charges will apply for the seven common conditions. Patients that were already exempt from prescription charges will still be exempt."
        },
        {
            "heading": 2,
            "text": "What if I still want to see my GP? "
        },
        {
            "text": "Patients can still choose to visit a GP if they wish to. Pharmacy First offers alternative access for these seven conditions and we encourage people to make the most of this service and to consult the highly trained professions in their local pharmacy."
        },
        {
            "text": "We are working to expand GP access, and have now delivered on our manifesto commitment for 50 million more general practice appointments per year. We are also growing the primary care workforce and we hit our target for 26,000 additional staff in primary care by March 2024 more than a year early."
        },
        {
            "heading": 2,
            "text": "Will pharmacies be able to cope with the increased demand? "
        },
        {
            "text": "The government has invested £645 million over two years to help community pharmacies, including providing improved IT and a wide range of guidance and support."
        },
        {
            "text": "More broadly, we support the sector with £2.6 billion every year."
        },
        {
            "heading": 2,
            "text": "How else are you expanding pharmaceutical services?"
        },
        {
            "text": "From December 2023, thousands of women have been able to get their contraceptive pill from their local pharmacy, with up to 25% of all women on oral contraception being able to benefit from this new service."
        },
        {
            "text": "Pharmacists are also increasing the number of life-saving blood pressure checks given to at-risk patients over the next year, with a commitment to deliver 2.5 million a year by spring 2025 - up from 900,000 carried out last year.  It is estimated this could prevent more than 1,350 heart attacks and strokes in the first year."
        },
        {
            "heading": 2,
            "text": "Where does Pharmacy First apply? "
        },
        {
            "text": "This new service is run by NHS England and therefore will be available across England."
        },
        {
            "heading": 2,
            "text": "Will Pharmacy First have an impact on anti-microbial resistance?"
        },
        {
            "text": "Anti-microbial resistance occurs when the body’s microbes no longer respond to medicines due to over-usage, making infections harder to treat."
        },
        {
            "text": "This scheme is not expected to result in larger volumes of antibiotics being prescribed, and patients will still undergo a consultation with a pharmacist before any medicine is dispensed."
        },
        {
            "text": "Medicine supply must be clinically appropriate and only after a shared discussion between the patient and pharmacist on the risks and benefits of taking the medicine, and of any alternative self-care options."
        }
    ]
}