{
    "url": "https://homeofficemedia.blog.gov.uk/2024/02/01/reducing-net-migration-factsheet-december-2023/",
    "title": "Reducing Net Migration Factsheet – February 2024",
    "authors": [
        "Home Office news team"
    ],
    "categories": [
        "Fact sheet"
    ],
    "pub_date": "2024-02-01T11:40:08+00:00",
    "content": [
        {
            "text": "The UK has experienced unprecedented levels of immigration since the pandemic. The latest official estimates show that net migration in the year to June 2023 was 672,000 - up significantly on pre-pandemic volumes but lower than the 745,000 who came in the year to December 2022.   "
        },
        {
            "text": "This is partly because of our generosity towards people fleeing conflict and persecution in Ukraine, Hong Kong, and Afghanistan; over 80,000 people have immigrated to the UK on as our Ukraine, BN(O) and resettlement schemes in the last year. But it is also because of rising numbers of overseas students and care workers.  "
        },
        {
            "text": "The government has already taken action to address the rise in legal migration with measures to tackle the substantial rise in the number of students bringing dependants to the UK, which came into force in January 2024."
        },
        {
            "text": "On Monday 4th December 2023, the Prime Minister and Home Secretary announced a plan to slash migration levels and curb abuse of the immigration system. Together, this will mean 300,000 people who came to the UK last year would now not be able to come."
        },
        {
            "text": "The Minister for Legal Migration and the Border wrote a ‘Dear colleagues’ letter to all MPs on Thursday 21st December 2023 setting out further information on the implementation of these measures. On Tuesday 30 January, further detail was provided on when the government's package to reduce migration will come into force."
        },
        {
            "text": "Key measures that the Government is taking to cut net migration are:"
        },
        {
            "text": "More information can be found here: https://www.gov.uk/government/news/home-secretary-underlines-commitment-to-cut-net-migration"
        },
        {
            "text": "How have you calculated the impact of these measures? "
        },
        {
            "text": "When will the changes be made? "
        },
        {
            "text": " "
        },
        {
            "text": "Health and care visa route "
        },
        {
            "text": "The reforms will ensure that:"
        },
        {
            "text": "Isn’t this going to lead to shortages of care workers?"
        },
        {
            "text": "What are you doing to grow the social care workforce – aren’t there 150,000 vacancies? "
        },
        {
            "text": "Will the NHS be impacted by these changes? "
        },
        {
            "text": "How are you going to recruit health and social care workers if you raise the earning threshold on the Skilled Worker route? "
        },
        {
            "text": "Surely some dependants work – so by banning them you are reducing the amount of working people coming to the UK?    "
        },
        {
            "text": "What happens to care workers and providers who are already here? "
        },
        {
            "text": "Until the point the new Immigration Rules come into effect on 11 March: "
        },
        {
            "text": " "
        },
        {
            "text": "Increasing the Skilled worker Route earnings threshold"
        },
        {
            "text": "Changing the salary threshold will affect hospitality, accommodation, and food services – why are you doing this now? "
        },
        {
            "text": "What will happen when people come to renew their visas?  "
        },
        {
            "text": "The uplift of the skilled worker salary threshold from £26,200 to £38,700 is significant – won’t that affect a large number of occupations? "
        },
        {
            "text": "Why have you not raised the salary threshold to £40,000 or higher?   "
        },
        {
            "text": " "
        },
        {
            "text": "Reforming the Shortage Occupation List (SOL)"
        },
        {
            "text": "Why are you not completely abolishing the Shortage Occupation List?  "
        },
        {
            "text": " What is the government doing to ensure that the labour market prioritises UK residents when filling vacancies?     "
        },
        {
            "text": " "
        },
        {
            "text": "Raising the Family Visa Minimum Income to the same threshold as the skilled worker route"
        },
        {
            "text": "Why has the Minimum Income Requirement been increased by so much in one jump?"
        },
        {
            "text": "Won’t this mean splitting up families?"
        },
        {
            "text": "Can the Minimum Income Requirement still be met in various ways?"
        },
        {
            "text": " What will happen when people come to renew their visas?"
        },
        {
            "text": " "
        },
        {
            "text": "Graduate route review"
        },
        {
            "text": "Why aren’t you abolishing the graduate route?"
        },
        {
            "text": "When will the MAC begin its review of the graduate route? "
        }
    ]
}