{
    "url": "https://services.blog.gov.uk/2024/02/01/showcase-your-work-at-services-week-2024/",
    "title": "Showcase your work at Services Week 2024",
    "authors": [
        "Ella Boyer - Senior Communications and Events Manager, CDDO",
        "Marc O’Connor - Lead Service Designer, HMRC",
        "Andy Jones - Head of Profession for Design, DFE",
        "Kara Kane – Head of Profession for Design, GDS",
        "Angie Dickinson, Senior Communications Manager, CDDO",
        "Lisa Jeffery – Design Manager, Defra"
    ],
    "categories": [
        "Events",
        "Service transformation"
    ],
    "pub_date": "2024-02-01T11:09:40+00:00",
    "content": [
        {
            "text": "Are you involved in a digital public service? From the policy idea, design or development to data behind the scenes or the day-to-day running, we want to hear from you! Join us at Services Week 2024 this March. "
        },
        {
            "heading": 2,
            "text": "What is Services Week?"
        },
        {
            "text": "Services Week is an annual event series run by the Government Digital and Data community for people working in the UK public sector. Returning for the sixth year, Services Week 2024 will take place 18 to 22 March and will focus discussion on public services from a digital and service design perspective, but participants are welcome from all backgrounds.  "
        },
        {
            "text": "Sessions are designed by the community, for the community and we are looking for you to get involved. Last year, the series featured almost 50 sessions including a Ministry of Justice talk on multidisciplinary teams, local sessions run by Birmingham City Council, and lightning talks run by colleagues working in health. If you are a public or civil servant, check the open agenda as it develops to contribute a session to the agenda or see what’s coming up. People from different organisations contribute sessions, so the agenda develops right up until the start of the week.   "
        },
        {
            "heading": 2,
            "text": "Why take part in Services Week 2024?"
        },
        {
            "text": "Services Week is about how we can work together to help improve public services. As a community we co-create value from sharing and learning. Hosting a session means you have the chance to increase the visibility of your work across the public sector, whilst participants will get a valuable insight into the work going on to improve services across government, and beyond. "
        },
        {
            "text": "Services Week is an opportunity for you to hear from professions across sectors who are focused on improving the lives of citizens. By attending sessions you’ll get direct insights into a wide range of different services across the public sector, from innovative design and development, to effective delivery. In an exciting addition for this year you will also get to hear from private sector trailblazers in the digital and data sector. During Services Week 2023, we had 46 sessions run by 20 different organisations. These sessions helped people across roles, professions and organisations to grow skills and knowledge about the design of great services. "
        },
        {
            "text": "If you are curious to know more, blog posts from previous years have lots of quotes from people who have benefitted from Services Week. "
        },
        {
            "text": "Here are some of the things we have heard:"
        },
        {
            "text": "“Services Week makes work visible across the public sector, helps join us all up, and enables sharing, learning and new connections that can have a positive impact beyond the week.” "
        },
        {
            "text": "“I learn so much from the experience of those who’ve gone before me. It helps me improve the work I do in my organisation.”"
        },
        {
            "heading": 2,
            "text": "On the agenda for Services Week 2024  "
        },
        {
            "text": "Taking part in Services Week 2024 can mean hosting or co-hosting sessions, attending sessions, or simply sharing details about sessions between people and organisations. It is also possible to publish blog posts to showcase your work during the week, so please do get in touch if you want to publish a post you have written that relates to Services Week. There are some great sessions in development for 2024, including:"
        },
        {
            "heading": 2,
            "text": "Running a session"
        },
        {
            "text": "Sessions can be run as online, hybrid or in-person events. Choices around session formats are yours. Tools, timings and attendance of sessions will differ depending on the outcomes you seek. You can run something live between 18 and 22 March 2024 or pre-record a session such as a webinar or podcast to release during the week itself. Session formats change every year but often include: "
        },
        {
            "text": "Always consider inclusivity, security and how people will sign up for your sessions. It might help to contact your own events team for advice on what best suits your organisation. GOV.UK has guidance on accessible communication formats. Adding your session to the Services Week 2024 playlist is another way to increase access.  "
        },
        {
            "text": "If you want to host a session please add your session to the open agenda. As the agenda gets finalised, we will publish a version on the CDDO blog."
        },
        {
            "text": "To help promote Services Week 2024, use these slides and posters for promotion. "
        },
        {
            "text": "Join the #ServicesWeek channel on the cross-government Slack to find out more. You can also email us to ask us questions or get us to add your event to the open agenda. "
        },
        {
            "text": "Services Week is what we all make it. Thanks for taking part! "
        }
    ]
}