{
    "url": "https://competitionandmarkets.blog.gov.uk/2024/02/01/the-subsidy-advice-unit-our-first-year-and-next-steps/",
    "title": "The Subsidy Advice Unit – our first year and next steps",
    "authors": [
        "Rachel Merelie"
    ],
    "categories": [
        "Subsidy Advice Unit"
    ],
    "pub_date": "2024-02-01T11:06:20+00:00",
    "content": [
        {
            "text": "The Subsidy Advice Unit (SAU), part of the Competition and Markets Authority (CMA), has now been operating for just over a year as part of the UK’s domestic subsidy control regime."
        },
        {
            "text": "The SAU has two key functions – evaluating assessments of compliance from public authorities for the most potentially distortive subsidies to tight timescales, and carrying out a much wider monitoring function for the subsidy control regime overall. Much of our focus this year has been on this former function, and we are now consulting on the operation of our monitoring role."
        },
        {
            "heading": 2,
            "text": "Our first year"
        },
        {
            "text": "It’s been a busy first year for the Subsidy Advice Unit – since we launched on 4 January 2023, we’ve accepted 33 referrals of subsidies and schemes meeting the criteria set out in regulations, and published 28 reports."
        },
        {
            "text": "These reports evaluate and provide non-binding advice on a public authority’s assessment of compliance against the subsidy control requirements set out in legislation."
        },
        {
            "text": "We’ve produced these reports for a wide range of public authorities across all 4 UK nations including government departments, arms-length bodies, combined authorities and local authorities."
        },
        {
            "text": "You can read our reports published to date here."
        },
        {
            "heading": 2,
            "text": "Working with public authorities"
        },
        {
            "text": "We’ve found it mutually beneficial to have an early informal discussion with public authorities on potential referrals even if the subsidy is not yet certain – we can explain more about the process and timings and advise on next steps for taking the referral forward."
        },
        {
            "text": "Anyone with a potential referral for the team should reach out to us via SAU@cma.gov.uk."
        },
        {
            "text": "We also recommend that public authorities take part in pre-referral discussions with the SAU once they’ve produced an advanced draft of their assessment of compliance – ideally, this draft should be shared a few weeks before referral."
        },
        {
            "heading": 2,
            "text": "Reflections on our first reports"
        },
        {
            "text": "No two SAU reports are the same, but we’ve seen some consistent themes in the feedback we’ve given across referrals received so far."
        },
        {
            "text": "Public authorities should have regard to the DBT Statutory Guidance when producing an assessment of compliance, and we recommend consulting with this closely in the first instance."
        },
        {
            "text": "While not an exhaustive list, we’d note the following areas that some public authorities find challenging:"
        },
        {
            "heading": 2,
            "text": "Looking forward"
        },
        {
            "text": "With our work on referrals now well-established, we’re continuing to develop our second key role, in relation to monitoring. This involves periodic monitoring and reporting on the effectiveness of the operation of the subsidy control regime and its impact on competition and investment in the UK – a key means to ensure an independent, evidence-based assessment of how the regime has delivered its objectives."
        },
        {
            "text": "Our first monitoring report is due in 2026. While this is still some way off, we are keen to engage with stakeholders now how we propose to carry out this work."
        },
        {
            "text": "We have therefore today published a consultation with our proposals. We propose looking at whether the Act works as intended and whether the practical arrangements are working as needed, alongside short and long term indicators of competition."
        },
        {
            "text": "We propose relying on a range of evidence, including the Subsidy Database, surveys, our own research and case studies."
        },
        {
            "text": "We are very keen to hear views from all interested stakeholders, in particular public authorities, businesses and representative organisations, legal and economic advisers and academics on:"
        },
        {
            "text": "You can add your feedback on our SAU proposed approach to monitoring under the Subsidy Control Act 2022 consultation page which will close on 28 March 2024."
        }
    ]
}