{
    "url": "https://insidehmcts.blog.gov.uk/2024/02/01/unveiling-justice-showcasing-our-courts-at-public-open-days/",
    "title": "Unveiling justice: Showcasing our courts at public open days",
    "authors": [
        "HMCTS Communications"
    ],
    "categories": [
        "General",
        "Podcast"
    ],
    "pub_date": "2024-02-01T10:30:14+00:00",
    "content": [
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "text": "In the third episode of the Inside HMCTS podcast, we discuss the benefits to those members of the public able to join us at an open day in their local court or tribunal."
        },
        {
            "text": "Open days offer great opportunities to give local communities the chance to take a look behind the scenes of justice being delivered in their local area. They demonstrate openness and transparency around the vital public service that we deliver at HMCTS, in an engaging and informative way."
        },
        {
            "text": "We spoke with Jordana Allen-Rowlandson, a Crown Court Clerk and Molly Seymour, the Delivery Manager at Crime Lincolnshire who organised open days last year at Winchester and Lincoln Crown Courts."
        },
        {
            "text": "We also hear from some visitors to an open day at the Royal Courts of Justice in London in September last year, about their experiences."
        },
        {
            "text": "Join us as we take a look behind the scenes and reflect on some of the unexpected opportunities a visit to an open day provided for some of our visitors last year."
        },
        {
            "text": "Listen to the latest episode now, available wherever you get your podcasts from!"
        },
        {
            "text": "Amazon"
        },
        {
            "text": "Apple"
        },
        {
            "text": "Buzzsprout"
        },
        {
            "text": "Spotify"
        },
        {
            "text": " "
        },
        {
            "text": "A transcript of the podcast is also available here."
        },
        {
            "text": " "
        },
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "heading": 1,
            "text": "Dadorchuddio cyfiawnder: Arddangos ein llysoedd mewn diwrnodau agored cyhoeddus"
        },
        {
            "text": "Yn nhrydedd bennod podlediad ‘Inside HMCTS’, rydym yn trafod y manteision i’r aelodau hynny o’r cyhoedd sy’n gallu ymuno â ni mewn diwrnod agored yn eu llys neu dribiwnlys lleol."
        },
        {
            "text": "Mae diwrnodau agored yn cynnig cyfleoedd gwych i roi cyfle i gymunedau lleol gael cipolwg y tu ôl i'r llenni o’r cyfiawnder sy'n cael ei gyflawni yn eu hardal leol. Maent yn arddangos didwylledd a thryloywder o amgylch y gwasanaeth cyhoeddus hanfodol yr ydym yn ei ddarparu yn GLlTEF, mewn ffordd ddifyr ac addysgiadol."
        },
        {
            "text": "Buom yn siarad â Jordana Allen-Rowlandson, Clerc Llys y Goron a Molly Seymour, Rheolwr Cyflawni Crime Lincolnshire a drefnodd ddiwrnodau agored y llynedd yn Llys y Goron Caer-wynt a Lincoln."
        },
        {
            "text": "Byddwn hefyd yn clywed gan rai ymwelwyr â diwrnod agored yn y Llysoedd Barn Brenhinol yn Llundain ym mis Medi y llynedd am eu profiadau."
        },
        {
            "text": "Ymunwch â ni wrth i ni edrych y tu ôl i'r llenni a myfyrio ar rai o'r cyfleoedd annisgwyl a roddodd ymweliad â diwrnod agored i rai o'n hymwelwyr y llynedd."
        },
        {
            "text": "Gwrandewch ar y bennod ddiweddaraf nawr, ar gael o ble bynnag rydych chi'n gwrando ar eich podlediadau!"
        },
        {
            "text": "Amazon"
        },
        {
            "text": "Apple"
        },
        {
            "text": "Buzzsprout"
        },
        {
            "text": "Spotify"
        },
        {
            "text": " "
        },
        {
            "text": "Mae trawsgrifiad o'r podlediad ar gael yma hefyd."
        }
    ]
}