{
    "url": "https://insidehmcts.blog.gov.uk/2020/07/01/coronavirus-recovering-in-our-courts-and-tribunals/",
    "title": "Coronavirus: recovering in our courts and tribunals",
    "authors": [
        "Susan Acland-Hood"
    ],
    "categories": [
        "Civil",
        "Court and tribunal reform",
        "Crime",
        "Family",
        "Tribunals"
    ],
    "pub_date": "2020-07-01T14:30:33+01:00",
    "content": [
        {
            "text": "\n[English] - [Cymraeg]"
        },
        {
            "text": "After an unprecedented period that tested the essential working of our justice system, we are now firmly focused on recovering our operations from the effects of the pandemic."
        },
        {
            "text": "It has been a monumental effort by all working in our courts and tribunals to maintain a functioning justice system throughout the last three months. But we do not underestimate the challenges that are still to come both to get our courts and tribunals back to working at pre-crisis activity levels – and to deal with the outstanding cases that have built up."
        },
        {
            "text": "To do so will require all of us involved to show the same determination, flexibility and creativity that have characterised our immediate response to the crisis, and to work together with a shared interest in the justice system’s essential place as a key pillar of our democratic way of life."
        },
        {
            "heading": 3,
            "text": "Our response"
        },
        {
            "text": "The last two months have brought about widespread, fast-paced and complex change at a scale we’ve never seen before. Audio and video technology, which has long played a part in running our courts and tribunals, has provided particular support during the coronavirus outbreak. We’ve increased the capacity of our existing systems, and introduced new capabilities, while alongside this, reorganising the use of our estate, temporarily closing around half of our sites. By having fewer physical hearings in fewer courts, our cleaning and security staff were able to focus their efforts more effectively in supporting enhanced cleanliness and hygiene measures. At the same time, court users have been able to observe strict social distancing rules in all our open buildings."
        },
        {
            "text": "These measures allowed us to prioritise the most urgent cases to keep people safe, protect the vulnerable, safeguard children and ensure that other critical decisions that affect the lives of so many could be made."
        },
        {
            "heading": 3,
            "text": "Our recovery"
        },
        {
            "text": "We’re now undertaking activity to rapidly recover, and this has been demonstrated over the past few weeks by the reopening of many of our buildings, following individual and rigorous assessment to make sure that they adhere to public health guidance."
        },
        {
            "text": "There are now 287 of our buildings open for essential in-person hearings, representing 84% of the 341 crown, magistrates, county and family courts and tribunals across the country. We’ll continue to open our sites as they are assessed as being safe to do so, and plan to open all remaining sites throughout July, alongside installing physical modifications where necessary to maintain a safe environment in our open buildings."
        },
        {
            "text": "But as has been said by others, the whole country now needs to prepare for an extended period of living with and managing the threat from the virus, so our wider operational plans will allow us respond to an evolving situation, focusing on two key areas: delivering justice in new ways, and increasing capacity so we can do more."
        },
        {
            "text": "The tactical solutions underpinning these principles must be flexible so that we can always respond to the latest public health advice. While social distancing remains in place, the operational plan is very much shaped by that requirement and is iterative in nature."
        },
        {
            "heading": 3,
            "text": "Building capacity to deliver justice in new ways"
        },
        {
            "text": "Work has begun to identify suitable venues to outside of our own estate to boost capacity. These satellite venues would use public spaces, such as civic centres or university moot courts, to allow traditional court buildings to manage more work while maintaining social distancing – whether that be by hosting full hearings or allowing victims and witnesses to attend remotely. A working group has been established to develop these plans, made up of HMCTS officials, the judiciary, legal professional bodies, representatives of victims’ groups and other court users."
        },
        {
            "text": "Additionally, early work is underway with justice partners to understand how else we might best design other arrangements to maximise our capacity, like exploring options for staggering and extending sitting hours where this can be done."
        },
        {
            "text": "Our online services, mostly established under our reform programme, have been sustained throughout the recent period and we’ll continue to accelerate and expand their effective use across all jurisdictions to maximise their impact. This will include new hardware to improve the quality of video hearings and over the summer, we’ll be completing the rollout of Cloud Video Platform (CVP) into all Crown and Magistrates’ courts, as well as civil and family jurisdictions. The introduction of the HMCTS video hearings service, part of our reform programme, into tax and property tribunal chambers, will extend our capacity in this area."
        },
        {
            "text": "In May, following the work of a judge-led working group and an announcement by the Lord Chief Justice, we restarted jury trials in a number of particular buildings, and did so as one of the first among other comparable jurisdictions globally. Like all of our reopened buildings, these sites, which included the Old Bailey and Cardiff Crown Court, were carefully selected following assessment that it was safe to do so, involving Public Health England and Public Health Wales."
        },
        {
            "text": "More are following as we’re able to be satisfied that it is safe and practical to introduce more sites, and all jury trials will take place under special arrangements to maintain the safety of all participants. These include social distancing in court rooms, managing the way that people move around the building, and limiting the number of items that might otherwise be touched by multiple people."
        },
        {
            "heading": 3,
            "text": "Next steps"
        },
        {
            "text": "The steps I’ve outlined represent some of the key cornerstones of our continued recovery, but we’re deliberately designing it in such a way as to provide us with a flexible framework to allow us to do as much work as possible despite the constraints we continue to work within. As we move forward, we’ll keep learning from the experiences of recent months and adjust our plans for HMCTS in the future accordingly, to build an improved resilience against any future impacts."
        },
        {
            "text": "This recovery work, and ongoing evaluation of what has worked and what has not, will ultimately help to inform a refreshed operating model in a way that keeps us in tune with the shifting global landscape, and keep us true to the values of reform."
        },
        {
            "text": "Getting it right will mean a system that not only emerges intact from this crisis, but is fundamentally more efficient, more dynamic and more resilient – a smarter system for a different future."
        },
        {
            "text": "HMCTS recently published an overview of our response to COVID-19. We will publish more information on jurisdictional plans over the coming weeks. "
        },
        {
            "text": "\n[English] - [Cymraeg]"
        },
        {
            "heading": 1,
            "text": "Coronafeirws: adfer gweithrediadau’r llysoedd a’r tribiwnlysoedd"
        },
        {
            "text": "Yn dilyn cyfnod digynsail a brofodd ein system gyfiawnder i’r eithaf, rydym nawr yn canolbwyntio ar adfer ein gweithrediadau yn dilyn effeithiau’r pandemig."
        },
        {
            "text": "Mae pawb sydd yn gweithio yn ein llysoedd a’n tribiwnlysoedd wedi ymdrechu’n daer i gynnal system gyfiawnder gweithredol yn ystod y tri mis diwethaf. Ond nid ydym yn tanbrisio’r heriau sy’n ein hwynebu o hyd i gael y llysoedd a’r tribiwnlysoedd i weithredu fel yr oeddynt cyn yr argyfwng ac i ddelio â’r achosion sydd wedi cronni yn y system."
        },
        {
            "text": "Er mwyn gwneud hynny, bydd yn ofynnol i bob un ohonom ddangos yr un penderfyniad, hyblygrwydd a chreadigrwydd a ddangoswyd yn ein hymateb di-oed i'r argyfwng, a chydweithio i sicrhau lle y system gyfiawnder fel piler allweddol yn ein gwlad ddemocrataidd."
        },
        {
            "heading": 3,
            "text": "Ein hymateb"
        },
        {
            "text": "Mae'r ddau fis diwethaf wedi golygu ein bod wedi gorfod gwneud newidiadau sylweddol a chymhleth yn gyflym ac ar raddfa na welsom erioed o'r blaen. Mae technoleg sain a thechnoleg fideo, sydd ers amser wedi bod yn rhan o weithrediadau’r llysoedd a’r tribiwnlysoedd, wedi bod yn hynod o ddefnyddiol yn ystod yr argyfwng coronafeirws. Rydym wedi cynyddu capasiti ein systemau ac wedi cyflwyno opsiynau newydd, ar yr un pryd â aildrefnu’r ystad a chau tua hanner ein hadeiladau dros dro. Trwy gael llai o wrandawiadau wyneb yn wyneb mewn llai o lysoedd, roedd ein staff glanhau a’n staff diogelwch yn gallu rhoi mwy o sylw i sicrhau effeithiolrwydd y mesurau glanhau a hylendid. Ar yr un pryd, mae defnyddwyr y llysoedd wedi gallu cadw at y rheolau cadw pellter cymdeithasol llym ymhob un o’n hadeiladau sydd wedi bod ar agor."
        },
        {
            "text": "Mi wnaeth y mesurau hyn ein galluogi i flaenoriaethu’r achosion mwyaf brys i gadw pobl yn ddiogel, amddiffyn pobl fregus, diogelu plant a sicrhau bod modd gwneud penderfyniadau pwysig eraill sy’n effeithio ar fywydau gymaint o bobl."
        },
        {
            "heading": 3,
            "text": "Ein hadferiad"
        },
        {
            "text": "Rydym nawr yn cymryd camau i adfer ein gweithrediadau, a gwelwyd prawf o hyn dros yr wythnosau diwethaf gan ein bod wedi ail-agor nifer o’n hadeiladau, ar ôl inni gynnal asesiadau unigol a thrylwyr ohonynt i wneud yn siŵr eu bod yn cydymffurfio â gofynion iechyd cyhoeddus."
        },
        {
            "text": "Erbyn hyn mae 287 o’n hadeiladau ar agor ar gyfer gwrandawiadau wyneb yn wyneb hanfodol, sy’n golygu bod 84% o’r 341 o lysoedd y goron, llysoedd ynadon, llysoedd sirol a theulu a thribiwnlysoedd ar agor ar draws y wlad. Byddwn yn parhau i ail-agor rhagor o adeiladau wrth iddynt gael eu hasesu, ac rydym yn anelu at ail-agor gweddill yr ystad yn ystod mis Gorffennaf, yn ogystal â gwneud addasiadau iddynt yn ôl yr angen i sicrhau bod pob adeilad sydd ar agor yn amgylchedd diogel."
        },
        {
            "text": "Ond fel y mae eraill wedi dweud, mae angen i’r wlad gyfan nawr baratoi ar gyfer cyfnod estynedig o fyw gyda’r feirws a rheoli’r bygythiad ohono, felly bydd ein cynlluniau gweithredol ehangach yn ein galluogi ni i ymateb i sefyllfa sy’n newid o hyd, a chanolbwyntio ar ddau beth: sicrhau cyfiawnder gan ddefnyddio dulliau newydd a chynyddu capasiti fel y gallwn wneud mwy."
        },
        {
            "text": "Mae’n rhaid i’r datrysiadau tactegol sy’n tanategu’r egwyddorion hyn fod yn hyblyg fel y gallwn wastad ymateb i’r cyngor diweddaraf a gawn gan iechyd cyhoeddus. Tra bydd rheolau cadw pellter cymdeithasol mewn lle, mae’r cynllun gweithredol wedi cael ei siapio i gydymffurfio â’r gofyniad hwnnw ac mae’n ailadroddol o ran ei natur."
        },
        {
            "heading": 3,
            "text": "Cynyddu capasiti i sicrhau cyfiawnder gan ddefnyddio dulliau newydd"
        },
        {
            "text": "Rydym wedi dechrau adnabod lleoliadau addas tu allan i’n hystad i gynyddu ein capasiti. Bydd y safleoedd ategol hyn yn llefydd cyhoeddus, megis canolfannau dinesig neu ffug lysoedd barn prifysgolion, a byddant yn galluogi adeiladau llys traddodiadol i wrando mwy o achosion a chadw at y rheolau cadw pellter cymdeithasol - boed hynny yn cynnal gwrandawiadau llawn neu’n caniatáu i ddioddefwyr a thystion fynychu o bell gan ddefnyddio technoleg. Mae gweithgor wedi’i sefydlu i ddatblygu’r cynlluniau hyn. Mae aelodaeth y gweithgor yn cynnwys gweithwyr GLlTEM, y farnwriaeth, cyrff proffesiynol ym maes y gyfraith, cynrychiolwyr grwpiau i ddioddefwyr a defnyddwyr eraill y llys."
        },
        {
            "text": "Hefyd, rydym wedi dechrau cydweithio gyda’n partneriaid yn y maes cyfiawnder i adnabod sut y gallwn ail-gynllunio rhai o’n trefniadau eraill i wneud y mwyaf o’n capasiti, er enghraifft edrych ar yr opsiynau i addasu ac ymestyn yr oriau eistedd lle bo hynny’n addas."
        },
        {
            "text": "Rydym wedi gallu cynnal ein gwasanaethau ar-lein, gwasanaethau a gafodd eu sefydlu yn bennaf fel rhan o’n rhaglen ddiwygio, drwy gydol y cyfnod hwn a byddwn yn parhau i gynyddu ac ymestyn y defnydd effeithiol a wneir ohonynt ar draws pob awdurdodaeth i fwyhau eu heffaith. Bydd hyn yn cynnwys gosod caledwedd newydd i wella ansawdd gwrandawiadau fideo, a dros yr haf byddwn yn cwblhau cyflwyno’r Platfform Fideo Cwmwl (CVP) ymhob llys y goron a llys ynadon, ac yn yr awdurdodaethau sifil a theulu. Bydd cyflwyno gwasanaeth gwrandawiadau fideo GLlTEM, sy’n rhan o’n rhaglen ddiwygio, yn y siambrau tribiwnlys treth ac eiddo yn ymestyn ein capasiti yn y maes hwn."
        },
        {
            "text": "Ym mis Mai, yn dilyn gwaith a wnaed gan weithgor a oedd yn cael ei arwain gan farnwr a chyhoeddiad gan yr Arglwydd Brif Ustus, mi wnaethom ail-ddechrau gwrando treialon gyda rheithgor mewn adeiladau penodol, ac roeddem ymysg y cyntaf i wneud hynny yn fyd-eang. Fel pob adeilad sydd wedi cael ei ail-agor, cafodd y lleoliadau hyn, a oedd yn cynnwys yr Old Bailey a Llys y Goron Caerdydd, eu dewis yn ofalus yn dilyn cynnal asesiad o’r adeilad i sicrhau ei fod yn ddiogel inni wneud hynny, a chawsom gefnogaeth Iechyd Cyhoeddus Cymru a Public Health England."
        },
        {
            "text": "Bydd mwy o adeiladau yn ail-agor ar gyfer hyn pan fyddwn yn gallu bodloni ein hunain eu bod yn ddiogel a’i bod yn ymarferol i ni wneud hynny, a bydd pob treial gyda rheithgor yn cael ei gynnal gan ddilyn trefniadau arbennig i sicrhau diogelwch yr holl gyfranogwyr. Mae’r mesurau hyn yn cynnwys cadw pellter cymdeithasol yn yr ystafelloedd llys, rheoli’r ffordd y mae pobl yn symud o gwmpas yr adeilad, a chyfyngu ar nifer yr eitemau a fyddai fel arall yn cael eu cyffwrdd gan sawl unigolyn."
        },
        {
            "heading": 3,
            "text": "Y camau nesaf"
        },
        {
            "text": "Mae’r camau yr wyf wedi’u hamlinellu yn cynnwys rhai o’r prif bethau yr ydym yn ceisio eu gwneud yn ein hymgais i adfer gweithrediadau, ond rydym yn fwriadol yn cynllunio’r camau mewn ffordd sy’n rhoi hyblygrwydd inni er mwyn inni allu gwneud gymaint â phosib er gwaetha’r cyfyngiadau yr ydym yn parhau i orfod cydymffurfio â nhw. Wrth i ni symud ymlaen, byddwn yn parhau i ddysgu o’r profiadau yr ydym wedi’u cael dros yr ychydig fisoedd diwethaf ac yn addasu ein cynlluniau ar gyfer GLlTEM yn y dyfodol yn unol â hynny, i adeiladu hydwythdedd gwell yn erbyn unrhyw effeithiau eraill yn y dyfodol."
        },
        {
            "text": "Bydd y gwaith adfer hwn, a’r gwerthusiad parhaus a wneir o beth sydd wedi gweithio a beth sydd heb weithio, yn y pendraw yn helpu i lunio model gweithredu newydd ar gyfer GLlTEM mewn ffordd sy’n sicrhau ein bod yn ymateb i’r amgylchiadau byd-eang sy’n newid o hyd, ac yn cadw wrth werthoedd y rhaglen ddiwygio."
        },
        {
            "text": "Os cawn hyn yn iawn bydd gennym system fydd nid yn unig yn dod drwy’r argyfwng hwn yn gyflawn, ond system fydd yn fwy effeithiol, yn fwy deinamig ac yn fwy hydwyth – system fwy soffistigedig ar gyfer dyfodol gwahanol."
        },
        {
            "text": "Yn ddiweddar mi wnaeth GLlTEM gyhoeddi ’trosolwg o’n hymateb i COVID-19. Byddwn yn cyhoeddi rhagor o wybodaeth am ein cynlluniau ar gyfer awdurdodaethau gwahanol yn ystod yr wythnosau nesaf."
        }
    ]
}