{
    "url": "https://enablingdigitalidentity.blog.gov.uk/2025/06/20/uk-digital-identity-legislation-passes-another-important-milestone/",
    "title": "UK digital identity legislation passes another important milestone",
    "authors": [
        "Devon Troup"
    ],
    "categories": [
        "Digital identity",
        "Legislation"
    ],
    "pub_date": "2025-06-20T10:52:32+01:00",
    "content": [
        {
            "text": "The Government is working to ensure that people and businesses can access trusted and secure digital identities for all their needs across the UK economy."
        },
        {
            "text": "On 19 June, the Data (Use and Access) Act received Royal Assent. As well as putting the National Underground Asset Register on a statutory footing and supporting the future of smart data schemes, this is a major milestone for the government’s work to make sure individuals and businesses across the UK have access to trusted digital identity services when they want to use them.  "
        },
        {
            "text": "Trustworthy digital identities can improve people’s lives by making transactions more simple and secure; from accessing age-restricted products, to renting a flat or starting a new job. You can already use a digital identity in some places because the framework of standards, governance and oversight for digital identities has been running as a pre-legislative pilot since April 2021. "
        },
        {
            "text": "Part 2 of the new Data (Use and Access) Act creates a legislative foundation for Digital Verification Services (DVS). Standards, governance and oversight of digital identity services in the UK is now grounded in law, ensuring they are trusted and secure. The new UK legislation formalises the system that is currently operating as a pilot. This will pave the way for trusted digital identities to be used in more places. "
        },
        {
            "heading": 2,
            "text": "What happens next?"
        },
        {
            "text": "When the King formally approves a Bill that has passed all stages in the UK Parliament and gives Royal Assent, it becomes law and an Act of Parliament."
        },
        {
            "text": "Now the clauses in the Act must be formally ‘commenced’ to come into legal force. This requires another bit of parliamentary procedure – some secondary legislation called a Commencement Order or regulation. "
        },
        {
            "text": "When the legislation is commenced, the government will have new powers and responsibilities, such as:"
        },
        {
            "text": "We plan to commence most of the measures relating to Digital Verification Services later this year. This will allow a smooth transition for providers onto the new statutory register, following certification against the trust framework."
        }
    ]
}