{
    "url": "https://defrafarming.blog.gov.uk/2024/08/28/a-summary-of-the-recent-updates-to-sfi/",
    "title": "A summary of the recent updates to SFI",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Sustainable Farming Incentive"
    ],
    "pub_date": "2024-08-28T11:08:31+01:00",
    "content": [
        {
            "text": "Today, we published a summary of recent changes to the actions and scheme information for the expanded Sustainable Farming Incentive (SFI) on GOV.UK."
        },
        {
            "text": "Most of the updates have been made in response to feedback from farmers, stakeholder organisations, and other experts."
        },
        {
            "text": "The scheme’s design allows for ongoing improvements and we're grateful to those who continue to help shape SFI. Whether feedback comes from a roundtable discussion, a conversation at an auction mart, or a blog post comment, feedback enables us to provide greater clarity, flexibility and support for farmers."
        },
        {
            "text": "However, we recognise that farmers need certainty about their obligations. We aim to balance the scheme’s evolution with clear version control, ensuring stability without constant change."
        },
        {
            "text": "This post summarises the main changes. You can view full details in:"
        },
        {
            "heading": 2,
            "text": "What’s changed in SFI actions"
        },
        {
            "text": "The following general changes apply to all SFI actions, where relevant:"
        },
        {
            "text": "We have also made specific technical changes to various SFI actions to ensure they are achievable and effective in meeting environmental goals. These include:"
        },
        {
            "text": "Examples of these changes are included in this post."
        },
        {
            "heading": 2,
            "text": "Voluntary advice"
        },
        {
            "text": "We’ve reduced prescription in SFI actions wherever possible, allowing farmers to decide how to complete them, provided they:"
        },
        {
            "text": "To support you, we’ve published voluntary advice for each action. This advice is not mandatory; it’s up to you whether to follow it."
        },
        {
            "text": "You can find it under each SFI action in the ‘Find funding for land or farms’ tool, linked above."
        },
        {
            "heading": 2,
            "text": "Increased flexibility for rotational actions"
        },
        {
            "text": "Previously, some SFI actions in the expanded offer required newly established areas to remain static for the action’s duration. In response to feedback, these actions can now be rotational or static, whether it’s an existing or newly established area."
        },
        {
            "text": "For example, CNUM3 (legume fallow) and CSAM3 (herbal leys) can now be rotated or static, providing more flexibility in food production, soil health, and wildlife support."
        },
        {
            "text": "This change acknowledges the diverse nature of farming across the country and aims to make SFI more accessible and practical for a broader range of farmers."
        },
        {
            "heading": 2,
            "text": "Changes to land type due to required activities"
        },
        {
            "text": "Some SFI actions may cause land type changes during the action’s duration. Where this is likely, we’ve clarified that the land must be eligible at the start of the action. For example, if scrub develops under BFS2 (buffer in-field ponds on arable land) and AHW12 (manage woodland edges on arable land)."
        },
        {
            "heading": 2,
            "text": "Eligibility of land with historic or archaeological features"
        },
        {
            "text": "If an SFI action is ineligible on land with historic or archaeological features, we’ve clarified that you can still apply for the action on areas within a land parcel that do not contain such features."
        },
        {
            "heading": 2,
            "text": "Clarification on storage"
        },
        {
            "text": "We’ve clarified that ‘storage’ in certain SFI actions refers to storing items like bales or machinery, for example, in CIGL3 (4m to 12m grass buffer strip on improved grassland)."
        },
        {
            "heading": 2,
            "text": "Soil management and cover crops"
        },
        {
            "text": "You can now:"
        },
        {
            "text": "There are also more SFI actions you can do on the same area of land as CSAM1 (assess soil, produce a soil management plan and test soil organic matter) such as AHW4, AHW12, CIGL3, GRH6, BFS6: 6m to 12m habitat strip next to watercourses, SCR1 (Create scrub and open habitat mosaics), and SCR2 (Manage scrub and open habitat mosaics), providing farmers with more tools to manage their soil health effectively. "
        },
        {
            "heading": 2,
            "text": "Precision farming"
        },
        {
            "text": "We’ve updated PRF1 (variable rate application of nutrients) to clarify that:"
        },
        {
            "heading": 2,
            "text": "Livestock grazing and shepherding on SSSI moorland"
        },
        {
            "text": "If you’re carrying out SFI actions on moorland that’s a SSSI, such as UPL2 (low livestock grazing on moorland) or UPL8 (shepherding livestock on moorland – remove stock for at least 4 months), there are additional requirements."
        },
        {
            "text": "We’ve added wording to clarify that you should refer to section 10.3 of the SFI scheme information for:"
        },
        {
            "heading": 2,
            "text": "Supplemental actions"
        },
        {
            "text": "The duration of supplemental actions has been updated to either 3 years or 5 years (as relevant), instead of ‘same as base action’. You can now apply for a supplemental action:"
        },
        {
            "text": "We’ve also added:"
        },
        {
            "heading": 2,
            "text": "Apply for SFI"
        },
        {
            "text": "There are now 102 actions available through SFI."
        },
        {
            "text": "All the actions can be found on the ‘Find funding for land or farms’ tool on GOV.UK. There’s also a PDF version which includes all 102 SFI actions.  "
        },
        {
            "text": "To learn more about how the scheme can work for your farm business, visit our dedicated SFI site.  "
        },
        {
            "text": "We’re rolling out applications for SFI in a controlled way, so everyone gets the right level of service and support. "
        },
        {
            "text": "You can begin your SFI journey by completing a short expression of interest survey. "
        }
    ]
}