{
    "url": "https://mhclgmedia.blog.gov.uk/2024/08/28/cambridge/",
    "title": "Cambridge",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Housing"
    ],
    "pub_date": "2024-08-28T12:08:58+01:00",
    "content": [
        {
            "text": "There has been coverage in the media this week following a letter sent by the Housing Minister Matthew Pennycook to local leaders in Cambridge."
        },
        {
            "text": "The letter confirms that Greater Cambridge has a vital role in kickstarting economic growth across the country."
        },
        {
            "text": "It calls for Cambridge leaders to work side-by-side with ministers to tackle the long-term challenges, including water scarcity, high property prices and excessive traffic."
        },
        {
            "text": "The Times, Cambridgeshire Live, Property Week and Estates Gazette have all reported on the letter, in which the Minister described Cambridge’s economic growth as a “phenomenal success” and signals a new era of partnership."
        },
        {
            "text": "Housing Minister Matthew Pennycook said: "
        },
        {
            "text": "“Greater Cambridge has a vital role to play in this government’s mission to kickstart economic growth and we are determined to maximise the potential contribution it could make to the UK economy by helping to remove barriers to the delivery of vital housing, infrastructure, and laboratory space."
        },
        {
            "text": "“Many crucial decisions remain to be made about the precise form that ambitious and high-quality sustainable growth in the area takes. I am determined that we take a collaborative approach to them, ensuring that the insight and invaluable knowledge of local leaders fully informs the government’s thinking."
        },
        {
            "text": "“That is why today I am making clear that the government intends to reset the crucial relationship with local partners to ensure we are delivering new housing and infrastructure in a way that benefits the city and its surrounding areas and seeking to address the concerns of communities who may be anxious about what the future might hold.”"
        },
        {
            "text": "Cambridge and the surrounding areas will play a greater role in boosting housebuilding and helping more local people onto the property ladder – with targets across South Cambridgeshire, Cambridge and East Cambridgeshire seeing a proposed increase of around 25 per cent."
        }
    ]
}