{
    "url": "https://environmentagency.blog.gov.uk/2024/08/28/getting-your-farm-winter-ready-is-your-problem-slurry-or-rainwater/",
    "title": "Getting Your Farm Winter Ready: Is your problem slurry or rainwater?",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "agriculture"
    ],
    "pub_date": "2024-08-28T12:43:33+00:00",
    "content": [
        {
            "text": "As part of our farm Winter Ready campaign, we’re looking at where to start when assessing the impact of rainfall on slurry storage and what are the first, and often most straightforward, steps you can take. You may find getting a handle on rainfall and managing it in your yard goes a long way. "
        },
        {
            "text": "October 2023 to March 2024 was the UK’s second wettest period on record (Source: Met Office).  "
        },
        {
            "text": "With ever more volatile winter rain, problems around increased rainfall and slurry storage are quickly compounded. "
        },
        {
            "text": "How much rainfall did you get last winter? "
        },
        {
            "text": "Rainfall is worth measuring accurately to help with your slurry storage calculations. If you live in a hilly area like Cumbria or Devon it can vary considerably within a mile or two. If you have your own rainfall figures you can check them against the Slurry Wizard tool  rainfall data which have recently been updated. "
        },
        {
            "text": "How do I use this information? "
        },
        {
            "text": " ‘Slurry Wizard’ is valuable for calculating your slurry storage requirements and the cost effectiveness of different options.  "
        },
        {
            "text": "Is the drainage from each yard area going the right way? Are the drainage systems coping with intense rain? "
        },
        {
            "text": "You can measure up your yard and roofed areas Magic Map Application (defra.gov.uk) to help calculate winter and annual volumes of rainwater. In this yard below it wasn’t just the gutters creating problems but additional rainwater coming off the road into the yard, which was caused by blocked drains. Repairing the drains and replacing the gutters not only reduced water and sediment getting into the slurry system but stopped damp shed walls, which was better for livestock health.  "
        },
        {
            "text": "Photo 1 Before: Leaky gutters and rainwater running into a slurry channel."
        },
        {
            "text": "Photo 2 After: Gutters and yard drainage fixed (a different view of the same yard)"
        },
        {
            "text": "Cost Effective Solutions: Fixing Gutters"
        },
        {
            "text": "First check that all your roof gutters are functioning properly. Are they discharging clean water to the slurry store? If so, consider diverting them to reduce the pressure on your store.  If gutters need replacing, make sure the capacity of the new gutters and drains will cope with heavy rainstorms. They also need maintenance, but that needn’t be expensive if properly planned. There are also which can help improve yard drainage. Catchment Sensitive Farming (CSF) may be able to provide you with further advice."
        },
        {
            "text": "Photo 3 Reception pit is overwhelmed due to heavy rain and blocked yard drains."
        },
        {
            "text": "In this slurry store (photo 3), direct rainfall filled the first ring alone. The remaining 3 rings had sufficient capacity to hold winter rain from surrounding yards but not enough for any slurry - it was proving a very expensive way to store rainwater! A rethink of gutters, drains and ‘clean and dirty water’ separation fixed it."
        },
        {
            "text": "Photo 4 A silage pit (which is not compliant with Slurry, Silage and Agricultural Fuel Oil (SSAFO) Regulations)."
        },
        {
            "text": "Make a Plan"
        },
        {
            "text": "One metre of rainfall represents a cubic metre required for drainage or storage capacity.  Every square metre of yard or roof will either hold or discharge those cubic metres of water somewhere. Imagine your yards and silage clamps acting like a series of Olympic sized swimming pools collecting rainfall! Roofing a silage pit (given that the rainfall that drains from it will be classed  silage effluent) and making it SSAFO compliant (grants are available through CSF) is one solution. In the example above the farmer decided to switch from clamp to baled silage (photo 4) to prioritise sorting out gutters and drains and manage cash flow. It meant less pressure and volume of ‘slurry’ to collect."
        },
        {
            "text": "Photo 5 Sorting out yard drainage."
        },
        {
            "text": "The most important thing to do is to make a plan which will be divided into short term (and usually less expensive) solutions and then longer-term strategic decisions. If you are worried about your situation, we are there to help, not just to ; get in contact with us. Getting on top of slurry and manure management is the key to unlocking not just the value of those nutrients you don’t need to purchase but the full potential of your soil."
        },
        {
            "text": "We want any farmer who has concerns about their storage to (03708 506 506) or email enquiries@environment-agency.gov.uk to discuss the best way to deal with excess slurry. We’re here to help."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}