{
    "url": "https://defradigital.blog.gov.uk/2024/08/28/spotlight-on-talent-development-meet-summer-intern-kiril-korzikovas/",
    "title": "Spotlight on Talent Development – meet summer intern Kiril Korzikovas",
    "authors": [
        "Kiril Korzikovas"
    ],
    "categories": [
        "Defra digital"
    ],
    "pub_date": "2024-08-28T07:30:06+01:00",
    "content": [
        {
            "text": "Summer intern Kiril Korzikovas shares his experience of completing the Civil Service Summer Internship Programme here at Defra digital data technology and security."
        },
        {
            "text": "I’m Kiril, a second-year student studying Economics and Russian at the University of Sheffield. I started my two-month placement in the Digital Delivery team within Defra digital data technology and security back in July, and the time has really flown by!"
        },
        {
            "heading": 2,
            "text": "My journey to the summer internship scheme"
        },
        {
            "text": "I remembered hearing about the scheme years ago when I was in sixth form. I wanted to apply because I’ve always been interested in working for the government so the opportunity to gain hands-on experience of this before I finish my degree would be really beneficial in working towards this goal."
        },
        {
            "text": "I also found that upon successful completion of the scheme you earn a “fast pass” which fast tracks your application to the Civil Service Fast Stream. I’d like to join the Fast Stream when I graduate so this opportunity to progress my application ahead of my final year of university will help to take some of the pressure off during what I’m sure will be a busy year!"
        },
        {
            "text": "The application process wasn’t as scary as I anticipated. You complete three online tests – a situational judgement test, a workplace judgement test and a numeracy test. If you pass the tests, you then get invited to a telephone interview and then if you’re successful at interview you get offered a place on the scheme."
        },
        {
            "text": "The telephone interview was probably part I was most worried about. However, when I was doing the interview, it was really relaxed – the interviewer wants you to do your best and will guide you throughout the interview to give you the opportunity to do this rather than trying to ‘catch you out’."
        },
        {
            "heading": 2,
            "text": "My experience on the scheme"
        },
        {
            "text": "I’ve had a fantastic time on the summer internship, I’ve learned so much and it’s been a great introduction into life in the Civil Service!"
        },
        {
            "text": "I’ve been able to get involved in some genuinely fascinating work, the great thing about the scheme is that even as an intern you feel like you’re productive and contributing to the wider organisation."
        },
        {
            "text": "In my role within DDTS, I’ve been working closely with the project management office, so I’ve learned a lot about project management and everything that goes into that. I’ve spent time attending meetings with different colleagues, from senior managers to portfolio analysts and done a lot of data analysis, report writing and helping prepare presentations. There are of course some admin tasks to do but the focus is definitely on getting you involved with things that help you learn and develop your skills."
        },
        {
            "text": "It can feel like a bit of a culture shock if this is your first ‘corporate’ type job (especially all the ‘corporate slang’ and acronyms, but you’re given a lot of support and no one expects you to be an expert - there are no stupid questions! It’s definitely helped me learn about corporate etiquette and develop my soft skills too."
        },
        {
            "text": "You’re also assigned a personal mentor, which is great for answering the questions you can’t look up online, as well as offering guidance on next steps."
        },
        {
            "heading": 2,
            "text": "My advice for anyone thinking about applying"
        },
        {
            "text": "Just apply! One thing I massively struggled with was the feeling that I ‘wasn’t ready’ but you won’t know unless you try."
        },
        {
            "text": "Ahead of applying I’d advise familiarising yourself with the Civil Service Behaviours and practising using the STAR method for answering questions."
        },
        {
            "text": "Beyond that – just be yourself! We often focus too much on if we’re suitable for an employer but it’s equally as important that an employer is suitable for us, so be your authentic self!"
        }
    ]
}