{
    "url": "https://moderncivilservice.blog.gov.uk/2024/08/28/techtrack-start-a-new-career-in-tech/",
    "title": "TechTrack: Start a new career in tech",
    "authors": [
        "deepathomas"
    ],
    "categories": [
        "A Modern Civil Service",
        "Capability",
        "Digital and data",
        "Professional Networks",
        "Proud Civil Servant",
        "Skilled Civil Service"
    ],
    "pub_date": "2024-08-28T15:53:50+01:00",
    "content": [
        {
            "text": "Did you know, you can start a new career in tech at any stage of your working life? TechTrack is a new digital upskilling programme, delivered via an apprenticeship and created by the Government Digital and Data Profession. This community of experts leads digital transformation in government and is on a mission to build skills at scale. TechTrack is open to everyone and aims to springboard civil servants into a wide range of digital roles. "
        },
        {
            "text": "Delivering world-class technology"
        },
        {
            "text": "Government Digital and Data’s tech projects are all part of government's roadmap to transform public services and deliver world-class technology. UK citizens rightly have an expectation to access public services easily and TechTrack will play a key part in this, through upskilling and building digital talent. Leveraging the power of digital and data will make government more productive and sustainable, with less duplication and waste. "
        },
        {
            "text": " "
        },
        {
            "text": "Is TechTrack for me?"
        },
        {
            "text": "You may be aware of the significant and growing skills gap in digital, data and technology capabilities across the Civil Service. TechTrack aims to find, train and retain this digital talent in key roles, ensuring sustainable support for government departments and embedding these skills into the Civil Service for the long term."
        },
        {
            "text": "Along with addressing this skills gap, TechTrack will implement a digital recruitment experience that reduces time to hire and supports a reduction in our reliance on contingent labour. These digital apprenticeships will accelerate the realisation of a more diverse and inclusive workforce through improved attraction and recruitment processes."
        },
        {
            "text": "Which roles are on offer?"
        },
        {
            "text": "The programme launched at the end of July and offers uniquely tailored apprenticeships in four of the most sought after digital roles across government including software developer,  DevOps engineer, business analyst and cybersecurity technologist (risk)"
        },
        {
            "text": "Applications for the first cohort are now open for the two developer roles and you can find out more and apply here. Applications close on 29 August 2024. You can also sign up to be informed when applications open for the next cohort for these two roles."
        },
        {
            "text": "Applications for business analysts and cybersecurity roles will open in autumn. "
        },
        {
            "text": "Who can apply?"
        },
        {
            "text": "The programme is open to everyone. You might be an existing civil servant seeking a new career path or want to gain specific qualifications to support your career journey."
        },
        {
            "text": "The apprenticeship starts at Higher Executive Officer level (HEO). If you are not at HEO level but feel you have the right skills and experience,  please apply. If you are currently at Senior Executive Officer (SEO) level or above, you can still apply, however please check the terms and conditions of the job offer when applications open."
        },
        {
            "text": " "
        },
        {
            "text": "You can hear from a current apprentice software developer, Dale Bellamy about choosing an apprenticeship and switching his career from sales to digital. "
        },
        {
            "text": "If you are a department or talent lead, you can find out more and bid to hire TechTrack apprentices on our bespoke platform. You can also sign up for information sessions and request a meeting with the TechTrack team on the same platform."
        },
        {
            "text": "Find out more about TechTrack."
        },
        {
            "text": " "
        }
    ]
}