{
    "url": "https://environmentagency.blog.gov.uk/2024/08/28/what-are-dry-day-spills/",
    "title": "What are dry day spills?",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Rivers",
        "Water"
    ],
    "pub_date": "2024-08-28T09:17:43+00:00",
    "content": [
        {
            "text": "England’s sewerage system has thousands of miles of combined sewers. This means that rainwater and wastewater from toilets, bathrooms and kitchens all go into the same pipe to sewage treatment works.  "
        },
        {
            "text": "During periods of rainfall and/or snowmelt, the capacity of these pipes can be overwhelmed, risking wastewater backing up and flooding peoples’ homes and public spaces, unless it is allowed to spill elsewhere. The sewerage network has storm overflows that act as safety valves to reduce the risk of this happening. There are strict permit conditions for when and how they should be used to protect the environment, and it is the responsibility of water companies to comply with the law and to avoid polluting the environment. They must act quickly to address failures and reduce damage if it occurs or face potential enforcement action.     "
        },
        {
            "text": "There are times, however, when wastewater is released when there hasn’t been rainfall – this is known as a dry day spill.   "
        },
        {
            "text": "What is a dry day spill?   "
        },
        {
            "text": "A dry day spill is when a storm overflow is used on a ‘dry day’ – which is defined as no rainfall above 0.25mm on that day and the preceding 24 hours.  "
        },
        {
            "text": "Storm overflows should not spill on dry days, but there are exceptions. For example, some overflows will be located in very large catchments where water falling in a location far upstream of an overflow will take a significant amount of time to drain down or reach it.  "
        },
        {
            "text": "Data from a storm overflow alone doesn’t always tell us what actually happened. When a dry day spill happens, we always treat them as a potential breach until we have confirmed through further investigation. "
        },
        {
            "text": "How does the Environment Agency investigate dry spills? "
        },
        {
            "text": "The EA uses a detailed modelling process, gathering rainfall data from local rain gauges as well as rainfall radar information and comparing it to storm overflow data. This shows whether a spill may have occurred on a dry day. "
        },
        {
            "text": "We then undertake a process of further investigation on a site-by-site basis to determine, for example, that the accuracy of certain rainfall monitors and drain down times are correct, as well as other factors. After this thorough process has been conducted, we can determine if a breach of permit has occurred with sufficient evidence to take enforcement action.  "
        },
        {
            "text": "If an offence has occurred, action will be taken, up to and including prosecution for the most serious offences. The formal options we have include a written warning, enforcement notices, undertaking a prosecution, issuing a Variable Monetary Penalty or accepting an Enforcement Undertaking (EU) offer. Since 2015 (to 5 July 2024) the Environment Agency has completed 61 prosecutions against water and sewerage companies (some involving multiple cases) for pollution offences securing fines of over £151m, an additional prosecution for over-abstraction and a prosecution for failing to provide records brings the total figure to 63 prosecutions. "
        },
        {
            "text": "What’s being done to reduce dry day spills? "
        },
        {
            "text": "We have significantly driven up monitoring and transparency from water companies in recent years, so that everyone can see what is going on.  "
        },
        {
            "text": "This includes event duration monitoring (EDM), which measures how often and for how long storm overflows are used. Through the EA’s requirement of water companies, the number of storm overflows monitored across the network has increased from 10% in 2015 to 100% now monitored. All the data is published online. More info on EDM here. "
        },
        {
            "text": "We are also driving a £750m flow programme with the water industry to increase flows passed forward to treatment as well as increasing the size of storm tanks to reduce spills into the environment from hundreds of sewage treatment works.    "
        },
        {
            "text": "Additionally, pass-forward flow monitors and spill-frequency monitors are being installed on thousands of sewage treatment works, both increasing the understanding of storm overflow performance within the sewerage network and enabling increased regulation of storm tank operations.    "
        },
        {
            "text": "These measures will see the introduction of strict new flow conditions on permits which will be used to scrutinise performance and hold water companies to account if breaches occur.   "
        },
        {
            "text": "The rollout of these monitors caused water and sewerage companies to indicate that there may have been potentially serious breaches of permit conditions. This has resulted in the EA’s largest ever criminal investigation into all water and sewerage companies that discharge into English waters.   "
        },
        {
            "text": "Through our water industry transformation programme we are further setting out measures to transform the way we regulate the water industry to uncover non-compliance and drive better performance. It means we are undertaking a much larger programme of wastewater asset inspections. Last year we carried out 1389 inspections. Inspections will rise significantly, and we will carry out 4,000 by the end of March 2025; 10,000 in 2025/26 and 11,500 in 2026/27. Key to increasing our regulatory capabilities is our digital innovation and transformation. Through the new tools we are already developing, we are improving our ability to turn data rapidly into regulatory intelligence so that we can more easily identify the highest priority issues, meaning our officers can spend more time regulating water companies. "
        },
        {
            "text": " "
        }
    ]
}