{
    "url": "https://insidehmcts.blog.gov.uk/2024/04/03/accessible-justice-courts-and-digital-services-for-all/",
    "title": "Accessible Justice: courts and digital services for all",
    "authors": [
        "HMCTS Communications"
    ],
    "categories": [
        "Digital services",
        "General",
        "Podcast",
        "User experience and research"
    ],
    "pub_date": "2024-04-03T15:39:54+01:00",
    "content": [
        {
            "text": "In our fourth episode of our Inside HMCTS podcast, we focus on how we’re making our courts and tribunals more accessible for everyone and how we are supporting people to use our online services."
        },
        {
            "text": "When people need to come to one of our courts or tribunals, or use our online services, they may require need extra help. We’re committed to removing common barriers people may face to make sure they can access justice at an equal level."
        },
        {
            "text": "You'll hear from Mike Williams, Deputy Director of Service Excellence, about how court users can request adjustments when visiting one of our buildings and how the Human Voice of Justice is improving our communication."
        },
        {
            "text": "We also speak to the team at the Royal Courts of Justice, to find out about how they are overcoming accessibility challenges at the historic site and we find out what support is available for those who need a helping hand when completing digital forms."
        },
        {
            "text": "Listen to the latest episode now, available wherever you get your podcasts from!"
        },
        {
            "text": "Amazon"
        },
        {
            "text": "Apple"
        },
        {
            "text": "Buzzsprout"
        },
        {
            "text": "Spotify"
        },
        {
            "text": " "
        },
        {
            "text": "A transcript of the podcast is also available here."
        }
    ]
}