{
    "url": "https://environmentagency.blog.gov.uk/2024/04/03/beware-the-criminals-lurking-online/",
    "title": "Beware the criminals lurking online",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Environment Agency",
        "Regulated industry",
        "Waste"
    ],
    "pub_date": "2024-04-03T11:29:27+00:00",
    "content": [
        {
            "text": "The modern way to find many of the services, trades, and products we need to buy is to look online. It’s quick, easy and you can do it from the comfort of your own home."
        },
        {
            "text": "But it is a minefield of hidden dangers."
        },
        {
            "text": "Criminals are lying in wait on social media platforms, apps, and selling platforms that you use."
        },
        {
            "text": "Criminals dealing in waste are no different. They know they can get their hands on rubbish you want to get rid of by advertising their services online. They’ll draw you in with offers of quick and cheap collection services. Cheap because they aren’t working within the law. Cheap because they won’t take your waste to a legal waste disposal site."
        },
        {
            "text": "Did you know, you are responsible for making sure anyone you pay to take away your rubbish is a registered waste carrier?"
        },
        {
            "text": "Its not good enough if they say they are registered. You must check because they could be displaying false information in their adverts, knowing most people won’t check."
        },
        {
            "text": "It’s easy and quick to check. Visit the public register: Waste Carriers, Brokers and Dealers (data.gov.uk) Here you can check the company name and address and registration number, if they’ve displayed that. If they don’t appear on this register – they are a waste criminal. Do not give your rubbish to them. They will dump it, with no regard for the safety of people or the environment."
        },
        {
            "text": "Often these criminals create a veil of legitimacy designed to make you think they are running a legal business. They might display the Environment Agency logo on their advert. They do not have our permission to use our logo. This is not a sign of legitimacy or of our approval. Always check the public register."
        },
        {
            "text": "Waste criminals and the damage they cause are costing the public purse and the legitimate waste industry an estimated £1billion every year.   "
        },
        {
            "text": " We are working hard to stop waste criminals, but the best way to stop them – is not to allow them to get hold of rubbish in the first place. This is where you can help by being vigilant and making sure you don’t give your rubbish to the wrong people. Find out what to do with rubbish you can’t put out for kerbside collection: Dispose of household waste - GOV.UK (www.gov.uk)"
        },
        {
            "text": " Be our partner in crime prevention by reporting any suspected waste criminals to Crimestoppers. 100% anonymous. Always. Independent UK charity taking crime information anonymously | Crimestoppers (crimestoppers-uk.org)"
        },
        {
            "text": " "
        }
    ]
}