{
    "url": "https://naturalengland.blog.gov.uk/2024/04/03/england-ecosystem-survey-introducing-englands-largest-ever-field-survey/",
    "title": "England Ecosystem Survey: introducing England’s largest ever field survey",
    "authors": [
        "Isabel Sloman",
        "David Martin",
        "Jakub Olewski"
    ],
    "categories": [
        "Biodiversity",
        "Monitoring",
        "Natural Capital",
        "Natural England",
        "Science and evidence"
    ],
    "pub_date": "2024-04-03T12:20:13+01:00",
    "content": [
        {
            "text": "By Isabel Sloman, Manager, and Elizabeth Mitchell, Senior Advisor for Engagement and Impact, Natural Capital and Ecosystem Assessment programme"
        },
        {
            "text": "The England Ecosystem Survey (EES), the largest field survey ever undertaken in the UK, is now well underway. Working at thousands of sites on a 5-year cycle, surveyors are collecting information on soils, vegetation, and landscape change across the country. The results will allow us to make national-scale assessments on the state of these vital resources, and their ability to keep underpinning ecosystem services like food production and biodiversity.  "
        },
        {
            "text": "Measuring out a vegetation plot on the England Ecosystem Survey. Photo: Nick Woodward"
        },
        {
            "text": "Why are we doing it?   "
        },
        {
            "text": "Data on ecosystems and landscape is often of variable quality, expensive to collect, difficult to access, and out of date. In order to make informed environmental decisions, government and other organisations require better data, and this is what England Ecosystem Survey has been set up to provide.   "
        },
        {
            "text": "EES differs from other surveys not just in its scale but also in the wide range of landscape types it covers, from protected sites and priority habitats to farmland and urban-edge habitats. It will let us draw comparisons between these land use types and across the country.  "
        },
        {
            "text": "What are we surveying?  "
        },
        {
            "text": "The survey takes place within 1km2 squares. Over a five-year cycle we’re aiming to survey at least 2500 of these squares, with ecological surveyors spending up to a week at a time in each one. There they record information on plants, habitats, hedgerows, streams and rivers, trees outside of woodlands, ponds, landscape, and soils.   "
        },
        {
            "text": "In the case of soils, we’re taking at least 24 different measurements (depending on how you count!). They range from the physical and chemical properties of soil, to the number and species of earthworms found in a given patch. We also identify types of microorganisms, such as fungi and bacteria, from their DNA. We want to understand what communities (which combinations of different species) are present, and how this relates to other soil properties. This is a step towards understanding the functioning of an ecosystem.  "
        },
        {
            "text": "We’re also sending samples to the Royal Botanic Gardens Kew so they can study mycorrhizal (fungus root) networks in the soil. These fungi live in symbiotic relationships with plant roots, and are a key aspect of good soil health and function. "
        },
        {
            "text": "What will the results be used for?  "
        },
        {
            "text": "The survey’s findings will support delivery of the 25-Year Environment Plan. For example, the data collected from soil sampling will inform the new Soil Health Metric, which will allow us to report against the ‘Healthy Soils’ commitment in the 25YEP. The government intends to publish a baseline map of soil health, to which EES data will contribute. "
        },
        {
            "text": "The data will underpin future versions of the State of Natural Capital report, which provides a national-scale assessment of our natural resources and their ability to keep providing benefits to people (it won’t be used in the first version of this report, due out this year before the first 5-year cycle of the survey is complete).  "
        },
        {
            "text": "England Ecosystem Survey data will also help us to evaluate and improve national land management programmes like the Environmental Land Management (ELM) schemes and Biodiversity Net Gain (BNG) by providing national data and regional assessments. "
        },
        {
            "text": " "
        },
        {
            "text": "When and where can we see the outputs?   "
        },
        {
            "text": "The data collected as part of EES will be made available under an Open Government Licence, meaning that anyone who wants to can use it. We will start to make data available from 2025 with the full data set available after we complete the first survey cycle (those 2500+ sites). "
        },
        {
            "text": "The Natural Capital and Ecosystem Assessment programme   "
        },
        {
            "text": "The England Ecosystem Survey is part of the terrestrial Natural Capital and Ecosystem Assessment programme (NCEA), which is funded by Defra. Natural capital describes the parts of the environment which have value to humans, providing us with environmental, economic, and social benefits. NCEA is delivering a nationwide survey of England’s land, coast, and sea, mapping the location, extent and condition of our ecosystems and the benefits they provide. The many tools, maps, and processes developed by the programme will provide insights on how and why our environment is changing  – so that we can better protect and manage our natural capital for people and the planet. Natural England also leads several other NCEA projects, including the England Peat Map and Living England, a habitat map.  "
        },
        {
            "text": "   "
        },
        {
            "text": "Thank you... to everyone who has played a part in data collection and method development of the England Ecosystem Survey. In particular, a huge thank you to the thousands of landowners across the country who have allowed us access to their land to record data and make the whole project possible! We look forward to continuing our collaborative work and sharing our findings as we take EES forward.  "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}