{
    "url": "https://mattersoftesting.blog.gov.uk/looking-to-the-future-of-the-mot/",
    "title": "Looking to the future of the MOT",
    "authors": [
        "Neil Barlow"
    ],
    "categories": [
        "Changes to the MOT test",
        "MOT Modernisation",
        "MOT testing service"
    ],
    "pub_date": "2024-04-03T10:21:34+01:00",
    "content": [
        {
            "text": "The dust has now settled after the publication of the consultation on MOT, which confirmed that the government wasn’t changing the frequency of MOTs."
        },
        {
            "text": "Whilst there was a lot of press coverage around the consultation, the government also ran a call for evidence at the same time on the wider future of the MOT. The aim of this was to allow the government to collect information to help develop future proposals."
        },
        {
            "text": "For all of us – the future of the MOT is really important, so we wanted to tell you a bit about what has been happening so far."
        },
        {
            "heading": 3,
            "text": "The Call for Evidence"
        },
        {
            "text": "Many of you will have completed answers to that call for evidence. Whilst much of the focus will have been on the content of the test – for example around whether some modern technologies on vehicles needs to make their way into the MOT – the call for evidence also included wider aspects of the MOT. Those wider aspects included enforcing the roles, the whole way the scheme is administered and service to motorists."
        },
        {
            "text": "Following the call for evidence closing DFT have had the huge task of collating all the feedback and make sense of it. Not surprisingly, there are lots of different views – often opposing. We now need to work with the garage industry, and other stakeholders to find a path through all the feedback to make sure future changes work for everyone."
        },
        {
            "heading": 3,
            "text": "Working Together"
        },
        {
            "text": "Key to making sure that the MOT is ‘fit for the future’ is working with industry. We have been doing that in a few ways such as trialling new ways of working in MOT garages, workshops with the trade and holding discussion groups. We’ll continue to do more of these things as we move forward."
        },
        {
            "text": "One of the higher profile ways we have worked together is through a workshop. DFT, alongside DVSA and the Transport Research Laboratory, hosted a workshop in Birmingham in February. This allowed us to get key representatives from the industry together and talk through the main themes from the call for evidence. Those stakeholders included those associations that represent the garage industry, professional bodies for the industry, manufacturers, vehicle users and those involved in research – it really did provide many perspectives. That workshop has helped us do some very high prioritisation and work out what things might be feasible and desirable in the shorter term, and those that may take a little longer."
        },
        {
            "text": "The workshop also helped us all have an open conversation about understanding the different drivers for improving the MOT – including the need to make sure that we create an environment where investment is encouraged. So, yes, we did touch on the contentious subject of fees!! Not suggesting it is all solved – but talking openly about the challenges is a key step."
        },
        {
            "heading": 3,
            "text": "Test Station Pilots – PN Testing."
        },
        {
            "text": "We’ve previously mentioned our trial which looked into the feasibility of PN (particulate number) testing so we’d like to give you some feedback on how that trial went since it ended in August 2023."
        },
        {
            "text": "During the trial, 1800 vehicles were tested with a fail rate of around 5%. This is really helpful data as it will help government determine if this is a worthwhile change."
        },
        {
            "text": "To make sure the trial was representative, we used a variety of PN testing machines. Our focus now over the coming months will be reviewing the data so we can discuss the outcome of the trial with the Department of Transport and the next steps."
        },
        {
            "heading": 3,
            "text": "Trials of taking photos at test"
        },
        {
            "text": "One of the common themes from the public is confidence in what an MOT means – particularly when buying a car. A long-standing ‘man on the street’ view has been that surely we should just make sure the car has an MOT by having a photo of it."
        },
        {
            "text": "Over the last year, we have been trialling different ways of doing just that. And I think its fair to say that it is easier said than done to find something that will work easily across the 23,400 garages! We want to provide better security, but it’s also important not to slow things down for garages."
        },
        {
            "text": "It’s also clear that taking photos isn’t the only answer to improving the security of the MOT – although it may be a part of the answer. It might be some of other work on ‘plugging’ in to vehicles is also what helps here. We have conducted some trials already, and are now working on different ways of doing it – based on all the feedback we have had."
        },
        {
            "heading": 3,
            "text": "​EV testing – should the test be different?"
        },
        {
            "text": "The call for evidence provided a lot of feedback on EV testing – a type of vehicle that is increasingly common."
        },
        {
            "text": "Whilst there has been some suggestion that these vehicles should have a very different type of MOT, the reality is that the vast majority of the existing MOT works for these vehicles."
        },
        {
            "text": "Looking ahead there may be areas that make sense to add to the test for these vehicles – such as the function of ‘Acoustic Vehicle Alerting Systems’ (the noise the cars make) or Battery Health Status – but any such changes will need careful work with the industry to make sure what we propose is feasible and affordable."
        },
        {
            "heading": 3,
            "text": "Looking ahead - Advanced Driver-Assistance System"
        },
        {
            "text": "Whether we like it or not, modern vehicles have increasing levels of driver assistance systems – and on the even more modern vehicles, these are mandated. Inevitably as these become more common, drivers become more dependent upon them – so the question arises as to whether they should be in the MOT."
        },
        {
            "text": "As with all such the things, the answer is not straightforward – and the answer will not be immediate. It is likely that any trial will be along the lines of checks we already have for emissions control systems or ABS – where we check the vehicles own diagnostic information rather than actually check the system itself."
        },
        {
            "heading": 3,
            "text": "Next Steps"
        },
        {
            "text": "As the MOT develops, engagement and dialogue with the industry is key. This is an exciting time to be in the motor industry with the huge jumps in how technology is changing motoring – and the MOT will need to develop to remain at the heart of keeping vehicles safe."
        }
    ]
}