{
    "url": "https://ruralpayments.blog.gov.uk/2024/04/03/throstle-nest-farm-on-applying-for-grants/",
    "title": "Throstle Nest Farm on applying for grants",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Grants"
    ],
    "pub_date": "2024-04-03T12:36:50+01:00",
    "content": [
        {
            "text": "RPA offers a wide range of grants rural payments to farmers and businesses. In this blog, RPA talks to dairy farmer David Wilkinson from Throstle Nest Farm about his experience of applying for grant funding under the Farming Equipment and Technology Fund."
        },
        {
            "text": "David, who farms with his wife in Pilling, Lancashire, has 300 cows and runs the 300 acre farm with four full-time and two part-time staff."
        },
        {
            "text": "He first applied for a grant under the Farming Equipment and Technology Fund (FETF) Round 1 and was awarded funding for rotating cow brushes, which entertain and clean the cows."
        },
        {
            "text": "David confesses that initially he wasn’t keen to receive grants, but eventually decided to apply to keep up with improved standards and increased animal welfare and also noticing that fellow farmers were applying. He’s now applied for funding for various pieces of equipment over the past four or so years."
        },
        {
            "text": "David said: “I have to say that the process of applying for the grants is ridiculously easy. You don’t even need to get quotes. You just pick the item you want and the Grants team say what percentage they’ll put towards it as different pieces of equipment are scored at different points. All you then need to do to be paid is to show you’ve bought the correct item. That’s why it appeals so much to me.”"
        },
        {
            "text": "He's also received grant funding for a calving gate to hold cows during calving. “I’ve struggled for the last 40 years running round after cows at night and I was watching Clarkson’s Farm and he’d got one for about 12 cows, so and I thought I can definitely have one for 300.”"
        },
        {
            "text": "David has been farming Throstle Nest for over 40 years. “My father was a first generation farmer, and he’s still with us. My wife and I run the farm as our son and daughter are doing other things. The business is strong and I’m now looking to put a manager in while we step back a bit.”"
        },
        {
            "text": "As well as the calving gate, the farm has benefited from a Cluster Flush, which washes out between cows during milking to help reduce mastitis and a variable speed pump for milking cows.  “This piece of kit varies the speed of the pump, so it only uses the amount of power you need at the time, which saves a lot of money on electricity. “"
        },
        {
            "text": "The farm has also received funding for Automated Footbaths and a Trailing Shoe Slurry System. “Another major problem is lameness in cows, caused by either stones or pathogens, so if you put in a footbath, you can keep consistency throughout the herd and the slurry system allows for better management as instead of spraying the slurry, it puts it directly onto the ground.”"
        },
        {
            "text": "David added: “I have to give the grant process credit where it’s due - I was paid very quickly after sending in the claim, which is important for cashflow. I will apply for other grants – it’s very simple, you look down the list and see what you want, but don’t spend money for the sake of it.”"
        },
        {
            "text": "The Farming Equipment and Technology Fund (FETF) provides grants between £1,000 and £50,000 towards the cost of equipment and technology to improve productivity, slurry management and animal health and welfare. Both this, and the Farming Transformation Fund (FTF), which provides grants towards large capital items to help businesses improve productivity, profitability, and environmental sustainability, are part of the Farming Investment Fund (FIF). To learn more about the payments on offer, please read the Funding for farmers, growers and land managers guidance."
        }
    ]
}