{
    "url": "https://digitalpeople.blog.gov.uk/2024/12/12/ambitious-and-future-thinking-advising-on-digital-government/",
    "title": "Ambitious and future-thinking: advising on digital government",
    "authors": [
        "Baroness Martha Lane Fox, entrepreneur, crossbench peer and co-chair of the advisory board for the new digital centre of government"
    ],
    "categories": [
        "DSIT Digital Centre",
        "Government Digital and Data"
    ],
    "pub_date": "2024-12-12T10:34:14+00:00",
    "content": [
        {
            "text": "There is an interesting symmetry to my role as co-chair of DSIT’s advisory board for the new digital centre of government. Among the things we have been considering are: what a 10 year vision for digital government might be. "
        },
        {
            "text": "Coincidentally, about 10 years ago, I had just stopped working in government, having helped create the Government Digital Service and gov.uk. A decade on there is still much to do in order to realise the full potential of a modern Britain powered by good technology. Thinking another 10 years ahead requires grasping where technology might lead public expectations and what we can put in place now to prevent the public sector from falling behind."
        },
        {
            "heading": 2,
            "text": "Turning ambition into vision"
        },
        {
            "text": "I remain evangelical about the critical importance of high quality, digitally enabled government for both citizens and our economy. However, the scale and sophistication of both vision and execution that is required now seems even harder to get right than before."
        },
        {
            "text": "The government’s ambitions here are high. On taking office, one of the first announcements by the Secretary of State for Science, Technology and Innovation, Peter Kyle, was to create a new digital centre focused on  improving how the government and public services interact with citizens."
        },
        {
            "text": "In the letter inviting me to co-lead the advisory board, the motivation for such a group was to “advise on international and industry best practice, to ensure we are being as ambitious and future-thinking as possible”. "
        },
        {
            "text": "The board is made up of 12 people with a broad spectrum of different experiences. We have industry, academia, civil society, policy and practitioners represented. I struggle to think of a conversation on this agenda I have been part of, that has been more nuanced or thoughtful. Among the themes that we have touched on are partnership, open data, inclusion, procurement, health, governance and the role of innovation."
        },
        {
            "heading": 2,
            "text": "Robust foundations"
        },
        {
            "text": "Additionally, we do not underestimate the importance of establishing robust foundations in order to harness the transformative potential of AI."
        },
        {
            "text": "Any emerging technology can offer tantalising possibilities for public service transformation, but we have discussed that meaningful change requires fundamental structural improvements: better data management, improved interoperability, strengthened accountability, and modernised procurement."
        },
        {
            "text": "Paul Wilmott, my co-chair, the wider team and I are committed to understanding our colleagues’ perspectives and stress testing the team’s ambitious vision. "
        },
        {
            "heading": 2,
            "text": "The next chapter"
        },
        {
            "text": "The Civil Service team has done a great deal of work and are quite rightly focusing on outcomes not outputs and relatively speedy timelines - with the outcomes due to be published in the New Year. I want to thank everyone in the team for working so hard to help deliver the strategy and services."
        },
        {
            "text": "As with everything, I am mindful of how the storytelling of this project is going to be vital. Last month, I spoke to over 100 public sector digital leaders about this work. Their enthusiasm and engagement made me very optimistic that the amassed firepower will make good technological choices for citizens. But it is going to be very important we keep leadership engaged at the highest level. The digital transformation of public services cannot sit in one department; it has to be a joined up part of the story of what we want our country to become over the next decade. That’s why the close relationship with HM Treasury and the Cabinet Office is so vital."
        },
        {
            "text": "What do you want your part in this story to be? Comment below to share your example of future-thinking, collaborative work in government or the wider public sector."
        }
    ]
}