{
    "url": "https://defrafmp.blog.gov.uk/2024/12/12/our-consultation-events-are-over-but-theres-still-time-to-share-your-thoughts/",
    "title": "Our consultation events are over but there’s still time to share your thoughts",
    "authors": [
        "Nicola Lewellen, Engagement and Communications lead"
    ],
    "categories": [
        "Cockle FMP",
        "North Sea and Channel sprat FMP",
        "Queen scallop FMP",
        "Southern North Sea and Channel skates and rays FMP",
        "Southern North Sea demersal non-quota FMP"
    ],
    "pub_date": "2024-12-12T09:00:55+00:00",
    "content": [
        {
            "text": "The last of our FMP consultation events have taken place and we’d like to thank the stakeholders that attended. Your input is valuable and is being fed into the consultations.   "
        },
        {
            "text": "There is still time to have your say in these consultations "
        },
        {
            "text": "Although the events have wrapped up, don't worry, you still have a chance to share your thoughts and opinions. "
        },
        {
            "text": "The consultations are still open for you to have your say. This is your chance to make your voice heard and contribute to the FMPs that matter to you- let your opinion be known – every input counts!  "
        },
        {
            "text": "How to have your say "
        },
        {
            "text": "Our five FMP consultations close on 19 January 2025, and you can find them online at Defra - Citizen Space. "
        },
        {
            "text": "Search for them by name and then scroll down the page to find the consultation documents. (TIP- look out for the ‘consultation document’ as it gives an overview of everything along with the consultation questions) "
        },
        {
            "text": "You can respond online, by email or phone and contact details can be found on the consultation pages.  "
        },
        {
            "text": "For an overview of the draft plans see our factsheets and video - "
        }
    ]
}