{
    "url": "https://stratcommand.blog.gov.uk/2024/12/12/portsmouths-new-emergency-department-opens-with-support-from-defence-medical-services-personnel/",
    "title": "Portsmouth’s New Emergency Department Opens with support from Defence Medical Services personnel",
    "authors": [
        "bobsendall"
    ],
    "categories": [
        "Personnel",
        "Uncategorized"
    ],
    "pub_date": "2024-12-12T13:24:55+00:00",
    "content": [
        {
            "text": "The transition to a state-of-the-art Emergency Department (ED) at the Queen Alexandra Hospital in Portsmouth was successfully completed on 26  November 2024, thanks to an innovative collaboration between Defence Medical Services (DMS) personnel and NHS staff."
        },
        {
            "text": "The seamless move was made possible by Joint Hospital Group (JHG) South (part of the DMS), which stepped in to ensure uninterrupted patient care while NHS teams familiarised themselves with the new facility."
        },
        {
            "text": "The £58 million project, launched in March 2023 which was part of a national initiative to build better emergency care, has transformed emergency care provision for adults and children in Portsmouth and surrounding areas."
        },
        {
            "text": "Designed to meet increasing demand, the new Department boasts cutting-edge technology and expanded capacity. However, transitioning from the outdated facility required meticulous planning and extraordinary teamwork."
        },
        {
            "text": "In the weeks leading up to the transition, military personnel - including nurses, healthcare assistants, and emergency care specialists from JHF South – stepped forward to assist Portsmouth Hospitals University NHS Trust, contributing approximately 10% of its personnel based there to the effort."
        },
        {
            "text": "JHG(S) consists of over 200 military personnel who are permanently based at Portsmouth, Southampton, Winchester and Salisbury NHS Trusts working alongside their NHS colleagues to provide the highest quality patient care, and maintain their medical skills - ready for operations wherever and whenever required, worldwide."
        },
        {
            "text": "The team were tasked with managing operations at the old Emergency Department while NHS staff prepared the new facility."
        },
        {
            "text": "On the morning of Tuesday 26 November 2024, the military assumed command of the old Emergency Department. They managed the care of approximately 100 patients across resuscitation, ambulatory care, and major treatment areas, ensuring uninterrupted service as NHS staff moved into the department."
        },
        {
            "text": "By 8:00 AM, the new Emergency Department began accepting patients, marking a new chapter in Portsmouth’s emergency care journey. Throughout the day, the military team’s coordination enabled a safe and efficient transfer of operations. The final patient left the old Emergency Department at 2:50 PM, signalling its official closure."
        }
    ]
}