{
    "url": "https://environmentagency.blog.gov.uk/2018/10/25/monitoring-radioactivity-in-the-environment/",
    "title": "Monitoring radioactivity in the environment",
    "authors": [
        "Ray Pemberton"
    ],
    "categories": [
        "Regulated industry"
    ],
    "pub_date": "2018-10-25T12:25:41+00:00",
    "content": [
        {
            "text": "This blog refers to our 2018 publication of RIFE"
        },
        {
            "text": "I’m one of the Environment Agency’s radiation specialists and scientists. Our radiological monitoring team works with CEFAS and our partners to pull together and analyse data from our UK-wide radiological monitoring programmes. Overall we take around 10,000 analyses and radiation dose rate measurements each year."
        },
        {
            "text": "We publish information about levels of radioactivity in food and the environment every October in our 'RIFE report'. This year the report again shows that levels of radioactivity in food and the environment are low. Radiation doses to people living around nuclear licensed sites from authorised releases were well below the legal limit."
        },
        {
            "text": "Radiation is all around us"
        },
        {
            "text": "Whilst our report focusses on the radiation from artificial (man-made) sources, it is natural radiation that continues to be the main source of exposure to communities. Everybody is exposed to this and the amount varies from person to person and place to place. Some of the main sources include soil, rocks, radon gas and cosmic rays."
        },
        {
            "text": "Radioactive waste is created through the routine operations of the nuclear and non-nuclear industries. Whilst this is controlled, and it is a legal requirement that the amount of waste is kept to a minimum, some radioactive waste can be released into the air or discharged to sea and to rivers under strict permit conditions. It can enter the food chain and can cause low levels of public radiation exposure."
        },
        {
            "text": "Our monitoring programme"
        },
        {
            "text": "It’s our job to set limits and regulate radioactive discharges and emissions from both nuclear and non-nuclear sites such as industry, universities and hospitals."
        },
        {
            "text": "Our sampling and analysis programmes support our regulation and helps us check on the levels of radioactivity people are exposed to and that these are within legal limits."
        },
        {
            "text": "Our regulators make frequent visits to nuclear sites across England. We look at how operators manage and dispose of radioactive waste. We check their monitoring of discharges to air and water and that they are complying with the strict limits in our permits and minimising the impact of radioactivity on the environment."
        },
        {
            "text": "If you live near a nuclear site you might have seen us or our contractors out with their equipment. We monitor beaches and mudflats by measuring radiation dose rates directly using portable dose rate meters. Samples including grass, sand, mud, water and soil are taken back to the laboratory and analysed. Air and rain is also monitored so we know the background levels and can detect if any changes occur."
        },
        {
            "text": "Learn more about radioactivity around you"
        },
        {
            "text": "We’ll be answering questions about the report at nuclear site stakeholder group meetings. In September we talked about our monitoring programme at New Scientist Live and we will also be at Big Bang 2019."
        },
        {
            "text": "Our report is full of data, tables and graphs but the summaries at the start of each chapter are accessible and provide an overview of each site. If you’ve got any feedback on the report please comment below."
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}