{
    "url": "https://mhclgdigital.blog.gov.uk/2025/04/23/exploring-approaches-for-using-gov-uk-one-login-in-local-government-join-our-discovery/",
    "title": "Exploring approaches for using GOV.UK One Login in local government: join our discovery ",
    "authors": [
        "The Local Digital team"
    ],
    "categories": [
        "Local Digital"
    ],
    "pub_date": "2025-04-23T14:41:14+01:00",
    "content": [
        {
            "text": "The way service users access public services is changing. At the heart of this transformation is GOV.UK One Login, which is a secure, unified way for people to sign in to government services. It’s currently being rolled out across central government in England, and now the Local Digital team is exploring how GOV.UK One Login could benefit local government. "
        },
        {
            "text": "We know that councils face challenges with identity checks and authentication. Users need easy, seamless access to services, and councils need efficient, secure and cost-effective solutions. To address these needs, we’re launching a discovery phase to understand how GOV.UK One Login could help councils. "
        },
        {
            "heading": 2,
            "text": "Why One Login matters  "
        },
        {
            "text": "Local government plays a significant role in the public’s lives, delivering essential services from housing support to waste collection. For many councils, the current authentication landscape is fragmented, with multiple logins across different services. This can be frustrating for users, and costly for councils. "
        },
        {
            "text": "By adopting centrally developed and tested components like One Login, councils could benefit from: "
        },
        {
            "heading": 2,
            "text": "What the discovery will explore "
        },
        {
            "text": "One Login has been designed with a focus on central government delivering transactional services. We don’t assume One Login is the right fit for every council service – our discovery aims to find out: "
        },
        {
            "text": "Over the next 10 weeks, we would like to work with councils and software suppliers to explore: "
        },
        {
            "text": "It’s about ensuring any solution meets the needs of councils and their residents. For some councils, adopting a new authentication system might feel daunting, so the discovery phase will concentrate on identifying options that are realistic, valuable and practical. "
        },
        {
            "heading": 2,
            "text": "A gateway to future possibilities "
        },
        {
            "text": "One Login can be a gateway to a more cohesive user experience. With the upcoming integration of the GOV.UK Wallet and the GOV.UK App, the public will soon be able to store, access and securely share government documents digitally – from driving licences to blue badges, and other essential paperwork. "
        },
        {
            "text": "One Login could simplify authentication and act as a foundation for seamless, secure access to government services where identity and eligibility need to be verified. This will help to reduce the administrative burden for both councils and residents. "
        },
        {
            "heading": 2,
            "text": "How to get involved "
        },
        {
            "text": "We want to hear from local government and software suppliers who are interested in shaping this work. Whether you’re keen to explore One Login or have concerns about its feasibility, your insights will be crucial. We’re committed to working with councils to understand what’s needed, and establish clear pathways for adoption. "
        },
        {
            "text": "If you’d like to be involved or simply stay updated, let us know by completing this form by Friday 16 May. "
        },
        {
            "heading": 2,
            "text": "Find out more about our work"
        },
        {
            "text": "Follow our channels for the latest updates and opportunities: "
        }
    ]
}