{
    "url": "https://food.blog.gov.uk/2025/04/23/good-food-hygiene-is-good-business/",
    "title": "Good food hygiene is good business",
    "authors": [
        "Katie Pettifer, Chief Executive"
    ],
    "categories": [
        "Business guidance",
        "Our mission"
    ],
    "pub_date": "2025-04-23T10:52:48+01:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "At the FSA one of our guiding principles is making it easier for businesses to do the right thing. Today we're launching a campaign designed to help food businesses improve their hygiene standards through better use of FSA guidance and resources."
        },
        {
            "text": "Good hygiene isn't just about compliance—it directly affects business success. Our research shows that food hygiene standards matter significantly to customers: 64% of customers consider cleanliness when choosing where to eat, while 82% would avoid restaurants or takeaways with a hygiene rating of two or below."
        },
        {
            "text": "But we know many small and micro-businesses are missing out on the latest guidance that could help them protect their customers and ensure they meet their legal obligations to keep food safe."
        },
        {
            "text": "Many small businesses, for example, are unaware of the new allergy information requirements and only 6% of these businesses subscribe to FSA news and food alerts. This means they may miss information about products to be cleared from the shelves during a food safety incident."
        },
        {
            "text": "To help address this gap, we’re launching a refreshed FSA business website hub. This hub will allow food businesses to have quick and free access to the resources they need to run their businesses safely. It includes expanded free training resources and improved guidance materials, covering critical areas like allergen management and food incident response. "
        },
        {
            "text": "These tools are completely free to access and use. Our aim is simple: to make it easier for businesses to do the right thing. By engaging with these resources, we want to help business better protect customers, maintain public trust in the food industry, and stay compliant with the latest regulations. "
        },
        {
            "text": "To support and promote this campaign we’re working with trusted partners from across the food sector including food businesses and industry representatives to share the message with colleagues, employees and their wider networks. By working together, we can ensure businesses continue to thrive while keeping their customers safe. "
        },
        {
            "heading": 1,
            "text": "Mae hylendid bwyd da yn dda i fusnes"
        },
        {
            "text": "Yn yr ASB, un o’n hegwyddorion arweiniol yw ei gwneud yn haws i fusnesau wneud y peth iawn. Heddiw, rydym yn lansio ymgyrch sydd wedi’i gynllunio i helpu busnesau bwyd i wella eu safonau hylendid, a hynny trwy ddefnyddio canllawiau ac adnoddau’r ASB yn well."
        },
        {
            "text": "Nid yw hylendid da yn ymwneud â chydymffurfio’n unig—mae’n effeithio’n uniongyrchol ar lwyddiant busnes. Mae ein hymchwil yn dangos bod safonau hylendid bwyd yn bwysig iawn i gwsmeriaid: mae 64% o gwsmeriaid yn ystyried glendid wrth ddewis ble i fwyta, a byddai 82% yn osgoi bwytai neu siopau tecawê sydd â sgôr hylendid o ddau neu lai."
        },
        {
            "text": "Ond rydym yn gwybod bod llawer o fusnesau bach a micro yn colli allan ar y canllawiau diweddaraf a allai eu helpu i ddiogelu eu cwsmeriaid a sicrhau eu bod yn bodloni eu rhwymedigaethau cyfreithiol i gadw bwyd yn ddiogel."
        },
        {
            "text": "Er enghraifft, nid yw llawer o fusnesau bach yn ymwybodol o’r gofynion newydd o ran gwybodaeth am alergeddau, a dim ond 6% o’r busnesau hyn sy’n tanysgrifio i hysbysiadau newyddion a rhybuddion bwyd yr ASB. Mae hyn yn golygu y gallent golli gwybodaeth am gynhyrchion i’w tynnu oddi ar y silffoedd yn ystod digwyddiad diogelwch bwyd."
        },
        {
            "text": "Er mwyn helpu i fynd i’r afael â’r bwlch hwn, rydym yn lansio hyb newydd i fusnesau ar wefan yr ASB. Bydd yr hyb hwn yn galluogi busnesau bwyd i gael mynediad cyflym at yr adnoddau sydd eu hangen arnynt i redeg eu busnesau’n ddiogel, a hynny’n rhad ac am ddim. Mae’n cynnwys mwy o adnoddau hyfforddi rhad ac am ddim a chanllawiau sydd wedi’u gwella; mae’r rhain yn cwmpasu meysydd hanfodol fel rheoli alergenau ac ymateb i ddigwyddiadau bwyd."
        },
        {
            "text": "Gellir cael at yr adnoddau hyn a’u defnyddio’n rhad ac am ddim. Mae ein nod yn syml: hynny yw, ei gwneud yn haws i fusnesau wneud y peth iawn. Gall manteisio ar yr adnoddau hyn helpu busnesau i ddiogelu cwsmeriaid yn well, cynnal ymddiriedaeth y cyhoedd yn y diwydiant bwyd, yn ogystal â pharhau i gydymffurfio â’r rheoliadau diweddaraf."
        },
        {
            "text": "I gefnogi a hyrwyddo’r ymgyrch hwn, rydym yn gweithio gyda phartneriaid dibynadwy o bob rhan o’r sector bwyd, gan gynnwys busnesau bwyd a chynrychiolwyr ar ran y diwydiant, i rannu’r neges gyda chydweithwyr, cyflogeion a’u rhwydweithiau ehangach. Trwy weithio ar y cyd, gallwn sicrhau bod busnesau’n parhau i ffynnu wrth gadw eu cwsmeriaid yn ddiogel ar yr un pryd."
        }
    ]
}