{
    "url": "https://cddo.blog.gov.uk/2025/04/23/introduction-to-user-research-now-available-on-futurelearn/",
    "title": "Introduction to User Research – now available on FutureLearn",
    "authors": [
        "Thomas Beautyman, Deputy Director Government Digital Capability, CDDO"
    ],
    "categories": [
        "Cross-government strategy",
        "Data",
        "Digital learning and development",
        "Digital strategy",
        "Digital transformation",
        "Government Digital and Data"
    ],
    "pub_date": "2025-04-23T16:14:33+01:00",
    "content": [
        {
            "text": "Ever wondered what user researchers do? Curious about why we do it in government? Here’s your chance to learn more!"
        },
        {
            "text": "Created in collaboration with user research colleagues from across government, the Government Digital Service (GDS) is  thrilled to announce that our new Introduction to User Research course is now live!"
        },
        {
            "text": "This course is the latest instalment in our “Introduction to” series. As outlined in the blueprint for modern digital government, there is a need for investment in talent and opportunities for learning, development and upskilling. GDS is at the forefront of providing these opportunities so that we can contribute to the government’s goal of doubling the size of the Government Digital and Data profession and equipping civil servants with the skills and knowledge they need to work effectively in a modern digital government. "
        },
        {
            "heading": 3,
            "text": "Who is the course for?"
        },
        {
            "text": "Whether you work as a user researcher already and would like to develop some skills, are simply curious about the field, or are maybe even considering a government user research career, this course is for you! "
        },
        {
            "heading": 3,
            "text": "What will you learn?"
        },
        {
            "text": "On this three-week, self-led, introductory course, you will learn the basics: "
        },
        {
            "text": "This course is free to access and open to everyone! It is structured over three weeks with a recommended learning time of three hours per week, but it is self-directed and you can learn at your own pace. You can join and start learning at any time."
        },
        {
            "heading": 3,
            "text": "Why user research?"
        },
        {
            "text": "Before 2020, GDS Academy launched and ran a two-day classroom version of the Introduction to User Research in Government course. The course was designed to equip new researchers and career changers with essential user research skills and clarify how user research works in government. "
        },
        {
            "text": "This was paused in 2020 due to COVID-19, so GDS created a version that could be delivered remotely. A cross-government facilitator group now runs the course both online and in person."
        },
        {
            "text": "Following the success of our other FutureLearn courses (Introduction to Content Design and Introduction to Product Management), we decided to adapt this content into a course we could share across government and with the wider public. "
        },
        {
            "text": "We also collaborated with colleagues on the Digital Fast Stream who were in need of a tailored learning package introducing learners to user research in government. This provided us with the opportunity to meet an internal need for learning while also promoting user research as a discipline more widely. "
        },
        {
            "heading": 3,
            "text": "How does it work?"
        },
        {
            "text": "The topics covered in the course will also be useful for anyone who would like to:"
        },
        {
            "text": "This is an awareness level course. It is aimed at people who are new to user research or for those who have some knowledge but would like to learn more about user research in government."
        },
        {
            "text": "The course content was produced by a cross-government team of user researchers from the Ministry for Housing, Communities and Local Government, NHS England, the Department for Environment, Farming and Rural affairs, Government Property Agency, HM Revenue and Customs and the Centre for Digital Public Services, adapting material from existing training and other sources, such as the Government Digital and Data user researcher pages on GOV.UK"
        },
        {
            "text": "You will learn through a mix of reading, completing tasks and watching educational videos produced by user researchers working in government. You can keep track of your progress by taking quizzes and end-of-week tests, and by completing the learner tasks throughout the course. "
        },
        {
            "text": "The course is free to access, but for an optional fee you can gain permanent access to the course material, get a chance to take the course assessments, and receive a signed certificate of completion at the end of the course as a record of your learning. "
        },
        {
            "heading": 3,
            "text": "Social learning"
        },
        {
            "text": "FutureLearn is a social learning platform and interaction between learners is fundamental to the experience. "
        },
        {
            "text": "On every step of the course, you will have the opportunity to chat to other learners about the subjects and activities covered. You can comment as much or as little as you would like, but we encourage you to join in and learn collaboratively."
        },
        {
            "text": "Register on FutureLearn now – the course is now permanently live! You can join the course at any time and learn at your own pace each week. "
        },
        {
            "text": "What’s next?"
        },
        {
            "text": "Keep an eye out for our upcoming courses on more digital and data roles, including Business Analyst, Delivery Manager and Service Designer. "
        },
        {
            "text": "If you have any queries or would like to collaborate with the team on our next courses, you can contact the Learning Design team by emailing thomas.munley@digital.cabinet-office.gov.uk."
        }
    ]
}