{
    "url": "https://moderncivilservice.blog.gov.uk/2025/04/23/meet-the-modern-civil-service-amritpal-chahal-apprentice-software-developer-ministry-of-justice/",
    "title": "Meet the Modern Civil Service, Amritpal Chahal, Apprentice Software Developer - Ministry of Justice",
    "authors": [
        "Government Reform"
    ],
    "categories": [
        "A Modern Civil Service",
        "Capability",
        "Digital and data",
        "Government Reform",
        "Innovation",
        "Interview",
        "Proud Civil Servant",
        "Skilled Civil Service"
    ],
    "pub_date": "2025-04-23T11:51:48+01:00",
    "content": [
        {
            "heading": 2,
            "text": "About TechTrack: Developing digital and data leaders"
        },
        {
            "text": "TechTrack is the government’s flagship apprenticeship programme for attracting and retraining talented individuals for digital and data leadership roles, and it has a key role in the Prime Minister’s plan to reshape government services. TechTrack, part of the Government Digital and Data community, sits at the heart of the digital centre of government and is part of the Department of Science, Innovation and Technology."
        },
        {
            "text": "The Modern Civil Service caught up with Amrit Chahal, an Apprentice Software Developer at the Ministry of Justice (MoJ), Amrit is one of the very first TechTrack apprentices. In this interview, we talk to him about his motivations, the TechTrack selection process, his experience of the apprenticeship ‘bootcamp’ training phase and Amrit’s views on a modern digital government. "
        },
        {
            "heading": 3,
            "text": "What does a Modern Civil Service mean to you?"
        },
        {
            "text": "To me, a Modern Civil Service is one that is efficient, inclusive and delivers in the best interest of the public. A service that keeps up with the ever-changing digital landscape."
        },
        {
            "heading": 3,
            "text": "Tell us about TechTrack"
        },
        {
            "text": "TechTrack is a new type of apprenticeship that looks for new talent as well as existing civil servants who may be in established careers and in other fields. It aims to combine digital training with leadership elements to help drive an influx of tech leaders in government. Think of a digital version of the Civil Service Fast Stream!"
        },
        {
            "text": "I applied for TechTrack as I am someone who has always been fascinated by technology. I was inspired by the opportunity to contribute to projects that make a difference to the public. "
        },
        {
            "text": "Being able to apply your learning immediately in the workplace is invaluable. There is a huge focus on support with the training providers, fostering a culture that enjoys sharing knowledge and continuous development."
        },
        {
            "heading": 3,
            "text": "Could you share your experience about the TechTrack selection process?"
        },
        {
            "text": "The process started with assessing an individual’s learning aptitude, followed by a technical test. Then there were self-assessments, scenario based questions and formal interviews. I also had to present in one of the interviews. "
        },
        {
            "text": "I found the interview questions to be the most challenging part. I think the process really identifies those with the personality, enthusiasm, ability to learn and leadership qualities needed to thrive in the role."
        },
        {
            "heading": 3,
            "text": "The government's blueprint for a modern digital government emphasises creating services that ‘do the hard work for citizens’. How does this user-centered philosophy influence your approach to software development?"
        },
        {
            "text": "You can read about the blueprint for a modern digital government on GOV.UK. Users are at the heart of all the work we do. As a developer, my aim will be to make digital services easy to use and accessible. This requires frequent testing and changes based on user feedback. The goal is that our services work well and are available to everyone."
        },
        {
            "heading": 3,
            "text": "How do you see technologies like AI transforming public services, and what role do you hope to play in that transformation?"
        },
        {
            "text": "I see AI making public services more efficient and personalised. It can help with repetitive tasks and automate lengthy processes such as document reviews. I also see it providing faster and more personalised responses to citizens’ queries. "
        },
        {
            "text": "I want to ensure that AI is used ethically, and that human oversight, transparency and fairness remains central to our work. I hope to play a key role in making public services more efficient, as well as enhancing trust in the services."
        },
        {
            "heading": 3,
            "text": "What's been your proudest achievement or contribution since joining the TechTrack programme?"
        },
        {
            "text": "Having the opportunity to ask the Prime Minister a question about the digital transformation of government with apprenticeships! Seven other TechTrack apprentices and I attended a hackathon at Downing Street earlier that same week. You can read about this on LinkedIn."
        },
        {
            "heading": 3,
            "text": "TechTrack is central to building a Modern Civil Service fit for the digital age. How does it feel to be at the forefront of this transformation?"
        },
        {
            "text": "I am incredibly excited and grateful to be a part of this transformation. I think a modern Civil Service is one that is agile, digital, data-driven and focused on the public’s needs. I appreciate the responsibility that comes with this opportunity and believe a modern Civil Service must be digital-first and inclusive - ensuring services are accessible to everyone, regardless of their level of digital literacy."
        },
        {
            "heading": 3,
            "text": "Finally, what's something you've learned about digital public service delivery that you wish more people understood?"
        },
        {
            "text": "More than just using new technology, it’s about a cultural change to embrace new ways of working. That means ensuring people are supported to try out new things and experiment. "
        },
        {
            "text": "I think it’s important to remember that digital services will continuously be changing, based on user feedback. This user experience is at the heart of the work we do - it is all about making life easier for people."
        },
        {
            "text": "If you are a department lead and would like to know more about hiring a TechTrack apprentice, you can register to attend a special ‘GDS talks TechTrack session’ and also contact the providers directly for Software Developer roles, or visit the Business Analyst page. For any questions you can contact the TechTrack team."
        }
    ]
}