{
    "url": "https://marinescience.blog.gov.uk/2023/03/24/belize-sustainable-seafood-collaboration-ocean-country-partnership-programme/",
    "title": "Belize Sustainable Seafood collaboration - Ocean Country Partnership Programme",
    "authors": [
        "Mickael Teixeira Alves"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2023-03-24T13:36:19+00:00",
    "content": [
        {
            "text": "Cefas scientists recently visited Belize as part of the UK government's Ocean Country Partnership Programme (OCPP). Jason Mewett (Senior Fish Health Inspector), Matthew Green (Histologist) and Mickael Teixeira Alves (Senior Risk Assessor) met with government and other organisations, at the request of the Belizean government, to work together on fish disease, aquatic animal health and fish certification programmes."
        },
        {
            "text": "The OCPP supports countries to strengthen marine science expertise, develop science-based policy and management tools, and create educational resources for coastal communities with a focus on marine pollution, sustainable seafood and marine biodiversity. Through the OCPP, the UK government partners with eligible countries to deliver tangible and positive impacts on the livelihoods of coastal communities that depend on healthy marine ecosystems, focussing on sustainable seafood, marine pollution and marine biodiversity."
        },
        {
            "text": "The visit aimed to provide direct Government to Government support from Cefas’ Fish Health Inspectorate (UK Competent Authority) to the Belize Agriculture Health Authority (BAHA) (Belize Competent Authority) to meet their request for training and capacity building in fish diseases and fish certification programmes. We provided workshops and technical training to support improved aquatic animal health assessment to protect natural capital and facilitate sustainable aquaculture growth with BAHA and the Ministry of Agriculture. The trip also included working with the national animal and plant health laboratory to help maintain their accreditation."
        },
        {
            "text": "Staff from the BAHA Animal Health, Aquatic Health, Food Safety and Quarantine departments, and the Tilapia Hatchery Centre (THC) met at the BAHA complex to discuss Belize’s aspirations to support strategic domestic aquaculture, improve biosecurity and strengthen regulatory frameworks for animal health and trade."
        },
        {
            "text": "We also carried out workshops on risk assessment, biosecurity measures and laboratory practices with Belize University students and THC and BAHA staff to build national capacity to support sustainable aquaculture products, health management practices and new market access. Training included demonstrations of external and internal fish examination for signs of disease, organ and tissue sampling for laboratory histology analysis and disease testing, and preservation of fish samples."
        },
        {
            "text": "We had the chance to visit the Aquatic Health department’s laboratory histology facilities, and discussed scientific and technical best practice to expand capacity in fish diseases and fish health certification programmes to help maintain the Aquatic Health laboratory accreditation."
        },
        {
            "text": "The trip also included a visit to the THC to discuss the strategic farming of tilapia, a fast-growing sector, that aims to meet the local market demand for safe and healthy farmed fish, relieving pressure on marine finfish wild stocks and complementing the recovery of the Belize shrimp industry. Discussions focussed on collaboration and strategic assessments that will improve fish and public health, value chain and market access."
        },
        {
            "text": "Miguel Ѕоѕа, the Aquaculture THC Manager for the Minister of Agriculture said that the expansion of finfish aquaculture of Red Tilapia linking biodiversity, pollution and seafood production aspirations in Belize to improve food security, production and trade “would assist the Ministry of Agriculture, BAHA, and the Aquaculture [Unit] with addressing any technical gaps that we have in fish disease, fish monitoring, and food safety.”"
        },
        {
            "text": "Belizean tilapia production is essentially at a small business scale, with backyard farming most common. The mission ended with a visit to a local farm, where we discussed farm biosecurity measures such as disinfection, good farming practices and promotion of healthy farmed products."
        },
        {
            "text": "Next steps will be to plan future partnerships with the Belizean Competent Authorities to increase technical assistance in diagnostic methods, target risk assessment workshops to support health management protocols, surveillance plans, biosecurity measures and import controls and also support improved regulations for strengthening health management, monitoring, and enforcement. Under the OCPP, these activities will support efficient management of human activities and, in the long term, ensure that all Belizean citizens benefit from a sustainable use of their environment."
        },
        {
            "text": "The team would like to thank Sylvia Mendez, the BAHA Aquatic Health Technical Director, and Miguel Sosa, the Aquaculture Manager at the THC for facilitating the meetings and workshops."
        },
        {
            "text": "The visit received a variety of coverage in the Belizean media and on social media."
        },
        {
            "text": " "
        }
    ]
}