{
    "url": "https://deframedia.blog.gov.uk/2023/03/24/decision-to-retain-cut-off-date-for-registering-historic-rights-of-way/",
    "title": "Decision to retain cut-off date for registering historic rights of way",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Nature"
    ],
    "pub_date": "2023-03-24T13:38:35+00:00",
    "content": [
        {
            "text": "There is coverage in the Guardian, FarmingUK, Horse & Hound and UK Hill Walking following the decision to retain the cut-off date for registering historic rights of way (HRoW). The decision provides much-needed certainty for landowners,  local authorities and users – and reflects the original intention of the Countryside and Rights of Way Act 2000 (CROW). The cut-off date will also be extended from 1 January 2026 to 1 January 2031"
        },
        {
            "text": "We are also implementing reforms to how historic rights of way are recorded. As part of our reforms, local authorities will have more powers to reject weakly evidenced applications, ignore irrelevant objections, and agree on appropriate modifications directly with landowners. Local Authorities will also be able to correct obvious administrative errors through a significantly shortened process."
        },
        {
            "text": "We want to promote responsible access, protect nature, and support those who work and live in the countryside – while streamlining the process."
        },
        {
            "text": "The government has a firm commitment to providing better access to nature for all sections of society – and the Environmental Improvement Plan outlines our ambition to ensure that every household is within a 15-minute walk of a green space or water, creating more opportunities for people to connect with nature and enjoy its many benefits."
        },
        {
            "text": "A Defra spokesperson said:"
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}