{
    "url": "https://deframedia.blog.gov.uk/2023/03/24/genetic-technology-act-becomes-law/",
    "title": "Genetic Technology Act becomes law",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Farming"
    ],
    "pub_date": "2023-03-24T16:35:50+00:00",
    "content": [
        {
            "text": "On Thursday 23rd March, the Precision Breeding Act become law. The Act sets in motion changes to allow farmers to grow crops which are drought and disease resistant, reduce use of fertilisers and pesticides, and help breed animals that are protected from catching harmful diseases."
        },
        {
            "text": "There has been widespread coverage of this announcement, including a package with the BBC, Daily Express, The Times and Farmers Weekly."
        },
        {
            "text": "Precision breeding involves using technologies such as gene editing to adapt the genetic code of organisms – creating beneficial traits in plants that through traditional, breeding would take decades to achieve. This enables scientists to safely create foods that are more flexible, adaptable and plentiful for years to come."
        },
        {
            "text": "Under the provisions of this Act, a new science-based and streamlined regulatory system will be introduced to facilitate greater research and innovation in precision breeding - with stricter regulations remaining in place for genetically modified organisms (GMOs)."
        },
        {
            "text": " "
        },
        {
            "text": "Food Minister Mark Spencer said:"
        },
        {
            "text": "“The Genetic Technology Act is fantastic news for British consumers and farmers. Precision Breeding technologies are the future of food production not just at home, but around the world, and this Act will put our nation at the forefront of this revolution."
        },
        {
            "text": "“Some 40% of crops globally are lost every year to floods, pests and other external events, and this new law will unlock our agri-biotech industry to support resilient food production for decades to come.”"
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}