{
    "url": "https://insidehmcts.blog.gov.uk/2023/03/24/helping-our-most-vulnerable-users-and-staff-with-a-new-safeguarding-policy/",
    "title": "Helping our most vulnerable users and staff with a new safeguarding policy",
    "authors": [
        "Michelle Anderson - User Accessibility Manager"
    ],
    "categories": [
        "Training and support",
        "Working at HMCTS"
    ],
    "pub_date": "2023-03-24T13:44:12+00:00",
    "content": [
        {
            "text": "Having experienced struggles with my own mental health, doing whatever I can to help improve my colleagues’, my family and my friends’ wellbeing is something I’ve always been passionate about. That’s why I jumped at the opportunity to develop the HMCTS safeguarding policy."
        },
        {
            "text": "Before my current role, I taught in prisons for 12 years, where I witnessed first-hand the consequences neglect and abuse can have on vulnerable people."
        },
        {
            "heading": 2,
            "text": "How we developed the safeguarding policy"
        },
        {
            "text": "The sentiment behind our safeguarding policy is that everyone has the right to live their lives free from abuse and neglect. We know some of the people who use our justice services are among the most vulnerable in society. After developing my knowledge through safeguarding training, I started building a toolkit so that our colleagues would have a one-stop shop for all the relevant safeguarding information."
        },
        {
            "text": "Early in the project, I involved HR and policy teams to make sure all the information was fact-checked and consistent as well as looping in the Ministry of Justice (MOJ) and trade unions."
        },
        {
            "heading": 2,
            "text": "Reaching our objectives"
        },
        {
            "text": "Building the safeguarding policy involved setting up a working group of around 25 people across HMCTS who all cared about protecting vulnerable people from abuse and neglect."
        },
        {
            "text": "Within the working group there was a lot of discussion around how we needed to help staff understand the best course of action to protect vulnerable staff and users, and we were determined to get it right."
        },
        {
            "text": "I found volunteers in an already busy organisation to take responsibility for making referrals to Local Authorities. With the help of colleagues at HMCTS we found 360 volunteers to help with safeguarding."
        },
        {
            "text": "A little over a year after starting, 16,000 members of staff at HMCTS now have access to:"
        },
        {
            "text": "Nearly half the organisation has completed the foundation learning and the rest should complete it by the end of July this year. Over two thirds of our 360 volunteers have finished higher-level learning to help them make referrals to the Local Authorities."
        },
        {
            "heading": 2,
            "text": "Seeing our safeguarding policy in action"
        },
        {
            "text": "The sense of what has been achieved by the introduction of our safeguarding policy was clear when a colleague made the first safeguarding referral."
        },
        {
            "text": "Diane (not her real name to protect identity), became aware of two children under the age of 10 who were possibly at risk from a parent who was drinking heavily during the day and neglecting care of their children. Diane made a safeguarding referral to the children’s Local Authority."
        },
        {
            "text": "As a result, Diane protected them from possible abuse and neglect."
        },
        {
            "text": "I’m incredibly proud of the work we've done to put the right measures in place for our vulnerable users and staff. Our safeguarding policy will make a difference."
        }
    ]
}