{
    "url": "https://companieshouse.blog.gov.uk/2023/03/24/how-to-object-to-a-company-being-removed-from-the-companies-house-register/",
    "title": "Objecting to a company being struck off is now easier",
    "authors": [
        "Chris Jenkins - Operational Officer"
    ],
    "categories": [
        "Company guidance"
    ],
    "pub_date": "2023-03-24T09:30:02+00:00",
    "content": [
        {
            "text": "When a company seems inactive, perhaps because it hasn't filed its confirmation statement or accounts, Companies House may take steps to remove it from the company register.  This is called being 'struck off'.  "
        },
        {
            "text": " Before a company is removed, Companies House publishes a notice in The Gazette. This gives interested parties – shareholders, employees, or creditors – 2 months to object to the company being removed. "
        },
        {
            "text": "Examples of reasons to object to the removal of a company are: "
        },
        {
            "text": "You must have evidence to support your objection, for example, invoices or bills showing the company owes you money.  "
        },
        {
            "text": "Once a company is struck off the register, its assets pass to the crown."
        },
        {
            "heading": 2,
            "text": "Following a company"
        },
        {
            "text": "If you’ve an interest in a company and would be affected by its removal from the company register, following them is a good idea. "
        },
        {
            "text": "Companies House holds the records of companies registered in the UK and provides free, searchable information to help businesses make effective decisions.   "
        },
        {
            "text": "Following a registered company means you'll receive email alerts as soon as a change is made to a company’s record, including if there is a proposal to remove the company from the register.  "
        },
        {
            "heading": 2,
            "text": "What if a company I follow is being removed from the register?  "
        },
        {
            "text": "When a company is being removed from the register, any interested parties can raise an objection to stop the company from being struck off the register while any debts are pursued.  "
        },
        {
            "heading": 2,
            "text": "What if I want to object to a company being removed?  "
        },
        {
            "text": "The quickest, safest and easiest way of objecting to the removal of a company is by using our online objection service.   "
        },
        {
            "text": "The online objection service was created for customers to make submitting objections with supporting evidence easier. All you need to do is create an account with Companies House. "
        }
    ]
}