{
    "url": "https://educationhub.blog.gov.uk/2023/03/how-supported-internships-help-young-people-learning-disabilities-gain-work-experience/",
    "title": "How supported internships help young people with learning disabilities gain work experience",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "SEND",
        "Skills"
    ],
    "pub_date": "2023-03-24T16:51:29+00:00",
    "content": [
        {
            "text": "All children and young people should be able to reach their full potential and receive the right support as they progress into adult life."
        },
        {
            "text": "That’s where supported internships come in, helping young people who have special needs or disabilities (SEND) and an Education, Health and Care (EHC) plan gain the skills they need to transition from education into paid employment."
        },
        {
            "text": "Here’s everything you need to know about supported internships."
        },
        {
            "heading": 3,
            "text": "What are supported internships and who can do one?"
        },
        {
            "text": "Supported internships are a work-based study programme for young people aged 16 to 24 who have an EHC plan. The aim is for interns to gain the skills and confidence to achieve their long-term career goals."
        },
        {
            "text": "They usually last for one year and include work placements that last at least six months. Interns are also helped by a qualified job coach who is trained to offer personalised support."
        },
        {
            "text": "Interns are enrolled by a school or college but around 70% of their learning time is in a workplace. Alongside their time on the job, interns complete a personalised study programme delivered by the school or college, which includes the chance to study for relevant qualifications, and English and maths at the right level."
        },
        {
            "text": "Once a young person has demonstrated they are ready for employment, we expect them to be supported to transition into a paid role."
        },
        {
            "heading": 3,
            "text": "Are supported interns paid?"
        },
        {
            "text": "Supported interns are not paid. This is because they are in full-time education and their work placements are part of their course."
        },
        {
            "text": "This is the same as some other qualifications which include a work placement, such as T Levels."
        },
        {
            "heading": 3,
            "text": "What kind of supported internships are available?"
        },
        {
            "text": "A wide range of employers offer supported internships. Internships could include roles in customer service, catering, housekeeping, retail and horticulture, to name just a few examples."
        },
        {
            "heading": 3,
            "text": "How to apply for a supported internship"
        },
        {
            "text": "All further education colleges, sixth form and independent specialist providers are able to offer supported internships."
        },
        {
            "text": "You should speak to the provider directly to find out what courses are available. They will also help you get on a course."
        },
        {
            "heading": 3,
            "text": "What are the benefits of supported internships?"
        },
        {
            "text": "Evidence shows that learners with EHC plans are less likely than their peers to be in sustained employment 15 years after key stage 4."
        },
        {
            "text": "Supported internships not only help interns develop the transferrable skills and knowledge needed for a paid job but can also help with improving confidence, self-esteem, and social life."
        },
        {
            "text": "There are lots of benefits for employers too. Offering supported internships helps to build a more diverse workforce, gives back to the community, and allows employers to shape a job role that suits the needs of the business."
        },
        {
            "heading": 3,
            "text": "What are you doing to develop supported internships?"
        },
        {
            "text": "We’re investing up to £18 million over the next three years to build capacity in the Supported Internships programme, aiming to double the number of placements to give more young people with an EHC plan the skills they need to kickstart their careers."
        },
        {
            "text": "We’ve also worked with our partners and stakeholders to update our guidance to providers, making sure quality internship placements are available for young people across the country."
        },
        {
            "text": "In the Spring Budget 2023, we announced funding of £3 million to pilot extending Supported Internship to young people without EHC plans, to see whether learners with learning difficulties and disabilities but without an EHC plan can also benefit from the programme."
        }
    ]
}