{
    "url": "https://deframedia.blog.gov.uk/2023/03/24/media-reporting-on-peat-ban-for-the-professional-horticulture-sector/",
    "title": "Media reporting on peat-ban for the professional Horticulture sector",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Weekly stories"
    ],
    "pub_date": "2023-03-24T20:10:44+00:00",
    "content": [
        {
            "text": "There has been news reporting of our ban on horticultural peat. In 2011 we agreed to a voluntary phase out of the sale of peat and peat-containing products by 2020, and repeatedly stated that we would legislate if this was not successful. While progress was made, the industry transition has been too slow. Therefore, in August 2022, we announced a ban on the sale of peat and peat-containing products in the retail horticultural sector by 2024."
        },
        {
            "text": "The retail sector accounts for 70% of peat sold in the UK. The professional sector also utilises peat to grow some food products and plants ranging from oaks to rarer species. There are already many peat alternatives on the market including bark, coir, bracken which have been well adopted in the amateur sector. Defra has jointly funded research with the industry on peat replacements in professional horticulture, the results of which are promising. Indeed sectors such as strawberries and other soft fruit growers have already transitioned away from peat-based growing media."
        },
        {
            "text": "However, the sector has raised concerns about the widespread availability of these products. This week we set out further details to the professional horticultural sector and our expectations for a phased reduction in the use of peat with a date of 2026 - allowing for certain technical exemptions – with a complete ban from 2030."
        },
        {
            "text": "A phased approach will enable professional horticulture businesses to conduct further commercial scale trials to identify suitable peat-free growing media, in particular for challenging plants, allow time for adaptation and replacement of commercial growing systems and to allow plants already started in a peat containing growing media to work their way through the supply chain."
        },
        {
            "text": "The exemptions include:"
        },
        {
            "text": "At all times we have considered the views of stakeholders on both sides of the argument, seeking to protect our precious peatlands, our largest carbon store, while acknowledging the difficulties the industry face in making such a change."
        },
        {
            "text": "A Defra spokesperson said:"
        },
        {
            "text": "Read our peat action plan."
        }
    ]
}