{
    "url": "https://environmentagency.blog.gov.uk/2023/03/24/simple-checks-with-potential-for-big-change/",
    "title": "Simple checks with potential for big change",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Waste"
    ],
    "pub_date": "2023-03-24T13:28:41+00:00",
    "content": [
        {
            "text": "Do you wonder what happens to the rubbish generated in your home once it’s gone?"
        },
        {
            "text": "We all have a responsibility to make sure our waste isn’t fly tipped, doesn’t cause pollution, or harm to people, and this is outlined in the law under the  Waste Duty of Care Code of Practice. Most household rubbish gets collected by our local councils as part of their kerbside waste collection services; but what about when you have other – bigger items to dispose of that can’t be put in your bin?"
        },
        {
            "text": "This is when you need to be extra careful to be sure you’re not passing your waste into the hands of someone who does not know what they are doing, or worse, doesn’t care – a waste criminal. These people have no conscience. Their principal aim is to make money, avoiding the environmental regulations put in place to protect our communities, homes, and the greenspaces we and future generations depend on for a healthy, happy life."
        },
        {
            "text": "These days, it’s easy to search for services online, including on social media. Waste criminals know this and utilise social media and online sales platforms to advertise their bogus waste collection services. It’s seemingly so easy. Say for example, you have an old fridge freezer that needs taking away, but it doesn’t fit in your car, so finding a waste collection service online appears to be the perfect solution. It could be fine, but just to be sure it’s not going to end up dumped in a field, playpark, or country lane, there are three simple checks you should make:"
        },
        {
            "text": "It’s not just social media and online sales platforms where you need to be careful. It’s also waste collection mobile apps that act as a platform to connect people who have rubbish to dispose of, with a waste collector. Often those running the waste collection mobile apps make no checks on the waste collection services they advertise and won’t know if your waste has been taken to a legal waste site, despite claiming otherwise."
        },
        {
            "text": "You might also see adverts in your local paper or community magazines for ‘a man with a van’. Beware of these too and apply the same checks."
        },
        {
            "text": "Waste criminals can start small on their own with just a van, but they can quickly grow their business resulting in thousands of tonnes of waste being collected and illegally dumped, causing damage to neighbouring communities and our environment. At the worst end, criminal gangs infiltrate the legitimate waste industry, adding waste crime to their list of other offences, including, drug dealing, firearms, fraud, modern day slavery, and human trafficking."
        },
        {
            "text": "Enough waste is illegally managed every year to fill Wembley Stadium 30 times, costing the economy and the public in England an estimated £1 billion per year.  We want to get to a place where no waste is illegally managed, meaning taxpayers money that is currently needed to stop these criminals, can be redirected."
        },
        {
            "text": "For that to happen, it’s important that we all take action to prevent our rubbish being illegally disposed of."
        },
        {
            "text": "While we continue to work to influence change in the law to reduce the opportunity for waste crime and find and hold those responsible to account, the simple checks you can make have the potential to lead to big changes with big positive impacts for our environment and the economy."
        },
        {
            "text": "Next time you need to find a waste collector, or ‘a man with a van’ or hire a skip – remember to check they’re a registered waste carrier before you use them."
        },
        {
            "text": "Visit gov.uk to find out what to do with all types of household waste: Dispose of household waste - GOV.UK (www.gov.uk)"
        },
        {
            "text": "Dee Naylor              "
        },
        {
            "text": "Advisor – Carriers, Brokers & Dealers"
        },
        {
            "text": "Waste and Industry Regulatory Services"
        }
    ]
}