{
    "url": "https://childrenssocialcare.blog.gov.uk/2023/03/24/starting-a-career-in-childrens-social-work/",
    "title": "Starting a career in children's social work",
    "authors": [
        "Natalie - Step Up graduate"
    ],
    "categories": [
        "Leadership",
        "Social Work Week",
        "Step Up to Social Work",
        "Uncategorized",
        "World Social Work Day"
    ],
    "pub_date": "2023-03-24T13:05:56+00:00",
    "content": [
        {
            "text": "Step Up to Social Work is a full-time training programme for talented graduates and career changers to become the next generation of child and family social workers supporting vulnerable children, young people and families."
        },
        {
            "text": "Natalie qualified as a social worker in April 2021, after completing the programme. "
        },
        {
            "text": "I worked in a refuge for one year before joining the Step Up to Social Work programme and prior to that I had been in a primary school for a decade. My last role in the school was in safeguarding, where the Designated Safeguarding Lead told me about Step Up. We had both said we would apply next cohort, and I did!"
        },
        {
            "text": "Although there are sometimes wider issues with resources that can make things challenging, I do really love working in my local authority. I feel really valued and there’s opportunity for my ideas and thoughts to be taken forward, which really works for me as I’m very outspoken and I’m given the space to my authentic self."
        },
        {
            "text": "The programme, although fast paced, really places you in good stead to practice as a social worker. I already want my son to join it in the future! In my Step Up programme cohort there were people from all different fields, with so many different skills, so we learnt a lot from each other too. These skills were all transferable and applicable to social work too."
        },
        {
            "text": "My first placement was supporting young people to leave children’s social care, which I am currently working in, and my second placement was with children with disabilities. I found my second placement quite tough at some points but thankfully I had a great team manager who helped me through the tougher times and I felt like I could lean on them for support when I needed it.  As a student you may not always feel confident to speak up but it’s so important to make sure you do. You will constantly be advocating for your young people and families so make sure you also do for yourself!"
        },
        {
            "text": "I learnt loads in both placements and found it really tricky to choose which pathway to pursue, but finally – after some support from my university teacher who encouraged me to go with my passion – landed on working with care leavers."
        },
        {
            "text": "At times the job can be overwhelming but if can also be really rewarding. I am someone who gives me all in my job so learning my boundaries was really important."
        },
        {
            "text": "My key piece of advice to graduates of the programme or those looking to apply, is to talk to everyone and get as many shadowing opportunities as possible. Lean on your peers too - I am in a service with two others from the Step-Up cohort and our friendship is invaluable."
        },
        {
            "text": "You can also read Isaac's story about his Step Up to Social Work journey. "
        },
        {
            "text": "Further information"
        },
        {
            "text": "The Step Up to Social Work programme is an opportunity to receive support while you are training to start a new career in social work."
        },
        {
            "text": "On the 14-month training programme, you will receive hands-on experience of working in a real-life social work role through placements in a local authority whilst undertaking your qualification. Once you’ve successfully completed the course, you’ll be awarded a Postgraduate Diploma in Social Work enabling you to apply to register and practice as a social worker."
        },
        {
            "text": "The Department for Education covers the cost of your university tuition on the programme and provides a tax-free bursary of £19,833 to support you during your training."
        },
        {
            "text": "Applications are currently open for 2024 – head to Home | Step Up to Social Work (pocketrecruiter.com) for more information"
        },
        {
            "text": "Further information about how you can become and child and family social worker is on the Education Hub."
        }
    ]
}