{
    "url": "https://dcmslibraries.blog.gov.uk/2023/03/24/swiss-cottage-library-low-carbon-retrofit-using-public-sector-decarbonisation-scheme/",
    "title": "Swiss Cottage Library – Low carbon retrofit using public sector decarbonisation scheme",
    "authors": [
        "Qasim Akhtar – London Borough of Camden"
    ],
    "categories": [
        "Case study",
        "Library design"
    ],
    "pub_date": "2023-03-24T12:40:07+00:00",
    "content": [
        {
            "text": "To coincide with CILIP's Green Libraries Conference on 24 March 2023, we are sharing this case study from Camden libraries."
        },
        {
            "text": "Swiss Cottage Library"
        },
        {
            "text": "Swiss Cottage Library is seen by many as a masterpiece among London’s civic buildings and was designed by Sir Basil Spence, opening to the public in 1964. The library which is 52,506 square feet, is an important community hub, event space and the largest library operated by Camden Council."
        },
        {
            "text": "The library needed renewal with fabric, mechanical and electrical infrastructure being at end of life, leading to poor internal conditioning of the building and high levels of heat loss.  This combined with the knowledge that the library is also one of the largest consumers of energy on the council’s estate, made it a priority site for improvement. With the inception of the Public Sector Decarbonisation Scheme (PSDS) it was an ideal time for the council to deliver improvements that would secure the site’s future whilst also looking to introduce low carbon technologies to meet the council’s commitment to do everything it can to make Camden Net Zero by 2030."
        },
        {
            "text": "Over a 2-year period, the council designed and delivered a project that would improve energy efficiency, decarbonise the heating source and address fabric repairs at the library. The £3.2 million project was delivered in two phases attracting 1.4 million of funding from PSDS 1 and PSDS 3a. The first phase focused on the upgrade of all existing florescent lighting to LED lighting and the upgrade of existing single-glazed windows and north lights to high quality double glazing. The second phase of works included the installation of  an Air Source Heat Pump which is now the primary heat source to the building, whilst internal wall and roof insulation and new air handling units with heat recovery were also introduced to reduce heat loss. The project is predicted to make significant savings to the council’s running costs at more than £31,000 a year whilst also delivering annual carbon savings of 138 tonnes of CO2e."
        },
        {
            "text": "The funding from PSDS has enabled the council to go beyond a like for like replacement solution and deliver a project that has holistically aimed to improve the building fabric before transitioning to a low carbon heating technology . This would not have been possible without the funding that was made available from the PSDS fund, with council budgets continuing to be stretched. The project will ensure that building users will have better comfort levels and will ensure that it remains an important hub for use by the local community.  The project is also being used a blueprint for future low carbon retrofits that the council is planning across its corporate estate."
        },
        {
            "text": " "
        },
        {
            "text": "Insights into challenges and successes faced by the grant recipient during project delivery."
        },
        {
            "text": "Advice for future applicants"
        },
        {
            "text": "Next steps"
        },
        {
            "text": "Camden Council are now looking at similar projects at Highgate and West Hampstead Libraries"
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}