{
    "url": "https://defrafmp.blog.gov.uk/2025/08/19/king-scallop-implementation-group-transparency-and-updates/",
    "title": "King Scallop Implementation Group: transparency and updates",
    "authors": [
        "Katie Haldenby - Policy Advisor, Defra"
    ],
    "categories": [
        "- Defra led FMPs",
        "Implementation"
    ],
    "pub_date": "2025-08-19T15:05:34+01:00",
    "content": [
        {
            "text": "The King Scallop FMP Implementation Group (KSIG) has been set up to support the delivery of objectives and actions in the published king scallop FMP."
        },
        {
            "text": "We are happy to share the minutes from our meetings on our new GOV.UK page: King Scallop Implementation Group meeting minutes"
        },
        {
            "heading": 2,
            "text": "Who is involved?"
        },
        {
            "text": "The group is made up of around 20 members from across the fishing industry, policy makers, regulators and environmental representatives."
        },
        {
            "text": "Members are selected by Defra based on their involvement and experience in the UK scallop fishery, their commitment to progressing the actions within the FMP and their ability to reach out to wider stakeholders."
        },
        {
            "text": "OPPORTUNITY- We are currently looking for four new members to join us - find the details at the end of the post."
        },
        {
            "heading": 2,
            "text": "How does the group work?"
        },
        {
            "text": "The group will make recommendations to Defra on how to progress the actions in the FMP."
        },
        {
            "text": "As the Fisheries Authority, Defra will then make final decisions in the context of the Fisheries Act 2020 objectives, the Joint Fisheries Statement (JFS) policies, and the principles set out in the Environment Act 2021."
        },
        {
            "text": "To help the KSIG reach its goals, smaller teams known as 'task-and-finish' groups are formed to focus on the specific actions mentioned in the king scallop FMP. These teams will gather information from both KSIG and other stakeholders to make sure that different viewpoints are considered, along with scientific evidence."
        },
        {
            "text": "The FMP also covers Welsh waters, and the Welsh Government have established a Welsh King Scallop Advisory Group. The groups will update each other. Minutes from the Welsh group can be found here."
        },
        {
            "heading": 2,
            "text": "What did the first few meetings cover?"
        },
        {
            "text": "You can find the full meeting minutes on GOV.UK but here’s a quick summary for the first three meetings."
        },
        {
            "text": "The group first met in December 2024.  Members agreed the purpose and scope of the group would be to oversee and support progress on the FMP. Updates were shared on work delivered since the FMP was published, along with plans for future meetings."
        },
        {
            "text": "In February 2025, research on ‘the scallop group landscape’ was presented. This maps out stakeholder groups across the sector and how they work together. This information will help with delivering the FMP and improving communications and transparency. "
        },
        {
            "text": "Members discussed a paper from Seafish that identifies existing scallop management measures in UK waters and potential areas for harmonisation. This was an action under objective four of the FMP. This report will be used to inform the development of future management measures."
        },
        {
            "text": "In May 2025, Seafish presented findings on how similar fisheries across the world use harvest control rules. Harvest control rules provide a framework for making fisheries management decisions for example, when a closure should be used to achieve the long term goals the sustainable management of the fishery. This will be used to inform future harvest control rules for England."
        },
        {
            "heading": 2,
            "text": "What’s coming up?"
        },
        {
            "text": "A new task-and-finish group has been set up to work on narrowing down options of possible management approaches."
        },
        {
            "text": "The group will use a report that the Centre for Fisheries and Aquaculture Science (Cefas) has shared with them which investigates approaches using input and output controls."
        },
        {
            "text": "Defra will take the group’s preferred options into consideration when proposing a new approach to managing the king scallop fishery."
        },
        {
            "heading": 2,
            "text": "Want to get involved?"
        },
        {
            "text": "We currently have four open places on the group:"
        },
        {
            "text": "If you would like to be considered, please get in touch for more information about joining. Email us at shellfish@defra.gov.uk"
        }
    ]
}