{
    "url": "https://phescreening.blog.gov.uk/2021/08/11/launch-of-new-nhs-scid-screening-resources-for-parents-and-professionals/",
    "title": "Launch of new NHS SCID screening resources for parents and professionals",
    "authors": [
        "Lucy Pylypiw",
        "Andrew Anderson"
    ],
    "categories": [
        "NHS Newborn Blood Spot Screening Programme"
    ],
    "pub_date": "2021-08-11T13:41:44+01:00",
    "content": [
        {
            "text": "We’re pleased to announce publication of new resources to support the evaluation of screening for severe combined immunodeficiency (SCID) in England."
        },
        {
            "text": "The evaluation, due to launch on 6 September 2021, will help to determine whether screening for SCID works in practice as part of the NHS Newborn Blood Spot (NBS) Screening Programme."
        },
        {
            "text": "The evaluation will initially run for 2 years, covering around two-thirds of the newborn population of England. It will continue to run in a third year while the results are used to make a recommendation on whether or not it should be implemented nationally."
        },
        {
            "heading": 2,
            "text": "Developing the resources"
        },
        {
            "text": "To prepare for the evaluation, a working group looked at the types of information needed to support:"
        },
        {
            "text": "A rigorous process was followed to identify, develop, test and deliver these resources for parents and professionals."
        },
        {
            "heading": 2,
            "text": "Information for parents"
        },
        {
            "text": "We ran 2 focus groups to get the views of new parents on early drafts of the SCID parent and carer information."
        },
        {
            "text": "Their feedback was invaluable and helped us to improve the information."
        },
        {
            "text": "SCID screening: helping you decide if you want this for your baby helps parents and carers to make an informed choice about SCID screening for their baby."
        },
        {
            "text": "Maternity services should use the digital version of STFYAYB by default, and this is also the case for the SCID information. Printed versions of SCID information should only be given to women who cannot access it digitally."
        },
        {
            "text": "A plain A4 PDF version of the SCID information is available to print out for people who cannot access it digitally. You can find it under the ‘NHS antenatal and newborn screening programmes’ heading."
        },
        {
            "text": "Services can order small quantities of the printed SCID information via the PHE Screening print ordering portal. (Search for ‘SCID01’). We will be limiting orders to a maximum of 10% of invitations."
        },
        {
            "text": "To help improve accessibility, translations of the SCID leaflet are available in Arabic, Bengali, Chinese, French, Latvian, Lithuanian, Polish, Portuguese, Punjabi, Romanian, Somali and Urdu."
        },
        {
            "text": "An easy read version will be available soon. It will sit alongside the existing 8 easy read guides which explain the screening tests offered during and after pregnancy for people with learning disabilities."
        },
        {
            "heading": 2,
            "text": "Information for professionals"
        },
        {
            "text": "A huge amount of work has gone into delivering training and developing resources for professionals. Training has included workshops covering all aspects of the SCID evaluation."
        },
        {
            "heading": 3,
            "text": "Offering screening for SCID"
        },
        {
            "text": "If you are a health professional who will make the offer of SCID screening to parents and carers, you can now access:"
        },
        {
            "text": "The crib sheet for blood spot takers can be printed directly and is orderable in small quantities from the PHE Screening print ordering portal (search for ‘SCID02’)."
        },
        {
            "text": "We recently sent training slides and a question and answer document from the SCID screening professional workshops to everyone who took part. The training slides included information on the pathway for babies born before 37 weeks and in hospital. Please contact the PHE screening helpdesk if you would like a copy sending."
        },
        {
            "heading": 3,
            "text": "Child health letter templates"
        },
        {
            "text": "If you work in child health information services, updated NBS results letter templates are available for sending screening results to parents. Copies have been emailed directly to providers in advance of them being officially launched, so services had time to set them up on their systems."
        },
        {
            "text": "Please contact the PHE Screening helpdesk if you have not received copies, and you need them. These will be published on the NBS screening results to parents templates page later this month."
        },
        {
            "heading": 2,
            "text": "Blood spot takers "
        },
        {
            "text": "Blood spot takers in SCID screening areas need to begin offering SCID screening from Friday 27 August 2021."
        },
        {
            "text": "More detailed information for blood spot takers will be published in a future blog article."
        },
        {
            "heading": 2,
            "text": "Your feedback"
        },
        {
            "text": "We really need your feedback on the resources to help make the evaluation a success. If you have any comments please contact us at the PHE Screening helpdesk."
        },
        {
            "text": "As always, keep an eye on articles with the SCID tag on the PHE Screening blog ahead of launch."
        },
        {
            "heading": 2,
            "text": "PHE Screening blog"
        },
        {
            "text": "The PHE Screening blog provides up to date news from all NHS screening programmes. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new blogs. If you have any questions about this blog article, or about population screening in England, please contact the PHE screening helpdesk."
        }
    ]
}