{
    "url": "https://hmlandregistry.blog.gov.uk/2021/08/11/making-our-webinars-accessible-by-default/",
    "title": "Making our webinars accessible by default",
    "authors": [
        "Joe Douglass"
    ],
    "categories": [
        "Digital services"
    ],
    "pub_date": "2021-08-11T16:10:27+01:00",
    "content": [
        {
            "text": "I joined HM Land Registry as a Registration Officer in October 2016. I've since worked in a variety of roles and supported my local office, Peterborough, in promoting diversity and inclusion and health and wellbeing."
        },
        {
            "text": "I've championed inclusion throughout the past 5 years and I thought I had a good understanding of the accessibility challenges colleagues and customers face. However, my latest role as a Customer Training Executive has been eye opening for myself and my team in appreciating the many different accessibility requirements for customers and colleagues - and there is much more to learn!"
        },
        {
            "heading": 2,
            "text": "The Customer Training Team "
        },
        {
            "text": "The Customer Training Team is part of the Customer Division of HM Land Registry. We create and deliver training materials to our external customers."
        },
        {
            "text": "We mainly share our material through our webinars which cover a variety of registration topics, new HM Land Registry services and changes to existing practice. You can also find our guidance videos on YouTube, and we’re launching a podcast in the coming months."
        },
        {
            "heading": 2,
            "text": "Improving accessibility"
        },
        {
            "text": "We have a dedicated project to improve the accessibility of our training services. Before my first webinar, we did not have a live captioning function, and I soon received feedback from customers who are D/deaf or hard of hearing that were not able to follow our webinars. While webinars were a benefit for customers with sight loss, it was then apparent that other groups of our customers could not take part."
        },
        {
            "text": "Having just one customer unable to participate in a webinar, was one too many and I wanted to focus on making our webinars accessible for all."
        },
        {
            "heading": 2,
            "text": "How we've improved our webinars"
        },
        {
            "text": "We now have regular discussions with our HM Land Registry Disabled Employee Network (DEN), User Research group, diversity and inclusion leads and network with the Government Accessibility Community. This ensures our services meet the latest accessibility standards and keeps us informed on best practices."
        },
        {
            "text": "We've implemented several measures in our webinars to improve accessibility. This is just the beginning and we know we have a long way to go but we are on the right path."
        },
        {
            "text": "Our webinars:"
        },
        {
            "text": "In all forms of work and leisure we should have ‘accessibility by default’. I cannot take credit for the title of this blog, as it was a theme highlighted by an attendee of a brilliant Civil Service Live talk called ‘Think Inclusion: Communicating with all’, but it really did strike a chord with me. I firmly believe and advocate that no matter what your background is, we all have the right to be able to access the same services, accessibility should be built in from the start by default."
        }
    ]
}