{
    "url": "https://space.blog.gov.uk/2021/08/11/space-technology-helps-boost-dam-safety/",
    "title": "Space technology helps boost dam safety",
    "authors": [
        "DAMSAT team"
    ],
    "categories": [
        "Earth from space",
        "Earth observation",
        "International Partnership Programme"
    ],
    "pub_date": "2021-08-11T16:55:11+01:00",
    "content": [
        {
            "text": "Space technology is not all about exploring the far reaches of the galaxy, but also has huge potential to help us with problems closer to home."
        },
        {
            "text": "A good example is new tech developed to improve dam safety and built with UK Space Agency funding. The system, called DAMSAT, was developed by Oxfordshire-based HR Wallingford, and has just finished its final trials in the Peruvian Andes."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "What’s the problem?"
        },
        {
            "text": "Dams can be a big issue. They’re often in far-flung locations and many are in countries that don’t have the resources to monitor them effectively."
        },
        {
            "text": "Dams come in two major varieties: water dams and tailings dams. Water dams are used to create reservoirs to store the water we use in our homes, for farming, hydropower, leisure and in industry, whilst tailings dams are vital for storing the sludge-like waste from mining."
        },
        {
            "text": "There are fewer tailings dams, but history shows us that statistically they are more likely to fail."
        },
        {
            "text": "When dams are not monitored effectively it can be a recipe for disaster. Dam failure results in catastrophes such as the one at the Brazilian Brumadinho dam in 2019, which released 12 million cubic metres of mining waste, killing around 300 people."
        },
        {
            "text": "And we had recent a near miss in the UK at the Toddbrook Reservoir above the Derbyshire town of Whaley Bridge in 2019."
        },
        {
            "heading": 3,
            "text": "How can space technology help? "
        },
        {
            "text": "Satellite technology offers new solutions to dam monitoring challenges and can be used to build apps that give early warnings about potential problems. Importantly, these apps can be cheaper and require less expertise than existing methods, making them an accessible solution for dam owners and regulators worldwide."
        },
        {
            "text": "DAMSAT is exactly this kind of system and is able to analyse the past, monitor the present, and predict the future."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "How does it work?"
        },
        {
            "text": "The system compares current and past satellite images to spot dangerous movement and indicators of leakage."
        },
        {
            "text": "Using weather forecasts, DAMSAT also looks at how heavy rainfall changes the level of reservoirs and the stresses that heavy weather puts on dams. And it also shows the possible impacts on people and infrastructure if there is a dam breach, which can greatly aid emergency planning."
        },
        {
            "text": "After its development, DAMSAT was successfully tested on 31 dams in the Peruvian Andes. Peru was a great choice to test the new system as the country has a long history of mining. It has some of the largest reserves in the world of many metals including silver, zinc and gold and the largest reserves of any country in South America."
        },
        {
            "text": "Abandoned and illegal mines are a major problem in Peru, and cause real issues with monitoring."
        },
        {
            "heading": 3,
            "text": "So, what’s next for DAMSAT? "
        },
        {
            "text": "Given the success of the trials, DAMSAT is now available for commercial use, for both tailings and water dams."
        },
        {
            "text": "Systems are currently under construction for all of the large reservoirs belonging to a major UK water company, and for other dam owners globally."
        },
        {
            "text": "It’s hoped that this cutting-edge technology will increase the effectiveness and drive down the costs of dam monitoring, particularly important in some of the world’s most underdeveloped nations."
        },
        {
            "text": "And, if this aim can be achieved, then space technology will have played a major part in averting tragedies on the scale of Brumadinho in the future."
        },
        {
            "text": "Find out more."
        },
        {
            "text": "DAMSAT is supported by the UK Space Agency’s International Partnership Programme (IPP) and funded through the Global Challenges Research Fund (GCRF). "
        }
    ]
}