{
    "url": "https://educationhub.blog.gov.uk/2021/08/what-medical-and-dentistry-school-students-need-to-know-about-the-incentivised-transfer-scheme/",
    "title": "What medical and dentistry school students need to know about the Incentivised Transfer Scheme",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Universities"
    ],
    "pub_date": "2021-08-11T16:11:55+01:00",
    "content": [
        {
            "text": "If you are eligible, your university will get in touch with you about a generous £10,000 incentive to change schools under the 2021 Medical and Dentistry School Student Incentivised Transfer Scheme."
        },
        {
            "text": "Here we outline what this means and answer key questions."
        },
        {
            "heading": 3,
            "text": "What is the Medical and Dentistry School Student Incentivised Transfer Scheme?"
        },
        {
            "text": "The Medical and Dentistry School Student Incentivised Transfer Scheme is a system that has been introduced to support universities who are oversubscribed due to the popularity in medicine and dentistry this year."
        },
        {
            "text": "The scheme offers a £10,000 incentive to students who hold a place at an oversubscribed university with the option to change schools."
        },
        {
            "heading": 3,
            "text": "I’ve received an Incentivised Transfer Scheme letter, what does this mean for me?"
        },
        {
            "text": "If you’ve been sent a letter, it means you are holding a firm offer at an oversubscribed university."
        },
        {
            "text": "Places for this scheme will only be available until the Tuesday 17 August at 8.30 am. After this point, no further incentivised transfers can take place under the programme. However, places may go quickly so we would encourage you to engage early if you are interested in transferring."
        },
        {
            "heading": 3,
            "text": "Does this apply for UK or overseas students?"
        },
        {
            "text": "No. Overseas students are not eligible."
        },
        {
            "text": "The scheme is only open to UK students who hold a place at a universities in England. Students domiciled in Scotland, Wales and N Ireland who have firm offers at over-subscribed English medical and dentistry schools are able to use the scheme."
        },
        {
            "heading": 3,
            "text": "I haven’t met my offer, can I still take part in the transfer scheme?"
        },
        {
            "text": "No, the scheme is only open to students that have met the conditions of their offer and hold a firm or insurance offer at an over-subscribed medical or dentistry school and cannot yet be accommodated. Receiving universities will check that they only accept eligible students."
        },
        {
            "heading": 3,
            "text": "Can I transfer if I have not been invited to do so by the university where I hold a firm offer?"
        },
        {
            "text": "No. The scheme is only available to students with offers from universities that do not have the capacity to accommodate all offer holders in 2021-22. Receiving universities will check that they only accept eligible students."
        },
        {
            "heading": 3,
            "text": "Can I transfer to any university with a medical and dentistry school?"
        },
        {
            "text": "No. Not all universities are able to accept students on transfer. Places for transfer are only available at institutions that have the capacity to expand and have been permitted by the Regulator to accept a certain number of students above the usual limits. The list of available places will be provided to you for your consideration."
        },
        {
            "heading": 3,
            "text": "Am I guaranteed a space on this scheme?"
        },
        {
            "text": "Please be aware that capacity is limited and not all applications will be successful so make sure to consider the offer and respond promptly."
        },
        {
            "heading": 3,
            "text": "Can anyone who wants an incentivised move get one?"
        },
        {
            "text": "No. Unfortunately this is a limited scheme and not all students who wish to transfer and receive the incentive may be able to do so within the limits of the scheme. Priority order will be determined by those the receiving provider approves first. This does not necessarily mean those students first to register but we do recommend that students act quickly, after getting suitable advice."
        },
        {
            "heading": 3,
            "text": "I am waiting for an appeal and held a place at one of the oversubscribed institutions, am I eligible?"
        },
        {
            "text": "No the scheme is only open until 17 August. Students with appeals underway should speak to the institution that they were holding a place with for further information."
        },
        {
            "heading": 3,
            "text": "Where does the money from the £10,000 come from?"
        },
        {
            "text": "This funding will come from the Government and your oversubscribed school."
        },
        {
            "heading": 3,
            "text": "When will I receive the £10,000?"
        },
        {
            "text": "At the beginning of term, after you have registered at the new medical school."
        },
        {
            "heading": 3,
            "text": "I thought places were available to transfer to a certain university and they have gone, what happened? "
        },
        {
            "text": "An updated list will be sent mid-way through the transfer process to keep you updated as to availability."
        },
        {
            "heading": 3,
            "text": "What if I don’t want to transfer? "
        },
        {
            "text": "Students are not obliged to transfer to another university, this is an optional scheme. Please contact your original institution to confirm your place."
        },
        {
            "heading": 3,
            "text": "Is there any incentive to defer for a year instead?"
        },
        {
            "text": "The university with which you hold your firm place will be able to advise on any incentives they are offering if you’d prefer to defer for a year."
        }
    ]
}