{
    "url": "https://moderncivilservice.blog.gov.uk/2025/12/17/celebrating-excellent-science-advice-at-the-heart-of-decision-making/",
    "title": "Celebrating excellent science advice at the heart of decision making",
    "authors": [
        "Government Reform"
    ],
    "categories": [
        "A Modern Civil Service",
        "Ambitious",
        "Capability",
        "Data science",
        "Digital and data",
        "Innovation",
        "Policy",
        "Professional Networks",
        "Proud Civil Servant",
        "Skilled"
    ],
    "pub_date": "2025-12-17T09:57:04+00:00",
    "content": [
        {
            "text": "A guest blog from Professor Dame Angela McLean, Government Chief Scientific Adviser and Head of the Government Science and Engineering Profession."
        },
        {
            "text": "As Government Chief Scientific Adviser, I am privileged to witness the remarkable impact that science advice has on the decisions shaping our society. Every day, scientists, both within government and across the wider research community, contribute insights that help us address complex challenges, from public health through economic growth to environmental sustainability. "
        },
        {
            "text": "Science advice is important for effective government decision making. From shaping responses to national emergencies to informing long-term strategies on climate, technology and health, scientific insights ensure decisions are grounded in evidence – and we recognise the people and work that make this possible. "
        },
        {
            "text": "Numerous groups and individuals, such as the Scientific Advisory Group for Emergencies, the Council for Science and Technology, and the Met Office, work to ensure science is at the forefront of the government’s thinking."
        },
        {
            "heading": 2,
            "text": "Science advice in action"
        },
        {
            "text": "Earlier this year, the Council for Science and Technology supplied evidence to support measures in the 10 Year Health Plan for England around improving the nation’s health through primary prevention – taking action before any problems appear. The Council’s letter to the Prime Minister put emphasis on primary prevention – with the aim of reducing conditions such as cardiovascular disease and type 2 diabetes. "
        },
        {
            "text": "For a major disease outbreak or the unexpected, such as the closure of airspace from a volcanic eruption, the Scientific Advisory Group for Emergencies – or SAGE – will convene. During the Covid-19 pandemic, it met around a hundred times. SAGE made a real difference because it gave us the information we needed to try and prevent spread in the first waves of the pandemic and it also allowed us to introduce the testing, the treatment and eventually the vaccines, which allowed us to get on top of Covid-19 and reduce the threat."
        },
        {
            "text": "Scientific advice from the Met Office also plays an important role within government. Modelling and data, from satellite observations in space and equipment on the ground, is essential for predicting weather and the impact of climate change – which is increasing the number of extreme weather events such as heatwaves or flooding. This helps us as a country and a community build resilience to those events, for instance by ensuring the rail network can cope with landslides from a heavy rainfall or that roads can cope with flash flooding."
        },
        {
            "heading": 3,
            "text": "Let’s celebrate science advice together"
        },
        {
            "text": "These and many other examples demonstrate why we at the Government Office for Science are taking the time to celebrate the people that provide excellent science advice right at the heart of decision making, helping to shape the decisions that improve lives across the UK."
        },
        {
            "text": "Whether you work in government, research, business, or simply are interested in how science advice is shaping policy, we want you to get involved. Find out how a wide range of scientists and engineers, both inside and outside government, are sharing their insights. Follow us on LinkedIn and share your great examples of excellent science advice in action using #CelebratingScienceAdvice."
        }
    ]
}