{
    "url": "https://mattersoftesting.blog.gov.uk/completing-your-mot-training-and-assessment/",
    "title": "Completing your MOT training and assessment",
    "authors": [
        "Grant Thunder"
    ],
    "categories": [
        "Annual training and assessment",
        "MOT testing service",
        "News and updates"
    ],
    "pub_date": "2025-12-17T13:00:22+00:00",
    "content": [
        {
            "text": "The 31 March deadline for MOT Training and Assessment is approaching. Here's what you need to know to get it done. "
        },
        {
            "text": "Each year we’ve seen a year-on-year increase in the number of testers completing their annual training and assessment on time. Let’s keep this trend going so, to help you, we’ve put together the information you need to help you along the way.  "
        },
        {
            "heading": 3,
            "text": "Completing your training  "
        },
        {
            "text": "You need to complete 3 hours of training before you can take your annual assessment. The good news is you can do this however it suits you. You can spread it across the year or tackle it in chunks. "
        },
        {
            "text": "If you've still got 3 hours to do, an hour a month between now and March will get you there comfortably. Don’t forget that some parts of your normal work can contribute to your training, such as, reading MOT special notices and the MOT inspection manuals to taking part in a group question and answer session with your colleagues.  "
        },
        {
            "text": "You must also study set topics for the year, based on what we’ve identified from our testing data in the MOT Training and Assessment Guidance.  "
        },
        {
            "heading": 3,
            "text": "Keeping a training log  "
        },
        {
            "text": "To pass the annual training and assessment you must keep an electronic training log on your MTS profile. You see this under ‘View annual training log’ on your profile.    "
        },
        {
            "text": " It needs to show:  "
        },
        {
            "text": "You will not be able to log the previous year’s training, so please make sure that you log all training before the year ends.  "
        },
        {
            "heading": 3,
            "text": "Sitting your assessment  "
        },
        {
            "text": "It’s online, so you can do it from home, the workplace, or through your training provider. The test consists of 30 multiple-choice questions, and you have 1 hour to complete the assessment.  "
        },
        {
            "text": "We’ve provided a list of the types of questions you’ll be asked for Group A (class 1 & 2) and for Group B (class 3, 4, 5 & 7) to help you prepare before you take the assessment. "
        },
        {
            "text": "DVSA choose the topics that evidence tells us should be most useful for testers. We use a range of evidence to that we gather through our work to make sure its relevant to testers.  "
        },
        {
            "text": "There are several factors that feed into our this which includes: "
        },
        {
            "text": "You can use your notes and the MOT inspection manual during the assessment and the pass mark is 80%, but you can take it again if you don’t pass on the first attempt. There’s further information about the annual assessment on GOV.UK.  "
        },
        {
            "text": "Your assessment provider will upload your results for you.   "
        },
        {
            "heading": 3,
            "text": "Remember to maintain your status to test  "
        },
        {
            "text": "When you complete your annual assessment, please check that the result is showing within the ‘view annual assessment certificates’ page of your profile on MTS, if it is not, please contact your assessment provider.  "
        },
        {
            "text": "If you’re not able to complete your training and assessment on time or your annual assessment result is not showing within MTS before the deadline, you will lose your ability to test. If you then wish to regain your testing status, the details of how to do so are at “return to MOT testing.”  "
        },
        {
            "heading": 3,
            "text": "For Authorised Examiners and Site Managers "
        },
        {
            "text": "From early next year, you'll be able to download and check your testers' training logs and assessment certificates directly from MTS. "
        },
        {
            "text": "Authorised Examiners (AE, AEDM, AED, AEP) can do this by selecting the authorisation on the homepage of their MTS account and selecting ‘Testers’ annual assessments’ or ‘Testers’ training logs’, this will show the information for all sites within the authorisation. You can also look at individual sites within your authorisation by selecting the site and viewing the ‘Testers’ annual assessments’ or ‘Testers’ training logs’ pages. "
        },
        {
            "text": "Site Managers can access this information by selecting their site from their MTS account home page then selecting either ‘Testers’ annual assessments’ or ‘Testers’ annual training logs’, and downloading the CSV file."
        },
        {
            "heading": 3,
            "text": "An incredible year  "
        },
        {
            "text": "It’s worth looking back at what you all achieved in the last financial year, 2024-25. Across all vehicle classes, you helped complete 35,229,047 MOTs. To put that into perspective, that’s more than one MOT per second throughout the year.  "
        },
        {
            "text": "We’d like to thank you for your hard work and dedication over the year and as ever. Please leave us a comment if you have any feedback or questions. "
        }
    ]
}