{
    "url": "https://mhclgmedia.blog.gov.uk/2025/12/17/coverage-of-independent-review-into-foreign-financial-interference-in-uk-politics/",
    "title": "Coverage of independent review into foreign financial interference in UK politics",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Elections"
    ],
    "pub_date": "2025-12-17T12:03:50+00:00",
    "content": [
        {
            "text": "There has been widespread media coverage of the launch of an independent review into foreign financial interference in UK politics."
        },
        {
            "text": "The review was launched in the House of Commons yesterday by the Housing Secretary Steve Reed, and will be led by former DExEU Permanent Secretary Philip Rycroft."
        },
        {
            "text": "The review, which builds on the major reforms announced in the Elections Strategy in July, is a response to the evolving threat posed by political interference to British democracy. Rycroft’s report will be submitted to the Housing Secretary and to the Security Minister, Dan Jarvis, by the end of March."
        },
        {
            "text": "The Telegraph, The Times andThe Guardian all reported on the Secretary of State’s statement in the house, with reporting referencing the case of Nathan Gill as one of the reasons for government action. The Financial Times notes that the forthcoming Elections Bill will also set out protections against foreign interference. There was additional reporting in the Daily Mirror, Independent, Sun, Guardian, I News, and the Daily Mail."
        },
        {
            "text": "Immediately following the statement, there was also breaking news reporting of the review across online outlets, including BBC, Sky News, PA, Huffington Post and Reuters amongst others."
        },
        {
            "text": "The review will provide an in-depth assessment of the current financial rules and safeguards and offer recommendations to further mitigate risks from foreign political interference."
        },
        {
            "text": "Housing Secretary Steve Reed said:"
        },
        {
            "text": "“Following discussions with ministerial colleagues, I have today ordered an independent review into foreign financial interference in UK politics."
        },
        {
            "text": "“This will be led by the former Permanent Secretary Philip Rycroft, reporting both to me as Secretary of State responsible for elections, and to the Minister of State for Security, as the Chair of the Defending Democracy Taskforce."
        },
        {
            "text": "“The facts are clear. A British politician took bribes to further the interests of the Russian regime, a regime which forcefully deported vulnerable Ukrainian children and killed a British citizen on British soil using a deadly nerve agent."
        },
        {
            "text": "“This conduct is a stain on our democracy. The independent review will work to remove that stain.”"
        }
    ]
}