{
    "url": "https://mhclgmedia.blog.gov.uk/2025/12/17/coverage-of-our-major-consultation-to-the-national-planning-policy-framework/",
    "title": "Coverage of our major consultation to the National Planning Policy Framework",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Housing",
        "Planning",
        "Uncategorized"
    ],
    "pub_date": "2025-12-17T14:02:19+00:00",
    "content": [
        {
            "text": "Yesterday, we launched a major consultation on a revamped National Planning Policy Framework – the most significant rewrite of planning rules in over a decade – to accelerate the delivery of 1.5 million homes this Parliament. The reforms will unlock new jobs, infrastructure, and clean energy, while turning the ambition of homeownership into a reality for more working people."
        },
        {
            "text": "There has been widespread national coverage of the announcements, including on page 1 of the Times, and in the Telegraph which led with reforms that every new build home will be fitted with special bricks to protect the endangered swift birds."
        },
        {
            "text": "Elsewhere, The Financial Times, theI paperand Daily Mail focus on the newrules that councils to allow more housing development in urban areas, including around railway stations and building upwards in towns and cities. This will drive urban and suburban densification that is expected to unlock a potential 1.8 million homes in the coming years and decades."
        },
        {
            "text": "The BBC, the Times View and the Guardian also cover the changes to Biodiversity Net Gain, which will exempt developments under 0.2 hectares from the rules helping reduce costs for SME developers working on the smallest sites while maintaining nature recovery at scale."
        },
        {
            "text": "Farmers Weekly reports separately about easing planning rules for farmers and rural firms to grow their businesses, with measures requiring local authorities to give preferential treatment to new developments that directly support rural areas and domestic food production."
        },
        {
            "text": "There has been wider pick up on the announcement across trade media, including Inside Housing, Property Week, Housing Today and Architects’ Journal."
        },
        {
            "text": "An op-ed from the Housing Secretary was also featured on LBC online, which set out how the government is fixing the fundamentals and rewriting planning rules to cut the costs, delays and paperwork that have frustrated builders for years. This will put homeownership back into the hands of hardworking people and families."
        },
        {
            "text": "Housing Secretary Steve Reed said: "
        },
        {
            "text": "“Right now we see a planning system that still isn’t working well enough. A system saying ‘no’ more often than it says ‘yes’ and that favours obstructing instead of building."
        },
        {
            "text": "It has real-world consequences for those aspiring to own a home of their own and those hoping to escape so-called temporary accommodation – we owe it to the people of this country to do everything within our power to build the homes they deserve."
        },
        {
            "text": "We’ve already laid the groundwork to get Britain building but our planning overhaul was only the first step to fix the housing crisis we face. And today I’m going further than ever before to hit 1.5 million homes and place the key to homeownership into the hands of thousands more hardworking people and families.”"
        },
        {
            "text": "Housing Minister Matthew Pennycook in the House of Commons yesterday said: "
        },
        {
            "text": "“England remains in the grip of a housing crisis that is both acute and entrenched…"
        },
        {
            "text": "…a generation locked out of homeownership; 1.3 million people languishing on social housing waiting lists; millions of low-income households forced into unaffordable private rented housing; and more than 170,000 homeless children living in temporary accommodation…"
        },
        {
            "text": "…That is why we committed ourselves, unashamedly, to an incredibly stretching housebuilding target of 1.5 million new safe and decent homes in this Parliament. And it is why we acted quickly and boldly to put in place the foundations of a revamped planning system that will facilitate the delivery of high and sustainable rates of housebuilding in the years ahead.”"
        },
        {
            "text": "Reaction from the Industry"
        },
        {
            "text": "Planning Director at the Home Builders Federation, Catherine Williams said:"
        },
        {
            "text": "“The draft NPPF reinforces Government’s commitment to reforming the planning system and removing barriers to homebuilding, retaining a clear focus on sustainable development while protecting the natural environment. Proposals to reduce the complexity should help to  reduce delays, speeding up the time it takes to get permissioned sites to the point when homes can be built and giving some much-needed encouragement to a dwindling number of local SME home builders. This progressive approach is urgently required if the industry is going to reverse the trend of recent years that has seen a decline in the number of homes being consented.”"
        },
        {
            "text": "Chair of Berkeley Group, Rob Perrins said:"
        },
        {
            "text": "“Our country’s housing supply is constrained by the layers of overlapping policies and regulations which make it impossibly slow, complex and expensive to build homes.  We commend these positive reforms which, once adopted, will help to rationalise this dysfunctional system and create a more consistent and certain process that actually delivers the high-quality private and affordable homes people need at real scale and pace.”"
        },
        {
            "text": "Chief Executive of Urban&Civic, Nigel Hugill said:"
        },
        {
            "text": "“All experience is that establishing clear presumptions has a material impact on both the direction and the operation of our planning system.  We welcome these proposals as addressing the treacle in the existing system which unnecessarily slows down decision making and delivering for our communities.”"
        },
        {
            "text": "Chief Executive and Executive Chair at Vistry, Greg Fitzgerald said:"
        },
        {
            "text": "“This is further evidence of this government’s welcome continued commitment to modernising and streamlining the planning system. At a time when families are stuck in temporary accommodation and young people are locked out of homeownership, delivering thousands of good quality homes in every region is essential to fixing the housing crisis for good. The new National Decision Making Policies and refreshed National Planning Policy Framework will protect quality and encourage delivery at pace. Importantly the changes will provide the clarity needed to take bold decisions, support environmentally responsible new homes and enhance local services.  We now need local councils to respond swiftly and grant the permissions required to unlock sustainable and thriving communities.”"
        }
    ]
}