{
    "url": "https://defraenvironment.blog.gov.uk/2025/12/17/planning-reforms-delivering-homes-supporting-farmers-and-protecting-nature/",
    "title": "Planning reforms: delivering homes, supporting farmers, and protecting nature ",
    "authors": [
        "Environment blog team"
    ],
    "categories": [
        "Biodiversity net gain",
        "Land use",
        "Nature",
        "Planning"
    ],
    "pub_date": "2025-12-17T10:35:16+00:00",
    "content": [
        {
            "text": "Yesterday the government launched a major consultation on planning reform – building on our amends last year this will be the most fundamental rewrite of the National Planning Policy Framework (NPPF) since its introduction over a decade ago. "
        },
        {
            "text": "These reforms will create a clearer, more rules-based planning system, where developments that meet requirements can move forward with greater certainty. This will make the system easier to navigate for communities, councils and developers alike, while unlocking growth, supporting rural communities and protecting nature at scale. "
        },
        {
            "text": "We are clear that growth and nature recovery must go hand in hand. These reforms show how we can deliver the homes and infrastructure the country needs, while maintaining our world-leading environmental protections. "
        },
        {
            "text": "Making Biodiversity Net Gain work better "
        },
        {
            "text": "Since its introduction, Biodiversity Net Gain (BNG) has ensured that new developments consider their impact on nature from the outset. Through better location and design choices, and by avoiding or compensating for impacts, BNG is preventing habitat loss from residential development equivalent to an estimated 6,000–10,000 hectares each year in England – an area roughly the size of Nottingham. "
        },
        {
            "text": "Early evidence suggests BNG is working well for larger developments. More developers are seeking ecological advice earlier in the planning process and designing site layouts to avoid impacts on biodiversity and deliver more habitat onsite. "
        },
        {
            "text": "However, we recognise that while the policy is effective overall, some smaller developments and specific types of sites - in particular on brownfield land - are finding BNG more challenging and proportionately more expensive to deliver. As a new system that only became mandatory in 2024, we have learnt from implementation and are making necessary adjustments as the policy beds in. "
        },
        {
            "text": "Supporting SME developers with targeted changes "
        },
        {
            "text": "Following our consultation earlier this year on improving BNG for minor, medium and brownfield development, which received over 25,000 responses, we're introducing targeted changes to make the system work better whilst maintaining our commitment to nature recovery. "
        },
        {
            "text": "Smaller developments on sites below 0.2 hectares will be exempted from BNG requirements, reducing costs for small SME developers and saving local planning authorities time and money.  "
        },
        {
            "text": "We’ll also consult on an additional targeted exemption for brownfield residential development, testing appropriate definitions of brownfield and a range of potential exemption sizes up to 2.5 hectares. By focusing specifically on residential development and on brownfield land of lower ecological value, we will support housing while protecting the delivery of BNG elsewhere. "
        },
        {
            "text": "We will also introduce measures to make it easier, quicker, and cheaper to deliver BNG offsite as set out in the consultation, benefiting a wide range of development. "
        },
        {
            "text": "A full consultation response and implementation timeline is expected to be published in the new year, alongside a consultation response on implementing BNG for nationally significant infrastructure projects (NSIPs), which will go live in May 2026. Until changes are officially implemented which will require secondary legislation in some cases, BNG continues to apply in its current form and developers should continue to follow existing guidance and legislation when delivering BNG. "
        },
        {
            "text": "Creating a win-win for nature and housing "
        },
        {
            "text": "More broadly, the new planning framework will help deliver homes that work better for both people and wildlife. "
        },
        {
            "text": "Under the proposals, new builds will include nature-friendly features such as swift bricks. These simple features provide nesting spaces for swifts and other birds, helping threatened species thrive as we build the homes our communities need. Alongside other measures like hedgehog highways, these requirements show how thoughtful design can deliver for nature without adding significant costs or complexity. "
        },
        {
            "text": "Furthermore, new policy sets clearer expectations for decision makers to protect features of high environmental value such as chalk streams. This will be supported by the rollout of Local Nature Recovery Strategies, which will be able to map areas of importance for biodiversity and identify measures to enhance and improve them. "
        },
        {
            "text": "These changes complement the new Nature Restoration Fund announced in the Planning and Infrastructure Bill, which will pool funding from developers to deliver strategic, landscape-scale solutions to protect and restore nature. "
        },
        {
            "text": "Unlocking opportunities for farmers and rural businesses "
        },
        {
            "text": "The planning reforms will also support farmers and rural communities to grow, diversify and thrive. "
        },
        {
            "text": "The changes will make clear that development needed by the farming industry should be supported by local councils. This means boosting support for on-farm reservoirs, greenhouses, polytunnels and farm shops – infrastructure that's essential for modern, productive farming. "
        },
        {
            "text": "The new rules will also help other rural businesses secure planning permissions more easily. Too often, small rural business owners find their proposals resisted by councils. This commonsense switch in mindset will embrace proposals and recognise them as a key part of how rural communities can grow and thrive. "
        },
        {
            "text": "Delivering our commitments "
        },
        {
            "text": "The government remains absolutely committed to protecting and enhancing nature, including through Biodiversity Net Gain, while delivering the homes and infrastructure our country needs.  "
        },
        {
            "text": "BNG is a world-leading policy and will continue as a statutory requirement in the planning system, ensuring development delivers measurable gains for nature.  "
        },
        {
            "text": "By supporting farmers and rural businesses, simplifying processes where needed, and embedding nature into every new development through measures like swift bricks, we're showing how growth and nature recovery can work together. "
        }
    ]
}