{
    "url": "https://nationalscreening.blog.gov.uk/2025/12/17/stakeholders-provide-valuable-feedback-on-breast-density-and-screening-evidence/",
    "title": "Stakeholders provide valuable feedback on breast density and screening evidence",
    "authors": [
        "Cristina Visintin"
    ],
    "categories": [
        "Breast Screening"
    ],
    "pub_date": "2025-12-17T10:56:58+00:00",
    "content": [
        {
            "text": "During the summer, the UK National Screening Committee (UK NSC) asked stakeholders for their views on research about potential additional breast screening for women with dense breasts."
        },
        {
            "text": "We wanted feedback on 3 systematic reviews:"
        },
        {
            "text": "These publications looked at recent studies and new imaging techniques that might inform potential improvements to breast screening in the UK in the future."
        },
        {
            "text": "We received helpful feedback on several issues, which will help shape the UK NSC’s work on this topic."
        },
        {
            "heading": 2,
            "text": "Background"
        },
        {
            "text": "In the UK, women aged 50 to their 71st birthday are invited for breast screening every 3 years using mammograms (breast X-rays). Screening helps detect breast cancer and reduces the chance of death from the condition by between 20% and 40%."
        },
        {
            "text": "No screening test is perfect and tests in all screening programmes do miss some cancers. This is particularly the case in women who have dense breast tissue. Dense breasts make tumours harder to see on mammograms and also increase the risk of cancer."
        },
        {
            "text": "In 2019, the UK NSC looked at whether women with dense breasts should have extra ultrasound scans after normal mammogram results. That review found that there was not a standard test for density and there were high rates of false positive results. The committee did not recommend additional screening at that time as there was not enough evidence of benefit. "
        },
        {
            "text": "Evidence in screening programmes usually relates to mortality. But as we know that breast screening does prevent deaths, we can look for measures that become obvious earlier, like cancer detection rates and interval cancers (cancers detected between scheduled screening appointments)."
        },
        {
            "heading": 2,
            "text": "Recent evidence developments"
        },
        {
            "text": "Breast imaging has evolved rapidly since 2019."
        },
        {
            "text": "The European Society of Breast Imaging (EUSOBI) now recommends that women should know about their breast density and those with very dense breasts should be offered additional magnetic resonance imaging (MRI) scans."
        },
        {
            "text": "In the USA, mammogram reports must now include information about breast density."
        },
        {
            "text": "The UK’s BRAID study is investigating whether short MRI scans, contrast-enhanced mammography (CEM), or automated breast ultrasound (ABUS) could improve cancer detection in women with dense breasts."
        },
        {
            "heading": 2,
            "text": "What the 2025 reviews found"
        },
        {
            "heading": 3,
            "text": "Review 1"
        },
        {
            "text": "This review found good agreement between automated and manual breast density measures, notably with Volpara and Quantra equipment. It also found there is a need for standardised methodologies and more research. "
        },
        {
            "heading": 3,
            "text": "Review 2"
        },
        {
            "text": "The second review found that MRI scans were better than handheld ultrasound and digital breast tomosynthesis (DBT) at finding cancers that mammograms missed and reducing interval cancers. The BRAID study supports these findings. MRI, and possibly CEM, show potential to improve screening by detecting more cancers, as previously shown by other studies. However, interval cancer data from BRAID is not yet available."
        },
        {
            "heading": 3,
            "text": "Review 3"
        },
        {
            "text": "The third review found that MRI alone was potentially cost-effective for younger women with very dense breasts, but the studies were from non-UK settings. We need UK-specific cost-effectiveness analysis that considers age, risk profiles, screening frequency, and imaging methods. Ethnic mix in populations are not the same across countries, and we want to be sure that the test works for all of our women. "
        },
        {
            "heading": 2,
            "text": "What stakeholders told us"
        },
        {
            "text": "Feedback on the 3 reviews covered several themes. "
        },
        {
            "heading": 3,
            "text": "Acting quickly"
        },
        {
            "text": "Patients and patient advocates shared personal experiences that stressed how additional imaging such as CEM and MRI for women with dense breasts could save lives. They want this included in routine screening and pointed out that other countries already tell women about breast density and offer extra screening. Patients and patient advocates also think women should know their breast density to make informed choices. "
        },
        {
            "heading": 3,
            "text": "Overall risk assessment "
        },
        {
            "text": "Many people said breast density should be part of a full risk assessment alongside family history, genetics, and other factors. They mentioned risk assessment tools such as CanRisk and called for breast density to be part of a complete approach to personalised screening. "
        },
        {
            "heading": 3,
            "text": "Health equity and access "
        },
        {
            "text": "Stakeholders were concerned about fairness. Some worried that risk-based changes could create inequalities, especially if access to additional screening varied between areas. "
        },
        {
            "heading": 3,
            "text": "Professional support "
        },
        {
            "text": "Some professional bodies, research and support organisations highlighted the need for validated, equitable, and standardised breast density assessment tools. They also highlighted the need for UK-specific data and warned that any changes must consider costs, workforce capacity, and infrastructure."
        },
        {
            "heading": 2,
            "text": "Our response"
        },
        {
            "text": "Here is a summary of our responses to the main points raised in the feedback on the 3 publications."
        },
        {
            "heading": 3,
            "text": "Review 1:"
        },
        {
            "text": "We understand concerns about which papers were not included and omission of some technical validation studies. However, the criteria were set to ensure relevance to UK screening populations. "
        },
        {
            "text": "The lack of reporting on ethnic and socioeconomic diversity limits considerations of generalisability and equity. "
        },
        {
            "text": "We recognise the practical challenges of implementing new systems, including time, resources and IT compatibility. "
        },
        {
            "text": "We agree it is important to minimise variation between automated tools and human image readers. "
        },
        {
            "heading": 3,
            "text": "Review 2: "
        },
        {
            "text": "We need more evidence on:"
        },
        {
            "text": "We acknowledge implementation challenges around workforce, infrastructure and capacity. "
        },
        {
            "text": "We need to carefully consider the complexities of integrating additional imaging into existing screening services and addressing the timing between mammography and supplemental imaging to avoid bias. "
        },
        {
            "heading": 3,
            "text": "Review 3:"
        },
        {
            "text": "We agree with calls for UK-specific cost-effectiveness modelling research due to variability in international data. "
        },
        {
            "text": "We need to focus on the UK screening age range (50 to 70), as many of the included studies were on younger women. "
        },
        {
            "text": "Research that mixes women with different breast densities is less helpful, so future studies should look at each density category separately."
        },
        {
            "heading": 2,
            "text": "What happens next"
        },
        {
            "text": "We will commission work to understand the clinical impact and costs of adding breast density to the screening pathways in the UK. This is a complex and very quickly developing field so any work must be flexible enough to add new risk factors in to the model."
        },
        {
            "text": "We will involve a wide range of stakeholders in modelling workshops to ensure the right range of current and possible risk modifiers are considered. "
        },
        {
            "heading": 3,
            "text": "Expert breast working group"
        },
        {
            "text": "The UK NSC has set up a working group of breast cancer screening experts to help it consider new and emerging evidence and developments that could improve the UK breast screening programmes."
        },
        {
            "text": "At its first meeting, the group agreed to support future modelling projects that will incorporate breast density considerations and new tests that assess breast cancer risk, including AI methodologies."
        },
        {
            "text": "This approach aims to move us beyond ‘one-size-fits-all’ screening towards personalised, risk-based screening strategies in the future."
        },
        {
            "text": "We will keep you updated on the work of the breast working group via this blog."
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK NSC. You can register to receive updates direct to your inbox, so there is no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, please email uknsc@dhsc.gov.uk. "
        }
    ]
}