{
    "url": "https://ukhsa.blog.gov.uk/2025/12/17/what-is-the-mmrv-vaccine-and-is-my-child-eligible/",
    "title": "What is the MMRV vaccine and is my child eligible? ",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "immunisations"
    ],
    "pub_date": "2025-12-17T13:55:11+01:00",
    "content": [
        {
            "text": "From 1 January 2026, the MMRV vaccine will be introduced into the routine childhood immunisation schedule in the UK. When your child will be offered this vaccine depends on their date of birth."
        },
        {
            "text": "The MMRV vaccine helps protect children against measles, mumps, rubella and chickenpox (varicella). Children are offered 2 doses when they are 12 and 18 months old as part of the schedule. Older children born on or after 1 January 2020 will be offered 1 or 2 doses of MMRV."
        },
        {
            "text": "The MMRV vaccine has been safely used for over a decade and is already part of the routine childhood vaccination schedule in several countries, including Canada, Australia and Germany."
        },
        {
            "text": "This guide will help you understand when your child should get their MMRV vaccine, if they are eligible to have it."
        },
        {
            "heading": 2,
            "text": "Why does my child need to be protected against chickenpox as well as measles, mumps and rubella?"
        },
        {
            "text": "Chickenpox is a very infectious disease caused by a virus. It is very common in young children and causes a fever and an itchy, spotty rash. These spots can be painful and appear all over the body. Most children with chickenpox will have a mild illness and recover after around a week. Some children may have a more serious illness and need to be admitted to hospital. In rare cases, children can develop serious complications including chest infection, fits, and encephalitis (brain inflammation)."
        },
        {
            "text": "Measles is caused by a virus that spreads very easily. Symptoms include high fever, rash, sore red eyes, cough and runny nose. Children can be off school for 10 days and 1 in 5 people with measles will be admitted to hospital. Complications include chest infections, fits, encephalitis (infection of the brain) and brain damage. It is more severe in babies under one year old, pregnant women and people with weakened immune systems. Around 1 in 5,000 people who catch measles may die from complications."
        },
        {
            "text": "Mumps is caused by a virus. Symptoms include fever, headache and painful, swollen glands in the face, neck and jaw. Complications from mumps include hearing loss, meningitis, encephalitis, and painful swelling of the testicles and ovaries."
        },
        {
            "text": "Rubella is caused by a virus. In children it is usually mild and can cause a rash, swollen glands and a sore throat. If pregnant women catch rubella it can affect their unborn baby, causing serious damage to their sight, hearing, heart and brain."
        },
        {
            "text": "MMRV is a simple way to protect your child against measles, mumps, rubella and chickenpox."
        },
        {
            "heading": 2,
            "text": "When your child will get the MMRV vaccine:"
        },
        {
            "text": "If your child was born on or after 1 January 2025 they will be offered:"
        },
        {
            "text": "If your child was born between 1 July 2024 and 31 December 2024 they should have already had one dose of MMR at 12 months and they will then be offered:"
        },
        {
            "text": "These children will receive 3 doses of a vaccine that protects against measles, mumps and rubella. There are no concerns with this additional dose, and it allows children in this age group to receive 2 doses of a vaccine that protects against chickenpox, helping to ensure they have good protection"
        },
        {
            "text": "If your child was born between 1 September 2022 and 30 June 2024 they should have already had 1 dose of MMR at 12 months and they will then be offered:"
        },
        {
            "text": "These children will be offered 1 dose of a vaccine that protects against chickenpox, which provides very good protection against severe disease."
        },
        {
            "heading": 2,
            "text": "Will there be a catch-up programme for older children?"
        },
        {
            "text": "A single MMRV catch-up dose will be offered to children born between 1 January 2020 and 31 August 2022, if they haven't already had chickenpox or been vaccinated against it. This will be offered between November 2026 and March 2028."
        },
        {
            "text": "You don't need to worry about checking your child's medical history. When you're contacted about the catch-up programme, you can let the healthcare team know if your child has already had chickenpox or 2 doses of chickenpox (varicella) vaccine. There are no safety concerns if a child has the MMRV vaccine after having chickenpox or other chickenpox vaccines. If you can't remember if your child has already had chickenpox, or if you are unsure, it is better that they get the vaccine, if they’re eligible."
        },
        {
            "text": "Children born on or before 31 December 2019 won't be offered the MMRV vaccine as part of the routine programme or catch-up offers. They should have already received 2 doses of the MMR vaccine at 12 months and 3 years and 4 months of age. Most children in this age group will have already had the chickenpox infection. These children should still be offered catch-up MMR vaccines if they haven't already had 2 doses."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "What if my child has already had chickenpox?"
        },
        {
            "text": "Even if your child has already had chickenpox, there are no safety concerns if a child gets the MMRV vaccine. This will protect them against measles, mumps and rubella, as well as chickenpox."
        },
        {
            "heading": 2,
            "text": "Are there any side effects from the MMRV vaccine?"
        },
        {
            "text": "Vaccines offered by the NHS are thoroughly tested to assess how safe and effective they are. All medicines can cause side effects, but vaccines are among the safest. Common side effects do not usually last long and are mild, such as a sore arm, fever, and a rash. Side effects are less common following the second dose than the first."
        },
        {
            "text": "If you have any questions or concerns about side effects, talk to your doctor, practice nurse or health visitor."
        },
        {
            "heading": 2,
            "text": "When will my child be offered the MMRV vaccine?"
        },
        {
            "text": "You’ll usually be contacted by your GP practice when your child is due for a routine vaccination like MMRV. This could be via a letter, text, phone call, or email."
        },
        {
            "text": "If you know your child is due for a vaccination and you have not been contacted, speak to your GP practice to book the appointment."
        },
        {
            "heading": 2,
            "text": "Does the chickenpox vaccine protection last for life?"
        },
        {
            "text": "MMRV is a simple way to protect your child against measles, mumps, rubella and chickenpox. Since the MMR vaccine was introduced in 1988, cases of measles, mumps and rubella have all fallen to extremely low levels. MMRV offers the same protection as MMR, but adds protection against chickenpox. In countries where children already get a chickenpox vaccine, cases of chickenpox have also fallen dramatically. Studies so far show that the protection given by 2 doses of the vaccine does not reduce over time."
        },
        {
            "heading": 2,
            "text": "Where can I find more information?"
        }
    ]
}