{
    "url": "https://socialworkwithadults.blog.gov.uk/2022/03/15/a-message-of-hope-on-world-social-work-day/",
    "title": "A message of hope on World Social Work Day",
    "authors": [
        "Lyn Romeo"
    ],
    "categories": [
        "Events",
        "Our profession"
    ],
    "pub_date": "2022-03-15T10:18:27+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Defending and strengthening our social work values"
        },
        {
            "text": "This year’s World Social Work Day takes place against the backdrop of another international crisis, this time borne of one man’s inhumanity to an entire nation, rather than an accident of unconscious viral evolution."
        },
        {
            "text": "All the more reason to celebrate the very best of our profession, to defend our values and fly the flag for social justice and human rights when these very concepts are coming under attack. Watch my special message to the profession here."
        },
        {
            "text": "When societies begin to unravel, social work and the amazing colleagues who practice its methods, values and skills are the glue holding individuals, families and whole communities together."
        },
        {
            "heading": 2,
            "text": "Keeping it together"
        },
        {
            "text": "This year’s theme, ‘co-building a new eco-social world: leaving no one behind’ feels especially timely as events in Ukraine risk severing the societal connections we all rely on to keep people strong."
        },
        {
            "text": "Never has there been a greater need to establish new global values of empathy, trust and faith in humanity when such positive qualities appear to be anathema to an increasingly isolated but no less dangerous regime."
        },
        {
            "text": "Nevertheless, World Social Work Day will do what it has done every year: champion social work’s ability to encourage and support positive change, be there for anyone in a crisis, and promote dignity, respect and person-centred services to help people lead the lives they need, want and deserve."
        },
        {
            "text": "Thanks to all of you who work alongside and with people to listen deeply to what matters, what’s possible and who truly care to make a difference."
        },
        {
            "text": "Happy World Social Work Day."
        }
    ]
}