{
    "url": "https://food.blog.gov.uk/2022/03/15/food-hypersensitivity-perspectives-and-practice-symposium-2022-different-perspectives-on-food-hypersensitivity/",
    "title": "Food Hypersensitivity Perspectives and Practice Symposium 2022 - Different perspectives on food hypersensitivity",
    "authors": [
        "Professor Robin May, Chief Scientific Adviser"
    ],
    "categories": [
        "Allergy"
    ],
    "pub_date": "2022-03-15T14:29:09+00:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "Professor Robin May, FSA Chief Scientific Adviser, reflects on the recent Food Hypersensitivity Perspectives & Practice Symposium, and how we can make the UK a better place for the food hypersensitive consumer."
        },
        {
            "text": " "
        },
        {
            "text": "On Thursday 10 March I had the pleasure of chairing our Food Hypersensitivity Perspectives & Practice Symposium alongside Rebecca Sudworth, Director of Policy."
        },
        {
            "text": "Food hypersensitivity (FHS) affects an estimated 2.6 million people across the UK, and it is one of our strategic priorities. This important symposium, which is in its third year, brings together experts and stakeholders from across industry to discuss how we can make the UK a better place for the food hypersensitive consumer."
        },
        {
            "text": "The first part of this year’s event, which took place in the morning, explored FHS from a scientific, clinical, and psychological perspective. Then, in the afternoon, we turned our attention to the practical aspects of managing allergens and minimising the risk to those with FHS."
        },
        {
            "text": "We welcomed speakers from food businesses and local authorities who spoke about how they support, embed, and manage allergen management processes to improve the lives of people with FHS."
        },
        {
            "heading": 2,
            "text": "Perspectives behind food hypersensitivity"
        },
        {
            "text": "Food hypersensitivity is one strand of our four research priorities. We use data and insight from our research to understand the behaviours of consumers, alongside work which explores the prevalence of FHS and its impact. Our research underpins our strategies, policy, and guidance, and helps us to plan ahead and focus on what is around the corner."
        },
        {
            "text": "Patterns of food allergies and intolerances are constantly changing along with our eating habits and consequently, there are several emerging themes which are currently shaping our work."
        },
        {
            "heading": 2,
            "text": "Sustainability and food hypersensitivity risks"
        },
        {
            "text": "Sustainability has become a huge priority across a variety of sectors, and the food industry is no exception. One of the key areas we are looking at is the unintended risks of using recyclable packaging. This type of packaging is often created from food waste, which could potentially cause risks for consumers with FHS, particularly if it isn’t clear what it is made from."
        },
        {
            "text": "This could cause unintended allergic reactions for consumers, and it could ultimately be life threatening. A full understanding of what food packaging is derived from is critical to reduce risk and protect the health of many people."
        },
        {
            "text": "Another area with potentially significant impact on FHS is the increased consumption of alternative proteins, such as plant-based or insect proteins. Many of these foods have not previously been widely eaten or are being used in a more concentrated form. Understanding what risk, if any, they may present for people with FHS is critical to ensuring they can be marketed safely."
        },
        {
            "text": "On a similar theme, many organisations around the world are developing processes to create lab-grown meat. This totally new way of creating food offers significant ethical and sustainability advantages, but we have little knowledge about the potential risks to consumers with FHS, or indeed the health benefits that this food may create. We are currently working with lab-grown meat providers to fully understand how this new type of meat can positively affect consumers, as well as looking at the science behind the product to evaluate any health risks."
        },
        {
            "heading": 2,
            "text": "Food safety in a globalised market"
        },
        {
            "text": "As our food habits are evolving and the globalisation of crops increases, many foods are now being exported to different countries where they have not previously been eaten. These foods are extremely important for us to research as they could pose new risks. Similarly, we continue to work hard to evaluate genetically modified and genetically engineered crops to best understand the consequences and any unintended risks."
        },
        {
            "text": "A clear understanding of FHS risks is only of use if information can be clearly and concisely communicated to consumers, and our research investigates the best ways to do this. We don’t want to overload consumers or provide them with inaccurate information, so we are constantly thinking about the most effective ways to engage with them, including the use of technologies, such as QR codes or web interfaces."
        },
        {
            "heading": 2,
            "text": "Clinical perspectives on food hypersensitivity"
        },
        {
            "text": "Adam Fox, Professor of Paediatric Allergy at Guy's & St Thomas' Hospitals, was one of our guest speakers at the symposium and explored the clinical perspective of FHS. Adam explained that food allergy is an increasing public health issue with severe reactions becoming more common."
        },
        {
            "text": "Cow’s milk is now the most common single cause of fatal anaphylaxis in school-aged children. Adam expanded on emerging allergens, giving examples ranging from concentrated pea protein to cashew milk, and went on to discuss why there needs to be a focus on policy change to keep people safe, for example in schools."
        },
        {
            "text": "Dr Rebecca Knibb, Associate Professor in Health Psychology at Aston University, explored how FHS impacts the quality of life and mental well-being of children, adolescents, and parents. Rebecca discussed the results of the FSA funded ‘FoodSensitive’ study, which found that people with FHS had poorer quality of life scores compared with those without. Having to check food information more frequently when shopping or eating out and greater severity of FHS were associated with poorer scores."
        },
        {
            "heading": 2,
            "text": "Reducing the burden of food hypersensitivity"
        },
        {
            "text": "Rebecca concluded that being able to eat out and be confident in the information provided, without a higher burden of checking information, would help to support these individuals and reduce the burden. The results of the next wave of the study will be presented at the British Society for Allergy & Clinical Immunology/World Allergy Organisation (BSACI/WAO) Conference in Edinburgh in April."
        },
        {
            "text": "The themes and topics that were discussed and raised were diverse and whilst FHS will always exist in some shape or form, I hope people will continue to share evidence and expertise and work together to make it easier for people with FHS to manage risks."
        },
        {
            "text": "We have more guidance on our website on food allergy and intolerance and allergen guidance for food businesses."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "heading": 1,
            "text": "Myfyrio ar Symposiwm Rhithwir yr ASB 2022- Safbwyntiau y tu ôl i orsensitifrwydd i fwyd"
        },
        {
            "text": " "
        },
        {
            "text": "Ddydd Iau 10 Mawrth, cefais y fraint o gadeirio ein Symposiwm Safbwyntiau ac Arferion Gorsensitifrwydd i Fwyd, ar y cyd â’r Cyfarwyddwr Polisi, Rebecca Sudworth."
        },
        {
            "text": "Mae gorsensitifrwydd i fwyd yn un o’n blaenoriaethau strategol. Amcangyfrifir ei fod yn effeithio ar 2.6 miliwn o bobl ledled y Deyrnas Unedig (DU). Mae’r symposiwm pwysig hwn, sydd yn ei drydedd flwyddyn erbyn hyn, yn dod â rhanddeiliaid ac arbenigwyr o bob rhan o’r diwydiant ynghyd i drafod sut y gallwn wneud y DU yn lle gwell i ddefnyddwyr â gorsensitifrwydd i fwyd."
        },
        {
            "text": "Roedd rhan gyntaf y digwyddiad eleni yn ystyried gorsensitifrwydd i fwyd o safbwynt gwyddonol, clinigol a seicolegol. Yna, yn y prynhawn, gwnaethom droi ein sylw at yr agweddau ymarferol ar reoli alergenau a lleihau’r risg i’r rhai sydd â gorsensitifrwydd i fwyd. Pleser oedd croesawu siaradwyr o fusnesau bwyd ac awdurdodau lleol er mwyn clywed am y ffordd y maen nhw’n cefnogi, sefydlu a rheoli prosesau rheoli alergenau er mwyn gwella bywydau pobl â gorsensitifrwydd i fwyd."
        },
        {
            "heading": 2,
            "text": "Safbwyntiau y tu ôl i orsensitifrwydd i fwyd"
        },
        {
            "text": "Gorsensitifrwydd i fwyd yw un o'n pedair blaenoriaeth ymchwil. Rydym ni’n defnyddio data a mewnwelediad o'n hymchwil i ddeall ymddygiadau defnyddwyr, ochr yn ochr â gwaith sy'n ystyried pa mor gyffredin yw gorsensitifrwydd i fwyd, a'i effaith. Mae ein hymchwil yn sail i'n strategaethau, ein polisïau a'n canllawiau, ac mae'n ein helpu i gynllunio a chanolbwyntio ar yr hyn sydd ar y gorwel."
        },
        {
            "text": "Mae patrymau alergeddau ac anoddefiadau bwyd yn newid yn gyson ynghyd â'n harferion bwyta ac, o ganlyniad, mae nifer o themâu yn dod i'r amlwg sy'n llywio ein gwaith ar hyn o bryd."
        },
        {
            "heading": 2,
            "text": "Cynaliadwyedd a risgiau gorsensitifrwydd i fwyd"
        },
        {
            "text": "Mae cynaliadwyedd wedi dod yn flaenoriaeth enfawr mewn amrywiaeth o sectorau, ac nid yw’r diwydiant bwyd yn eithriad yn hyn o beth. Un o'r meysydd allweddol yr ydym ni’n edrych arno yw'r risgiau anfwriadol sy’n gysylltiedig â defnyddio pecynnau ailgylchadwy. Mae'r math hwn o ddeunydd pecynnu yn aml yn cael ei greu o wastraff bwyd, ac mae posibilrwydd y gall beri risg i ddefnyddwyr â gorsensitifrwydd i fwyd, yn enwedig os nad yw'n glir o beth y mae wedi'i wneud. Gallai hyn achosi adweithiau alergaidd anfwriadol i ddefnyddwyr, ac fe allai fod yn berygl bywyd. Mae dealltwriaeth lawn o'r hyn y mae deunydd pecynnu bwyd wedi’i greu ohono yn hanfodol i leihau risgiau a diogelu iechyd llawer o bobl."
        },
        {
            "text": "Maes arall a allai effeithio'n sylweddol ar orsensitifrwydd i fwyd yw'r defnydd cynyddol o broteinau amgen, megis proteinau planhigion neu bryfed. Mae llawer o'r bwydydd hyn heb gael eu bwyta'n eang o'r blaen, neu’n cael eu defnyddio ar ffurf fwy crynodedig. Mae deall pa risg, os o gwbl, y gallent ei pheri i bobl â gorsensitifrwydd i fwyd yn hanfodol er mwyn sicrhau y gellir eu marchnata'n ddiogel."
        },
        {
            "text": "Yn yr un modd, mae llawer o sefydliadau ledled y byd yn datblygu prosesau i greu cig mewn labordy. Mae’r ffordd gwbl newydd hon o greu bwyd yn cynnig manteision sylweddol o safbwynt cynaliadwyedd ac o safbwynt moesegol. Serch hyn, ychydig o wybodaeth sydd gennym am y risgiau posibl i ddefnyddwyr â gorsensitifrwydd i fwyd, neu, yn wir, y manteision iechyd y gallai’r bwyd hwn eu cynnig. Ar hyn o bryd, rydym ni’n gweithio gyda darparwyr cig a dyfir mewn labordai i ddeall yn llawn sut y gall y math newydd hwn o gig gael effaith gadarnhaol ar ddefnyddwyr, yn ogystal ag edrych ar y wyddoniaeth y tu ôl i'r cynnyrch i werthuso unrhyw risgiau i iechyd."
        },
        {
            "heading": 2,
            "text": "Diogelwch bwyd mewn marchnad fyd-eang"
        },
        {
            "text": "Wrth i’n harferion bwyd ddatblygu ac wrth i’r broses o globaleiddio cnydau gynyddu, mae llawer o fwydydd bellach yn cael eu hallforio i wledydd lle nad yw’r bwydydd hyn wedi cael eu bwyta o’r blaen. Mae'n bwysig iawn ein bod ni’n ymchwilio i’r bwydydd hyn oherwydd gallent beri risgiau newydd. Yn yr un modd, rydym ni’n parhau i weithio'n galed i werthuso cnydau a addaswyd yn enetig a chnydau wedi'u peiriannu'n enetig er mwyn meithrin y ddealltwriaeth orau bosib o’r canlyniadau ac unrhyw risgiau anfwriadol."
        },
        {
            "text": "Ni fydd dealltwriaeth glir o risgiau gorsensitifrwydd i fwyd yn ddefnyddiol oni bai y gallwn gyfleu’r wybodaeth hon i ddefnyddwyr mewn ffordd glir a chryno, ac mae ein hymchwil yn ystyried y ffyrdd gorau o wneud hyn. Nid ydym am roi gormod o wybodaeth i ddefnyddwyr na rhoi gwybodaeth anghywir iddynt, felly rydym ni bob amser yn ystyried y ffyrdd mwyaf effeithiol o ymgysylltu â nhw, gan gynnwys defnyddio technolegau newydd, fel codau QR neu ryngwynebau gwe."
        },
        {
            "heading": 2,
            "text": "Safbwyntiau clinigol ar orsensitifrwydd i fwyd"
        },
        {
            "text": "Adam Fox, Athro Alergedd Pediatrig yn Ysbytai Guy's a St Thomas, oedd un o'n siaradwyr gwadd ac roedd ei gyflwyniad ef yn canolbwyntio ar yr agwedd glinigol ar orsensitifrwydd i fwyd. Esboniodd Adam fod alergedd bwyd yn fater iechyd cyhoeddus sy’n peri pryder cynyddol, am fod adweithiau difrifol yn dod yn fwy cyffredin. Erbyn hyn, llaeth buwch yw’r alergen sy’n achosi’r nifer mwyaf o achosion o anaffylacsis angheuol ymhlith plant o oedran ysgol. Ymhelaethodd Adam ar alergenau newydd sy’n dod i’r amlwg, gan roi enghreifftiau yn amrywio o brotein pys crynodedig i laeth cashiw, ac aeth ymlaen i drafod pam y mae angen canolbwyntio ar newid polisi i gadw pobl yn ddiogel, er enghraifft mewn ysgolion."
        },
        {
            "text": "Siaradodd Dr Rebecca Knibb, Athro Cyswllt mewn Seicoleg Iechyd ym Mhrifysgol Aston, am y ffordd y mae gorsensitifrwydd i fwyd yn effeithio ar ansawdd bywyd a lles meddwl plant, y glasoed, a’u rhieni. Trafododd Rebecca ganlyniadau'r astudiaeth 'FoodSensitive' a ariannwyd gan yr Asiantaeth Safonau Bwyd, a ganfu fod gan bobl â gorsensitifrwydd i fwyd sgoriau ansawdd bywyd gwaeth o gymharu â phobl heb orsensitifrwydd o’r fath. Roedd gorfod gwirio gwybodaeth am fwyd yn amlach wrth siopa neu fwyta allan, a gorsensitifrwydd mwy difrifol i fwyd yn gysylltiedig â sgoriau gwaeth."
        },
        {
            "heading": 2,
            "text": "Lleihau baich gorsensitifrwydd i fwyd"
        },
        {
            "text": "Daeth Rebecca i’r casgliad y byddai gallu bwyta allan a bod yn hyderus yn yr wybodaeth a ddarparwyd, heb gymaint o faich o ran gwirio gwybodaeth, yn helpu i gefnogi’r unigolion hyn a lleihau’r baich. Bydd canlyniadau cylch nesaf yr astudiaeth yn cael eu cyflwyno yng Nghynhadledd Cymdeithas Prydain ar gyfer Alergeddau ac Imiwnoleg Glinigol/Sefydliad Alergedd y Byd (BSACI/WAO) yng Nghaeredin ym mis Ebrill."
        },
        {
            "text": "Roedd y themâu a’r pynciau a drafodwyd ac a godwyd yn amrywiol ac er y bydd wastad ryw ffurf ar orsensitifrwydd i fwyd, rwy’n gobeithio y bydd pobl yn parhau i rannu tystiolaeth ac arbenigedd a chydweithio i’w gwneud yn haws i bobl â gorsensitifrwydd i fwyd reoli’r risgiau."
        },
        {
            "text": " "
        }
    ]
}