{
    "url": "https://gfie.blog.gov.uk/2022/03/15/going-forward-into-employment-gfie-opportunities-to-become-a-buddy/",
    "title": "Going Forward into Employment (GFiE) - Opportunities to become a ‘Buddy’",
    "authors": [
        "Andrew Ashworth"
    ],
    "categories": [
        "A modern Civil Service",
        "A Skilled Civil Service",
        "agreatplacetoworkforveterans",
        "build capability",
        "Care Leavers",
        "Inclusion",
        "levelling up",
        "Life Chances",
        "Prison Leavers",
        "Social mobility",
        "Veterans"
    ],
    "pub_date": "2022-03-15T15:48:28+00:00",
    "content": [
        {
            "text": "The Going Forward into Employment scheme provides Life Chance opportunities across the Civil Service, using innovative recruitment methods to employ people with a wide range of backgrounds. Specifically;"
        },
        {
            "text": "As new colleagues begin work across the Civil Service, we want to provide all the advice, help and support to give them the best possible chance to succeed from day one.  One of the ways we do that is by offering all those colleagues who start through the scheme a ‘Buddy’."
        },
        {
            "text": " "
        },
        {
            "text": "As a ‘Buddy’ you play a key role at the very start of someone taking up employment within a Civil Service department.  You will act as a friendly face to help others understand more about who the Civil Service is, what it does and how they fit in.  "
        },
        {
            "text": " "
        },
        {
            "text": "You will act as an informal coach/mentor in supporting colleagues and help to not only guide them through their first Civil Service experiences, but for many it will be about re-engaging with employment and a place of work. "
        },
        {
            "text": "You will need to be a good listener, be supportive, understand the scale and role of the Civil Service, provide sound advice and be appreciative of the colleagues background (discretion is required)."
        },
        {
            "text": "This is a rewarding role, which can also help develop you and your skills as well as helping others - making it a great development opportunity as much as the right thing we should be doing across the Civil Service.  You will also be playing an active role in delivering Civil Service agenda’s around increasing Social Mobility, Diversity & Inclusion and Levelling Up.  "
        },
        {
            "text": " "
        },
        {
            "text": "“It's such a rewarding experience seeing people grow - improving in confidence and learning new skills!  It has really helped me to grow and develop too, understanding people a lot better as each person is different, but that’s the fun of it!!\" - a GFiE Buddy "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": "“It's been helpful to think through how things are going and talk through any questions with someone who is experienced and independent  - and who is there because they want to support me.  Feeling supported has boosted my confidence massively.” - a GFiE Candidate"
        },
        {
            "text": "The GFiE team will support you as a Buddy throughout the process, providing guidance & learning and as well as access to a network of other Buddy’s from across the Civil Service."
        },
        {
            "text": "As well as a great opportunity to support the GFiE scheme, develop yourself, you may also consider that you could use L&D or Volunteering days to support this."
        },
        {
            "text": " "
        },
        {
            "text": "If you're interested in becoming a Going Forward into Employment ‘Buddy’ and can give around 1 hour every few weeks then please click here to submit your interest.  Don’t forget to check with your line manager and gain their support too."
        },
        {
            "text": "Thanks"
        },
        {
            "text": "The GFiE Team"
        }
    ]
}