{
    "url": "https://environmentagency.blog.gov.uk/2022/03/15/how-well-use-the-money-we-have-for-the-people-we-serve-2/",
    "title": "How we'll use the money we have for the people we serve",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2022-03-15T11:03:51+00:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "by Sir James Bevan, Environment Agency Chief Executive"
        },
        {
            "text": "Most of the Environment Agency’s work is funded by government grant. Following the recent Spending Review, which set government budgets for the next three Financial Years, we have now received our allocations for FY 2022/23 and finalised our plans."
        },
        {
            "text": "We will receive an increased government grant in FY 22/23 to reduce flood risk. We will get a total of £728m capital, which mostly pays for fixed assets like new flood defences; and £303m “resource”, which mostly pays for people and running costs. We will use this money to build more new flood defences; to maintain our existing defences; to warn and inform people when flooding threatens; to respond to flood incidents and protect and support communities; and to provide planning advice to reduce flood risk."
        },
        {
            "text": "We will also receive an increased government grant for our environment work in FY 22/23. We will get a total of £44m capital and £95m resource.  While our core environment grant which funds our monitoring of the environment, enforcement of the regulations which protect it and response to pollution incidents will stay more or less the same, we will get a significant amount of new money on top of this. We will use that to step up our efforts to improve water quality, including by increasing the number of inspections we do of farms and sewage works - the two major sources of water pollution; to invest in our water transfer schemes which help reduce drought risk and in running our river navigations like the Thames; to improve air quality and biodiversity; to deliver the new post-Brexit chemicals regulations; to enhance our planning and placemaking work; and to support green finance."
        },
        {
            "text": "Alongside this new grant funding from the government, we expect to receive around £417m in FY 22/23 in fees and charges from those who pay for our services. We will use this to fund our regulation of industry which protects the environment and to deliver all the other services for which our customers pay, such as maintaining fisheries for anglers and operating river navigations for boaters. We also expect to receive £107m from our partners in other forms of funding to support our work to reduce flood risk in FY 22/23."
        },
        {
            "text": "While the overall size of the EA’s budget has increased over the last few years, the cost of what we do and the number of tasks we are required to perform has risen much faster. For example, the cost of maintaining our flood defences is rising sharply as we build more, as older defences come to the end of their design life, and as climate change does more damage to all of them."
        },
        {
            "text": "As far as possible we will address the gap between what we are being asked to do and the money we have to do it through continuous innovation and efficiencies. But like other public sector organisations we are having to make some difficult choices, including to reduce or stop activities for which we are not funded.  We are not, for example, funded to respond to every one of the 70-100,000 environmental incidents reported to us every year. So we will continue to focus on those which pose a significant risk to people or wildlife, while using the information from all the reports we receive to provide intelligence and inform our regulatory/enforcement activity even when we aren’t able to respond actively to a particular incident."
        },
        {
            "text": "We welcome the outcome of the Spending Review. We will now seek to do the best we can with the money we have for the people we serve."
        }
    ]
}