{
    "url": "https://ruralpayments.blog.gov.uk/2022/03/15/the-basic-payment-scheme-is-now-open-for-applications/",
    "title": "The Basic Payment Scheme Is Now Open For Applications",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Basic Payment Scheme"
    ],
    "pub_date": "2022-03-15T12:45:08+00:00",
    "content": [
        {
            "text": "You can now submit your applications for the Basic Payment Scheme (BPS) to the Rural Payments Agency (RPA). To make sure you have everything you need to make your application, we have put together some useful information."
        },
        {
            "text": "We have published the Basic Payment Scheme: rules for 2022 on GOV.UK. You can also read our guidance on how to apply and information about submitting your application."
        },
        {
            "heading": 2,
            "text": " "
        },
        {
            "heading": 2,
            "text": "BPS Key Dates"
        },
        {
            "text": "The key dates for BPS are as follows."
        },
        {
            "text": "15 March – BPS applications open. All guidance available on GOV.UK.\n16 May – last day to submit a BPS application, CS or ES Revenue claim without penalty. This is also the deadline to transfer BPS entitlements for 2022.\n10 June – last day to submit a late BPS application, CS or ES Revenue claim with penalty. This is also the deadline for making certain changes without penalty to a BPS application that was submitted by 16 May."
        },
        {
            "text": "You can read more about the key dates for 2022 for all RPA schemes on GOV.UK."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Submitting CS or ES Annual Revenue Claims "
        },
        {
            "text": " "
        },
        {
            "text": "You can now submit revenue claims for Countryside Stewardship (CS) and Environmental Stewardship (ES) agreements."
        },
        {
            "text": "You can use the Rural Payments service to submit your Countryside Stewardship (CS) revenue claim. Environmental Stewardship claim forms will be emailed or posted to you."
        },
        {
            "text": "Capital claims may be submitted throughout the year. You must submit your claim within 3 months of your agreement end date."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "BP5 Forms and Online Applications"
        },
        {
            "text": "We have not reformatted the paper application form (BP5) and the online application summary for 2022."
        },
        {
            "text": "Therefore, some sections have been greyed out, such as Part D: Greening, and Part I: Land in more than one area of the UK. Remaining sections stay the same as previous years, for example Part C: Field data sheet and Part H: Entitlements."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Validating Your Email Address "
        },
        {
            "text": " "
        },
        {
            "text": "From March 2022, you need to validate your personal email address. This will improve the way we manage the contact details that we hold for you. You will only need to do this once, or whenever you change your email address."
        },
        {
            "text": "The email address we hold for you needs to be unique and not registered by someone else. This will allow us to contact you with important information."
        },
        {
            "text": "You can validate your email address when signing into the Rural Payments service. You’ll be asked to update and/or confirm you email address before you can proceed any further into the service."
        },
        {
            "text": "Once you have confirmed your email address, you’ll receive an email containing a link to validate the address. The link expires after 12 hours."
        },
        {
            "text": "There will be an option to skip this validation during peak periods."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Lump Sum Exit Scheme"
        },
        {
            "text": " "
        },
        {
            "text": "The Lump Sum Exit Scheme is for BPS applicants in England who wish to leave farming. This could be for a number of reasons including retirement or to take up a different occupation."
        },
        {
            "text": "The scheme will help those farmers who wish to retire or leave farming to do so in a planned way. We also expect the scheme will free up land for new entrants and existing farmers who wish to expand."
        },
        {
            "text": "You may wish to apply for BPS in 2022 as well as applying for the Lump Sum Exit Scheme. This will protect you if you find that you are not eligible, cannot complete the transfer of your land in time, or decide to withdraw your application before payments are made."
        },
        {
            "text": "We expect to open the Lump Sum Exit Scheme for applications from April until the end of September 2022."
        },
        {
            "text": "You can find information about the scheme on the Lump Sum Exit Scheme guidance page on GOV.UK. Look out for the further guidance we will issue when we open the scheme."
        },
        {
            "text": "Follow us on social media for the latest updates and information on the following accounts."
        },
        {
            "text": "By following and subscribing to our social channels and blog, you’ll be able to see the latest updates about important information. We also share top tips and announcements. You can also listen to The RPA Podcast which we have launched to help farmers, landowners and rural communities keep up to date with the latest news from RPA."
        },
        {
            "text": "We look forward to receiving your applications for BPS and your ES and CS revenue claims."
        }
    ]
}