{
    "url": "https://socialcare.blog.gov.uk/2022/03/15/the-wres-is-a-pivotal-moment-for-racial-equality/",
    "title": "The WRES is a pivotal moment for racial equality",
    "authors": [
        "Shakiesha Beckford",
        "Che-kwon Sterling"
    ],
    "categories": [
        "Workforce",
        "WRES"
    ],
    "pub_date": "2022-03-15T12:44:33+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Brent's commitment to equality"
        },
        {
            "text": "Shakeisha Bedford: Here at Brent Council, we are under no illusion that racial inequalities and discriminatory practices are ever-present and embedded into the systems and structures of our society and, by extension, the working environment."
        },
        {
            "text": "It is a widely accepted fact we do not live in a post-racial society, with equality of opportunity ingrained as a standard rather than a societal aspiration. The introduction of the Workforce Race Equality Standard (WRES) by the Department of Health and Social Care represents a pivotal moment and makes the pursuit of workplace equality in social care official."
        },
        {
            "text": "Brent council's long-standing commitment to equality, and more precisely, embedding equality and diversity in our borough and workforce has been illustrated in our borough plans and initiatives. However, the WRES has provided us with a unique opportunity to enhance our focus on racial inequalities in social care."
        },
        {
            "text": "Over the next 12 months, Brent’s adult social care and children and young people departments will work together to tackle areas of inequality. This will include collecting data against indicators of equality and developing an action plan."
        },
        {
            "text": "To drive and oversee our progress against indicators, a WRES working group has been established. The working group will act as the link for and the voice of minority ethnic staff and provide insight and support in the development of the WRES action plan."
        },
        {
            "text": "Meanwhile, mentoring schemes at Brent are providing valuable tools and perspectives for colleagues to help them achieve workplace equality at an individual level…"
        },
        {
            "heading": 2,
            "text": "What good looks like"
        },
        {
            "text": "Che-Kwon Sterling: As a young Black woman, I understood the importance of a mentor and have sought this support since graduating from university. According to Oprah Winfrey “A mentor is someone that allows you to see the hope inside of yourself”."
        },
        {
            "text": "I approached the operational director of children’s services, an older white man, and asked him to be my mentor and he gladly agreed. The first mentoring session was extremely useful. We agreed on the time and frequency of each session and had the flexibility to go beyond a designated period if we needed to."
        },
        {
            "text": "We explored and discussed various themes including the challenges I wanted to overcome, my feeling about my work and value in the workplace, and how this mentorship might help me achieve my goals and desires."
        },
        {
            "text": "The second session explored my career plans. I devised a five-year plan taking into account life events such as having children and marriage. We discussed my plan in-depth and reviewed the skills gaps and qualifications I would require to get to my desired level. We had various job descriptions open and we went through each one carefully focusing on how to enhance my current skills and obtain new ones."
        },
        {
            "text": "Following these sessions, I now had a plan and needed to take action to make sure I fulfilled my goals. Within three months, I had a new role and had completed my Prince2 Qualification."
        },
        {
            "text": "My mentor also shared his CV with me, which allowed me to think strategically and understand how he became an operational director. This broadened my mind and allowed me to understand and appreciate the variety of ways I could achieve my chosen goal."
        },
        {
            "text": "The implementation of the WRES at Brent will help make sure all staff and particularly colleagues from ethnic backgrounds are offered the support and training necessary to achieve their goals."
        },
        {
            "text": "In this way, our staff not only have hope, but also the tools needed to succeed. That said, my personal experience has shown that irrespective of race, gender or age of mentor, having such a colleague is beneficial to career development."
        }
    ]
}