{
    "url": "https://socialcare.blog.gov.uk/2023/01/13/dementia-care-and-the-benefit-of-experience/",
    "title": "Dementia care and the benefit of experience",
    "authors": [
        "Heather Connell"
    ],
    "categories": [
        "Care and support",
        "Dementia",
        "Workforce"
    ],
    "pub_date": "2023-01-13T13:21:00+00:00",
    "content": [
        {
            "heading": 2,
            "text": "The power of placements"
        },
        {
            "text": "I’m a registered nurse working for specialist dementia care provider, Vida Healthcare. I’d like to share my experience of working in a specialist dementia care home and why more nurses should consider gaining experience within care settings like these."
        },
        {
            "text": "After gaining a level two and three diploma in health and social care and workplace experience at Vida Healthcare, I knew within a short space of time dementia care was where I wanted my career to progress."
        },
        {
            "text": "I’d previously worked at Vida for a couple of years as a carer and team leader. In September 2022, I graduated from the University of Bradford as a registered nurse, before returning to the care provider."
        },
        {
            "text": "During my time at university, I undertook a range of clinical placements to gain a broad range of experience and to make sure dementia-specific care was right for me. I enjoyed my placements in acute care, surgery and anaesthesia, but wanted to provide all round holistic care on a more permanent basis, rather than just fixing problems and discharging patients."
        },
        {
            "text": "Working at Vida has shown me how important it is for all nurses to have the opportunity to take a placement or work in a specialist dementia care setting and to interact with people living with dementia. The more experience you have, the more you understand why people living with the disease act in certain ways. This gives you the knowledge and confidence to provide appropriate care."
        },
        {
            "text": "My days are always varied. As a trainee, I was given many opportunities to shadow nurses across various settings, including residential, nursing and acute. I’m now involved in medication rounds, serving residents and providing different levels of assistance depending on their needs."
        },
        {
            "text": "In some settings, we may provide various activities to keep residents occupied and mentally stimulated. This also gives us more opportunities to spend time with them in positive situations."
        },
        {
            "heading": 2,
            "text": "Overcoming anxiety with empathy"
        },
        {
            "text": "Challenges can be presented if a resident becomes distressed, particularly for those individuals who may find it more difficult to communicate effectively. At Vida, we receive a significant amount of training on how to de-escalate situations and support residents to avoid becoming distressed. Building a relationship with a resident also helps, as it enables you to understand and avoid any triggers which might cause them stress."
        },
        {
            "text": "Our work is so much more than simply giving out medication to people. We build relationships with our residents and care for the whole person – they’re not a statistic or someone who is unknown. We learn their daily routine, we know their likes and dislikes, and we know how to keep them happy. It’s really rewarding when we have the opportunity to spend time with them. Even simply sitting down and enjoying a companionable cup of tea can be a highlight of our day."
        }
    ]
}