{
    "url": "https://veteranstoday.blog.gov.uk/2023/01/13/employers-hail-industrious-veterans/",
    "title": "Employers hail industrious veterans",
    "authors": [
        "michaelball"
    ],
    "categories": [
        "Armed Forces",
        "Veterans",
        "Veterans Support",
        "Veterans Today",
        "Veterans Welfare and Support"
    ],
    "pub_date": "2023-01-13T13:24:22+00:00",
    "content": [
        {
            "text": "Former military personnel enjoy strong public support in the UK, a study has revealed.Some 71% of employers believe veterans have a strong work ethic, while a vast majority of fellow employees say veterans are resilient individuals they are happy to work alongside, the YouGov report shows.The study, which will help shape policy initiatives, was commissioned by the Office for Veterans’ Affairs and examined perceptions of former military personnel.More than 12,000 members of the public, as well as employers, healthcare professionals and members of the media across of the UK, shared their perceptions of Armed Forces veterans, their views on how veterans are treated after they leave service and their opinion on veterans are portrayed in the media."
        },
        {
            "text": "Employers also highlighted significant potential benefits from using the skills veterans have acquired to fill skill gaps across many industries.Minister for Veterans’ Affairs Johnny Mercer (pictured with ex-military now working for Barclays) said: ‘Whilst the majority of veterans transition seamlessly to civilian life, some need additional help. This study will be vital to shaping our strategy to get our veterans into work after their time serving this country.‘It shows the willingness of employers across the country to take full advantage of the opportunity that these skilled individuals can provide.’The report also makes a number of recommendations, including stepping up working with employers to provide them with more information and guidance, particularly focusing on the diverse range of skills and benefits ex-Service personnel can bring to employers. The report also says misconceptions around mental health in the veteran community should be tackled, with more communications around the challenges veterans do and do not face."
        },
        {
            "text": "The Office for Veterans’ Affairs and the wider government already have a number of programmes in place to boost veteran employment. These include:• Businesses and other organisations employing veterans in their first civilian receiving a one-year National Insurance holiday• Promoting opportunities for Service leavers and veterans to go into careers with the uniformed and health services, as well as teaching• Launching the Going Forward Into Employment scheme, to provide a clear pathway for veterans, military partners and spouses who need extra support into employment and other opportunities in the public sector• The Great Place to Work Scheme, where more than 840 Civil Service jobs have been offered to veterans since the start of 2020.You can read the full report here."
        }
    ]
}