{
    "url": "https://dcmslibraries.blog.gov.uk/2023/01/13/libraries-sector-in-the-new-year-honours/",
    "title": "Libraries sector in the New Year Honours",
    "authors": [
        "Nicole Agyekum, Libraries Team , DCMS"
    ],
    "categories": [
        "Library news"
    ],
    "pub_date": "2023-01-13T09:51:16+00:00",
    "content": [
        {
            "text": "Congratulations to the 6 people working in or with the public libraries sector in England who were awarded honours last week in recognition of their contribution to libraries. You can read more below about some of the work they have done."
        },
        {
            "heading": 2,
            "text": "Knight Commander of the Most Excellent Order of the British Empire (KBE)"
        },
        {
            "text": "Roly Keating. Chief Executive, British Library. "
        },
        {
            "text": "Following an illustrious career at the BBC where he rose to be Controller of BBC2 and then Controller of Archive Content, Roly Keating oversaw the launch of a new long-term strategy for the British Library (Living Knowledge which has successfully positioned the British Library’s role  in an increasingly digital age alongside  retaining the integrity of the Library’s focus on its historic collections). He has initiated a series of significant developments, including a shift to large-scale digital collecting, the incorporation of the Public Lending Right service, the opening of the Newsroom (a new Reading Room at St Pancras dedicated to news collections across all media formats) and the development of a network of  20 regional Business and Intellectual Property Centre hubs linked to  linked to a wider network of Enterprising Libraries across the country."
        },
        {
            "text": " "
        },
        {
            "heading": 1,
            "text": "Member of the Order of the British Empire (MBE)"
        },
        {
            "text": "Sue Crowley. Strategic manager for Library and Registration, Somerset County Council."
        },
        {
            "text": "During a period of financial strain, Sue Crowley led a programme of service re-design and public consultation which transformed Somerset Libraries into a thriving and dynamic service, with a sustainable future for small rural libraries. As a result, opening hours have increased, usage has gone up and libraries have seen re-developments and investments from community partners. Somerset’s approach to its redesign programme is recognised nationally as an exemplar. Sue  also led Somerset Libraries through organisational and workforce transformation, reducing costs and embedding a positive, empowering working culture."
        },
        {
            "text": "Sue is a supporter of digital innovation and her vision and resolve secured partnership funding for a digital makerspace called Glass Box. The makerspace has become an important  part of Somerset’s digital innovation and inspires people of all ages to explore and develop 3D printing, virtual reality and coding. Thanks to this, Somerset Libraries was finalists in the Digital Leaders 100 Awards 2019 for its Digital Skills Academy which inspired students to consider a career in the digital arena."
        },
        {
            "text": " "
        },
        {
            "heading": 1,
            "text": "British Empire Medal (BEM)"
        },
        {
            "text": "Zoey Dixon. Library Hubs Manager, Lambeth Council. "
        },
        {
            "text": "A development librarian in Lambeth, Zoey is an inspirational leader in the fields of both youth librarianship and diversity across the libraries sector. "
        },
        {
            "text": "Zoey has been active within the Youth Library Group of CILIP (the professional association for library and information professionals) most recently as London chair, and she is well known for championing Black writers and writing, as well as young and LGBT+ voices. She was named as their Youth Library Group  Librarian of the Year in 2020, which recognises innovation and dedication by a staff member working with children and young people in a public library setting. Zoey has participated in initiatives such as the National Shelf Service, which promotes librarian-recommended books to help widen readers’ horizons. She also leads on training and events for the CILIP Black Asian and Minority Ethnic  Network, which is a forum for librarians and information professionals from Black Asian and Minority Ethnic backgrounds to share their experiences, support each other and network."
        },
        {
            "text": "For several years, Zoey has been on the selection panel for The Reading Agency’s Summer Reading Challenge and Booktrust’s Letterbox Club, as well as judging the 2020 Booktrust Storytime Prize and CILIP’s prestigious Carnegie and Kate Greenaway awards, and the 2021 Branford Boase awards."
        },
        {
            "text": " "
        },
        {
            "text": "Sylvia Knights. Vice Chair, Suffolk Libraries."
        },
        {
            "text": "Retiring as a software developer early and moving from London to Suffolk in 2004, one of Sylvia’s first activities was volunteering for Bungay Library. When, in 2011, it was proposed that Suffolk County Council would divest the library service, with the potential loss of over half the branches across the county, including Bungay, Sylvia became actively involved in leading the campaign to challenge the plans and ultimately to help shape the decision. "
        },
        {
            "text": "Due to  her obvious passion for libraries, expertise and knowledge developed in leading aspects of the campaign, Sylvia was appointed to the Interim Board in February 2012 when Suffolk Libraries was first set up. She was a pioneer in creating the vision and governance for the first library mutual in the country. She has continued as an active Board member steering  it through its early days and establishing it as an exemplar of good practice and innovation, which in turn has helped shape library services across the country."
        },
        {
            "text": "Sylvia has immense energy and commitment to making life better for people in her community, and helping and supporting others, through the library service and her other voluntary activities in the area. in addition to her pivotal role in Suffolk Libraries, Sylvia is a trustee for the Friends of Bungay Library and was  a town councillor, serving as Bungay Mayor 2014/15; also a trustee of Bungay Town Trust, serving as Town Reeve 2018/19."
        },
        {
            "text": " "
        },
        {
            "text": "Hilary Marshall. Past Treasurer, The Association of Senior Children’s and Educational Librarians (ASCEL). "
        },
        {
            "text": "Hilary Marshall has been at the heart of children’s library services in Derby and Derbyshire for nearly 40 years. She is a passionate advocate of children’s library services, and has led her team with exceptional energy and enthusiasm. Hillary has worked hard to ensure that the needs of children have been properly reflected in the various new libraries that the City Council has built since 2009."
        },
        {
            "text": "During her tenure she has overseen various innovations including the introduction of Homework Clubs and Code Clubs across many Derby libraries, to meet local needs and develop skills. She also managed a very  successful Bookstart programme, a smooth transition from traditional storytimes to rhyme-times, and a series of successful Summer Reading Challenges. "
        },
        {
            "text": "She has also had a huge impact nationally through her tireless and selfless voluntary work as a board member, and also Treasurer, of the Association of Senior Children’s and Educational Librarians (ASCEL). This provided a platform for her to share her knowledge and insights with colleagues in other authorities"
        },
        {
            "text": " "
        },
        {
            "text": "Chris Garnsworthy. Lately Community Library Services Manager, London Borough of Hackney. "
        },
        {
            "text": "Chris Garnsworthy championed the Hackney home library service, helping those who have been housebound due to illness or age, and those in the local hospital and hospice. Throughout his career he went above and beyond to champion Hackney’s scheme, and connect people delivering similar schemes across the county to share good practice and improve services. "
        },
        {
            "text": "Hackney Libraries home visit service is the largest in London and recently celebrated its 70th anniversary. Having been involved in this service for 28 years, Chris had a  positive impact on the service, winning a nationally acclaimed WOW! award for excellence in customer service in 2017. He oversaw many changes, including the introduction of electric vehicles to the service in 2017 Chris set up and took part in a Reading Group for housebound people and was the driving force behind a Dementia Friendly jigsaw project in Hackney, which was launched in May 2019. Fifteen bespoke Hackney designs were made into jigsaws for those with medium to advanced dementia. Since the launch, the service has been contacted from around the UK and beyond, with organisations and individuals asking for details on how to replicate the project using their own designs."
        },
        {
            "text": "Chris has spoken at conferences in the UK, as well as in America and Canada, about providing home visit services. He was also instrumental in setting up and running the first ever UK conference dedicated to home library services in October 2019, which saw attendees coming to Hackney from all over the country to learn and share ways to deliver these services."
        },
        {
            "text": " "
        },
        {
            "text": "Congratulations also to Stephen Bleakley, former Libraries NI Area Manger who received an MBE."
        },
        {
            "text": " "
        }
    ]
}