{
    "url": "https://publicguardian.blog.gov.uk/2023/01/13/simplified-process-for-verifying-the-death-of-a-donor-attorney-deputy-or-guardian/",
    "title": "Simplified process for verifying the death of a donor, attorney, deputy or guardian",
    "authors": [
        "iymaatiq1"
    ],
    "categories": [
        "Attorneys",
        "Deputies",
        "Digital",
        "General",
        "health and welfare",
        "lasting power of attorney",
        "LPA"
    ],
    "pub_date": "2023-01-13T15:32:38+00:00",
    "content": [
        {
            "text": "\n[English] - [Cymraeg]"
        },
        {
            "text": "We have simplified the process we follow after being notified that someone has died. We now verify deaths using the Post Office (HMPO) Life Event Verification system, so there is no longer a need for people to send in a death certificate unless we specifically ask for it.\nThe Life Event Verification System is used across government and is a safe and efficient way to confirm deaths. However, we may need to see a copy of the death certificate if there are any issues with verifying a death."
        },
        {
            "text": "You can find out more about what this process looks like in our published practice note."
        },
        {
            "heading": 3,
            "text": "When to let OPG know if someone passes away"
        },
        {
            "text": "We need to be notified following the death of:"
        },
        {
            "text": "• A donor of a registered Enduring or Lasting Power or Attorney\n• An attorney acting under a registered Enduring or Lasting Power of\nAttorney\n• A replacement attorney\n• A deputy appointed by the Court of Protection\n• Someone for whom the Court of Protection has appointed a deputy\n• A High Court-appointed guardian or missing person"
        },
        {
            "text": "It’s important we are informed of the death of a donor, attorney, deputy, or guardian so we can ensure the relevant documents are updated or cancelled as appropriate, and our register is updated."
        },
        {
            "heading": 3,
            "text": "What happens when you notify OPG of a death"
        },
        {
            "text": "It can be a difficult time when someone dies, so we have tried to make the process as simple as possible."
        },
        {
            "text": "• Notify us of a death by email, telephone or letter\n• Return the original LPA or EPA to us so that we can process any updates or cancellations\n• We will use the Life Event Verification system to verify the death and then write to the relevant person to acknowledge this\n• We will confidentially dispose of any cancelled LPA or EPA\n• If a court appointed deputy or guardian passes away, we will advise what action should be taken next. If a new deputy is needed, we will let the relevant local authority know so they can help with this. If a new guardian is needed, we will let the relevant parties know so that they can take appropriate action"
        },
        {
            "text": "If you are struggling following the death of a loved one, you can find details of help and support locally here."
        },
        {
            "text": "If you have any further questions about any of the above, you can email us at customerservices@publicguardian.gov.uk or call us on 0300 456 0300."
        },
        {
            "text": " "
        }
    ]
}