{
    "url": "https://space.blog.gov.uk/2023/01/13/the-night-sky-in-january-3/",
    "title": "The night sky in January",
    "authors": [
        "Derek Smale"
    ],
    "categories": [
        "Astronomy"
    ],
    "pub_date": "2023-01-13T13:20:30+00:00",
    "content": [
        {
            "text": "2023 begins with a fantastic opportunity to see all of the planets in our Solar System, as well as beautiful objects like the Pleiades star cluster and the Andromeda galaxy.  Astronomers are also closely watching a comet that may become visible with the naked eye towards the end of the month."
        },
        {
            "heading": 2,
            "text": "The Moon and planets"
        },
        {
            "text": "This month is a good month to try and spot all the planets in our Solar System, as well as observe conjunctions of the Moon with Mars and Jupiter."
        },
        {
            "text": "Innermost planet Mercury becomes easier to spot towards the end of the month, rising in the south-east as the dawn skies start to lighten."
        },
        {
            "text": "Venus reappears in our evening skies, low in the south-west in the hour or so after the Sun sets. On the evenings of 21 – 23 January, Venus will appear to pass close to Saturn, and the two will make a particularly spectacular sight on 23 January when they are joined by a thin crescent Moon."
        },
        {
            "text": "On the evening of 25 January, the Moon passes close by Jupiter and (for those with binoculars) Neptune, before eclipsing Uranus in the early hours of 29 January.  Unfortunately for UK stargazers, the actual eclipse takes place after the Moon has set, but those with binoculars can still spot Uranus (around 2.9 billion kilometres, or 1.6 billion miles away) as the Moon (around 380,000km or 240,000 miles from Earth) appears to approach it."
        },
        {
            "text": "Did you know?"
        },
        {
            "text": "Venus is the hottest planet in our Solar System, despite being around twice the distance from the Sun as innermost planet Mercury. This is because Venus’ thick atmosphere traps heat, raising temperatures to around 465 degrees celsius."
        },
        {
            "text": "While the side of Mercury that faces the sun can rise to around 430 degrees celsius, the lack of an atmosphere means the temperature on the ‘night side’ of Mercury can drop to -180 degrees Celsius."
        },
        {
            "text": "These vast temperature differences make it particularly difficult to develop Mercury-bound spacecraft such as the European Space Agency’s BepiColumbo mission, which will have another encounter with the innermost planet in June this year. You can find out more about this mission here."
        },
        {
            "heading": 2,
            "text": "Comet 2022 E3 (ZTF)"
        },
        {
            "text": "A comet discovered in March 2022 has brightened significantly as it headed in towards our Sun. It swung around the Sun on 12 January, and will head back out of the Solar System, passing its closest point to Earth at the start of February."
        },
        {
            "text": "It is currently only visible with the aid of binoculars or a telescope, but astronomers are hoping it will brighten enough to become visible with the naked eye, where it’ll be visible throughout the night high in our northern skies."
        },
        {
            "heading": 2,
            "text": "Space science and exploration"
        },
        {
            "text": "The James Webb Space Telescope continues to perform well since it reached its destination in space - around 1.5 million kilometres (1 million miles) from Earth. It recently observed a rocky planet the same size as Earth, around a star 41 light-years away."
        },
        {
            "text": "The planet, provisionally called LHS 475b, orbits so close to its parent star that a year lasts just two Earth-days!  You can find out more about the JWST mission here."
        }
    ]
}