{
    "url": "https://socialcare.blog.gov.uk/2022/12/21/a-message-for-the-festive-season-from-deborah-sturdy/",
    "title": "A message for the festive season from Deborah Sturdy",
    "authors": [
        "Deborah Sturdy"
    ],
    "categories": [
        "Care and support",
        "Carers",
        "Leadership",
        "Workforce"
    ],
    "pub_date": "2022-12-21T10:57:22+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Strength through adversity"
        },
        {
            "text": "It’s been another eventful, challenging, but productive year, a year in which adult social care colleagues have continued to deliver amazing care and support right across the country."
        },
        {
            "text": "In a constantly changing world, your compassion, skills and experience have brought comfort and reassurance to individuals, families and communities who would have struggled to cope without you."
        },
        {
            "text": "Their diversity of need is a reflection of the wonderful diversity in our ranks. The launch, this year, of the first leadership programme for ethnic minority social care nurses is a confident case in point. I am looking forward to sharing colleagues’ stories as they begin this exciting journey. True leadership must be representative of all of us and I believe this programme will help us achieve that goal."
        },
        {
            "text": "Effective leadership is also about showing others what works and having the evidence to prove it. That’s why it’s been so gratifying to see the progress made in the last 12 months to develop a strong social care research base. We are experts in care, voices of positive professional challenge, but the more we can back up our frontline experiences with data, the more influence we can bring to bear in wider decisions about care and support."
        },
        {
            "heading": 2,
            "text": "Our voice at the heart of care and support"
        },
        {
            "text": "In the same spirit, the recent invitation to social care nurses to become chairs of the new shared decision-making councils in every Integrated Care Board (ICB) in England is another exciting demonstration of the growing visibility and esteem of our profession."
        },
        {
            "text": "And we’ve already seen our colleagues being deservedly visible at the annual Nursing Times Awards. Meanwhile, it’s been an honour to present many more gold and silver Chief Nurse for Adult Social Care Awards to colleagues across a variety of care settings and in a wide range of roles."
        },
        {
            "text": "I’m feeling hopeful 2023 will allow us to build on all these developments and successes and give more credit and support to the 1.6 million people who work in social care in England. Thanks again for your hard work, dedication and commitment to the very highest standards of care."
        },
        {
            "text": "Have a safe and healthy festive season and a Happy New Year."
        }
    ]
}