{
    "url": "https://dvladigital.blog.gov.uk/2022/12/21/dvla-code-challenge-2022-celebrating-stem-skills-across-wales/",
    "title": "DVLA Code Challenge 2022 - celebrating STEM skills across Wales",
    "authors": [
        "Mark Jones"
    ],
    "categories": [
        "DVLA Digital Services"
    ],
    "pub_date": "2022-12-21T11:54:52+01:00",
    "content": [
        {
            "text": "On Tuesday 6 December, we held our 7th annual Code Challenge, with even more opportunities for pupils of all ages to take part. Sian Lloyd, news presenter, hosted the event which was streamed live to children across Wales. Last year, we ran a fully remote event that was streamed live on Microsoft Teams. With the removal of restrictions this year, I was thrilled to see the return of our in-person DVLA Code Challenge at the Richard Ley Development Centre (RLDC) in Swansea, which was bigger and better than ever. Over 300 school children and teachers from across Wales joined us for the live final, with even more taking part through a live stream."
        },
        {
            "heading": 2,
            "text": "Ready? Set? Code!"
        },
        {
            "text": "The Code Challenge was split into categories based on age (7 to 11 and 11 to 16) and there were 12 different themes that were set by our associates. This was now each school’s opportunity to showcase the results of all their hard work and efforts to their fellow competitors, the judges and to those streaming from locations across Wales."
        },
        {
            "text": "This year, we also gave students aged 16 to 18 the opportunity to get involved for the first time by introducing a new ‘Commerce in Code Challenge’. We invited sixth forms and college students to participate in a 2-week work experience opportunity with us, challenging them to design a new DVLA STEM website."
        },
        {
            "text": "Each school showcased a video of the game they had coded, followed by a live presentation. We listened as students gave insight into how they coded them, using online tools such as ‘Scratch’. We also got to see a live demonstration of every game. It was great to see young people using the skills needed to think like coders, and you could really see their sense of pride after receiving a long-lasting round of applause from the audience."
        },
        {
            "text": "With the conclusion of our entrants’ presentations, we opened the voting for everyone at the event, as well as those who were watching at home, to decide their favourites."
        },
        {
            "heading": 2,
            "text": "Fun and games for all"
        },
        {
            "text": "Now that the vote was open and the morning’s activities were concluded, it was time to break for lunch. This gave all pupils – and teachers – the chance to investigate the interactive stalls which were set up outside by our partners and sponsors. It was wonderful to see children of all ages getting stuck in and having fun with the games and challenges."
        },
        {
            "text": "Immediately after lunch, we got the participants warmed up for the afternoon ahead with a game of “Beachball Bingo” - we launched dozens of numbered beachballs across the room and each number called won a prize in the form of IT bundles, Lego kits, drones and much more."
        },
        {
            "heading": 2,
            "text": "And the winners are…"
        },
        {
            "text": "All that was left to do was announce the winners of the different age categories. It’s amazing to see how skilled these children are and you can’t help but wonder what bright futures await them. But in the end, the results were counted, confirmed and the winners were announced…"
        },
        {
            "text": "First place – winning £2000 for their schools:"
        },
        {
            "text": "Second place – winning £1,500 for their schools:"
        },
        {
            "text": "In third place – winning £1,000 for their schools:"
        },
        {
            "text": "‘Special prize’ for having the best video - winning £1,000 for their school - Ysgol Gynradd Gymraeg Pontardawe."
        },
        {
            "text": "Last but not least, I’m proud to reveal that the winner of ‘Commerce in Code’ was Coleg Sir Gar, winning £3,000 of IT equipment and the chance to make their concept a reality with us in the future."
        },
        {
            "text": "Finally, I’d like to extend our gratitude to all of our wonderful partners and sponsors. Without their exceptional support, none of these events would be possible."
        },
        {
            "heading": 2,
            "text": "Here’s what our participants had to say…"
        },
        {
            "text": "Harry Jones, Pupil at St. Joseph’s Catholic School"
        },
        {
            "text": "Martha Getliff, Teacher at Cantref Primary (winners, 7 to 11-year-old category category)"
        },
        {
            "text": "Holly Stephenson, Teacher at Bishopston Primary School"
        },
        {
            "heading": 2,
            "text": "Interested in getting involved?"
        },
        {
            "text": "The Code Challenge is getting bigger and better every year. If you’d like to enter your primary or secondary school, sixth form, or college into our 2023 Code Challenge, registration will be available early next year. For details on how to sign up, keep an eye out across our social media channels and the DVLA STEM website."
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}