{
    "url": "https://deframedia.blog.gov.uk/2022/12/21/increased-fishing-opportunities-worth-750-million-agreed-for-2023/",
    "title": "Increased fishing opportunities worth £750 million agreed for 2023",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Fisheries"
    ],
    "pub_date": "2022-12-21T11:53:48+00:00",
    "content": [
        {
            "text": "There was widespread media coverage after the UK yesterday (20 December 2022) reached an agreement with the EU to secure over £280 million of fishing opportunities for the UK fishing industry. This brings the total value of fishing opportunities secured for the UK fleet in 2023 in the three main negotiation forums to £750 million, a £34 million increase from last year."
        },
        {
            "text": "The outcomes of the fisheries negotiations were reported across national and trade media outlets including the Telegraph, the Times, the Express, the Daily Mail, Financial Times, Press Association and Press & Journal. The Express also carried an opinion piece from Fisheries Minister Mark Spencer in which he welcomed the increase in fishing opportunities while reiterating the importance of safeguarding the marine environment."
        },
        {
            "text": "Fisheries Minister Mark Spencer said:"
        },
        {
            "text": "The deal between the UK and EU yesterday agreed catch levels for 69 important fish stocks, including some of the most commercially valuable stocks to the UK fishing industry such as North Sea Nephrops (£54m), Anglerfish (£31m) and Western hake (£25m)."
        },
        {
            "text": "It follows an agreement with the UK, EU and Norway on six North Sea fish stocks worth £202m to the UK fishing industry, and a further £11 million in stocks in other waters around the UK. The UK has also secured catch limits worth a further £256m with the North East Atlantic coastal States, while an agreement with Norway last month will see the UK fishing industry benefit from fishing opportunities worth £5 million in 2023."
        },
        {
            "text": "Sustainability has been at the heart of the UK’s approach to all the negotiations to ensure key fish stocks are protected and to support the long-term viability of the UK fishing industry. Wherever possible, catch levels have been set in line with, or lower than, the level advised by scientists at the International Council for the Exploration of the Sea (ICES), and there is an estimated 13% increase in catch levels that align with ICES advice compared to last year."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}