{
    "url": "https://socialcare.blog.gov.uk/2022/12/21/making-carers-visible/",
    "title": "Making carers visible",
    "authors": [
        "David Wilmott"
    ],
    "categories": [
        "Care and support",
        "Carers",
        "coronavirus",
        "Workforce"
    ],
    "pub_date": "2022-12-21T12:23:32+00:00",
    "content": [
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Passport to improved support"
        },
        {
            "text": "At Cygnet Health Care we were excited to recently launch our first ever Carers Passport. It is important to us to improve the experience for carers looking after adults with mental health and learning disabilities."
        },
        {
            "text": "Our carers’ passport is a record which identifies a carer and sets out an offer of support, which will help to improve and embed identification, recognition and support for carers across Cygnet Health Care services. We want to make a commitment to carers to recognise and value the support they provide. We put service users at the heart of what we do but we also understand this can be a stressful time for families and carers in particular."
        },
        {
            "text": "We want to work in partnership with carers and make them visible across our services. Carers are essential partners in the care of the people they support, so we wish to involve them and support them wherever possible."
        },
        {
            "text": "The family and friend Carer Passport will not only help individuals identify themselves as a carer, it will allow Cygnet Health Care staff to immediately recognise a carer. It is part of a commitment to involve carers in the “Triangle of Care” whereby carers, service users and staff work collaboratively to promote recovery and wellbeing. Carers and the essential role they play will be identified at first contact with services or as soon as possible after and staff will be trained to engage with carers more effectively."
        },
        {
            "heading": 2,
            "text": "Carers at the heart of care"
        },
        {
            "text": "By introducing a Carers Passport, we are better able to involve them in discussions about the care, treatment and discharge of the patient or service user. Carers should be involved with staff to devise care plans for their loved one and across the board, staff are making a commitment to share information with carers in a timely manner. That is why it is so important we are introducing a way for carers to readily identify themselves to staff."
        },
        {
            "text": "We also recently launched our Carers Network, a new initiative aimed at offering an increased level of support to carers involved with Cygnet’s national services. Through the network, carers will be able to access practical support and advice from Cygnet professionals on the management and support of people with a learning disability and behaviour that challenges, as well as on managing their own health and wellbeing. Carers will also be able to help shape the design and improvement of Cygnet services."
        },
        {
            "heading": 2,
            "text": "Find out more"
        },
        {
            "text": "From a carers point of view, it’s important to have your voice heard, particularly when it comes to accessing services. In the long-term, we hope the network can also contribute to the wider debate on the future of mental health care, so that it effects real change for those carers looking after an adult with an enduring mental health condition or learning difficulty."
        },
        {
            "text": "More information about the network, how to register for meetings and useful information about caring and carer’s rights can be found here. Or you can email Family&Friends@cygnethealth.co.uk"
        }
    ]
}