{
    "url": "https://history.blog.gov.uk/2022/12/21/visiting-the-secret-state-margaret-thatcher-and-intelligence/",
    "title": "Visiting the secret state: Margaret Thatcher and Intelligence",
    "authors": [
        "Dr Dan Lomas"
    ],
    "categories": [
        "Cabinet Secretaries",
        "FCDO Historians",
        "Intelligence Services",
        "Intelligence Services",
        "Past prime ministers"
    ],
    "pub_date": "2022-12-21T09:35:08+00:00",
    "content": [
        {
            "text": "An early task of any new Prime Minister is to familiarise themselves with the UK's intelligence agencies – the Secret Intelligence Service (SIS/MI6), Government Communications Headquarters (GCHQ) and the Security Service (MI5)."
        },
        {
            "text": "Yet, for all the interest they may have in this clandestine world, many of those who have taken office have lacked experience of intelligence first hand. While some have juggled a series of complex briefs across government, others were relative novices. Few, like Winston Churchill and Clement Attlee, have had the intelligence apprenticeship they need."
        },
        {
            "text": "Having entered office, Prime Ministers are briefed on what the UK’s intelligence agencies can, and cannot, do. They also receive the Weekly Survey of Intelligence, or ‘Red Book’, from the assessment body, the Joint Intelligence Committee (JIC), with secret material from SIS, MI5 and GCHQ provided by alternative means."
        },
        {
            "text": "Briefings on intelligence are just one form of introduction to the secret state machinery. Visits are another. While there are gaps, released files do allow an insight into Margaret Thatcher’s visits to the UK intelligence machinery. After Churchill, she comes a close second for her passion for the secret world. One senior official recalled, ‘Mrs Thatcher was a devotee of intelligence. She liked it, she respected it she believed it gave her the truth’."
        },
        {
            "text": "On 29 February 1980, Margaret Thatcher became the first ever Prime Minister to attend a meeting of the JIC. Then committee chair, Antony Acland, noted that the JIC was ‘gratified and encouraged by the Prime Minister’s interest in intelligence, and her attendance at this meeting would be a stimulus to its work’.  Thatcher herself later acknowledged the importance of the visit. “I found the occasion both thoroughly enjoyable in its own right and of value in the longer term”, she wrote to Acland: \"The work of the Committee is of considerable importance.\""
        },
        {
            "text": "The visit to the JIC was just the beginning. On 10 April 1980, Margaret Thatcher also became the first Prime Minister since Churchill to visit the UK’s signals intelligence agency. Arriving at GCHQ’s Oakley site in Cheltenham, she began the visit by being briefed on GCHQ’s work by its Director, Sir Brian Tovey. The visit was broken down into 3 sessions.[1] The first focused on non-Soviet Bloc collection and the work of GCHQ’s K Division. Other topics included cryptanalysis, translation, traffic analysis, and the distribution of reporting, followed by lunch with the GCHQ Directorate. Michael Herman, then Head of J Division (Soviet Bloc Production area), ran a second session on Soviet Bloc traffic, with the third, and final, session led by GCHQ’s Chief Scientist Ralph Benjamin. It was in the final briefing that Thatcher was told for the first time about Zircon, GCHQ’s ill-fated top-secret satellite project, later cancelled due to rising costs."
        },
        {
            "text": "Nevertheless, the Prime Minister remained an enthusiastic supporter of the project. Tovey maintained an excellent relationship with her, and GCHQ’s intelligence was to have an important influence on the Falklands conflict in 1982."
        },
        {
            "text": "Margaret Thatcher’s diplomatic private secretary, Michael Alexander (himself the son of legendary wartime cryptanalyst Hugh Alexander), later wrote the Prime Minister ‘enjoyed’ the visit. In a letter to senior staff, Tovey reflected that ‘the visit was an outstanding success which can only reflect credit upon GCHQ as a whole. My warmest congratulations to you all.’"
        },
        {
            "text": "In September 1984, the SIS’s Chief Colin Figures asked Sir Robert Armstrong, the Cabinet Secretary, whether the Prime Minister would visit SIS’s headquarters in Century House.[2] In a draft itinerary, Figures suggested up to an hour and a half briefing on ‘current problems, including, perhaps, the Afghan scene and one or two of our most important agent cases’.[3] The visit would also include lunch with ‘medium-grade and junior staff-members’ plus a ‘walk-about’ including the communications department, registry and card index. Writing to the Prime Minister’s private secretary, Armstrong wrote there was ‘an element of ‘keeping up with the Joneses’ about this’, citing an earlier (and undated) visit by Mrs Thatcher to MI5, yet suggested the trip would be ‘interesting and useful’."
        },
        {
            "text": "Margaret Thatcher's appointments diary records that this trip took place on 25 September 1984, and like the earlier GCHQ visit, it went exceptionally well.  In a letter to Figures,  Thatcher wrote:"
        },
        {
            "text": "Thank you very much for your hospitality and for the excellent arrangements made for my visit today. I found the various briefings and demonstrations of the greatest possible interest. I was much impressed by the knowledge, dedication and professionalism of those whom I met. Please thank them all."
        },
        {
            "text": "   On a visit of this sort, I am inevitably unable to meet more than a few people. I would therefore like to take this opportunity of saying a word of thanks to all members of your service. I know that a great deal of their work goes unrecognised and unsung. In the nature of things, very few people can know the full extent of their contribution to preserving our liberty and helping others secure theirs. I should like all members of the service to know that they have my full support and my warm appreciation of their work."
        },
        {
            "text": "Margaret Thatcher’s understanding of intelligence went far beyond her reading of reports. Visits to the intelligence agencies were part of a wider effort to develop understanding of departments, personalities and processes, and a valuable opportunity for the Prime Minister to show her appreciation of the intelligence she received. For the agencies, showing the Prime Minister what they did was vital and part of an effort to maintain budgets. Mrs Thatcher’s determined support for Zircon in the face of wider opposition on cost grounds is testament to her advocacy of intelligence, something perhaps reinforced by her visits. With a new Prime Minister, the need for close intelligence-policy relations is important, and visits can be important in cementing the bond with the occupants of Number 10."
        },
        {
            "text": "[1] The GCHQ Historical Team assisted the author by providing details of the visit."
        },
        {
            "text": "[2] Details of the visit can be found at The National Archives in file PREM 19/1635."
        },
        {
            "text": "[3] One of the ‘important’ agent cases Mrs Thatcher is likely to have been briefed on was that of Oleg Gordievsky, the KGB officer posted to the Soviet Embassy in London, who had been recruited by SIS in 1974."
        }
    ]
}