{
    "url": "https://ukhsa.blog.gov.uk/2023/09/19/get-winter-strong-revisiting-respiratory-infection-guidance-for-a-safer-season/",
    "title": "Get Winter Strong: revisiting respiratory infection guidance for a safer season",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Coronavirus (COVID-19)"
    ],
    "pub_date": "2023-09-19T18:35:01+01:00",
    "content": [
        {
            "text": "As we brace ourselves for chillier days, more indoor gatherings and seasonal social events with friends and family, now is the ideal time to revisit the current guidance on face coverings, isolation, vaccination and other behaviours that can reduce the spread of COVID-19 and other respiratory infections known to peak during the autumn and winter period."
        },
        {
            "text": "The recent emergence of COVID-19 variant B.A 2.86 has led some people to ask if they should change their behaviour in response to this or any other new variant. However, there are currently no changes to the advice on what to do if you have, or think you may have COVID-19, influenza (flu) or any other respiratory infection."
        },
        {
            "text": "What does current guidance say?"
        },
        {
            "text": "The guidance on Living Safely with respiratory infections including coronavirus (COVID-19) issued in April 2022, still applies."
        },
        {
            "text": "It sets out a range of simple actions you can continue to take to reduce the spread of COVID-19 and other respiratory infections, and protect those at highest risk:"
        },
        {
            "text": "What should I do if I have symptoms?"
        },
        {
            "text": "If you have symptoms of a respiratory infection, such as COVID-19 or flu, and you have a high temperature or do not feel well enough to go to work or carry out normal activities, try to stay at home and avoid contact with other people, until you no longer have a high temperature (if you had one) or until you no longer feel unwell."
        },
        {
            "text": "If you need to go out, then avoid close contact with anyone who you know is at  higher risk of becoming seriously unwell. The full guidance on what to do if you have symptoms is available at: Guidance for Living Safely with respiratory infections including coronavirus (COVID-19)."
        },
        {
            "text": "Who can get free COVID-19 tests?"
        },
        {
            "text": "You may be able to get free COVID-19 rapid lateral flow tests if you have a health condition which means you're eligible for COVID-19 treatments, or work in healthcare or in a hospice."
        },
        {
            "text": "If you’re not eligible, you can buy rapid lateral flow tests from some pharmacies and retailers, in person or online."
        },
        {
            "text": "What should I do if I test positive for COVID-19?"
        },
        {
            "text": "If you have a positive COVID-19 test result you should try to stay at home and avoid contact with other people for 5 days after the day you took your positive test, even if you have no symptoms."
        },
        {
            "text": "You should avoid meeting people at higher risk of becoming seriously ill with COVID-19 for 10 days after the day you took your test. See the full guidance on what to do if you test positive for COVID-19."
        },
        {
            "text": "Am I eligible for COVID-19 vaccination?"
        },
        {
            "text": "Thanks to the success of our vaccine programme, we have built a strong, broad immune defences against COVID-19 throughout the population. However, some people remain more vulnerable to severe illness from COVID-19, and vaccination will provide the best protection against severe infection this winter."
        },
        {
            "text": "Those eligible for an autumn COVID-19 vaccine are:"
        },
        {
            "text": "All the vaccines advised for the 2023 autumn booster campaign are expected to be effective at preventing serious illness and hospitalisation from COVID-19. If you are offered a booster vaccination, or any other COVID-19 or Flu vaccinations, please accept the offer as soon as you are able to. It is important to have your vaccine to build up your protection against severe illness before the winter."
        },
        {
            "text": "Should pregnant women have a COVID-19 vaccine?"
        },
        {
            "text": "All pregnant women are defined as part of a clinical risk group and are encouraged to get vaccinated to protect themselves and their unborn babies. Being pregnant changes how your body fights infections like COVID-19 and catching it while pregnant increases your risk and your baby's risk of complications which may result in hospitalisation."
        },
        {
            "text": "The COVID-19 vaccine can be given safely to expectant mothers at any stage of pregnancy, even right from the start."
        },
        {
            "text": "Should I be wearing a face covering?"
        },
        {
            "text": "Along with the other measures set out in the Living with COVID-19 guidance, face coverings continue to be a useful tool in limiting the spread of COVID-19 and other respiratory viruses in some situations."
        },
        {
            "text": "As existing guidance states, wearing a well-fitting face covering when unwell can reduce the number of particles containing viruses that are released from the mouth and nose of someone who is infected with COVID-19 and other respiratory infections. This is standard respiratory health advice and guidance on face coverings has not changed since it was published in April 2022."
        },
        {
            "text": "Face coverings can also protect the person wearing them from becoming infected with other respiratory viruses."
        },
        {
            "text": "There is further information on when people with symptoms of a respiratory infection or a positive COVID-19 test result should consider wearing a face covering available in the guidance for people with symptoms of a respiratory infection or a positive test result."
        },
        {
            "text": "What should I do if my child is unwell?"
        },
        {
            "text": "Current guidelines for parents state that it's fine to send your child to school with a minor cough or common cold. However, children should not be sent to school if they have a temperature of 38°C or above, or if they feel unable to go to school or do their normal activities. See the NHS ‘Is my child too ill for school?’ guidance for further information."
        },
        {
            "text": "There is wide agreement among health and educational professionals that school attendance is vital to the life chances of children and young people. Being in school regularly improves mental and physical health, wellbeing and socialisation throughout children’s lives."
        },
        {
            "text": "This year, children and young people up to year 11 are being offered the flu vaccination nasal spray at their school or college: parents should look out for the electronic or paper consent form and be sure to return it when asked to do so."
        },
        {
            "text": "If you have a child aged 2 or 3 years on 31 August 2023 (born between 1 September 2019 and 31 August 2021), you can book a flu vaccine at your GP Practice. Find out more at the NHS website."
        },
        {
            "text": "See our ‘back to school’ post for more information and advice on keeping children healthy when they return to the classroom."
        },
        {
            "text": "By all doing our bit to prevent transmission, we can help our families and communities get winter strong."
        }
    ]
}