{
    "url": "https://food.blog.gov.uk/2023/09/19/join-our-scientific-advisory-committees-2/",
    "title": "Join our Scientific Advisory Committees",
    "authors": [
        "Professor Robin May, Chief Scientific Adviser"
    ],
    "categories": [
        "Science"
    ],
    "pub_date": "2023-09-19T12:16:47+01:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "This autumn we are looking for new members to join our Science Council and Scientific Advisory Committees (SACs)."
        },
        {
            "text": "In this blog, we talk to current members of our SACs to find out about their roles, and to hear about their experience of being a SAC member."
        },
        {
            "text": "As a science and evidence-led organisation, our SACs are key to the work we do. The committees gather and evaluate scientific information which helps us to prioritise our work and ensures our advice to consumers is based on the best and most recent scientific evidence. Independent advice and information from these committees is crucial for us to ensure food is safe and is what it says it is."
        },
        {
            "text": "SAC members are appointed from a wide range of disciplines. We are currently recruiting for a variety of roles including chair of our Science Council, an expert in cellular toxicology to join our Committee on Toxicity of Chemicals in Food, Consumer Products and the Environment (COT) and an expert in clinical allergy to join our Advisory Committee on Novel Foods and Processes (ACNFP). You can find out more about the kind of people we are looking for on each SACs dedicated website."
        },
        {
            "text": "In this blog you will hear from:"
        },
        {
            "heading": 2,
            "text": "What are your roles and responsibilities in the committee you are a member of?"
        },
        {
            "text": "Dr Helen Warren: As part of the Advisory Committee on Animal Feedingstuffs (ACAF), I help evaluate dossiers against regulation guidance for a wide array of additives for use in different species. As part of the committee, I review the three sections (identity, safety and efficacy) of the dossier and highlight any areas of concern or sections that need more evidence or information for us to make a decision."
        },
        {
            "text": "I predominantly focus on the efficacy section as this is my area of expertise. I then discuss my evaluation with the rest of the committee and the committee as a whole makes conclusions on the dossier, which are then sent to the Secretariat."
        },
        {
            "text": "Effectively, we are risk assessors."
        },
        {
            "text": "Dr Jane Gibbens: I am a veterinary epidemiologist bringing expertise and understanding of foodborne zoonoses, risk analysis and study design to the Advisory Committee on the Microbiological Safety of Food (ACMSF)."
        },
        {
            "text": "Martin Briggs: As a member of ACMSF, I provide views and information related to farm animal feed and its potential impact on the safety of human food via the animals that eat the feed. For ACAF my main role is to assess the additives that are going to be used in animal feed from the points of view of:"
        },
        {
            "text": "The committee also considers the effects of the additives on the environment and if the additives do what they say."
        },
        {
            "text": "Peter Gregory: I have been a member of the Science Council since mid-2020 and before that I was the Chair of the Advisory Committee for Novel Foods and Processes for a decade. I’ve just finished being part of a working group looking at various activities to achieve net zero carbon and their potential consequences for food safety."
        },
        {
            "heading": 2,
            "text": "What is the best thing about your role?"
        },
        {
            "text": "Dr Helen Warren: I really enjoy scrutinising data and experimental design, and I enjoy being part of something that contributes to enhancing livestock health and welfare."
        },
        {
            "text": "Dr Jane Gibbens: Being able to provide my expertise to improve the committee’s understanding of the food safety threats we consider, and learning from the diverse expertise among other members of the committee. These contribute to interesting and useful discussions of the challenges considered, leading to productive advice to the FSA on the management of the issues considered."
        },
        {
            "text": "Martin Briggs: The best thing is that I’m genuinely making a positive difference by using my knowledge and experience for the benefit of us all. I’ve also met some great new colleagues and they are always keen to hear the views of others on the committee."
        },
        {
            "text": "Peter Gregory: The best thing about being on the FSA Science Advisory Committees is the excellent people that I come into contact with, and their depth of knowledge. I also like being stretched by topics that I wouldn’t otherwise have thought about and using my skills in those challenging areas. I feel that we are making a real contribution to ensuring that the British public has safe food to eat."
        },
        {
            "heading": 2,
            "text": "How has being on the Science Council or one of the Scientific Advisory Committees helped you in your career?"
        },
        {
            "text": "Dr Helen Warren: I have learnt a great deal about other sections of dossiers I was not familiar with, particularly the safety section. I can now better help our own Regulatory department as I have a much greater understanding of the whole dossier preparation process than I did prior to joining the committee. It also made me appreciate the time it takes to fully evaluate and assess a dossier (and the ACAF is only one cog in a bigger wheel)."
        },
        {
            "text": "Dr Jane Gibbens: I am recently partly retired, and membership of the committee helps me to maintain and develop my expertise despite working fewer hours."
        },
        {
            "text": "Martin Briggs: I’m always learning, which helps me in my day job!"
        },
        {
            "text": "Peter Gregory: I am ‘retired’ but being part of the council keeps me engaged with current scientific advances and changes in thinking."
        },
        {
            "heading": 2,
            "text": "Who would you encourage to apply?"
        },
        {
            "text": "Dr Helen Warren: The safety section of the dossier is the one that often takes the longest time to go through and requires specific expertise, such as microbiology and toxicology. People with expertise in manufacturing feeds and feed additives are also in short supply and are vital for the identity section of the dossier. Pig, poultry, and ruminant nutritionists are often the go-to people for the efficacy section, so people with these areas of expertise are always needed."
        },
        {
            "text": "Dr Jane Gibbens: I would encourage anyone with relevant skills to apply both for their own interest, and to support the FSA’s useful work. The diversity of members and issues considered can really broaden every participant’s perspective, and the structure and functioning of the Committee ensures good use is made of the discussions and recommendations to inform the FSA on how best to protect public health."
        },
        {
            "text": "Martin Briggs: If you’re only thinking about applying, then do it! When I applied, I honestly thought I wasn’t up to the calibre of other committee members, some of whom seemed far senior, but all of us have got more valid knowledge and experience than we realise. For me it’s been great that I have been able to contribute far more than I expected."
        },
        {
            "text": "Peter Gregory: Please do apply even if you think that your knowledge will be tangential to the FSA’s interests. You will find that your generic and particular scientific and other skills will be used in the Science Council."
        },
        {
            "heading": 3,
            "text": "Find out more about the roles and apply to join the FSA's Scientific Advisory Committees and Science Council."
        },
        {
            "heading": 1,
            "text": "Ymunwch â’n Pwyllgorau Cynghori Gwyddonol"
        },
        {
            "text": "Yr hydref hwn, rydym yn chwilio am aelodau newydd i ymuno â’n Cyngor Gwyddoniaeth a’n Pwyllgorau Cynghori Gwyddonol."
        },
        {
            "text": "Yn y blog hwn, rydym yn siarad ag aelodau presennol o’n Pwyllgorau Cynghori Gwyddonol i gael gwybod am eu rolau, ac i glywed am eu profiad o fod yn aelod o un o’n pwyllgorau."
        },
        {
            "text": "Fel sefydliad sy’n cael ei arwain gan wyddoniaeth a thystiolaeth, mae ein pwyllgorau’n allweddol i’r gwaith a wnawn. Mae’r pwyllgorau’n casglu ac yn gwerthuso gwybodaeth wyddonol sy’n ein helpu i flaenoriaethu ein gwaith ac yn sicrhau bod ein cyngor i ddefnyddwyr yn seiliedig ar y dystiolaeth wyddonol orau a diweddaraf. Mae cyngor a gwybodaeth annibynnol gan y pwyllgorau hyn yn hanfodol i ni er mwyn sicrhau bod bwyd yn ddiogel ac yn cyd-fynd â’r hyn sydd ar y label."
        },
        {
            "text": "Caiff aelodau ein pwyllgorau eu penodi o ystod eang o ddisgyblaethau, ac rydym yn recriwtio ar hyn o bryd ar gyfer amrywiaeth o rolau gan gynnwys: cadeirydd ein Cyngor Gwyddoniaeth; arbenigwr mewn tocsicoleg gellog i ymuno â’n Pwyllgor ar Wenwyndra Cemegion mewn Bwyd, Cynhyrchion Defnyddwyr a’r Amgylchedd (COT); ac arbenigwr mewn alergedd clinigol i ymuno â’n Pwyllgor Cynghori ar Fwydydd a Phrosesau Newydd (ACNFP). Gallwch ddysgu mwy am y math o bobl rydym yn chwilio amdanynt ar wefan benodol pob Pwyllgor Cynghori Gwyddonol."
        },
        {
            "text": "Yn y blog hwn byddwch yn clywed gan:"
        },
        {
            "heading": 2,
            "text": "Beth yw eich rolau a’ch cyfrifoldebau yn y pwyllgor rydych yn aelod ohono?"
        },
        {
            "text": "Dr Helen Warren: Fel rhan o’r Pwyllgor Cynghori ar Fwyd Anifeiliaid (ACAF), rwy’n helpu i werthuso coflenni yn erbyn canllawiau rheoleiddio ar gyfer amrywiaeth eang o ychwanegion i’w defnyddio mewn gwahanol rywogaethau. Fel rhan o’r pwyllgor, rwy’n adolygu’r tair adran (hunaniaeth, diogelwch ac effeithiolrwydd) o’r goflen ac yn tynnu sylw at unrhyw feysydd sy’n peri pryder neu adrannau sydd angen mwy o dystiolaeth neu wybodaeth er mwyn i ni wneud penderfyniad."
        },
        {
            "text": "Rwy’n canolbwyntio’n bennaf ar yr adran effeithiolrwydd gan mai dyma fy maes arbenigedd. Yna, byddaf yn trafod fy ngwerthusiad â gweddill y pwyllgor a bydd y pwyllgor cyfan yn dod i gasgliadau ar y goflen, sydd yna’n cael ei hanfon at yr Ysgrifenyddiaeth."
        },
        {
            "text": "I bob pwrpas, aseswyr risg ydym ni."
        },
        {
            "text": "Dr Jane Gibbens: Rwy’n epidemiolegydd milfeddygol, ac mae fy nghyfraniad i at y Pwyllgor Cynghori ar Ddiogelwch Microbiolegol Bwyd (ACMSF) yn cynnwys arbenigedd a dealltwriaeth o filheintiau a gludir gan fwyd, dadansoddi risg a dylunio astudiaethau."
        },
        {
            "text": "Martin Briggs: Fel aelod o ACMSF, rwy’n darparu safbwyntiau a gwybodaeth yn ymwneud â bwyd anifeiliaid fferm a’i effaith bosib ar ddiogelwch bwyd pobl trwy’r anifeiliaid sy’n bwyta’r bwyd anifeiliaid. Ar gyfer ACAF, fy mhrif rôl yw asesu’r ychwanegion sy’n mynd i gael eu defnyddio mewn bwyd anifeiliaid o safbwynt:"
        },
        {
            "text": "Mae’r pwyllgor hefyd yn ystyried effeithiau’r ychwanegion ar yr amgylchedd ac a yw’r ychwanegion yn gwneud yr hyn y maent yn honni ei wneud."
        },
        {
            "text": "Peter Gregory: Rwy wedi bod yn aelod o’r Cyngor Gwyddoniaeth ers canol 2020 a, chyn hynny, fi oedd Cadeirydd y Pwyllgor Cynghori ar Fwydydd a Phrosesau Newydd, a hynny am ddegawd. Rwy newydd orffen bod yn rhan o weithgor sy’n edrych ar weithgareddau amrywiol i gyflawni carbon sero net a’u canlyniadau posib ar gyfer diogelwch bwyd."
        },
        {
            "heading": 2,
            "text": "Beth yw’r peth gorau am eich rôl?"
        },
        {
            "text": "Dr Helen Warren: Rwy wir yn mwynhau craffu ar ddata a dylunio arbrofol, ac rwy’n mwynhau bod yn rhan o rywbeth sy’n cyfrannu at wella iechyd a lles da byw."
        },
        {
            "text": "Dr Jane Gibbens: I mi, y peth gorau am fy rôl yw gallu darparu fy arbenigedd i wella dealltwriaeth y pwyllgor o’r bygythiadau diogelwch bwyd rydym yn eu hystyried, a dysgu o’r arbenigedd amrywiol ymhlith aelodau eraill o’r pwyllgor. Mae’r rhain yn cyfrannu at drafodaethau diddorol a defnyddiol am yr heriau dan sylw, gan arwain at gyngor cynhyrchiol i’r ASB ar reoli’r materion dan sylw."
        },
        {
            "text": "Martin Briggs: Y peth gorau yw fy mod i wirioneddol yn gwneud gwahaniaeth cadarnhaol trwy ddefnyddio fy ngwybodaeth a’m profiad er budd pawb ohonom. Rwy hefyd wedi cyfarfod â chydweithwyr newydd gwych ac maen nhw bob amser yn awyddus i glywed barn eraill ar y pwyllgor."
        },
        {
            "text": "Peter Gregory: Y peth gorau am fod ar Bwyllgorau Cynghori Gwyddonol yr ASB yw’r bobl ragorol rwy’n dod i gysylltiad â nhw, a dyfnder eu gwybodaeth. Rwy hefyd yn hoffi cael fy ymestyn gan bynciau na fyddwn i wedi meddwl amdanyn nhw fel arall a defnyddio fy sgiliau yn y meysydd heriol hynny. Rwy’n teimlo ein bod ni’n gwneud cyfraniad gwirioneddol at sicrhau bod gan y cyhoedd ym Mhrydain fwyd diogel i’w fwyta."
        },
        {
            "heading": 2,
            "text": "Sut mae bod ar y pwyllgor/cyngor wedi eich helpu yn eich gyrfa?"
        },
        {
            "text": "Dr Helen Warren: Rwy wedi dysgu llawer iawn am adrannau eraill o goflenni nad oeddwn i’n gyfarwydd â nhw, yn enwedig yr adran ddiogelwch. Rwy nawr yn gallu helpu ein hadran Rheoleiddio ein hunain yn well gan fy mod i’n deall yr holl broses o baratoi coflenni’n well o lawer nag oeddwn i cyn ymuno â’r pwyllgor. Mae hefyd wedi gwneud i mi werthfawrogi’r amser mae’n ei gymryd i werthuso ac asesu coflen yn llawn (a dim ond un rhan o’r darlun yw’r ACAF)."
        },
        {
            "text": "Dr Jane Gibbens: Rwy wedi ymddeol yn rhannol yn ddiweddar, ac mae bod yn aelod o’r pwyllgor yn fy helpu i gynnal a datblygu fy arbenigedd er mod i’n gweithio llai o oriau."
        },
        {
            "text": "Mr Martin Briggs: Rwy bob amser yn dysgu, sy’n fy helpu i yn fy swydd bob dydd!"
        },
        {
            "text": "Peter Gregory: Rwy wedi ‘ymddeol’, ond mae bod yn rhan o’r cyngor yn fy nghadw i’n gyfoes â datblygiadau gwyddonol cyfredol a ffyrdd newydd o feddwl."
        },
        {
            "heading": 2,
            "text": "Pwy fyddech chi’n ei annog i wneud cais?"
        },
        {
            "text": "Dr Helen Warren: Yr adran ddiogelwch o’r goflen yw’r un sy’n aml yn cymryd y mwyaf o amser i fynd drwyddi ac sy’n galw am arbenigedd penodol, fel microbioleg a thocsicoleg. Mae pobl ag arbenigedd mewn gweithgynhyrchu bwyd anifeiliaid ac ychwanegion bwyd anifeiliaid hefyd yn brin ac maent yn hanfodol ar gyfer yr adran hunaniaeth o’r goflen. Yn aml, maethegwyr moch, dofednod ac anifeiliaid cnoi cil yw’r bobl i alw arnynt ar gyfer yr adran effeithiolrwydd, felly mae wastad angen pobl ag arbenigedd yn y meysydd hyn."
        },
        {
            "text": "Dr Jane Gibbens: Byddwn i’n annog unrhyw un sydd â sgiliau perthnasol i wneud cais er eu diddordeb eu hunain, ac i gefnogi gwaith defnyddiol yr ASB. Gall amrywiaeth yr aelodau a’r materion a ystyrir ehangu persbectif pob cyfranogwr, ac mae strwythur a gweithrediad y pwyllgor yn sicrhau y gwneir defnydd da o’r trafodaethau a’r argymhellion i hysbysu’r ASB ar y ffordd orau o ddiogelu iechyd y cyhoedd."
        },
        {
            "text": "Mr Martin Briggs: Ydych chi’n ystyried ymgeisio? Yna, ewch amdani! Pan wnes i gais, ro’n i wir yn meddwl nad oeddwn’n i’n ddigon da o gymharu ag aelodau eraill y pwyllgor – roedd rhai ohonyn nhw i’w gweld yn fwy profiadol o lawer. Ond y gwir yw bod gwybodaeth a phrofiad pob un ohonom ni’n fwy gwerthfawr nag ydyn ni’n sylweddoli. I mi, mae wedi bod yn wych gallu cyfrannu llawer mwy nag oeddwn i wedi’i ddisgwyl."
        },
        {
            "text": "Peter Gregory: Gwnewch gais da chi, hyd yn oed os ydych chi’n credu y bydd eich gwybodaeth yn ymylol i fuddiannau’r ASB. Fe welwch y bydd y Cyngor Gwyddoniaeth yn manteisio ar eich sgiliau gwyddonol cyffredinol a phenodol, ynghyd â’ch holl sgiliau eraill."
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}