{
    "url": "https://rpc.blog.gov.uk/2023/09/19/launch-of-reformed-better-regulation-framework/",
    "title": "Launch of reformed Better Regulation Framework",
    "authors": [
        "Stephen Gibson"
    ],
    "categories": [
        "Better regulation",
        "Evaluation",
        "Independent scrutiny"
    ],
    "pub_date": "2023-09-19T19:34:52+01:00",
    "content": [
        {
            "text": "The Government has today launched the reformed Better Regulation Framework (BRF). This was announced in May 2023, as part of the Government’s plans to reform its approach to managing regulation."
        },
        {
            "text": "The RPC welcomes the new Framework which includes many changes that we have advocated:"
        },
        {
            "text": "We hope that the new BRF will focus government on only regulating where necessary and keeping regulatory burdens to a minimum, as well as evaluating regulations after implementation to ensure that they are delivering on their objectives."
        },
        {
            "text": "As the independent Better Regulation Watchdog, the RPC has been preparing for its updated role ahead of the new Framework coming into force. We have begun to develop our approach to reviewing Options Assessments in order to assist Departments in developing their regulatory proposals. We have also considered how we will monitor and report on the Government’s delivery of Post Implementation Reviews."
        },
        {
            "text": "There will be a period of transition until September 2024, as Departments transfer to the new Framework. The RPC looks forward to working with colleagues across government to ensure that the new framework is introduced and operates as smoothly as possible. The RPC aims to hold an event for all its stakeholders to help embed the new Framework; more details will follow."
        },
        {
            "text": "In the meantime, we will continue our engagement with external stakeholders to understand how regulation impacts them and to feedback their comments on the revised BRF."
        },
        {
            "text": "If you have feedback or reflections on the new Framework, please feel free to contact us on regulatoryenquiries@rpc.gov.uk."
        }
    ]
}