{
    "url": "https://ukhodigital.blog.gov.uk/2023/09/19/sustainable-navigation-for-the-african-great-lakes-and-rivers/",
    "title": "Sustainable navigation for the African Great Lakes and Rivers",
    "authors": [
        "Tim Lewis"
    ],
    "categories": [
        "UKHO"
    ],
    "pub_date": "2023-09-19T16:07:22+01:00",
    "content": [
        {
            "text": "The Southern African and Islands Hydrographic Commission (SAIHC) established a sub working group in February 2021 for the African Great Lakes and Rivers, after recognising the in-land waterways’ importance to the region’s transport and trade."
        },
        {
            "text": "Traditionally, hydrographic offices or hydrographic commissions are associated with charting the world’s oceans for safe navigation. However, due to the vast size and depth of the region’s inland waters, a unique opportunity arose to work more collaboratively with those nations adjacent to the African Great Lakes to deliver sustainable and modern navigational products for mariners and marine users operating in the region."
        },
        {
            "text": "To achieve this, the African Great Lakes and Rivers sub Working Group (AGLRsWG) was established, comprising industry stakeholders and government representatives from Kenya, Malawi, Mozambique, South Africa, Uganda, and Zambia. These representatives were assembled to help engage, share and develop awareness of marine activities in the region. The UK Hydrographic Office (UKHO) was appointed as chair to the AGLRsWG and has since funded and facilitated in-person meetings that aim to generate greater awareness of the shared challenges faced by the group and to find collaborative solutions to maximise resources."
        },
        {
            "text": "Discussions between the key stakeholders during these meetings uncovered several common challenges, including limited funding, experience and expertise, as well as numerous opportunities to overcome these, such as greater communication, collaboration, and shared resource and capability. For example, reducing duplication of effort when collecting marine data and making it accessible would enable navigational products and services to be updated more easily, supporting safer navigation and informed marine use of the African Great Lakes and Rivers."
        },
        {
            "heading": 2,
            "text": "Why are the African Great Lakes important?"
        },
        {
            "text": " The African Great Lakes are a series of seven lakes that connect 11 countries in and around the East African Rift. They include Lake Victoria, the second largest freshwater lake in the world by area, and Lake Tanganyika, the world's second largest freshwater lake by volume and depth. These lakes constitute about 25% of the world’s unfrozen fresh water and 10% of the world's fish species. They are, therefore, an important source of food and fresh water for the region and along with the connected rivers and in-land waterways, provide a network of corridors for industry, trade and transportation."
        },
        {
            "text": "Recently there has been an increase in the use of the lakes and associated waterways for transporting cargo. However, availability of official navigational products and safety information has to date been limited for most of the lakes in the East Africa region, with little capacity or resource to maintain any of the existing navigational products and marine information."
        },
        {
            "heading": 2,
            "text": "Working together for safer navigation and better use of the marine environment"
        },
        {
            "text": "Last year, the AGLRsWG delegates met on board the research and hydrographic survey vessel Timba in Lake Malawi. The group was involved in collecting hydrographic data, learning about the equipment used, and the methods in which the data could be correctly stored and made available."
        },
        {
            "text": "Working collaboratively to collect and share data means the information can be used for multiple purposes and is therefore a more sustainable way of working. Shared resources can also lead to funding opportunities for capacity building and training; if the regions work together to collect the marine data, the provision of up-to-date navigation and safety information (including digital solutions) can be developed. Additionally, the potential to share environmental data in common formats will assist evidence-based decision-making, helping to reduce negative environmental impacts."
        },
        {
            "text": "The group will now build on this initial work to broaden efforts across the region to provide up-to-date navigational products and services for the communities and marine users of the African Great Lakes and Rivers."
        },
        {
            "heading": 2,
            "text": "Benefits of collaboration for the region"
        },
        {
            "text": "Through improved collaboration, it is hoped this initiative will bring many benefits to the region:"
        }
    ]
}