{
    "url": "https://deframedia.blog.gov.uk/2023/09/14/accelerated-sfi-payments-and-plans-to-boost-british-produce-announced-at-back-british-farming-day/",
    "title": "Accelerated SFI payments and plans to boost British produce announced at Back British Farming Day",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Farming"
    ],
    "pub_date": "2023-09-14T11:33:54+01:00",
    "content": [
        {
            "text": "Yesterday was Back British Farming Day, where the government announced a package of measures to help people “buy British” and provide farmers with the cashflow they need to invest in their businesses – which have been widely among farming trade press, including Farmers Weekly and Farmers Guardian."
        },
        {
            "text": "Addressing a parliamentary reception hosted by the NFU, the Food and Farming Secretary backed calls for industry-led action to signpost customers to ‘buy British’ when they shop online."
        },
        {
            "text": "The government has also confirmed that farmers producing sustainable British food under our environmental land management schemes will be able to use them to help meet public procurement standards, benefiting our British farmers and allowing the public sector to benefit from more excellent British food."
        },
        {
            "text": "Ahead of starting to accept applications for the Sustainable Farming Incentive on Monday 18 September, the government also confirmed that those who have a live agreement before the end of the year will receive an accelerated payment – worth 25% of the annual value of their agreement – in the first month of this agreement. This will help with cashflow and make sure that SFI works for farm businesses."
        },
        {
            "text": "The scheme has been expanded and made more flexible in response to farmers’ feedback – with no cap being placed on the number of farmers who can enter. It will pay farmers for taking actions that support food production, farm productivity and resilience, while protecting the environment. Thousands of farmers are set to benefit from the new accelerated payments this year."
        },
        {
            "text": "Food and Farming Secretary Thérèse Coffey said:"
        },
        {
            "text": "Farming Minister Mark Spencer said:"
        }
    ]
}