{
    "url": "https://childrenssocialcare.blog.gov.uk/2023/09/14/being-an-independent-visitor-to-a-looked-after-child/",
    "title": "Being an Independent Visitor to a looked after child",
    "authors": [
        "Jayne Yerou"
    ],
    "categories": [
        "Uncategorized",
        "Wellbeing"
    ],
    "pub_date": "2023-09-14T09:31:51+01:00",
    "content": [
        {
            "text": " Jayne Yerou, commercial insurance lead at the Department for Education explains her experience of being an Independent Visitor. As a naturally warm and supportive person, she has thoroughly enjoyed getting to know the young person she visits, and they have developed a strong bond.  "
        },
        {
            "text": "What is an Independent Visitor?  "
        },
        {
            "text": "Any looked after child who has not had contact with their birth family for more than 12 months is entitled to have an Independent Visitor. It’s a voluntary role and involves committing to seeing your allocated child once a month to build a relationship.  "
        },
        {
            "text": "As an Independent Visitor, you are an impartial adult, giving your time to listen to a young person’s needs and worries, enjoy fun activities together and build a lasting relationship they can count on.  "
        },
        {
            "text": "How you spend your time together is your choice and expenses are reimbursed up to a set sum. After each visit you are required to write a brief report, noting the child’s wishes, feelings and any safeguarding concerns.  "
        },
        {
            "text": "What made me interested?  "
        },
        {
            "text": "I became an Independent Visitor about 2 years ago. At the time, I worked for Wolverhampton Council and in this role, I was often exposed to claims made against the authority, including those made on behalf of looked after children - for abuse, failure to intervene etc.  "
        },
        {
            "text": "I worked closely with the Director of Children's Service, who was formerly the Head of Looked After Children.  She was probably the most effective and passionate leader in children’s services I had ever encountered. So, when a campaign started rolling out to recruit Independent Volunteers, I applied because I wanted to support the service she ran so well.  "
        },
        {
            "text": "Additionally, in a previous role for a different authority in the early 2000s I was a mentor to a young person who was Not in Education, Employment or Training (NEET) for a 6-month term. Being a mentor made me realise how passionate I am about supporting people and making a positive difference to a young person’s life – no matter how big or small.   "
        },
        {
            "text": "My experience  "
        },
        {
            "text": "What makes being an Independent Visitor special to me, is that you will possibly be the only adult in their life who chooses to see them without a contractual relationship – like their teachers, social workers and foster carers. I usually set aside a Saturday once a month but have taken volunteer special leave to do things in school holidays sometimes.   "
        },
        {
            "text": "My young person has been through a great deal of personal trauma, and I like to think that our relationship and quality time together has a positive impact on her mental health. We have banter and laugh a lot – often because I get lost driving to the places she wants to go to! We have visited art galleries and museums, the cinema, the theatre, shopping centres, beautiful parks, the hairdressers and on and on. "
        },
        {
            "text": "After 2 years we have a great relationship – I really look forward to seeing her. I am confident my young person would talk to me about anything she was worried about. I will continue to see her regularly until she is 18 next year and goes to university (although I keep dropping hints to her about the care leavers internship in the civil service!) and I am sure she will stay connected after she is 18.   "
        },
        {
            "text": "Not many people have heard about Independent Visitors, hence why I am keen to spread the word and encourage others to put themselves forward.  My theory is… Not many people can change the world to become a better place, but if every person tried to help just one single person… I imagine the world would be much better. "
        },
        {
            "text": "Interested in becoming an Independent Visitor?  "
        },
        {
            "text": "Find out more about what’s involved with becoming an Independent Visitor.  "
        },
        {
            "text": "Apply to be an Independent Visitor. "
        }
    ]
}