{
    "url": "https://cddo.blog.gov.uk/2023/09/14/get-cloud-certified-this-october/",
    "title": "Get Cloud Certified this October",
    "authors": [
        "Edward McCutcheon, Principal Technical Architect, CDDO"
    ],
    "categories": [
        "CDDO",
        "DDaT",
        "DDaT community",
        "DDaT events",
        "Digital learning and development"
    ],
    "pub_date": "2023-09-14T14:18:24+01:00",
    "content": [
        {
            "text": "In celebration of the 10th anniversary, and the recent refresh, of the Government Cloud First policy, the Central Digital and Data Office (CDDO) is excited to announce UK Public Sector Cloud Certification October! This is the most exciting month for those in the UK Public Sector to learn and achieve a Cloud certification as CDDO has secured free or discounted training, support classes and exam vouchers. If you’ve already achieved a Cloud certification, why not aim for the next level of certification, or learn about services from a different Cloud provider?"
        },
        {
            "text": "As part of the Transforming for a digital future roadmap, we’re aiming for over 90% of digital, data and technology professionals to undertake related training at least once a year and Cloud Certification month will support this.. This event is open to anyone with a public sector email address (such as gov.uk, gov.scot, gov.wales, nhs.uk, police.uk)."
        },
        {
            "text": "We have dedicated listings for each Cloud provider detailing training and events running in October to help you learn and how to access free or discounted exam vouchers. You might also have additional training available through existing learning and development arrangements your organisation already has in place with third party training providers; do search your existing intranet to see if you have access to year-round Cloud training or a Digital Academy in your organisation."
        },
        {
            "text": "Sam, a Software Engineer in UK Government, said:"
        },
        {
            "text": "After you’ve achieved your certification, please report your achievement to CDDO by using the certification achieved form."
        },
        {
            "text": "Brought to you by the Government Technical Cloud Community. You can read more about CDDO’s Cloud community in an earlier blog."
        }
    ]
}