{
    "url": "https://naturalengland.blog.gov.uk/2023/09/14/species-recovery-programme-capital-grant-scheme-awards/",
    "title": "Species Recovery Programme Capital Grant Scheme awards",
    "authors": [
        "Karen Shelley-Jones",
        "James Phillips"
    ],
    "categories": [
        "Species recovery"
    ],
    "pub_date": "2023-09-14T10:33:33+01:00",
    "content": [
        {
            "text": "By Karen Shelley-Jones, Species Recovery Programme Manager and James Phillips, Principal Adviser for Species Recovery and Species Re-introductions"
        },
        {
            "text": "England’s species are amazing. They can charm, intrigue, amaze, inspire and frighten us. They spark our interest and concern. They are also critical components and indicators of, healthy, thriving and resilient ecosystems on land, freshwater and at sea."
        },
        {
            "text": "However, many of England’s native species are threatened and in serious decline and need our help. Once common species have all but disappeared from England, for example the Duke of Burgundy butterfly has declined by some 50% over the last 20 years, limited now to isolated scattered colonies."
        },
        {
            "text": "Natural England (NE) leads the way in species recovery action and has been delivering its flagship Species Recovery Programme (SRP) for over 30 years, focussing on bespoke conservation action to reverse the fortunes of our most threatened native species."
        },
        {
            "text": "In April 2023, we launched a new Species Recovery Programme Capital Grant Scheme. The scheme offers grants of up to half a million pounds to projects across England aiming to halt and reverse declines in populations of our most threatened species. Over 100 applications were received for projects targeting more than 200 species."
        },
        {
            "text": "Today, on the 14th September, we are excited to announce the recipients of those grant awards.  Sixty three projects are being awarded grants totalling £14.5m."
        },
        {
            "text": "Between now and March 2025, 74 different organisations across the country, many in partnership, will be working to help restore populations of rare species including the critically endangered European eel, Greater Mouse-eared bat; endangered Sand lizard, Atlantic salmon and Eurasian curlew and the vulnerable Pasqueflower, Grizzled skipper and Northern lapwing."
        },
        {
            "text": "Projects range in size from those covering several counties to bolster water vole populations across river catchments in East Anglia and the Midlands, to securing the future of species found on just one or two sites like the scarce Tufted-sedge in Hertfordshire."
        },
        {
            "text": "The Species Recovery Programme Grant targets action to benefit species which often have very specialist life cycle requirements. For instance, the Pearl-bordered fritillary butterfly requires violets growing in short sparse vegetation for its caterpillars to feed on, funding through the grant scheme will ensure that the right habitat management is in place so that the violets remain and butterflies can thrive.  While some of our rarest plant species such as the Lady’s Slipper orchid require specialist laboratory propagation to increase numbers and bolster the species population."
        },
        {
            "text": "The Species Recovery Grant scheme will fund all of the key elements that are needed to help restore populations of our rarest species. The funding will help also create and restore the habitats across England that are essential for our native species, including lowland heathland, wetlands, streams, upland habitats, woodlands, scrubby flower rich and insect rich grasslands, wildlife ponds and linear habitats such as hedgerows."
        },
        {
            "text": "All of these projects will contribute to the government’s goals of reducing the risk of species extinction by 2042 and increasing species abundance by 2030 and help put in place a Nature Recovery Network across England where wildlife can recover, move freely and thrive."
        },
        {
            "text": "Ultimately, the success of our nature recovery efforts will be reflected in the conservation status of our species.  Natural England’s new Species Recovery Programme Grant scheme is making an important contribution to doing this."
        },
        {
            "text": " "
        },
        {
            "text": "A summary of all the projects funded is listed below:"
        },
        {
            "text": " "
        }
    ]
}