{
    "url": "https://stratcommand.blog.gov.uk/2023/09/14/the-british-armys-elite-airborne-sappers-hone-their-urban-operation-skills-as-they-take-on-exercise-barbary-sun/",
    "title": "The British Army's elite Airborne Sappers hone their urban operation skills as they take on Exercise Barbary Sun.",
    "authors": [
        "chloehobbs"
    ],
    "categories": [
        "Gibraltar",
        "Overseas Bases",
        "Training"
    ],
    "pub_date": "2023-09-14T10:52:58+01:00",
    "content": [
        {
            "text": "Exercise Barbary Sun saw 9 Parachute Squadron (9 Para Sqn RE) utilise the unique facilities available in Gibraltar to develop the skills required to conduct dismounted close combat battle craft syllabus and combat engineering in the urban and subterranean environment, both by day and night. The sub-unit contingent force, commanded by Major Pedro Dobinson MBE, is comprised of 9 Para Sqn RE and was joined by fellow US Airborne Army Engineers from the 54th Brigade Engineer Battalion, to enable them to work effectively together."
        },
        {
            "text": "Commanding Officer, Major Pedro Dobinson MBE, said:"
        },
        {
            "text": "‘We continuously endeavour to strengthen our capabilities, and Gibraltar is a special place which enables us to do so. It’s combination of unique training opportunities and rich history is very important to us as Royal Engineers.’"
        },
        {
            "text": "Exercise Barbary Sun began by developing the skills required to move and fight in the urban environment before increasing the complexity through operating in the confined and complex tunnels of Gibraltar’s Rock. The training package delivered by Urban Operations Instructors saught to develop the skills required to thrive in urban areas, through a comprehensive package."
        },
        {
            "text": " "
        },
        {
            "text": "9 Parachute Squadron Royal Engineers is part of 23 Parachute Engineer Regiment, which is held at high readiness and provides engineering support to 16 Air Assault Brigade Combat Team. In recent years members from 9 Para Sqn RE have supported the full spectrum of tasks ranging from non-combatant evacuations in Afghanistan and Sudan, through to Public Duties outside the royal palaces as one of the first Kings Guards. Troops are ready to deploy as a Global Response Force (GRF) to meet the needs of the UK around the world."
        },
        {
            "text": "23 Parachute Engineer Regiment will celebrate turning 20 years old in 2023 and are looking forward to absorbing the rich history and special relationship that Sappers have with Gibraltar."
        }
    ]
}