{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2023/09/14/your-next-step-the-importance-of-professional-recognition/",
    "title": "Your next step: The importance of Professional Recognition",
    "authors": [
        "gseprofession"
    ],
    "categories": [
        "Blog Series",
        "Learning & Development"
    ],
    "pub_date": "2023-09-14T09:41:29+01:00",
    "content": [
        {
            "text": "“I am delighted to endorse the GSE Professional Recognition Offer which is re-launching with Recognition Week this September. This is a series of webinars from the GSE Profession and partner institutions, running from 25 to 29 September 2023. Every level of professional recognition supports you to make a real difference through government science and engineering. I recommend all GSE members explore this opportunity to gain external recognition for their professional skills, continue their professional development and expand their networks.” - Dame Angela McLean, Government Chief Scientific Adviser "
        },
        {
            "text": "In our previous blog, Professional Recognition – Is it for you?, the focus was on the importance of professional recognition for you, as an individual. This blog will look at the bigger picture on the importance of professional recognition with testimonials from GSE members who have already taken the next step in their professional development."
        },
        {
            "text": "Why is professional recognition important for government?"
        },
        {
            "text": "Having staff with professional recognition across government leads to: "
        },
        {
            "text": "A GSE member from Dstl with CChem chartership says “Since completing my CChem with the Royal Society of Chemistry I’m more confident in demonstrating my skills and advising colleagues on my subject area. By being part of a wider network of Scientists I can easily seek advice, access areas of expertise from journals and get in contact with others in my field.” "
        },
        {
            "text": "Why is professional recognition important for society? "
        },
        {
            "text": "Professional Recognition showcases to the wider public that you are committed to working to high ethical standards and gives them the trust and confidence in you as a practicing scientist, engineer, IT professional or technician.  "
        },
        {
            "text": " "
        },
        {
            "text": "A GSE member from DHSC with IEng chartership says “Everyone who works within health and social care, will tell you that it is so important that people have faith in what you are doing. People need to trust that you are not only doing your best but are also being held accountable by a professional organisation, outside of government. That you have standards that you need to not only meet but evidence as well.” "
        },
        {
            "text": "Ready to learn more? "
        },
        {
            "text": "If you would like to hear more about people in your organisation who have achieved professional recognition, email the GSE Profession at gse@go-science.gov.uk."
        },
        {
            "text": "Want to start your professional recognition journey? Take the first step and join us for GSE Professional Recognition Week between 25 and 29 September 2023. If you’re not able to join us, email the GSE Profession at gse@go-science.gov.uk to access webinar recordings. "
        }
    ]
}