{
    "url": "https://civilservice.blog.gov.uk/2022/05/17/civil-service-live-2022-meet-the-speakers/",
    "title": "Civil Service Live 2022: Meet the Speakers",
    "authors": [
        "Lorraine McBride, Editor of the Civil Service Blog Channel"
    ],
    "categories": [
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Ambitious Civil Service",
        "An Innovative Civil Service"
    ],
    "pub_date": "2022-05-17T14:41:02+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Woohoo! It’s nearly time to take Civil Service Live 2022 on the road. We put the spotlight on some of this year’s guest speakers and hear why they can’t wait to take to the stage."
        },
        {
            "heading": 3,
            "text": "THE POWER OF PENSIONS"
        },
        {
            "text": "Whatever your perception of pensions, Andrew Jones turns it on its head in one of CSL’s most perennially popular sessions. "
        },
        {
            "text": "How do you make a traditionally dry and complicated subject entertaining and easy to understand? Easy: know your subject matter, find some catchy music and cover it in sequins! "
        },
        {
            "heading": 4,
            "text": "Meat Loaf to Whitney"
        },
        {
            "text": "At the last face-to-face events in 2019, our theme was Pension Power Ballads, featuring some banging tunes from Meat Loaf to Whitney Houston, tuxedos, sparkly shirts and ball gowns, plus a glitter ball or two."
        },
        {
            "text": "All this fanfare was designed to grab the attention and eyes of delegates, entice them to come and speak to us at the Civil Service Pensions stand, and attend one of our presentations. "
        },
        {
            "text": "Our aim then, and now, is to change people's perceptions of pensions and bring it to the forefront of their personal financial planning. All those individuals who help on our stand are passionate about pensions and more than willing to help our members understand why their pension is important, and how, with some careful planning, it will provide a secure income for the future."
        },
        {
            "text": "It's my purpose to help our members understand their pension and how it can help them fulfil their passions when they retire, whether that's basket weaving or travelling Route 66."
        },
        {
            "heading": 4,
            "text": "Dare to dream"
        },
        {
            "text": "So what will Civil Service Pensions deliver at Civil Service Live 2022? We want people to visualise what they want to do when they retire, what activities they’re eager to do, which hobbies float their boat, what holidays they’re dreaming about. By saving for your future, your retirement can help you fulfil those passions - after all, you do deserve it."
        },
        {
            "heading": 3,
            "text": "COMEDY KINGS BY NIGHT, CIVIL SERVANTS BY DAY"
        },
        {
            "text": "John Anderson and Nathan King can’t wait to present their light-hearted comedy session - Rules that Apply to Being a Civil Servant and Stand-Up Comedian."
        },
        {
            "text": "“Nathan,” I said one morning, “it’s been ages since I’ve made a complete banana of myself in front of hundreds of people.” "
        },
        {
            "text": "“Yes, I was just thinking the same thing,” said Nathan. “Of course, Civil Service Live 2022 is coming up, how about that?”"
        },
        {
            "text": "“Excellent,” I said, “But we must come up with a catchy title.” And so the germ of our joint session The Stand-Up Mirror – Rules that Apply to Being a Civil Servant and Stand-Up Comedian was born. "
        },
        {
            "text": "I’ve performed comedy for 20 years under the name Hartley Pool, mostly overseas, while working for the British Council. However, since returning to the UK and joining the Department for Education, I recently landed my first comedy Final (Hartley Pool at BCG Pro 2021 final). Nathan came to watch, and it’s been curiously difficult to get hold of him since.  "
        },
        {
            "heading": 4,
            "text": "Potentially catastrophic"
        },
        {
            "text": "We hope that’s whetted your appetite. We can promise a rare outing of Sammi the Psychic Cat, revealing how things relate to Civil Service Behaviours and guest spots from a very Senior Civil Servant at the climax of each show. So if you’re a Civil Service big-hitter and feel it’s been way too long since you did something potentially catastrophic, please get in touch."
        },
        {
            "heading": 3,
            "text": "DRIVING DIVERSITY CHANGE"
        },
        {
            "text": "Lynsey Murray is a Senior Inclusive Practice Lead in the Civil Service Inclusive Practice team."
        },
        {
            "text": "I’m really excited to present the Diversity and Inclusion session at Civil Service Live. In February, we launched the Civil Service Diversity and Inclusion Strategy promoting fairness and performance. I can’t wait to engage with civil servants across the UK. We’ll outline the strategic priorities, discuss how this can drive tangible change for all our people and share how everyone can get involved in building a more skilled, innovative and ambitious organisation."
        },
        {
            "text": "Our team will talk about how the new strategy fits in with government reform and how we can all make a positive difference. The session is for anyone interested in helping to create change and build an open and inclusive culture."
        },
        {
            "heading": 4,
            "text": "Ripple effect"
        },
        {
            "text": "During the session, there’s a couple of activities designed to really get you thinking about the small changes you can make. These changes can cause a ripple effect to help support your colleagues, team and organisation. As well as promoting fairness and performance, we want to help everyone flourish."
        },
        {
            "text": "I always enjoy attending Civil Service Live, making new connections and demonstrating how the blueprint for D&I delivery can help improve our culture and ways of working. "
        },
        {
            "text": "It’s always great to wander round the exhibits to find out more. I’m also looking forward to visiting all the locations, and hope to find time to explore and see the sights. I’m especially looking forward to Blackpool and hoping I get to walk along the beachfront. "
        }
    ]
}