{
    "url": "https://educationhub.blog.gov.uk/2022/05/17/exam-season-all-the-resources-you-need-including-how-were-making-exams-fair-after-disruption-revision-help-and-what-to-do-if-you-have-covid/",
    "title": "Exam Season: All the resources you need including how we’re making exams fair after disruption, revision help, and what to do if you have Covid",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Exams and qualifications"
    ],
    "pub_date": "2022-05-17T15:00:07+01:00",
    "content": [
        {
            "text": "Exam season is upon us meaning up and down the country young people will be doing exams for their GCSEs, A levels, T Levels and other qualifications."
        },
        {
            "text": "We understand this can be a worrying time – especially for those students taking exams for the first time, which this year includes many post-16 students who didn’t sit GCSEs because of the pandemic."
        },
        {
            "text": "To help ensure all students feel comfortable going into exams, we have pulled together some useful links to make sure you are aware of any changes to exams this year, tips for exam prep and important mental health resources."
        },
        {
            "heading": 3,
            "text": "Why, how and when exams will go ahead this year?"
        },
        {
            "text": "Exam season started on Monday 16 May. This is the first year students have taken exams since the start of the pandemic.  Here we explain why exams are important, when they will be taken, when results will be available and more."
        },
        {
            "heading": 3,
            "text": "How we’re making exams fair after two years of disruption"
        },
        {
            "text": "Exams will go ahead this summer as the best and fairest form of assessment. However, we recognise students have faced disruption over the last two years and we have put in place measures to support you."
        },
        {
            "text": "We have introduced a range of adaptions to maximise fairness for those taking exams this year. You can read more about them here."
        },
        {
            "heading": 3,
            "text": "Top tips on preparing for exams"
        },
        {
            "text": "This year students will sit exams set and assessed by exam boards including GCSEs, A levels, T Levels and more."
        },
        {
            "text": "For many of you, this will be the first time you are taking formal exams and assessments so it may be worth taking the time to ensure you know what to expect and how you can best prepare for your exams. Here we have set out some of our top tips."
        },
        {
            "text": "Exam and assessment arrangements are also a little different this year compared to past exam years to take into account the disruption caused by the pandemic."
        },
        {
            "heading": 3,
            "text": "What happens if someone gets Covid before an exam? "
        },
        {
            "text": "Students studying for their GCSEs, A levels and vocational qualifications will be preparing to sit their exams this summer. We know that there may be instances where students contract the virus during the exam period, as we continue to live with COVID-19."
        },
        {
            "text": "Here we look at what students should do if they feel unwell or receive a positive Covid test result while taking their exams"
        },
        {
            "heading": 3,
            "text": "Mental health resources"
        },
        {
            "text": "We have put together some useful links and sources of mental health support so that children and young people, parents, carers, and school and college staff can get the advice and help they need."
        }
    ]
}