{
    "url": "https://deframedia.blog.gov.uk/2022/05/17/minister-pow-visits-oxford-to-welcome-the-start-of-the-bathing-water-season/",
    "title": "Minister Pow visits Oxford to welcome the start of the bathing water season",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Environment Agency",
        "Weekly stories"
    ],
    "pub_date": "2022-05-17T09:35:30+01:00",
    "content": [
        {
            "text": "There has been coverage over the weekend in the Telegraph, the Express, ITV News, Yorkshire Post and Telegraph & Argus on the launch of this year’s bathing water season."
        },
        {
            "text": "Starting from yesterday (15 May) the Environment Agency will carry out regular testing of water quality at designated bathing sites until the end of September. Throughout the bathing season warnings of any forecasted pollution risk will be issued on the EA’s Swimfo website."
        },
        {
            "text": "Today (16 May), Environment Minister Rebecca Pow visited the newly-designated Wolvercote Mill Stream bathing water in Port Meadow, Oxford, where she met with representatives from Oxford City Council and campaign group Thames 21 who both helped the site receive bathing water status. The group spoke about the benefits of a bathing water designation and how this is an important first step in driving forward improvements to water quality."
        },
        {
            "text": "Wolvercote Mill Stream is the second river site in England to receive bathing water status. The area is popular with local residents and visitors for recreational swimming, as well as sports such as stand-up paddle boarding and kayaking."
        },
        {
            "text": "Environment Agency Chair Emma Howard Boyd said:"
        },
        {
            "text": "Today’s announcement follows new plans unveiled by the Government to tackle the number of discharges of untreated sewage from storm overflows, including discharges into bathing waters. Under the proposed plan, there will be over 70% fewer discharges close to bathing waters by 2035 during the bathing season, with significant reductions expected outside the bathing season as well."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}