{
    "url": "https://traderemedies.blog.gov.uk/2022/05/17/the-cycle-of-legal-updates-that-could-lead-to-better-outcomes-for-britains-cyclists/",
    "title": "The cycle of legal updates that could lead to better outcomes for Britain’s cyclists ",
    "authors": [
        "Oliver Slocombe, Head of Operational Policy and Compliance"
    ],
    "categories": [
        "Policy",
        "pre-application office"
    ],
    "pub_date": "2022-05-17T12:52:07+01:00",
    "content": [
        {
            "text": "The TRA’s work is underpinned by regulations which were made in 2019. However, any lawyer will agree that the passing of legislation is rarely the end of the story – things need tightening up and adjusting as the regulations make their first encounter with real life. Accordingly, the Trade Remedies (Miscellaneous Amendments) Regulations 2022 came into force on 3 May 2022."
        },
        {
            "text": "These regulations make minor amendments to the way the regulations work – for example, not requiring us to create a public file when we’re asked to reconsider our decision not to initiate an investigation. Applications to us to open an investigation are confidential, so if we had ever got to this point, there would have been an interesting balancing act for us as an Authority."
        },
        {
            "heading": 3,
            "text": "A green light for exemption reviews on circumvention measures"
        },
        {
            "text": "One of the more notable changes in the regulations creates the power for the TRA to exempt companies from an anti-dumping duty when the scope of the measure is expanded because businesses are attempting to circumvent it. The changes will give us the powers to run a review to exempt parties from the circumvention measures if the circumvention review was completed before the measure was transitioned into UK law."
        },
        {
            "heading": 3,
            "text": "A smoother road for bicycle-makers?"
        },
        {
            "text": "We’re expecting this change mostly to affect UK bicycle manufacturers. The new powers will allow us to run a similar scheme to the one administered by the EU. Bike companies which currently pay the anti-dumping duty on parts they import from the People’s Republic of China will need to show us that they are not circumventing the duty. In practice, we’ll need evidence that they are not related to a company that is currently subject to the duty and that the bikes they make are either made with less than 60% by value Chinese parts or, where the bikes are made of more than 60% parts from China, that the value added to the parts is greater than 25% of the manufacturing costs."
        },
        {
            "heading": 3,
            "text": "Are you affected?"
        },
        {
            "text": "If you think your company may meet these criteria, check out our guidance or get in touch with our pre-application team (contact@traderemedies.gov.uk) who can guide you through the application process, how the scheme works and what companies can expect."
        }
    ]
}