{
    "url": "https://naturalengland.blog.gov.uk/2022/05/17/tony-juniper-green-paper-an-opportunity-for-an-integrated-approach-to-nature-recovery/",
    "title": "Tony Juniper: Green Paper – an opportunity for an integrated approach to Nature recovery",
    "authors": [
        "Tony Juniper"
    ],
    "categories": [
        "Biodiversity",
        "Climate change",
        "Natural England",
        "Wildlife"
    ],
    "pub_date": "2022-05-17T13:56:22+01:00",
    "content": [
        {
            "text": "During recent years there has been a very important shift in how we approach the task of looking after the natural world in England. Whereas once it was the idea of conservation that shaped ideas and actions, today the notion of Nature recovery is more prevalent. This marks a shift from sometimes desperate efforts to hang on to remnant populations of rare species and habitats and to instead embark on the process of restoring much of what is rare or has gone."
        },
        {
            "text": "Against this backdrop, the Government’s Nature Recovery Green Paper is a rare and important moment for everyone connected with Nature to shape its future and people’s relationship with it. The consultation on this important document has just closed and I thought I’d write a short piece to summarise Natural England’s response."
        },
        {
            "text": "We are the Government’s statutory adviser on the natural environment and welcome the questions posed in the Green Paper. Moving from conservation to recovery requires different approaches and ways of achieving progress, and this paper could set the scene for the shifts that could help us all do that."
        },
        {
            "text": "Following recent legislation, including the Environment Act 2021, we have many of the tools, targets and governance needed to begin the process of bending back the curve of decline. The next step is to embed these new tools in a new approach to Nature sites and species that will enable the Nature Recovery Network, that is already at the heart of our work, to flourish, harnessing the power of the places we have protected over the last 70 years while introducing coherence and, with it, resilience to climate change. Achieving this will bring Nature closer to many more people, including those in the least affluent communities, which at the moment generally have the least access to green-space and wildlife."
        },
        {
            "text": "We have a number of challenging targets to drive this work, including the 2030 species abundance target set out in the Environment Act. Timescales for making progress on this and other challenging goals are shortening though, and we believe that the key to moving fast will be down to the effective integration of the many different policies and budgets that might be harnessed together. These include new schemes to encourage Nature recovery in farmed areas, biodiversity net gain, ambitions to expand woodland cover, efforts to improve freshwater environments and using the existing protected area network in a more strategic manner."
        },
        {
            "text": "Integration of policies, targets and budgets is needed because Nature recovery can’t be achieved by any single body or government department. By devising an approach that brings together work across government and agencies, working closely with partners, we can align the respective tools locally to bring about desired outcomes more effectively. For example, a large-scale wetland restoration project could not only contribute to the Nature Recovery Network, support species recovery and help meet the goal to have 30 per cent of England protected for Nature by 2030 (30X30), but also reduce flood risk, catch and store carbon, improve water quality and provide new beautiful wildlife-rich green space for people to enjoy. And by working in a joined-up way on design, community engagement and benefits, we can generate improvements in health and education outcomes too, making a big difference to people’s lives."
        },
        {
            "text": "Natural England, through its evidence-led statutory role, can play an important part here by acting as a convener, catalyst and coordinator between the various levels of government and the business and charity sectors. Improving integration can lead to us all operating at an increased scale, enabling the speed and efficiency which is essential if Nature recovery is to succeed."
        },
        {
            "text": "We recommend that the reforms laid out in the Green Paper recognise the central role of scientific evidence and expert judgment, which is particularly important for regulatory decisions and protections such as protected sites and species. This approach, with Natural England acting as an evidence lead and objective designating authority, would ensure consistent decisions could be made, involving local stakeholders, which prioritise results over process."
        },
        {
            "text": "Natural England fully supports the aim of bolstering the effectiveness of protected sites, which over the years have been essential for conserving Nature, but as many troubling data sets reveal, is not alone sufficient for the recovery of Nature. The future for these important places has to be a more strategic one, in which the features within them are protected but much more is done externally: to link them with nearby habitat through restoring and buffering so that wildlife mobility is increased, along with resilience to change and public accessibility. This would give us an ecologically-coherent network of highly protected sites, acting as the “battery pack” energising a wider network for Nature recovery."
        },
        {
            "text": "This might be helped through creating simpler Nature protection areas and the addition of Nature recovery areas. Nature protection areas would represent the pinnacle of conservation, where the focus would be on legal safeguards to retain their health and status. Nature recovery areas would be where Nature is more dynamic, with more interaction between people and nature."
        },
        {
            "text": "The intention to produce a modern, cohesive set of wildlife laws and regulations is to be welcomed too. These will need to be more responsive to new evidence and changes in the environment while enabling us to continue to meet our international obligations. Species legislation should allow for a strategic approach that prioritises sustaining healthy populations, not expending energy protecting every individual. And it should encourage species to thrive rather than how the regime works at the moment with its focus on avoiding harm."
        },
        {
            "text": "Current protections such as the Habitats Regulations Assessments have ensured the survival of some of our most important sites and species. These can and should be smarter and simpler, in a way that maintains or enhances existing protections while progressing to Nature recovery, thus helping to achieve government targets."
        },
        {
            "text": "The Green Paper very helpfully references the Nature Recovery Network (NRN) in terms of its potential for boosting biodiversity, but it could go further and define the role that the NRN should have in connecting people with Nature. The NRN can be the vehicle that focuses a wide range of efforts in any given area, bringing high quality Nature into places where people live, enabling them to more easily enjoy the health and wellbeing benefits that an increasing body of evidence reveals that access to such places provides."
        },
        {
            "text": "The Government proposes to produce a set of criteria to guide contributions to its 30x30 targets for land and sea. Natural England welcomes this and is well-placed to help Defra establish these. Such criteria will need to be clear and robust and linked to wildlife outcomes so that this bold and most welcome target is meaningful."
        },
        {
            "text": "Funding Nature recovery will require significant investment, and not only from the public purse, but also private and philanthropic sources. We strongly support the proposed development of options and incentives that will encourage that kind of investment alongside what Government can do. A clear framework of standards and accreditation will help to create confidence for everyone involved, unlocking what are evidently huge potential new resources for Nature recovery."
        },
        {
            "text": "The Green Paper rightly considers all options for improving delivery for Nature, including reform of Arm’s Length Bodies. Natural England’s view is that, whatever options are considered, positive outcomes will be more effectively pursued if an overarching unified purpose is adopted for the whole Defra group. This would at its core set the scene for ‘Nature recovery’ and ‘recovering environmental health’ and could create the culture and unity needed to ensure that core Defra and its ALBs rise to the nation’s environmental and ecological challenges. If a major transformation of bodies is also preferred, then Natural England recommends creating new bodies with a clear purpose fixed in primary legislation, aimed at driving Nature recovery in line with the Environment Act targets to restore the nation’s natural capital and rebuild its critical natural infrastructure. We expect that a more piecemeal reallocation of duties between bodies driven by cost savings would be less effective."
        },
        {
            "text": "There is a great deal in this Nature Recovery Green Paper consultation that Natural England supports. It promises to transform the way we look after and enjoy Nature in this country, with enormous benefits for wildlife and people, and we look forward to continuing to work with Government to deliver these important changes."
        },
        {
            "text": "-ends-"
        }
    ]
}