{
    "url": "https://lifeathmrc.blog.gov.uk/2022/05/17/understanding-users-and-their-support-needs/",
    "title": "Understanding users and their support needs",
    "authors": [
        "Shila Odedra"
    ],
    "categories": [
        "Accessibility",
        "Digital services",
        "Diversity",
        "Inclusion",
        "User research"
    ],
    "pub_date": "2022-05-17T15:52:53+00:00",
    "content": [
        {
            "text": "19 May 2022 marks the eleventh Global Accessibility Awareness Day (GAAD), a day dedicated to raising awareness around accessibility in the digital world. The purpose of GAAD is to get everyone talking, thinking and learning about digital access, inclusion and people with different disabilities."
        },
        {
            "text": "This is my first Global Accessibility Awareness Day as Head of User Research at HMRC, and I'm reminded of how far we’ve come as a profession in ensuring our services are accessible and inclusive for people with different abilities. But I know we still need to strive to make our services more inclusive for every user and we can do this by considering digital access and inclusion at every step of our research process. There is much more to come from us as a community. We still have a long way to go and we’re constantly learning."
        },
        {
            "heading": 2,
            "text": "Thinking about inclusion alone isn't enough"
        },
        {
            "text": "One of our key objectives is to improve the diversity, equity, and inclusion of our user research. To make sure we design services that work for everyone, we must be inclusive in the ways we recruit participants. We are actively engaging with charities and third-party organisations, as well as improving our sign-up process to include offline channels."
        },
        {
            "text": "Thinking about inclusion alone isn't enough, we must think about equity and diversity, and what this means:"
        },
        {
            "text": "In addition to this, we also have the Research Ethics Board which ensures all research conducted meets the highest ethical standards, protecting the rights, safety, well-being and dignity of all participants and researchers involved."
        },
        {
            "heading": 2,
            "text": "Improving accessibility of our digital services"
        },
        {
            "text": " Head of Accessibility, Graeme Jamieson, is responsible for looking at what accessibility challenges may arise in the future to ensure HMRC services are as inclusive as possible."
        },
        {
            "text": "Graeme said:"
        },
        {
            "text": "“We’ve made a lot of progress with improving the accessibility of our digital services within HMRC during 2021. For example, we have used data to understand where best to focus our efforts, as well as to understand how to build more accessible services by default."
        },
        {
            "text": "“To ensure we continue to maintain the standards we’ve set, we must influence and educate our service and product designers on the importance of building inclusive, accessible solutions and products from the get-go. Now, more than ever, accessibility is everyone’s responsibility.”"
        },
        {
            "heading": 2,
            "text": "Help us build accessible services - our user panel"
        },
        {
            "text": "We recognise user needs may be hidden and through continuous user research, accessibility testing, and following user-centred design principles, we can build better services. HMRC continues to learn more about recognising and identifying behaviours that help us design accessible and inclusive services."
        },
        {
            "text": "We know that there are always opportunities to improve a person’s online experience and that understanding the user and their needs is a crucial part of the process."
        },
        {
            "text": "We are continuing to build up our own panel of users, providing feedback on the services we are building. The recruitment panel has over 98,400 users signed up, including more than 6,000 users who have told us that they use assistive technologies."
        },
        {
            "text": "If you are interested in helping out, you can sign up to be a member of our panel online, or call 03000 513 300."
        }
    ]
}