{
    "url": "https://defradigital.blog.gov.uk/2022/05/17/working-with-adhd-how-i-harness-my-strengths-and-manage-the-challenges/",
    "title": "Working with ADHD: how I harness my strengths and manage the challenges",
    "authors": [
        "Alice Winters"
    ],
    "categories": [
        "Defra content design",
        "Defra digital",
        "User centred design"
    ],
    "pub_date": "2022-05-17T13:21:12+01:00",
    "content": [
        {
            "text": "For years, content designer Alice Winters assumed she just wasn’t trying hard enough to get things done - then she found out she had ADHD. In this post, Alice shares her diagnosis story, how she harnesses her ADHD in her work and manages some of the challenges it brings."
        },
        {
            "text": "Hello, I’m Alice and I am neurodivergent."
        },
        {
            "text": "I have Attention Deficit Hyperactivity Disorder (ADHD). In spite of what the name implies, I don’t actually have a deficit of attention, I just have trouble regulating it."
        },
        {
            "text": "If you’d like to understand more about what ADHD is (and what it is not), the How to explain ADHD video by Jessica McCabe might be helpful."
        },
        {
            "text": "In this post, I’ll share my experience of working as a content designer with ADHD. I hope it will help to raise awareness and help you to better understand this facet of neurodiversity."
        },
        {
            "heading": 2,
            "text": "My diagnosis story"
        },
        {
            "text": "I was diagnosed with ADHD when I was 28. Before that, I’d spent my whole life thinking that I just wasn’t trying hard enough - that I was annoying because I talked too much or lazy because I couldn’t get things done. But because I was good in school and got good grades, my ADHD was never picked up."
        },
        {
            "text": "I’d heard of ADHD before, but only the hyperactive and misbehaved stereotype. I learnt much more about ADHD from a friend who had it. Their story really resonated with me, so I started researching the symptoms. It was like reading a book about my own life!"
        },
        {
            "text": "Getting diagnosed wasn't easy. My GP was supportive, but my local waitlist for a formal assessment with a psychiatrist was over 3 years. That’s when I heard about Right to Choose. This gave me the freedom to choose who provided my assessment, as long as they had a contract with the NHS somewhere in the UK. It significantly reduced the wait time to see a psychiatrist. A relatively short 5 months later I had my assessment and received my diagnosis."
        },
        {
            "text": "There are three types of ADHD, inattentive type, hyperactive type and the combined type. Turns out, I have the combined type."
        },
        {
            "text": "Now I know I’m not lazy or stupid - my brain just works differently to how a neurotypical brain does. And because of that, I need to work differently!"
        },
        {
            "heading": 2,
            "text": "How ADHD helps me in my job"
        },
        {
            "text": "Having ADHD definitely has its challenges, as I talk about later in this blogpost. But there are also some positives: I've found some elements of my ADHD really help me to succeed in my job as a content designer."
        },
        {
            "text": "I think that talking to people who have ADHD about their strengths is just as important as discussing their reasonable adjustments. So, with that in mind, here are four ways my ADHD can support my work."
        },
        {
            "heading": 3,
            "text": "Hyperfocus"
        },
        {
            "text": "This is when we focus on one thing or one task. I mean, technically it’s the inability to switch your focus, but that can actually be pretty handy from time to time!"
        },
        {
            "text": "This means I’m more than happy to spend a lot of time on work I am passionate about. I love big and complex pieces of content that I find interesting. I love to unpick existing content to improve the experience for the user, or break down a complex task into manageable guidance for users. Learning to harness my hyperfocus helps with this immensely."
        },
        {
            "heading": 3,
            "text": "Endless enthusiasm"
        },
        {
            "text": "I’m often told I have a never ending amount of enthusiasm. I owe this to the hyperactive element of my combined ADHD. You can always count on me to speak in meetings, collaborate or volunteer to help. I just love it."
        },
        {
            "text": "At work it means I thrive when talking about content design and the benefits of our approach, whether that’s to subject matter experts or new colleagues."
        },
        {
            "text": "As a result, I’ve built great working relationships and my enthusiasm can rub off on the people I work with. Win!"
        },
        {
            "heading": 3,
            "text": "Creativity and ideas"
        },
        {
            "text": "I think differently, because my brain has developed differently. This means I often think outside the box and come up with lots of ideas."
        },
        {
            "text": "Whether that’s finding a quicker way to do a task or a better way to present content, creativity is a big bonus. It’s helped me to solve tricky content problems and find compromises with subject matter experts."
        },
        {
            "heading": 3,
            "text": "Risk taking"
        },
        {
            "text": "The lack of impulse control that can come with ADHD can be a strength. I’m quick to jump into new opportunities, push myself and take on challenges. This has helped me to progress in my career and experience new things."
        },
        {
            "heading": 2,
            "text": "Struggles with my ADHD"
        },
        {
            "text": "ADHD comes with challenges too. They’re different for everyone but here are some of the things I struggle with and what I have found helpful. These tips might be useful if you think you have ADHD, or if you manage someone who does."
        },
        {
            "text": "People with ADHD can ask for reasonable adjustments in the workplace to help them. Think of this as helping us to reach our full potential, where we might have been working with one arm tied behind our back."
        },
        {
            "text": "If you have a formal diagnosis, you can also access medication or ADHD coaching to help manage your symptoms."
        },
        {
            "heading": 3,
            "text": "Switching between tasks"
        },
        {
            "text": "This comes back to regulating attention. I often find moving between tasks hard. If I have a meeting and then need to write some content, it can be hard to tell my brain that it’s time to write now."
        },
        {
            "text": "I’ve found the best way to help with this is to have a transition activity. When I finish a meeting I will go and have a drink or a snack. Stepping away for a minute means that when I come back, I’m ready to crack on with my next task."
        },
        {
            "heading": 3,
            "text": "Focus, distraction and restlessness"
        },
        {
            "text": "Unless I am in hyperfocus, it can be really hard for me to focus on a task. I am easily distracted by… well anything really! It could be a more interesting task, the birds outside, the lyrics of a song or the conversation someone is having 5 desks away."
        },
        {
            "text": "There is no magic fix, but I have found that using the pomodoro technique with a visual timer like the Time Timer can help. I make sure I set it for an achievable amount of focus time and when I’m done, I reward myself!  This is usually some time outside, because research shows that breaks in nature are particularly beneficial. This is called ‘green time’."
        },
        {
            "text": "Another helpful thing is movement. It may sound counterproductive, but changing positions or environments helps me to focus. I have a sit or stand desk and a balance board so I can fidget and move at the same time as focusing on a task. I channel my restlessness and distraction into another channel. Fidget toys can also help in meetings, although I can’t type while I use them!"
        },
        {
            "heading": 3,
            "text": "Working memory"
        },
        {
            "text": "I forget things a lot. I’ve forgotten I have meetings, or that I’ve promised to monitor the shared mailbox. Tasks have fallen off my radar because I forgot to note down an action in a meeting. This is really common with ADHD."
        },
        {
            "text": "My tip for this one: set boundaries and ask for reasonable adjustments. I asked my managers to follow up meetings with an email if they’ve assigned me a task. Having it in writing means it’s less likely to fall off my radar."
        },
        {
            "heading": 3,
            "text": "Sleep and routine"
        },
        {
            "text": "ADHD can come with sleep problems too. This can mean finding it hard to fall asleep, having restless and disturbed sleep and finding it difficult to wake up. As a result, we might find it harder to work or focus early in the morning and thrive working later."
        },
        {
            "text": "It took me a while, but I learnt not to fight my brain. I talked to my manager about starting later and working later. This flexibility really helps me work to my full potential, because I don’t have to force myself when the words just won’t come."
        },
        {
            "text": "There are loads of videos on Youtube if you want to find out more."
        },
        {
            "text": "If you manage someone who has ADHD, maybe watch the How To ADHD video for employers."
        },
        {
            "text": "If you think you might have ADHD, start by looking at the symptoms of ADHD in adults."
        },
        {
            "text": "Alice Winters is a Content Designer at Defra."
        }
    ]
}