{
    "url": "https://prisonjobs.blog.gov.uk/2023/06/13/being-a-prison-officer-isnt-just-a-job-its-a-whole-new-career/",
    "title": "Being a prison officer isn't just a job, it's a whole new career",
    "authors": [
        "Ministry of Justice"
    ],
    "categories": [
        "Career progression",
        "Prison officer",
        "Uncategorized"
    ],
    "pub_date": "2023-06-13T12:50:57+01:00",
    "content": [
        {
            "heading": 3,
            "text": "Joining HMPPS as a prison officer gives you a range of opportunities for your career.   "
        },
        {
            "heading": 3,
            "text": "Ricky started in the role 20 years ago, before training to join the Physical Education (PE) department. Today, he heads up PE and wellbeing offer for staff and prisoners at HMP Berwyn, along with 16 other instructors. ‌​‌​‌​​​‍‌​‌​​‌‌‌‍‌​‌‌​​‌​‍‌​‌‌‌​‌‌‍‌​‌‌‌‌​​ "
        },
        {
            "heading": 3,
            "text": "He tells us more about why he became a prison officer, his current role and why PE is so important to the Prison Service. "
        },
        {
            "text": "I was 25 when I joined the Prison Service as a prison officer. I’d been playing rugby professionally at Leicester Academy and then in the championship for Coventry and Birmingham rugby teams. But following some bad injuries, I had to make some big decisions on how I continued playing and who for. I knew some friends who worked as prison officers, and they told me about the job. I thought it sounded good, applied and the rest is history! ‌​‌​‌​​​‍‌​‌​​‌‌‌‍‌​‌‌​​‌​‍‌​‌‌‌​‌‌‍‌​‌‌‌‌​​ "
        },
        {
            "text": "From there, I spent three years on the wings before specialising to work in the PE department where I’ve stayed ever since.  "
        },
        {
            "text": "After spending almost 15 years at a previous prison, I relished the opportunity to be part of a PE department in a brand-new prison with so many opportunities to help it grow. I was completely new to the area when I joined, but I wanted a new challenge and change. "
        },
        {
            "text": "I’ve worked my way up to managing the PE department and a fantastically motivated team of 16 instructors.  "
        },
        {
            "text": "“Physical education is such a strong force for change” "
        },
        {
            "text": "My role involves introducing prisoners to and the importance of sport when it comes to their wellbeing, as well as supporting them in gaining qualifications to help them get employment when they leave. I also support with the wellbeing of our staff through sport and exercise as well as teambuilding and wellbeing days and events. "
        },
        {
            "text": "Prisoners and staff really value the exercise opportunities we offer. ‌​‌​‌​​​‍‌​‌​​‌‌‌‍‌​‌‌​​‌​‍‌​‌‌‌​‌‌‍‌​‌‌‌‌​​As a team we deliver a whole range of activities such as football, rugby, an over 60’s gym, remedial and exercise referral classes. We also hold a Park Run every Saturday. "
        },
        {
            "text": "Not only do we try to ensure the prisoners get access to the mandatory amount of exercise, but we also do so much more. They must display positive behaviour in the rest of their prison life to take advantage of the PE facilities, activities and sporting competitions we run. So, it’s an important lever for keeping prisoners motivated, positive and focused. I believe it can be such a strong force for change. Lots of the men we work with come from challenging backgrounds which may mean that they have never had this kind of access to facilities previously. "
        },
        {
            "text": "“There are avenues for you to explore and progress” "
        },
        {
            "text": "‌​‌​​​‍‌​‌​​‌‌‌‍‌​‌‌​​‌​‍‌​‌‌‌​‌‌‍‌I am thankful for the opportunities I’ve had to develop my career in the Prison Service over the past two decades. When you become a prison officer, you don’t just start a job, you start a whole new career. And you can go on to do what you want with it. "
        },
        {
            "text": "If you want to help people who have really complex needs and if you flourish by being part of a team, I’d definitely recommend the role. It can be really rewarding and there are avenues for you to explore and progress if you want to. ‌​‌​‌​​​‍‌​‌​​‌‌‌‍‌​‌‌​​‌​‍‌​‌‌‌​‌‌‍‌​‌‌‌  "
        },
        {
            "text": "All you need to join is to have good discipline, good communication skills and confidence. "
        },
        {
            "text": " "
        }
    ]
}