{
    "url": "https://nda.blog.gov.uk/celebrating-our-sellafield-lgbtq-champions/",
    "title": "Celebrating our Sellafield LGBTQ+ champions",
    "authors": [
        "Isabella Gray"
    ],
    "categories": [
        "diversity",
        "Safety and Wellbeing",
        "Uncategorized"
    ],
    "pub_date": "2023-06-13T12:48:02+01:00",
    "content": [
        {
            "text": "'Don't be afraid to be yourself, be the real you' - that's Isabella's message this Pride Month."
        },
        {
            "text": "She is part of our LGBTQ+ network along with more than 90 of her colleagues across the Sellafield site and our offices. She also works in our Analytical Services department."
        },
        {
            "text": "Here she shares her own thoughts on the importance of allies, the importance of Pride Month to her, as well as sharing her own journey."
        },
        {
            "heading": 3,
            "text": "How would you describe your identity?"
        },
        {
            "text": "I would describe myself as a queer woman or a pansexual transgender woman."
        },
        {
            "heading": 3,
            "text": "What can we do to support LGBTQ+ people both in the workplace and externally?"
        },
        {
            "text": "Although we have come a long way as a society, there are still those who see us as punchlines or movie antagonists; they see us as sub human and not worthy of existence. We all need to be allies and to challenge the bigoted behaviour as it happens. The company has come a long way in being an ally, but it requires the workforce to also embrace being allies."
        },
        {
            "heading": 3,
            "text": "Why is Pride month important to you?"
        },
        {
            "text": "My first Pride event in 2018 (not long before I came out publicly as transgender) was the first time I’d shown the world ‘this is who I am’. Pride month is a big shout-out telling the world we exist; we are who we are. But Pride Month is also about educating society on being allies; to help fight the bigotry that’s trying to (and I won’t apologise for using this word) exterminate us from society."
        },
        {
            "heading": 3,
            "text": "How do you find being LGBTQ+ and working at Sellafield?"
        },
        {
            "text": "Before I came out publicly as transgender I was worried about the company and the workforce’s reaction. I’d heard the gossip that goes around when other transgender people had come out. It made me apprehensive. But the company has been really good, whether it’s with simple changes or complicated."
        },
        {
            "text": "They were also open to constructive criticism about their procedures. The workforce has also been very accepting, with only a few issues that were dealt with by the company quickly, appropriately and importantly with dignity."
        },
        {
            "heading": 3,
            "text": "How important do you think it is to have visible LGBTQ+ role models within the workplace?"
        },
        {
            "text": "Having visible role models is hugely important. Seeing other people like you, living their life in a safe environment. It helps, it becomes the norm; that we are not some sideshows there, for people to point their fingers at, ridicule or hate."
        },
        {
            "heading": 3,
            "text": "What advice would you give to an LGBTQ+ person starting their career within our sector?"
        },
        {
            "text": "Don’t be afraid to be yourself, be the real you."
        },
        {
            "text": "Connect with the LGBTQ+ networks. If you are discriminated against or bullied (unfortunately it does still happen), report it and if you are not satisfied with the response, raise it higher up."
        },
        {
            "heading": 3,
            "text": "Why do you think it’s important to build alliances with other LGBTQ+ networks?"
        },
        {
            "text": "It’s important because we are stronger together, our voice is louder. More people also mean more ideas and more resources available."
        }
    ]
}