{
    "url": "https://mojdigital.blog.gov.uk/2023/06/13/data-engineering-hackathon-2022/",
    "title": "Data Engineering Hackathon 2022",
    "authors": [
        "Jacob Hamblin-Pyke"
    ],
    "categories": [
        "data engineering",
        "hackathon",
        "Our services"
    ],
    "pub_date": "2023-06-13T11:57:14+01:00",
    "content": [
        {
            "text": "At the end of last year, MoJ’s Data Engineering teams got together in Shoreditch for our largest ever 2 day hackathon. We had three teams, each working on a separate project which would incorporate technology the organisation wished to investigate. This would let our engineers learn new skills in a fun environment, while also letting us explore new tech."
        },
        {
            "text": "Team 1 was building a Data API, looking to base their work on what 10 Downing Street had done on developing its own API. This project aimed to democratise access to the data, making our datasets more open, queryable, and therefore accountable."
        },
        {
            "text": "Team 2 looked to create a Business Intelligence Dashboard in 2 days (down from a week in the initial pitch!). This would help our analysts quickly explore their datasets using a visual interface, as well as giving easy point-and-click access to various key metrics."
        },
        {
            "text": "​​Team 3’s project was looking at real-time data - with the rise of data types such as video and audio files, which can be streamed live, this team set out to design a system that could take real-time events from one of our databases, and turn this into structured information that could be captured in a dashboard and viewed."
        },
        {
            "text": "Each of the team leads gave a short introduction to their projects in the top floor amphitheatre looking out over London, before the teams each went into their respective meeting rooms, ready to turn their ideas into code. "
        },
        {
            "text": "The first day necessitated a lot of collaboration between the teams, with many of the teams working together to share elements such as server and network infrastructure that required specialist knowledge to stand up. By the end of day 1, each of the teams had at least some level of function to their products, but many left for the Christmas Social at a nearby food market pondering what would need to be done on the next day over steaming hot street food and weirdly hard-to-track-down beer…"
        },
        {
            "text": "Day 2 began with the teams giving quick updates before launching back into bringing their projects together ahead of the final presentations at 5pm. Lunch in the venue’s cafeteria saw the teams swapping stories about how their projects were coming together in the shadow of a life-size statue of Po from Kung Fu Panda. "
        },
        {
            "text": "As each of the teams congregated before our panel of judges for the event, there was a great feeling of achievement amongst all in attendance. This event allowed each of us to stretch ourselves and develop new technical skills, and the teams had been great fun to work in, bringing together groups of engineers who would otherwise not often meet. "
        },
        {
            "text": "The teams were able to make a huge amount of progress on their ideas in a very short amount of time, with each team able to have a working product ready for demo by the end of the second day. The event ran on the 8th and 9th of December 2022, however, the ideas and experience developed during the hackathon will go on to shape future products we make for the better."
        }
    ]
}