{
    "url": "https://marinedevelopments.blog.gov.uk/2023/06/13/one-year-into-fisheries-management-measures-for-english-offshore-mpas/",
    "title": "One year into fisheries management measures for English offshore MPAs",
    "authors": [
        "David Patrick, Digital Communications Manager"
    ],
    "categories": [
        "marine conservation",
        "Uncategorized"
    ],
    "pub_date": "2023-06-13T09:44:03+01:00",
    "content": [
        {
            "text": "On 13 June 2022, the Marine Management Organisation (MMO) introduced new byelaws to protect four offshore marine protected areas (MPAs) from damaging fishing activity. This marked a significant step in our work to assess and appropriately manage fishing activities to protect valuable marine habitats and species in England’s offshore MPAs. "
        },
        {
            "text": "England’s MPAs "
        },
        {
            "text": "There are currently 178 MPAs covering 40% of England’s waters, these areas provide an important refuge for marine life, and are critical to protecting rare and threatened habitats and species from damage caused by human activities such as fishing. MMO is assessing fishing impacts in MPAs located offshore of 6 nautical miles.  "
        },
        {
            "text": "First four MPA byelaws introduced "
        },
        {
            "text": "The first four MPAs were chosen as a priority to help protect their vibrant and productive undersea environments. They are referred to as Stage 1 MPAs and include: "
        },
        {
            "text": "Last year, after extensive consultation with industry and other stakeholders, MMO introduced four byelaws prohibiting the use of seabed trawls, seines, dredges or similar gear, collectively known as bottom towed gear, within these MPAs."
        },
        {
            "text": "Latest figures on byelaw compliance "
        },
        {
            "text": "We are pleased to confirm that there have been very high compliance levels with the byelaws so far. MMO monitor fishing vessel activity around these sites and have detected fewer than 15 potential infringements across all four sites, each of which have been followed up in line with the MMO Compliance and Enforcement Strategy "
        },
        {
            "text": "Our thanks to all those who are complying with the bylaws and helping to protect valuable marine habitats and species.  "
        },
        {
            "text": "Which MPAs are we considering now? "
        },
        {
            "text": "Between January and March 2023, we held a Stage 2 formal consultation to seek views from stakeholders and the fishing industry on a proposed byelaw to manage bottom towed fishing gear over rock and reef habitats in 13 offshore MPAs.  "
        },
        {
            "text": "MMO is also currently considering five Stage 4 MPAs which are those protecting highly mobile species - marine birds and harbour porpoise.  "
        },
        {
            "text": "Next steps "
        },
        {
            "text": "We thank everyone who took part in our Stage 2 consultation and Stage 3 call for evidence earlier this year. We are currently working hard to review all the information received, including making updates to assessment and management documents where appropriate. We’ll be providing further updates on this process as soon as possible. "
        },
        {
            "text": "Find out more about MPAs in our dedicated hub. "
        }
    ]
}