{
    "url": "https://defraenvironment.blog.gov.uk/2025/01/03/historic-rights-of-way-saved/",
    "title": "Historic rights of way saved",
    "authors": [
        "Environment blog team"
    ],
    "categories": [
        "Access and engagement",
        "Community",
        "Protected Landscapes"
    ],
    "pub_date": "2025-01-03T09:36:27+00:00",
    "content": [
        {
            "text": "Wishing you a very happy New Year from the Defra Environment blog team."
        },
        {
            "text": "It’s a time of year when many of us enjoy a brisk winter’s walk with our families."
        },
        {
            "text": "On Boxing Day, a favourite day for rambling, the government announced that it will repeal the 2031 cut-off date for recording historic rights of way.  "
        },
        {
            "text": "England has thousands of miles of unrecorded rights of way which are well used by walkers, cyclists and equestrians, but aren’t officially recorded or protected.   "
        },
        {
            "text": "These paths are some of the oldest inscriptions on our landscapes – a tangible record of people’s movements over the centuries, with many paths and roads we use today dating back hundreds or thousands of years. For many walkers, the knowledge that you’re on an ancient path trodden by generations of our ancestors is one of walking’s great pleasures."
        },
        {
            "text": "However, local authorities have struggled under the burden of recording historic rights of way, which are estimated to stretch over 40,000 miles, by the 2031 cut-off date introduced by the last government. The government’s move to reverse that decision means these paths will no longer be lost to the public. "
        },
        {
            "text": "Local authorities will now have the required time to assess whether paths meet the requirements to be added to the “definitive map”. This is the legal record of public rights of way and was established by the Atlee government when they passed the National Parks and Access to the Countryside Act 75 years ago this month. "
        },
        {
            "text": "Once a right of way has been established the relevant local authority will then be legally responsible for maintaining them along with the appropriate landowner.  This will ensure paths are maintained properly allowing more people to experience the benefits of spending time in the outdoors.  "
        },
        {
            "text": "Exposure to green and blue space is associated with improved wellbeing, physical activity and health outcomes. "
        },
        {
            "text": "In 2020, the value of health benefits associated with outdoor recreation within the UK was estimated to be between £6.2 billion and £8.4 billion.  An estimated annual saving of £2.1 billion would be achieved through averted health costs if everyone in England had good access to nature. "
        },
        {
            "text": "Repealing the cut-off date for historical rights of way is just one of the ways we’re improving access to nature. There’s lots of exciting work happening to help more families enjoy the benefits of nature."
        },
        {
            "text": "We are continuing to progress delivery of the King Charles III England Coast Path (now expected to be completed by Spring 2026) and the Coast to Coast National Trail."
        },
        {
            "text": "We also have the green social prescribing programme, which embeds nature into the delivery of preventative healthcare. And there’s our Access for All programme in Protected Landscapes and the forestry estate, plus our Generation Green programme to connect disadvantaged children to Protected Landscapes."
        },
        {
            "text": "And, speaking of Protected Landscapes – the rights of way announcement follows earlier action to mark the 75th anniversary of the National Parks and Access to the Countryside Act, which included announcing strengthened powers for our National Parks and National Landscapes. "
        }
    ]
}