{
    "url": "https://defradigital.blog.gov.uk/2022/06/10/how-we-built-a-breakthrough-online-service-to-protect-endangered-elephants/",
    "title": "How we built a breakthrough online service to protect endangered elephants",
    "authors": [
        "Ian Tester"
    ],
    "categories": [
        "Defra digital",
        "Defra services",
        "User centred design"
    ],
    "pub_date": "2022-06-10T07:30:30+01:00",
    "content": [
        {
            "text": " "
        },
        {
            "heading": 6,
            "text": "Photograph by Liezl Martin – Ivory Compliance Manager, Kruger National Park, South Africa"
        },
        {
            "text": "Product Manager Ian Tester explains how a new Government digital service built by Defra supports the toughest ivory ban in the world."
        },
        {
            "text": "The Ivory Act 2018 introduced some of the toughest rules on dealing in ivory in the world. Ahead of the ban coming fully into force on 6 June 2022, we developed the ivory registration service, which went live on 24 February 2022."
        },
        {
            "text": "This is an essential tool for ivory owners to declare elephant ivory they intend to sell or hire out, in order to comply with the law. Over the last three months owners have been encouraged to register their items using the online service, resulting in 1139 registrations to date."
        },
        {
            "text": "The stakes are high: elephant populations continue to decline due to the threat of poaching. The UK’s efforts to stop the trade in ivory includes the risk of a £250,000 fine or up to six months imprisonment for those who break the law.\nThat’s why getting the right tools in place was vital. The Act bans the dealing in elephant ivory except for five narrow and carefully defined exemptions."
        },
        {
            "text": "It is now illegal to deal in items made from ivory or containing ivory unless you first register it or apply for an exemption certificate. The digital team focused on ensuring that we created an accessible, user-friendly tool that facilitates compliance. This meant using clear language and a logical structure to help non experts navigate the rules and register their items correctly."
        },
        {
            "heading": 2,
            "text": "About the Service"
        },
        {
            "text": "The ivory service is hosted on GOV.UK and ensures anyone dealing in ivory (buying, selling, or hiring out an item containing ivory) can only do so if the ivory item satisfies one of the five exemption criteria."
        },
        {
            "text": "The online service provides comprehensive guidance to support service users, including details on importing, exporting, registering group items, assessing age, and much more. We understood from our research that this would be a new challenge for many users, and so we placed additional importance on developing insight into their needs."
        },
        {
            "text": "As a result, in addition to comprehensive guidance we created an ivory item eligibility checker as part of the service, to assist users in understanding the exemptions."
        },
        {
            "heading": 2,
            "text": "What a journey, what a joy"
        },
        {
            "text": "As with any new service built and released into GOV.UK, teams of people worked tirelessly to make it happen. The service-build relied on skilled multidisciplinary teams (the ‘digital team’), from delivery managers to product owners and from designers and user researchers to developers and testers. The development of the service followed agile project management best practice."
        },
        {
            "text": "The digital team built service prototypes and evaluated them with vital input from users to gauge both useability and accessibility. The team listened to feedback from end users, Defra policy and legal teams, and the Animal and Plant Health Agency who have been appointed to regulate the ivory ban."
        },
        {
            "text": "Multiple changes and countless iterations of the service had to be made, to aid continuous improvement and ensure the final service met user needs. In an agile project environment, the service was developed, tested, received feedback, and then the process started all over again — it’s a rinse and repeat method that makes each version of any prototype better than the last."
        },
        {
            "text": "The ivory registration service firmly establishes the UK as breaking new ground for a service of its type and cements our position as an international leader in conservation. The service not only allows for ivory to be registered, but also provides vital data that will help Government to assess the volume and type of items that are exempt, where these are coming from and if there are areas that have lower than anticipated declarations."
        },
        {
            "text": "This insight is an additional tool in the fight against the illegal ivory trade and one that we are proud to have played a part in developing."
        }
    ]
}