{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2022/06/10/join-the-governments-highest-level-advisory-body-on-science-and-technology/",
    "title": "Join the government’s highest-level advisory body on science and technology   ",
    "authors": [
        "Jamal Arabi"
    ],
    "categories": [
        "GSE Opportunities"
    ],
    "pub_date": "2022-06-10T11:40:57+01:00",
    "content": [
        {
            "text": "*Deadline Extended*"
        },
        {
            "text": "The Prime Minister’s Council for Science and Technology is looking to recruit 3 new members to join the council. "
        },
        {
            "text": "The Council for Science and Technology is the government’s highest-level advisory body on science and technology; delivering advice directly to the Prime Minister on science and technology policy issues across government. It is jointly chaired by the Government Chief Scientific Adviser, Sir Patrick Vallance, and an independent co-Chair, Lord Browne of Madingley. "
        },
        {
            "text": "As a member of CST you will be asked to draw on your experience as a senior leader in science, engineering and technological, and apply your perspective on science and technology issues, to help Government in developing evidence-based policy. You will work alongside other distinguished members to develop advice across multiple disciplines, and engage regularly with Cabinet and Government Minister’s to discuss the Council’s recommendations."
        },
        {
            "text": "The Government is seeking applicants with expertise in a science, technology, engineering or mathematics field with credibility at national level (whether business, the not-for-profit sector, or academia). So, make your application today, if you have this experience alongside the ability to operate at the interface between disciplines, bring together different perspectives, evaluate options and develop evidence-based solutions.  "
        },
        {
            "text": "The campaign is open for applications until Wednesday 29th June. "
        },
        {
            "text": " "
        },
        {
            "text": "Visit the recruitment page for more information on the roles and how to apply."
        }
    ]
}