{
    "url": "https://deframedia.blog.gov.uk/2022/06/10/minister-reiterates-government-commitment-to-improve-water-quality/",
    "title": "Minister reiterates government commitment to improve water quality",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "water"
    ],
    "pub_date": "2022-06-10T10:14:03+01:00",
    "content": [
        {
            "text": "Today, Environment Minister Rebecca Pow took part in a parliamentary debate on the Government’s Strategic Policy Statement (SPS) for the water industry regulator, Ofwat."
        },
        {
            "text": "The Strategic Policy Statement (SPS), which was laid in Parliament in February, sets out to Ofwat as the economic regulator its expectations for the sector over the next five year spending cycle and beyond."
        },
        {
            "text": "It makes clear that Ofwat and water companies should prioritise action on the environment, deliver a resilient and sustainable water supply, and significantly reduce the frequency and volume of discharges from storm overflows."
        },
        {
            "text": "In May the Government reinforced its commitment to taking tough action to improve water quality, with the Environmental Audit Committee welcoming its response to its report on water quality in rivers."
        },
        {
            "text": "Protecting and enhancing our nation’s water environment is a priority for this government, which was the first to set out an expectation that water companies must take steps to significantly reduce the harm from storm overflows."
        },
        {
            "text": "The debate, brought by Philip Dunne, MP Ludlow, & Chair of the Env Audit Select Committee and Hereford MP Jesse Norman, took place as the Environment Agency announced a £100k boost to monitoring an improve water quality on the River Wye."
        },
        {
            "text": "The Storm Overflows Discharge Reduction Plan Consultation, launched in April, will revolutionise how water companies tackle the number of discharges of untreated sewage. Under the plans, water companies will face strict limits on when they can use storm overflows and must completely eliminate the harm sewage discharges cause to the environment."
        },
        {
            "text": "This builds on a swathe of action to tackle water quality, including measures voted through as part of the Government’s Environment Act which include a duty on the Government to produce a statutory plan to reduce discharges from storm overflows; duties on water companies; and a power of direction for the Government to direct water companies in relation to Drainage and Sewerage Management Plans."
        },
        {
            "text": "The Government is also consulting on targets to improve water quality, reduce nutrient pollution and reduce pollution by metals from abandoned mines. These targets will act as powerful tools to deliver cleaner water, pushing all water companies to go further and faster to fix overflows, and helping to generate the most significant investment ever undertaken by water companies to revolutionise our sewer system."
        },
        {
            "text": "Since 2015 the Environment Agency has brought 48 prosecutions against water companies, securing fines of over £137 million. Last year, the Environment Agency and Ofwat launched a major investigation based on evidence that some water companies in England may not be complying with their permits, resulting in excess sewage spills into the environment, even in dry periods. Five water companies have been put on notice to provide documentation for detailed analysis and all companies are under investigation. Action will be taken if non-compliance is discovered."
        },
        {
            "text": "Between 2020 and 2025, water companies are investing £7.1 billion to protect and improve the environment. Of this, £3.1 billion is already being invested specifically in storm overflow improvements to 800 overflows. Protected sites and bath areas are the initial priorities."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}