{
    "url": "https://gott.blog.gov.uk/2022/06/10/public-sector-innovation-john-innes-centre-scientists-use-technology-to-boost-tomatoes-vitamin-d-levels/",
    "title": "Public sector innovation: John Innes Centre scientists use technology to boost tomatoes' vitamin D levels",
    "authors": [
        "The Government Office for Technology Transfer"
    ],
    "categories": [
        "Department for Business Energy and Industrial Strategy"
    ],
    "pub_date": "2022-06-10T09:28:52+01:00",
    "content": [
        {
            "text": "The John Innes Centre (JIC) is sponsored by the Biotechnology and Biological Sciences Research Council, and is an international centre in plant science, genetics, and microbiology in England, founded in 1910. JIC’s research aims to address global challenges and use knowledge of plants and microbes to answer fundamental questions. Its research can have a significant impact on industrial biotechnology, society, and global development. "
        },
        {
            "text": " Recently, JIC made use of its knowledge assets – specifically, its knowhow and expertise - to boost tomatoes’ vitamin D levels by tweaking the fruit’s genetic makeup.  "
        },
        {
            "text": "The importance of Vitamin D:"
        },
        {
            "text": "Vitamin D is created in our bodies after our skin is exposed to UVB light but the major source is food. Earlier this month, the Department for Health and Social Care launched a new review of vitamin D intake to help tackle health disparities."
        },
        {
            "text": "In the UK, around 1 in 6 adults and almost 20% of children have vitamin D levels lower than government recommendations, which can lead to rickets, bone pain and disabilities."
        },
        {
            "text": "JIC’s solution - biofortified tomatoes:"
        },
        {
            "text": "Tomato leaves naturally contain one of vitamin D3’s building blocks, called provitamin D3 or 7-dehydrocholesterol (7-DHC), but at very low levels. However, provitamin D3 does not normally accumulate in ripe tomato fruits."
        },
        {
            "text": "Using existing technology, JIC researchers used their expertise to revise the genetic code of tomatoes so that provitamin D3 accumulates in the fruit. This technology allows scientists to 'cut' and 'paste' genes into DNA more rapidly and accurately."
        },
        {
            "text": "The innovation’s wider impacts:"
        },
        {
            "text": "After treatment with UVB light to turn the 7-DHC into vitamin D3, one biofortified tomato contained levels of vitamin D equivalent to two medium-sized eggs or 28g of tuna. There is scope to further increase these levels through extended exposure to UVB light. Additionally, when tomatoes are grown, their leaves are usually considered waste material. However, the leaves of these biofortified tomatoes could be manufactured for vegan-friendly vitamin D3 supplements, or for food fortification. This has the potential to be a simple and sustainable innovation in helping millions of people with vitamin D deficiencies."
        },
        {
            "text": "Dr Jie Li (JIC researcher) examines biofortified tomatoes. Credit: Phil Robinson"
        },
        {
            "text": " For more information:"
        }
    ]
}