{
    "url": "https://gfie.blog.gov.uk/2022/06/10/visible-valued-and-supported-carers-bringing-their-skills-and-experience-to-the-civil-service/",
    "title": "Visible, valued and supported: Carers bringing their skills and experience to the Civil Service ",
    "authors": [
        "Andrew Ashworth"
    ],
    "categories": [
        "#GFIEsuccessstory",
        "Carers",
        "connect",
        "Inclusion",
        "levelling up",
        "Life Chances",
        "Social mobility"
    ],
    "pub_date": "2022-06-10T12:13:00+01:00",
    "content": [
        {
            "heading": 2,
            "text": "A new Going Forward into Employment (GFiE) scheme is partnering with Carers Trust "
        },
        {
            "text": "Our new GFiE scheme for carers focuses on the talent that carers have.  We know that carers can experience barriers to employment including gaps in their CV because of years spent caring or loss in confidence associated with time out of the workplace.   Young Adult Carers can also experience barriers to accessing and fully participating in education and training opportunities because of their caring roles and these barriers can translate into barriers to employment.  "
        },
        {
            "text": "Becoming a carer doesn’t mean that your skills and experience disappear.  Your confidence might diminish because of time out of the workplace but your skills and experience don’t.  Quite the reverse, you may well gain insight and experience.  We are working in partnership with Carers Trust to match carers who may not otherwise consider a Civil Service job to bring that talent and experience into Civil Service roles."
        },
        {
            "text": " "
        },
        {
            "text": "This partnership with Carers Trust is exciting because they have the expertise and Network Partners to help match carers into roles.   Welcoming the launch of the GFiE scheme, Carers Trust Chief Executive, Kirsty McHugh, said:  “I’m thrilled the Civil Service is formally recognising the great benefits of having unpaid family carers in the workforce.  Carers develop incredible skills, including multitasking, navigating complex bureaucracies, plus empathy, responsibility and reliability – all the things we want in our employees.  And what better time to announce this scheme than Carers Week, where the theme is ‘making caring visible, valued and supported’?”"
        },
        {
            "text": "This is about more than a job.  We offer individuals tailored support too.  New starters who join via the scheme will have access to the support already available to carers in the Civil Service, including brilliant carers networks across government, the carers passport and a toolkit for line managers so that they can support new starters.  In addition every candidate will be offered a buddy to help them navigate their first Civil Service role. "
        },
        {
            "text": "It’s early days for the scheme but we've recently started recruiting into our first roles  - it’s an exciting milestone.  Learn more about what we do here or get in touch if you want to know more E-mail: GFiE@CabinetOffice.gov.uk."
        },
        {
            "text": "You can also follow us on Twitter @CS_GFIE"
        }
    ]
}