{
    "url": "https://socialworkers.blog.gov.uk/2022/06/10/what-you-need-to-know-about-the-independent-review-of-childrens-social-care/",
    "title": "What you need to know about the Independent Review of Children’s Social Care",
    "authors": [
        "Administrator"
    ],
    "categories": [
        "Independent Review of Children's Social Care"
    ],
    "pub_date": "2022-06-10T12:40:45+01:00",
    "content": [
        {
            "heading": 4,
            "text": "The Independent Review of Children’s Social Care has now set out, through a number of recommendations, what’s needed to bring forward change to children’s social care, so that it can provide more help to families in crisis; act decisively in response to abuse; and ensure those in care have lifelong loving relationships. Here, you can read about what this means for those working in children’s social care."
        },
        {
            "text": "You’ll know that the Independent Review of Children’s Social Care was commissioned by the government to take a fundamental look at children’s social care and understand how to transform it to better support the most vulnerable children and families. The review has engaged with around 2000 people with lived experience of children's social care and around 2,800 people with professional experience of children's social care."
        },
        {
            "text": "The approximately 80 recommendations in the review cover a range of issues, from transforming help for families, to a just and decisive care protection system, to realising the potential of the many thousands of dedicated professionals who work in children’s social care . The proposals will help social workers to make the best use of their skills – either by working directly with families intensively or supporting others to be effective."
        },
        {
            "heading": 3,
            "text": "The start of a fundamental shift"
        },
        {
            "text": "Change cannot happen easily overnight, but the review marks the start of a fundamental shift in how the government thinks about children’s social care. Later this year, the government will respond in full through an implementation strategy on plans to improve children’s social care, but it has also announced immediate action, including plans to:"
        },
        {
            "text": "The government has also responded to the recommendations set out in the Competition and Markets Authority report into the children’s social care market, published in March this year. The Department for Education will be carrying out further research into the children’s homes workforce, engaging with the sector and experts to improve oversight of the market."
        },
        {
            "heading": 3,
            "text": "What does this mean for social workers?"
        },
        {
            "text": "Social workers are central to overcoming the challenges we face in children’s social care and the care review specifically recognises their dedication and hard work. That is why one of our first priorities is to reframe and refocus the support social workers receive in the early part of their careers."
        },
        {
            "text": "It is so important to strengthen working between social care and schools to help identify needs early on, provide better support for families, and keep vulnerable young people engaged with their education to help to boost attendance, behaviour and attainment."
        },
        {
            "text": "The government is therefore providing funding to local councils to continue delivering the social workers in schools and designated safeguarding lead supervision programmes, building on successful pilots which have supported young people in hundreds of schools since launching in September 2020."
        },
        {
            "heading": 3,
            "text": "How will this help vulnerable families? "
        },
        {
            "text": "We know early support can make a real difference to families, which is why we champion Family Hubs. Hubs act as one-stop-shops where families can access important services but evidence shows that some of the most disadvantaged families don’t access them."
        },
        {
            "text": "An effective Family Hub creates a single ‘front door’, making it easier for families to get the help they need and improving the support on offer."
        },
        {
            "text": "Seven areas in England will therefore receive funding to set up a new Family Hub, building on the network of hubs that already exist across the country, increasing the number of families who can access this kind of help when they need it."
        },
        {
            "text": "Alongside this funding, the government is also carrying out work with the Anna Freud National Centre for Family Hubs to ensure all our investment is practice-led, evidence-based and informed by families’ own experiences."
        },
        {
            "text": "The review’s recommendations build on what has already been done to improve outcomes for the most vulnerable children and families. This includes:"
        },
        {
            "heading": 3,
            "text": "What about keeping the most vulnerable children safe? "
        },
        {
            "text": "As you may also have seen, following the tragic deaths of Arthur Labinjo-Hughes and Star Hobson, the Education Secretary asked the national Child Safeguarding Practice Review Panel to carry out a review to investigate the events leading up to the two children’s deaths. The aim of this was to identify lessons learned and where improvements are needed both locally and nationally."
        },
        {
            "text": "The review into Arthur and Star’s deaths was published on 26 May and makes local recommendations for both Solihull and Bradford councils respectively as well as further national recommendations, which the government is already taking action on."
        },
        {
            "text": "We are also engaging with all safeguarding partners to highlight important messages in the National Review and have put out a call to action to take forward the recommendations."
        },
        {
            "text": "Want to receive blog posts in your inbox?\nSign up to receive blog updates"
        },
        {
            "text": " "
        }
    ]
}