{
    "url": "https://educationhub.blog.gov.uk/2022/06/10/what-is-a-free-school-everything-you-need-to-know/",
    "title": "What is a free school? Everything you need to know",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "School places",
        "Schools"
    ],
    "pub_date": "2022-06-10T09:54:33+01:00",
    "content": [
        {
            "text": "All children in England between the ages of 5 and 16 are entitled to a free place at a state school."
        },
        {
            "text": "All state schools receive funding through their local authority or directly from the government."
        },
        {
            "text": "But there are different types of state school – these include free schools, which account for a significant number of the new schools being built and opened around the country."
        },
        {
            "text": "Here we answer your questions on free schools."
        },
        {
            "heading": 3,
            "text": "What is a free school?"
        },
        {
            "text": "Free schools are a type of academy - schools that are run by charities rather than the local authority (council) and cannot be run for financial profit."
        },
        {
            "text": "More information on academies is available here: What is an academy and what are the benefits? - The Education Hub (blog.gov.uk)). They are funded by central government and have a range of freedoms including the freedom to teach in an innovative way, whether that is focusing on STEM subjects or taking a different approach to learning."
        },
        {
            "text": "Over 600 free schools are open across England. They include primary, secondary, all-through, and standalone sixth forms, as well as schools specifically for children with special educational needs or disabilities (SEND) or pupils who, because of illness of otherwise, would not receive a suitable education in mainstream settings (alternative provision)."
        },
        {
            "text": "The free school programme has delivered hundreds of new schools and provided thousands of good school places across the country."
        },
        {
            "text": "86% of all free schools with inspection reports published by the end of April 2022 are rated ‘Good’ or ‘Outstanding’."
        },
        {
            "heading": 3,
            "text": "What’s the difference between a free school and academy?"
        },
        {
            "text": "Legally, free schools are academies. They are independent from local authorities (councils) and funded directly by the department. As with academies, free schools enjoy a range of freedoms including setting their own pay and conditions;  greater control over their budget; freedom from following the national curriculum; and the freedom to change the length of school days."
        },
        {
            "text": "The main difference is that free schools are newly set up schools whereas many academies as converters that were previously council run schools."
        },
        {
            "text": "For more information on the launch of the new special, AP and mainstream free schools application rounds, you can visit: Thousands more school and sixth form places to be created - GOV.UK (www.gov.uk)."
        },
        {
            "heading": 3,
            "text": "Who can attend a free school?"
        },
        {
            "text": "Anyone can attend a free school. Free schools are free to attend and must have admission arrangements that are clear and fair."
        },
        {
            "heading": 3,
            "text": "How can a free school be established?"
        },
        {
            "text": "Anybody can apply to set up a free school if they have the necessary capacity and capability."
        },
        {
            "text": "Applications go through a rigorous assessment and must demonstrate how the proposal will meet key criteria, such as a clear need for the places the school will create, and how the school will be financially viable whilst offering a broad and balanced curriculum."
        }
    ]
}