{
    "url": "https://mhclgmedia.blog.gov.uk/2024/04/30/homelessness-data/",
    "title": "Homelessness data",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Housing"
    ],
    "pub_date": "2024-04-30T16:20:34+01:00",
    "content": [
        {
            "text": "This morning we published the quarterly homelessness statistics. Whilst we continue to make good progress, there is more work to do to achieve our goals on tackling homelessness and eradicating rough sleeping."
        },
        {
            "text": "We want everyone to have a safe place to call home that’s why we are investing an unprecedented £2.4 billion over three years to tackle homelessness and end rough sleeping for good."
        },
        {
            "text": "This includes reducing the number of people in temporary accommodation, providing councils with £1.2 billion to help people off the streets and into secure housing, provide financial support those that need it and work with landlords to prevent evictions. We are also spending £220 million to help fund thousands of beds and specialist support services across the country through councils."
        },
        {
            "text": "With over £1.2 billion invested in the Homelessness Prevention Grant, councils can offer financial support for people to find a new home, work with landlords to prevent evictions or provide temporary accommodation to those in need."
        },
        {
            "text": "We’re working closely with local councils and partners across England to provide wider support including:"
        },
        {
            "text": "A Department for Levelling Up, Housing and Communities spokesperson said: "
        },
        {
            "text": "“We want everyone to have a safe place to call home, which is why we’re giving councils £1.2 billion so that they can give financial support to those who need it, helping them to find a new home and move out of temporary accommodation.  At the same time, we’ve boosted the local housing allowance, giving the 1.6 million private renters in receipt of housing benefit or universal credit an additional £800 to help towards rental costs."
        },
        {
            "text": "“Temporary accommodation is a vital safety net to make sure families are not left without a roof over their heads, but councils must make sure it is suitable for families who have a right to appeal if it’s not.”"
        }
    ]
}