{
    "url": "https://ukhsa.blog.gov.uk/2024/04/30/how-we-work-with-partners-to-push-the-boundaries-of-vaccine-rd/",
    "title": "How we work with partners to push the boundaries of vaccine R&D",
    "authors": [
        "Isabel Oliver"
    ],
    "categories": [
        "Immunisation and vaccination",
        "UKHSA science"
    ],
    "pub_date": "2024-04-30T11:21:19+01:00",
    "content": [
        {
            "text": "As we release our Commercial Strategy, I wanted to reflect on the ways in which we partner with industry to drive greater innovations and better health outcomes."
        },
        {
            "text": "One unintended consequence of the response to COVID-19 was the suppression of many diseases, but this was offset by a negative impact on global vaccine uptake. Post-pandemic, unsurprisingly, we are seeing diseases bouncing back."
        },
        {
            "text": "With the potential that an unknown pathogen, ‘Disease X’, could emerge, preparation is essential. UKHSA is fully focused on readying the UK against all eventualities and our Science Strategy has vaccines at its core."
        },
        {
            "heading": 2,
            "text": "Vaccine development and early access"
        },
        {
            "text": "Ensuring the UK has early access to effective vaccines means working with industry, academia and global partners is crucial. Last year we launched our Vaccine Development and Evaluation Centre (VDEC) and are also leading on Government’s 10-year Strategic Partnership with Moderna (MSP)."
        },
        {
            "text": "Both strive to push the boundaries of vaccine R&D for pandemic preparedness. COVID-19 demonstrated that closer collaboration between government, industry and academia can lead to greater innovation, faster breakthroughs and better health outcomes, and these two initiatives are excellent examples driving that collaboration forward."
        },
        {
            "heading": 2,
            "text": "Targeting the deadliest pathogens"
        },
        {
            "text": "VDEC’s sole aim is to target the deadliest pathogens and those with pandemic potential by working collaboratively to help find, develop and evaluate new vaccines and treatments where none exist, or improve those that do. Its work includes rapid assessment of vaccines against new variants to make sure that our vaccination programmes are effective."
        },
        {
            "text": "VDEC scientists have already discovered the possibility for a world-first vaccine against Crimean-Congo Haemorrhagic Fever, with a vaccine now in stage one clinical trials which, if successful, would be a major global breakthrough."
        },
        {
            "text": "As part of the MSP, Moderna is building a new mRNA research, development and manufacturing facility at Harwell and has committed substantial funding to UK-based R&D activities, with the potential to develop vaccines targeting a range of infectious diseases."
        },
        {
            "heading": 2,
            "text": "100 Days Mission"
        },
        {
            "text": "The deal will significantly boost our ability to respond to future pandemics and, alongside VDEC, supports the global 100 Days Mission – with the ambitious aim of deploying an effective countermeasure including vaccine within 100 days of identifying a new pandemic threat."
        },
        {
            "text": "Recently Government announced a major boost for UK life sciences with a £650m investment from AstraZeneca, which will see UKHSA partnering with AZ to further boost our vaccine efforts; with ongoing work to develop new, as well as optimizing current vaccines."
        },
        {
            "heading": 2,
            "text": "‘Organ-on-a-chip’"
        },
        {
            "text": "Further innovation includes developing alternatives to in vivo (animal) studies using human 3D tissue systems otherwise known as microphysiological systems or ‘organ-on-a-chip’ technology; likely to lead to new tools for use in the development of drugs, therapeutics and vaccines which reduces and may hopefully one day replace animal experimentation in medical research."
        },
        {
            "text": "UKHSA has also secured an agreement with CSL Seqirus, who will be on standby to produce over 100m influenza pandemic vaccines (tailored to the specific strain) if needed, with manufacture entirely UK-based ensuring security of access."
        },
        {
            "text": "Following wide consultation, we will soon finalise our Pathogen Prioritisation list for pandemic and endemic diseases, which includes both viruses and bacteria, that will help steer our vaccine and pandemic preparedness work including for diagnostics."
        },
        {
            "text": "Our Science Strategy is all about building capacity and flexibility into the system for pandemic preparedness, with vaccines as  the cornerstone. Collaboration is key and we have recently expanded our relationship with global partners including WHO, CEPI, the Canadian, Korean and US Governments as well as industry."
        },
        {
            "text": "We are working hard to ensure the UK is leading the way globally. It is nearly impossible to predict exactly what the next major public health threat will be, but by laying the foundations ahead of time, we can ensure our response will be quick and effective, saving lives and minimizing the impact on society."
        },
        {
            "heading": 3,
            "text": "Further reading"
        },
        {
            "text": "A commercial strategy for UK Health Security Agency"
        },
        {
            "text": "UKHSA Science Strategy: A vision for how science can secure health and prosperity"
        },
        {
            "text": "Making progress on the global mission to develop pandemic-fighting tools within 100 days"
        }
    ]
}