{
    "url": "https://sustainableict.blog.gov.uk/2024/04/30/how-were-taking-our-circular-economy-message-on-the-road/",
    "title": "How we’re taking our circular economy message on the road",
    "authors": [
        "Mimi Moll",
        "Emily Watson-Breeze"
    ],
    "categories": [
        "Circular economy",
        "GDSA",
        "Sustainable ICT"
    ],
    "pub_date": "2024-04-30T10:46:03+01:00",
    "content": [
        {
            "text": "Buoyed by the positive reaction to their session and panel discussion at the recent Government Digital Sustainability Alliance (GDSA) Summit, Mimi Moll and Emily Watson-Breeze from the Circular Economy Working Group share their key reflections from the event and set out their priorities looking forward."
        },
        {
            "text": "Once upon a time it used to be an accepted opinion that when you present at conferences and similar events, you should never go on straight before lunch (because the audience are often hungry), or never go on last (because the audience are getting ready to go home!)."
        },
        {
            "text": "Whilst our presentation and discussion on circular economy was the last working group session of the day at the GDSA Summit, we encountered an audience that was both fed and engaged."
        },
        {
            "text": "Of course, it helped that the topic we discussed linked really well to the previous sessions in the day which focused on the industry itself, and on sustainable stewardship."
        },
        {
            "text": "And we were also preaching to the converted, in a way. Our audience knew that part of the ‘circular economy challenge’ is recycling and reusability of materials, along with extending the product lifecycle, both of which are critical to moving towards a circular economy; we didn’t need to tell them that."
        },
        {
            "heading": 2,
            "text": "Defining the circular economy"
        },
        {
            "text": "In a circular economy, products and materials are used for longer due to strong maintenance regimes, reuse, refurbishment, remanufacturing, and recycling; materials never become waste."
        },
        {
            "text": "So, it was probably also to our advantage that one of the Summit’s visual highlights was Zak Miskry's incredible and amazing chameleon sculpture, created especially for the GDSA, and introduced at the Summit."
        },
        {
            "text": "The sculpture, which took centre stage throughout the day, is made entirely from discarded e-waste – the epitome of the circular economy ethos. It stands for the fact that we all are, or all need to be, change agents."
        },
        {
            "heading": 2,
            "text": "Where we started our Circular Economy journey"
        },
        {
            "text": "The first crucial step in our circular economy work, around a year ago, was to understand the challenges that hinder progress towards this goal. To achieve this, we conducted primary surveys and analysed published papers related to sustainability and circularity."
        },
        {
            "text": "The findings were illuminating, revealing a complex web of barriers which ranged from policy and regulatory issues to procurement behaviours and supply chain challenges."
        },
        {
            "text": "These insights have provided the foundation for how we now want to develop this work."
        },
        {
            "heading": 2,
            "text": "Our key takeaways from the GDSA Summit"
        },
        {
            "heading": 2,
            "text": "Where we go next"
        },
        {
            "text": "Since the Summit our working group have met to reflect on what was discussed and to agree the next steps. These include evolving our discussion paper into a more engaging and visually appealing, digital document, that we can share and debate on. If we want to connect with different audiences, we need to appeal to them in different ways."
        },
        {
            "text": "We’re also planning to take the chameleon ‘on tour’, to give it more visibility and to help raise awareness, both of our work, but also of the possibilities that recycling old materials can offer."
        },
        {
            "text": "The chameleon will be going on tour, as part of phase two of the technology amnesty project that DXC are delivering for Defra, visiting many Defra sites, UK-wide, over the coming months. Alongside this, we’ll also be devising a ‘name the chameleon’ competition as part of the tour, to drive engagement and discussion."
        },
        {
            "text": "You can expect more blogs about these exciting plans, as the tech amnesty team and Defra colleagues continue raising awareness of the circular economy issue."
        },
        {
            "text": "We also want to partner with more central government departments to explore, in real life, what some of the barriers to a circular economy might be along with some of the potential solutions."
        },
        {
            "heading": 2,
            "text": "And finally……."
        },
        {
            "text": "As a working group we are deeply committed to embedding social sustainability into our ideas too. One pivotal approach we believe that we've adopted is recognising the transformative potential of the circular economy in fostering social value. Specifically, the cascading of devices into digital equity and inclusion schemes, as a key strategy to achieving this goal."
        },
        {
            "text": "By repurposing and redistributing devices, not only are you extending the lifespan of products but also empowering communities by providing access to digital resources. This proactive stance both addresses environmental concerns, but also directly contributes to enhancing social equity and inclusion, aligning perfectly with a commitment to embedding social sustainability into what we do."
        },
        {
            "text": "It’s worth reflecting that hundreds of thousands of tonnes of e-waste are still being generated each year, and not enough of it is recycled. The circular economy needs to do more to design out waste, but at the moment we're still creating too much of it."
        },
        {
            "text": "As a group it's been really fascinating to see the statistics that have been coming out in recent months from all manner of surveys. This has compelled us to take action as a group, to work together, and to feel passionate about this work."
        },
        {
            "text": "The fast-paced nature of technology means that demand increases quickly, and we need to use education in circular and sustainable design and disposal to support the evolution to a circular economy, so that a whole range of professions, ranging from designers and buyers to engineers, understand the sustainability implications of technology."
        },
        {
            "text": "If you feel passionate about this too, and you’re in the tech industry, we’d welcome your help.  We need further expertise across our membership group, especially around the areas of security and procurement. So do get in touch."
        },
        {
            "text": " "
        }
    ]
}