{
    "url": "https://ukhsa.blog.gov.uk/2024/04/30/how-did-singing-and-dancing-pills-raise-awareness-of-antibiotic-resistance/",
    "title": "How did singing and dancing pills raise awareness of antibiotic resistance? ",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Behavioural Insights",
        "Data blog",
        "Social marketing"
    ],
    "pub_date": "2024-04-30T18:12:58+01:00",
    "content": [
        {
            "text": "Antimicrobial resistance (AMR) occurs when organisms that cause infection, like bacteria, develop resistance to medicines like antibiotics. The World Health Organization estimates that there are 4.95 million deaths per year associated with AMR and the issue is a top public health priority for policymakers in the UK and around the world.   "
        },
        {
            "text": "In December 2017, Public Health England set about raising public awareness and understanding of AMR to tackle the incorrect use of antibiotics by the general public and healthcare professionals. "
        },
        {
            "text": "Over a three-year period, the Keep Antibiotics Working campaign was targeted at groups who were most likely to use antibiotics (mothers of children aged 0 to 16, and people aged over 50), and healthcare professionals dealing with patient care and prescribing. "
        },
        {
            "text": "In a peer-reviewed study investigating the impact of the campaign, we found it reached the target audience, boosted awareness, and supported GPs, as well as increasing knowledge, changing attitudes, and increasing concern about AMR. "
        },
        {
            "heading": 2,
            "text": "Dancing pills "
        },
        {
            "text": "The campaign was fronted by a group of singing and dancing anthropomorphic antibiotic pills, who serenaded our audiences with a fun, catchy and engaging song about the importance of only taking antibiotics when you need them and following your healthcare professional’s advice.  "
        },
        {
            "text": "This was run in advertising across television and video-on-demand, radio, newspapers, billboards and other outdoor displays, and on social media. "
        },
        {
            "text": "The campaign also included patient resources like information leaflets and posters for healthcare professionals to give to members of the public. "
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Investigating impact "
        },
        {
            "text": "In November 2023, UKHSA published a study in the academic journal Eurosurveillance evaluating the impact of the campaign.  "
        },
        {
            "text": "We wanted to find out whether we had been successful in reaching the general public and our specific target audiences, and if the public’s knowledge, awareness and understanding of antimicrobial resistance improved due to the campaign.  "
        },
        {
            "text": "We also wanted to investigate whether correct antibiotic usage increased, if GPs were more confident to decline antibiotics, and if demand from patients went down. "
        },
        {
            "heading": 2,
            "text": "How was the study undertaken? "
        },
        {
            "text": "We collected questionnaire data from the public before and after each campaign burst, which ran for three months each year. "
        },
        {
            "text": "Our target sample size was 1,000 respondents for each questionnaire wave. Samples were then increased with each wave through targeted sampling among key groups, such as mothers of children aged 0 to 16.  "
        },
        {
            "text": "The public sample was weighted to ensure it was nationally representative by age, gender, region, and socioeconomic status.  "
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "What we found "
        },
        {
            "text": "Over the three years of activity, we saw increases across key metrics. This included a significant jump in awareness across target audiences, with a 20% increase among mothers of children aged 0 to 16.  "
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "What do these findings tell us? "
        },
        {
            "text": "These findings clearly demonstrate the important role that communication campaigns can have in raising awareness about serious public health concerns like AMR.  "
        },
        {
            "text": "Although Keep Antibiotics Working is no longer a live media campaign, the digital resources are still available and have been translated into 12 additional languages. We have also continued to engage the public through other tools, including: "
        }
    ]
}