{
    "url": "https://educationinspection.blog.gov.uk/2024/04/30/our-approach-to-inspecting-small-schools/",
    "title": "Our approach to inspecting small schools",
    "authors": [
        "Richard Kueh HMI, Deputy Director, Schools and Early Education"
    ],
    "categories": [
        "inspection",
        "schools",
        "teachers"
    ],
    "pub_date": "2024-04-30T09:30:38+01:00",
    "content": [
        {
            "text": "Small schools are a valuable part of our education system. Pupils who attend them have unique experiences. Leaders who lead them have lots of opportunities, but also face many challenges. In this blog, we set out how we take these factors into consideration when we inspect small schools. We will emphasise how we adapt what we do."
        },
        {
            "text": "We know that schools come in all different shapes and sizes. There are currently just under 4,000 schools in England with fewer than 150 pupils. When we inspect these schools, we send fewer inspectors to be part of the inspection team. We therefore often refer to these schools as ‘small’."
        },
        {
            "text": "Opportunities and challenges"
        },
        {
            "text": "One way of thinking about small schools is to liken them to a small boat. A small boat has a smaller crew. It carries fewer passengers. Everyone has to do a lot of different jobs. If someone is not there, then it impacts on what everyone else has to do. On the other hand, a smaller boat can often be more agile. It can make course corrections and changes very quickly compared to larger boats. In the same way, there are many advantages to being a small school, as well as challenges too."
        },
        {
            "text": "Positively, there are many opportunities that come with being a small school. Small schools are often integral parts of the local community. Often, teachers and staff know pupils and their families remarkably well, with extraordinary levels of contact. In classes with mixed age groups, pupils benefit from looking up to older pupils or helping out younger ones. It is in schools like these that the very youngest of pupils can routinely play with the oldest during break and lunch times."
        },
        {
            "text": "At the same time, small schools face unique challenges. They can find it difficult to provide core services and functions within their specific financial constraints. Often, the number of pupils in the school can vary considerably from year to year and so leaders have to make changes to the curriculum based on this. When pupils are taught in classes of mixed ages, leaders need to consider how groups within the same class can progress through the curriculum."
        },
        {
            "text": "Our approach to inspecting small schools"
        },
        {
            "text": "When we are in a small school, we prioritise understanding the context of the school. We will want to understand the numbers, such as how many pupils there are and how many have special educational needs and/or disabilities. We will want to know the effect this has on everyday life at the school."
        },
        {
            "text": "We will not expect things to be done in a particular order. We know that suggestions about the inspection timetable can, for example, affect a smaller school more than larger ones."
        },
        {
            "text": "It is our role to understand what the school is doing and the impact that this is having on the pupils in the school. An important part of this is the curriculum. We know that many small schools will have mixed-age classes. So, we will listen to understand how this works in each school. We will focus on the impact of that curriculum in terms of what pupils know and what they can do."
        },
        {
            "text": "Some small schools draw on expertise or leadership from people who are not in the school every day of the week. It is important that we know about this so that, where relevant, we can include those people in any inspection activities."
        },
        {
            "text": "In a larger school, leaders may need a variety of formal strategies to assure themselves of quality. However, these same approaches to quality assurance may not be needed in smaller schools. Monitoring may be much less formal. We do not have an expected version of what such monitoring looks like. Instead, we’re interested in what you are doing in your school and how you know whether pupils are learning what they are supposed to."
        },
        {
            "text": "A collaborative approach to inspection"
        },
        {
            "text": "We will want to collaborate with you in creating an inspection timetable that works well for everyone. We gather the evidence we need, but will aim to do so in a way that does not disrupt your normal routine."
        },
        {
            "text": "If we are doing a graded inspection in small schools, we only carry out 3 deep dives. As we do in other inspections, we discuss together the subjects that are most appropriate to explore, and will usually choose subjects led by different people in the school. This is to support you to spread out this part of the inspection. We aim to be flexible throughout an inspection of a small school. We might join some of our deep dive activities together, such as talking to pupils during lessons that we visit."
        },
        {
            "text": "Throughout the inspection, we’ll have time to keep you informed through regular catch-ups and ‘keeping in touch’ meetings. Our inspectors are, or have been, school leaders, and know some of the pressures you face. It is important for our inspectors to maintain a positive working relationship with you."
        },
        {
            "text": "All pupils deserve a good quality of education, and inspection helps us to ensure that this is the case. Our education inspection framework has the same focus on quality of education during our inspections, because every pupil deserves a quality education, no matter what school they attend. However, in other ways, each inspection is as unique as the school inspected. That’s why we particularly want to tailor our inspections in small schools."
        },
        {
            "text": "So, what should small schools do differently for an Ofsted inspection? Nothing! It's our job to work around you and see that you're doing the best for your children. If you're doing that, then you don’t need to do anything else."
        },
        {
            "text": "Find out more"
        },
        {
            "text": "We recently held a webinar on this topic. You can catch up on our YouTube channel or by clicking the below image."
        }
    ]
}