{
    "url": "https://nationalscreening.blog.gov.uk/2024/04/30/uk-nsc-screening-seminars-let-us-know-what-youd-like-us-to-cover/",
    "title": "UK NSC screening seminars: let us know what you'd like us to cover",
    "authors": [
        "TJ Day"
    ],
    "categories": [
        "General"
    ],
    "pub_date": "2024-04-30T12:55:04+01:00",
    "content": [
        {
            "text": "In 2023, the UK National Screening Committee (UK NSC) set up a series of online screening seminars open to all. We’d like to continue providing these popular free to attend sessions and want to make sure we cover topics of wide interest. This is where you come in…"
        },
        {
            "text": "If you have any ideas for topic areas for us to cover, we’d love to hear from you. Topics could relate specifically to the work of the UK NSC, or look at current and upcoming issues from across the world of screening – practical or theoretical."
        },
        {
            "text": "For example, would you like to find out more about new tests for detecting multiple cancers? Learn about the challenges of assessing evidence for screening for rare diseases? Or hear about how the definition of screening differs from case finding?"
        },
        {
            "text": "Our sessions in 2023 were led by colleagues from the UK NSC, NHS, universities, and screening programmes, and covered:"
        },
        {
            "heading": 2,
            "text": "How to send us your ideas"
        },
        {
            "text": "If you would like to suggest a seminar topic for future inclusion, please:"
        },
        {
            "text": "We just need your contact details, a description of the seminar topic, and any ideas you may have for specific presenters we can approach. We’ll do the rest!"
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK NSC. You can register to receive updates direct to your inbox, so there is no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, please email uknsc@dhsc.gov.uk."
        }
    ]
}