{
    "url": "https://defradigital.blog.gov.uk/2023/10/03/a-day-in-the-life-of-a-senior-project-manager-in-defra-digital-data-and-technology/",
    "title": "A day in the life of a Senior Project Manager in Defra Digital, Data and Technology",
    "authors": [
        "Kieran Lewis"
    ],
    "categories": [
        "Defra services",
        "User centred design"
    ],
    "pub_date": "2023-10-03T07:00:00+01:00",
    "content": [
        {
            "text": "Senior Project Manager Kieran Lewis lifts the lid on a typical day in his world, working across different projects and balancing differing priorities."
        },
        {
            "heading": 2,
            "text": "Tell us about your role at Defra"
        },
        {
            "text": "I am a Senior Project Manager within the Digital Delivery team, which is part of Defra’s Digital, Data and Technology Services (DDTS). I work across multiple and varied digital projects. Ranging from internal process or operational enhancements that help Defra staff work better, to building a service that members of the public will use on GOV.UK."
        },
        {
            "heading": 2,
            "text": "How did you get here?"
        },
        {
            "text": "In one of my first tech-oriented roles after graduating university, one of my colleagues suggested I investigate project management as a career path. This was likely because of me rapidly developing a tendency to independently start developing mini plans for most aspects of the business, lunch breaks excluded. Alternately that same colleague, who so kindly pointed me in the direction of project management, could’ve just gotten fed-up with the shoddy data-analysis work I was doing at the time …"
        },
        {
            "text": "Fast-forward 18 months, PRINCE2 qualification in-hand, and I was offered a role at Defra to work as a Project Support Officer as part of the EU-Exit PMO, based in Crewe. I genuinely fell in love with my role and the projects I was working on. More than that, I made some brilliant friends along the way, many of whom are still at Defra today. The work was as challenging as it was rewarding and was all emphasised by the fact that much of what I worked on was often in the headlines or being discussed by members of parliament daily."
        },
        {
            "text": "I re-joined Defra in 2021 as a Senior Project Manager, after spending some time further honing my Project Management skills, which is where I find myself now."
        },
        {
            "heading": 2,
            "text": "What projects have you worked on?"
        },
        {
            "text": "At Defra I’ve worked on several not only fascinating, but critical projects. In my previous role, as part of the EU-Exit team, I collaborated with the team responsible for developing the “Import of products, animals, food and feed system” (IPAFFS). The development of this service was essential to ensuring users could continue notify the right authorities in Great Britain before the certain goods arrive from EU and non-EU countries, once we transitioned away from the existing service."
        },
        {
            "text": "A current project I am working within is the implementation of a new Defra Library Service. This project is scoped with delivering a new system / service which will enable Defra, it’s Arms-Length-Bodies (ALBs) and members of the public to quickly and easily access library records and research material. As well as Defra Library staff I get to collaborate with members of the Chief Scientific Advisors Office (CSAO), the Marine Evidence team and a number of DDTS professional, as well as external suppliers, who collectively all want to see this service be a success."
        },
        {
            "text": "On another project, I’m working closely with the Joint Nature Conservation Committee (JNCC) who are building a new Air Pollution assessment Service on GOV.UK. This service will support risk assessment in the UK of air pollution effects on ecosystems, statutory reporting requirements and the potential to support the issue of permissions for individual plans or projects."
        },
        {
            "text": "These are just three of the varied projects I’ve worked on at Defra, but they illustrate the range of different stakeholder groups and policy areas I get to learn more about and build better relationships with in them, just by doing my job each day."
        },
        {
            "heading": 2,
            "text": "Describe a typical day"
        },
        {
            "text": "Typical days are few and far-between in project delivery, but I’ll try my best. Before 9:00 I’ll be sure I’m logged-on and working through any Teams messages or emails I need to address as a priority that-day, this step also helps me ready for my regular team catch-ups that I plan in around 9:00-10:00 daily, the day of the week generally determining which project is the focus for this session."
        },
        {
            "text": "Regardless of the delivery model, whether the project is Agile or Waterfall, these stand-ups allow me to ensure my priorities align with my teams, and that each project team member is communicating risks, issues, or general progress updates not only to me, but one-another as well. This helps with keeping everyone aligned and the project heading in the right direction."
        },
        {
            "text": "From then, my day opens to something less structured, but my calendar will be peppered with meetings I’m facilitating, attending or appointments I’ve built into my diary for myself to work on specific tasks (like writing this blog post!). The work can range from collaborating with stakeholders on identifying the benefits a new service will bring, to running a lessons-learned workshop with the project team to understand how we can individually and collectively improve how we deliver."
        },
        {
            "text": "Rarely however is a day’s events set in stone from the outset, and it’s important as a project manager to regularly re-assess tasks and their priorities as the day progresses, and not only for you, but your team as-well. Come the end of the day, often, what you had planned to do has been supplanted with something new – but that’s not a bad thing. It keeps the work fresh and engaging as you’re never quite sure what tomorrow will bring."
        },
        {
            "heading": 2,
            "text": "What’s the best thing about working for Defra?"
        },
        {
            "text": "In writing this I’ve looked at other Defra blog posts to help inspire my own, but on this question I’m afraid I must conform. The best part about Defra is its people."
        },
        {
            "text": "I’ve only been able to scratch the surface here on detailing the diverse range of people I get to talk to every day, whether they’re from a technical, policy or delivery background, but there’s a common thread that runs through each of them."
        },
        {
            "text": "They care - to unpack that a bit further, this care is multifaceted."
        }
    ]
}