{
    "url": "https://naturalengland.blog.gov.uk/2023/10/03/developers-share-experiences-of-successfully-delivering-biodiversity-net-gain/",
    "title": "Developers share experiences of successfully delivering biodiversity net gain",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Development",
        "Uncategorized",
        "Wildlife"
    ],
    "pub_date": "2023-10-03T09:15:26+01:00",
    "content": [
        {
            "text": "How are homebuilders delivering biodiversity net gain while also delivering the homes people need? In this blog, Helen Nyul, Group Head of Biodiversity at Barratt Developments, Neil Beamsley, Group Head of Biodiversity at Bellway Homes and Louise Clarke, Group Head of Sustainability at Berkeley Group, discuss how they approached BNG in recent developments. "
        },
        {
            "text": "Barratt and David Wilson Homes \nBarratt and David Wilson Homes have for the past eight years worked with the RSPB to create biodiverse show home gardens and open green spaces on our developments. We’re also encouraging homeowners to make space for nature in their gardens."
        },
        {
            "text": "Our Cotgrave development in Nottinghamshire is nestled between rolling hills and a country park. We are planning to build up to 120 new homes on the 11.5 hectare green site.\nThe original habitat on the site consisted of arable land, marshy grassland, scrub and bare ground. As with many regeneration sites, the biggest challenge to creating BNG within the site was its rich habitats, particularly the marshy grassland and scrub habitat. These need to be left in place."
        },
        {
            "text": "To communicate to urban designers the importance of keeping these areas, ecological consultants mapped the habitats using a heat map. This made it easier to identify the areas that were most biodiverse – and should be left untouched – and the areas where development should be concentrated."
        },
        {
            "text": "We made the most of the marshy grasslands and scrub habitats, using these as part of the sustainable drainage and landscaping schemes."
        },
        {
            "text": "Within the public open space, we plan to plant new trees, scrub and meadow grassland. There will also be nesting bricks and hedgehog highways around the site all intended to encourage more local wildlife."
        },
        {
            "text": "Find out more about our approach to BNG and our Building Sustainably Framework."
        },
        {
            "text": "Bellway Homes\nBellway Homes recently received planning permission to develop a new housing scheme in Bolton. The scheme, to be built over several phases, will eventually deliver in the region of 300 new homes. Landscape impact was an important factor in the planning decision."
        },
        {
            "text": "With landscape impact being a key consideration, our approach to BNG played a key role in delivering a design which both complemented sensitive local landscape and provided measurable gains in biodiversity."
        },
        {
            "text": "Bellway’s urban design team worked with our consultants to identify key existing important landscape features such as mature trees, ponds and hedgerows. They sought to identify ways to retain and integrate them into the wider landscaping scheme."
        },
        {
            "text": "This approach allowed Bellway to deliver gains of between 11 per cent and 41 per cent for habitats across the phases, and 20 per cent and 40 per cent gains for hedgerows. The team were thrilled with this result.\nKey lessons:"
        },
        {
            "text": "Find out more about our approach to BNG and how we are building long-term, sustainable communities."
        },
        {
            "text": "Berkeley Group\nThe Green Quarter, in Southall, West London, is one of Berkeley Group’s most ambitious and complex brownfield regeneration projects.\nBNG was a priority from day one. Our design team focussed on weaving a vast network of green and blue infrastructure through the masterplan. This means people’s homes are set within a mix of beautiful natural spaces, including:"
        },
        {
            "text": "When complete, the old gasworks will have transformed into one of the most biodiverse landscapes in West London.Within this vast natural network, each green and blue space is carefully designed to be biodiverse, accessible and useful. Inviting footpaths, cycle routes and boardwalks connect the neighbourhood and encourage healthy active travel."
        },
        {
            "text": "Delivering such a large and complex mix of habitats is a big challenge which requires expert and experienced teams and long-term planning. For example, The Green Quarter will include more than 2,500 carefully selected trees, so we have created an on-site tree nursery. In the nursery we’re growing 600 trees which will be planted out in later phases. This gives us security of supply, improves local air quality and is an open public space and community attraction."
        },
        {
            "text": "To sum up, there are 3 key lessons from The Green Quarter.\n1. Landscape led master planning: BNG should be at the heart of the design process from the earliest stage\n2. Connectivity: landscape design should be accessible, welcoming and varied to encourage interaction with nature\n3. Attention to detail: plan and manage delivery to ensure every space and habitat lives up to its design intent.\nFind out more about Berkeley Group’s commitment to biodiversity net gain."
        },
        {
            "text": "Let’s continue to maximise the opportunities arising from biodiversity net gain, to support Nature’s recovery and create the healthy, beautiful, and sustainable places where people will want to live."
        }
    ]
}