{
    "url": "https://nationalscreening.blog.gov.uk/2023/10/03/diabetic-eye-screening-changes-for-people-at-lower-risk-in-england/",
    "title": "Diabetic eye screening changes for people at lower risk in England",
    "authors": [
        "Mike Harris"
    ],
    "categories": [
        "General",
        "NHS Diabetic Eye Screening Programme"
    ],
    "pub_date": "2023-10-03T17:01:47+01:00",
    "content": [
        {
            "text": "The NHS in England will this month start inviting people at lower risk of diabetic retinopathy for diabetic eye screening every 2 years instead of every year."
        },
        {
            "text": "The rollout of the lower risk diabetic eye screening pathway is based on a recommendation from the UK National Screening Committee (UK NSC), the independent scientific committee that advises the UK governments and the NHS on all aspects of screening."
        },
        {
            "text": "Diabetic eye screening helps prevent sight loss caused by diabetic retinopathy. Screening can detect the condition early before people notice any changes to their vision."
        },
        {
            "text": "The UK NSC recommended changing diabetic eye screening appointments from every year to every 2 years for people at low risk because:"
        },
        {
            "text": "This change has already been implemented in Wales, Scotland and Northern Ireland."
        },
        {
            "heading": 2,
            "text": "What is changing and when"
        },
        {
            "text": "From October 2023, people with diabetes in England aged 12 and over, who have had 2 consecutive eye screening tests showing no signs of diabetic retinopathy, will start to be offered screening every 2 years. Anyone at higher risk will continue to receive more regular eye screening."
        },
        {
            "text": "The changes will be made gradually over a 2-year period. People with diabetes will now start to be informed of the change if they are eligible following their diabetic eye screening results."
        },
        {
            "text": "Deborah Tomalin, Director of Public Health and Operations, NHS England, said:"
        },
        {
            "text": "Esther Walden, Diabetes UK Deputy Head of Care, said:"
        },
        {
            "text": "More information about the implementation of the low-risk diabetic eye screening pathway in England can be found on NHS.UK and GOV.UK."
        },
        {
            "text": "The UK NSC regularly reviews screening recommendations for more than 100 conditions. The introduction of the lower risk diabetic eye screening pathway is an example of the committee recommending an improvement to an existing screening programme in response to the latest evidence."
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "We’ll post details of new screening seminars on this blog. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new articles."
        }
    ]
}