{
    "url": "https://lifeathmrc.blog.gov.uk/2023/10/03/india-buildings-where-my-story-began/",
    "title": "India Buildings Liverpool: Where my story began",
    "authors": [
        "Faye",
        "Lucy"
    ],
    "categories": [
        "General"
    ],
    "pub_date": "2023-10-03T10:59:08+00:00",
    "content": [
        {
            "text": "What does ‘going into the office’ look like for you?  "
        },
        {
            "text": "For many, it’s a hybrid approach. A minimum of 2 or 3 days a week working from a modern office building. Flexible workspaces, adaptable furniture; many even boast wellness zones and fancy murals on the walls. At HMRC, we are lucky enough to offer all the above, plus a little bit more in our Liverpool Regional Centre – the historic ‘India Buildings.’ "
        },
        {
            "heading": 3,
            "text": "Welcome to India Buildings "
        },
        {
            "text": "India Buildings was constructed between 1924 to 1932 by the Dove Brothers. It was first occupied by a variety of different businesses, including Lloyds Bank (The Bankers of Holts), the Post Office and Maritime Insurance Co, along with a public hall on the ground floor.  "
        },
        {
            "text": "Nearly 100 years later, and now home to HMRC, the Grade II* listed building is still as impressive as when it was first built all those years ago.  "
        },
        {
            "text": "The vast, beautifully carved arches sweeping over the main doors ooze grandeur. They are adorned with cherubs and intricate sculptures, which pay homage to Liverpool’s maritime history. Above them flies the UK flag, which is looked down upon by Bella and Bertie – the Liver Birds. It couldn’t be a more iconic Liverpool welcome if you tried. And that’s before you have even ventured inside… "
        },
        {
            "text": "    "
        },
        {
            "text": "Stepping foot inside the building feels like a throwback to a bygone era. The level of detail that has gone into every inch of the building restoration is extraordinary.  "
        },
        {
            "text": "After passing through security, you are faced with a long arcade that boasts beautiful marble floors and columns, and a highly decorative turquoise and gold ceiling. The rooms either side of the arcade, which were once shops, are now meeting rooms filled with paintings and artefacts. It makes coming into work feel like a real privilege.  "
        },
        {
            "text": "    "
        },
        {
            "text": "I could go on all day about the beauty of India Buildings, for which I feel very lucky that I get to call it my place of work. However, for many of my colleagues who work here, there is a connection than spans much further than just coming to work every day.  "
        },
        {
            "text": "Press Officer, Lucy, shares her story of how she was drawn back to India Buildings – the place where her mum and dad fell in love back in 1969.  "
        },
        {
            "heading": 3,
            "text": "My career journey: from Mongolia to Liverpool "
        },
        {
            "text": "I am a Press Officer based in India Buildings in Liverpool and I am part of a team which publicises HMRC’s Self- Assessment and Child Benefit campaigns to customers via the media. Before joining the Civil Service, I was a journalist and worked for regional and national titles.  "
        },
        {
            "text": "I got my break in journalism 5 years after graduating in the mid-1990s and working low paid, unfulfilling jobs in London. Sick of going nowhere fast, I decided to shake things up and moved to Mongolia to work as a youth charity volunteer for a few months.  "
        },
        {
            "text": "While browsing the classifieds of The Mongol Messenger – an English language newspaper serving the expatriate community – I spotted that they were looking for a Sub Editor.  "
        },
        {
            "text": "They hired me and I spent a year editing copy and writing headlines before coming home and consolidating my on-the-job training with a short journalism course at The City of Liverpool College.  "
        },
        {
            "text": "I scored freelance shifts at the now defunct titles The Wirral News and Liverpool Daily Post before landing my first permanent role as a cub reporter on a daily newspaper in a town where not much happened. My ‘Man Finds Fish on Beach’ story was a career highlight.  "
        },
        {
            "text": "Onwards and upwards, to bigger media outlets in different UK cities, my adulthood mirroring my childhood, when we moved around the country for my dad’s job. "
        },
        {
            "text": "Five years ago, I changed direction and got a job as a Press Officer for HMRC in Croydon, but I felt the pull of home – and the need for a more affordable lifestyle – and was able to transfer to Liverpool.   "
        },
        {
            "heading": 3,
            "text": "A story of love "
        },
        {
            "text": "Working in beautiful India Buildings was a homecoming of sorts, because it’s the place where my parents met and fell in love in 1969.  "
        },
        {
            "text": "They worked for The Ocean Steamship Company on the seventh floor. My mum was fresh out of school and working in the cash office, which is where she met my dad, a graduate in his first job as a junior manager.  "
        },
        {
            "text": "They’d slip out on lunchtime dates to enjoy a schooner of sherry and a cheese sandwich at The Slaughterhouse, and their courtship resulted in marriage, and then me. "
        },
        {
            "heading": 3,
            "text": "Full circle moments "
        },
        {
            "text": "All these years later, I’ve worked my way back to Liverpool and the place where my story began. Being able to do my job outside of London is a huge plus. Home called, and after a nomadic existence I am grateful that I can pursue my career here, closer to family and the sea.   "
        },
        {
            "text": "I never imagined when I joined HMRC that I’d work in a place whose history is so entwined with mine. My parents’ experience of India Buildings was of a buzzing, vibrant workplace, complete with lift attendants and a canteen and both they and I love the fact that it has been sensitively restored and is thriving once more. "
        }
    ]
}