{
    "url": "https://forestrycommission.blog.gov.uk/2023/10/03/the-uk-forestry-standard-review/",
    "title": "The UK Forestry Standard Review",
    "authors": [
        "Ian Tubby"
    ],
    "categories": [
        "Woodland management"
    ],
    "pub_date": "2023-10-03T10:25:45+01:00",
    "content": [
        {
            "text": "I’m pleased to announce that today (3 October 2023) the 5th edition of the UK Forestry Standard (UKFS) has been published. The UKFS is the standard for sustainable forestry practice in England, Scotland, Wales and Northern Ireland and its content underpins forest policy in all four countries. It provides a framework for the delivery of sustainable forest management in the UK."
        },
        {
            "text": "The UKFS was first published in 1998 and has been regularly reviewed and updated with the most recent version published in 2017. All four UK nations have agreed to maintain a UK Forestry Standard and a commitment to review every five years. The latest review project that began in February 2021 has now finished with the publication of this 5th edition."
        },
        {
            "text": "The aim of the review was to ensure the UKFS remains up to date, balanced in terms of the social, economic and environmental principles of sustainable forest management (Figure 1), and applicable across the UK. It was overseen by a Project Board made up of government representatives from the four administrations and was co-ordinated by Scottish Forestry. The final content of the new edition was co-produced by the four administrations."
        },
        {
            "text": "Stakeholder engagement was a key part of the review process and delivered through a UKFS Stakeholder Reference Group and two stakeholder consultations, the first over summer 2021 and the second in autumn 2022. Consultation responses and analysis of the consultation by an independent consultant are available."
        },
        {
            "text": "Overall, there was agreement amongst respondents to the first consultation that the review should focus on improving and strengthening content in themes including:"
        },
        {
            "heading": 2,
            "text": "What are the main changes?"
        },
        {
            "text": "Reflecting the themes identified in the initial consultation a number of key changes have been made."
        },
        {
            "text": "Where necessary, good practice requirements have been amended or added to encourage more direct action to ensure forests remain, healthy, vibrant habitats providing timber and a range of environmental benefits. For example, under the new standard, managers are required to plan and implement biosecurity measures across land they manage to reduce the risk of introducing or spreading pests and diseases."
        },
        {
            "text": "The new standard will also require foresters to use deer management plans more widely to reduce browsing pressure and enable the use of natural regeneration in more woodlands. Other requirements are designed to protect water quality during harvesting operations."
        },
        {
            "text": "Safeguarding tree health, and hence long-term carbon sequestration and timber supply, and delivery of wider ecosystem services is a priority across the UK. Diseases including Phytophthora ramorum and Dothistroma needle blight have shown that forests reliant on a single species to produce timber and generate income are particularly vulnerable."
        },
        {
            "text": "These diseases have caused disruption to both forest owners and to local supply chains. Forestry business have been dealing with these impacts for around 15 years. At a national level it will take several decades to complete the restructuring of forests where trees have reduced annual increment, or have died or been felled prematurely because of these diseases."
        },
        {
            "text": "The widespread damage caused by Ips typographus across Europe demonstrates the impact that combinations of tree pests and climate change are having on economically important tree species such as Norway Spruce. This beetle, native to large parts of Europe but not the UK, has been present in England since at least 2018. Climate change means that the threat this beetle poses to all spruce species, including Norway and Sitka, will increase over the next few decades."
        },
        {
            "text": "Recognising these challenges in 2022, the Forest and Climate Change Partnership (FCCP) including Confor, Tilhill, Woodland Trust, Royal Forestry Society and Institute of Chartered Foresters signed the Forestry and Climate Change Adaptation Accord. This set out principals of adaption, including ensuring ‘diversity of species, genetics, age and stand structure’."
        },
        {
            "text": "The accord stated that urgent action is necessary to improve the resilience and adaptation of our trees, woods, and forests to climate change. Given the long lifecycle of trees, and the long-term practice of silviculture, changes to many common forest management practices need to be made without delay."
        },
        {
            "text": "After much deliberation and consideration of evidence of the prevailing long-term risks faced by forestry at a UK level, the UKFS review project board agreed that the maximum proportion of a single species specified should be reduced from 75% to 65%."
        },
        {
            "text": "Proposals for a larger reduction were rejected given the potential short term negative impact that this could have on some woodland owners in some parts of the UK ."
        },
        {
            "text": "The project board agreed that within UKFS, this matter should be strengthened from a ‘guideline’ to a ‘requirement’ of UKFS compliance. The minimum proportion of each Forest Management Unit (FMU) that should be planted with native broadleaf trees or shrubs remains unchanged at 5%. No change was made to the 10% minimum that should be managed as open ground or where biodiversity is the primary management objective. No change was made to the overall proportion of an FMU that could be managed for timber production (85%)."
        },
        {
            "text": "Many foresters are already taking steps to diversify species and age structures in woodlands that go above and beyond the requirements set out in UKFS. This approach will help increase economic and environmental resilience in the long term."
        },
        {
            "text": "We will continue to work with nurseries and foresters to improve the supply of a wider range of timber producing species that will help bolster supplies well in to the future."
        },
        {
            "heading": 2,
            "text": "When will these changes be introduced?"
        },
        {
            "text": "Following publication of the new edition, a transition period will be put in place until the 1 October 2024, after which the new 5th edition must be followed. This transition period provides time to complete existing forestry plans and proposals, and for users to familiarise themselves with the updated content of the new Standard. Updated Good Forestry Practice Requirements will be applied to existing forest when they are renewed."
        },
        {
            "text": "The existing 4th edition, published in 2017, will remain in force until the end of the transition period."
        }
    ]
}