{
    "url": "https://civilservicelocal.blog.gov.uk/2021/09/07/an-introduction-to-parliament/",
    "title": "An introduction to Parliament",
    "authors": [
        "Heidi Stephens"
    ],
    "categories": [
        "A National Spotlight",
        "Cymru Wales",
        "East, South East & London",
        "Midlands",
        "North East, Yorkshire and the Humber",
        "North West England",
        "Northern Ireland",
        "Scotland",
        "South West England"
    ],
    "pub_date": "2021-09-07T08:35:55+00:00",
    "content": [
        {
            "text": "We are pleased to bring you two dates for Introduction to Parliament courses, being delivered by the Parliamentary Capability Team in Cabinet Office."
        },
        {
            "text": "Civil servants at all grades and from any location can attend. These sessions are particularly useful for those new to the Civil Service or new to learning about Parliament. Even if you don’t currently work with Parliament, it still affects your work regardless of your role, and attending the workshops will help you contribute to the Civil Service behaviours of ‘seeing the big picture’ and ‘developing self and others.’  Most attendees so far have been from the London area and we'd really like to attract some interest from colleagues across the UK at all grades."
        },
        {
            "text": "The course is made up of two parts:"
        },
        {
            "heading": 4,
            "text": "Parliamentary Desk Aids"
        },
        {
            "text": "The team also have desk aids, which are designed to give you useful and practical information while you work. They provide information on how to respond to specific parliamentary processes, including documents and information you need to produce, the people you may need to speak to, and any deadlines or timescales to be aware of."
        },
        {
            "text": "Desk aids are currently available from the Civil Service Learning website on the following topics:"
        },
        {
            "text": "● parliamentary questions (PQs)\n● ministerial statements\n● debates\n● select committees\n● toolkit for bill teams\n● secondary legislation\n● writing explanatory memorandums\n● useful links for Parliamentary work"
        },
        {
            "text": "If you have any questions please email the Parliamentary Capability Team at parliamentarycapability@cabinetoffice.gov.uk"
        }
    ]
}