{
    "url": "https://rpc.blog.gov.uk/2021/09/07/civil-society-organisations-and-the-better-regulation-framework/",
    "title": "Civil Society Organisations and the Better Regulation Framework",
    "authors": [
        "Laura Cox"
    ],
    "categories": [
        "Better regulation",
        "Independent scrutiny"
    ],
    "pub_date": "2021-09-07T11:24:22+01:00",
    "content": [
        {
            "text": "The Better Regulation Framework (BRF) covers both businesses and civil society organisations (CSOs); however, the current focus has very much been on regulations as they apply to businesses. Indeed, the recent government consultation on the BRF does not even mention CSOs."
        },
        {
            "text": "Like businesses, new regulations can have significant impacts on CSOs. But CSOs often experience impacts that differ in nature or scale from those experienced by businesses. Developing a more targeted and nuanced approach to identifying the costs and benefits of new regulations to CSOs could help ensure that they don’t face disproportionate burdens from new regulations, and thereby better support them to grow and thrive."
        },
        {
            "heading": 2,
            "text": "CSOs’ role in UK society"
        },
        {
            "text": "CSOs encompass a broad range of organisations which include: large international charities, trade unions, NGOs, national and local charities, community, social and recreational clubs, online networks, and faith groups. They are formed to serve many different purposes, but generally their purposes are non-profit making and often, but not always, they focus on achieving charitable aims or societal goods."
        },
        {
            "text": "CSOs often fill in the ‘gaps’ where business or government lack the impetus or resources to support individuals, groups and good causes. CSOs play a significant role in our economy - the UK has over 166,000 voluntary organisations and the sector employs approximately 910,000 people, although many more work on a voluntary basis with over 2 billion hours spent volunteering each year – equivalent to the combined employment of the manufacturing, construction and real estate sectors. The voluntary sector contributed £18.2 billion to the economy in 2017/18, representing about 0.9% of total GDP, but this ignores the social value created – the value placed on charity by its direct recipients and also the indirect value to others in the community."
        },
        {
            "text": "Covid has highlighted the critical role CSOs play in our society, and their vulnerabilities in times of economic stress. During the pandemic, the need for some CSOs’ services, such as charities providing foodbanks and shelter have skyrocketed. However, the difficult economic environment and Covid regulations hit some CSOs very hard, resulting in decreasing donations, loss of employees and volunteers, and severely restricted activities."
        },
        {
            "heading": 2,
            "text": "It’s not all about business"
        },
        {
            "text": "The current BRF focuses almost solely on businesses, yet government departments and regulators are expected to use it to analyse impacts on CSOs as well. In our experience, this often results in under-identification and incomplete analysis of the impact new regulations may have on CSOs."
        },
        {
            "text": "CSOs vary more widely in their structures than businesses, so it isn’t a straightforward process to determine to what extent they are impacted by new regulation. The current BRF doesn’t differentiate between businesses and CSOs – the implied assumption is that CSOs are expected to experience the same impacts from new regulation as businesses. Unfortunately, the lack of data and appropriate guidance about CSOs means there is a lack of focus on how CSOs may be differently impacted by regulatory proposals. The current BRF doesn’t give policymakers the right tools to analyse CSO impacts and can result in this sector being overlooked or impacts on CSOs being underestimated."
        },
        {
            "heading": 2,
            "text": "Possible ways forward"
        },
        {
            "text": "If the impacts on CSOs aren’t identified and quantified, there is a risk that CSOs could face disproportionate and unintended impacts from regulation. One option would be to enhance the current BRF, by expressly identifying areas where CSOs may experience impacts differently from businesses in the impact assessment (IA) template.  Another more radical possibility would be to require a Civil Society Organisation Assessment (CSOA), along the lines of the Small and Micro Business Assessment (SaMBA), which brought a much greater focus on ensuring new regulation worked for SMBs."
        },
        {
            "text": "Providing more guidance for policy makers about how to analyse impacts on CSOs, including appropriate use of methodologies and metrics would also help. And improving collection of and access to underlying data about the number, size, and activities of CSOs would better enable departments and regulators to produce better IAs. This would aid ministers and parliamentarians in deciding the types and levels of regulation appropriate for CSOs and avoid CSOs facing unintended consequences from more general regulations."
        },
        {
            "heading": 2,
            "text": "Why we are raising this issue now"
        },
        {
            "text": "The BRF Consultation represents a key opportunity for interested stakeholders to share their views about how the current BRF is working for CSOs, and ways in which government can improve IAs to better ensure that we are supporting them in fulfilling their critical role in our society. We encourage you to share your views on these important issues. The deadline for responses is 1 October 2021."
        }
    ]
}