{
    "url": "https://deframedia.blog.gov.uk/2021/09/07/international-day-of-clean-air-for-blue-skies/",
    "title": "International Day of Clean Air for Blue Skies",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2021-09-07T14:58:53+01:00",
    "content": [
        {
            "text": "Today marks the second International Day of Clean Air for Blue Skies – a global awareness-raising day led by the United Nations with a call to action to collectively align efforts and facilitate actions to improve air quality."
        },
        {
            "text": "This year’s event focuses on the links between healthy air and a healthy planet, and aims to prioritise the need for healthy air for all while encompassing other critical global issues such as climate change and human and planetary health."
        },
        {
            "text": "Air pollution has been widely classified as the leading environmental cause of death and disability worldwide, which is why we are taking a leading role in tackling air quality issues globally while also taking urgent action to curb the impact dirty air has on communities across England."
        },
        {
            "text": "The UK and Sweden will co-chair the new Forum on International Cooperation on Air Pollution from 2022, which sits within the UN Convention of Long-range Transboundary Air Pollution (CLRTAP). This taskforce will facilitate mutual learning and collaboration on air pollution, working towards raising global public awareness of the health and environmental impacts of air pollution. It will expand the platform over which the UK can share understanding, facilitate collaboration on best practice and promote an evidence-based approach to air quality management."
        },
        {
            "text": "As a founding party of the CLRTAP the UK has played a leading role in supporting international programmes to drive forward scientific understanding of emissions and their impacts, and has engaged constructively to agree ambitious standards and emission reduction commitments. The Convention has played an instrumental role in reducing harmful pollutants in both Europe and North America, with sulphur dioxide reducing 70% in Europe between 1990 and 2006 and nitrogen oxide falling 35%."
        },
        {
            "text": "The UK is also involved in a number of other taskforces within the Convention, including chairing a group providing advice on emission inventories and on the impacts of air pollution on vegetation. Through this we are doing a range of capacity building activities such as developing a smartphone app to allow users globally to submit records of visible impacts of ozone pollution on crops for food production."
        },
        {
            "text": "We are also taking considerable action at a domestic level. There has been a significant improvement in our national air quality in recent decades; since 2010 levels of fine particulate matter (PM2.5) – particles or liquid droplets in the air which present the greatest risk to human health – have reduced by 11% while emissions of nitrogen oxides have fallen by 32% and are at their lowest level since records began."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}