{
    "url": "https://forestrycommission.blog.gov.uk/2021/09/07/sharing-experiences-for-our-future-forests-and-woodlands/",
    "title": "Sharing experiences for our future forests and woodlands",
    "authors": [
        "Christopher Williams"
    ],
    "categories": [
        "Climate change and resilience"
    ],
    "pub_date": "2021-09-07T08:20:57+01:00",
    "content": [
        {
            "text": "We know that forestry, woodland management and planning can and must play a pivotal role in helping us deal with the climate crisis. Healthy, productive woods are a key part of the escape plan. However, our forests and woods face significant challenges now, partly because of our changing climate and new pests and diseases."
        },
        {
            "text": "The release of 10 case studies in the free Managing for Resilience report we published in July in partnership with the Forestry Commission is very timely, falling just after the launch of the England Tree Action Plan and ahead of COP26, a global event which will focus minds on our changing climate."
        },
        {
            "text": "It shares the experiences of 10 forestry and woodland managers across England responding to the challenge of building greater resilience into their woods. They are doing so through the use of diverse species restock, adapting to different management methods or/and new planting. Each site faces different ecological, environmental or economic challenges. It makes for fascinating reading!"
        },
        {
            "text": "For our woodland to flourish in the future we need an accessible flow of information, a sharing of what species or management systems have worked, and which have failed. I sincerely hope the case studies will prove to be useful to others facing the same or similar challenges. Alongside the case studies, it is worth highlighting the excellent associated Resources for Managing Woodland for Resilience document. This signposts to information on aspects of forest management: from site assessment and species choice to silviculture systems and ecosystem integrity."
        },
        {
            "text": "It is just six months since I started in my role, and as part of my own induction programme, I have been reading up on the long history of the Royal Forestry Society (RFS). Right from the beginning, in Victorian times, the Society has been about sharing knowledge, ideas and problem solving and that is exactly what this new report is about too. The first RFS members would perhaps be bemused with some aspects of modern forestry and woodland management. However, I’m sure they would also identify with this study and the long-term thinking and planning still required by forestry and woodland managers today."
        },
        {
            "text": "It is only by seeking to learn more, and by sharing what we know with others, that we can advance our understanding and hope to fare better. If we act now we have the best chance of making our woodlands and forests more future-proof and resilient by the end of this century."
        }
    ]
}