{
    "url": "https://civilservice.blog.gov.uk/2021/09/07/the-art-of-working-smarter-makes-you-happier/",
    "title": "The Art of Working Smarter Makes You Happier",
    "authors": [
        "Fiona James, Deputy Director of Digital, Crown Prosecution Service"
    ],
    "categories": [
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Ambitious Civil Service"
    ],
    "pub_date": "2021-09-07T11:16:50+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Smarter working is a hot topic. Now Fiona James, the Civil Service digital wellbeing champion has teamed up with the Civil Service HR team to publish a smarter working hub,  to help civil servants find a better work/life balance. "
        },
        {
            "text": "So, which is easier? Pushing a cube or pushing a ball? I know which one I’d want to do. The last 18 months have felt like we have all been pushing a cube because of the challenges of balancing work with life. Working in a smarter, more agile way can help us focus on making the right decisions about when, where and how we work. Staying connected and having that good work life balance is so important for your health and wellbeing."
        },
        {
            "text": "I’ve worked in digital, data and technology over the last four years, making public services better.  I’m passionate about the enabling power of technology, but as I’ve got closer to design and people, I’ve become increasingly concerned about the social harm it can do to young people, and how distracting and exhausting it can be. "
        },
        {
            "text": "Technology will develop faster than we can keep pace, but how, what, and when we consume it, is entirely in our control. For the last two years, I’ve chaired a cross government digital wellbeing network - it’s a group that has come together to champion digital wellbeing and share good practice. "
        },
        {
            "text": "A group of unsung heroes from nearly every department who believed this subject was so important, they voluntarily gave their time and effort to help support peers and staff with their wellbeing. Before the group started, digital wellbeing – with Civil Servants as users – was an unrecognised strand of wellbeing.  "
        },
        {
            "text": "Techy tools and tips"
        },
        {
            "text": "As we’ve moved to a greater reliance on technology, the need for the Civil Service to provide more tools and support in this area has increased rapidly.  The network’s done some sterling work to listen to how Civil Servants are responding to the increasing number of different applications, platforms and channels they use to communicate. "
        },
        {
            "text": "It’s created a forum for sharing best practice toolkits and put staff in touch with tailored support offers from digital wellbeing experts.  This tailored support has really helped teams to find new ways to connect with purpose and operate around activities. It’s also enabled staff to put in place intentional digital habits, which allow them to spend more time on real ‘human’ connection. "
        },
        {
            "text": "One of the great things the network has been able to do is collaborate with colleagues in Civil Service HR who have developed the Smarter Working for Your Wellbeing hub. "
        },
        {
            "text": "The hub has been developed with the Charity for Civil Servants, is hosted on the Charity site and has now been live since 7th July. Up until now there hasn’t been a single hub for Civil Servants to find out vital advice and guidance on digital wellbeing. "
        },
        {
            "text": "Wealth of information"
        },
        {
            "text": "The hub provides a range of information from how to schedule emails, to beating meeting fatigue, along with articles, tools, advice and tips on wellbeing and work life balance and has help and resources on hybrid working.  It is an evolving resource with new material added regularly. If there’s anything more, less or different you’d like to see, please let me know.  "
        },
        {
            "text": "Communicating is an important part of our wellbeing and these resources can help you to balance your work and life in a way that works for you and for your teams. Working smarter is not about working harder it's about using your time effectively, so you have the chance to stay connected in deep and meaningful ways and have a great work life balance. Push a ball not a cube.  "
        }
    ]
}