{
    "url": "https://dataingovernment.blog.gov.uk/2021/09/07/what-skills-do-you-need-for-working-in-data-ethics/",
    "title": "What skills do you need for working in data ethics?",
    "authors": [
        "Natalia Domagala, Head of Data Ethics - CDDO"
    ],
    "categories": [
        "Data Ethics",
        "Data literacy",
        "People and Skills",
        "Uncategorized"
    ],
    "pub_date": "2021-09-07T14:26:41+01:00",
    "content": [
        {
            "text": "Data ethics is a cross-cutting discipline that assesses the wider societal impact of technology, producing recommendations for technologists and data professionals. It involves thinking about fairness, accountability, the law, moral dilemmas, and the risks involved in creating technology and data products and policies. "
        },
        {
            "text": "Due to the complex demands of technology and data innovation we have identified a need for a Data Ethicist role in the public sector, responsible for providing research and expertise, and to act as an agent for change. "
        },
        {
            "text": "Having a Data Ethicist in teams will enable Data Engineers and Data Scientists to innovate responsibly and respond to the ongoing demand for implementing data ethics best practice. This critical role has been extremely successful in recent years in the private sector, and has been instrumental in the development of high-risk data and artificial intelligence (AI) products."
        },
        {
            "heading": 2,
            "text": "Data Ethicist Role for the Digital, Data and Technology Capability Framework"
        },
        {
            "text": "The Digital, Data and Technology (DDaT) Capability Framework describes job roles in the DDaT profession and provides details of the skills needed to work at each role level. The Capability Framework can be used to learn different roles in government, understand what skills are needed by professionals in particular jobs, identify skills that need development to help career progression, assess skills in preparation for performance reviews, create effective job adverts, and carry out Human Resources and workforce planning."
        },
        {
            "text": "In the National Data Strategy, published in 2020, we emphasised the significance of professionalising data ethics, and committed to supporting civil servants to build capability for ethical data use. Similarly, the consultation response to the strategy stressed that data ethics should be at the heart of government data operations, and indicated the need for improving ethical norms and standards to guide data sharing across government. "
        },
        {
            "text": "Recommendations included improving accountability structures for data ethics tools, and making data ethics a recognised profession in the DDaT Capability Framework for all government teams. In order to develop the Data Ethicist role, we surveyed 50 data and AI ethics professionals from all sectors on what skills are necessary in their job. We then ran a workshop with 25 data ethics practitioners to get a deep dive on what the Data Ethicist role should entail."
        },
        {
            "heading": 2,
            "text": "Data Ethics Skills"
        },
        {
            "text": "Data ethics skills focus on understanding society, the broader social and economic impacts of technologies, and the norms it helps to create and shape. This is distinct from data science, which focuses on specific project delivery aspects and technological capabilities, rather than their social implications."
        },
        {
            "text": "Data ethics cuts across data science, engineering, governance, project management, service design, and other functions, providing a holistic view of the data lifecycle and the risks introduced at each phase. Working in this discipline requires a unique set of skills deriving from social science or humanities to apply societal and ethical norms to data and tech projects."
        },
        {
            "text": "The role of a Data Ethicist will involve:"
        },
        {
            "text": "The DDaT Capability skills required to be a data ethicist are: "
        },
        {
            "text": "As with all content on the DDaT Capability Framework, this role is subject to iteration and improvement. The DDaT Capability Framework exists to support attraction, recruitment and retention of people and skills across Government.  "
        }
    ]
}