{
    "url": "https://companieshouse.blog.gov.uk/2021/09/07/when-and-how-to-file-your-annual-accounts-with-companies-house/",
    "title": "When and how to file your annual accounts with Companies House",
    "authors": [
        "Gary Townley - Senior communications manager"
    ],
    "categories": [
        "Company guidance",
        "Filing advice"
    ],
    "pub_date": "2021-09-07T11:07:41+01:00",
    "content": [
        {
            "text": "A company must file accounts every year. Company accounts are documents prepared at the end of a financial year which show how a company has performed over the accounting period."
        },
        {
            "text": "For any enquiries about HMRC accounts or tax related matters, you’ll need to contact HMRC directly."
        },
        {
            "heading": 2,
            "text": "What accounts you need to file"
        },
        {
            "text": "A set of accounts will usually consist of:"
        },
        {
            "text": "In some circumstances an auditor’s report may be necessary, but companies that qualify as small or micro-entities can take advantage of audit exemption."
        },
        {
            "text": "The profit and loss account shows the company’s sales, running costs and the profit or loss it has made over the last year."
        },
        {
            "text": "The balance sheet shows the value of everything the company owns, owes and is owed."
        },
        {
            "text": "The notes provide supporting information and help users of accounting information understand the current financial position of the company."
        },
        {
            "text": "The directors’ report provides information on:"
        },
        {
            "heading": 3,
            "text": "Small companies"
        },
        {
            "text": "Small companies can choose to file abridged accounts. These are a simplified version of your accounts and do not need a directors’ report or a profit and loss account."
        },
        {
            "text": "Your company will be ‘small’ if it has any 2 of the following:"
        },
        {
            "heading": 3,
            "text": "Micro-entities"
        },
        {
            "text": "Companies with even smaller turnovers are classed as micro-entities. Your company can file micro-entity accounts if it has any 2 of the following:"
        },
        {
            "heading": 3,
            "text": "Dormant companies"
        },
        {
            "text": "A dormant company must still file annual accounts for Companies House. There are different requirements for Corporation Tax and Company Tax Returns with HMRC."
        },
        {
            "text": "Your company is called ‘dormant’ by Companies House if it’s had no ‘significant’ transactions in the financial year that you’d normally report. Significant transactions do not include:"
        },
        {
            "text": "Dormant companies that qualify as ‘small’ can take advantage of audit exemption and do not need to be audited."
        },
        {
            "heading": 2,
            "text": "When you need to file your accounts"
        },
        {
            "text": "Every company will have an accounting reference date. The deadline for filing your accounts will be calculated from this date."
        },
        {
            "text": "For new companies, it will be the anniversary of the last day in the month the company was incorporated."
        },
        {
            "text": "For existing companies, it will be the anniversary of the day after the previous financial year ended. The time allowed for delivering accounts is 9 months from the accounting reference date."
        },
        {
            "text": "If you’re still not sure when your accounts must be filed, you can simply use the Find and update company information service to find your company. The due date for your accounts is shown on the overview screen."
        },
        {
            "text": "By registering for our email reminder service you’ll be notified in good time when your accounts are due."
        },
        {
            "text": "Remember to plan ahead. Make sure you know your company’s deadlines and prepare your accounts in advance. Do not leave it until the last minute."
        },
        {
            "heading": 2,
            "text": "How to file your accounts"
        },
        {
            "text": "The quickest and easiest way to file your accounts is online. Once you have decided on the type of accounts you need to file, you can follow the online instructions or watch our 'How to' videos on YouTube to see how it’s done."
        },
        {
            "text": "To file online you’ll need to:"
        },
        {
            "text": "The online service has built in checks to make sure all the necessary information is entered before you submit. You’ll be emailed automatically when your accounts have been received, and again to tell you whether they have been accepted."
        },
        {
            "heading": 2,
            "text": "Who can file your accounts"
        },
        {
            "text": "If you feel confident, you can file your accounts yourself. There are a range of software products that can help you to prepare and file."
        },
        {
            "text": "Many companies will choose to use a professional such as an accountant to act on their behalf. As well as filing for you, a professional can offer business and financial advice to help you make the right decisions."
        },
        {
            "text": "You should note that even if you use someone to file for you, it’s the responsibility of the directors to make sure the accounts are filed - and filed on time."
        },
        {
            "text": "No matter which option you go for, keeping accurate and organised records throughout the year will help when it’s time to fill in your returns."
        }
    ]
}