{
    "url": "https://defradigital.blog.gov.uk/2022/11/07/leaders-view-why-technology-leaders-need-to-be-more-than-just-visible/",
    "title": "Leader’s view: Why technology leaders need to be more than just visible",
    "authors": [
        "Malcolm McKee, Chief Technology Officer"
    ],
    "categories": [
        "Defra digital",
        "Digital transformation"
    ],
    "pub_date": "2022-11-07T09:15:20+00:00",
    "content": [
        {
            "text": "Malcolm McKee shares his thoughts about visible leadership, the future of CTOs like him, and the benefits of volunteering."
        },
        {
            "text": "As I write this, I’m preparing to head to Barcelona for the Gartner IT Symposium/Xpo™ 2022, an event that explores innovative and transformational opportunities with a global community of experts and peers."
        },
        {
            "text": "I’ll be joining CTOs, Chief Information Officers, and IT leaders from around the world, to discuss the technologies, insights, and trends shaping the future of IT and business, including accelerating digital business, the future of work, data, analytics and artificial intelligence, cybersecurity, executive leadership and more. In fact – not just discussing, but actively thinking about how these relate to Defra’s future."
        },
        {
            "text": "In Defra we are facing most of the same technology challenges as our private sector counterparts. And, like them, we see these as opportunities to harness the power of digital and data to transform what we do. Often, we only compare notes with other government departments, and this is a real opportunity to talk to peers in all industries and compare approaches."
        },
        {
            "heading": 2,
            "text": "Leading is about more than just being visible"
        },
        {
            "text": "Visible leadership is talked about a lot these days, isn’t it? The need for leaders to be seen, as well as being seen to be doing their day job, if that makes sense."
        },
        {
            "text": "When researching for this blog I came across one definition of the term visible leadership which I thought was worth reflecting on – ‘the commitment of senior management to a culture of quality that aligns performance management practices with the organisation's mission, regularly takes account of customer feedback, and enables transparency about performance between leadership and staff’."
        },
        {
            "text": "OK, the definition is a bit wordy, but I think there’s something in there about the importance of the connection between leaders and their people. As a leader myself, is that describing me? Am I committed to those things? Am I transparent? The answer is ‘yes I am’."
        },
        {
            "text": "Let me start with the word “mission”, because that is where I always start when talking about Defra. I joined Defra at least in part because I care about our environment, our forests and rivers, plants and wildlife, and the rural economy."
        },
        {
            "text": "I think everyone in Defra feels that mission and is inspired by it, as leaders we need to authentically talk about our passion for the departments mission in a way that resonates with people. I also believe we need to authentically bring our whole selves to work and should not be afraid to share the personal ups and downs of life and work, because in doing so, we deepen the connection between us, building trust and resilience."
        },
        {
            "text": "This week was planned to be International Leadership Week. I had originally planned to write my blog to align with this week of activities and events that focused on themes of social mobility, wellbeing, and future readiness."
        },
        {
            "text": "Unfortunately, it has been postponed until March 2023. So, instead I will share some thoughts on a report I read recently that was published in The Times entitled ‘The Future CTO’, in which the author reflected on how the role of the Chief Technology Officer is changing, in response to a range of pressures, both internal and external."
        },
        {
            "text": "I certainly know my role has changed a bit since I took on the role of Defra’s CTO in 2019. And it’s probably true to say that the role will continue to evolve, alongside changes in technology and other social, economic, and political factors. The one thing that the report absolutely gets right is the degree to which the role has become more strategic and transformational over time and less focussed on understanding and operating IT services."
        },
        {
            "text": "The report also highlights how we will increasingly rely on partners. In Defra we already have strategic partnerships with a range of suppliers. These partnerships have enabled Defra to access experts and technologies that we can’t develop ourselves, take on huge programmes of delivery, and also to reduce our cost base for operational services."
        },
        {
            "text": "This is a very different model from the “IT outsource” contracts of the past though which were predicated on IT being ubiquitous commodity services of little strategic value, that could be procured at lowest cost. That model (popular 20 years ago) was quite wrong, and it is now accepted that digital, data and technology is our most potent strategic enabler so we choose partners that show distinctive capability that we can use to drive change."
        },
        {
            "text": "One of the things that most caught my eye in the report though is the notion that a CTO must have a technical background. Well, as a lifelong technologist who started programming at 12, I’d have to say that a technical background doesn’t hurt. But some of the people I most value in our organisation, and in our industry, have come from a variety of other backgrounds (e.g. ecologist, medical doctor, chemist) and I think that variety and diversity of thought is good for us. In fact, as the role continues to become more strategic and transformational, there is really no need to gatekeep it, and our future CTOs may come from almost any career path."
        },
        {
            "heading": 2,
            "text": "Getting away from it all"
        },
        {
            "text": "In my spare time I’m a volunteer Scout Leader. Research by The Scout Association has shown that volunteering is good for you, with measurable physical and mental health benefits. My volunteering in the scouts is incredibly important to me because it gives me a complete break from the pressures of work and whether it is teaching outdoors skills during an evening or leading camps and expeditions, I come back physically tired and mentally refreshed."
        },
        {
            "text": "As things get increasingly busy at work, and the general ‘mood music’ of things becomes more frenetic and uncertain, we need to remind ourselves of the importance of unplugging, walking away from the laptop, and investing our energies in those things we enjoy and benefit from."
        },
        {
            "text": "As a matter of fact, I paused typing halfway through that last sentence to check the latest on the BBC news app, and even that reminded me that nothing stops just because we’re not always on top of it 100% of the time and in 100% of the detail."
        },
        {
            "text": "I guess this is a roundabout way of saying that I and my peers across Defra recognise how busy things are right now. It’s not likely to change any time soon and I know that each and every one of my team will continue to focus on providing the best service and support they can throughout these challenging times."
        },
        {
            "text": "So, we need to look out for ourselves and each other. Making sure that we’re taking time away and checking in on friends and colleagues to make sure they’re doing the same."
        }
    ]
}