{
    "url": "https://educationhub.blog.gov.uk/2022/11/07/teachers-pensions-what-you-need-to-know/",
    "title": "Teachers’ Pensions – what you need to know",
    "authors": [
        "Media Officer"
    ],
    "categories": [
        "Teacher pay",
        "teachers"
    ],
    "pub_date": "2022-11-07T14:44:36+00:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "Teaching is an attractive profession for a range of reasons; as well as it being interesting, no two days being the same and it provides the chance to shape young people’s lives. Teacher’s pensions are also among the best and safest available."
        },
        {
            "text": "Here’s what you need to know."
        },
        {
            "heading": 3,
            "text": "What are the current arrangements for teacher’s pensions? "
        },
        {
            "text": "The Teachers’ Pension Scheme is a ‘defined benefits’ pension scheme. That means it offers teachers a guaranteed income in retirement as opposed to a ‘defined contribution’ scheme, where income is based on the performance of the pension fund."
        },
        {
            "text": "Teachers in England and Wales pay into the scheme direct from their salary each month and it is then topped up by their employer. Teachers based in Scotland have separate pension agreements."
        },
        {
            "text": "In return for the money, they put in, teachers receive an index-linked (this means it increases in line with the cost of living) government-backed annual pension for retirement. This is based on their career average earnings."
        },
        {
            "heading": 3,
            "text": "Is this the case for all teachers?"
        },
        {
            "text": "In 2015, the government introduced reforms to public service pension schemes, including the Teachers’ Pension Scheme, which meant some members receiving Transitional Protection, remained in the final salary scheme, while others entered the career average scheme."
        },
        {
            "text": "These changes have since been deemed discriminatory on age grounds and the legislation to correct this is being rolled out in two stages."
        },
        {
            "text": "Part one of the legislation was the closure of the final salary scheme from 1 April 2022, with all active members now building up their pension in the career average scheme."
        },
        {
            "text": "Part two will give eligible members the option to choose between their final salary and career average pension scheme benefits between 1 April 2015 and 31 March 22 (the remedy period)."
        },
        {
            "heading": 3,
            "text": "How is the career average pension worked out? "
        },
        {
            "text": "A member will gain a part of their pension for every year they contribute to the Teachers’ Pension Scheme. This means that a teacher will add 1/57th to their ‘pot’, depending on the amount of their earnings and each year that’s increased in line with indexation. An example of how a career average pension can grow over five years can be seen below:"
        },
        {
            "heading": 3,
            "text": "How much do teachers and employers contribute?"
        },
        {
            "text": "A teacher’s employer will deduct pension contributions from their pay before deducting tax, thereby giving tax relief on the pension contribution. Employers contribute the equivalent of 23.68% of a teacher’s pay towards the cost."
        },
        {
            "text": "Contribution rates are determined by a teacher’s salary."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}