{
    "url": "https://ruralpayments.blog.gov.uk/2022/11/07/the-2023-round-of-countryside-stewardship-facilitation-fund-opens-today/",
    "title": "The 2023 round of Countryside Stewardship Facilitation Fund opens today",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Countryside Stewardship"
    ],
    "pub_date": "2022-11-07T13:33:56+00:00",
    "content": [
        {
            "text": "We know that farmers across the country are having to make decisions on the future of their farms and businesses, with many factors and opportunities to consider in a challenging climate."
        },
        {
            "text": "We also know a sense of community and shared goals is important in a thriving rural economy, so we’re pleased that a further round of the popular Countryside Stewardship Facilitation Fund has opened today for applications."
        },
        {
            "text": "Working together with a facilitator, the fund helps groups of farmers and landowners in England to coordinate action, join agri-environment schemes and share knowledge, to achieve greater environmental benefits than they would working alone."
        },
        {
            "text": "Building on the successes of previous years, this year’s round of the scheme includes support for environmental priorities such as:"
        },
        {
            "heading": 2,
            "text": "How the fund works"
        },
        {
            "text": "Groups of farmers and landowners need to choose a facilitator, who will work with them for the duration of a 3 year agreement. Funding is available for facilitators who will organise activities and bring support, advice and training to the group. These activities help the group achieve their goals to improve their local environment."
        },
        {
            "text": "Groups could look at things like restoring habitats for wildlife and improving biodiversity, creating woodland, improving air and water quality, or restoring historic environments. In previous rounds of the scheme we’ve seen groups running demonstration days in timber extraction, exploring measures to reduce flooding, learning about ground nesting birds and improving confidence in conservation farming, to name a few. The great thing about the fund is that projects will be tailored to the character of the local area so there is potential to make a real difference."
        },
        {
            "text": "“The Countryside Stewardship Facilitation Fund has provided a great mechanism to share knowledge with groups of farmers in the region,” says Georgina Wallis, a Farm and Environment Consultant with CLM."
        },
        {
            "text": "Georgina is Facilitator to the ‘1066 Farmers’ group based in the High Weald AONB – one of four groups in the South East of England that CLM staff facilitate, working with farmers and land managers and covering over 36,000 hectares of land."
        },
        {
            "text": "The groups are located in nationally important areas where landscape-scale delivery is required. Members’ land is located in The South Downs National Park, High Weald AONB and across multiple SSSIs, Scheduled Monuments and Priority Habitats."
        },
        {
            "text": "“The Countryside Stewardship Facilitation Fund fits with our ethos of helping land managers to protect and grow their income and assets, improve their quality of life and create sustainable legacies,” says Georgina."
        },
        {
            "text": "“Each landscape has individual requirements, and the Facilitation Fund provides funding for us to deliver projects that are bespoke for each objective. Some of the projects delivered include wildflower and grassland enhancement, mob grazing and farmland management, farmland bird identification training, ‘meet the farmer’ public engagement videos, soil analysis and funding updates. All of this is communicated in regular newsletter updates to members."
        },
        {
            "text": "“The groups are each led by a steering group who guide the project delivery, ensuring that topics are useful to those farming in the area."
        },
        {
            "text": "“By working closely with members, we can deliver meaningful training events which are thought-provoking and create a real change in land management."
        },
        {
            "text": "“Farming can be a lonely and, at times, thankless task and the group also offers an important social element, with farmers getting together monthly, giving them a chance to catch up on how things are going and talk to like-minded people. There have even been new grazing arrangements organised on the back of the group, which is great to see.”"
        },
        {
            "text": "Since the fund launched in 2015, 180 groups with over 4,000 members have taken up the opportunity to work together to foster a strong sense of community with members helping each other out, sharing information and knowledge such as good farming and environmental practices, and developing greater trust."
        },
        {
            "text": "It matters to us that farmers who are passionate about making a difference have the support through our schemes but also from each other. We know that mental health in rural communities is a real concern and we’ve had feedback from farmers that being part of a facilitation groups helped them feel less isolated."
        },
        {
            "text": "You can read more about the benefits of the scheme in this evaluation report published by Natural England, and for a closer view of what being part of a facilitation group can mean at a farm level, you can read about this farm visit to Challacombe Farm on Dartmoor."
        },
        {
            "heading": 2,
            "text": "How to apply"
        },
        {
            "text": "The facilitator for the group needs to coordinate the application on behalf of the group. All the information you need including the application form is on the Facilitation Fund page on GOV.UK."
        },
        {
            "text": "To ensure we are supporting the best possible projects, all applications for the fund are competitive. This means all applications are scored, and the highest-scoring ones will be offered funding, with agreements starting on 1 June 2023 and running for 3 years."
        },
        {
            "text": "To give you the best chance of a successful application, you should make sure that the goals stated in your application align with the Countryside Stewardship priorities for your local area."
        },
        {
            "text": "The deadline to apply for this Facilitation Fund round is midnight on 25 January 2023."
        },
        {
            "text": "The Facilitation Fund is a valuable part of the Countryside Stewardship offer and we’re proud to be involved in making this available for even more farmers to benefit."
        }
    ]
}