{
    "url": "https://space.blog.gov.uk/2022/11/07/the-night-sky-in-november-3/",
    "title": "The night sky in November",
    "authors": [
        "Derek Smale"
    ],
    "categories": [
        "Astronomy"
    ],
    "pub_date": "2022-11-07T12:15:31+00:00",
    "content": [
        {
            "text": "The night skies of November are a great opportunity to see Mars, Jupiter and Saturn, two meteor showers, and a host of bright stars."
        },
        {
            "text": "Looking east after dark, red-hued Mars (centre in the image above) is the brightest object in this patch of sky, which also features the blue-white stars of the Pleiades star cluster (top right), and Capella, (top centre) in the constellation of Auriga. Capella is a system of two stars - one nine times larger than our sun and the other more than twelve times as large."
        },
        {
            "text": "The two stars are around forty light years away from us, and spin around each other in an orbit like Venus’ orbit around our sun."
        },
        {
            "text": "Auriga is a fascinating constellation.  Those with darker skies away from towns and streetlights may be able to see that it sits in the pale band of our Milky Way galaxy, so if you have binoculars or a telescope, scan this patch of sky to reveal a beautiful swathe of stars and several dense star clusters."
        },
        {
            "text": "This part of the Milky Way is the outer arm of our galaxy, while looking west after dark towards the setting summer constellations is looking in towards the brighter, more densely star-packed centre of our galaxy."
        },
        {
            "text": "Looking south-east, Jupiter is currently the brightest object in our night skies, while Venus travels around the opposite side of the sun to Earth."
        },
        {
            "text": "Saturn is almost directly south as darkness falls, considerably fainter than in recent months as the distance between it and Earth grows again, but still outshining the stars around it."
        },
        {
            "text": "The full Moon will fall on 8 November this month.  On the evening of 11 November the 80% illuminated Moon will have a close encounter with Mars, and on 28 November, the 30% illuminated moon will sit (from our perspective on Earth) close to Saturn."
        },
        {
            "text": "Some around the world will get to see a lunar eclipse this month, but sadly it won’t be visible from the UK."
        },
        {
            "text": "Meteor showers"
        },
        {
            "text": "There are two meteor showers to look forward to in November."
        },
        {
            "text": "The Taurids meteor shower is expected to peak around 12-13 November, as Earth passes through the fragments of rock and ice left behind from Comet Encke, a 5km (3 mile) wide object that orbits the sun every 3 years."
        },
        {
            "text": "The more spread-out fragments of this comet mean this shower only produces a sprinkling of meteors, but their relatively slow speed - 17 miles per second - can make them easier to spot as they blaze across the night sky."
        },
        {
            "text": "The Leonids meteor shower peaks around 17-18 November when the fragments of Comet Tempel-Tuttle enter Earth’s atmosphere at over 70km (45 miles) per second."
        },
        {
            "text": "The Leonids is known to ‘storm’ every 33 years as Comet Tempel-Tuttle returns to the inner solar system, leaving a fresh trail of debris in its wake; the 1999-2001 Leonids showers produced thousands of meteors every hour at its peak!"
        },
        {
            "text": "Unfortunately, the next ‘storm’ is not due until the early 2030s, though meteor showers can put on a surprising display at any time, so it’s always worth taking a look if the weather is clear during their peak."
        },
        {
            "text": "Did you know: Other planets encounter meteor showers too. Observations from NASA’s ‘Messenger’ spacecraft that orbited Mercury from 2011 to 2015, suggest that Comet Encke showers Mercury with meteors too. However, Mercury does not have a protective atmosphere like Earth does, so rather than burn up in a streak across the sky, the comet fragments would pepper the surface creating countless new craterlets each Mercury year - the equivalent of around 88 Earth days."
        },
        {
            "text": " "
        },
        {
            "text": "Space science and exploration"
        },
        {
            "text": "The next couple of months could be a very exciting time for launches!"
        },
        {
            "text": "NASA are looking to launch their Artemis I mission on 14 November.  The launch, which has seen delays due to technical issues, and more recently a hurricane, will send the Orion astronaut crew capsule around the moon, with a safe return expected 25 days after launch. While there are no crew on this flight (apart from Shaun the Sheep), later Artemis missions will return humans to the moon for the first time in over 50 years."
        },
        {
            "text": "The first launch from UK soil is also happening soon, with what is called a ‘horizontal launch’. Virgin Orbit’s modified 747 ‘Cosmic Girl’ will lift off from Spaceport Cornwall in Newquay carrying the rocket up to an altitude of around 10km (6 miles), where it is released.  The rocket engine then ignites, carrying satellites into low Earth orbit."
        },
        {
            "text": "You can find more about the first launch from the UK here."
        }
    ]
}