{
    "url": "https://naturalengland.blog.gov.uk/2024/07/23/bng-lessons-learned-with-local-planning-authorities/",
    "title": "BNG lessons learned with Local Planning Authorities",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Biodiversity",
        "Biodiversity Net Gain",
        "Biodiversity Net Gain – Hints and Tips",
        "Development",
        "Green Infrastructure",
        "Licensing",
        "Mental health and wellbeing",
        "Natural England",
        "Nature Recovery Network"
    ],
    "pub_date": "2024-07-23T09:38:29+01:00",
    "content": [
        {
            "text": "By Ruth Andreyeva, Director of Land, Water and Seas strategy "
        },
        {
            "text": "Biodiversity net gain (BNG) became mandatory in England earlier in 2024, after many years of collaboration across industry and the public sector. We celebrate this milestone wholeheartedly, but we’re not resting on our laurels. We see BNG becoming mandatory as the beginning of the journey, not the end."
        },
        {
            "text": "This world-leading initiative to create and improve natural habitats relies on developers delivering a measurably positive impact (at least 10% ‘net gain’) on biodiversity, compared to what was there before development. It relies on land managers using BNG as a way to fund nature recovery. It relies on many different professionals and enablers supporting both those groups. And fundamentally, it relies on Local Planning Authorities (LPAs)."
        },
        {
            "text": "We’ve been working with LPAs since long before BNG became mandatory. Together with the Planning Advisory Service (PAS)*, we’ve gathered three key BNG lessons for LPAs."
        },
        {
            "text": " "
        },
        {
            "text": "Assessing how best to deliver benefits for nature and local people and communities"
        },
        {
            "text": "BNG provides an opportunity to help restore nature. BNG creates or enhances habitats that enable communities to become more resilient to climate change. BNG creates greener and more attractive places in which to live and work. By increasing the amount of nature around us, BNG also improves people's health and well-being. How can BNG do all of this? By being strategic."
        },
        {
            "text": "Being strategic means assessing how best to deliver benefits for nature that will have maximum impact, first and foremost for wildlife but also for local people and communities. It means tying BNG delivery to emerging Local Nature Recovery Strategies (LNRSs) to maximise its impact. It means enabling landowners to provide the habitats that are locally needed by entering into legal agreements with them, for example a Section 106 agreement."
        },
        {
            "text": "Being strategic also means assessing best use of often finite LPA staffing resource. We recognise the multitudes of pressures facing LPAs, so in practice, this means adopting a triage approach to focus energy on the big wins and big risks. This does not mean accepting exemptions where none apply, for example, small sites. Read more about biodiversity net gain, including de minimis exemptions."
        },
        {
            "text": "In the longer term, being strategic with both nature objectives and resources can also increase capacity. By being strategic with section 106 agreements and charging for pre-application advice, it is possible to recover costs and grow resources."
        },
        {
            "text": "Sharing good practice among peers, we’re seeing more LPAs doing the same"
        },
        {
            "text": "One way to be strategic with LPA staffing is to work with other LPAs around England. PAS runs a BNG weekly drop-in session for LPAs. This is an opportunity for peer support and sharing of resources. We know that every LPA is unique with its own social and natural landscape. However, this does not mean reinventing the wheel across the country."
        },
        {
            "text": "Some LPAs have had the chance to get ahead and are happy to share what they’ve learned and any templates they’ve developed. For example, the Small Sites Metric has been designed so that it can make use of existing information. Some LPAs are drawing on local record centres who will already have required evidence, like the presence of European Protected Species. Others are pointing to existing LPA advice on how to screen certain types of development for likely species, like bats in semi-derelict buildings. Since sharing examples of good practice among peers, we’re seeing more and more LPAs doing the same."
        },
        {
            "text": "BNG is consented and enforced by LPAs through the planning regime"
        },
        {
            "text": "BNG is primarily consented and enforced by LPAs through the planning regime as part of the application process and post-decision activities. This is what LPAs need to do. Once a developer has been granted planning permission, the metric used to baseline biodiversity should stay the same throughout post-decision delivery. The 30-year monitoring plan on the other hand, should make allowance for reasonable amendments. Examples of monitoring requirements can be accessed on PAS’s website."
        },
        {
            "text": "The other opportunities to consider include pursuing additional income streams, such as selling off-site units from their own local authority land."
        },
        {
            "text": "LPAs must encourage developers to provide the required BNG either fully or in part via on-site habitat, or as a second-preference, via off-site habitat."
        },
        {
            "text": "A last resort alternative, statutory biodiversity credits, is available if on-site and off-site options are not possible. The scheme will help to ensure that the pace of development in England is not impacted by the introduction of mandatory BNG. LPAs agree whether a developer can buy statutory credits as part of the planning process. These statutory credits are available to buy only once planning permission has been granted and other options have been exhausted."
        },
        {
            "text": "Thank you"
        },
        {
            "text": "Sustainable development and nature recovery can sit side-by-side"
        },
        {
            "text": "Perhaps the most important lesson from this period of change is that there are so many wonderful people and organisations working tirelessly to ensure BNG is able to be an important step-change to drive nature recovery. We’re proud to play our part in getting Britain building by enabling sustainable growth. Sustainable development and nature recovery can sit side by side, but it takes effort across sectors and geographies to pull together for national change. Thank you to everyone working on BNG, and especially thank you to LPAs."
        },
        {
            "text": "If you work for an LPA and have an interest in BNG, please visit the PAS* website to sign up for advice, support, and training."
        },
        {
            "text": "* PAS is a Local Government Group programme funded by the Department for Levelling Up, Housing and Communities, the Department for Environment, Food and Rural Affairs, and Natural England."
        }
    ]
}