{
    "url": "https://naturalengland.blog.gov.uk/2024/12/06/1949-national-parks-and-access-to-the-countryside-act-a-reflection-from-navroza-ladha/",
    "title": "1949 National Parks and Access to the Countryside Act - a reflection from Navroza Ladha",
    "authors": [
        "Navroza Ladha"
    ],
    "categories": [
        "Landscape",
        "Nature",
        "Parks, trails and nature reserves",
        "Wildlife"
    ],
    "pub_date": "2024-12-06T11:55:35+00:00",
    "content": [
        {
            "text": "By Navroza Ladha, Chief Officer for Legal, Governance and External Affairs at Natural England"
        },
        {
            "text": "On the 16 December this year (2024) we will be celebrating the 75th anniversary of the groundbreaking “1949 National Parks and Access to the Countryside Act”, which established and ensured the natural beauty of, and public access to, huge swathes of land – from moors to tors and everything in between. The duties included in the Act were far reaching, establishing much of Natural England’s role today and providing our organisation with the legislative framework to both aid us legally and inspire us in our nature recovery aims."
        },
        {
            "text": "To understand the importance of a piece of legislation, on both the natural environment of England and Wales as well our very own relationship with nature, we first need to look back to its origins. Because as you’ll see, this legislation, and people’s connection with and access to nature, walk hand-in-hand."
        },
        {
            "text": "The groundwork for the 1949 Act can be seen in various events throughout the 19th and 20th centuries, from James Bryce MP bringing a failed “freedom to roam” bill in 1884 to 1929 with Ramsay MacDonald, then Prime Minister, initiating an investigation into whether National Parks would be of benefit to the nation."
        },
        {
            "text": "In 1932, that connection between people, access and nature came to the forefront again with the mass trespass on Kinder Scout. Ramblers marched to protest that all should have a right of access to the countryside. Following on from this, in 1936 a Standing Committee on National Parks (a committee active today as the Campaign for National Parks) was created."
        },
        {
            "text": "These moments are just examples of the instances of ambitious drive and inspiring words, which laid the path, stone by stone, to the Act as we see it today. Previous generations recognised the importance of protected natural spaces, and the vital need of access to them – as seen during the Second World War, where this vision was connected to preparation for the building of a healthy society following the end of the war."
        },
        {
            "text": "In 1949, the Labour Government of the day saw the benefits of such a nature and access bill in the post-war setting – the social and health benefits of access to protected places for people aligned well with a Government that created the NHS. The second reading of the National Parks and Access to the Countryside Bill was unopposed, a Bill which the Labour Planning Minister Lewis Silkin noted “…is not just a Bill. It is a people’s charter…” There are now ten National Parks located in various regions of England, the most recent being the South Downs National Park in 2010."
        },
        {
            "text": "The 1949 Act is a foundation for Natural England, with our vision for “Thriving Nature for People and Planet”. From that founding legislation, Natural England has various duties, from considering areas in England which meet National Park and National Landscape designation criteria (and seeking to ensure their purposes are furthered), to establishing National Trails, National Nature Reserves (NNRs) and Sites of Special Scientific Interest (SSSIs) – protecting some of our most important habitats, species, history and geology. The Act has also allowed us to go further in our ambitions – due to the legislation preserving nature, we have been able to build upon its successes by progressing to actively recovering nature too."
        },
        {
            "text": "Working with legislation that is 75 years old has led to challenges over the years, for example around the interpretation of the language as well as the changes over time in how our society now lives, works and plays. Yet, it’s impact on people’s relationship with nature in the UK, and on nature recovery itself, illustrates the importance of its role in Natural England’s work in advising the Government on legislative needs."
        },
        {
            "text": "Here at Natural England, we take pride in delivering the legacy of this important legislation from 1949 with our ambitious designations programme, including new SSSIs, two new potential Areas of Outstanding Natural Beauty (that will be known as National Landscapes if designated), extensions to two existing National Landscapes,  the King’s Series of National Nature Reserves, and the King Charles III England Coast Path. Just to name a few. I end with a note for colleagues and partners alike to celebrate the anniversary of this historic Act (and the importance of legislation as a whole), as well as its association with people’s past and continuous connection with our natural world. Here at Natural England, our work celebrates its legacy every day."
        },
        {
            "text": " "
        },
        {
            "text": "We have produced two 75th anniversary celebration podcasts which can be accessed using the links below:"
        },
        {
            "text": " "
        },
        {
            "text": "75th Anniversary Part 1: past and present (30 mins) features conversations with:"
        },
        {
            "text": " "
        },
        {
            "text": "Marian Spain – Natural England (The impact of the Act)"
        },
        {
            "text": "Clare Webb – Natural England (Countryside Code)"
        },
        {
            "text": "Julie Merrett - Natural England (National Nature Reserves)"
        },
        {
            "text": " "
        },
        {
            "text": "75th Anniversary Part 2: the next 75 years (25 mins) features conversations with:"
        },
        {
            "text": " "
        },
        {
            "text": "Stuart Pasley – Natural England (Resilient Landscapes and Seas)"
        },
        {
            "text": "Julian Gray – National Trails UK and NE Landscape Advisory Panel member"
        },
        {
            "text": "Saskia Luqmani – Protected Landscapes Partnership"
        },
        {
            "text": "Marian Spain – Natural England"
        }
    ]
}