{
    "url": "https://mhclgdigital.blog.gov.uk/2024/12/06/digital-planning-developing-planning-applications-specifications-in-the-open/",
    "title": "Digital Planning: Developing planning applications specifications in the open ",
    "authors": [
        "Mike Rose, Data, Licensing and Intellectual Property SME"
    ],
    "categories": [
        "Digital Planning"
    ],
    "pub_date": "2024-12-06T12:56:21+00:00",
    "content": [
        {
            "text": "Following our previous blog about data specifications for planning application submissions, we're pleased to share progress on this important initiative. "
        },
        {
            "text": "Last week, our new advisory group met for the first time followed by our first community wide drop-in session this week. Through these sessions, we set out our ambitious target to create a baseline data specification for planning applications by March 2025.  "
        },
        {
            "heading": 2,
            "text": "Setting the scene "
        },
        {
            "text": "Our goal is clear — to create standardised data specifications that will form the foundation of an effective and data-driven planning application system which enables faster decision making and easier tracking of data in planning applications.  "
        },
        {
            "text": "The community meetings are an important first step in the journey.  "
        },
        {
            "text": "Over 20 experts joined the advisory group meeting, bringing together knowledge from across the planning system — including Local Planning Authority software providers, property developers, planning system specialists and digital transformation experts.  "
        },
        {
            "text": "The advisory group is one part of the wider community we want to establish around our work, to help us consider and navigate the development of the specifications.  "
        },
        {
            "text": "To ensure we’re capturing a wide range of perspectives, we also hosted an online community drop-in session that attracted around 40 attendees. The drop-in sessions are open to anyone, and we are encouraging Local Planning Authorities and others involved in the planning process to register if they are interested in attending future online meetings – the next one is taking place at 11am on 17 December.  "
        },
        {
            "text": "A key part of our process to develop these data specifications is working in the open, in a collaborative and inclusive way. Anyone who wants to contribute is therefore welcome to join us in future drop-in sessions. "
        },
        {
            "text": "At both sessions, we shared our vision and had productive discussions about our approach to the specifications. "
        },
        {
            "text": "The different perspectives from the diverse range of participants led to some robust and constructive discussions. We welcome these valuable challenges – they’re essential for creating a solution that works for everyone. "
        },
        {
            "text": "While everyone recognised the scale of the challenge ahead, the enthusiasm and shared commitment has strengthened our confidence about achieving this ambitious goal. "
        },
        {
            "text": "What has been particularly encouraging is seeing all participants unite around a common objective: to create a baseline data specification for planning applications that can serve as a strong foundation to build on. "
        },
        {
            "heading": 2,
            "text": "Help us build the specification "
        },
        {
            "text": "We have created a spreadsheet listing of all the current planning application components and fields. We’ve made this open to all and would welcome expertise from others to help evaluate each element by considering:  "
        },
        {
            "text": "We also want to encourage people to share with us where data specifications already exist. In the drop-in session several examples of existing specifications for ‘address’ were mentioned that we will examine. "
        },
        {
            "heading": 2,
            "text": "How you can help "
        },
        {
            "text": "Over the coming months we’ll be working hard to turn these conversations and contributions into clear outputs and will share regular updates via our GitHub discussion, where we welcome your contributions. "
        },
        {
            "text": "Join our next drop-in session at 11am on 17 December 2024. The advisory group will meet again in early 2025. "
        },
        {
            "text": "Thank you to everyone who has taken part so far for their valuable insights. We are looking forward to building the specifications together. "
        },
        {
            "text": "Find out how Digital Planning is transforming the planning system in our recent case study bringing to life MHCLG Digital’s objectives and guiding principles. "
        },
        {
            "text": "Keep up to date with our progress:   "
        }
    ]
}