{
    "url": "https://marinedevelopments.blog.gov.uk/2024/12/06/fisheries-data-mapping-an-update-from-the-mmo-marine-planning-team-2/",
    "title": "Fisheries Data Mapping: An Update from the MMO Marine Planning Team",
    "authors": [
        "Carl Jönsson, Senior Marine Planner (Project Manager)"
    ],
    "categories": [
        "marine planning"
    ],
    "pub_date": "2024-12-06T08:54:43+00:00",
    "content": [
        {
            "text": "In May, we shared an update on fisheries data and mapping. We are pleased to announce that maps based on the approach and data mentioned in the previous post are now available on Explore Marine Plans, for UK and Crown Dependency over 12 fisheries. We are aiming to publish information on other fisheries in due course."
        },
        {
            "text": "Please note that there are some key caveats associated with this data:"
        },
        {
            "text": "Some outputs of the analysis have already been useful, for example, providing information about the location of fisheries for the modelling, planning, and leasing for offshore wind by the Crown Estate."
        },
        {
            "text": "The fisheries sector is complex and diverse, and so is the data associated with it. That is why it is critical to explain as well as share the outputs of analyses with the fishing industry to ground-truth and triangulate the outputs from any analysis, as we did in 2023. We are continuing to review and develop the approach to improve and update the outputs from the initial analysis and make changes based on the feedback we received in the 2023 engagement. We hope to provide more updates and discuss further with fishing interests in the near future."
        },
        {
            "text": "In the meantime, we encourage everyone, particularly industry stakeholders, to review the information presented and provide comments at our next engagement point, which will be promoted through our usual engagement channels."
        },
        {
            "text": "Alternatively, you can contact us through our marine planning mailbox planning@marinemanagement.org.uk, or using the “data feedback” link on Explore Marine Plans:"
        },
        {
            "text": "Alongside this mapping, we continue to gather other information and undertake relevant research, including publishing the report on the spatial distribution of under-12m fishing activity and sensitivity to offshore wind in the east marine plan areas. This work starts to address some of the shortcomings with other mapped outputs, looking at under 12m fisheries in more detail.  These will also be published on Explore Marine Plans in due course."
        },
        {
            "text": "Finally, we look forward to continuing to work with partners, including different members of the Defra group with specific responsibilities and expertise in fisheries, such as Cefas, JNCC, Natural England, Seafish, and others in the fishing sector. Together, we aim to provide the best information and insight to inform not only fisheries management but also wider initiatives such as marine spatial planning."
        }
    ]
}