{
    "url": "https://healthmedia.blog.gov.uk/2024/12/06/here-are-the-facts-about-our-junk-food-ban/",
    "title": "Here are the facts about our junk food ban",
    "authors": [
        "cnewton"
    ],
    "categories": [
        "Children's health",
        "Obesity",
        "Public Health"
    ],
    "pub_date": "2024-12-06T18:52:05+00:00",
    "content": [
        {
            "text": "One in 10 reception aged children are now obese, and one in five children by age 5 are suffering from tooth decay. These children are being set up for a lifetime of health problems, and it's estimated that obesity costs the NHS more than £11 billion every year. "
        },
        {
            "text": "While there is no single solution to tackling obesity, evidence shows that children’s exposure to adverts for unhealthy foods can shape what they eat from a young age – in turn putting children at greater risk of becoming overweight or obese. "
        },
        {
            "text": "That’s why we’re taking steps to stop the targeting of junk food ads at kids from October 2025 which we estimate will prevent around 20,000 cases of childhood obesity. This change will help to ensure our children get the best and healthiest start in life. "
        },
        {
            "heading": 2,
            "text": "What types of adverts will be banned? "
        },
        {
            "text": "To protect children, these restrictions will only affect advertising for less healthy food or drink on television between 5.30am and 9.00pm, and paid-for advertising online at any time.  "
        },
        {
            "text": "Other types of advertising, such as billboards and other outdoor advertising, will not be affected by this change, although existing regulations still apply. "
        },
        {
            "heading": 2,
            "text": "What products can and can’t be advertised?  "
        },
        {
            "text": "To help stop children being exposed to adverts for foods that are high in fat, salt and sugar we put in place two set of criteria for products. "
        },
        {
            "text": "Firstly, we identified products that fall within one of thirteen categories that are of most significance for childhood obesity. These were decided following extensive consultation.  "
        },
        {
            "text": "These categories are:  "
        },
        {
            "text": "After this, the products in these categories must be assessed as to whether they are 'less healthy' based on a scoring tool that considers the levels of nutrients and whether products are high in saturated fat, salt, or sugar. "
        },
        {
            "text": "Only products that meet both of these two criteria will be affected by these restrictions.  "
        },
        {
            "text": "Companies can still advertise healthier versions of products in the categories above, which we hope will encourage the food industry to change their recipes and provide healthier options.  "
        },
        {
            "heading": 2,
            "text": "Is porridge being banned? "
        },
        {
            "text": "Advertisements for plain porridge oats will not be banned under the advertising restrictions.  "
        },
        {
            "text": "In fact, the majority of porridge, muesli and granola products will not be affected by the advertising restrictions but some less healthy versions (with added sugar, chocolate, syrup) could be affected."
        },
        {
            "text": "Sometimes products may be marketed as, or perceived by consumers to be, healthy but in fact contain surprisingly high levels of saturated fat, salt or sugar.  "
        },
        {
            "heading": 2,
            "text": "Will brand adverts be banned? "
        },
        {
            "text": "These restrictions on advertising will only apply to adverts where affected products can be identified.  "
        },
        {
            "text": "Companies can still advertise healthier versions of products and we encourage the food industry to change their recipes and think about providing healthier options. "
        },
        {
            "heading": 2,
            "text": "What is the evidence that these restrictions will make any impact? "
        },
        {
            "text": "Research shows that exposure to adverts for less healthy food can affect what and when children eat, shaping their food preferences from a young age. This increases their risk of becoming overweight or obese, which then sets them up for a lifetime of health issues as adults.  Obesity, for example, is the second biggest preventable cause of cancer.  "
        },
        {
            "text": "While there is no single solution to tackling the widespread causes of obesity, we estimate that these advertising restrictions will remove up to 7.2 billion calories from children’s diets per year and help prevent around 20,000 cases of childhood obesity. The health benefits are estimated at around £2billion. "
        }
    ]
}