{
    "url": "https://icsdigital.blog.gov.uk/2024/12/06/keeping-close-at-christmas-a-musical-adventure/",
    "title": "Keeping close at Christmas – a musical ‘advent’ure",
    "authors": [
        "markmerifield"
    ],
    "categories": [
        "People and recruitment"
    ],
    "pub_date": "2024-12-06T14:52:14+00:00",
    "content": [
        {
            "text": "I like our new office; I like having time to catch up in person with friends and colleagues. But on any given day I may not actually spend much time with my fellow London Digitalists (Digilistas?). Rather I’m talking to folk in one of the 5 cities outside London where the ICS Digital team can now be based (Birmingham, Cardiff, Darlington, Edinburgh, Salford). Or trying to reach everyone all at once. Over 25% of our team now work outside of London and this number will grow considerably over the next few years as it will for the civil service as a whole."
        },
        {
            "text": "With over 300 miles separating the furthest offices, being together is harder to do than when it was 5 floors. As engagement lead for Digital, bringing us all together is a part of what I look to achieve. One of our Digital values is to be cohesive, to be connected. Our business group, Integrated Corporate Services, and 2 main customer departments (DSIT and DESNZ) all value working together. Distance isn’t the only factor - some of our offices are still small in staff numbers so it’s easy to feel isolated, easy to think you’re unheard."
        },
        {
            "text": "Yes, we have events that gather us all and keep us up to date with the big messages.  There are other things we do which I might talk about another time, but right now it is coming up to Christmas. And however, or whether, you celebrate, this time of year has, over thousands of years, and across many different cultures and beliefs, been a time of gathering and connection. It is a good time to reach out and to do so beyond the veil of work."
        },
        {
            "text": "First tried during lockdown when we couldn’t connect in person so easily, ICS Digital are, once again, doing a  musical advent calendar. The rules are easy. Every day from 1 to 24 December there’s a topic (like something with animals in, something with a name) and everyone suggests a song related to that topic. It’s a way we can briefly, each day, touch base. It doesn’t take long and at the end of it, we will have a playlist we can all listen to, enjoying the choices we’ve shared with each other. It’s a nice way of seeing a little more of each other, when we can’t."
        },
        {
            "text": "A tool like Teams allows us to do this easily without affecting the momentum of work. We keep a separate Teams channel so staff can dip in and out when they have a moment. You can post links or comment. Everything stays grouped together by day. And it’s fun. It has become a conversation across the miles where those shared moments, finding a new song or remembering an old one, help shorten the distances, strengthen the bridges just that little bit."
        },
        {
            "text": " We’ve covered everything from Motorhead to Jamiroquai, from the Jackson 5 to a real life astronaut. We’ve had songs about climate, songs about robots, songs that are fearful, songs that are joyful, no doubt we will test the limits of everyone’s favourite Christmas songs soon!"
        },
        {
            "text": "What are you doing to engage with your teams over the miles?"
        }
    ]
}