{
    "url": "https://moderncivilservice.blog.gov.uk/2024/12/06/meet-the-modern-civil-service-bob-kamall-engagement-manager-central-digital-and-data-office/",
    "title": "Meet the Modern Civil Service: Bob Kamall, Engagement Manager, Central Digital and Data Office",
    "authors": [
        "Government Reform"
    ],
    "categories": [
        "A Modern Civil Service",
        "Digital and data",
        "Innovation",
        "One Big Thing",
        "Proud Civil Servant",
        "Skilled Civil Service"
    ],
    "pub_date": "2024-12-06T13:10:55+00:00",
    "content": [
        {
            "heading": 2,
            "text": "What does a Modern Civil Service mean to you?"
        },
        {
            "text": "To me, a Modern Civil Service is one that adapts, is flexible and is always prepared to try new things."
        },
        {
            "text": "I think modernisation is a bit like Sisyphus pushing against the rock, it's a never ending task. The more important thing is to set goals about where you want to be and making sure that you stop every once in a while to see how far you've come. Having been in the Civil Service for 46 years, I can look back to see so much progress, but I can also recognise the need for more change in the future."
        },
        {
            "heading": 3,
            "text": "Tell us, how did it all start? What was your first role in the Civil Service?"
        },
        {
            "text": "I got my first Civil Service role in October, 1978. It was a temporary job in a local social security benefit office. I was working on assessing and managing entitlement to benefits. Everything was brilliant, I really enjoyed the job and I particularly liked that I was helping people who were in need. The craziest thing to look back on is the technological advancements - back then everything was on pen and paper. Our idea of technology was having pocket calculators to help us add up benefit entitlements! "
        },
        {
            "text": "Since then, I’ve worked in about seven different departments or agencies over 46 years and I've lost track of the number of different programs and projects I've worked on. And that’s the beauty of the Civil Service - you can work here for over 40 years and not spend more than five years in the same place."
        },
        {
            "text": "In terms of my ‘niche', I sit in that gap between the digital technology people and the policy people, and I try to help them connect with each other."
        },
        {
            "text": "What are my top career highlights? There are too many to mention, but I’m really proud to be selected for the 2024 Government Transformation 100, recognised in the 'Citizen Experience' category for outstanding contributions to transforming public services. This prestigious honour comes after a record-breaking 1,400 nominations!"
        },
        {
            "heading": 3,
            "text": "What are the biggest changes you’ve seen in the Civil Service over the years?"
        },
        {
            "text": "The most obvious developments are in technology - moving through personal computers to laptops and handheld devices. There’s also more flexibility now and more opportunities to innovate and do things differently. Today’s world is agile and things move quickly - we don’t have to stick with processes that have been around for years, if we can think of better alternatives."
        },
        {
            "heading": 3,
            "text": "What advice would you give to colleagues wanting to succeed in the digital and data world?"
        },
        {
            "heading": 3,
            "text": "As part of One Big Thing 2024, we’re thinking about innovation in the Civil Service. What’s CDDO’s innovation focus at the moment?"
        },
        {
            "text": "The focus right now is on the creation of the Digital Centre Design, an exciting and ambitious project to design the scope, strategy and structure of the new digital centre of government. Back in July it was announced that the Department for Science, Innovation and Technology (DSIT) would expand to include the Government Digital Service (GDS), the Central Digital and Data Office (CDDO) and the Incubator for AI (i.AI), uniting efforts in the digital transformation of public services under one department. It’s a really exciting time to be in a digital role."
        },
        {
            "text": "I also sense that there’s going to be a bigger focus on digital inclusion - technology changes all the time and we have to make sure that everyone can access what they need. I say to anybody in their late forties, early fifties now, if they were to stop and think about what things were like 15 years ago, and then try to imagine how the technology is going to change in 15 years in the future, do they feel that they're capable of coping with that kind of change? We’ve quickly shifted to QR codes and apps and we need to make sure no one is left behind."
        },
        {
            "heading": 3,
            "text": "What plans do you have for retirement?"
        },
        {
            "text": "I’ll be retiring next year. I’ll certainly be doing some travelling and also some volunteering. I used to be a trustee for a small local charity, so I know how important charities are to their communities. I’m also interested in doing some informal learning, so I might try some new courses."
        },
        {
            "text": "Bob Kamall is an Engagement Manager at the Central Digital and Data Office, based in the Department for Science, Innovation and Technology. We congratulate him for his service across several government departments over 46 years. Follow the Government Digital and Data profession on LinkedIn and the Central Digital and Data Office blog to see the latest updates."
        }
    ]
}