{
    "url": "https://educationhub.blog.gov.uk/2024/12/06/primary-school-admissions-2024-apply-deadline/",
    "title": "Primary school admissions 2025: How to apply and when is the deadline?",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Schools"
    ],
    "pub_date": "2024-12-06T15:12:07+00:00",
    "content": [
        {
            "text": "Parents of children aged three and four will be thinking about submitting their applications to secure their child’s place at primary school for the next academic year.   "
        },
        {
            "text": "The deadline is fast approaching and applying on time will boost your chances of securing a place at your top choice school.   "
        },
        {
            "text": "Here, we explain everything you need to know about primary school admissions, including how and when to apply. "
        },
        {
            "heading": 3,
            "text": "How do I apply for a place at primary school?  "
        },
        {
            "text": "Applications should be made online through your local authority website wherever possible.  "
        },
        {
            "text": "If you want to submit a paper application instead, you can request one from your local council, or download and print the application form for your local council website.  "
        },
        {
            "text": "You must then fill it in and hand it into your local council by the application deadline date.  "
        },
        {
            "text": "You will be allowed to express an interest for at least three schools you wish for your child to attend. In some areas, you may be allowed to choose up to six preferences. "
        },
        {
            "heading": 3,
            "text": "When is the primary school admissions deadline?  "
        },
        {
            "text": "The deadline for applying for primary school is 15 January 2025 for admission in September 2025. "
        },
        {
            "heading": 3,
            "text": "What if I miss the deadline? "
        },
        {
            "text": "Late applications received after the deadline may not be considered until after all other applications received on time.   "
        },
        {
            "text": "This could result in your child not securing a place at your preferred school.  "
        },
        {
            "heading": 3,
            "text": "When will I find out if my child has a place?  "
        },
        {
            "text": "Parents will find out which primary school has offered their child a place for September 2025 on Wednesday 16 April. The decision will be sent by the local council by either letter or email.   "
        },
        {
            "text": "Some councils allow parents to view their results through the admissions portal or system.   "
        },
        {
            "text": "Exactly what time the offers will be released varies from area to area.    "
        },
        {
            "heading": 3,
            "text": "How are primary school places decided? "
        },
        {
            "text": "All schools have admission criteria to decide which children get places, set by the school's trust or governing body or the local council.  These criteria are used where the school receives more applications than there are places available"
        },
        {
            "text": "While all state-funded schools must give top priority to admitting children who are in care or have been in care, admission criteria are different for each school. For example, they may choose to give priority to children:   "
        },
        {
            "text": "Your local council can give you information about a school’s criteria. You should also be able to view these on your local council website.  "
        },
        {
            "heading": 3,
            "text": "What if my child doesn’t get a place at my preferred school? "
        },
        {
            "text": "If you’re not offered your first-choice school, you can appeal the decision. Your decision letter will tell you how you can do this.  "
        },
        {
            "text": "However, even if you're appealing a decision, we recommend accepting the offer your child did receive so that they have a school place if the appeal is unsuccessful. "
        },
        {
            "text": "Accepting another offer won’t affect your appeal or limit other options available to you.   "
        },
        {
            "text": "Parents or carers who want to appeal a decision should first contact the school’s admission authority, which is responsible for organising the appeal panel.   "
        },
        {
            "text": "Parents and carers can find their school’s admission authority by visiting their local council website. "
        },
        {
            "text": "The appeal panel is independent and will look at the case presented by both the admission authority and the parent before coming to a decision.   "
        },
        {
            "text": "The decision of the appeal panel is binding – if the appeal is upheld, the admission authority must offer the child a place at the school.   "
        },
        {
            "text": "Admission authorities and appeal panels must comply with the statutory School Admission Appeals Code, which is available here. Guidance for parents on the admission appeals process can also be found here.   "
        },
        {
            "text": " "
        }
    ]
}