{
    "url": "https://socialcareinspection.blog.gov.uk/2024/12/06/unregistered-childrens-homes-too-many-vulnerable-children-are-placed-at-risk/",
    "title": "Unregistered children’s homes: too many vulnerable children are placed at risk",
    "authors": [
        "Yvette Stanley"
    ],
    "categories": [
        "children's services",
        "looked after children",
        "safeguarding",
        "social care regulation"
    ],
    "pub_date": "2024-12-06T09:57:25+00:00",
    "content": [
        {
            "text": "We have published our new analysis of the concerning rise in the use of unregistered children’s homes. Last year, we opened over 1,000 cases to investigate potential unregistered settings."
        },
        {
            "text": "Why are we concerned?"
        },
        {
            "text": "Some of the most vulnerable children are being placed in illegal, unregistered children’s homes. These settings have the least amount of scrutiny and children are at an increased risk of harm."
        },
        {
            "text": "Children living in registered children’s homes benefit from the safeguards that regulation brings. For example, we inspect registered homes at least once a year. And an independent person must visit registered homes every month. They check the running of the home and assess whether children are being kept safe."
        },
        {
            "text": "Children living in unregistered children’s homes do not have these safety nets. There is also no process for assessing the quality of their care, or the suitability of the adults providing that care."
        },
        {
            "text": "Unregistered children’s homes are also not a cheap option for local authorities. We found that they charge local authorities at least the same rates as registered homes, and often significantly more. This issue was raised recently in the House of Lords, where it was noted that local authorities are charged up to £20,000 a week for 1 child."
        },
        {
            "text": "There are also too many children who are being deprived of their liberty in unregistered provision. The Department of Education (DfE) has asked the Children’s Commissioner to report on children under a deprivation of liberty (DoL) order. This recently published report is an important account of children’s day-to-day experiences in unregistered provision."
        },
        {
            "text": "Why is this happening?"
        },
        {
            "text": "Local authorities tell us that they often place children in unregistered homes because there is no other option. There is not enough legal provision that meets the child’s specific needs. These children are usually placed alone, and the reason given is that they have complex needs. Given that many of these children are also the subject of DoL orders, this is worrying. These children are isolated and not under any regulatory oversight."
        },
        {
            "text": "The report published by the Office of the Children’s Commissioner further touches on the negative implications of instances where children with complex needs are deprived of their liberty. It highlights how many children live with DoL restrictions in settings that are highly unsuitable, such as illegal unregistered children’s homes."
        },
        {
            "text": "Local authorities also tell us that, in most cases, they only place children in unregistered homes in an emergency, such as a family or placement breakdown, when there is no regulated alternative. However, not all children move on to more settled and regulated arrangements quickly enough."
        },
        {
            "text": "What needs to change?"
        },
        {
            "text": "In 2021, the government announced that we would be given additional powers to tackle unregistered children’s homes."
        },
        {
            "text": "In our Big Listen response, the most agreed-with statement in the entire social care section was: ‘Ofsted should have greater powers to address unregistered providers that have vulnerable children in their care’."
        },
        {
            "text": "The DfE has now published its policy paper for the Children’s Well-being Bill, confirming it intends to give us these powers.  This, and the other new measures set out in the policy, signal a big step forward in improving how children are helped, protected and cared for. We have published a blog setting out our full response to the paper."
        },
        {
            "text": "The residential care sector is growing but many homes are not in the right places nor delivering the right services. We are really pleased that the DfE is committed to overseeing the market and giving us what we need to make good registration decisions about where homes are situated."
        },
        {
            "text": "We understand the significant challenges that local authorities face in finding the right places for children. But children who need placements should only be placed in legal, registered settings."
        },
        {
            "text": "Next steps"
        },
        {
            "text": "We will continue to look closely at any use of unregistered provision in our inspections of local authority children’s services. We will carry on evaluating practice and calling out poor decisions. As we reform our inspection frameworks in line with the Big Listen and the government’s reforms, we will strengthen our approach further."
        },
        {
            "text": "We want registered homes to feel able to step up and work with children who have multiple needs. We want unregistered provision to stop. And we want local authorities to always be able to make good decisions for children."
        }
    ]
}