{
    "url": "https://dwpdigital.blog.gov.uk/2021/11/03/adopting-a-positive-mindset-in-challenging-times/",
    "title": "Adopting a positive mindset in challenging times",
    "authors": [
        "Emma Murray, Product Owner, DWP Digital"
    ],
    "categories": [
        "Digital Voices",
        "Diversity",
        "DWP Digital",
        "Wellbeing",
        "Women in Digital"
    ],
    "pub_date": "2021-11-03T16:34:32+00:00",
    "content": [
        {
            "text": "I’m Emma Murray and I’m a product manager within DWP Digital. I’ve just celebrated 29 years in DWP, which was very strange since I am still working mainly in my spare bedroom/office by myself rather than being in an office full of colleagues."
        },
        {
            "text": "I was inspired to write this blog post when I took some time to think about how the lockdown’s impacted my wellbeing, what I learned and ways I managed to keep positive. I’m also part of the internal Digital Voices programme, which supports women to build their confidence and skills. So I felt sharing my experience on stress – which can be a taboo subject – would be a positive thing to do. I’ve experienced a number of depression/anxiety episodes over the years and have learned to look out for the signs which tend to be triggered by major events that feel out of my control. The first was in 2000 when I broke my spine. The second was in 2005 when we had a house fire, my boys were both under two at the time, and we had to move into rented accommodation. The third was when I returned to work in 2011 after having my youngest and the last was in 2015 when I was on the road delivering training. If you ignore the fact that they seem to happen every five years, they all happened when an event occurred that I had no control over."
        },
        {
            "heading": 2,
            "text": "A challenging year"
        },
        {
            "text": "The last 18 months has been challenging on my wellbeing to say the least. With both my husband and I still working from home full-time and with three children who were affected by the school closures, it’s been quite a busy house."
        },
        {
            "text": "As a family we were all affected by the lockdown in different ways such as my husband having no sport to watch or golf to play and my sons being unable to take their exams or see friends."
        },
        {
            "text": "Although my youngest started the lockdown thinking it was great not having to go to school, that soon wore off to feelings of isolation at the lack of the school routine and missing her friends. As for me, I initially focused on trying to keep positive while navigating the changing restrictions using the mantra, \"It’s not a sprint it’s a marathon.\""
        },
        {
            "heading": 2,
            "text": "Embracing the positives"
        },
        {
            "text": "At the start of the first lockdown, I was obsessed with the news and worried about my children’s education, but as the weeks passed I realised I needed to find some structure and positives from the experience because I was in danger of letting things overwhelm me. When you stay in one environment you start to see more of the bad than the good and I’ll confess I had a few wobbles along the way, but found strategies that have made me feel better."
        },
        {
            "text": "One significant time of worry was the announcement of the last lockdown in January. Even though we sort of knew that it was coming, it’s only when you see the restrictions in black and white that things become very real. I still remember sitting on the sofa and hearing the news thinking ‘Not again’ and ‘How am I going to work full-time and home school my 10-year-old’."
        },
        {
            "text": "As my anxiety started to rise I knew that I needed some time to process the restrictions and talk through the implications with my husband. I allowed myself a pause period to process the new challenges and find ways to take back some control by establishing new routines, before I ran the risk of being overwhelmed by trying to do it all."
        },
        {
            "heading": 2,
            "text": "Reframing setbacks "
        },
        {
            "text": "As the year progressed and we moved in and out of lockdown I learned to accept the rollercoaster of emotions and reframe any negative situations into something positive."
        },
        {
            "text": "For example, as we approached my daughter’s 10th birthday it was becoming clear that she could not have the party that she had been planning since her 9th birthday due to the lockdown rules. Deciding not to let that stop us, I came up with an idea for an online party. I created party packs for each of her friends from boxes filled with party food, games, prizes and treats that were all individually wrapped and I invited all the children onto a Zoom call so they could open everything together. Who says work skills aren’t transferable to home life?"
        },
        {
            "text": "Although it wasn’t the same as being together in person, we still made fabulous memories that would never have happened without the pandemic. The party was so successful that I ran a Friday night online bingo session, in the run up to Christmas, for her classmates. I’m so proud that my daughter is now an expert at organising online calls, which I think is a great skill to learn in this digital age."
        },
        {
            "text": "As we started to get closer to the end of the lockdown restrictions I took the plunge to plan a garden party for my son’s 18th birthday. I was not taking the risk of celebrating at a venue. Therefore, to keep an element of control, I planned it at home. I spent months looking for deals on gazebos, fairy lights and decorations. I kept a close eye on the numbers to be invited just in case restrictions were not lifted, which they weren’t. I thought I had planned for everything until I got a call five days before the party saying the caterer had COVID-19. Instead of panicking I recruited my mum and best friend to help me recreate the menu, after all we were now restricted to a maximum of 30 guests. In the end everything went well and my son ended up with two parties, the first with family and a small number of mates and a second with just friends. Though I drew the line at catering for two parties, so the second just had drinks and nibbles."
        },
        {
            "heading": 2,
            "text": "The future"
        },
        {
            "text": "As we get closer to returning to some level of normalcy it’s a perfect time to sit back and reflect on almost two years that have been dominated by a pandemic. I’ve been determined to come out of the situation more knowledgeable than when it started and I am pleased to say that I believe I have."
        },
        {
            "text": "In my personal life, I’ve had more time to slow down and enjoy time with the family and try new things."
        },
        {
            "text": "In my professional life I secured promotion in a job that I enjoy and more recently became a certified Leadership Essentials coach, which I’m excited to start delivering to colleagues in the coming months. I’ve been lucky to get back into the office and start to work in a hybrid way, which has really helped me to feel more connected to my team and appreciate how the advancement in technology is enabling me to work as effectively from home as in the office. As a working mum I’m looking forward to achieving a greater work life balance from hybrid working without comprising my career and progression."
        },
        {
            "text": "However, above all I think I am stronger for learning to stay positive and for finding joy and satisfaction in new things. In years to come, I am hopeful that my children will l back to this time with fondness rather than distress, I know I will."
        },
        {
            "heading": 2,
            "text": "Join us"
        },
        {
            "text": "At DWP Digital, the wide range of work we do requires a diverse mix of cultures, perspectives, experience, skills and ideas. We’re recruiting for hundreds of digital specialists to join us and bring their fresh perspective."
        }
    ]
}