{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2021/11/03/diversity-and-inclusion-creating-a-welcoming-workplace-for-all/",
    "title": "Diversity and Inclusion – Creating a Welcoming Workplace for All",
    "authors": [
        "Selina Khan"
    ],
    "categories": [
        "Diversity & Inclusion",
        "Our People & Deep Dives"
    ],
    "pub_date": "2021-11-03T12:40:05+00:00",
    "content": [
        {
            "text": "Author: Alison Woodgate – Business Support Manager, UK Health Security Agency"
        },
        {
            "text": "When you are nominated by a senior manager to take part in an academy for future leaders, what do you do?  Grab it with both hands and run with it of course!"
        },
        {
            "text": "This happened to me at the end of last year when out of nowhere, I became involved in the biggest project of my career.  Joining the Civil Service Future Leaders Academy felt like joining an exclusive club - but without reading the contract beforehand!  Initially I couldn’t conceive how a team of four Civil Servants would pull together an event for around 50 delegates and deliver it with bells and whistles.  However the crucial thing was that whilst we all came from different organisations, we were collaborating on a subject we all felt passionate about – diversity and inclusion (D&I)."
        },
        {
            "text": "Following the first few planning meetings where we discussed our aims and objectives, we knew we were into a subject area that people would want to engage with, but we never dreamt we would be able to create the kind of momentum that would draw people to us in droves.  A big pull was managing to secure participation from a nationally-known respected doctor and scientist – Sir Patrick Vallance, Government Chief Scientific Adviser.  We felt we had landed a coup when we got his agreement to come and speak, and the appreciation and feedback from the audience validated that feeling."
        },
        {
            "text": "Not only did the Morse Family (the name given to us at the start of the Academy) deliver, but we pulled it off with almost 1,000 delegates.  As one of our family kept reminding us, “Teamwork makes the dream work”, and although there were times when it felt like it was less dream and more nightmare, we got there.  The result was a two-day conference for senior and operational Civil Servants from all departments sharing good practice,  debating D&I issues on how to create a welcoming and diverse Civil Service,  hearing some incredible motivational speeches from a diverse range of guest speakers, and generally just having the freedom to talk in a safe space."
        },
        {
            "text": "It wasn’t all a bed of roses - there were times along the journey when we wondered if we could carry on.  All of us were juggling new roles/promotions in our ‘day jobs’ whilst putting in the hours for the D&I event.  I even managed to move house just at the most hectic time.   At one point I remember a manager once saying to me – “You’ll get an amazing sense of satisfaction when you’ve done it” and me thinking “Really?! I’ll just be glad when it’s over!”  Predictably though, she was right.  The interest, attendance, amazing guest speakers and positive feedback we received from delegates blew us away.  But don’t take my word for it – see for yourselves with some feedback from our senior Civil Servant day …….."
        },
        {
            "text": "And some analysis/stats for the graph-loving readers……."
        },
        {
            "text": "Plus a word cloud summing up the most used words on our feedback…………….."
        },
        {
            "text": "If you are interested in finding out more about the Future Leaders Academy then look on: Apply now for the Future Leaders Academy - Civil Service Local (blog.gov.uk)"
        },
        {
            "text": "If you wish to progress your D&I journey, then get involved with diversity and inclusion groups or become champions in your own organisation."
        },
        {
            "text": "If you have any queries about the Morse Family, this particular D&I event or any other questions relating to D&I please email alison.woodgate@phe.gov.uk."
        }
    ]
}