{
    "url": "https://vets.blog.gov.uk/2021/11/03/one-health-day/",
    "title": "One Health Day",
    "authors": [
        "Dr Christine Middlemiss BVMS MRCVS"
    ],
    "categories": [
        "Government Veterinary Services",
        "International Work"
    ],
    "pub_date": "2021-11-03T12:58:38+00:00",
    "content": [
        {
            "text": "On this, the 6th International One Health Day, I’d like to take a moment to reflect on the achievements that we as a team, across the Department for Environment, Food and Rural Affairs (Defra) and the UK, have made - and how we must continue to pursue all opportunities to operationalise the One Health concept."
        },
        {
            "text": "It is vital we maintain the momentum COVID-19 has brought to the importance of a One Health approach. Without a full understanding of our changing interactions with animals and our environment, we will increase the risk of threats to human, animal, plant and environmental health."
        },
        {
            "text": "This is why I firmly believe it is critical to embed and sustain a One Health approach, which understands and incorporates this interconnectedness, throughout government, the public, the scientific community and with international partners. This is imperative if we are to avoid further public health crises from infectious diseases that originate in animals, so-called zoonoses, to slow the development of antimicrobial resistance (AMR), prevent food insecurity and mitigate impacts of climate change and biodiversity loss."
        },
        {
            "text": "COP26 presents another global opportunity to reflect on our relationship with nature, a critical facet to protecting our health resilience. Here again, the One Health approach offers great insights, and a robust framework to defend against the increasing threats from climate change and environmental degradation, such as the geographical spread of important biological vectors of diseases, such as mosquitoes, ticks, midges and sandflies, due to expansion of their geographic ranges. Biodiversity loss, land use (including agriculture) and pollution also play critical roles and we must be aware of their impact on zoonotic risk and the ecosystems we are so dependent on for our health."
        },
        {
            "text": "I know my own commitment to One Health is fully supported and echoed across Government, including by the Secretary of State for Defra and Deputy Chief Medical Officer (DCMO) Professor Jonathan Van-Tam."
        },
        {
            "text": "I am proud of all the work that has been undertaken over the past year to drive this concept forward, some of which is highlighted below:"
        },
        {
            "heading": 3,
            "text": "The UK’s G7 Presidency: promoting One Health"
        },
        {
            "text": "Our UK G7 Presidency contributed significantly to global One Health developments, setting up three new initiatives. The One Health Intelligence Scoping Study led by the Tripartite and United Nations Environment Programme (UNEP) has now launched, aiming to improve global health resilience and early warning through building and integration of our health intelligence systems that are so fundamental to threat mitigation."
        },
        {
            "text": "Closer to my own area, but still with strong cross-sector engagement, the International Zoonoses Community of Experts is facilitating greater international collaboration to shore up our zoonotic surveillance and risk assessment capacity. Developing science capability, The UK Animal Vaccine Manufacturing and Innovation Centre was established to accelerate vaccine delivery for livestock diseases."
        },
        {
            "text": "The G7 CVOs Wildlife Meeting was a personal highlight for me, a productive and collaborative event that developed our collective knowledge of best practice in the critical aspects of wildlife surveillance, intelligence sharing and risk communication. I was pleased to then be able to share the outcomes and conclusions at the 88th World Organisation for Animal Health (OIE) General Session in May."
        },
        {
            "text": "The UK continues to work closely alongside the Tripartite and UNEP and remains committed to laying the foundations for future One Health working and closer international partnerships. Addressing gaps and strengthening our collective One Health capabilities continues to be a UK priority and vital step in protecting our future."
        },
        {
            "heading": 3,
            "text": "One Health in action in the UK: Cross-sector collaboration"
        },
        {
            "text": "I am also very pleased with how Defra has continued to work alongside other government departments here in the UK, acting in a collaborative and inter-disciplinary One Health way. This builds on existing cross-Whitehall engagement, such as the COVID-19 response where experts from the animal sector provided expert laboratory and scientific modelling capability."
        },
        {
            "text": "The Human Animal Infections & Risk Surveillance (HAIRS) group, also remains an exemplar of One Health in action. We should strive to pursue domain-less approaches to avoid narrow problem-solving and build stronger, more holistic policy for all our global life support systems (e.g., water, energy, food and shelter)."
        },
        {
            "text": "Having a cross- Whitehall agreed One Health definition, as well as a clear animal, plant and environmental focus in the Government’s Integrated Review and related cross-disciplinary groups, helps to formalise this collaboration. These provide strong platforms for a truly embedded One Health approach. We want to drive further step changes in the way we work, with fully equitable engagement across the spectrum of human, animal, plant and environmental sectors, to provide us with greater health resilience and more holistic, sustainable policies and practices."
        },
        {
            "heading": 3,
            "text": "International developments to tackle global challenges"
        },
        {
            "text": "I am glad the UK has been at the forefront of global developments in this area, with the Prime Minister’s references to zoonoses at the United Nations General Assembly and the World Health Summit helping to further promote the importance of One Health amongst the international community. We are of course not alone here, and I have been pleased to see UNEP join forces with the Tripartite to consolidate the groups environmental offering, as well as the establishment of the One Health High Level Expert Panel that will provide greater guidance and cooperation on One Health issues. I look forward to working with global partners to build on this, so we are better prepared for future threats."
        },
        {
            "text": "I am acutely aware that none of this could be achieved without the incredible work of our Defra Group agencies and delivery bodies, who have consistently shown their ability to deliver at the highest standard and pursue a One Health approach. Examples include:"
        },
        {
            "text": "We have all witnessed the catastrophic effects of overlooking the complex connections between human, animal, plant and environmental health, and cannot afford to do so again."
        },
        {
            "text": "Unless we come together with those outside of our own disciplines, we will be unable to address the resultant disease outbreaks, food insecurity, AMR, pollution and myriad cross-cutting health threats and global challenges. We live in One World – we must deliver One Health."
        }
    ]
}