{
    "url": "https://lifeathmrc.blog.gov.uk/2021/11/03/our-graduate-programme-chris-experience/",
    "title": "Our graduate programme: Chris’ experience",
    "authors": [
        "Chris Stewart",
        "Mems Bangura"
    ],
    "categories": [
        "General",
        "Graduate",
        "Guest blog"
    ],
    "pub_date": "2021-11-03T13:15:15+00:00",
    "content": [
        {
            "text": "Applications for our graduate Tax Specialist Programme (TSP) are now open! You have until 19 November 2021 to apply."
        },
        {
            "text": "Chris joined the TSP straight after graduating in 2014 and now works on our policy team. Read on to find out about Chris’ experience at HMRC since joining the programme."
        },
        {
            "text": "“I was initially attracted to the diversity of careers and the work life balance offered by the Civil Service, as well as the opportunity to keep learning at work. I didn’t really know a huge amount about tax or HMRC when I applied or when I started, so definitely don’t let that put you off if you’re thinking of applying!"
        },
        {
            "text": "I thought HMRC would be a good match given I studied Maths at university but in hindsight that didn’t really matter and my colleagues on the course were from a range of backgrounds. The course provided a good mixture of academic and practical learning, and you are given the chance to apply the learning in your work. Overall, the programme is quite flexible, and you are trusted to manage your own learning. The classes were also a great chance to get to know your colleagues better and to meet people from a variety of different teams. It was a great transition from university to work life."
        },
        {
            "text": "I started my HMRC career in the Large Business team and really enjoyed doing compliance work with a range of HMRC’s customers. The main focus of our compliance teams is to make sure businesses are fully tax compliant. I could lead my own enquiries into small businesses – corresponding with customers directly and leading my own cases. This allowed me to get to grips with the basics of tax."
        },
        {
            "text": "I was also included as part of wider teams working with more experienced colleagues on some of the most complex customers within the financial sector. I can remember one day that really stood out for me where I spent the morning at a sole trader’s house, sitting on their sofa going through records with them with their dog sat on my lap, followed by a slightly more glamorous afternoon in the 40th floor of a skyscraper in Canary Wharf. I think the TSP is one of the few graduate schemes that would offer that range of experiences!"
        },
        {
            "text": "I always felt comfortable in my work due to the support network you start with on the programme. Trainees in their second and third years and more senior, experienced colleagues have all been really supportive. I also found that most doors in the organisation were always open for me as a TSP trainee and whenever I asked to get involved with something interesting the answer was usually yes."
        },
        {
            "text": "I should add that the training doesn’t stop at the end of the course either. Since finishing the TSP, several of my colleagues have been sponsored to do Master’s degrees in tax and I recently joined one of the many cross-Civil Service leadership schemes."
        },
        {
            "text": "I finished the TSP doing a policy role – working in partnership with HM Treasury and ministers to deliver tax policy changes – and have since held roles working directly for HMRC’s Chief Executive Officer and the Director General of Customer Strategy and Tax Design. The experience and contacts I gained on the TSP have been essential to allow me to continue to progress at HMRC.”"
        }
    ]
}