{
    "url": "https://socialcare.blog.gov.uk/2021/11/03/planning-for-the-future-of-social-care/",
    "title": "Planning for the future of social care",
    "authors": [
        "Sir David Pearson"
    ],
    "categories": [
        "Care and support",
        "coronavirus",
        "Workforce"
    ],
    "pub_date": "2021-11-03T15:58:51+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Reviews and recommendations"
        },
        {
            "text": "I was asked to conduct a review of the Adult Social Care COVID-19 Winter Plan 2020 to 2021 and its implementation with colleagues from the sector, many of whom were on the original Social Care COVID-19 Support Taskforce in the summer of last year."
        },
        {
            "text": "The vaccination programme has made a very big change to the level of risk and the ability to not only protect people, but to connect everyone to family, friends, and wider activities and support."
        },
        {
            "text": "We also know with continued sustained community transmission, and the further risk of flu and other respiratory diseases over the winter, we must continue to be vigilant. This will be whilst enabling people to live the best lives they can. From our wide ranging review we concluded that:"
        },
        {
            "heading": 2,
            "text": "This year's winter plan and beyond"
        },
        {
            "text": "It is good to see many important ingredients included in this year’s Adult Social Care Winter Plan 2021 to 2022, and this will help everyone be prepared for the months ahead."
        },
        {
            "text": "The longer-term future of adult social care has also been the subject of increased focus over the intervening period with the announcement of funding reform; who pays and how much."
        },
        {
            "text": "Also announced were important provisions including hundreds of thousands of training places with certification for those working in social care, and services to support mental health and wellbeing care, as well as bolstering occupational health services."
        },
        {
            "text": "These are very important steps forward, but the Government also set out the need to develop and extend these plans through a White Paper, which will include a plan to support professional development and the long-term future of the workforce."
        },
        {
            "text": "These are all essential ingredients in making sure we have a workforce that is both appropriately trained and valued for the essential work it undertakes each and every day across the country."
        },
        {
            "text": "The White Paper will also need to set out other changes needed to make adult social care the best it can be. There is extraordinary commitment and innovation in social care despite the challenges; the White Paper will need to build on this, and consider the best way of providing high-quality and sustainable services which enhance choice, control, and independence."
        },
        {
            "text": "The  development of housing with care, taking advantage of the opportunities provided by technology, supporting unpaid carers, and considering how best to join up social care and health services, are just some of the important issues will be considered. Over the next few months, I hope that as many as possible will be able to contribute to a once in a lifetime opportunity to help shape these ambitious plans and proposals for the future of social care."
        }
    ]
}