{
    "url": "https://buyingforschools.blog.gov.uk/2021/11/03/schools-and-academies-show-november-2021/",
    "title": "Schools and Academies Show - November 2021",
    "authors": [
        "Megan Thomas, Stakeholder and Engagement Manager, Schools Commercial Team"
    ],
    "categories": [
        "The team"
    ],
    "pub_date": "2021-11-03T12:46:13+00:00",
    "content": [
        {
            "text": "We are all super excited within the Engagement and Outreach Team this month as we prepare for the upcoming  Schools and Academies Show on 17 and 18 November. The Schools and Academies Show is the UK’s largest education policy event that attracts attendees from Schools, Academies, MATs, Local Authorities, Central Government, and the wider education sector."
        },
        {
            "text": "This will be our first face to face show since 2019, as due to COVID-19, it successfully switched to a virtual event throughout 20/21. Our team will be in the Government Village and holding a number sessions over the two days."
        },
        {
            "text": "You can register for free to attend the event and sign up to our sessions, which include:"
        },
        {
            "text": "Day One"
        },
        {
            "text": "12:05pm - 12:45pm"
        },
        {
            "text": "Business and Finance Theatre"
        },
        {
            "text": "The Schools Buying Programme"
        },
        {
            "text": "Our speakers are:"
        },
        {
            "text": "In this session:"
        },
        {
            "text": "2:10pm – 2:50pm"
        },
        {
            "text": "Business and Finance Theatre"
        },
        {
            "text": "Get Help Buying for Schools"
        },
        {
            "text": "Our speakers are:"
        },
        {
            "text": "In this session: "
        },
        {
            "text": "Take the opportunity to get questions answered directly from experts and practitioners. "
        },
        {
            "text": "Day Two"
        },
        {
            "text": "12:50pm - 1:20pm"
        },
        {
            "text": "Business and Finance Theatre"
        },
        {
            "text": "Be SMART Managing your Energy Consumption"
        },
        {
            "text": " Speakers:"
        },
        {
            "text": "In this session:"
        },
        {
            "text": "Over the course of both days at the Show, the Engagement and Outreach Team will also be holding two mini workshops in the Government Village; these sessions will be useful if you want to find out how to increase your purchasing power."
        },
        {
            "text": "You don’t need to book, just come along to the Education Village on:"
        },
        {
            "text": "17 November: 1:30-2:00pm"
        },
        {
            "text": "18 November: 10:30-11:00am"
        },
        {
            "text": "These workshops are an opportunity to discuss the DfE approved Frameworks with the Engagement and Outreach Team directly. We will be on hand to guide you through exactly what a Framework is, how to use the ‘Find a Framework’ tool as well as how to get the best out of using the other services we have. It’s the perfect time to talk with us and ask any questions you may have about your procurement challenges."
        },
        {
            "text": "You can also pre-book a one to one session with a representative Crown Commercial Services (CCS) to discuss hiring temporary and fixed term teaching and non-teaching staff for your school. CCS are the biggest public procurement organisation in the UK and will be using their commercial expertise to help you with your procurement needs."
        },
        {
            "text": "On behalf of the Engagement and Outreach Team, I want to express how much we are looking forward to seeing you in person once again and discussing how we can support your procurement journey."
        },
        {
            "text": "We hope to see you in Birmingham."
        },
        {
            "text": " "
        }
    ]
}