{
    "url": "https://environmentagency.blog.gov.uk/2021/11/03/the-connection-between-the-climate-and-nature-crises/",
    "title": "The connection between the climate and nature crises",
    "authors": [
        "Van Griffiths"
    ],
    "categories": [
        "Climate change"
    ],
    "pub_date": "2021-11-03T13:44:03+00:00",
    "content": [
        {
            "text": "With the most important climate summit ever, COP26, taking place in Glasgow, the world must seek solutions for the nature crisis alongside the climate crisis. The Environment Agency’s Deputy Director for Sustainable Business Van Griffiths explains."
        },
        {
            "text": "My name is Van Griffiths and I am the Deputy Director for Sustainable Business at the EA. I was delighted to be asked to write a blog about the connection between our climate and nature crises, as I believe that the two emergencies are inextricably linked, and that we need to play our part in tackling them together - with urgency - as part of the Agency’s mission to create better places for people, wildlife and the environment."
        },
        {
            "text": "I love the natural world. I am a hillwalker and spend much of my spare time with family and friends enjoying the outstanding landscapes of many of the UK’s fourteen national parks. However, I am also painfully aware of the status of the UK as one of the most nature depleted countries in the world: at the bottom of the G7 group of nations and in the bottom 10% globally. Beloved species like the hawfinch and water vole are on the endangered list. How did this happen, and how do we rectify the situation?"
        },
        {
            "text": "A sobering new report was published this summer . It provides powerful evidence of the interconnectedness of our climate and nature crises. It shows how human activity is causing direct negative impacts on our land, air, water, soil and wildlife, which then contributes to mutually reinforcing, ongoing, biodiversity loss and climate change. This video, made by EA colleagues in the natural capital team, illustrates this vicious circle."
        },
        {
            "text": "As we are all aware, Glasgow is hosting the 26th UN Climate Change Conference of the Parties (COP26). Less heralded, but equally vital, is the 15th Conference of the Parties to the Convention on Biological Diversity (COP15) which is taking place in Kunming, China, in two parts, in October this year, and next spring. COP15 aims to deliver a new global “deal” for nature, which will halt biodiversity decline, and put nature on a path back to recovery, by 2030 at the latest."
        },
        {
            "text": "Bold global agreements from COP26 and COP15 are essential if we are to tackle our current climate and nature crises. Success will also require ambitious action from businesses and communities across the nation. The EA is well placed to play its part in enabling this change. EA2025, the EA’s current business plan, articulates how the Agency will help to create a nation resilient to climate change, with healthy air, land and water."
        },
        {
            "text": "EA goals for 2025 include cleaner and healthier air, better water quality across our rivers, lakes, groundwater and coasts and better protection and enhancement of nature and land, through increasing biodiversity and promoting environmental net gain (by creating more and better habitats: with a total of 1,200 hectares restored and created by 2025). This work is being done with local, national and global partners."
        },
        {
            "text": "Tackling global warming and biodiversity loss means that the EA will increasingly be championing, developing and delivering win-win solutions: those which both reduce emissions and enhance ecosystems, such as Nature-based Solutions (NbS). Protection, restoration and sustainable management of landscapes such as forests, peatlands and wetlands will help us to address biodiversity loss and climate change and promote human wellbeing."
        },
        {
            "text": "As a mother of two outdoors-loving teenagers, I know what eco-anxiety is. As individuals, the scale of the dual crises can sometimes feel overwhelming. But ambitious action is now being taken at global and national level, and we can all take personal action to protect and enhance nature too. This autumn for example, I will be doing my best to reduce my own resource consumption, participating in some composing and tree-planting activities, and spending time in nature, to nourish my own wellbeing and my ongoing commitment to its care."
        }
    ]
}