{
    "url": "https://space.blog.gov.uk/2021/11/03/the-night-sky-in-november-2/",
    "title": "The night sky in November",
    "authors": [
        "Derek Smale"
    ],
    "categories": [
        "Astronomy"
    ],
    "pub_date": "2021-11-03T14:29:21+00:00",
    "content": [
        {
            "text": "The night-time temperatures have dropped noticeably in recent days, but don’t let that deter you from venturing out to look at the stars."
        },
        {
            "text": "At this time of year, you can still see the last of the summer night sky sights, and there are plenty of wonderful autumn and winter highlights to be seen in the early evening alone."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Autumn Constellations"
        },
        {
            "text": "By early evening, the striking constellations of Auriga (the charioteer) and Taurus (the bull) dominate the eastern sky."
        },
        {
            "text": "These have brighter stars and more distinctive patterns than the fainter constellations that they follow into the night sky, such as Aries (the ram) and Cetus (the whale or sea monster)."
        },
        {
            "text": "If the dropping temperature wasn’t a clear enough sign of the season to come, these constellations are quickly followed by the distinctive winter patterns of Orion (the hunter) and Gemini (the twins), which rise in the east between 8 - 9pm this month."
        },
        {
            "text": "Taurus is easily recognised by the Pleiades (also known as Seven Sisters) star cluster, which is visible even in town or city skies, and unmissable from darker skies."
        },
        {
            "text": "The photograph below shows not only the Pleiades (440 light years away), but also the redder California nebula (1,000 light years away), which sits in the constellation of Perseus."
        },
        {
            "text": "The stars of the Pleiades cluster are currently passing through a large nebula that is drifting around our galaxy, illuminating the gas as they do so, a phenomenon known as a ‘reflection nebula’."
        },
        {
            "text": "The California Nebula is an enormous cloud of ionised hydrogen gas known as an ‘emission’ nebula, which has been excited by the radiation from a nearby star Menkib (the brighter star to the lower right of the nebula), until it glows."
        },
        {
            "text": "Menkib is more than 25 times larger than our Sun, and burns nearly seven times hotter."
        },
        {
            "text": "Both nebulae are almost invisible to the naked eye, but darker skies away from light pollution, and optical aids (such as telescopes or binoculars) or long-exposure photography show just how many hidden secrets are in the night skies above us. We’ll cover some of these in future blogs!"
        },
        {
            "text": "This patch of sky is close to the band of the Milky Way, so it is packed with stars."
        },
        {
            "text": "There are, however, also dark patches and streaks which are not due to a lower number of stars, but huge clouds of dust that obscure the light of stars beyond."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Meteor showers this month"
        },
        {
            "text": "There are two meteor showers in November."
        },
        {
            "text": "The Taurids meteor shower peaks around the middle of the month, as Earth passes through the dispersed debris left behind Comet Encke."
        },
        {
            "text": "The more spread-out fragments of this comet mean this shower only produces a sprinkling of meteors, but their relatively slow speed (28km or 17 miles per second) can make them easier to spot."
        },
        {
            "text": "The Leonids meteor shower also peaks in the middle of the month, likely on 17-18 November."
        },
        {
            "text": "While the bright, near-full Moon will make the fainter meteors harder to see, these fragments of Comet Tempel-Tuttle enter Earth’s atmosphere at over 70km (45 miles) per second, making them spectacular to see zipping across the sky."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "The Moon and Planets"
        },
        {
            "text": "From the evenings of 7 November through to 13 November, look low to the south after sunset to see the Moon aligned with Jupiter, Saturn and Venus."
        },
        {
            "text": "Brightest planet Venus is closest to the horizon and sets within an hour of the Sun, with the gas giants remaining visible for a further three hours after dark."
        },
        {
            "text": "While Jupiter and Saturn are getting gradually less bright as the distance between them and our planet grows once again, they are still the brightest objects low in the south after dark."
        },
        {
            "text": "While not visible from the UK, expect to see some spectacular images from other parts of the world of the Moon passing in front of the planet Venus on 8 November."
        },
        {
            "text": "Similarly, the partial lunar eclipse on 19 November is barely visible from the UK, as the Moon sets just moments after the eclipse begins."
        },
        {
            "text": "Thankfully a full lunar eclipse will be visible from the UK in just a few months’ time!"
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "The International Space Station"
        },
        {
            "text": "There are a number of bright, visible passes of the International Space Station this month, with the brightest and easiest to spot occurring at the end of the month."
        },
        {
            "text": "Visit https://www.heavens-above.com/ for all of the passes for your location."
        }
    ]
}