{
    "url": "https://icsdigital.blog.gov.uk/2024/09/11/empowering-the-digital-journey-building-digital-proficiency-in-the-public-sector/",
    "title": "Empowering the digital journey: Building digital proficiency in the public sector",
    "authors": [
        "Sebastian Moore – Assistant Private Secretary to Karl Hoods"
    ],
    "categories": [
        "Skills and development"
    ],
    "pub_date": "2024-09-11T16:05:27+01:00",
    "content": [
        {
            "text": "I’m delighted to reflect on the success of our cross-departmental Digital Upskilling sessions in 2024."
        },
        {
            "text": "Our mission was to enhance the Digital, Data and Technology (DDaT) proficiency of staff across all professions through regular educational sessions on the current and future use of digital tools."
        },
        {
            "text": "Whether it was streamlining workflows, improving service offerings, or understanding the digital future of the Civil Service, our sessions so far have provided valuable insights and practical tools for all attendees. We ensured that our sessions catered to all levels of digital literacy, from beginners to experts, making sure no one was left behind."
        },
        {
            "heading": 2,
            "text": "Highlights of our digital upskilling sessions"
        },
        {
            "text": "Copilot for browser – how generative AI can enhance your work 🤖"
        },
        {
            "text": "In February, our inaugural session introduced the capabilities of Microsoft Copilot."
        },
        {
            "text": "Attendees learned how to leverage AI to optimise their tasks, access tools securely, and utilise prompts effectively. This session, attended by 2000 participants, set the stage for our digital transformation journey."
        },
        {
            "text": "This unprecedented event was followed up by over 56 hours of free online self-paced learning provided by Civil Service Learning via Government Campus and the Generative AI Framework for HMG to help guide colleagues to safe, ethical and effective usage."
        },
        {
            "text": "Microsoft Power Automate – automating processes 💪"
        },
        {
            "text": "April's session on Microsoft Power Automate showcased how to automate simple tasks, streamline workflows, and utilise Power Apps."
        },
        {
            "text": "This session highlighted practical applications of automation, demonstrating significant time and cost savings with real-life use cases from our colleagues in the xGov Low Code Group and from across the Civil Service."
        },
        {
            "text": "Digital inclusion – ensuring accessibility for all 🌈"
        },
        {
            "text": "In June, our focus was on digital inclusion and accessibility."
        },
        {
            "text": "This transformative session, emphasised the importance of overcoming digital barriers and biases. It provided tools and strategies to make our services more accessible and user-friendly, aligning with our commitment to inclusivity."
        },
        {
            "text": "A few key points that stood out included:"
        },
        {
            "heading": 2,
            "text": "Upcoming sessions"
        },
        {
            "text": "We’ve more exciting sessions coming up:"
        },
        {
            "heading": 2,
            "text": "Our commitment to modern workplace practices"
        },
        {
            "text": "Our upskilling initiative is a testament to our dedication to modern workplace practices."
        },
        {
            "text": "By offering a mix of hybrid seminars and online self-paced learning, we ensured that our sessions were accessible to everyone, regardless of location. The recordings of all sessions are available on our intranet, allowing staff to revisit and continue their learning journey at their own pace."
        },
        {
            "text": "This initiative is timely as we anticipate significant changes to our ways of working."
        },
        {
            "text": "These include:"
        },
        {
            "text": "Staff are now better equipped to adapt to these advanced tools, ensuring a seamless transition and maximising the benefits of these upcoming changes and innovations."
        },
        {
            "heading": 2,
            "text": "Ensuring no one is left behind"
        },
        {
            "text": "Inclusivity has been at the heart of our digital transformation efforts here in ICS Digital."
        },
        {
            "text": "Each session was designed to be accessible to all staff, ensuring that everyone had the opportunity to enhance their digital skills. We collaborated with subject matter experts, internal and external speakers, and leveraged lived experiences to make the learning process engaging and relevant."
        },
        {
            "heading": 2,
            "text": "Fostering interdepartmental collaboration"
        },
        {
            "text": "Our series has led to significant interdepartmental collaboration. Each session reached far and wide within the Civil Service beyond our core user base. This increased levels of interest and participation in several xGov Working Groups and Networks, fosters a culture of shared learning, volunteering and collaboration."
        },
        {
            "text": "Adrian Davis – Frameworks and Standards Lead in Energy Security, Project Delivery Profession shared:"
        },
        {
            "text": "The success of our 2024 Digital Upskilling sessions underscores the importance of continuous learning and adaptation in the digital age."
        },
        {
            "text": "We are immensely proud of the progress we have made in upskilling our workforce and look forward to continuing our journey towards a digitally proficient and inclusive Civil Service. Thank you to everyone who participated and contributed to the success of our 2024 Digital Upskilling sessions."
        },
        {
            "text": "If you’re a UK Civil Servant interested in our future sessions, please join the thousands of colleagues already on our mailing list: https://forms.office.com/e/XxKdSVYS2B."
        },
        {
            "text": "Stay tuned for more initiatives as we continue to empower our digital journey."
        }
    ]
}