{
    "url": "https://space.blog.gov.uk/2024/09/11/new-projects-to-boost-earth-observation-data-capability/",
    "title": "New projects to boost Earth Observation data capability",
    "authors": [
        "UK Space Agency"
    ],
    "categories": [
        "Delivering Missions and Capabilities",
        "Earth observation",
        "Funding"
    ],
    "pub_date": "2024-09-11T15:35:09+01:00",
    "content": [
        {
            "text": "The UK Space Agency has announced two new projects to enhance Earth Observation Data Capability during the National Earth Observation Conference in York.  "
        },
        {
            "text": "Earth Observation is the collection, analysis and presentation of information about the planet’s  physical, chemical and biological systems using remote sensing technologies. Satellites, such as  Sentinel-2C which launched last week, carry these technologies into space.  "
        },
        {
            "text": "This new initiative is designed to bolster the UK’s standing in space-based data technologies, supporting innovative projects that enhance the capabilities of the UK space industry and unlock access to future commercial opportunities.    "
        },
        {
            "text": "The selected projects will develop tools and services that improve the accessibility, use and impact of Earth observation data across various sectors. These advancements will play a critical role in driving economic growth, enhancing public services and positioning the UK as a global leader in space-data. "
        },
        {
            "heading": 2,
            "text": "Earth-i Ltd: Multi-Sensor, Multi-Resolution Co-registration for Earth Observation (MuSeReCo) "
        },
        {
            "text": "Earth-i Ltd has been awarded just over £70,000 for its MuSeReCo projects, which focuses on enhancing the accuracy and interoperability of Earth observation data. This project will develop a tool that can automatically and accurately co-register data from multiple satellites, regardless of their formats, resolutions or geo-referencing standards.  "
        },
        {
            "text": "By using pixel-based change detection through machine learning, MuSeReCo will significantly improve Earth observation capabilities and in-demand services such as the automated surveillance of industrial sites, security and intelligence locations, ports and airfields. "
        },
        {
            "heading": 2,
            "text": "GMV NSL Limited: Data Processing as a Service  "
        },
        {
            "text": "GMV NSL Limited has been granted just over £16,000 for its “Data Processing as a Service” project, which aims to position the UK as a leader in the processing of Earth observation data.  "
        },
        {
            "text": "The planned services will intergrade automation, data fusion and cloud infrastructure, pushing the boundaries of midstream Earth observation capabilities."
        },
        {
            "text": "Beth Greenaway, Head of Earth Observation and Climate at the UK Space Agency, said: "
        }
    ]
}