{
    "url": "https://space.blog.gov.uk/2024/09/11/new-horizons-for-the-uk-in-space/",
    "title": "New Horizons for the UK in space",
    "authors": [
        "UK Space Agency"
    ],
    "categories": [
        "International"
    ],
    "pub_date": "2024-09-11T13:00:16+01:00",
    "content": [
        {
            "text": "A UK Space Agency delegation, led by Deputy CEO Chris White-Horne, visited Egypt to attend the New Space Horizons Conference for Africa & the Middle East in El Alamein. This was a valuable opportunity to engage with a growing, vibrant space ecosystem. The conference showcased national and regional ambitions, with a strong focus on using data from space to improve people’s lives."
        },
        {
            "text": "As well as participating on a panel discussing how to support emerging space nations, the delegation held numerous bilateral meetings with space agencies attending the conference. The UK also presented at the 10th meeting of the Arab Space Cooperation Group. The event offered useful insight into the unique ambitions of each country involved and highlighted various challenges, many of which are shared by all."
        },
        {
            "text": "Commenting on his engagements and the visit as a whole, Chris White-Horne said:"
        },
        {
            "text": "The delegation, which included representatives from the UK Space Agency’s International Relations and Data Applications teams, visited Space City in Cairo, home of the Egyptian Space Agency and the new headquarters of the African Space Agency, which was established in 2023. They were hosted by H.E. Dr Sherif Sedky, CEO of the Egyptian Space Agency, and were given a tour of the facilities and labs at the site. In a bilateral meeting, Dr Sedky discussed his agency’s achievements and ambitions in space and the launch of the National Space Academy, highlighting Egypt as a key player in space for the region."
        },
        {
            "text": "As well as meeting the National Authority for Remote Sensing and Space Science in Cairo, the delegation spent time understanding the context and history of the UK’s relationship with Egypt. HM Ambassador to Egypt, Gareth Bayley and HM Trade Commissioner for Africa, John Humphrey, welcomed the delegation. They emphasised the opportunity that collaboration in space brings to deepening ties across Africa and into the Middle East, opening new avenues for cooperation."
        },
        {
            "text": "Ambassador Gareth Bayley said:"
        },
        {
            "text": "When astronauts and satellites look down at the Earth, there are no borders. Space is a global endeavour, and this visit to Egypt strengthened key relationships that can lead to the development of new capabilities and trade opportunities, and benefit people’s lives across the world."
        }
    ]
}