{
    "url": "https://buyingforschools.blog.gov.uk/2024/09/11/schools-and-trusts-can-now-list-all-roles-on-teaching-vacancies-and-find-a-job/",
    "title": "Schools and trusts can now list all roles on Teaching Vacancies and Find a Job",
    "authors": [
        "Will Bourke, Outreach and Engagement Manager, Teaching Vacancies"
    ],
    "categories": [
        "Advice and support"
    ],
    "pub_date": "2024-09-11T12:45:37+01:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "Will Bourke from the Teaching Vacancy Service explains in this blog about the improvements made to the service, which means schools and trusts can now list all of their vacancies, including school business professional roles, for free."
        },
        {
            "text": "We’ve listened to your feedback, and I’m pleased to say that schools and trusts can now list all their roles on Teaching Vacancies, such as administration roles, cleaning and catering staff, site managers and school business managers. And if schools and trusts list their vacancies directly on the service, their roles will automatically be shared to Find a job – GOV.​UK."
        },
        {
            "text": "Since 2019 schools and trusts have been saving thousands of pounds and filling their teaching, leadership and classroom support roles by using Teaching Vacancies, the Department for Education’s free national recruitment service for state funded schools in England."
        },
        {
            "text": "Following demand from schools for Teaching Vacancies to extend its scope, vacancies listed on the service now includes roles in:"
        },
        {
            "text": "Since March, over 5,500 support staff roles have been viewed by jobseekers over 650,000 times. So don’t miss out – if your vacancies aren’t listed, publish them on Teaching Vacancies today!"
        },
        {
            "text": "Attracting more candidates to support roles on Teaching Vacancies"
        },
        {
            "text": "Teaching Vacancies is committed to supporting schools with their recruitment. As well as saving schools money on recruitment advertising, the service is now saving school hiring staff time in posting vacancies, helping to streamline recruitment, and doing it all at no cost – helping to put money back into the classroom."
        },
        {
            "text": "The service is now working with the Department for Work and Pensions’ Find a job – GOV.​UK service. All job roles posted directly on Teaching Vacancies will automatically be shared to Find a Job. This means roles on Teaching Vacancies will reach many more relevant jobseekers."
        },
        {
            "text": "Partners such as Unison are working with Teaching Vacancies and promoting opportunities available on the service. Content from Unison has been shared with work coaches in local Job Centres to help them understand the skills required to fill support roles and encourage people seeking work to consider jobs in schools."
        },
        {
            "text": "Once the service has built up a picture of jobs listed by schools and how these roles are being filled, the department will look at what additional marketing is required to help schools fill support roles through Teaching Vacancies."
        },
        {
            "text": "We have worked, and will continue to work closely with the sector who have welcomed this new development:"
        },
        {
            "text": "Teaching Vacancies also plans to make sure that the service is one of top results when jobseekers search online for the roles they are looking for."
        },
        {
            "text": "Is your school missing out?"
        },
        {
            "text": "Teacher Vacancies had 320,000 average monthly visits by jobseekers and over 8 million vacancy views in AY23/24, Teaching Vacancies is the service to help your school recruit and save thousands at the same time."
        },
        {
            "text": "87% of schools are now signed up to use Teaching Vacancies and since 2019, schools have listed over 240,000 vacancies on the service."
        },
        {
            "text": "The service continues to iterate and improve based on school and jobseeker needs."
        },
        {
            "text": "Teaching Vacancies has several features to support schools with their recruitment. Schools can use the service’s fully Keeping Children Safe in Education compliant application form. Schools and trusts can promote their organisations by creating a School Profile, and trusts and local authorities can reduce time spent listing vacancies through MAT and LA Access."
        },
        {
            "text": "For further information contact teaching.vacancies@service.education.gov.uk"
        },
        {
            "text": "If you’ve found this article useful and want to learn more about how we’re supporting schools, click ‘sign up and manage updates’ to subscribe to our blog and receive notifications when we next post."
        }
    ]
}