{
    "url": "https://food.blog.gov.uk/2024/09/11/the-effect-of-covid-19-prevention-measures-on-infectious-intestinal-diseases/",
    "title": "The effect of COVID-19 prevention measures on Infectious Intestinal Diseases",
    "authors": [
        "Darren Holland, Lead Operational Research Adviser"
    ],
    "categories": [
        "Science"
    ],
    "pub_date": "2024-09-11T14:33:15+01:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "COVID-19 (C19) changed many of our eating habits and behaviours. It also provided a unique opportunity for us to study how restrictions influenced the transmission of Infectious Intestinal Disease (IID). "
        },
        {
            "heading": 2,
            "text": "Background on IID"
        },
        {
            "text": "We recently published two reports which investigated how Infectious Intestinal Disease was impacted by COVID-19 prevention measures and the associated changes in behaviour. A series of online surveys, carried out over five waves, showed notable results including that eating food purchased from takeaways had a consistent association with increased risk of Infectious Intestinal Disease."
        },
        {
            "text": "Infectious Intestinal Disease (IID, also referred to as gastroenteritis) is a common cause of illness with an estimated 18 million cases per year. It can be caused by a number of different pathogens including Campylobacter, Salmonella, Listeria monocytogenes, Shiga toxin-producing Escherichia coli (STEC) and norovirus. It can be acquired through a range of sources such as food, person to person contact and water."
        },
        {
            "text": "Previous research has shown how confirmed cases of IID related illness from a range of different pathogens (e.g. Campylobacter, Salmonella and norovirus) declined during the COVID-19 pandemic. However, these papers were unable to determine how much of these reductions were real and how much were an artefact of fewer people either seeking or able to access medical care during the pandemic. Or, if they did contact their GPs, they may have been less likely to submit samples considering other pressures on the testing laboratories during this period."
        },
        {
            "heading": 2,
            "text": "The surveys"
        },
        {
            "text": "After the start of the pandemic, it was clear that many of the COVID-19 prevention measures and the resulting changes in behaviours, (such as contact with other people, eating out and handwashing), could also impact IID. This meant we had an opportunity to test their associations with IID."
        },
        {
            "text": "We commissioned five online surveys (one each for adults and children) at different points of the pandemic. These asked questions about whether the respondent had symptoms such as vomiting or diarrhoea, associated with IID, during the previous 28 days (additional questions were also asked to test if the illness was likely to be IID). Another set of questions on behaviours which may affect IID were given to both people who were likely to have had IID, as well as to comparison groups who did not have IID. These behaviours included leaving the house, going to work/school, use of public transport, eating food from different food business types and frequency of hand washing."
        },
        {
            "text": "The two reports published today examine the association between behaviours and IID. The first was produced by the contractor, Ipsos UK, and the second by the Food Standards Agency (FSA). The work was jointly funded by the FSA and Food Standards Scotland (FSS). In addition, we are publishing the associated datasets so that they are available for further research."
        },
        {
            "heading": 2,
            "text": "The findings"
        },
        {
            "text": "For both adults and children, estimated IID rates increased as COVID-19 restrictions eased. The first wave of the survey for adults ran in August/September 2020 and had a rate of 5.6% compared to a rate of 7.8% in the fourth wave, which ran over the same period the following year. Similarly, the second wave run in December 2020 had a lower rate (5.7%) than the fifth wave (6.5%) conducted in December 2021."
        },
        {
            "text": "For children, the rate from wave 1 was 6.4% compared to 7.2% for wave 4, and 8.1% for wave 2 compared 12.7% in wave 5. This wave was conducted slightly later than the wave 5 adults’ survey in February/March 2022. Details of the full set of restrictions in place in each wave can be found in the reports, but some differences between waves were:"
        },
        {
            "text": "From the adult data, one behaviour was found to be associated with a higher likelihood of getting IID in all five waves (each wave was analysed separately). This was:"
        },
        {
            "text": "There were two additional behaviours which were associated with higher likelihood of IID in four out of the five waves. These were:"
        },
        {
            "text": "All three of these behaviours were also among those associated with IID in the combined analysis using data from all five waves. Other behaviours that were selected in the all-wave analysis were: eating from meal delivery services, consumption of food prepared in somebody else’s house, adults living with children in the same household who attended school and the use of public transport."
        },
        {
            "text": "For the children’s analysis, there were few behaviours selected in the analysis for the individual waves. Those that were selected only featured in one of the five waves. When we combined the data from all five waves the strongest effects were: use of public transport more than weekly; anybody leaving the house; and children eating ready to eat food outside of schools or childcare."
        },
        {
            "heading": 2,
            "text": "Implications"
        },
        {
            "text": "While the reports stress that the analysis shows associations between these behaviours and IID (rather than proof of cause) they do support other evidence in this area, particularly the results relating to takeaways. While this association may not just be due to food served in takeaways (for instance it could be due to mixing with other people), takeaways are known to have, on average, lower Food Hygiene Ratings (FHRS) than other premises types."
        },
        {
            "text": "As of the end of March 2024, 93.9% of takeaways were assessed as broadly compliant with food hygiene standards in England, Wales and Northern Ireland compared to 96.9% of all food premises that sell directly to the public, e.g. restaurants, retailers and schools. 58.2% of takeaways received the top FHRS score of 5 compared to 76.3% of all consumer-facing food premises. Previous research has found an association between FHRS and food safety."
        },
        {
            "text": "The findings from this latest analysis would seem to emphasise the need to maintain high standards of food hygiene across all business types, including takeaways."
        },
        {
            "text": "If you would like to learn more about the reports and datasets, you can explore them here:"
        },
        {
            "heading": 1,
            "text": "Effaith mesurau atal COVID-19 ar glefydau perfeddol heintus"
        },
        {
            "text": "Newidiodd COVID-19 lawer o’n harferion a’n hymddygiad bwyta. Roedd hefyd yn gyfle unigryw i ni astudio sut y dylanwadodd cyfyngiadau ar drosglwyddo clefydau perfeddol heintus."
        },
        {
            "heading": 2,
            "text": "Cefndir"
        },
        {
            "text": "Gwnaethom gyhoeddi dau adroddiad yn ddiweddar a oedd yn ystyried sut y gwnaeth mesurau atal COVID-19 a’r newidiadau cysylltiedig mewn ymddygiadau effeithio ar glefydau perfeddol heintus. Dangosodd cyfres o arolygon ar-lein, a gynhaliwyd dros bum cylch, ganlyniadau nodedig, gan gynnwys bod yna gysylltiad cyson rhwng bwyta bwyd o siopau tecawê a risg uwch o glefyd perfeddol heintus."
        },
        {
            "text": "Mae clefyd perfeddol heintus (y cyfeirir ato hefyd fel gastroenteritis) yn achos cyffredin o salwch, ac amcangyfrifir bod 18 miliwn o achosion y flwyddyn. Gall gael ei achosi gan nifer o bathogenau gwahanol, gan gynnwys Campylobacter, Salmonela, Listeria monocytogenes, Escherichia coli sy’n cynhyrchu shigatocsin (STEC) a norofeirws. Gellir ei ddal drwy amrywiaeth o ffynonellau fel bwyd, dŵr ac wrth gyffwrdd â rhywun arall sydd wedi’i heintio."
        },
        {
            "text": "Mae ymchwil flaenorol wedi dangos sut yr oedd achosion a gadarnhawyd o salwch cysylltiedig â chlefydau perfeddol heintus o amrywiaeth o wahanol bathogenau (er enghraifft, Campylobacter, Salmonela a norofeirws) wedi gostwng yn ystod pandemig COVID-19. Fodd bynnag, nid oedd y papurau hyn yn gallu pennu i ba raddau roedd y gostyngiadau hyn yn rhai go iawn, ac i ba raddau roeddent o ganlyniad i lai o bobl naill ai’n ceisio neu’n gallu cael mynediad at ofal meddygol yn ystod y pandemig. Neu, os gwnaethant gysylltu â’u Meddyg Teulu, efallai eu bod wedi bod yn llai tebygol o gyflwyno samplau o ystyried pwysau eraill ar y labordai profi yn ystod y cyfnod hwn."
        },
        {
            "heading": 2,
            "text": "Yr arolygon"
        },
        {
            "text": "Ar ôl i’r pandemig ddechrau, roedd yn amlwg y gallai llawer o’r mesurau atal COVID-19 a’r newidiadau dilynol mewn ymddygiadau, (fel cyswllt â phobl eraill, bwyta allan a golchi dwylo), effeithio ar glefydau perfeddol heintus hefyd. Roedd hyn yn gyfle i brofi eu cysylltiadau â chlefydau perfeddol heintus."
        },
        {
            "text": "Gwnaethom gomisiynu pum arolwg ar-lein (un ar gyfer oedolion ac un ar gyfer plant) ar wahanol adegau o’r pandemig. Roedd yr arolygon yn gofyn a oedd y sawl sy’n ymateb wedi profi symptomau fel chwydu neu ddolur rhydd, yn gysylltiedig â chlefydau perfeddol heintus, yn ystod y 28 diwrnod blaenorol (gofynnwyd cwestiynau ychwanegol hefyd i brofi a oedd y salwch yn debygol o fod yn glefyd perfeddol heintus). Gofynnwyd set arall o gwestiynau ar ymddygiadau a allai effeithio ar glefydau perfeddol heintus i bobl a oedd yn debygol o fod wedi cael clefyd perfeddol heintus, yn ogystal ag i grwpiau cymharu nad oedd ganddynt glefydau perfeddol heintus. Roedd yr ymddygiadau hyn yn cynnwys gadael y tŷ, mynd i’r gwaith/ysgol, defnyddio trafnidiaeth gyhoeddus, bwyta bwyd o wahanol fathau o fusnesau bwyd a pha mor aml y maent yn golchi eu dwylo."
        },
        {
            "text": "Mae’r ddau adroddiad yn archwilio’r cysylltiad rhwng ymddygiadau a chlefydau perfeddol heintus. Cynhyrchwyd y cyntaf gan y contractwr, Ipsos United Kingdom (UK), a’r ail gan yr Asiantaeth Safonau Bwyd (ASB). Ariannwyd y gwaith ar y cyd gan yr ASB a Safonau Bwyd yr Alban (FSS).Yn ogystal, rydym yn cyhoeddi’r setiau data cysylltiedig fel eu bod ar gael ar gyfer ymchwil bellach."
        },
        {
            "heading": 2,
            "text": "Canfyddiadau"
        },
        {
            "text": "Ar gyfer oedolion a phlant, cynyddodd cyfraddau clefydau perfeddol heintus amcangyfrifedig wrth i gyfyngiadau COVID-19 gael eu llacio. Cynhaliwyd cylch cyntaf yr arolwg ar gyfer oedolion ym mis Awst/Medi 2020, ac roedd ganddo gyfradd ymateb o 5.6%. Mae hyn o gymharu â chyfradd ymateb o 7.8% ar gyfer y pedwerydd cylch, a gynhaliwyd dros yr un cyfnod y flwyddyn ganlynol. Yn yr un modd, roedd y gyfradd ymateb ar gyfer yr ail gylch a gynhaliwyd ym mis Rhagfyr 2020 yn is (5.7%) na’r pumed cylch (6.5%) a gynhaliwyd ym mis Rhagfyr 2021. Ar gyfer plant, y gyfradd ymateb ar gyfer cylch 1 oedd 6.4% o gymharu â 7.2% ar gyfer cylch 4, ac 8.1% ar gyfer cylch 2 o gymharu â 12.7% ar gyfer cylch 5. Cynhaliwyd y cylch hwn ychydig yn hwyrach nag arolwg cylch 5 i oedolion ym mis Chwefror/Mawrth 2022. Mae manylion y rhestr lawn o gyfyngiadau a oedd ar waith yn ystod pob cylch i’w gweld yn yr adroddiadau, ond dyma rai gwahaniaethau rhwng y cylchoedd:"
        },
        {
            "text": "O’r data ar oedolion, canfuwyd bod un ymddygiad yn gysylltiedig â thebygolrwydd uwch o gael clefyd perfeddol heintus ym mhob un o’r pum cylch (dadansoddwyd pob cylch ar wahân), sef:"
        },
        {
            "text": "Roedd dau ymddygiad ychwanegol a oedd yn gysylltiedig â thebygolrwydd uwch o gael clefyd perfeddol heintus mewn pedwar o’r pum cylch, sef:"
        },
        {
            "text": "Roedd y tri ymddygiad hyn hefyd ymhlith y rhai a oedd yn gysylltiedig â chlefydau perfeddol heintus yn y dadansoddiad cyfunol gan ddefnyddio data o bob un o’r pum cylch. Ymddygiadau eraill a ddewiswyd yn y dadansoddiad cyfunol oedd: bwyta o wasanaethau dosbarthu prydau bwyd, bwyta bwyd a baratowyd yn nhŷ rhywun arall, oedolion yn byw gyda phlant yn yr un cartref a oedd yn mynd i’r ysgol a defnyddio trafnidiaeth gyhoeddus."
        },
        {
            "text": "Ar gyfer y dadansoddiad o ddata plant, ychydig o ymddygiadau a ddewiswyd yn y dadansoddiad ar gyfer y cylchoedd unigol. Roedd y rhai a ddewiswyd yn ymddangos yn un o’r pum cylch yn unig. Pan gyfunwyd y data o bob un o’r pum cylch, yr effeithiau cryfaf oedd: defnyddio trafnidiaeth gyhoeddus fwy nag unwaith yr wythnos; unrhyw un yn gadael y tŷ; a phlant sy’n bwyta bwyd parod i’w fwyta y tu allan i ysgolion neu ofal plant."
        },
        {
            "heading": 2,
            "text": "Goblygiadau"
        },
        {
            "text": "Er bod yr adroddiadau’n pwysleisio bod y dadansoddiad yn dangos cysylltiadau rhwng yr ymddygiadau hyn a chlefydau perfeddol heintus (yn hytrach na phrofi’r achos), maent yn cefnogi tystiolaeth arall yn y maes hwn, yn enwedig y canlyniadau sy’n ymwneud â siopau tecawê. Er nad yw’r cysylltiad hwn o bosib oherwydd y bwyd a weinir mewn siopau tecawê yn unig (er enghraifft, gallai fod oherwydd cymysgu â phobl eraill), mae’n hysbys bod gan siopau tecawê, ar gyfartaledd, sgoriau hylendid bwyd is na mathau eraill o safleoedd. Ar ddiwedd mis Mawrth 2024, aseswyd bod 93.9% o siopau tecawê yn cydymffurfio’n fras â safonau hylendid bwyd yng Nghymru, Lloegr a Gogledd Iwerddon o gymharu â 96.9% o bob safle bwyd sy’n gwerthu’n uniongyrchol i’r cyhoedd, er enghraifft, bwytai, manwerthwyr ac ysgolion. Llwyddodd 58.2% o siopau tecawê i gael y sgôr uchaf o 5 o gymharu â 76.3% o’r holl safleoedd bwyd sy’n gweini bwyd i ddefnyddwyr. Mae ymchwil flaenorol wedi canfod cysylltiad rhwng y Cynllun Sgorio Hylendid Bwyd a diogelwch bwyd. Mae’n ymddangos bod canfyddiadau’r dadansoddiad diweddaraf hwn yn pwysleisio’r angen i gynnal y safonau uchel ar gyfer hylendid bwyd ar draws pob math o fusnes, gan gynnwys siopau tecawê."
        },
        {
            "text": "Os hoffech ddysgu mwy am yr adroddiadau a’r setiau data, gallwch eu darllen yma:"
        }
    ]
}