{
    "url": "https://digitaltrade.blog.gov.uk/2025/02/24/growing-as-a-data-leader-through-a-temporary-promotion/",
    "title": "Growing as a data leader through a temporary promotion",
    "authors": [
        "Leonardo Mazzone - Senior Data Scientist"
    ],
    "categories": [
        "People"
    ],
    "pub_date": "2025-02-24T10:49:18+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Leonardo Mazzone"
        },
        {
            "heading": 3,
            "text": "Expressions of Interest"
        },
        {
            "text": "When a role becomes vacant at the Department for Business and Trade (DBT) and it needs to be urgently filled, it is possible to issue an “Expression of Interest” (EOI). This means we can recruit an existing DBT colleague to cover the position for a fixed term at the same grade (level transfer) or as a temporary promotion. At the end of the EOI term, the position needs to be re-opened so that anyone inside and outside the department can apply. "
        },
        {
            "text": "This is a standard procedure across the Civil Service. It allows us to solve the short-term problem of covering a role in a more streamlined way than a lengthy recruitment process. It can also be a unique opportunity for the successful EOI candidate. They can try something different for a period of time and either bring the experience back to their previous role, or “take a shot” at making the change permanent.  "
        },
        {
            "text": "This is the position I found myself in. At the end of 2023, our Data Analysis and Data Science teams had grown so that each would need a dedicated Head of Profession.  This created the need for a Head of Data Analysis. At the time I had become increasingly involved in activities that were less technical and more leadership-oriented, so I applied to the EOI, with very few expectations. On my first day of work in January 2024, our Chief Data Officer told me that I had been successful and that we’d be enacting my transition as soon as possible. "
        },
        {
            "heading": 3,
            "text": "Moving to a new team"
        },
        {
            "text": "The first thing that surprised me of the process was the rapidity with which I moved to my new role. In 2 intense weeks I worked with my very patient colleagues to hand over the projects I had been leading and say my (temporary) goodbyes. At the same time, I got introduced to the team I’d be managing and started learning about the details of their work and its context. I had to very quickly shift from writing code and analysing data, to helping my new team navigate some of their current challenges.  "
        },
        {
            "text": "The data analysts in DDaT (Digital, Data & Technology) play a core role in DBT: they are not just involved (as you might have guessed) in analysing data. They support Data Workspace (our platform for holding, governing, and analysing data) by helping others onboard new data sources to the platform. They also assist DBT staff in using Data Workspace tools to interrogate and manipulate data (like SQL, and the Python and R programming languages, or AWS QuickSight for creating data dashboards)."
        },
        {
            "text": "This means responding to user support queries, running drop-in sessions and bootcamps to deliver training. The data analysts can work embedded in other teams to deliver pieces of work (like monitoring and reporting capabilities). They upskill colleagues so they can look after analytical products like dashboards once the data analysts step away. The work of the data analysts is thus varied and critical to the success of Data Workspace. It combines technical specialism with communication and stakeholder engagement skills. "
        },
        {
            "heading": 3,
            "text": "Helping the team cope with demand"
        },
        {
            "text": "The most urgent challenge we were facing as a team was a very high demand on our resources. DBT was created in 2023 by merging 2 departments. This meant that Data Workspace, originally created by the former Department for International Trade, saw a sudden increase in the number of potential users, data and analytical assets. We had to help users migrate and learn about the new platform, as well as support analytically other activities related to the establishment of DBT. This added to the team’s existing workload, which created stress for team members and risked making our backlog unmanageable. "
        },
        {
            "text": "To solve our demand pressures, the first things we actioned were: "
        },
        {
            "text": "I then could move to expanding the team’s resources. I recruited new permanent data analysts and leveraged available contracts in DDaT to get some temporary help. At one point, the team doubled in size, which gave us the impetus to bring our backlog under control. Once we were confident that we’d made the position of the team sustainable, we scaled back our resources to ensure best use of money. "
        },
        {
            "heading": 3,
            "text": "Improving the pipeline of work"
        },
        {
            "text": "Our second challenge was that, as part of our support work, we were spending too much time dealing with simple user requests that were manual and repetitive to address. This was affecting team morale and reducing our ability to work on higher-value and more specialised tasks. "
        },
        {
            "text": "We worked closely with the team responsible for Data Workspace to implement features that allowed users to help themselves quickly. This meant that they did not have to rely on our team, which was a win-win solution. At the same time, we engaged other professions, like data engineers, to improve the user support model and share these responsibilities more fairly. Finally, we removed data analysts from the front-line. We assigned a dedicated resource to triaging and answering queries.  We only escalated to data analysts or engineers for the more technically involved user problems. "
        },
        {
            "text": "DDaT in DBT uses a “matrix model”, where portfolios manage workstreams and own business and user problems. They collaborate with professions (by providing resources and expertise in their technical areas) to deliver all our work. "
        },
        {
            "text": "As Head of Profession, I engaged with portfolio leaders to understand current and future needs for data analysis, and ensure we could meet them to the best of our ability. Thanks to our extra capacity, we could be more proactive in engaging DDaT and the whole department, to help them identify areas where we could help. This also created the opportunity for our data analysts to invest in their technical development. For example, they picked up tasks that required coding, or more sophisticated approaches to analysing data. "
        },
        {
            "text": "We also liberated resources from our more senior data analysts, by giving team members the opportunity to improve their skills in other areas, such as line management. "
        },
        {
            "heading": 3,
            "text": "What I got from this experience"
        },
        {
            "text": "As well as these changes, there were many more things I worked on in just 9 months. For instance: I contributed to a new data strategy for the department and coordinated an away day for all the data professions and portfolios. I also led a cross-government effort to improve the job description of data analysts in DDaT. Being given the opportunity to step so far outside my comfort zone is an invaluable feature of the EOI process. It also speaks to the quality of our leadership in DDaT. They are open to giving their staff a chance to grow and give them autonomy and trust to take on new responsibilities. "
        },
        {
            "text": "One of the big changes in my role was that the value of my work was measured by what the whole team was achieving rather than my individual contribution. The benefit of my actions was often delayed or indirect, but no less valuable. This was one of the reasons why it was so useful for me to re-build a support network by creating a rapport with other data leaders. Their experiences and challenges were now aligned with mine. "
        },
        {
            "text": "Another thing I learnt was to balance my contribution in leading and shaping the team with the involvement of all data analysts over important decisions and changes. I could offer my team a unique perspective thanks in part to my connection with other data leaders. However, the perspective of each individual team member was as essential in finding the best way forward.  "
        },
        {
            "text": "Finally, a lot of what I could offer the team was mediating with stakeholders and other leaders and helping to ensure a sustainable pace of work. I removed blockers in the team’s way, and helped their voices get heard. In other words, be an “enabler” as much, if not more, than a “doer”. "
        },
        {
            "text": "While loving the time I spent as Head of Profession, I decided that a more technical role was a better fit for me at this point in my career. The flexibility of the EOI arrangement allowed me to return to my previous role. I felt enriched by the skills and many lessons I picked up along the way, as well as the relationships and network I built at the senior level. "
        }
    ]
}