{
    "url": "https://rpc.blog.gov.uk/2025/02/24/too-many-impact-assessments-are-submitted-late/",
    "title": "Too many Impact Assessments are submitted late",
    "authors": [
        "Stephen Gibson"
    ],
    "categories": [
        "Better regulation",
        "Independent scrutiny"
    ],
    "pub_date": "2025-02-24T12:36:53+00:00",
    "content": [
        {
            "text": "The Government’s Better Regulation Framework (BRF) is designed to ensure that Ministers, and subsequently Parliament, have robust evidence and analysis of the impacts of new regulations before they are introduced. However too often departments have not been submitting Impact Assessments (IAs) in time to allow independent scrutiny of the evidence and analysis before it is submitted to Parliament – sometimes the Bill is in Parliament before we receive the IA."
        },
        {
            "text": "The issue of IAs being submitted late was raised with the House of Lords’ Secondary Legislation Scrutiny Committee back in 2022 and commented on in their report Losing Impact: Why the Government’s impact assessment system is failing Parliament and the public. Following the report, the RPC made a commitment to publish a ‘statement of lateness’ on our website whenever a legislative measure reached Parliament without an RPC opinion that should have been published alongside it."
        },
        {
            "text": "We had hoped that this would encourage better behaviour, but actually there has, if anything, been an increase in the number of late IAs. A list of RPC lateness statements is here.  We have just added to that page a new summary spreadsheet that shows that many departments have been guilty of this and disappointingly our sponsoring department, the Department for Business and Trade (DBT) is currently the worst offender, with four late IAs."
        },
        {
            "text": "The issue was happening before the election, suggesting legislation was being brought forward hastily by the previous Government, but it has not improved since then, or since the switch to the new BRF where opinions really should be being sought well ahead of measures reaching Parliament."
        },
        {
            "text": "A number of the most recent statements are associated with legislation being taken forward by the Government under the ‘urgent measures procedure’. While we understand the political reasons for wanting to move forward quickly with new legislation (particularly where it relates to a manifesto commitment), it remains the case that the BRF is there to ensure that there is a proper evidence base underpinning regulatory proposals and to alert Ministers and Parliament if this is not the case – which it cannot do if the IA is submitted too late."
        },
        {
            "text": "We hope that things will improve in future. We will continue to publish statements of lateness and also highlight other occasions where departments fail to meet the requirements of the BRF."
        }
    ]
}