{
    "url": "https://nationalscreening.blog.gov.uk/2025/02/24/what-role-do-local-public-health-teams-play-in-screening/",
    "title": "What role do local public health teams play in screening?",
    "authors": [
        "Steve Senior",
        "Shenna Paynter"
    ],
    "categories": [
        "General"
    ],
    "pub_date": "2025-02-24T08:48:01+00:00",
    "content": [
        {
            "text": "Nationally, the roles and responsibilities for screening programmes are clear: government ministers make policy decisions on advice from the UK National Screening Committee (UK NSC). The NHS in each UK nation is responsible for delivering national screening programmes."
        },
        {
            "text": "Locally and regionally in England, most screening programmes are commissioned by NHS England (NHSE) and provided by a range of healthcare organisations."
        },
        {
            "text": "On the face of it, this leaves little role for the public health teams based in local government and led by directors of public health (DsPH). However, DsPH have an overarching responsibility for the health of their population. This covers the full range of public health activity, from helping to make the places we live healthier, to responding to outbreaks of infectious disease, to the delivery of healthcare services. This includes screening programmes."
        },
        {
            "text": "The Director of Public Health statutory responsibilities describe this role as ‘providing appropriate challenge to arrangements for screening and immunisation programmes, advocating for an emphasis on reducing health inequalities and improving access for underserved groups’."
        },
        {
            "text": "This role involves:"
        },
        {
            "heading": 2,
            "text": "Assurance group brings partners together"
        },
        {
            "text": "Different local authorities will approach this assurance role slightly differently. In Bury, we have set up a screening assurance group. This group brings together commissioners and providers of screening programmes with local primary care and voluntary sector representatives, primary care commissioners, Healthwatch, and the local public health team, which chairs the meeting. The group feeds into the Council’s Health Protection Board."
        },
        {
            "text": "The screening assurance group’s work in relation to the national NHS screening programmes includes:"
        },
        {
            "text": "We also have an important role to play in advising politicians and commissioners on the advisability of screening initiatives and proposals that are not part of UK NSC-recommended national programmes. This includes:"
        },
        {
            "text": "At its heart, the role of public health teams in screening is about partnership working, bringing together the expertise of a wide range of stakeholders. These relationships are essential to enable the mix of constructive challenge and support described in the director of public health statutory responsibilities."
        },
        {
            "heading": 2,
            "text": "Keep up to date "
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK NSC. You can register to receive updates direct to your inbox, so there is no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, please email uknsc@dhsc.gov.uk. "
        }
    ]
}