{
    "url": "https://food.blog.gov.uk/2023/07/27/chairs-stakeholder-update-call-for-evidence-on-new-free-trade-agreement/",
    "title": "Chair's stakeholder update - Call for evidence on new free trade agreement",
    "authors": [
        "Professor Susan Jebb, FSA Chair"
    ],
    "categories": [
        "Our mission"
    ],
    "pub_date": "2023-07-27T13:22:13+01:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "Since leaving the EU, the Food Standards Agency (FSA) alongside Food Standards Scotland (FSS), has had an important role to play in scrutinising new free trade agreements (FTAs) being negotiated around the world by the UK government."
        },
        {
            "text": "We are responsible for examining what the new agreements mean for the statutory protections in place for food safety and nutrition in the UK."
        },
        {
            "text": "Earlier this month, the Secretary of State for International Trade commissioned the FSA and FSS to provide advice on the Comprehensive and Progressive Agreement for Trans-Pacific Partnership (CPTPP), a trade agreement between eleven countries which the UK accessed on 16 July. The UK is the first non-founding member to join the bloc."
        },
        {
            "text": "The FSA and FSS have already begun work to produce this advice and launched an open call for evidence on 24 July to gather stakeholders’ views. We’re keen to hear from consumers groups, businesses, and other interested parties to help us build as comprehensive a picture as possible. This work follows similar advice for previous trade deals including FTAs for Australia and New Zealand."
        },
        {
            "text": "In addition to our work on FTAs, we’re supporting new global trade opportunities by providing risk assessments of products and countries that want to start importing to the UK. We’re also demonstrating our own food safety arrangements to countries looking to import food from the UK."
        },
        {
            "text": "There is an important global trade in food which depends on trust in international food standards. We want to continue to ensure that people in the UK can trust the food we import and that people around the world maintain their confidence in the high food standards of food produced in the UK."
        },
        {
            "text": "If you would like to share your views on the potential impact of the CPTPP you can get in touch at FTAscrutiny@food.gov.uk in the format set out by the Call for Evidence. Responses are sought by 10 September 2023."
        },
        {
            "heading": 1,
            "text": "Galw am dystiolaeth ar gytundeb masnach rydd newydd"
        },
        {
            "text": "Ers ymadael â’r UE, mae’r Asiantaeth Safonau Bwyd (ASB) ochr yn ochr â Safonau Bwyd yr Alban, wedi chwarae rhan bwysig yn y gwaith o graffu ar y cytundebau masnach rydd newydd sy’n cael eu cytuno ledled y byd gan lywodraeth y DU."
        },
        {
            "text": "Ni sy’n gyfrifol am archwilio’r hyn y mae’r cytundebau newydd yn ei olygu i’r mesurau diogelu statudol sydd ar waith ar gyfer diogelwch bwyd a maeth yn y DU."
        },
        {
            "text": "Yn gynharach y mis hwn, comisiynwyd yr ASB a Safonau Bwyd yr Alban gan yr Ysgrifennydd Gwladol dros Fasnach Ryngwladol i ddarparu cyngor ar Bartneriaeth Gynhwysfawr a Blaengar y Môr Tawel (CPTPP), sef cytundeb masnach rhwng un ar ddeg o wledydd y daeth y DU yn rhan ohono ar 16 Gorffennaf. Y DU yw’r aelod cyntaf nad yw’n un o’r sylfaenwyr i ymuno â’r bloc."
        },
        {
            "text": "Mae’r ASB a Safonau Bwyd yr Alban eisoes wedi dechrau ar y gwaith o lunio’r cyngor hwn ac, ar 24 Gorffennaf, lansiwyd galwad agored am dystiolaeth i gasglu safbwyntiau rhanddeiliaid. Rydym yn awyddus i glywed gan grwpiau defnyddwyr, busnesau, a phartïon eraill sydd â buddiant i’n helpu i greu darlun mor gynhwysfawr â phosib. Mae’r gwaith hwn yn dilyn cyngor tebyg ar gyfer cytundebau masnach blaenorol gan gynnwys Cytundebau Masnach Rydd ar gyfer Awstralia a Seland Newydd."
        },
        {
            "text": "Yn ogystal â’n gwaith ar Gytundebau Masnach Rydd, rydym yn cefnogi cyfleoedd masnachu byd-eang newydd trwy ddarparu asesiadau risg ar gyfer cynhyrchion a gwledydd sydd eisiau dechrau mewnforio i’r DU. Rydym hefyd yn dangos ein trefniadau diogelwch bwyd ein hunain i wledydd sydd am fewnforio bwyd o’r DU."
        },
        {
            "text": "Mae’r fasnach fwyd fyd-eang yn hollbwysig, ac yn dibynnu ar ymddiriedaeth mewn safonau bwyd rhyngwladol. Rydym am barhau i sicrhau y gall pobl yn y DU ymddiried yn y bwyd rydym yn ei fewnforio a bod pobl ledled y byd yn gallu parhau i fod â hyder yn safonau bwyd uchel y bwyd a gynhyrchir yn y DU."
        },
        {
            "text": "Os hoffech fynegi barn ar effaith bosib y CPTPP, cysylltwch â FTAscrutiny@food.gov.uk yn y fformat a nodir gan yr Alwad am Dystiolaeth yn y ddolen uchod. Gofynnir am ymatebion erbyn 10 Medi 2023."
        }
    ]
}