{
    "url": "https://socialworkwithadults.blog.gov.uk/2023/07/27/everyone-needs-that-loving-feeling-and-training/",
    "title": "Everyone needs that loving feeling (and training)",
    "authors": [
        "Lyn Romeo",
        "Dr Claire Bates"
    ],
    "categories": [
        "Education and training",
        "Guidance",
        "Knowledge and skills",
        "LGBTQ+",
        "Our profession",
        "Safeguarding",
        "Society"
    ],
    "pub_date": "2023-07-27T16:10:08+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Expressing sexuality in safety"
        },
        {
            "text": "Supported Loving is a national network promoting best practice surrounding sexuality and intimate relationship support within social care, an essential area of work that has historically seldom been recognised in guidance and legislation."
        },
        {
            "text": "The Care Act (2014) established the “wellbeing principle” with reduction of isolation highlighted as an eligible need, including supporting personal relationships. CQC’s guidance Relationships and sexuality in adult social care services (2019) was the first formal regulatory guidance to outline the expected role of social care staff."
        },
        {
            "text": "The Care Act is based on a principle of prevention, believing that it is better to take action before someone is hurt. CQC’s report Promoting sexual safety through empowerment (2020) examined sexual incidents within social care across all groups of people who access it. CQC found that sex remains a ‘taboo’ subject, with a resistance to discuss and raise concerns, leaving people vulnerable to abuse."
        },
        {
            "text": "Inappropriate or abusive behaviours are sometimes ignored or normalised, which negatively impacts wellbeing. CQC concluded that staff are anxious to address issues due to uncertainty, fear of “getting it wrong” and being “in trouble.”"
        },
        {
            "text": "This is familiar to us at Supported Loving, often meeting untrained staff without an organisational policy to follow, whilst dealing with challenging situations. CQC’s report presented an association between a lack of guidance, closed organisational cultures and vulnerability to abuse."
        },
        {
            "heading": 2,
            "text": "Learning to help people love"
        },
        {
            "text": "To our delight, Skills for Care approached us to explore how direct social care support staff can be better supported to address peoples’ sexuality and relationships needs. We investigated what learning materials existed, consulting with 316 care staff (questionnaires & focus groups). No ‘off the shelf’ training pack existed and most staff were not receiving training despite a clear need."
        },
        {
            "text": "We developed the relationships and sexuality awareness training programme with Skills for Care to help staff gain the skills and knowledge required, focussing on enabling providers to offer support in a way that respects people’s choices and values whilst keeping them safe."
        },
        {
            "text": "During our pilot we had to refuse spaces to social workers, nurses and other professionals, highlighting how social care staff are not the only group requiring training. They often seek advice from professionals or senior social care staff, who we know can also have gaps in their knowledge."
        },
        {
            "text": "The law changes, e.g. the test for mental capacity to engage in sexual activity, has changed twice since we started training, language evolves (e.g. different words for gender expression/ sexual identities), as does how issues are approached."
        },
        {
            "text": "Good support is vital but there is a whole system responsibility to ensure that sexuality and relationship needs are appropriately addressed and rights upheld. We feel strongly that this means targeted guidance and training for everyone with the social care system."
        },
        {
            "text": "For more resources and support see Supported Loving."
        }
    ]
}