{
    "url": "https://ruralpayments.blog.gov.uk/2023/07/27/how-to-amend-a-hedge-linear-feature-and-make-a-land-cover-change/",
    "title": "How to amend a hedge linear feature and make a land cover change",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Mapping"
    ],
    "pub_date": "2023-07-27T15:22:33+01:00",
    "content": [
        {
            "text": "In the latest blog in our series about the RPA mapping process and how to carry out mapping-related tasks ahead of scheme applications, this blog will guide you through using a map to make amendments to hedge linear features, making a Land Cover change and how to avoid submitting conflicting information."
        },
        {
            "text": "It's vital that you ensure your land details are up-to-date before you apply for Countryside Stewardship mid-tier. This also applies to the Sustainable Farming Incentive (SFI). Land details shown on your digital maps in the Rural Payments service are used for several of the land-based schemes and that’s why it’s important to keep your mapping up to date."
        },
        {
            "text": "You can use the RPA RLE1 form to make changes to your digital maps, register new land and transfer entitlements by sub-lease or inheritance."
        },
        {
            "heading": 3,
            "text": "Adding and removing hedge linear features"
        },
        {
            "text": "Clearly highlight the new hedge with a single line and note the length of hedge required."
        },
        {
            "text": "To remove a section of hedge, identify the length to be removed. It would be helpful to also provide an annotation to explain why the hedge should be removed."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Missing annotations – inaccurate hedge length"
        },
        {
            "text": "Hedge requests that do not include a length are likely to be queried, this will cause a delay to mapping"
        },
        {
            "text": "Make sure accurate lengths of hedges are provided. If a length is not possible this will be queried and this may cause a delay.​"
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Hedges and gaps – internal hedges"
        },
        {
            "text": "Gaps of under 20m in a hedge can be ignored."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": "Hedges do not have to be on the boundary and can be inside the land parcel​"
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": "An internal hedge creating a complete boundary will be used to divide the land parcel.​"
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Making a Land Cover change"
        },
        {
            "text": "Clearly identify the location of new land covers.  Providing annotations can be helpful, e.g. the width of a new track."
        },
        {
            "text": "When amending the boundary of a pre-existing land cover, e.g. a woodland land cover, treat this like a boundary change and provide a clear position of the new boundary."
        },
        {
            "text": "Annotations and a measurement can aid us to map the land cover correctly."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": "When removing a land cover completely, clearly identify the feature to be removed with a cross. An annotation explaining why the feature should be removed can be helpful and may avoid a query delay."
        },
        {
            "text": "Land covers such as Bracken, scrub and rock that are scattered throughout the parcel can be mapped as one notional land cover. This is mapped as a square and represents all the scattered features within the land parcel. You just need to provide the area for a notional feature."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": "When the main land cover of the parcel requires an amendment, clearly state the new land cover and area.  Providing a land use code can be useful and will reduce query delays."
        },
        {
            "text": "Important note: We are not allowed to change PG01 land cover directly to TG01 or FA01."
        },
        {
            "text": "Important note: Following an arable crop, TG01 should be used for five years.  We will only be allowed to amend the land cover to PG01 after the five year period has been completed."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Conflicting Information"
        },
        {
            "text": "Example of a map including conflicting instructions."
        },
        {
            "text": "An amendment has been received to divide the land parcel in two using the green line"
        },
        {
            "text": "Measurements have been provided by the customer to aid in mapping the new boundary correctly"
        },
        {
            "text": "Note the width of the New eastern parcel has been identified as 25m, however the dividing boundary in green is not parallel with the existing Eastern boundary​."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": "Our digitiser has followed the 25m instruction for the width and the new dividing boundary in green is now parallel with the original Eastern boundary."
        },
        {
            "text": "The length of the new boundary is shown as 100m, however this too long to fit in the parcel. The yellow line shows how a 100m boundary would extend outside of the land parcel​"
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": "A mapping query and customer contact has determined that the length of the new boundary is actually 90m. The amendment is now clear and the division can proceed.​"
        }
    ]
}