{
    "url": "https://environmentagency.blog.gov.uk/2023/07/27/landowners-warned-not-to-be-victims-at-the-hands-of-waste-criminals/",
    "title": "Landowners warned not to be victims at the hands of waste criminals",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Environment Agency",
        "Waste"
    ],
    "pub_date": "2023-07-27T13:06:28+00:00",
    "content": [
        {
            "text": "By Sharon Owen, Senior Environmental Crime Officer"
        },
        {
            "text": "My role as a Senior Environmental Crime Officer is to prevent, disrupt and stop criminal operations.  I have been fighting crime for the last 41 years. In that time, I have seen first-hand the damage caused by waste criminals, to lives, livelihoods, communities, and the environment."
        },
        {
            "text": "Often, it’s land and property owners that are affected. Let me share a few examples where the landowners were left with huge financial costs to clear their land."
        },
        {
            "text": "Dairy mill used as an unauthorised landfill"
        },
        {
            "text": "The tanks of a former dairy mill were excavated to 17 feet underground and filled with 1, 1970m3 of waste material only suitable for disposal at a non-hazardous landfill.  Initially this criminal activity went undetected as the offenders took steps to conceal what they were doing by erecting a large bund of soil around the site to obscure the works from public view and telling the local community they had local council approved planning permission for the works that were to support the construction of an underground car park."
        },
        {
            "text": "But we uncovered their deceit and exposed the truth through, unannounced regulatory inspections on a U1 waste exemption registered at the site, use of enforcement techniques, notices, multiple site inspections and partner agency intelligence sharing."
        },
        {
            "text": "With no environmental permit or any control measures in place for the waste types being disposed of, they were causing damage to the environment and human health."
        },
        {
            "text": "We were also able to prove that the waste had come from several operators with connections to organised crime groups. All our evidence led to a great result, with charges successfully brought against numerous companies and individuals, totalling £13,450 in fines and £11,241 in costs, plus an eight-month suspended jail sentence and 200 hours of community service for one offender. This criminal operation was a deliberate and premeditated act to circumvent our permitting system, to avoid paying necessary landfill taxes to HMRC and to undercut legitimate operators."
        },
        {
            "text": "Because it was privately owned land, the landowner had to fund the clearance of the site personally, an eye-watering £270, 000."
        },
        {
            "text": "Dumped waste causing a sickening stench"
        },
        {
            "text": "Public reports of strong offensive smells coming from land in Droylsden prompted our officers and the Greater Manchester Police to investigate.  They discovered land immediately next to, and above, the river Medlock, close to a densely populated residential area and a railway, was being used to dump approximately 30m3 of unsorted mixed household and commercial waste."
        },
        {
            "text": "Visible was wood, textiles, plastics, mattresses, waste white goods and old window frames. A 360-excavator machine was also on site, used dig out an area we found to be heavily filled in with contaminated shredded mixed waste. A crescent shaped mound had been constructed of mixed trommel fines to create a bunding area of contaminated infill, where water had begun to pond; this was contaminated with run-off from the waste, known to be leachate which is a by-product from the waste.  The odour was very offensive and made officers feel physically sick."
        },
        {
            "text": "This site was so vile, it attracted interest from the media, the local MP and Mayor of Manchester."
        },
        {
            "text": "Using our enforcement powers those responsible were found guilty in court. The culprit was fined £2,600, given a victim surcharge £170 and costs of £8,400."
        },
        {
            "text": "The landowner was left with a large bill of more than £200,000 to clear the land."
        },
        {
            "text": "School grounds targeted by waste criminals"
        },
        {
            "text": "Over a single weekend a school in Oldham became the dumping ground for large-scale illegal dumping. Shredded, mixed household waste, contaminated with flies, was deposited on land owned by the school."
        },
        {
            "text": "An off-duty police officer reported seeing a large skip vehicle travelling along a main road in Oldham, which was heard by another police officer who had been working jointly with our enforcement team officers.  Going to investigate, the Police Officer saw two men had broken the lock on the school gates to gain entry to the school land and were in the middle of emptying their load of very pungent smelling household waste. The passenger ran off leaving the driver, who following checks was arrested for driving offences and fraud. The police officer contacted our enforcement officers who attended the scene and observed approximately eight large vehicle loads had been deposited of very smelly shredded mixed waste. Following his experience of joint working with our enforcement team, the police officer was quick to recognise potential waste crime, meaning this tipping was stopped before it became an even worse problem."
        },
        {
            "text": "The driver was asked by us on two occasions to attend an interview under caution, which he failed to do. Following his non-attendance, we took him to court, where he was given an immediate 12-month prison sentence, plus victim surcharge £140, with no costs awarded."
        },
        {
            "text": "He lost a year of his freedom for this crime, but his disgusting act still left the school with a bill of £22,197.67 for the removal of the waste from their land."
        },
        {
            "text": "The cost to stop waste criminals is significant to the Crown and diverts resources which could be used elsewhere. Ultimately, we all pay for their crimes, not only through the public purse but as these cases all illustrate, affected landowners are paying huge sums of money to clear their land after waste criminals have abused it."
        },
        {
            "text": "If you own land or warehousing, we encourage you to regularly check it is secure and be careful who you let your premises to. They may not be who they say they are. Read our blog to find out how you can protect yourself: Property and Landowners – how to avoid waste criminals - Creating a better place (blog.gov.uk)"
        }
    ]
}