{
    "url": "https://ipo.blog.gov.uk/2023/07/27/meet-the-ipo-board-finance-director-neil-hartley/",
    "title": "Meet the IPO Board: Finance Director Neil Hartley",
    "authors": [
        "Neil Hartley"
    ],
    "categories": [
        "Innovation",
        "IPO"
    ],
    "pub_date": "2023-07-27T12:30:25+01:00",
    "content": [
        {
            "text": "Next up in our ‘Meet the IPO Board’ series we meet Neil Hartley, Finance Director of the IPO.  "
        },
        {
            "heading": 3,
            "text": " Neil, what led you to join the IPO?  "
        },
        {
            "text": "I think, like many people, joining the Civil Service was accidental. Initially, I applied for a job at the electricity regulator back in the early nineties, not realising at the time that it was a Civil Service organisation. From there, I followed the career opportunities wherever they took me.  "
        },
        {
            "text": "Ever since then, I’ve worked mostly in finance roles for organisations like the Inland Revenue, the Planning Inspectorate, the Government Office for the Regions and Companies House.  "
        },
        {
            "text": "It was the Companies House role that led me here. Back in 2015 I spotted a Finance Director vacancy at IPO. The two CEOs – Companies House and IPO – had a conversation about whether there was an opportunity to share me, and I did that for a couple of years. It was a really interesting time, doing the Finance Director role for two different organisations just a few miles apart, travelling between the two. After a couple of years, I moved to the IPO on a permanent basis.  "
        },
        {
            "text": "I've now been working with the IPO for eight years. "
        },
        {
            "heading": 3,
            "text": "What is the main focus of your role?  "
        },
        {
            "text": "The main focus of my role at the moment is making sure we spend our money as effectively as possible. A lot of that's about doing it in a fair and transparent way. It’s important that we get value for money for what we spend, that we can show we’re efficient in the way we do things so that we can not only pay for our core rights guaranteed services, but we can do other things like develop policy. Ultimately, this is so that we can support the innovators, creators and businesses we serve.  "
        },
        {
            "text": " The biggest thing at the moment is to fund our One IPO Transformation programme – a complete upgrade to all of our IP services to future proof the organisation for years to come. It’s the biggest investment we've made, probably ever. Certainly in my career, it's the biggest programme I've ever been involved with.  "
        },
        {
            "text": " There are many, many rules in the public sector about spending money, so it's about doing this as creatively as possible while still living within those rules. We have to make sure that the different rights - the cost of those rights - are paid for by the fees that we get in and that we don't do any cross-subsidy. Also that we follow all the procurement rules that are set for us by the UK Government.  "
        },
        {
            "heading": 3,
            "text": "  Tell us about your work on the IPO Board "
        },
        {
            "text": "As a member of the IPO Board, I’m helping set the direction for the organisation and particularly at the moment, establishing new ways of working. Since lockdown and hybrid working was introduced, it's been a really interesting area. I think the organisation has responded really, really well. We went overnight from most people being in the office most of the time, to the vast majority of people having to do their jobs from home.  "
        },
        {
            "text": "We did that really effectively, really smoothly. It didn't really have any impact on our services. So that's something we should be, and are, incredibly proud of – a really positive team experience that came out of adversity.  "
        },
        {
            "heading": 3,
            "text": "What are your future priorities? "
        },
        {
            "text": "One of the challenges we're facing at the moment is long-term planning.  "
        },
        {
            "text": "So that means trying to forecast how much work we're going to get coming in, how much income we're going to get, how much the cost of our new services is going to be, what inflation pressures are going to do to future costs. So, looking further ahead, rather than just focusing on immediate plans – it’s a big priority for us.  "
        },
        {
            "heading": 3,
            "text": "Tell us about your IPO highlights "
        },
        {
            "text": "Having worked in many different organisations, probably about a dozen public sector organisations in my career, I can honestly say that the IPO has the best people and culture and ways of working that I've ever experienced. Everybody's really customer focused, always looking to improve, always looking to help each other. The amount of collaboration and teamwork and support that you see, the fact that we have ‘people’ as one of our strategic pillars...  "
        },
        {
            "text": "Again, it's rare to see such a focus on our people, and we get such a good response from our people. That's the main reason why I enjoy, and I've stayed at the IPO, for as long as I've stayed anywhere.  "
        }
    ]
}