{
    "url": "https://socialcare.blog.gov.uk/2023/07/27/social-care-superpowers/",
    "title": "Social care superpowers",
    "authors": [
        "Gareth Williams"
    ],
    "categories": [
        "Care and support",
        "Recognition",
        "Workforce"
    ],
    "pub_date": "2023-07-27T13:50:38+00:00",
    "content": [
        {
            "heading": 2,
            "text": "The power to transform lives"
        },
        {
            "text": "I was so proud to launch Cygnet Social Care’s #SocialCareSuperpower campaign earlier this year, highlighting the incredible people who work across our social care services and who strive every day to make a positive difference to those in need of support."
        },
        {
            "text": "The campaign shines a spotlight on care colleagues with extraordinary skills who make a valuable difference to the lives of those they care for. In my opinion, they are all superheroes, armed with remarkable superpowers. We would love social care workers from all organisations to join us in our celebrations and share their superpowers with us! What abilities do you possess which help you deliver care of the highest standards?"
        },
        {
            "text": "Working in social care is both challenging and hugely rewarding. The work we do is pivotal, looking after the most vulnerable people in our society. This is precisely why it takes a special kind of person to do it: a person who is kind, empathic, fun loving, dedicated, and who loves problem solving."
        },
        {
            "text": "In April this year, we announced the creation of two distinct health and social care divisions. This campaign is a wonderful way to celebrate our social care services and colleagues. I want their vital work to be shared widely and recognition given for the life-changing impact they have on our residents."
        },
        {
            "text": "I have worked in social care since 2009 and, so far, it’s been the best career decision I ever made. My social care superpower is my ability to empower others and recognise the true value of their capabilities and future potential."
        },
        {
            "text": "Our communications team has been working closely with six members of staff, across different care settings, who have shared stories about their social care careers, why they love the job they do and what they consider their superpower to be."
        },
        {
            "heading": 2,
            "text": "Behold! Unrestricted Man!"
        },
        {
            "text": "Ollie White has worked in the care sector for more than a decade, starting his career as a support worker and rising through the ranks to become the Registered Manager of The Orchards, a Cygnet Social Care service in Essex, which supports men with learning disabilities and complex needs."
        },
        {
            "text": "For Ollie,  the most rewarding part of his job is helping people succeed. His social care superpower is being as unrestrictive as possible, empowering residents to make decisions about their own health and wellbeing. Watch Ollie's story here."
        },
        {
            "heading": 2,
            "text": "Meet... the Compassionater!"
        },
        {
            "text": "Hailey’s social care superpower is compassion and the regular feedback she receives supports this, with many calling her caring, kind, non-judgemental and passionate. Watch Hailey's story here."
        },
        {
            "text": "By running this campaign externally, we hope to highlight the amazing work undertaken by staff across our services and celebrate the way they empower our residents. By shining a light on the emotional rewards of the role, we may even inspire more people to consider careers in social care."
        }
    ]
}