{
    "url": "https://publicguardian.blog.gov.uk/2023/07/27/tackling-our-terminology/",
    "title": "Tackling our terminology",
    "authors": [
        "rebeccaparker1"
    ],
    "categories": [
        "Attorneys",
        "Carers",
        "Deputies",
        "deputy",
        "EPA",
        "FAQs",
        "Future planning",
        "Guidance",
        "lasting power of attorney",
        "LPA",
        "Mental Capacity Act"
    ],
    "pub_date": "2023-07-27T15:00:50+01:00",
    "content": [
        {
            "text": "\n[English] - [Cymraeg]"
        },
        {
            "text": "We know that some of the words and phrases we use can be confusing.  As an attorney, donor, deputy, or organisation you will come across our terminology in our forms, guidance documents, letters and through our online services.  "
        },
        {
            "text": "We’ve put together a list of some words and phrases you might come across and what they mean. "
        },
        {
            "heading": 3,
            "text": "1. Lasting power of attorney (LPA)"
        },
        {
            "text": "A lasting power of attorney (LPA) is a legal document that lets someone (the 'donor') choose one or more trusted people ('attorneys') to make decisions on their behalf. "
        },
        {
            "text": "There are two types of LPA: "
        },
        {
            "text": "A health and welfare LPA allows the person creating the document to be clear about their health and personal welfare. For example, day-to-day care or life sustaining treatment. "
        },
        {
            "text": "A property and financial affairs LPA allows someone you trust to manage your money and property. With your permission, your trusted person can act on your behalf if you lose the capacity to make decisions. "
        },
        {
            "text": "Both types of LPA must be registered with OPG before they can be used. A health and welfare LPA can only be used when you’re unable to make your own decisions. "
        },
        {
            "heading": 3,
            "text": "2. Enduring power of attorney (EPA)"
        },
        {
            "text": "EPAs signed and dated before 1 October 2007 are still valid and can be registered with OPG when the donor starts to lose, or has lost, mental capacity. "
        },
        {
            "text": "An EPA is only for finance and property and were replaced by LPAs on 1 October 2007. "
        },
        {
            "heading": 3,
            "text": "3. Mental capacity"
        },
        {
            "text": "Mental capacity means the ability to make a specific decision at a specific time. "
        },
        {
            "text": "A person with mental capacity has a general understanding of the decision they need to make, why they need to make it and what is likely to happen when they make it. Sometimes people have the capacity to make some decisions but not others. "
        },
        {
            "text": "You can find a legal definition of mental capacity in section 2 of the Mental Capacity Act 2005.  "
        },
        {
            "text": "People may lack mental capacity because, for example: "
        },
        {
            "heading": 3,
            "text": "4. Mental Capacity Act"
        },
        {
            "text": "The Mental Capacity Act 2005 is an Act of Parliament applying to England and Wales. Its purpose is to supply a legal framework for acting and making decisions on behalf of adults who can no longer make decisions for themselves. "
        },
        {
            "heading": 3,
            "text": "5. Donor"
        },
        {
            "text": "Someone who has created either an EPA or LPA. They are referred to as ‘donors’ because they have donated certain decision-making powers to someone else. This term is not to be confused with the medical term. "
        },
        {
            "text": "Only the donor can make decisions about their LPA, such as choosing their attorneys. "
        },
        {
            "text": "A donor must be at least 18 years old and have mental capacity when they make their LPA. "
        },
        {
            "heading": 3,
            "text": "6. Attorney"
        },
        {
            "text": " "
        },
        {
            "text": "The person chosen to act for someone else on an EPA or LPA. The donor will appoint an attorney (or attorneys) to help them make decisions when they’re no longer able to do so.  "
        },
        {
            "text": "This term is not to be confused with the American term for lawyer or solicitor."
        },
        {
            "text": "Attorneys should be people the donor knows and trusts well. They do not need to be lawyers and many people choose their wife, husband, civil partner, partner, children, other relatives or close friends. "
        },
        {
            "text": "Attorneys must be at least 18 years old. "
        },
        {
            "heading": 3,
            "text": "7. Court of Protection"
        },
        {
            "text": "The court that makes decisions on property and financial or health and welfare matters for people who can't make decisions for themselves because they lack mental capacity.  "
        },
        {
            "text": "Some of their responsibilities include: "
        },
        {
            "heading": 3,
            "text": "8. Deputy"
        },
        {
            "text": "A deputy may be a lay person, a professional or a public authority. They are appointed by the Court of Protection to manage the health and welfare or property and finances of a person who lacks the mental capacity to make decisions themselves.  "
        },
        {
            "text": " A deputy may be appointed if someone loses mental capacity and does not have a lasting power of attorney in place. "
        },
        {
            "heading": 3,
            "text": "9. Deputyship order"
        },
        {
            "text": "The appointment of a deputy is under a deputyship order. A person may apply to become someone’s deputy if that person lacks the mental capacity to make a decision for themselves at the time it needs to be made. This differs to an ‘attorney’ who must be appointed before the person lacks mental capacity.  "
        },
        {
            "text": "There are two types of deputyship order: property and affairs and health and welfare.   "
        },
        {
            "text": "When a deputy is appointed, the court will issue an order setting out what a deputy may or may not do and their respective responsibilities.   "
        },
        {
            "heading": 3,
            "text": "10. Guardian"
        },
        {
            "text": "A person appointed by the High Court to act on behalf of a missing person. Guardians manage the property and financial affairs of a person who is absent or has gone missing"
        },
        {
            "heading": 3,
            "text": "11. Guardianship order"
        },
        {
            "text": "The appointment of a guardian is under a guardianship order and is authorised by the High Court. "
        },
        {
            "text": " A person may apply to become a guardian to manage the finances and property of someone who: "
        },
        {
            "text": "The person must be missing from home and their usual activities. "
        },
        {
            "text": "One of the following must also apply: "
        },
        {
            "heading": 3,
            "text": "12. “P” or the client"
        },
        {
            "text": "Someone who has lost mental capacity and whose welfare, property or financial affairs are managed by a deputy. If there are professional deputies involved, they are sometimes referred to as “the client”. "
        },
        {
            "heading": 3,
            "text": "13. Best interests"
        },
        {
            "text": "Any decisions made, or actions taken, on behalf of someone who has lost mental capacity must be in their best interests.  "
        },
        {
            "text": "There is no specific answer as to what is in a person’s best interest, as every decision is unique to the person and circumstances involved. However there are standard steps to follow when deciding on someone’s best interests. These are set out in Chapter 5 of the Mental Capacity Act (MCA) Code of Practice. "
        },
        {
            "heading": 3,
            "text": "14. Least restrictive option"
        },
        {
            "text": "Before a decision is made on behalf of a person who has lost mental capacity, it should always be questioned if something else that would interfere less with their basic rights and freedoms can be done instead. A decision that interferes with a person’s basic rights and freedoms the least is known as the least restrictive option.\n"
        },
        {
            "heading": 3,
            "text": "15. User"
        },
        {
            "text": "Anyone who makes use of OPG services. This could be the client or “P”, attorneys, deputies, partners, advocates and stakeholders. It also covers staff using OPG systems. "
        },
        {
            "heading": 3,
            "text": "16. Remission and exemption"
        },
        {
            "text": "A remission is a reduction in the cost of an LPA application. If the person making an LPA (the donor), earns less than £12,000 a year before tax they may be entitled to a 50% reduction. "
        },
        {
            "text": " An exemption occurs when a person making an LPA receives certain qualifying means tested benefits. This means they aren't required to meet the cost of registering an LPA application."
        },
        {
            "text": "To see if you’re entitled to a reduction or exemption, download and fill in the application form on our website. "
        },
        {
            "text": "Remissions and exemptions also apply to deputyships. "
        },
        {
            "text": "\n[English] - [Cymraeg]"
        },
        {
            "heading": 3,
            "text": "Mynd i'r afael â'n terminoleg"
        },
        {
            "text": "Rydym yn gwybod bod rhai o’r geiriau a’r ymadroddion rydym yn eu defnyddio yn gallu bod yn ddryslyd.  Fel atwrnai, rhoddwr, dirprwy neu sefydliad byddwch yn dod ar draws ein terminoleg yn ein ffurflenni, ein dogfennau canllaw, ein llythyrau a thrwy ein gwasanaethau ar-lein."
        },
        {
            "text": "Rydym wedi llunio rhestr o rai geiriau ac ymadroddion y gallech chi ddod ar eu traws a beth maen nhw’n ei olygu."
        },
        {
            "heading": 3,
            "text": "1. Atwrneiaeth arhosol (LPA)"
        },
        {
            "text": "Mae Atwrneiaeth Arhosol (LPA) yn ddogfen gyfreithiol sy’n caniatáu i berson (y rhoddwr') ddewis un neu fwy o bobl y gellir ymddiried ynddynt ('atwrneiod') i wneud penderfyniadau ar ei ran."
        },
        {
            "text": "Mae dau fath o LPA:"
        },
        {
            "text": "Mae LPA iechyd a lles yn caniatáu i’r sawl sy’n creu’r ddogfen fod yn glir ynghylch ei iechyd a’i les personol. Er enghraifft, gofal o ddydd i ddydd neu driniaeth cynnal bywyd."
        },
        {
            "text": "Mae LPA eiddo a materion ariannol yn caniatáu i rywun yr ydych yn ymddiried ynddo reoli eich arian a’ch eiddo. Gyda’ch caniatâd chi, gall y sawl rydych chi’n ymddiried ynddo weithredu ar eich rhan os byddwch chi’n colli’r gallu i wneud penderfyniadau."
        },
        {
            "text": "Rhaid cofrestru’r ddau fath o LPA gyda’r Swyddfa Gwarcheidwad Cyhoeddus cyn bod modd eu defnyddio. Dim ond pan na allwch wneud eich penderfyniadau eich hun y gellir defnyddio atwrneiaeth arhosol iechyd a lles."
        },
        {
            "heading": 3,
            "text": "2. Atwrneiaeth barhaus (EPA)"
        },
        {
            "text": "Mae atwrniaethau parhaus (EPA) sydd wedi’u llofnodi a’u dyddio cyn 1 Hydref 2007 yn dal i fod yn ddilys a gellir eu cofrestru gyda Swyddfa'r Gwarcheidwad Cyhoeddus pan fydd y rhoddwr yn dechrau colli, neu wedi colli, galluedd meddyliol."
        },
        {
            "text": "Ar gyfer cyllid ac eiddo yn unig y mae EPA ac fe'i disodlwyd gan LPAs ar 1 Hydref 2007."
        },
        {
            "heading": 3,
            "text": "3. Galluedd meddyliol"
        },
        {
            "text": "Mae galluedd meddyliol yn golygu gallu gwneud penderfyniad penodol ar amser penodol."
        },
        {
            "text": "Mae gan berson sydd â gallu meddyliol ddealltwriaeth gyffredinol o’r penderfyniad y mae angen iddo ei wneud, pam bod angen iddo ei wneud a beth sy’n debygol o ddigwydd pan fydd yn ei wneud. Weithiau mae gan bobl alluedd i wneud rhai penderfyniadau ond nid penderfyniadau eraill."
        },
        {
            "text": "Gallwch ddod o hyd i ddiffiniad cyfreithiol o alluedd meddyliol yn adran 2 Deddf Galluedd Meddyliol 2005. "
        },
        {
            "text": "Efallai nad oes gan bobl alluedd meddyliol oherwydd, er enghraifft:"
        },
        {
            "heading": 3,
            "text": "4. Deddf Galluedd Meddyliol"
        },
        {
            "text": "Mae Deddf Galluedd Meddyliol 2005 yn Ddeddf Seneddol sy’n berthnasol i Gymru a Lloegr. Ei phwrpas yw darparu fframwaith cyfreithiol ar gyfer gweithredu a gwneud penderfyniadau ar ran oedolion nad ydynt bellach yn gallu gwneud penderfyniadau drostynt eu hunain."
        },
        {
            "heading": 3,
            "text": "5. Rhoddwr"
        },
        {
            "text": "Rhywun sydd wedi gwneud EPA neu LPA. Cyfeirir atynt fel ‘rhoddwyr’ am eu bod wedi rhoi rhai pwerau gwneud penderfyniadau i rywun arall. Ni ddylid drysu rhwng y term hwn a’r term meddygol."
        },
        {
            "text": "Dim ond y rhoddwr sy’n gallu gwneud penderfyniadau am ei LPA, fel dewis ei atwrneiod."
        },
        {
            "text": "Rhaid i’r rhoddwr fod yn 18 mlwydd oed o leiaf a bod â galluedd meddyliol wrth wneud ei LPA."
        },
        {
            "heading": 3,
            "text": "6. Atwrnai"
        },
        {
            "text": " "
        },
        {
            "text": "Y person sydd wedi cael ei ddewis i weithredu dros rywun arall ar EPA neu LPA. Bydd y rhoddwr yn penodi atwrnai (neu atwrneiod) i’w helpu i wneud penderfyniadau pan na all wneud hynny mwyach."
        },
        {
            "text": "Ni ddylid drysu rhwng y term hwn a’r term yn America am gyfreithiwr.\nDylai atwrneiod fod yn bobl y mae’r rhoddwr yn eu hadnabod ac yn ymddiried ynddynt yn dda. Nid oes angen iddynt fod yn gyfreithwyr ac mae llawer o bobl yn dewis eu gwraig, gŵr, partner sifil, partner, plant, perthnasau eraill neu ffrindiau agos."
        },
        {
            "text": "Rhaid i atwrneiod fod yn 18 oed o leiaf."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "7. Y Llys Gwarchod"
        },
        {
            "text": "Y llys sy’n gwneud penderfyniadau ar eiddo a materion ariannol neu iechyd a lles ar gyfer pobl nad ydynt yn gallu gwneud penderfyniadau drostynt eu hunain oherwydd nad oes ganddynt alluedd meddyliol."
        },
        {
            "text": "Dyma rai o’i gyfrifoldebau:"
        },
        {
            "heading": 3,
            "text": "8. Dirprwy"
        },
        {
            "text": "Gall dirprwy fod yn berson lleyg, yn weithiwr proffesiynol neu’n awdurdod cyhoeddus. Fe’u penodir gan y Llys Gwarchod i reoli iechyd a lles neu eiddo a materion ariannol person sydd heb y galluedd meddyliol i wneud penderfyniadau drosto’i hun."
        },
        {
            "text": "Gellir penodi dirprwy os bydd rhywun yn colli galluedd meddyliol ac nad oes ganddo atwrneiaeth arhosol."
        },
        {
            "heading": 3,
            "text": "9. Gorchymyn dirprwyaeth"
        },
        {
            "text": "Mae penodi dirprwy yn dod o dan orchymyn dirprwyaeth. Gall berson wneud cais i fod yn ddirprwy i rywun os nad oes gan y person hwnnw’r galluedd meddyliol i wneud penderfyniad drosto’i hun ar yr adeg y mae angen iddo gael ei wneud. Mae hyn yn wahanol i ‘atwrnai’ gan bod rhaid penodi atwrnai cyn i’r person golli ei alluedd meddyliol."
        },
        {
            "text": "Mae dau fath o orchymyn dirprwyaeth: eiddo a materion ariannol, ac iechyd a lles."
        },
        {
            "text": "Pan benodir dirprwy, bydd y llys yn cyhoeddi gorchymyn yn nodi’r hyn y gall neu na chaiff dirprwy ei wneud, yn ogystal â’i gyfrifoldebau priodol. "
        },
        {
            "heading": 3,
            "text": "10. Gwarcheidwad "
        },
        {
            "text": "Person a benodir gan yr Uchel Lys i weithredu ar ran person coll. Mae gwarcheidwaid yn rheoli eiddo a materion ariannol person sy’n absennol neu sydd ar goll."
        },
        {
            "heading": 3,
            "text": "11. Gorchymyn Gwarcheidiaeth"
        },
        {
            "text": "Mae penodi gwarcheidwad yn dod o dan orchymyn gwarcheidwaeth ac fe’i awdurdodir gan yr Uchel Lys."
        },
        {
            "text": "Gall person wneud cais i fod yn warcheidwad a rheoli cyllid neu eiddo rhywun sydd:"
        },
        {
            "text": "Rhaid i’r person fod ar goll o’i gartref a’i weithgareddau arferol."
        },
        {
            "text": "Rhaid i un o’r canlynol fod yn berthnasol hefyd:"
        },
        {
            "heading": 3,
            "text": "12. “P” neu’r cleient"
        },
        {
            "text": "Rhywun sydd wedi colli galluedd meddyliol ac y mae ei les, ei eiddo neu ei faterion ariannol yn cael eu rheoli gan ddirprwy. Os oes dirprwyon proffesiynol yn gysylltiedig, cyfeirir atynt weithiau fel “y cleient”."
        },
        {
            "heading": 3,
            "text": "13. Budd pennaf"
        },
        {
            "text": "Rhaid i unrhyw benderfyniadau a wneir, neu gamau a gymerir, ar ran rhywun sydd wedi colli galluedd meddyliol fod er ei fudd pennaf."
        },
        {
            "text": "Nid oes ateb penodol o ran beth sydd er budd gorau person, gan fod pob penderfyniad yn unigryw i’r person a’r amgylchiadau dan sylw. Fodd bynnag, mae camau safonol i’w dilyn wrth benderfynu ar fudd pennaf rhywun. Mae’r rhain wedi’u nodi yn Adran 5 Cod Ymarfer y Ddeddf Galluedd Meddyliol."
        },
        {
            "heading": 3,
            "text": "14. Opsiwn lleiaf cyfyngol"
        },
        {
            "text": "Cyn i benderfyniad gael ei wneud ar ran person sydd wedi colli galluedd meddyliol, dylid cwestiynu bob amser a oes modd gwneud rhywbeth arall a fyddai’n amharu llai ar ei hawliau a’i ryddid sylfaenol yn lle hynny. Penderfyniad sy’n ymyrryd â hawliau a rhyddid sylfaenol person yw’r opsiwn lleiaf cyfyngol."
        },
        {
            "heading": 3,
            "text": "15. Defnyddiwr"
        },
        {
            "text": "Unrhyw un sy’n defnyddio gwasanaethau Swyddfa'r Gwarcheidwad Cyhoeddus. Gallai hyn fod yn gleient neu’n “P”, yn atwrneiod, yn ddirprwyon, yn bartneriaid, yn eiriolwyr ac yn rhanddeiliaid. Mae hefyd yn cynnwys staff sy’n defnyddio systemau Swyddfa'r Gwarcheidwad Cyhoeddus."
        },
        {
            "heading": 3,
            "text": "16. Gostyngiad ac Esemptiad"
        },
        {
            "text": "Mewn rhai amgylchiadau gellir cael gostyngiad yng nghost cais am LPA. Os yw’r sawl sy’n gwneud atwrneiaeth arhosol (y rhoddwr) yn ennill llai na £12,000 y flwyddyn cyn treth, mae’n bosibl y bydd ganddo hawl i ostyngiad o 50%."
        },
        {
            "text": "Mae esemptiad yn digwydd pan fydd person sy’n gwneud LPA yn cael rhai budd-daliadau cymwys sy’n dibynnu ar brawf modd. Mae hyn yn golygu nad oes rhaid iddynt dalu cost cofrestru cais am atwrneiaeth arhosol."
        },
        {
            "text": "I weld a oes gennych chi hawl i ostyngiad neu esemptiad, lawrlwythwch y ffurflen gais o’n gwefan a’i llenwi."
        },
        {
            "text": "Mae gostyngiadau ac esemptiadau hefyd yn berthnasol i ddirprwyaethau."
        },
        {
            "text": "Dyma rai o’r geiriau a’r ymadroddion y byddwch yn dod ar eu traws wrth ddefnyddio ein gwasanaethau. Os dewch o hyd i unrhyw beth arall a fyddai, yn eich barn chi, yn ychwanegiad da at y blog hwn, rhowch wybod i ni yn y blwch sylwadau."
        },
        {
            "text": "Mae rhagor o wybodaeth am LPAs a Dirprwyaethau ar gael yn www.gov.uk/opg"
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}