{
    "url": "https://phescreening.blog.gov.uk/2021/09/24/100th-completed-nhsp-eca/",
    "title": "100th candidate completes NHS newborn hearing screening competency assessment",
    "authors": [
        "Catherine Magee"
    ],
    "categories": [
        "NHS Newborn Hearing Screening Programme"
    ],
    "pub_date": "2021-09-24T11:59:32+01:00",
    "content": [
        {
            "text": "In 2017, the Health Screening Diploma (HSD) became the recommended training for newborn hearing screeners. It provides assurance of a hearing screener’s competence to undertake screening safely, independently and in line with programme standards. Before it can be completed, screeners must first complete:"
        },
        {
            "text": "The ECA was introduced in virtual format from April 2020. It replaced the previous observed structured clinical examination (OSCE) and ensured screeners continued to be assessed throughout the COVID-19 pandemic. This avoided delays in training and supported service delivery."
        },
        {
            "text": "The ECA assesses a candidate’s understanding and knowledge of the screening pathway. Feedback from the ECA can also provide evidence towards a candidate’s HSD. An ECA is composed of 2 sessions of 40 to 45 minutes, with a short break in between. After the assessment, the assessors verbally deliver the candidate’s result providing feedback on what they did well and what needs more work."
        },
        {
            "heading": 2,
            "text": "We need volunteer assessors"
        },
        {
            "text": "A team of NHSP local managers from across England volunteer their time as assessors.  We need to expand this team to be able to meet the demand for ECAs from services."
        },
        {
            "text": "If you have a certificate of assessing vocational achievement (CAVA), or any experience in assessing newborn hearing screeners within your team and would be interested in volunteering to support the ECA process, please complete this short questionnaire."
        },
        {
            "heading": 2,
            "text": "Temporary measures during COVID-19 pandemic"
        },
        {
            "text": "During the COVID-19 pandemic, some audiologists were trained and assessed locally to support the delivery of newborn hearing screening. It was not deemed essential for them to complete an ECA, given the pressures on services at the time. From 1 October 2021 any staff member who holds a current professional registration in a healthcare role (such as a health visitor, audiologist or midwife) and performs automated, auditory brainstem response (AABR) screening must complete an ECA. They are not required to complete the HSD."
        },
        {
            "heading": 2,
            "text": "Feedback on the ECA"
        },
        {
            "text": "The ECA has been positively received and our 100th candidate successfully completed in September 2021. Feedback received has shown that local managers have found the process of booking a candidate ‘very smooth’ and that the virtual assessment is ‘very accessible and preferred to face to face assessments’."
        },
        {
            "text": "Here, Bethan Chandler, a qualified midwife and recent candidate, shares her positive experience of the ECA:"
        },
        {
            "text": "Bethan’s top tips for anyone preparing for the ECA are to:"
        },
        {
            "text": "Further details of training requirements for newborn hearing screeners, including information about the HSD, can be found in the NHSP operational guidance, chapter 2, which also reflects the recent changes. The PHE Screening helpdesk holds details of available dates and waiting times."
        },
        {
            "heading": 2,
            "text": "PHE Screening blog"
        },
        {
            "text": "The PHE Screening blog provides up to date news from all NHS screening programmes. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new blogs. If you have any questions about this blog article, or about population screening in England, please contact the PHE screening helpdesk."
        }
    ]
}