{
    "url": "https://ukhsa.blog.gov.uk/2021/09/24/11-things-to-remember-for-university-this-year/",
    "title": "11 things to remember for university this year",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Coronavirus (COVID-19)"
    ],
    "pub_date": "2021-09-24T12:24:56+01:00",
    "content": [
        {
            "text": "Throughout the pandemic young people have made big sacrifices but thanks to the Covid-19 vaccine programme, which has meant the easing of national restrictions, there is an exciting outlook for the academic year ahead."
        },
        {
            "text": "Here are some important things to know for students starting or returning to university this year:"
        },
        {
            "text": "1) Get both doses of a Covid-19 vaccine."
        },
        {
            "text": "Getting vaccinated protects you and those around you."
        },
        {
            "text": "Two doses of a vaccine offers the highest level of protection so make sure you get your second dose., which should be around 8 – 12 weeks after your first."
        },
        {
            "text": "You don’t need to have both doses in the same place. You can arrange your second dose through the booking service at www.nhs.uk/covidvaccine or by going to a local walk in clinic 8 weeks after your first dose. So you can have your second dose while you are away at uni, you can find a local walk in vaccination centre here."
        },
        {
            "text": "So far about two-thirds of 18-29-year-olds in England have had at least one dose."
        },
        {
            "text": "2) Get all your jabs – Covid-19 is not the only infectious disease"
        },
        {
            "text": "Make sure you are up to date with all your vaccinations, including MMR and MenACWY. These vaccines help protect against measles, mumps and rubella, as well as some common types of meningococcal meningitis (swelling of the brain lining) and septicaemia (blood poisoning). You can easily book this at your local GP. These infections tend to spread at the start of university terms as lots of new people mix closely together."
        },
        {
            "text": "3) Register with a GP at your term time address"
        },
        {
            "text": "If you are going to a university that isn’t in your hometown, remember to sign up to your new GP as soon as possible. By doing this, you can access emergency care and health services quickly while you’re not at home."
        },
        {
            "text": "The health centre attached to your university is likely to be the most convenient, and the doctors working there will be experienced in the health needs of students. Find your local GP surgery to register."
        },
        {
            "text": "Registering with a GP also means you can have access to the NHS App to prove your full vaccination status so you don’t miss out."
        },
        {
            "text": "4) Take a test before travelling to Uni and keep getting tested"
        },
        {
            "text": "Before moving to university take a rapid lateral flow device (LFD) Covid-19 test at home. It’s free, quick and easy and you can order them online through the NHS. Once at university keep taking two LFD tests each week on site, or at home and report all your results online to NHS Test and Trace or by calling 119."
        },
        {
            "text": "Testing regularly means you’ll know early if you have COVID-19 and can make sure you don’t pass it on to others."
        },
        {
            "text": "Remember that about 1 in 3 people with Covid-19 do not have any symptoms. Regular LFD testing can help uncover hidden cases of the virus that would otherwise go undetected."
        },
        {
            "text": "5) Get a PCR test if you are a close contact or have symptoms"
        },
        {
            "text": "If you are aged under 18 and 6 months or are fully vaccinated you no longer need to self-isolate if you are identified as a close contact of a positive case, as long as you don’t have any symptoms. You should however take a PCR test (online, via the NHS COVID-19 app, or by calling 119) to make sure you aren’t infected. While you wait for the results, you should also consider reducing your social contacts and avoid contact with extremely vulnerable people. It’s also a good idea to wear a mask in enclosed spaces."
        },
        {
            "text": "If you develop coronavirus symptoms - a new and continuous cough, a fever or have lost your sense of taste or smell, you should book a PCR test immediately and stay at home until you receive your result."
        },
        {
            "text": "PCR tests are free and accessible and can be booked by calling 119 or via the GOV.uk website."
        },
        {
            "text": "6) Keep carrying a face covering"
        },
        {
            "text": "Whilst no longer a legal requirement, there is still a benefit to wearing a face covering in certain situations – don’t forget they help to protect those around you. Wearing one in crowded and enclosed spaces where you come into contact with people you don’t normally meet, for example, on public transport, is a sensible and simple way to help reduce the risk of spreading the virus and protecting those who may be vulnerable."
        },
        {
            "text": "7) Ventilate indoor spaces"
        },
        {
            "text": "Remember that the virus spreads much less easily outside so where possible meet friends outdoors to reduce the chances of catching the virus or passing it on to others. When you do meet indoors, opening windows and doors is the simplest way of improving ventilation. The more fresh air you let in the less likely it is that you will catch or pass on the virus."
        },
        {
            "text": "8) Wash your hands and carry hand sanitiser"
        },
        {
            "text": "Don’t forget the basics - keep washing your hands regularly for 20 seconds and carry a hand sanitiser with you. This is especially important when you get home and before and after using public transport."
        },
        {
            "text": "9) Use the NHS COVID-19 App and NHS COVID Pass "
        },
        {
            "text": "If you’re aged 16 or over, you can download the NHS COVID App to be alerted to what’s happening in your area, book a PCR or LFD test, use a QR code for visiting places and to be alerted if you are a close contact so you can help stop the spread of the virus."
        },
        {
            "text": "Also make sure to download the NHS COVID Pass to prove your full vaccination status so that you don’t miss out and don’t have to self-isolate if you are identified as a close contact."
        },
        {
            "text": "10) Get tested regularly for STIs"
        },
        {
            "text": "No one wants to swap social distancing for an STI, and as we enjoy the fact that national Covid-19 restrictions have lifted, it’s important that we continue to look after our sexual health and wellbeing. If you are having sex with new or casual partners, use a condom and get tested – STIs can pose serious consequences to your own health and that of your current or future sexual partners."
        },
        {
            "text": "11) Mental health support is available"
        },
        {
            "text": "There is no doubt it has been a difficult time for many students. The online resource at Student Space has a variety of useful mental health and wellbeing materials that can support you and others. Public Health England also provides resources to support young people’s mental health and wellbeing here."
        },
        {
            "text": "You can also receive mental health support directly from the NHS, either by contacting your GP or you can self-refer to talking therapies for anxiety and depression online at: NHS psychological therapies services (IAPT). These services are free, and therapies can be delivered effectively either on-line or on the telephone. You can access these services anywhere in England, regardless if your registered with a GP at your home or student address. Local services can also offer support for anxiety or depression."
        }
    ]
}