{
    "url": "https://valuationoffice.blog.gov.uk/2021/09/24/how-we-value-hotels/",
    "title": "How We Value: Hotels",
    "authors": [
        "sophiekilgour"
    ],
    "categories": [
        "How We Value",
        "Surveying",
        "Valuation"
    ],
    "pub_date": "2021-09-24T11:42:26+01:00",
    "content": [
        {
            "text": "Anthony Robinson and Sean Lloyd are part of the National Valuation Unit at the Valuation Office Agency (VOA), where they are responsible for determining how we value hotels for business rates across England and Wales. Here they tell us more about the development of the valuation system for hotels and how it works in practice."
        },
        {
            "text": "The hotel sector"
        },
        {
            "text": "Tourism makes a big contribution to our economy and there are around 8,000 hotels in England and Wales – from low budget accommodation all the way up to famous five-star luxury hotels and everything in between. Together they have a total rateable value of roughly £1.8 billion."
        },
        {
            "text": "A property’s rateable value is based on an estimate of the property’s open market rental value, on a specific date known as the Antecedent Valuation Date (AVD) – which is set out in legislation. For the next rating list for the 2023 Revaluation, this will 1 April 2021."
        },
        {
            "text": "There is clearly massive variation in this sector, so we needed a rating system that could cope with all of types of hotels to produce accurate and fair valuations across the board. That’s why we worked with UK Hospitality, the largest representative body for hotels in the country, to understand what factors need to be taken into account to fairly determine each hotel’s rateable value."
        },
        {
            "text": "How the scheme works"
        },
        {
            "text": "Together we decided to gather data in different ways, depending on the scale of how different types of businesses operate."
        },
        {
            "text": "For chain-operated hotels – such as Premier Inn and Macdonald Hotels - we carry out a detailed analysis of trading accounts with the help of the professional representatives acting on their behalf. We supplement this with data received direct from independent hoteliers."
        },
        {
            "text": "By analysing a hotel’s account information, our team can determine what elements of the business generate the most profit. This might be how the accommodation’s income relates to the number of rooms, and the income from rooms as a total proportion of the overall income for the hotel."
        },
        {
            "text": "Location is also major consideration in our rating system. Most hotels in London do far more business than elsewhere in the country, and this is clear through their costs and the revenue they are generating."
        },
        {
            "text": "On top of this we also need to look at differences in the type of accommodation - such as aparthotels, budget hotels, country house hotels and five-star rated hotels. All these have different characteristics and that must be reflected in our valuation system."
        },
        {
            "text": "Whatever money a hotel puts into providing its service is taken into consideration when working out its rateable value. For example, four or five-star hotels will typically have an extremely high level of fixed costs due to staffing, maintenance and more – things you’ll definitely notice if you stay somewhere fancy."
        },
        {
            "text": "The final steps"
        },
        {
            "text": "The FMT is our estimate of the trade revenue for a hotel, determined by analysing trade from previous years and taking into account trends, risks and uncertainties at that date."
        },
        {
            "text": "The scheme applies a single percentage to the total FMT to arrive at the rateable value of the hotel. The percentage applied varies depending on the profit the hotel is expected to make, the type of hotel and its trading performance."
        },
        {
            "text": "We publish details of the agreed scheme and the range of percentages we use online at GOV.UK."
        },
        {
            "text": "Like any sector, hotels are subject to change over time in the way they are used and this affects their values – especially given the impact of the last 18 months. This is why our scheme aims to take into account all aspects of cost, revenue, risk and uncertainties, and can adapt no matter what the future holds."
        }
    ]
}