{
    "url": "https://deframedia.blog.gov.uk/2021/09/24/new-report-underlines-need-for-joined-up-action-to-protect-rivers/",
    "title": "New report underlines need for joined-up action to protect rivers",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Weekly stories"
    ],
    "pub_date": "2021-09-24T12:39:03+01:00",
    "content": [
        {
            "text": "The Rivers Trust has today launched its State of Our Rivers report aiming to allow the English public understand and explore the health of their rivers on a national and local scale."
        },
        {
            "text": "Environment Minister Rebecca Pow and Environment Agency Director John Leyland attended the launch panel to discuss the ways in which the Government and regulators can work together with NGOs, water companies, agricultural businesses and others in the water sector to safeguard and improve the health of our rivers."
        },
        {
            "text": "The Rivers Trust report highlights that agricultural activities such as poor nutrient management are having a negative impact on rivers, with the water sector responsible for the widespread impact of discharging partially treated or diluted sewage effluent on river health."
        },
        {
            "text": "Through its work on the Storm Overflows Taskforce, the Government has made it clear to water companies they must make improvements to their environmental performance by reducing sewage discharges from storm overflows. The taskforce has led to £144m of new, additional investment on storm overflows on top of the £3 billion investment already committed by water companies to improve storm overflows in the current 5-year period."
        },
        {
            "text": "New measures in the Environment Bill will also require water companies to monitor the water quality impacts of their sewage discharges and publish near real-time information on when their storm overflows operate. This will drive water companies to reduce sewage discharges that do the most harm, to better protect our rivers and public health."
        },
        {
            "text": "Our Catchment Sensitive Farming partnership, one of the key ways to tackle agricultural pollution, was recently granted an extra £17m to cover 100% of English farmed areas by March 2023. Catchment Sensitive Farming has been hugely successful in giving farmers practical advice tailored to their own land and grants to support the investment in infrastructure that protects watercourses. Defra also recently made budget available to the Environment Agency for 50 extra inspectors to be recruited to visit farms posing a risk of water pollution and ensure action is taken."
        },
        {
            "text": "We also recently updated our guidance to the Environment Agency for the next cycle of River Basin Management Plans (RBMPs). RBMPs establish the environmental objectives for our rivers and set out the steps required to meet them and form an effective vehicle to achieve the ambitions for our water environment in the Government’s 25 Year Environment Plan."
        },
        {
            "text": "While the Government is taking urgent action to improve the ecological health of our rivers, the report highlights the need for joined-up action at scale between the water sector and farming industry, households, and the government."
        },
        {
            "text": "Environment Minister Rebecca Pow said: "
        },
        {
            "text": "Environment Agency Director John Leyland said:"
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}