{
    "url": "https://rpc.blog.gov.uk/2021/09/24/one-in-some-out-should-government-set-itself-a-target-or-control-framework-to-reduce-regulatory-impacts/",
    "title": "One-In, Some-Out: should government set itself a target or control framework to reduce regulatory impacts?",
    "authors": [
        "Jonathan Cave"
    ],
    "categories": [
        "Better regulation",
        "Independent scrutiny"
    ],
    "pub_date": "2021-09-24T10:00:34+01:00",
    "content": [
        {
            "text": "The government is currently seeking views on reforming the better regulation framework."
        },
        {
            "text": "A key aspect of the current framework is the use of impact assessments (IAs) to ensure that regulatory decisions consider the impacts on businesses (and civil society organisations). Previous blog posts have set out our views that, while it is helpful to include consideration of wider impacts in any future framework, the requirement for a metric that captures direct impacts on businesses and CSOs should remain."
        },
        {
            "text": "The consultation asks whether government should reintroduce a ‘One-In, X-Out’ control gateway (OIXO) to ensure a downward pressure on the net costs of regulation on business. This post considers that question."
        },
        {
            "heading": 2,
            "text": "The Business Impact Target (BIT)"
        },
        {
            "text": "The current framework requires government to set a target for the economic impact of its regulatory activity on business (the ‘BIT’). The RPC has been appointed as the Independent Verification Body required by law to confirm the numbers used in accounting for the BIT."
        },
        {
            "text": "For the 2017-2019 Parliament, the relevant government set a BIT target of a £9 billion reduction in direct costs over the length of the Parliament, however the final position was an increase in costs of £7.8 billion. Similarly, the government has set a holding target of £0 for the current Parliament, but in the first year of the Parliament, there was an increase of £5.7 billion (excluding the very significant impacts of temporary COVID-related measures)."
        },
        {
            "text": "Therefore, the BIT mechanism due in part to a lack of commitment to meeting the target has been associated with a significant increase in regulatory costs and exemptions for important policy areas (see our previous blog post). Perhaps more significantly, having a target (and missing it) appears to have had little consequence for or reaction from decisions about regulation by ministers."
        },
        {
            "text": "The challenges to the effectiveness of such a target may be even greater now. Consider the statutory commitment to ‘Net Zero’. The government action necessary to reduce greenhouse gas emissions to achieve Net Zero by 2050 will increase costs on business in some form or another, probably significantly in the short, medium and long term. Consequently any commitment to reduce regulatory burdens over time is likely to be in conflict with the Net Zero commitment."
        },
        {
            "heading": 2,
            "text": "Regulatory offsetting: One-In, Some-Out"
        },
        {
            "text": "As with a target, OIXO or similar regulatory budget mechanisms have the ambition of bearing down on regulatory costs – in this case by requiring the removal of existing costs to offset or ‘pay for’ any new measures that impose additional costs. There is a case for its effectiveness in the first years of the BIT where a OIXO process was still in place, but whether it uses a simple count of regulations or estimates of their costs, such a control can run into many of the same problems that have beset the BIT approach."
        },
        {
            "text": "For example, the government’s consultation document (p.39) gives the example of measures to restrict the stakes in gambling machines. These intentionally imposed burdens on business that would outweigh all the savings from the 3 years’ lifetime of the Red Tape Challenge in order to achieve an important government objective (reducing gambling-related harm and protecting vulnerable people). In a similar vein, it may be difficult or impossible to find sufficient savings from existing regulations (even including those transposed from EU regulations) to offset the measures needed to deliver the Net Zero commitment."
        },
        {
            "heading": 2,
            "text": "So should we have a control on the costs to business?"
        },
        {
            "text": "Problems arise when a regulatory control framework directly impedes other key government priorities."
        },
        {
            "text": "Offsetting metrics can have a powerful and positive impact on government choices, and can force hard decisions to benefit business through the removal of regulatory burdens. However, without a clear commitment from government and a plan to deal with these potential conflicts the system could fail – exemptions will be made for important policies, specific ministers will focus on the objectives associated with their brief, other urgent commitments will be prioritised and the framework will be seen as incidental or an impediment and will be undermined."
        },
        {
            "text": "In practice this might include greater – or even mandatory – consideration of non-regulatory options, or make explicit provision for ministers to introduce regulations that increase costs to business if they can clearly assure stakeholders (including business) that these costs are justified by the policy benefits, perhaps because there are significant indirect benefits to business, whether now or in the future."
        },
        {
            "text": "The value of such a framework is as much transparency as control. It would allow ministers to demonstrate that they are taking a fully evidence-based approach to decisions on regulation, that they welcome independent challenge as part of that process and that any new costs introduced are the minimum necessary and justified by the benefits of the regulation."
        },
        {
            "text": "At its simplest, this might mean tracking the burdens on business using a metric developed from the current EANDCB (Equivalent Annual Net Direct Cost to Business) and publishing cumulative accounts (potentially split by department). This would allow stakeholders to see what was happening and help ministers to justify their regulatory decisions."
        },
        {
            "text": "The overall increase or decrease of regulatory burdens is a political choice for government. Given the current commitment to measures that will increase burdens, we would caution the adoption of an offsetting framework without broad plans to decrease burdens sufficiently to allow it to achieve its objectives."
        },
        {
            "heading": 2,
            "text": "The issues to consider if a control is to work"
        },
        {
            "text": "We believe that a range of issues need to be carefully considered if any control is to work:"
        },
        {
            "heading": 3,
            "text": "Metric"
        },
        {
            "text": "The metric on which offsetting is based must be clearly defined if it is to provide the desired incentives. This might be a count of 'units' of regulation, or some measures of the costs a new regulation introduces and those saved by removal of another. With costs, there is a trade-off between comprehensiveness and analytical simplicity and practicality. We also note that a net metric obscures burden transfers – if for example the new measure and removal of the offsetting measure both transfer burdens from large to small businesses."
        },
        {
            "heading": 3,
            "text": "Ex-ante or ex-post?"
        },
        {
            "text": "The chosen metric might use the ex-ante estimates made in IAs when the selected offsetting regulations were originally introduced or ex-post calculations of their actual impacts (as captured in the post implementation review (PIR) or another evaluation). The ex-ante approach would also include sunk implementation costs that could not be recouped."
        },
        {
            "text": "The ex-ante approach may be preferred on the grounds of simplicity. But an ex-post approach is more aligned with Better Regulation principles because it focusses on actual changes to business costs and on unnecessary or obsolete regulations."
        },
        {
            "heading": 3,
            "text": "Timing"
        },
        {
            "text": "Any OIXO or regulatory budget or target would need to apply over a fixed period of time, for example a single year or the 5-year life of a Parliament. This complicates the timing of new measures, and might constrain ministerial discretion as the remaining stock of potential offsets is exhausted. A fixed regulatory budget period may encourage forward planning, but might lead to sub-optimal sequencing of regulatory proposals. For example, measures that impose larger costs might be introduced earlier or those that remove cost delayed until there is greater clarity over the offsetting required, regardless of the ‘best order’."
        },
        {
            "heading": 3,
            "text": "Linkage"
        },
        {
            "text": "In many past OIXO programmes, regulatory ‘INs’ and ‘OUTs’ have been calculated on a whole-of-government basis, which lead to a transfer of regulatory burdens between businesses governed by different departments (for example, if regulatory burden reductions to transport offset burden increases to agriculture). This may be appropriate, but could also distort the impact of government across the economy."
        },
        {
            "text": "The risk of distortions could be countered by ‘matching’ new measures and offsets in some way, by requiring offsets to come from the same sector, policy area or department. The original UK One-In-One-Out initiative combined an overall cross-government offsetting rule with separate departmental accounts. However, the setting of constraints by department or policy area risks weakening the overall coherence of government’s overall regulatory programme."
        },
        {
            "heading": 2,
            "text": "Contributing your views"
        },
        {
            "text": "If you have views on these issues, there is not long left to feed them in. The consultation closes on 1 October."
        }
    ]
}