{
    "url": "https://defradigital.blog.gov.uk/2023/06/04/why-carers-week-is-important-to-me/",
    "title": "Why Carers Week is important to me",
    "authors": [
        "Hannah John"
    ],
    "categories": [
        "Defra services"
    ],
    "pub_date": "2023-06-04T07:00:51+01:00",
    "content": [
        {
            "text": "In Carers Week, Defra group Senior Security Advisor Hannah John reflects on how she balances a fast-paced career with being a mother and a carer."
        },
        {
            "text": "When people ask me what I do, I often say I have three jobs – I’m a civil servant, a mother, and a pancreas! It’s the last one of those that I’m focusing on with this Blog, in terms of my role caring for my youngest daughter, who was diagnosed as Type 1 Diabetic, aged five, in 2015."
        },
        {
            "text": "This means that her pancreas cannot produce the insulin hormone needed to process glucose, which will be fatal unless alternative insulin is provided, either via injections or an insulin pump."
        },
        {
            "text": "At the time she was diagnosed, I was the Head of Security Policy and Awareness at the Department for Work & Pensions, leading a team of around 30, super-ambitious (having just been accepted for the High Potential Future Leaders scheme), and with my sights firmly set on joining the Senior Civil Service before long."
        },
        {
            "text": "Becoming a carer, and shortly afterwards separating from my husband to become a single parent to my two young girls, meant I quickly had to adjust my priorities. Of course, my first priority was to support her, and to increase my own understanding of how to manage the condition, so I did a lot of research, and learned how to count the carbohydrates in her food to calculate her insulin doses, and to support her school to do the same. Unfortunately, blood sugar is not only impacted by food, but also by exercise, hormones, the weather and adrenaline so it can be quite tricky to manage!"
        },
        {
            "heading": 2,
            "text": "A long list of challenges to overcome"
        },
        {
            "text": "Those first few years as a carer were very difficult. For me, the main challenges were:"
        },
        {
            "heading": 2,
            "text": "And then Covid raised the bar even further"
        },
        {
            "text": "Covid was an especially scary time, with her in the “vulnerable” category, and my sudden realisation that if anything happened to me, nobody would know how to look after her. I wrote a 10-page document on “how to keep my child alive”, giving all the instructions, phone numbers, settings that I could think of, and sent it to my parents and her dad."
        },
        {
            "text": "With extra time at home, and the transition to secondary school looming, I gradually began encouraging her to take more responsibility for managing her condition herself. Combined with new hybrid closed loop insulin pump technology, this helped to reduce the pressure (and reliance) on me and, once she was settled in Year 7, enabled me to focus a bit more on myself and my career aspirations again."
        },
        {
            "text": "A huge support has been the T1D parent community, which I discovered via Facebook, and since 2019 I have been organising a group of around 40 T1D families to meet up at a caravan park in the Cotswolds once a year. My daughter and I had never met anyone else with T1D before this, so it was a revelation, and also a lovely way for both of us to make friends that “got it.”"
        },
        {
            "heading": 2,
            "text": "Choosing the right employer is so important"
        },
        {
            "text": "I did my research before joining Defra, after finally securing promotion to the Senior Civil Service in October 2022. I knew it had a reputation for being a flexible and caring department, which I’m pleased to say has proven to be the case. I have felt able to provide her with the support she needs, to take time out to monitor her blood sugar levels, speak to her school and attend her medical appointments."
        },
        {
            "text": "I know I will continue to need that support as my caring responsibilities grow to include my ageing parents and supporting my father through cancer treatment.  That’s why I am keen, through this blog, through my leadership of the Defra group security function, and through my involvement with the DDTS women’s network, to support other carers to feel seen, recognised and supported."
        },
        {
            "text": "Reflecting on the past eight years as a carer, my key takeaways/learnings would be:"
        }
    ]
}