{
    "url": "https://environmentagency.blog.gov.uk/2025/08/22/cleaning-up-scarborough-south-bay-a-complex-challenge/",
    "title": "Cleaning Up Scarborough South Bay: A Complex Challenge",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Cleaner Seas",
        "Community",
        "Water"
    ],
    "pub_date": "2025-08-22T11:53:11+00:00",
    "content": [
        {
            "text": "Scarborough South Bay and its beach are one of England’s best-loved seaside destinations. Families, holidaymakers and locals all flock to its sandy shores each summer. But behind the scenes, the Environment Agency (EA) is leading a major effort with partners including the local council, businesses and the water company to tackle an issue that has troubled the bay for years: the quality of the bathing water."
        },
        {
            "text": "Significant investment was made by Yorkshire Water between 2009 and 2014, when along with the EA, local councils and others, they were part of the Yorkshire Bathing Water Partnership working to improve water quality all along the Yorkshire coast.  The issues affecting bathing water quality are complex and Scarborough South Bay has struggled to meet the standards, often classified as Poor – meaning there is advice against bathing.  We understand how frustrating that is for everyone who cares about the town. But it also shows just how complicated the problem really is."
        },
        {
            "text": "Where does the pollution come from?"
        },
        {
            "text": "When people hear about poor water quality, many think first of sewage, particularly as there has been a lot of media coverage about this. Storm overflows and wastewater treatment plants do play a part and Yorkshire Water has already spent millions improving local infrastructure and is investing more under its current programme. For example, recent work completed at Wheatcroft Combined Sewer Overflow, to the south of the beach, aims to limit discharges during the bathing season."
        },
        {
            "text": "But sewage is only one piece of the puzzle. Studies led by the EA show that several sources have a real impact on the bay:"
        },
        {
            "text": "The real challenge is the impact of these sources varies with weather, tides, and seasons. No single cause explains all the results, making solutions far from simple."
        },
        {
            "text": "Partnership working"
        },
        {
            "text": "Because no single factor is the cause of poor water quality, no single organisation can solve the issue. That’s why the EA continues to work in partnership with Yorkshire Water, McCain Foods and North Yorkshire Council."
        },
        {
            "text": "Together, they are funding detailed scientific investigations, investing in infrastructure, and holding regular “Scarborough Summits” to bring everyone around the table. In the summer of 2024, the EA coordinated one of the most detailed water quality studies ever carried out in Scarborough, supported financially by all three partners. Samples are now being analysed by EA scientists, with results due shortly which will inform the next steps."
        },
        {
            "text": "Here at the EA not only are we driving the science but also coordinating the partnership needed to improve  the  water quality at the beach."
        },
        {
            "text": "Why it matters"
        },
        {
            "text": "Scarborough South Bay is central to the town’s economy, tourism and identity. We know that protecting its waters means protecting livelihoods and preserving Scarborough’s reputation as a great English seaside resort."
        },
        {
            "text": "Improving bathing water quality is about understanding and managing many overlapping sources – from birds to farms, from industry to infrastructure – everyone has a part to play. That requires scientific expertise, long-term monitoring and cooperation between public bodies, businesses, and communities."
        },
        {
            "text": "Visitors and residents can also play their part by reducing food waste and throwing litter in the waste bins provided."
        },
        {
            "text": "Looking ahead"
        },
        {
            "text": "The good news is that progress is being made. The summer of 2024 already showed signs of improvement, though scientists caution that more monitoring is needed to confirm whether this is a genuine trend. With McCain’s new treatment plant in place, Yorkshire Water’s investment under way, North Yorkshire Council’s renewed commitment, and the EA providing scientific leadership, there is real hope that Scarborough South Bay can turn a corner."
        },
        {
            "text": "For now, the message is clear: committed partnership working and major resources and expertise being deployed gives Scarborough South Bay the best chance to become the bathing water the local community and its visitors deserve."
        }
    ]
}