{
    "url": "https://defraenvironment.blog.gov.uk/2024/08/14/a-day-in-the-life-of-a-peatland-contractor/",
    "title": "A day in the life of a peatland contractor",
    "authors": [
        "Jonny Bainbridge"
    ],
    "categories": [
        "Nature",
        "Peat"
    ],
    "pub_date": "2024-08-14T09:21:39+01:00",
    "content": [
        {
            "text": "Peatlands are precious habitats.  "
        },
        {
            "text": "They lock in carbon, create important habitats for wildlife, reduce flood risk and help to control wildfires.  "
        },
        {
            "text": "We previously wrote about some of the work going on to restore peatlands.  "
        },
        {
            "text": "In this post, we’re hearing from peatland contractor Jonny Bainbridge, as he shares a typical day carrying out crucial work in remote and challenging environments. "
        },
        {
            "text": "A day in the life of a peatland contractor  "
        },
        {
            "text": "My name is Jonny Bainbridge, and I operate my own agri-environmental contracting business. Based in Teesdale, County Durham, we specialise in peatland restoration and upland moorland works across the North Pennines National Landscape, providing services to local authorities, government bodies, private estates and landowners. "
        },
        {
            "text": "The winter peatland restoration season is our busiest time of the year despite it being the worst weather conditions and shortest daylight hours. "
        },
        {
            "text": "Out on the fell, in the middle of winter, whether it's raining, windy, snowing (or all 3!) the team head out onto the open moorland. "
        },
        {
            "text": "A typical day starts at 07:30, when the team arrive at our base on the family farm to collect the machines, equipment, tools and materials they need for their role in the peatland restoration process. "
        },
        {
            "text": "Restoration in action  "
        },
        {
            "text": "A team of between 2 and 4 skilled excavator operators navigate to the restoration site of degraded ‘blanket bog’, using a specialist, multi-terrain vehicle called an Argocat. (Blanket bog is an area of peat formed in upland areas where the climate is cool and wet). "
        },
        {
            "text": "There, they work on the drainage channels: naturally eroded gullies and man-made grips, which were dug out to drain the bog after the war, when food production was a national priority. "
        },
        {
            "text": "The team re-profile the edges of these channels, changing the angle from clifflike structures (up to 2 metres in height) to gently sloping, stable edges. They then re-vegetate using small sections of turf from the surrounding area.  "
        },
        {
            "text": "This work prevents the water undercutting bare edges, eroding tonnes of peat every time it rains. "
        },
        {
            "text": "They also install dams into the grips. "
        },
        {
            "text": "Harvesting moss-rich nurse crop"
        },
        {
            "text": "Another team will head off to harvest nurse crop – which, when added to a restoration site, acts as a mulch on the bare peat, helping to prevent erosion and providing a perfect microclimate for mosses and plants to regenerate."
        },
        {
            "text": "The nurse crop is a mixture of moorland vegetation with a high percentage of moss, cut from a healthy, thriving section of the fell."
        },
        {
            "text": "The team harvest material, which fills large tonne bags in readiness for airlifting out onto the restoration area."
        },
        {
            "text": "Air lifting materials "
        },
        {
            "text": "The restoration sites where we work are so sensitive that it is not possible to transport large quantities of materials over the ground. So, we instead use helicopters.  "
        },
        {
            "text": "Helicopters are capable of lifting 1.8 tonnes of stone, timber, coir or moss-rich nurse crop per flight. That makes them very efficient for getting materials out to remote moorland sites, which are often several miles away from even the closest moorland track. "
        },
        {
            "text": "Hard graft "
        },
        {
            "text": "The final team head out to the worksite to carry out what is probably the hardest, and most challenging element of our projects: the jobs that can only be done by hand.  "
        },
        {
            "text": "These include: "
        },
        {
            "text": "At the end of the working day, the teams all head back down off the fell as the daylight fades. "
        },
        {
            "text": "When the work is done, everyone comes back to the yard, satisfied to have completed a job that not only helps to stop further damage to our precious peatlands, but actively improves them for future generations. "
        },
        {
            "text": "We like to feature individuals working in or with Defra. If you're interested in reading more stories like this one, please subscribe to receive an email notification whenever a new post is published."
        }
    ]
}