{
    "url": "https://mhclgmedia.blog.gov.uk/2024/08/14/deputy-prime-minister-visits-stoke-on-trent-in-light-of-recent-violent-disorder/",
    "title": "Deputy Prime Minister visits Stoke-On-Trent in Light of Recent Violent Disorder",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Communities"
    ],
    "pub_date": "2024-08-14T12:37:57+01:00",
    "content": [
        {
            "text": "The Deputy Prime Minister visited Stoke-On-Trent yesterday (13 August) where she heard first-hand from those who were impacted by recent violent disorder."
        },
        {
            "text": "There has been coverage of the visit in BBC News online, Stoke-On-Trent Live and on BBC Midlands. Coverage notes community leaders said children \"are feeling scared\" in Stoke-on-Trent after recent unrest which included missiles being thrown at police, and the Deputy Prime Minister reaffirmed decisive action is being taken to stem further violence and swiftly bring those who contributed to the disorder to justice. There is mention of how communities have come together in opposition to hatred and violence, and that the Government is committed to supporting communities following the recent unrest."
        },
        {
            "text": "The coverage also notes how Deputy Prime Minister outlined the Government’s plans to build more housing, invest in public services, and boost regional growth through Local Growth Plans that will spark “a new era of long-term national renewal”."
        },
        {
            "text": "Deputy Prime Minister Angela Rayner said:"
        },
        {
            "text": "“It has been powerful listening to those who experienced the violence that took place here in Stoke-on-Trent."
        },
        {
            "text": "“Police officers assaulted and missiles thrown, scenes which were completely unacceptable."
        },
        {
            "text": "“The appalling violence we’ve seen in our towns and communities has understandably left many feeling anxious and fearful."
        },
        {
            "text": "“Communities – like here in Stoke-on-Trent – have united in opposition to this hatred and violence.  But given the level of damage that has taken place we’re urgently looking at what more support we can give the most affected areas."
        },
        {
            "text": "“It’s important that we ensure communities across the country can thrive. That’s why we are on a national mission to boost growth in every region of the country."
        },
        {
            "text": "“Today I’m writing to our metro mayors to ask them to develop plans to shape the long-term future of their areas – some of which have been worst hit by the disorder."
        },
        {
            "text": "“I’m also asking local leaders across the country to join our mission to boost the economy in every region with Local Growth Plans."
        },
        {
            "text": "“Together we can spark a new era of long-term national renewal.”"
        }
    ]
}