{
    "url": "https://insidehmcts.blog.gov.uk/2024/08/14/finding-resolution-inside-the-small-claims-mediation-service/",
    "title": "Finding Resolution: Inside the Small Claims Mediation Service",
    "authors": [
        "HMCTS Communications"
    ],
    "categories": [
        "Civil",
        "Court and tribunal reform",
        "Digital services",
        "Podcast"
    ],
    "pub_date": "2024-08-14T14:00:04+01:00",
    "content": [
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "text": "Discover how our Small Claims Mediation Service is helping to resolve disputes without the potential stress of having to go to court."
        },
        {
            "text": "In this episode, we’ll explore the benefits of mediation and hear the real-life story of David Kerry, one of our satisfied users who successfully used the service to find a resolution to his dispute with a large company."
        },
        {
            "text": "We’ll also hear from David Franks, one of our new mediators, as he tells us more about the purpose of his role and the support available to users."
        },
        {
            "text": "Listen now to find out more about the recent changes to the Small Claims Mediation Service, and how the service can help to find a quicker resolution to your disputes."
        },
        {
            "text": "Listen to the latest episode now, available wherever you get your podcasts from!"
        },
        {
            "text": "Amazon"
        },
        {
            "text": "Apple"
        },
        {
            "text": "Buzzsprout"
        },
        {
            "text": "Spotify"
        },
        {
            "text": " "
        },
        {
            "text": "A transcript of the podcast is also available here."
        },
        {
            "text": " "
        },
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "heading": 1,
            "text": "Dod o hyd i Ddatrysiad: Tu mewn i'r Gwasanaeth Cyfryngu Hawliadau Bychain"
        },
        {
            "text": "Darganfyddwch sut mae ein Gwasanaeth Cyfryngu Hawliadau Bychain yn helpu i ddatrys anghydfodau heb y straen posibl o orfod mynd i’r llys."
        },
        {
            "text": "Yn y bennod hon, byddwn yn archwilio buddion cyfryngu ac yn clywed hanes bywyd go iawn David Kerry, un o’n defnyddwyr bodlon a ddefnyddiodd y gwasanaeth yn llwyddiannus i ddod o hyd i ddatrysiad i’w anghydfod gyda chwmni mawr."
        },
        {
            "text": "Byddwn hefyd yn clywed gan David Franks, un o’n cyfryngwyr newydd, wrth iddo ddweud mwy wrthym am ddiben ei rôl a’r cymorth sydd ar gael i ddefnyddwyr."
        },
        {
            "text": "Gwrandewch nawr i ddarganfod mwy am y newidiadau diweddar i'r Gwasanaeth Cyfryngu Hawliadau Bychain, a sut y gall y gwasanaeth helpu i ddod o hyd i ddatrysiad cyflymach i'ch anghydfodau."
        },
        {
            "text": "Gwrandewch ar y bennod ddiweddaraf nawr, ar gael o ble bynnag rydych chi'n gwrando ar eich podlediadau!"
        },
        {
            "text": "Amazon"
        },
        {
            "text": "Apple"
        },
        {
            "text": "Buzzsprout"
        },
        {
            "text": "Spotify"
        },
        {
            "text": " "
        },
        {
            "text": "Mae trawsgrifiad o'r podlediad ar gael yma hefyd."
        }
    ]
}