{
    "url": "https://ruralpayments.blog.gov.uk/2024/08/14/introducing-you-to-22/",
    "title": "Introducing you to...",
    "authors": [
        "Rural Payments Agency"
    ],
    "categories": [
        "Grants",
        "Introducing You To"
    ],
    "pub_date": "2024-08-14T14:55:35+01:00",
    "content": [
        {
            "text": "Hi, I’m Nicole Villani and I’ve been working as a summer intern with RPA’s Grants Service team, based in Nottingham."
        },
        {
            "text": "I got the nine-week role as part of the Civil Service’s summer internship programme, after completing an internship in the private sector last summer. When I finish later this month I’ll go into my third year of studying history at the University of Birmingham."
        },
        {
            "text": "My role is to lead an external user testing programme gathering views of a new IT application service.  This will aid continuous improvement of the service and influence future IT development."
        },
        {
            "text": "I created an external survey to send out to customers to understand their experiences. I also created an internal survey for colleagues in Grants Service who work on phone and email helplines for insight on the feedback they’ve received. When we sent out the external survey we asked if we could contact people directly, so I’ve spoken with a number of farmers to hear more about their responses."
        },
        {
            "text": "Once completed, the work will have long-term benefits to our customers. By getting their feedback on their experience of the service, Grants Service will be able to understand the positive aspects as well as pinch points. This feedback will help improve the service which will make customers’ lives easier."
        },
        {
            "text": "It's a full-time role, and very busy. I’ve also been lucky enough to speak with other colleagues within RPA and Defra to understand the work done across the sector. I’ve had the opportunity to attend both RPA’s and Defra’s executive committee meetings which has given me insight into what the areas of work they cover."
        },
        {
            "text": "I’ve been given really great support by RPA. My line manager and interim manager have been very helpful. They’ve examined my work and suggested changes, as well as helping me to get into contact with the right people. I’ve really enjoyed getting to meet new people in different areas of RPA and understanding the effect grants have on farmers."
        },
        {
            "text": "I’m proud of producing the external survey and pleased that customers are responding to it. I am, however, more proud of the impact this piece of work will have both in Grants Service and to our customers in the future."
        },
        {
            "text": "I’m really enjoying my internship and it’s been invaluable in helping me understand how the Civil Service works. It’s been a great experience making connections with people and taking advantage of as many opportunities as possible. The allocations for departments in the internship are randomised, and the RPA is not something I would necessarily have thought about, but it really is amazing to see how much support there is for farmers."
        }
    ]
}