{
    "url": "https://naturalengland.blog.gov.uk/2024/08/14/introducing-natural-englands-science-advisory-committee/",
    "title": "Introducing Natural England’s Science Advisory Committee",
    "authors": [
        "Prof Sallie Bailey"
    ],
    "categories": [
        "Natural England",
        "Nature Recovery",
        "Science and evidence"
    ],
    "pub_date": "2024-08-14T17:19:15+01:00",
    "content": [
        {
            "text": "Prof Sallie Bailey, Chief Scientist"
        },
        {
            "text": "I am excited to have started my role as Chief Scientist and recently attended my first meeting of Natural England’s Science Advisory Committee (NESAC). NESAC is a formal committee of Natural England’s Board, who are tasked with ensuring, using sound science and evidence, to deliver thriving nature for people and planet."
        },
        {
            "text": "Our current Chairs are Prof Clare Fitzsimmons from the University of Newcastle and Prof Lynn Dicks from the University of Cambridge, both work alongside some of the leading academics and scientists from a range of Non-Government Organisations."
        },
        {
            "text": "During our most recent meeting we discussed a wide range of topics, including how Natural England could  effectively use emerging AI technology. It was encouraging to see how the Committee works to develop thinking and expand ideas, providing helpful scrutiny and challenge on the rationale and methods for projects to ensure Natural England continues to use the best available evidence in our decision making."
        },
        {
            "text": "Specialisms of Committee members"
        },
        {
            "text": "NESAC spans a wide variety of specialisms, with members leading experts in topics such as; animal ecology; marine ecosystems; ornithology, ecological and statistical research; landscape ecology; fluvial geomorphology; biogeochemistry of aquatic systems and economics of natural resource management."
        },
        {
            "text": "Whilst the Committee has a vast array of specialisms, other areas NESAC would like to expand into include:"
        },
        {
            "text": " "
        },
        {
            "text": "Would you like to help shape the future of nature recovery?"
        },
        {
            "text": "Would you like to be part of NESAC and provide independent advice, challenge and review NE’s Science and Evidence functions? NESAC is seeking to appoint new members from across the scientific community. As a member of the Committee, you would normally be expected to serve for at least 3 years, attending 4 meetings per year. In addition, members will have the opportunity to attend and contribute to relevant Natural England events, such as NESAC Science Seminars, Natural England Science to Delivery conferences and workshops. Please note, these posts are not salaried but Natural England will reimburse appropriate travel costs. Our governance pages provide more information on this."
        }
    ]
}