{
    "url": "https://forestrycommission.blog.gov.uk/2024/08/14/is-agroforestry-right-for-your-farm-new-funding-to-help-plan-and-establish-agroforestry-systems/",
    "title": "Is agroforestry right for your farm? New funding to help plan and establish agroforestry systems",
    "authors": [
        "Jim O'Neill"
    ],
    "categories": [
        "Tree planting",
        "Woodland creation"
    ],
    "pub_date": "2024-08-14T13:30:44+01:00",
    "content": [
        {
            "text": "I have spent over 30 years working with farmers and land managers in East Cumbria, creating and managing farm woodlands from small to large."
        },
        {
            "text": "More recently, I became interested in a more integrated land management approach, bringing farming and forestry closer together with a common aim, to support farm businesses and their environmental outcomes."
        },
        {
            "text": "On 5 August, Defra added a range of new agroforestry capital items to the existing Sustainable Farming Incentive (SFI). This is a really exciting opportunity to champion integrated land management on land and farms across England."
        },
        {
            "heading": 2,
            "text": "What is agroforestry?"
        },
        {
            "text": "Agroforestry is an ancient form of land management that is still practiced across the world, especially in countries where they experience challenging conditions, which in our own changing climate, we can learn from."
        },
        {
            "text": "It is the introduction of more trees and woodland into the farmed landscape - to support and benefit the farming system, maintaining or enhancing the farms main agricultural output."
        },
        {
            "text": "If you would like to learn more about the different types of agroforestry, read our new guide to agroforestry on GOV.UK."
        },
        {
            "heading": 2,
            "text": "The benefits of agroforestry"
        },
        {
            "text": "In England, intensification of agriculture in the mid-20th century saw a separation between trees and farming, but research shows there are many positive benefits of using trees to support food production and farm productivity."
        },
        {
            "text": "Well planned and managed agroforestry systems can help a farm business plan ahead for a changing climate and can provide real tangible benefits, without compromising productive farmland, such as:"
        },
        {
            "heading": 3,
            "text": "Direct environmental benefits"
        },
        {
            "heading": 3,
            "text": "Animal welfare improvements"
        },
        {
            "heading": 3,
            "text": "Wider benefits"
        },
        {
            "heading": 2,
            "text": "What new funding is available for agroforestry?"
        },
        {
            "text": "Within the launch of the new suite of grants, there is the ‘PA4: Agroforestry plan’, which can be used to help you consider whether agroforestry is right for your land. I would really encourage using this tool to explore how agroforestry could integrate with your current land use."
        },
        {
            "text": "The agroforestry plan is a funded capital item, designed to support and assist in planning, creating, improving and managing agroforestry systems. The plan takes a 'whole farm plan approach' considering how agroforestry fits within the context of your landholding, current land management practice and the local landscape."
        },
        {
            "text": "Importantly, it will outline how agroforestry supports your business objectives and how it contributes towards biodiversity outcomes. Agroforestry planning should be very much tailored to your individual circumstances and situation, and the plan gives you the flexibility and space to consider what is best for you, your business and your land."
        },
        {
            "text": "Following completion of the plan, if you decide you want to put agroforestry into practice, there are specific agroforestry capital items to plant trees and create new agroforestry systems, followed by annual revenue grants to support with maintaining and managing your new agroforestry systems."
        },
        {
            "heading": 2,
            "text": "How much is available?"
        },
        {
            "heading": 3,
            "text": "Capital grants"
        },
        {
            "text": "PA4 Agroforestry Plan: £1,268.08/plan."
        },
        {
            "text": "AF1: Plant an agroforestry woodland tree: £5.40/tree."
        },
        {
            "text": "AF2: Plant an agroforestry fruit tree: £17.83/tree."
        },
        {
            "text": "AF3: Supplement: Species diversity bonus (to support at least 5 species in an agroforestry system): £1.16/tree."
        },
        {
            "text": "Use the Countryside Stewardship grant finder tool to find these."
        },
        {
            "heading": 3,
            "text": "Revenue grants"
        },
        {
            "text": "AGF1: Maintain very low density in-field agroforestry on less sensitive land. From 30 trees per ha to 50 trees per ha. £248/year/3 years/renewable at end of contract."
        },
        {
            "text": "AGF2: Maintain low density in-field agroforestry on less sensitive land. From 51 trees per ha to 130 trees per ha. £385/year/3 years/renewable at end of contract."
        },
        {
            "text": "Use the Find funding for land or farms tool to find these."
        },
        {
            "heading": 2,
            "text": "How to access support"
        },
        {
            "text": "Agroforestry has growing support across England and 'early adopters' who have pioneered the practice, often without grant aid, have made it a success for them, clearly demonstrating that productivity can be increased from the same parcel of land if designed and managed well."
        },
        {
            "text": "There is help available to talk through how you might add more trees to your farm to help you achieve your goals and perhaps exceed them. The Forestry Commission and Natural England will be working in close partnership to support potential applicants who are considering agroforestry on their land."
        },
        {
            "text": "We have 10 new Agroforestry Woodland Officers (AFWOs) across England to provide advice and guidance on how to progress applications."
        }
    ]
}