{
    "url": "https://environmentagency.blog.gov.uk/2024/08/14/one-fish-two-fish-red-fish-blue-fish-a-day-surveying-on-the-river-stour/",
    "title": "One Fish, Two Fish, Red Fish, Blue Fish: A Day Surveying on the River Stour",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Environment Agency",
        "Fisheries and biodiversity"
    ],
    "pub_date": "2024-08-14T09:45:50+00:00",
    "content": [
        {
            "text": "My name is Dan Hayter and I work for the Environment Agency in East Anglia. Part of my job involves monitoring the number of fish we have in our rivers and one way I do this is through fish surveys. Today I am going to talk you through an electric fish survey that we did along the River Stour at Dedham."
        },
        {
            "text": "The National Monitoring Field Team undertake fish surveys along all the main rivers and tributaries in East Anglia. Some sites are done yearly, others every 3 years. The timings for the river surveys are dependent on a number of factors including fisheries interest and the size of the river."
        },
        {
            "text": "To conduct a fish survey, we measure out a 100-metre stretch of the river and place a large stop net at the start and end of the stretch to prevent fish moving in and out during the survey.\nFour of us then get in a motorised boat and travel along the stretch with specialised electric fishing equipment. We usually have one person manoeuvring the boat, two people operating the handheld electrodes (these are stainless steel hoops on the end of a long pole) and one with a net catching the fish and moving them to a recovery and holding container ready for us to count.\nElectric fishing involves us passing a mild electrical field through the water to temporarily immobilise the fish. This allows us to catch them."
        },
        {
            "text": "Electro-fishing may sound a little scary, but it is harmless to the fish and is a very humane way of catching them and allowing us to carry out this vital work. We carry out these fish surveys for several reasons. It is obviously useful for the millions of anglers out there to know information about fish stocks, and it also gives us a good indication of the health of the river."
        },
        {
            "text": "The fish survey can take 10-12 hours on a very busy day, the more fish there are, the more there are to count and therefore the longer we are there. When conducting the survey, we start in the middle of the stretch first and then go along the sides, using the current to safely capture the fish. We then repeat this once or twice more to ensure we have a good capture efficiency and get accurate fish data."
        },
        {
            "text": "When we count the fish, we note down the species and length. During our survey along the river Stour we caught 15 species and more than 600 fish including eel, chub, roach, bleak, dace, tench, pike, bullhead, spined loach, gudgeon, perch and flounder. At the end of the survey all of the fish get returned to the river and the nets are removed."
        },
        {
            "text": "We have 40 years of data for this stretch of river making it one of the best data sets for electric fishing in the UK. You can view the data for all rivers here: EA Ecology & Fish Data Explorer. Long term monitoring like this is vital to look at changes in the environment especially with the current and future effects of climate change"
        },
        {
            "text": "These surveys are being done as part of the National Fisheries Monitoring Programme alongside the Water Framework Directive and other monitoring programmes. The Water Framework Directive is a piece of legislation designed to preserve, restore and improve the water environment. It establishes a framework for managing the water environment in a holistic manner taking into account environmental, social and economic factors."
        },
        {
            "text": "Subscribe to updates from the Environment agency or follow us on X"
        }
    ]
}