{
    "url": "https://socialcareinspection.blog.gov.uk/2024/08/14/providing-good-experiences-for-children-with-complex-needs/",
    "title": "Providing good experiences for children with complex needs",
    "authors": [
        "Yvette Stanley",
        "Gillian Churchill, Head of Research"
    ],
    "categories": [
        "children's homes",
        "children's services",
        "local authorities",
        "looked after children",
        "mental health",
        "social care professionals"
    ],
    "pub_date": "2024-08-14T09:00:23+01:00",
    "content": [
        {
            "text": "In January, we published a new research report on children with complex needs in children’s homes. The report was based on a national survey of local authorities and children’s home providers across England to help us understand the extent of the difficulties they have when finding homes for children with these needs, and the barriers homes face in accepting them. We also carried out 10 case studies to identify good practice among local authorities and children’s homes, as well as the barriers they face and how practice could improve."
        },
        {
            "text": "As we previously reported, the term ‘children with complex needs’ was used to describe children who have multiple needs of different types, and who require care and support from an array of professionals to meet their needs. These are typically children with severe mental health difficulties, or whose needs can manifest in behaviours that place the child or others at risk."
        },
        {
            "text": "If you run a home that cares for children with complex needs, you may want to consider the good practice discussed here, and whether these examples can help you provide good experiences for the children in your care, and ensure they make progress."
        },
        {
            "text": "What we found"
        },
        {
            "text": "The research revealed a challenging national picture:"
        },
        {
            "text": "Good practice"
        },
        {
            "text": "However, we did find some common practices that resulted in good experiences for children. These included:"
        },
        {
            "text": "Collaboration between agencies was also a vital common thread. When all the necessary information about a child’s needs is available to all relevant parties, decision-makers can tell whether a home will be a good fit. Joint working was also necessary to create bespoke placements targeted at a child’s individual needs."
        },
        {
            "text": "These features are important for any child in care. But for children with complex needs, they are vital. We will deal with each of these elements in turn below."
        },
        {
            "text": "Considering a child’s preferences"
        },
        {
            "text": "Involving children in decisions means they are more likely to feel positive about a placement or engage more readily with a service. It is also important to keep children informed about their options, how their preferences are being implemented, and any changes in their care."
        },
        {
            "text": "Through the case studies in this research, we saw examples of how staff considered and implemented children’s preferences when children were moving into a new home – which can be disruptive and scary for any child. Where we saw this done well, it was because the child’s preferences led the transition process."
        },
        {
            "text": "Providing consistency"
        },
        {
            "text": "Maintaining some consistency for a child during a move into a new home, and then while they live there, is also important."
        },
        {
            "text": "It allows the child the time and opportunity to:"
        },
        {
            "text": "Getting children access to the right services and placements"
        },
        {
            "text": "We know it is difficult to get access to external services for children, particularly mental health support. This is especially true for children with complex needs, as they often live in homes outside their original local authority and are some of those most in need of mental health support. Through the case studies, we saw various ways that children’s home staff were helping children to access mental health services."
        },
        {
            "text": "Finding the right education placement for a child is also really important. We saw through our case studies that when children engaged with an education placement that suited their needs, the positive effects spilled over into many areas of their lives."
        },
        {
            "text": "Facilitating a sense of belonging"
        },
        {
            "text": "Children feel more stable and have a greater sense of belonging when they know the long-term plans for their care. This removes uncertainty for them and helps them to feel more invested in making a placement work and seeing where they live as their home. The relationships children had with staff were also crucial in making them feel at home and like they belong. When staffing was consistent, this benefited relationships. But, most importantly, children’s sense of belonging was strengthened when staff were able to demonstrate their commitment to children."
        },
        {
            "text": "Inspections of home caring for children with complex needs"
        },
        {
            "text": "We know that some homes still hesitate to accept referrals for children with complex needs because they are concerned about how it might affect their Ofsted inspection outcomes. As we’ve said before, there is no need to worry about this. The inspection grades among homes that care for children with complex needs are no lower than among all homes generally."
        },
        {
            "text": "But we know the perception persists and could limit the number of homes available for the children who absolutely need residential care. So, we continue trying to address homes’ concerns and reassure you that accepting children with complex needs will not affect your inspection outcome. Indeed, we mostly see children with wide-ranging needs supported well in caring homes."
        },
        {
            "text": "As professionals with many years of experience in the sector, we know that children’s progress will not be linear. There will be crises and setbacks in their journey. Packages of support will need to be reviewed and adapted. And we know that we might need to look beyond what is happening on a particular day to consider the children’s care and support over a longer period."
        },
        {
            "text": "We intentionally designed the SCCIF to focus on children’s experiences and progress, rather than their outcomes at a moment in time. The framework is intended to look at what adults are doing to help the children in their care have the best possible experiences and make progress that is individual to them."
        },
        {
            "text": "We know we have more to do to reassure commissioners and providers, and we will continue to work with the sector to manage these sensitivities."
        },
        {
            "text": "One of the topics raised in the Big Listen was children with multiple and complex needs. We are considering all the feedback and will respond in the coming weeks."
        },
        {
            "text": "Although this research highlighted persistent challenges in the sector, many of the case studies provided uplifting examples of the good work being done to support vulnerable children with multiple and varied needs."
        }
    ]
}