{
    "url": "https://defrafarming.blog.gov.uk/2024/08/14/theres-still-time-to-get-free-business-advice/",
    "title": "There’s still time to get free business advice",
    "authors": [
        "Sarah McGinn"
    ],
    "categories": [
        "Transition support"
    ],
    "pub_date": "2024-08-14T16:07:22+01:00",
    "content": [
        {
            "text": "The Farming Resilience Fund offers free, tailored business support to help farmers and land managers plan during the early years of the agricultural transition.  "
        },
        {
            "text": "With over 100 actions available through the Sustainable Faring Incentive (SFI), a range of grants to explore and with the advice offer ending in early 2025, now is a good time to talk to an adviser and plan for the future.  "
        },
        {
            "text": "If you've received direct payments since October 2022, you're eligible. "
        },
        {
            "heading": 2,
            "text": "How to get advice "
        },
        {
            "text": "The full list of advice providers is available on GOV.UK. "
        },
        {
            "text": "The list includes the types of advice each organisation offers, organised by county."
        },
        {
            "text": "Their contact details are included, so all you need to do is call or email them. "
        },
        {
            "text": "You can only receive support from one provider, so choose the one that best suits your needs. "
        },
        {
            "text": "An adviser can explain:"
        },
        {
            "text": "This advice can be delivered through: "
        },
        {
            "text": "If you have trouble accessing the list of providers online, call Defra’s helpline on 0345 933 5577. "
        },
        {
            "heading": 2,
            "text": "What farmers say "
        },
        {
            "text": "Suffolk-based Peter Havers farms with his son John and daughter Amy. They were unsure how to improve the resilience of their farm. Peter said: “The FFRF [programme] helped set us on the right path and I am pleased to say we now have more confidence in the future for the business”."
        },
        {
            "text": "A lowland grazing livestock farmer in Leicestershire said: “This has been an extremely useful and topical programme. It has been especially valuable in getting farmers to meet and share practices and challenges in making our farms more resilient. The presentations and workshops have been delivered by highly knowledgeable people. I have benefitted from being on this programme and it has made me think differently about things I'd previously taken for granted.”"
        },
        {
            "text": "S A Smith & Sons, a mixed sheep and cattle farming business in North Yorkshire said: “They understood how the business works and what we wanted to achieve. They tailored options to suit what we wanted to do based on our business rather than bringing in loads of different options that may not work.”"
        },
        {
            "text": "One Derbyshire-based farmer running a mixed farm said: “[My adviser] Told me what was available from the vast array of options.\""
        },
        {
            "text": " If you have any questions, just leave a comment below."
        }
    ]
}