{
    "url": "https://charitycommission.blog.gov.uk/2024/08/14/unrest-highlights-value-of-charity-kindness-and-voice-in-national-life/",
    "title": "Unrest highlights value of charity kindness and voice in national life",
    "authors": [
        "Orlando Fraser KC"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2024-08-14T09:28:01+01:00",
    "content": [
        {
            "text": "The toxicity unfolding online and on our streets over recent weeks has been shocking and disturbing. The events have demonstrated how easily vocal minorities can exploit division and incite violence."
        },
        {
            "text": "But my belief in the strength of our communities, and of our society as a whole, is undiminished. As Chair of the Charity Commission, I see first-hand the positive difference charities up and down the country make, every day, in supporting the most vulnerable, bringing people together, making our society stronger. Indeed, charities are already serving as beacons of hope in the wake of the horrific murders in Southport, and the subsequent violence, raising funds for communities affected, and acting with skill and pace to help heal damaged communities."
        },
        {
            "text": "Charities do this good work not just through action, but also in word: charities remain among the most trusted groups in society and as such have unparalleled moral authority in speaking out on behalf of the people and causes they support, advocating for positive change, pushing for a kinder, fairer world."
        },
        {
            "text": "As regulator, the Commission has been determined to promote public trust in the legitimacy and credibility of charity campaigning. We have done that, not least, by protecting what is special about charities – ensuring charities campaign within the framework set by law, stopping charities straying into party-political campaigning, requiring that any campaigning must only be in furtherance of an organisation’s particular charitable purpose, and setting expectations that charities model a better kind of public discourse in our divided world."
        },
        {
            "text": "This week we published a report on our regulatory activity during the 2024 General Election. It tells a hopeful story of a sector that is confident in speaking out within the boundaries set by the law. During the recent election, we opened fewer than half the number of high-risk cases examining concerns about charity campaigning, than we did in 2019. We also saw a rise in charities coming to us for help to get things right in the first place. Conversely, the report demonstrates that in the rare event that a charity does cross the line, we are unafraid to take decisive action. We have included some examples of this to help others learn from what went wrong. These findings should reassure the public that charities are and remain trustworthy voices for good, playing their important part in our essential democratic purpose."
        }
    ]
}