{
    "url": "https://moderncivilservice.blog.gov.uk/2025/05/29/celebrating-a-wave-of-innovation-scalable-experiments-from-the-one-big-thing-initiative/",
    "title": "Celebrating a wave of innovation: Scalable experiments from the One Big Thing initiative",
    "authors": [
        "Government Reform"
    ],
    "categories": [
        "A Modern Civil Service",
        "Capability",
        "Digital and data",
        "Government Reform",
        "Modernisation and Reform",
        "One Big Thing",
        "Policy",
        "Skilled Civil Service"
    ],
    "pub_date": "2025-05-29T11:18:12+01:00",
    "content": [
        {
            "text": "One Big Thing 2024, with its focus on innovation and efficiency, has catalysed a wave of transformative experiments across UK government. These experiments, fuelled by creative problem-solving and digital tools, have yielded remarkable results and set new standards for public sector operations. Read our One Big Thing blog article to find out more about the initiative."
        },
        {
            "text": "In this article, we showcase innovative solutions across three key categories: automation examples that free up valuable staff time, improvements to government functions and new ways of working that re-imagine team collaboration. Each case study demonstrates how small, scalable changes can deliver significant impact."
        },
        {
            "heading": 2,
            "text": "Innovation automation"
        },
        {
            "heading": 3,
            "text": "Automation in the Covid Inquiry Unit"
        },
        {
            "text": "The Ministry of Housing, Communities and Local Government's Covid Inquiry Unit harnessed the power of automation to revolutionise exhibit referencing (formally introducing and referencing documents such as photographs into a legal proceeding as evidence). Using Microsoft Visual Basic for Applications (VBA) scripts, they achieved a remarkable increase in processing speed, handling 392 exhibits in just one hour compared to 152 exhibits in eight hours with the manual process. This allowed the team to focus on 'value add' activities. This efficiency gain demonstrates the transformative potential of automation in information-intensive tasks."
        },
        {
            "heading": 2,
            "text": "Civil Service function case studies"
        },
        {
            "heading": 3,
            "text": "HR innovation - CSSU Flexpool"
        },
        {
            "text": "The Civil Service Strategy Unit's (CSSU) 'Internal first by default' experiment introduced a dynamic Flexpool system, enabling workstream leads to tap into a pool of skilled and motivated individuals within the CSSU for short-term assignments. This approach fosters a culture of collaboration, ensures efficient resource allocation, and maximises the utilisation of existing talent within the organisation."
        },
        {
            "heading": 3,
            "text": "Streamlining commercial framework agreements"
        },
        {
            "text": "The Commercial team at Integrated Corporate Services, which delivers services to the Department for Energy Security and Net Zero and the Department for Science, Innovation and Technology, revised their commercial approvals form to remove around a third of the content, deemed duplicative or unnecessary. This change adds up to a saving of 66.5 days work every year, meaning project timelines have shrunk and procurement is faster."
        },
        {
            "heading": 3,
            "text": "Procurement made simple"
        },
        {
            "text": "The procurement process can be complex and confusing, involving sourcing, risk assessment, value determination, process identification, payment options, and compliance. To simplify this for users, the Department for Education created a central 'How do I buy?' landing page. This user-friendly platform guides users through the decision-making process, directing them to the most suitable procurement approach for their needs. The page is simple, accessible, and tailored to user needs, with links to relevant resources. User feedback has been positive, with many appreciating the streamlined process and ease of finding information. The 'How do I buy?' page has improved efficiency, reduced errors, enhanced user experience, and increased confidence in navigating procurement."
        },
        {
            "heading": 3,
            "text": "AI-powered note-taking transforms meetings"
        },
        {
            "text": "The Government Communication Service (GCS) developed a comprehensive guide for using AI to generate standardised meeting notes. This innovation cut note-taking time in half and enabled the near-instantaneous transformation of meeting transcripts into concise and actionable notes. By leveraging AI, GCS empowered staff to focus on higher-value tasks and improved meeting outcomes."
        },
        {
            "heading": 2,
            "text": "Innovation in ways of working"
        },
        {
            "heading": 3,
            "text": "Creative sparks fly at the Met Office"
        },
        {
            "text": "The Met Office's introduction of daily 30-minute 'Creative Headspace' sessions unleashed a wave of innovation within the organisation. This initiative fostered a culture of creativity, leading to the development of engaging digital content, including GIFs that garnered a staggering 850 million views. The Met Office's success demonstrates the value of providing dedicated time for creative thinking and exploration."
        },
        {
            "heading": 3,
            "text": "Optimised meetings enhance productivity"
        },
        {
            "text": "A team at the UK Health Security Agency took a critical look at their meeting practices and implemented changes that yielded significant time savings. By adopting ad hoc attendance allocations and using Microsoft Loop for updates, they reduced meeting time by 11 hours per week, freeing up valuable time for other priorities."
        },
        {
            "heading": 3,
            "text": "Automated reporting saves time and boosts insights"
        },
        {
            "text": "The Department for Environment, Food and Rural Affairs embraced automation to streamline their monthly reporting process. By leveraging Power BI, they automated data collection and report generation, saving 33.3 hours per month. This digital transformation not only increased efficiency but also provided a centralised database for enhanced data analysis and insights."
        },
        {
            "heading": 3,
            "text": "Private law referral"
        },
        {
            "text": "The Official Solicitor and Public Trustee's Family Litigation team, part of the Ministry of Justice family, often received referrals missing key information requiring the team to individually chase each case. Utilising form functions on Gov.uk the team designed a clear \"Private Law Referral Form\", which has streamlined the customer journey by ensuring that essential information is captured at the first point of contact. In the months since launch, 20% of new Private Law case referrals are already using the form, helping the team to process cases more quickly and thereby avoiding unnecessary delay. Through modernising the process, the team's efficiency has increased, and their workload has decreased."
        },
        {
            "text": "These remarkable achievements from the One Big Thing initiative highlight the transformative power of innovation and digital solutions within the UK government. By embracing experimentation and creative problem-solving, departments across the UK are unlocking new levels of efficiency, productivity, and service delivery. The One Big Thing initiative demonstrates that even small changes can have a big impact when it comes to driving progress and improving public services."
        }
    ]
}