{
    "url": "https://defrafarming.blog.gov.uk/2025/05/29/farming-equipment-and-technology-fund-now-open/",
    "title": "Farming Equipment and Technology Fund now open ",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Payments for equipment, technology and infrastructure"
    ],
    "pub_date": "2025-05-29T10:07:41+01:00",
    "content": [
        {
            "text": "This is a short post to say that the Farming Equipment and Technology Fund 2025 (FETF) is now open for applications. "
        },
        {
            "text": "The fund is part of the Farming Investment Fund. It helps farmers, growers, foresters and contractors invest in equipment and technology that improve productivity, manage slurry, and support animal health and welfare."
        },
        {
            "heading": 3,
            "text": "Apply now"
        },
        {
            "text": "The guidance sets out the steps for you to apply."
        },
        {
            "text": "The application window is open for 6 weeks from today (29 May) and will close at midday on 10 July 2025. "
        },
        {
            "text": "It explains what’s available and how to apply. You’ll find details of the 3 funding themes:"
        },
        {
            "heading": 3,
            "text": "What the fund offers"
        },
        {
            "text": "The fund provides grants for a wide range of items, including equipment and technology that can:"
        },
        {
            "text": "Items are grouped into 3 themes. This helps applicants find what they need more easily. However, we encourage you to explore all the available items — you may find something useful outside your usual area of interest."
        },
        {
            "text": "You can apply for between £1,000 and £25,000 per theme. The percentage of the item cost that is covered varies."
        },
        {
            "heading": 3,
            "text": "About the funding"
        },
        {
            "text": "FETF 2025 is a competitive grant scheme. Each theme has its own assessment criteria. After the application window closes, all applications will be assessed and scored. This means:"
        },
        {
            "text": "In total, £46.7 million is available through this round:"
        },
        {
            "heading": 3,
            "text": "Learn more"
        },
        {
            "text": "We hosted a webinar on 21 May to explain how the fund works. The session covered:"
        },
        {
            "text": "You can watch the recording here. Good luck with your application. "
        }
    ]
}