{
    "url": "https://ukefdigital.blog.gov.uk/2025/05/29/from-the-inside-out-how-ddat-is-powering-ukefs-2025-vision/",
    "title": "From the inside out: how DDaT is powering UKEF’s 2025 vision",
    "authors": [
        "Dan Bowden"
    ],
    "categories": [
        "stategy",
        "User Centred Design"
    ],
    "pub_date": "2025-05-29T12:47:37+01:00",
    "content": [
        {
            "heading": 2,
            "text": "A message from Dan Bowden, Director of Digital, Data and Technology "
        },
        {
            "text": "As we continue to deliver on our mission to support UK exporters and drive sustainable growth, the role of digital, data and technology has never been more critical. Behind the scenes, our Digital, Data and Technology (DDaT) team is transforming how we work - building smarter services, embracing innovation, and helping UK Export Finance scale its impact. "
        },
        {
            "text": "I want to share how our digital strategy is aligning with UKEF’s wider goals, highlight some of the exciting progress we’ve made, and give you a glimpse into what’s next. The work we’re doing in DDaT touches every part of the organisation - and we’re just getting started. "
        },
        {
            "heading": 3,
            "text": "Driving digital transformation at UK Export Finance "
        },
        {
            "text": "At UKEF, 2025 is all about delivering impact - supporting UK businesses to grow, compete globally and win green business. Our updated business plan, launched last year, set out a clear mission: "
        },
        {
            "text": "DDaT is at the heart of making this happen. "
        },
        {
            "heading": 3,
            "text": "Powering progress through digital innovation "
        },
        {
            "text": "The DDaT directorate plays a key role in turning strategy into action. We’re focused on building smarter digital services, improving user experiences and delivering innovative solutions that meet both customer needs and our strategic goals. "
        },
        {
            "text": "Our approach is simple: create digital tools that are scalable, secure and easy to use. We’ve moved away from large, fixed IT contracts and traditional waterfall planning. Instead, we’re using agile, user-centred design - launching lightweight systems early, learning fast and scaling what works. "
        },
        {
            "heading": 3,
            "text": "Growth as a guiding principle "
        },
        {
            "text": "The government’s focus on growth shapes our digital priorities. We work closely with policy and business teams to make sure our digital products directly support UK exporters - especially SMEs. "
        },
        {
            "text": "By changing how we deliver services, we’re making it easier for businesses to get the support they need. Whether it’s simplifying applications or automating decisions, we’re building tools that grow with demand and deliver real value. "
        },
        {
            "heading": 3,
            "text": "Real-world impact: smarter services in action "
        },
        {
            "text": "One example is our digital and trade finance service (DTFS). It replaces an outdated system with a streamlined digital platform that lets lenders apply for guarantees on behalf of exporters. So far this year, 86% of underwriting decisions have been automated, helping us process deals faster and more efficiently. We’re continuing to bring in more financial institutions. "
        },
        {
            "text": "We’ve also digitised our export insurance application. What used to be a long paper form is now a quick, accessible online journey. A new 'get a quote' tool encourages more applications, and we’re already seeing a rise in policies - especially from SMEs. We’re now scaling up and making the export insurance offering even better, with new functionality letting exporters grow their credit limits easier. "
        },
        {
            "heading": 3,
            "text": "Embracing AI and data to drive smarter decisions "
        },
        {
            "text": "We’re taking a practical and transparent approach to artificial intelligence (AI). We’ve piloted an AI-powered HR assistant, used AI tools to analyse user research and supported developers with tools that improve code quality and security. "
        },
        {
            "text": "Our data transformation programme is also changing how we use information. With new data ownership structures, interactive Power BI dashboards and a modern enterprise data platform in development, we’re helping the business make faster, better decisions. "
        },
        {
            "heading": 3,
            "text": "Building a culture of innovation "
        },
        {
            "text": "Innovation is baked into how we work. Our agile, test-and-learn approach means we start small, improve quickly and scale what works. We involve the whole team, share progress openly and use tools like Kanban boards and 'show and tell' sessions to stay aligned. "
        },
        {
            "text": "We’re also investing in our people. By building strong communities of practice and supporting continuous learning, we’re creating a culture where innovation thrives and knowledge is shared across government. "
        },
        {
            "heading": 3,
            "text": "Looking ahead: what success looks like in 2025 "
        },
        {
            "text": "DDaT’s top priority is delivery. That means building great products, growing our capabilities and supporting our people to drive the growth agenda. "
        },
        {
            "text": "Success in 2025 means a digital, data and technology team that’s empowered, skilled and delivering real impact - through better services, smarter use of data and a strong focus on user needs. "
        },
        {
            "heading": 3,
            "text": "Looking ahead "
        },
        {
            "text": "As we move through 2025, the DDaT team remains focused on delivering high-impact, user-centred solutions that help UKEF grow and evolve. But transformation doesn’t happen in isolation - it’s a team effort."
        },
        {
            "text": "So if you have ideas or feedback, please comment on this blog post."
        }
    ]
}