{
    "url": "https://ipo.blog.gov.uk/2025/05/29/its-a-me-ip/",
    "title": "Levelling up: the IP journey of Nintendo",
    "authors": [
        "Christina Watts"
    ],
    "categories": [
        "Business",
        "Design",
        "Innovation",
        "Levelling Up",
        "Licensing",
        "Patents",
        "Trade marks"
    ],
    "pub_date": "2025-05-29T10:00:00+01:00",
    "content": [
        {
            "text": "After yet another Nintendo-fuelled conversation on the school run this morning, it got me thinking about the intellectual property (IP) owned by this multi-national gaming company."
        },
        {
            "heading": 3,
            "text": "A Nintendo adventure"
        },
        {
            "text": "From the time I get up until the time I go to bed, my Nintendo-obsessed child talks about the various Nintendo characters, games and toys, with animation. He eats, sleeps and breathes Mario, Kirby and Pokémon. When he is not playing his Nintendo Switch, he is playing on his ‘Pretendo’ (his imaginary Nintendo switch) or recreating the games with his hundreds of Nintendo plushies - cuddly toys representing the Nintendo characters."
        },
        {
            "heading": 3,
            "text": "Level 1: Start at the beginning"
        },
        {
            "text": "Our adventure begins in the ancient Japanese city of Kyoto. I was shocked to discover that it was here, on September 23, 1889, that Japanese entrepreneur Fusajiro Yamauchi founded Nintendo. He designed hand-made playing cards- known as Hanafuda."
        },
        {
            "text": "The cards quickly became so popular that he had to hire staff to keep up with the demand. Little did he know that his modest card-making business would transform within a century into one of the largest gaming companies in the world. Nintendo continued to produce Hanafuda until their popularity declined in the 1960s."
        },
        {
            "text": "A new character joins the game, 22-year-old Hiroshi Yamauchi, the great-grandson of the company's founder. Taking over Nintendo, he aimed to expand the company beyond card-making into toys and amusement arcades."
        },
        {
            "text": "In an unexpected turn, Hiroshi never enjoyed video games, playing only one in his life. Despite this, he led Nintendo to early successes in electronic games, though the company's greatest achievements were still ahead."
        },
        {
            "text": "By 1978, Nintendo had developed its first video game, a computer version of Othello."
        },
        {
            "text": "Hoping to break into the U.S. market, Nintendo released Radar Scope in December 1980. Although the game was successful in Japan, it was not a hit with the American audience, resulting in a setback."
        },
        {
            "text": "But the game wasn’t over yet."
        },
        {
            "heading": 3,
            "text": "Level 2: Avoid infringement"
        },
        {
            "text": "And so, our journey continues. To recover losses from the failed Radar Scope release, Nintendo tasked Shigeru Miyamoto, a staff artist with no game development experience, to repurpose the arcade game’s expensive hardware. Despite his lack of experience, Miyamoto’s creativity and fresh perspective set him apart in the gaming industry. He imagined a game that followed a storyline, with visuals inspired by comic books."
        },
        {
            "text": "Initially intending to base the game on the fictional sailor character, Popeye, Miyamoto aimed to create a story involving a heroic figure rescuing a damsel from a villain. However, due to the inability to secure a licence to use the intellectual property rights for the characters, Miyamoto improvised developing new characters that did not infringe on the creators of Popeye’s rights."
        },
        {
            "text": "The next step in Miyamoto's quest led him to a plot focused on a brave carpenter (initially named \"Jumpman\") whose task is to save a damsel from a giant ape, laying the groundwork for what eventually became Donkey Kong. Jumpman was later renamed Mario, inspired by the landlord of Nintendo's American headquarters, Mario Segale."
        },
        {
            "text": "This marked the beginning of a new adventure as Mario paved the way for other Nintendo franchises and characters such as Donkey Kong Jr., The Legend of Zelda, and Super Mario Bros."
        },
        {
            "heading": 3,
            "text": "Level 3: Land of patents"
        },
        {
            "text": "As the sands of time continue to shift, so does Nintendo's patent strategy. From the early days of hardware breakthroughs to today's focus on seamless software and engaging user interactions, Nintendo has adapted to the ever-changing technological landscape by evolving the way it patents its tech. This strategy has allowed Nintendo to stay ahead of the curve, conquer new challenges, and protect its products."
        },
        {
            "text": "Nintendo's patents are categorised into four parts: hardware, software, design, and user interface innovations. Covering everything from processors and controllers to game algorithms and navigation systems, each patent safeguards a different aspect of the company's technology, setting industry standards and ensuring its ideas remain protected."
        },
        {
            "text": "As technology evolves, so does Nintendo's patent strategy. From early hardware patents to today's focus on software and user interaction, it adapts to stay ahead."
        },
        {
            "heading": 3,
            "text": "Level 4: Licensing time!"
        },
        {
            "text": "Nintendo doesn’t just protect its inventions; it licenses them too. These licensing agreements are used for various merchandise and consumer products, including toys, apparel, accessories, and collectibles. Revenue from these licensing and merchandising agreements is earned through royalties and licensing fees paid by third-party manufacturers and retailers."
        },
        {
            "text": "This strategy not only broadens the reach of Nintendo's beloved characters but also adds a substantial revenue stream beyond game sales. This enables Nintendo to extend its IP beyond its own consoles and tap into new markets."
        },
        {
            "heading": 3,
            "text": "Level 5: This is not the end"
        },
        {
            "text": "Our next level is set in the year 1993, Nintendo licensed the rights for its Super Mario franchise to be made into a live-action movie ‘The Super Mario Bros’. Unfortunately, the film failed to please the critics, causing Nintendo to stop licensing its movie rights to any other movie studios or companies."
        },
        {
            "text": "This all changed when the multinational gaming company teamed up with Illumination and Universal to produce an animated movie about the Mario brothers and their adventure, ‘The Super Mario Bros Movie’ - a movie my son was that excited about he saw it 8 times in the cinema!"
        },
        {
            "text": "Nintendo has recently announced a sequel to the movie giving me the idea that this is just the start for Nintendo and its ever-growing franchises."
        }
    ]
}