{
    "url": "https://naturalengland.blog.gov.uk/2025/05/29/the-power-of-dna-using-innovation-for-natures-recovery/",
    "title": "The power of DNA: using innovation for nature’s recovery",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Biodiversity",
        "Evidence",
        "Monitoring",
        "Nature",
        "Nature Recovery",
        "Protected sites and species",
        "Science and evidence",
        "Species recovery"
    ],
    "pub_date": "2025-05-29T14:19:40+01:00",
    "content": [
        {
            "text": "By Andrew Nisbet, Natural England's Deputy Director for Monitoring"
        },
        {
            "text": "Natural England is at the forefront of introducing innovative technologies into biodiversity monitoring. Environmental DNA (deoxyribonucleic acid) is the DNA that can be obtained from an environmental sample such as water, air or soil. We can use DNA techniques to detect species, from tiny bacteria right through to whales, providing an exciting opportunity for efficient biodiversity monitoring at scale. In Natural England’s DNA team, we are working to operationalise these methods in our work."
        },
        {
            "text": "Innovative techniques"
        },
        {
            "text": "DNA techniques to monitor great crested newts (GCN) are well established and have been in use for over a decade. In the last few years, we have been developing methods for using DNA to look for other species, whole communities (fish in a lake, for instance), and even to assess the health of an ecosystem."
        },
        {
            "text": "To do this we are building partnerships across the sector. We engage with researchers to tap into the latest science and innovative techniques as well as working with industry on applications. These relationships ensure that the operational needs of end users like Natural England are understood by researchers and businesses."
        },
        {
            "text": "DNA based methods rely on having DNA sequences for each species in a reference library so that any given sequence we detect can be matched to a species. We are partnering with the Natural History Museum, through funding and support to the UK Barcode of Life (UKBOL) project and logistical support to the Darwin Tree of Life (DTOL) project, to help them sequence DNA barcodes and whole genomes from each of the 75,000 eukaryotic species in the UK."
        },
        {
            "text": "Pond health metric"
        },
        {
            "text": "We are also working with a range of partners to develop a pond health metric using data derived from DNA samples. Our aim is to be able to assess the condition of any pond from a water sample, rather than having to undertake several traditional surveys of different aspects. Initial progress is promising, and we are sampling more ponds to increase our confidence in the results.Just this month, I had the pleasure of chairing the UK DNA Working Group Conference, held at the Royal Society. It was fantastic to hear about current advances in DNA technology and their relevance to policy, as well as showcasing the projects that Natural England has been leading on."
        },
        {
            "text": "These included a project to develop a framework for assessing confidence in multi-species tests (metabarcoding), where we have created an international steering group to support us in taking the work forward."
        },
        {
            "text": "Confidence in data"
        },
        {
            "text": "Understanding the confidence we can have in DNA derived data is key to making these methods operational. To ensure we can use these data confidently and appropriately, it’s important that we understand the methods used in all parts of the process. When Natural England commissions data collection we ask for this information. When other organisations send us data to support our work we have developed an information note that describes what information we find useful to be recorded to ensure we can use the results appropriately. Reporting this additional information allows us to share DNA derived data, and use it for regulatory and statutory monitoring at Natural England."
        },
        {
            "text": "This continues to be a developing and innovative field. While the science matures, our job is to ensure we can use these methods with confidence to support nature recovery across Natural England’s work. Not everything we have tried has been successful, but we are learning along the way!For more information on NE’s work with DNA, email monitoring.innovation@naturalengland.org.uk."
        }
    ]
}