{
    "url": "https://ukhsa.blog.gov.uk/2025/05/29/what-is-candidozyma-auris-fungal-pathogen-and-emerging-global-health-threat/",
    "title": "What is Candidozyma auris? Fungal pathogen and emerging global health threat",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Protecting the country's health",
        "UKHSA science"
    ],
    "pub_date": "2025-05-29T15:19:07+01:00",
    "content": [
        {
            "text": "Fungi are all around us, but some species pose significant threats to human health. They can spread silently, thrive in hospitals, resist multiple treatments, and survive on surfaces for weeks. That's Candidozyma auris (C. auris) - formerly known as Candida auris - a fungal pathogen gaining attention from healthcare professionals and public health authorities worldwide."
        },
        {
            "heading": 2,
            "text": "Fungal pathogen C. auris"
        },
        {
            "text": "C. auris is a recently discovered fungus. A fungus is a type of microorganism, some of which can make you ill."
        },
        {
            "text": "It rarely causes infections in healthy individuals though can pose a risk to people in hospital, particularly those who have been in hospital for a long time, who are critically unwell and/or who have weakened immune systems. It was first identified in 2009 in the ear of a Japanese patient and has since been found in more than 40 countries across 6 continents. What makes C. auris particularly concerning is its remarkable resilience – it can survive on surfaces for long periods of time, including in the hospital environment, and is often resistant to first-line medical treatments and disinfectants."
        },
        {
            "heading": 2,
            "text": "How C. auris spreads"
        },
        {
            "text": "C. auris primarily spreads through contact with contaminated surfaces or medical equipment, or via direct contact with individuals who are colonised. People can carry the fungus on their skin without developing an infection (called colonisation). However, someone who has C. auris on their skin may become infected if it enters their body, for example through a wound, or if they have had an invasive medical device inserted, for example a catheter or drip."
        },
        {
            "text": "It can be spread between people in healthcare settings. Colonisation could occur after being in contact with the fungus (that is, a person would now be carrying it on their skin). C. auris has been identified on numerous hospital items including bedside equipment, radiators, windowsills, sinks, and medical equipment such as temperature probes, blood pressure cuffs and stethoscopes."
        },
        {
            "heading": 2,
            "text": "Illnesses caused by C. auris"
        },
        {
            "text": "Infections range in severity. Some people may carry the fungus without symptoms, while others develop serious infections such as infections in the blood, brain and spinal cord, bones, abdomen, wounds, ears, respiratory tract, and urinary system. People who are carrying the fungus are still at risk of developing an infection or passing it on to others."
        },
        {
            "heading": 2,
            "text": "People at risk"
        },
        {
            "text": "C. auris primarily affects people in healthcare settings including those with a weakened immune system, especially:"
        },
        {
            "text": "Colonised people may carry C. auris for months or years, increasing their risk of developing an infection and passing on the fungus to others."
        },
        {
            "heading": 2,
            "text": "What we're doing to address the risks of C. auris"
        },
        {
            "text": "While not as widespread in England as in some other countries, C. auris has caused outbreaks in several healthcare settings in England (fewer than 700 cases have been detected to date). We monitor C. auris cases and are working in partnership with the NHS, independent sector healthcare providers and other stakeholders to limit its spread and support the identification of appropriate treatment options."
        },
        {
            "heading": 2,
            "text": "Reasons for monitoring the pathogen"
        },
        {
            "text": "We monitor C. auris for several reasons:"
        },
        {
            "heading": 2,
            "text": "How to prevent C. auris from spreading"
        },
        {
            "text": "Controlling C. auris needs very thorough infection prevention and control measures within healthcare settings:"
        },
        {
            "text": "C. auris represents a growing global health concern, particularly in healthcare settings where it can spread rapidly and resist treatment and some disinfectants. While not yet widespread in England, it is important that we remain aware that C. auris may spread in hospital environments. Through effective infection prevention and control measures, rigorous hygiene practices, ongoing monitoring and continued research, its spread can be minimised."
        }
    ]
}