{
    "url": "https://digitalpeople.blog.gov.uk/2024/02/09/2023-summer-interns-digital-workforce-and-building-capability/",
    "title": "2023 summer interns - digital workforce and building capability",
    "authors": [
        "Jaco Castillo MacPherson, Summer Intern, CDDO"
    ],
    "categories": [
        "Apprenticeships and internships",
        "Capabilities",
        "Digital data and technology",
        "Emerging talent"
    ],
    "pub_date": "2024-02-09T06:00:13+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Introduction"
        },
        {
            "text": "I feel extremely lucky to have been placed in the Digital Workforce and Capability team, within the Central Digital and Data Office (CDDO) for my summer internship. The work of both this team, and CDDO more broadly, is at the heart of the Government’s digital transformation aspiring to provide more efficient digital services to the public. Therefore, the work I have completed and contributed feels as though it has a real and profound impact across government and more widely for the general public."
        },
        {
            "heading": 3,
            "text": "Attracting and retaining digital talent"
        },
        {
            "text": "My line manager has a strategic role within the team and actively juggles different projects, each with the overarching aim of optimising the processes by which CDDO along with the rest of government can attract, hire and retain digital and data talent. As such, the work I have been delegated has not only been interesting but again feels impactful. To provide you with an example, I recently contributed towards the delivery of a business case for Government Digital and Data to engage with a new set of stakeholders. "
        },
        {
            "text": "In addition to incorporating me into the team’s workflow, my line manager has dedicated a significant amount of time and effort to facilitating my personal development. I have been tasked with a longer term project of producing a business case of my own. I have enrolled in various supplementary training courses to develop my coding skills and I have received one-to-one training on applying to the Civil Service Fast Stream and other jobs via the Civil Service jobs website."
        },
        {
            "text": "The team itself is full of driven and friendly individuals each with a different story to tell but all willing to allocate their time to support each other, regardless of their position. This has certainly been the case for me. I have had introductory meetings with about 40 individuals across all grades and teams within CDDO. Also, the other interns and I are currently involved in organising an upcoming team away day which in itself has been a pleasant bonding experience. "
        },
        {
            "heading": 3,
            "text": "Conclusion"
        },
        {
            "text": "Finally, taking into account work demands and team needs, the internship offered options for hybrid or remote working. This flexibility has allowed me to strike a healthy and sustainable balance between being able to work to the best of my ability and to continue pursuing my sporting, fitness and social interests."
        },
        {
            "text": "Though individual intern experiences will differ vastly across government departments and teams, the opportunities presented by the programme are unique. Therefore, if this all sounds interesting to you, I urge you to apply and to be yourself throughout!"
        }
    ]
}