{
    "url": "https://deframedia.blog.gov.uk/2024/02/09/9561/",
    "title": "Support for farmers",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Farming"
    ],
    "pub_date": "2024-02-09T21:51:55+00:00",
    "content": [
        {
            "text": "There has been recent media coverage by the BBC on a demonstration conducted by farmers on Friday."
        },
        {
            "text": "This government firmly backs our farmers. We are ensuring British farming is at the heart of British trade by putting agriculture at the forefront of any deals we negotiate, prioritising new export opportunities, protecting UK food standards and removing market access barriers."
        },
        {
            "text": "We’ve committed to maintaining the £2.4 billion annual farming budget which will support farmers to produce food profitably and sustainably, while protecting nature and helping to meet our net zero ambitions. Our new schemes offer something for every type of farm, and a crucial part of their development has been to listen to farmers’ feedback."
        },
        {
            "text": "These schemes gives more money and more choice to farmers, with the biggest update to farming schemes since the start of the agricultural transition. This included an average 10% increase to the Sustainable Farming Incentive and Countryside Stewardship payment rates, and around 50 new Environmental Land Management actions."
        },
        {
            "text": "We are pleased that an increasing number of farmers are taking part, with 32,000 Countryside Stewardship agreements for 2023 - a 94% increase since 2020 – and thousands of farmers signing up for the Sustainable Farming Incentive since it opened last year."
        },
        {
            "text": "We are also looking at ways to further improve fairness in the supply chain and support British farmers and growers, as well as ensuring customers have access to high-quality fresh British products."
        },
        {
            "text": "As such, we have opened reviews into the food supply chains, to help make sure farmers and growers are paid a fair price for their produce. Reviews have already been conducted into the egg, horticulture, pig and dairy supply chains, with new regulations coming into effect later in 2024."
        },
        {
            "text": "At the beginning of 2024, we also saw a bout of severe weather and flooding. In response, we quickly opened the Farming Recovery Fund, providing grants of up to £25,000 to farmers affected by flooding. This sits alongside our achievement to protect over 900,000 acres of agricultural land from the impacts of flooding since 2015."
        },
        {
            "text": "To drive innovation, we have also awarded over £120 million in grant funding to farmers through the Farming Investment Fund and committed £140 million to 179 projects as part of the Farming Innovation Programme. In addition, these funds will support food production, improve animal health and welfare and protect the environment."
        },
        {
            "text": "Further support has also being given to over 17,000 farmers via free business advice through the Farming Resilience Fund as well as our introduction of fully funded annual vet visits on far. This was made possible through the Sustainable Farming Incentive Annual Health and Welfare Review, which is now open to non-BPS registered farmers."
        },
        {
            "text": "We have also provided more support to tenant farmers; in response to the independent Rock Review, 15% of government response actions have been completed, including launching a Call for Evidence on the proposal for a Tenant Farming Commissioner."
        },
        {
            "text": "At the end of December 2023, we also introduced legislation which ensured that farmers and growers can continue to use seeds treated with EU-approved pesticides and access more cost-effective pesticides from the EU."
        },
        {
            "text": "More widely, we are committed to ensuring British farming at the heart of British trade and we are putting agriculture at the forefront of any deals we negotiate. In the same vein, we appointed an additional five agri-food attaches to boost the UK’s agri-food exports, which bring £24 billion to the British economy."
        },
        {
            "text": "This is all underpinned by our enhancement of the regulatory system – with improved on-farm visits and communications with farmers. Alongside more innovative remote monitoring techniques, this has led to a decrease in financial penalties for minor non-compliances."
        }
    ]
}