{
    "url": "https://defraenvironment.blog.gov.uk/2024/02/09/access-to-nature-conservation-and-the-green-recovery-challenge-fund/",
    "title": "Access to Nature, Conservation and The Green Recovery Challenge Fund",
    "authors": [
        "Zelda Baveystock"
    ],
    "categories": [
        "Access and engagement",
        "Green finance",
        "Local Nature Recovery Strategies",
        "Nature"
    ],
    "pub_date": "2024-02-09T12:02:20+00:00",
    "content": [
        {
            "text": "The Green Recovery Challenge Fund was an £80 million fund developed in response to the COVID-19 pandemic, designed to help nature recovery and conservation whilst creating and sustaining jobs. In this blog post, we'll delve into the incredible achievements this fund has delivered over its 3-year lifespan as well as some of my personal reflections. I'm Zelda Baveystock, head of Green Recovery Challenge Fund Delivery at the National Lottery Heritage Fund, and I've been involved in a number of Defra related projects. "
        },
        {
            "text": "The Green Recovery Challenge Fund was especially engaging because through it I could see immediate, tangible results for environmental organisations, people and communities during the disruptive years of the pandemic.   "
        },
        {
            "text": "We recently published our final evaluation report for the Green Recovery Challenge Fund, which sets out the remarkable results of its 159 funded projects. "
        },
        {
            "text": "From the northern reaches of North Northumberland to the southern tip of Cornwall, the fund has been a catalyst for nature recovery and conservation. "
        },
        {
            "text": "One of the fund's standout achievements lies in its support for habitat creation and restoration activities, providing environmental benefits to more land than the size of Cornwall. The fund remarkably contributed to the planting of over 1.7 million trees across 693 sites. This marks a substantial step towards mitigating climate change and adapting to its effects. "
        },
        {
            "text": "The fund has also played a pivotal role in job creation and retention within the environmental sector during a time when many environmental organisations were struggling from the impact of the pandemic. It supported over 2,600 jobs both directly and indirectly through spending on goods and services. Critically, it also encouraged organisations to forge new delivery partnerships. The combination of new jobs, job retention, training and partnership working has had a positive impact on the resilience of many of the funded organisations, enhancing their capacity for future nature recovery activity. "
        },
        {
            "text": "But for me, some of the most satisfying results to see have been the personal impacts on people and communities, through project work to support wellbeing and improved access to nature. Through the projects’ in-person and online events, it successfully connected more than 400,000 individuals with nature. Beyond the numbers, I have met many people who felt GRCF genuinely changed their lives for the better, providing opportunities to get outdoors, reconnect and develop new skills during a difficult time for all. "
        },
        {
            "text": "The Green Recovery Challenge Fund’s priorities were: "
        },
        {
            "text": "These priorities align with the goals outlined in Defra’s Environmental Improvement Plan see the plan’s 1-year update blog post. Thriving plants and wildlife, which is the top goal of the Environmental Improvement Plan, has found an ally in the fund’s impactful initiatives. "
        },
        {
            "text": "There were two rounds in the Green Recovery Challenge Fund, worth £40 million each, in September 2020 and March 2021. The fund’s journey wasn't a solo endeavour— the Heritage Fund served as the distributing force behind it, working on behalf of the Defra and its arm's length bodies, including Natural England, the Forestry Commission, and the Environment Agency. "
        },
        {
            "text": "As we reflect on the accomplishments of the Green Recovery Challenge Fund, it's evident that this investment has not only revitalised nature but also breathed life into communities, careers, and a collective commitment to a sustainable, green future. The positive ripples of the GRCF are bound to resonate far beyond its final evaluation report, leaving a legacy for generations to come. "
        },
        {
            "text": "We will be publishing lots more posts like this in future, along with information about announcements. To receive an email notification when a new blog post is published, please subscribe to the blog."
        }
    ]
}