{
    "url": "https://dragonsden.blog.gov.uk/2024/02/09/dragons-den-ip-blog-series-21-episode-6/",
    "title": "Dragons' Den IP Blog - Series 21 Episode 6",
    "authors": [
        "Mark Juffs"
    ],
    "categories": [
        "Business",
        "Designs",
        "IP",
        "Licensing",
        "Trade marks"
    ],
    "pub_date": "2024-02-09T10:45:56+00:00",
    "content": [
        {
            "text": "This episode of Dragons’ Den had a distinct health and hair care flavour, aimed at keeping us healthy in mind and body. We were in for a fiery treat with the appearance of denim doyenne Emma Grede as guest Dragon, too. "
        },
        {
            "text": "Emma is a fashion designer and founder of denim company, Good American.  "
        },
        {
            "text": "\n"
        },
        {
            "heading": 3,
            "text": "Smooth operator"
        },
        {
            "text": "The first entrepreneur to enter the Den was Titilolami Bello. She was hoping to tempt the Dragons to invest in her business, ORI Lifestyle, looking for a £60k investment from the Dragons for a 15% stake.  "
        },
        {
            "text": "She explained how she has tried many styles on her Afro hair over the years, and struggled with hair loss, which inspired her to create her hair care product range. Alongside her hair products, she wants to help educate the consumer, offering hair advice through an app.  "
        },
        {
            "text": "The Dragons were impressed to hear that Titilolami’s business is currently stocked in Harrods and online at Selfridges. "
        },
        {
            "heading": 4,
            "text": "What's your unique selling point? "
        },
        {
            "text": "The Dragons seemed interested in the product and began firing their questions. Guest Dragon Emma led the charge by highlighting the need to stand out. Is the product unique? What is its appeal to the market? "
        },
        {
            "text": "After her pitch, the entrepreneur quickly felt the heat of the Dragons with some heavy grilling on profit margins and projected sales by Deborah Meaden. I thought Titilolami may be about lose her cool... "
        },
        {
            "text": "Touker Suleyman felt that her idea of an app was not the best way to promote the brand and was soon out. Sadly, Steven Bartlett and Peter Jones failed to see an opportunity to invest which left Emma offering 25% for all the £60k.  "
        },
        {
            "text": "A delighted entrepreneur quickly accepted the offer only to then realise Deborah had not yet had an opportunity to make a bid. She gracefully declined to invest leaving Titilolami to walk away with Emma’s offer. "
        },
        {
            "text": "Find out more about trade marks:"
        },
        {
            "heading": 3,
            "text": "An appetite for success"
        },
        {
            "text": "The next entrepreneurs to catch my eye were duo Sam and Charlie with their frozen food range ‘Stocked’. They were seeking a £50k investment for a 2% stake in their business. "
        },
        {
            "text": "Marketed as “chef cooked portion-controlled meals, ready in 4 minutes, for people with busy lives” this struck a chord with Dragon Sara: “you have described my life...but let's talk about the numbers!” "
        },
        {
            "text": "It was clear the pair were passionate about their brand and they described how it aligned nicely with their personal interests and values, helping busy foodies eat well, no matter how busy their lives and family schedules.  "
        },
        {
            "text": "After revealing some large losses rolling into year three predictions and failing to achieve a margin over 40%, all the Dragons were out. That left Steven, who made an offer despite the duo having to give up three times the equity to secure his support. "
        },
        {
            "heading": 3,
            "text": "A breath of fresh air"
        },
        {
            "text": "Dancing into the Den, Will from York pitched his invention, ‘Inhaler Tailor’. He explained how, worldwide, more than 1 billion people have a respiratory condition that affects their day-to-day life. He showcased his range of fun, colourful, reusable asthma inhaler cases that will allow users to personalise their inhaler pumps.  "
        },
        {
            "text": "Will was asking for £80k in return for a 10% stake in his business. "
        },
        {
            "text": "Although impressed that Will’s video on Tik Tok had scored more than one million views, Peter decided not to make an offer. Shortly afterwards Emma, Sara Davies and Steven declared that they couldn’t see the excitement of parting with their cash to support the business.  "
        },
        {
            "text": "Deborah imparted some advice around his manufacturing set up. She felt that in fact he doesn’t need a Dragon to move the business forward. Although Will walked away from the Den without any offers, Touker left him with some helpful advice as a parting gift: he was happy to provide some help with the sourcing of materials. "
        },
        {
            "heading": 4,
            "text": "A design worth registering?"
        },
        {
            "text": "It is clear that Will has spent a lot of time developing his product range. Will has registered his trade mark, and also been careful to register his Inhaler Tailor design, too."
        },
        {
            "text": "You can view the design, along with the drawings, through our ‘search for a design’ link: View the Inhaler Tailor design."
        },
        {
            "heading": 3,
            "text": "Mind your business"
        },
        {
            "text": "Last to enter the Den are married couple, Denise and Ciaran from Dublin. They were looking for an £80k investment and 5% stake in their wellness and journaling plan business, ‘The Head Plan’.  "
        },
        {
            "text": "Denise is a qualified life coach, and together with Ciaran they set out to guide others to achieve personal goals, find balance, and live mindfully.  "
        },
        {
            "text": "Dragon Emma was first to find affinity with the wellness and mindfulness-designed journals and product range. She herself is a fan of ‘manifesting’ - a method of focusing your thoughts on a desired outcome using mindfulness and meditation. "
        },
        {
            "text": "Although impressed with the £3m revenue in just three years, the Dragons felt uneasy about where the digital side of the business could grow. Three of the Dragons pulled out. "
        },
        {
            "text": "Peter, Touker and Deborah made the Dublin couple offers, with Peter being the Dragon who was selected to take the business to the next level. "
        },
        {
            "heading": 4,
            "text": "License to be mindful "
        },
        {
            "text": "Denise and Ciaran have already found success globally with their colourful mindfulness range. They spoke about wanting to scale up their business, and one way of achieving this is through licensing.  "
        },
        {
            "text": "Did you enjoy this episode? Keep a look out for more upcoming editions as we follow the BBC Dragons' Den series. "
        },
        {
            "text": "Disclaimer:"
        },
        {
            "text": "The purpose of the IPO's Dragons' Den IP blog is to help identify the IP in entrepreneurs’ pitches and highlight how IP works, or could work, in the real-life examples featured. IPO’s authorship of this blog does not constitute its endorsement or sponsorship of any products, individuals or businesses referenced within it."
        }
    ]
}