{
    "url": "https://grantscommunity.blog.gov.uk/2024/02/09/find-a-grant-celebrates-200000-users-at-the-government-grants-conference/",
    "title": "Find a Grant celebrates 200,000 users at the Government Grants Conference",
    "authors": [
        "Lucia Webster"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2024-02-09T11:23:35+00:00",
    "content": [
        {
            "text": "In the ever-evolving landscape of digital services and securing even more efficiencies for the taxpayer, reaching significant milestones is a testament to a product's success. "
        },
        {
            "text": "We are thrilled to announce that Find a Grant has surpassed the 200,000 user mark - a momentous achievement in our efficiency journey. The Minister, Alex Burghart, commended the team at the Inaugural Government Grants Conference in Birmingham: ‘You continue to make what you do even better. Embracing efficiency. Producing ever greater productivity. Ensuring that no one is misusing taxpayers’ money and, instigating innovation. The Find a Grant service has been a great success. Already, over £7.5bn of grant awards have been advertised through it with over 200,000 users signed up to it as of last week. Through that work, people who would never have thought a grant was for them are engaging with the service. ’"
        },
        {
            "text": "As we celebrate this milestone - thanks to you in no small part - we are equally excited to share our plans for the future, unveiling new features that will further improve our users’ experience - for both grant applicants and government grant makers."
        },
        {
            "text": "Getting to 200k users has been nothing short of remarkable. From the initial concept to the continuous iterations based on user feedback, every step has been guided by the principles of making it simpler, faster, fairer and more efficient to find and apply for government grants. It is a testament to the hard work, dedication and the collaborative spirit of the team in Cabinet Office, across government and with our digital partner, AND Digital. "
        },
        {
            "text": "This all signifies the establishment of a successful and fully functioning GOV.UK service, where Find a Grant seamlessly integrates with the daily routines of our users. So today is not just a celebration of reaching 200k users; it’s a commitment to sustained excellence. "
        },
        {
            "text": "We are currently rolling out the next batch of new features that will elevate our users’ experience once more. These features have been carefully curated based on extensive research, user feedback and emerging trends in the digital landscape. "
        },
        {
            "heading": 2,
            "text": "New customisable features for admins and applicants"
        },
        {
            "text": "For grant administrators, they are now able to:"
        },
        {
            "text": "We are also preparing to deliver a much-asked-for feature for admins: the ability to share editing and allow more than one admin to edit the same grant advert and application form."
        },
        {
            "text": "Grant applicants now have the ability to: "
        },
        {
            "text": "We have also improved Find a Grant when used on a mobile device. So it will be much better to view, with a new responsive design making it easier to use the filters and search."
        },
        {
            "text": "This comes on top of Find a Grant having seamless cross-platform integrations via One Login, Spotlight, as well as the ability to connect with other systems, via our open API."
        },
        {
            "text": "And, we have improved our data offer to admins with a real-time analytics dashboard - to add to the dedicated support and guidance via the Centre of Excellence to help them advertise their grant and set up the application form."
        },
        {
            "text": "Of course, being on GOV.UK, everyone can have confidence in the trustworthiness of Find a Grant but we have also been ensuring the platform further benefits from enhanced security, stability and robustness."
        },
        {
            "heading": 2,
            "text": "The next innovative efficiency pilot"
        },
        {
            "text": "But it does not stop there.  Traditionally, the grant-making process has been a complex, time-consuming endeavour. However, with the advent of digital services like Find a Grant, we are ushering in a new era where efficiency meets impact and innovation. "
        },
        {
            "text": "Our new, pilot Government Grants Managed Service (GGMS) aims to streamline the entire process for grant administrators,  ensuring that resources reach the hands of those who need them most, with unprecedented speed, accuracy and efficiency."
        },
        {
            "text": "GGMS will be digitally-enabled, using all of the services we’ve just talked about, to create an efficient service, generating greatly improved data insights. We are just getting started but I will be able to update you some more in the weeks and months to come. If you are a grant admin and want to know more, check our GGMS pages on the Centre of Excellence and get in touch. "
        },
        {
            "text": "For now, thank you for making Find a Grant a success. "
        },
        {
            "text": "It is now simpler, faster, fairer and more efficient to find and apply for government grants."
        },
        {
            "text": "We could not have done it without your support. So please  keep sharing the Find a Grant link!"
        },
        {
            "text": "Lucia Webster"
        },
        {
            "text": "Delivery Director, Grants Efficiency Portfolio"
        }
    ]
}