{
    "url": "https://defencedigital.blog.gov.uk/2024/02/09/planning-ahead-for-onsite-user-research-in-defence/",
    "title": "Planning Ahead for Onsite User Research in Defence",
    "authors": [
        "Tim Farr"
    ],
    "categories": [
        "User Research"
    ],
    "pub_date": "2024-02-09T10:29:29+00:00",
    "content": [
        {
            "text": "That's what a former manager used to say to me. Although I'm not a big fan of motivational workplace quotes, this one stuck because it's undeniably true."
        },
        {
            "text": "I work within the Digital Foundry as a User Researcher, capturing findings from end users’ interactions with Defence ICT and playing this back to assist with decision making. A big part of my job involves being on site and from experience, there are three important things to consider when planning for onsite user research (UR):"
        },
        {
            "heading": 2,
            "text": "Participants"
        },
        {
            "text": "Recruiting end users for research or testing prototypes is essential to user-centred design (UCD). However, identifying and connecting with participants from one of the three frontline commands (FLCs, i.e. the Army, Royal Navy and RAF) can take a long time. In fact, this initial task is often regarded as the most demanding aspect of organising UR in Defence."
        },
        {
            "text": "Finding the right people for your research within Defence can be difficult if you don't have the luxury of an internal point of contact. The Digital Foundry’s Defence Developer Services (D2S) can assist with this task via the D2S Research Community database."
        },
        {
            "text": "This resource helps provide access to FLC personnel willing and able to participate in MOD UR. It streamlines the selection, registration, documentation and tracking of participants. Plus it reduces ‘research fatigue’ by preventing the same individuals being repeatedly approached for UR."
        },
        {
            "text": "However, even after making initial contact, it can still take up to a month before you get approval from a senior officer allowing you to visit a military base to conduct interviews and workshops. Therefore, setting aside a generous amount of time in your research plan to allow for this is advisable."
        },
        {
            "text": "It is worth noting that people’s rank and duties inform their perspective on matters. For example, a signals regiment will collectively focus on comms however senior officer will offer a more strategic outlook whilst lower ranks, in contrast, will have a more hands-on view of the world. Hence, it is important to consider the purpose for your research as this will inform what role(s) you target in your UR."
        },
        {
            "heading": 2,
            "text": "Experts"
        },
        {
            "text": "Defence is complex, comprised of organisations developed over centuries, accommodating changing needs, technologies and procedures."
        },
        {
            "text": "Embedding a serving or ex-military subject matter expert (SME) into your team, permanently or temporarily, and having them with you onsite during research is invaluable."
        },
        {
            "text": "A military SME can assist you with military terminology and a host of other potentially problematic tasks, such as:"
        },
        {
            "text": "If you don't have a military SME on your team and are carrying out UR within the Foundry Federation, the Foundry has experts in-house from the different FLCs that can help. Even if you only interact with them minimally, there will be notable benefits."
        },
        {
            "heading": 2,
            "text": "Site"
        },
        {
            "text": "Military bases are enormous. There are potentially numerous entrance gates, rows of unremarkable buildings from the 1940s, confusing signage and one-way road layouts that repeatedly trap you in a loop of doom. Even personnel who live and work onsite get lost from time to time."
        },
        {
            "text": "Your host isn't meeting you at the gate? Well you can improve your chances of finding the correct entrance and UR session destination by obtaining the postcode or digital map pins for both locations in advance. You'll still need your wits about you, but at least you'll stand a fighting chance of locating where you're supposed to be."
        },
        {
            "text": "And remember to keep those coordinates to hand for the end of the day, plus an extra quarter-hour of journey time because you may think you'll remember how to find your way back to the gate, but you won't."
        },
        {
            "heading": 2,
            "text": "Conclusion"
        },
        {
            "text": "In military circles, an often-quoted statement is attributed to former US President Dwight Eisenhower: \"Plans are nothing; planning is everything\"."
        },
        {
            "text": "This is so true, especially in the context of UR with military personnel. Participants can be called away at the last moment for urgent operational requirements or your reserved room is suddenly taken by someone significantly more important than you."
        },
        {
            "text": "However, you'll still require a research plan to ensure you have your question set, along with pens, post-its and biscuits to hand, on the off chance everything you've set out to do indeed goes as expected (or at least some of it)."
        },
        {
            "text": "\n"
        }
    ]
}