{
    "url": "https://traderemedies.blog.gov.uk/2024/02/09/uk-steel-safeguards-a-story-of-transition-extension-suspension-and-amendment/",
    "title": "UK steel safeguards: A story of transition, extension, suspension, and amendment",
    "authors": [
        "TRA Communications"
    ],
    "categories": [
        "Investigations",
        "Steel"
    ],
    "pub_date": "2024-02-09T11:31:51+00:00",
    "content": [
        {
            "text": "The Trade Remedies Authority (TRA) is no stranger to complexity."
        },
        {
            "text": "We investigate where UK manufacturers believe they may be suffering from unfair trade practice which result in goods being exported to the UK at prices which are artificially low. This could be as a result of subsidies available to the exporting manufacturers or pricing on exports which is lower than the price of similar goods in the exporting country. Our current portfolio includes cases across a range of industry sectors, including aluminium from China, biodiesel from Argentina, ceramic tiles from China, PVC from the US, ironing boards from Türkiye."
        },
        {
            "text": "And we are reviewing cases on no less than 19 types of global steel imports."
        },
        {
            "text": "By the time we left the EU, the UK had already started equipping itself, by establishing its own domestic trade remedies system. The TRA was set up as an independent authority, advising government; and we have built our expertise on four founding principles of efficiency, proportionality, impartiality, and transparency."
        },
        {
            "text": "The UK rolled over from the EU a total of 43 trade remedy measures, including a steel safeguard measure. The EU had put its own steel safeguard measure in place in 2018, in response to global overcapacity in the steel market and ‘Section 232’ measures in the US. The EU was addressing the risk of trade diversion to the EU market, that could result in import surges causing EU producers injury."
        },
        {
            "text": "In real world terms the safeguard measure is implemented through tariff rate quotas (TRQs). A TRQ allows a certain volume of imports of a particular category of steel1 to be imported into the UK tariff-free, with a 25% tariff applied after this limit is reached. A simple way of thinking of these quotas is as a ‘pot’ from which steel can be imported without incurring the safeguard tariff. The quota covers a three-month period, so once the ‘pot’ has been used up, all future imports for that quarter will have a tariff of 25%."
        },
        {
            "text": "On 4 September 2023 the TRA initiated an extension review of the safeguard measure to consider whether there would be a surge in imports and serious injury to UK producers would likely recur if the measure was revoked on any of the product categories. The TRA will make a recommendation to the Secretary of State ahead of the measure expiring on 30 June 2024. Under WTO rules the safeguard could be extended by a maximum of two years."
        },
        {
            "text": "Today we have initiated two reviews designed to respond to Tata’s major planned production changes at Port Talbot as it decommissions the current blast furnaces and coke ovens and replaces them in time with a greener electric arc furnace. The resulting reduction in hot rolled flats and coil production means the UK will need more imports to meet demand and that the current TRQ levels are unlikely to be sufficient."
        },
        {
            "text": "The two reviews are a TRQ review and a suspension review of product category 1 of the steel safeguard measure in response to applications from UK producers and importers. A suspension review assesses whether the application of a safeguard measure should be suspended for a period whereas a TRQ review assesses whether and to what extent the safeguard quotas should be permanently liberalised. The TRA has accepted both applications on the basis that there has been a change in the market conditions because of the commencement of consultations between Tata and the Trade Unions regarding the decarbonisation of the Port Talbot site. Any decision on whether to amend the measure would be made by the Secretary of State following a TRA recommendation."
        },
        {
            "text": "The remaining 14 product categories would be unaffected as they are being assessed as part of the broader ‘extension review’ of the steel safeguard measure."
        },
        {
            "text": "Both the suspension review and TRQ review will be conducted on different timescales to the extension review. The TRA is responsible for managing all three reviews, including ensuring that recommendations on the extension review are made to the Government in time for the outcome to be implemented for 30 June 2024. If the Government wanted to extend the safeguard but failed to implement by the end of June, the whole measure would fall away under WTO rules."
        },
        {
            "text": "We pride ourselves at the TRA on maintaining open and transparent dialogue with all parties to a case. We publish our work on our public file, and ensure we take evidence from all affected industries, whether producers, exporters, importers or downstream users. So we encourage  anyone affected by the reviews to register their interest through the Trade Remedies Service by 25 February 2024."
        },
        {
            "text": " "
        },
        {
            "text": "For more information contact PressOffice@traderemedies.gov.uk"
        }
    ]
}