{
    "url": "https://defrafarming.blog.gov.uk/2024/02/09/webinar-follow-up-the-farming-offer-in-2024/",
    "title": "Webinar follow up: the farming offer in 2024 ",
    "authors": [
        "Becky Briggs"
    ],
    "categories": [
        "Sustainable Farming Incentive",
        "Webinars"
    ],
    "pub_date": "2024-02-09T10:58:40+00:00",
    "content": [
        {
            "text": "On Friday 26 January, we held a webinar for farmers. We went through the actions and payments available through our environmental land management schemes in 2024. "
        },
        {
            "text": "This webinar was held in collaboration with the Farming Advice Service (FAS) and The Farming Forum (TFF).  "
        },
        {
            "text": "Defra’s Farming and Countryside Programme Director, Janet Hughes was joined by the Sustainable Farming Incentive policy lead, Jonathan Marsden, and colleagues from the Rural Payments Agency (RPA).  "
        },
        {
            "text": "We want to make sure that these webinars are designed and delivered in a way that presents the information clearly and in an engaging way, so we encourage feedback. "
        },
        {
            "text": "After this particular webinar, you told us you wanted more webinars like this. We sent out surveys before and after and the overwhelming majority of attendees said they had a greater understanding of the Sustainable Farming Incentive offer and felt confident recommending the scheme to others. So, we’ll keep going! "
        },
        {
            "text": "In this post, I’ll summarise the themes and top-voted questions covered in the webinar with responses and links to guidance.   "
        },
        {
            "text": "If you’ve read the guidance and still have questions, I’ll set out the best ways for you to get answers as quickly as possible at the end of this post. "
        },
        {
            "heading": 2,
            "text": "The Sustainable Farming Incentive (SFI), Countryside Stewardship (CS) and the combined offer  "
        },
        {
            "text": "We’re streamlining the way we present our offer. We currently have separate SFI and CS Mid and Higher Tier schemes offering different types of actions and agreements.  "
        },
        {
            "text": "We plan to offer most SFI and CS Mid Tier actions through a single application service in 2024, rather than having separate application windows and processes. "
        },
        {
            "text": "We’ll also remove duplication between SFI and CS Mid Tier actions, wherever possible.  "
        },
        {
            "text": "CS Higher Tier agreements are different on each farm, and are more complex requiring advice, support and in many cases formal consent. We will continue to operate a separate process for these agreements, but we will offer the agreements through a simpler, clearer and faster service.  "
        },
        {
            "text": "We will make more actions currently only available in CS Higher Tier available through our other offers. This will mean that, where appropriate, more farmers can access those more ambitious elements with the necessary advice and support for those actions.  "
        },
        {
            "text": "Learn more about the combined offer.  "
        },
        {
            "text": "After 2025, we’ll incorporate other schemes through that single service too, including the England Woodland Creation Offer.  "
        },
        {
            "heading": 2,
            "text": "Opening up SFI to non-BPS farmers "
        },
        {
            "text": "This summer, we plan to remove the current rule saying that farmers must be eligible for BPS to apply for SFI. We’ll let you know when this happens, so make sure to subscribe to the Farming blog. "
        },
        {
            "heading": 2,
            "text": "When to apply for an SFI agreement "
        },
        {
            "text": "Don’t delay, apply today! "
        },
        {
            "text": "You can apply for an SFI agreement now and choose from the 23 actions currently on offer. By waiting for the 2024 actions to become available, you could be losing out on money. If you apply now, you'll be able to add actions to your agreement annually - or have multiple agreements if you'd like to carry out further actions in the future.    "
        },
        {
            "text": "It’s possible to be in SFI and Countryside Stewardship at the same time if the actions are compatible and you are not being paid for the same action twice (see the section below on the combined offer). "
        },
        {
            "text": "Find out how SFI can work for you.  "
        },
        {
            "heading": 2,
            "text": "Agreement lengths  "
        },
        {
            "text": "Your SFI agreement will last for 3 years from its start date.  "
        },
        {
            "text": "SFI agreements do not all start on a single date. They start on the first day of each calendar month. "
        },
        {
            "text": " Your SFI agreement’s start date will depend on:  "
        },
        {
            "text": "The start date for your SFI agreement will be shown on your agreement document.  "
        },
        {
            "text": "The official guidance for how your SFI agreement works is on GOV.UK. "
        },
        {
            "heading": 2,
            "text": "Keeping record of your activities  "
        },
        {
            "text": "You need to be able to evidence that you have achieved the actions aims. For example, for winter bird food (AHL2) we’ll need to see some spring and summer flowering.  "
        },
        {
            "text": "Taking photos and short videos is useful as these can clearly demonstrate meeting the action’s aim.  "
        },
        {
            "text": "Read the full guidance on how to take photos as evidence "
        },
        {
            "heading": 2,
            "text": "The species-rich grassland actions and priority habitat mapping  "
        },
        {
            "text": "We acknowledge that the priority habitat’s data layer isn’t perfect and a lot of grassland habitats out there that aren't on the layer. "
        },
        {
            "text": "If you feel your field or your parcel of land isn't on the map, but you feel it is species-rich grassland, then we’ll introduce a facility for an adviser to come out and support your application. "
        },
        {
            "text": "Read the full guidance for grassland actions "
        },
        {
            "heading": 2,
            "text": "Defining wood pasture and agroforestry "
        },
        {
            "text": "Wood pasture and parkland is a priority habitat defined by several features which include a variety of open areas, scrub and trees. Wood pasture is a whole-system option with specific requirements for land management.   "
        },
        {
            "text": "Agroforestry is simply the integration of trees into farmed land, without additional requirements.  Agroforestry is a stackable option without specific requirements for land management. "
        },
        {
            "text": "Read the full guidance for wood-pasture actions "
        },
        {
            "heading": 2,
            "text": "Payment rates for agroforestry "
        },
        {
            "text": "Further guidance on density will be published before applications open. "
        },
        {
            "text": "Payment rates for agroforestry "
        },
        {
            "heading": 2,
            "text": "Environment Agency approval for water body measures "
        },
        {
            "text": "Water body measures require a permit from the Environment Agency where actions physically alter a main river, require a supply of water or have the potential to affect flooding and flood defences.   "
        },
        {
            "text": "On ordinary watercourses or in Internal Drainage Districts water body measures may require consent from the Lead Local Flood Authority or Internal Drainage Board. "
        },
        {
            "text": "Read the full guidance on waterbodies "
        },
        {
            "heading": 2,
            "text": "Dartmoor Hill ponies and the cattle grazing and native breed grazing options "
        },
        {
            "text": "Dartmoor Hill ponies do fall under these options. There are additional payments where cattle and ponies graze moorland as an alternative to sheep. In addition where grazing animals are listed as Rare and Native there will be supplements available. This Rare and Native breed lists includes Sheep, Cattle, ponies. "
        },
        {
            "text": "Read the full guidance on moorland actions  "
        },
        {
            "heading": 2,
            "text": "Accessing orchard creation options "
        },
        {
            "text": "Traditional orchard eligibility will expand to allow creation on: "
        },
        {
            "text": "This makes traditional orchard creation accessible where it extends the existing treescape, but it is not available to all. "
        },
        {
            "text": "Read the full guidance on orchards "
        },
        {
            "heading": 2,
            "text": "Further support and guidance "
        },
        {
            "text": "With improved choice and payment rates, now is the time to apply for SFI. "
        },
        {
            "text": "For more information,  visit our dedicated SFI site which sets out the full offer.  The RPA created a video on how to apply for SFI."
        },
        {
            "text": "To help you manage the transition and plan, can  access free advice through an independent provider if you receive BPS.  "
        },
        {
            "text": "Catchment Sensitive Farming (CSF) helps farmers in England protect water, air and soil. CSF advisers can provide advice on best practices and specific SFI actions that will benefit your farm business and the environment."
        },
        {
            "text": " If you have a query about your SFI application, you can contact the RPA. "
        },
        {
            "text": "In this post, I’ve just covered our environmental land management schemes. "
        },
        {
            "text": "The guidance for every scheme and grant on offer can be found on the Funding for farmers, growers and land managers page on GOV.UK.  "
        }
    ]
}