{
    "url": "https://gfie.blog.gov.uk/2024/02/09/why-defra-hire-prison-leavers/",
    "title": "Why would Defra hire prison leavers?",
    "authors": [
        "karlharvey1"
    ],
    "categories": [
        "Ex-offenders",
        "Lived Experience",
        "Prison Leavers"
    ],
    "pub_date": "2024-02-09T11:00:02+00:00",
    "content": [
        {
            "text": "Lizzie Chatterjee, Deputy Director for Trade Strategy and Implementation at Department for Environment, Food and Rural Affairs (DEFRA), shares her personal experience as a GFiE buddy to a prison leaver."
        },
        {
            "text": "One of the highlights of my professional life is to provide coaching and mentoring to a prison leaver working in the Civil Service.  I was assigned as a buddy to someone joining another Government department on a temporary contract, following a custodial sentence.  Over two years, I have been able to provide support and a listening ear as they navigate life after leaving prison and joining an unfamiliar and complex organisation.  I have learned a huge amount too."
        },
        {
            "text": "The staff member is passionate about their job, and regularly excels. I have been honoured to share their enormous pride when they secured permanent employment as a result of their hard work and commitment. I have been thrilled when they share excellent feedback that they have received at work, and I can tell how much they love their job and public service."
        },
        {
            "text": "I have been glad to see them grow as they work through the ups and downs of professional life: work pressures, colleague relationships, management changes.  The professional challenges may be broadly common across departments and roles, but the personal impacts have been significant for someone keen and committed to a new start. Their prison background is shared openly with their manager, but understandably they have chosen to keep it private from colleagues. So, every time they have been assigned a new manager they have been anxious about how their background will be perceived. Any question about their performance added to their fear they aren’t trusted. Their many professional achievements have been secured alongside a much greater personal journey to believe that they can be a valued team member."
        },
        {
            "heading": 3,
            "text": "Why would Defra hire prison leavers?"
        },
        {
            "text": "You may wonder why we have prison leavers working in the Civil Service? To me the case is clear. Each year, in England and Wales, approximately 45,000 people will return to society after their sentence. Prison leavers have much lower levels of employment than the general population: just 30.4% of people released from custody will be in employment 6 months after their release. Unfortunately, around 23%-31% will reoffend within two years. Meaningful and stable employment can support an ex-offender’s rehabilitation journey back into society: it has a direct effect on reducing reoffending."
        },
        {
            "text": "Employers overwhelmingly find that prison leavers are motivated, trustworthy, loyal and reliable. And leading companies in the private sector have been employing prison leavers for years. In my view, the Civil Service must have a role to play in providing roles for prison leavers. Fiona Ryland, Government Chief People Officer agrees and has been promoting prison leaver recruitment across Government - Prison Leaver Recruitment in the Civil Service "
        },
        {
            "text": "Prison leavers can be valued and trusted members of Defra Group. Defra proudly participates in a number of Going Forward into Employment (GFiE) schemes, and will [shortly] be launching new guidance for managers to recruit and onboard prison leavers to help fill some of our vacancies, join our teams and contribute to our meaningful service to agriculture and the environment."
        },
        {
            "text": "The Cabinet Office’s Going Forward into Employment (GFiE) schemes provide innovative approaches to recruitment, providing people from a wide range of backgrounds who face barriers to employment (including carers, care leavers, military veterans and prison leavers) with opportunities within the Civil Service."
        },
        {
            "text": "GFiE helps to make the Civil Service more representative of the country we serve, increases cognitive diversity, bringing new voices and lived experiences into the Civil Service. Of course, certain convictions are out of scope for prison leaver employment in the Civil Service, and vacancy holders are supported with onboarding and managing new staff through this route."
        },
        {
            "text": "I am a proud member of the new GFiE Oversight and Advisory Group, joining cross Whitehall leaders to shape GFiE’s strategy and oversee delivery. I am very excited about supporting GFiE to deliver its objectives in 2024."
        },
        {
            "heading": 3,
            "text": "Evidence sources"
        },
        {
            "text": "If you want to know more about GFiE Life Chance Schemes, or are a Government department and would like to discuss providing life changing opportunities to individuals through use of the schemes for vacancies you have coming up, please get in contact with the GfiE Team at GFiE@cabinetoffice.gov.uk"
        }
    ]
}