{
    "url": "https://naturalengland.blog.gov.uk/2025/02/28/beaver-wild-release-a-milestone-for-nature-recovery-in-england/",
    "title": "Beaver wild release: a milestone for nature recovery in England",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Biodiversity",
        "Climate change",
        "Flood Management",
        "Licensing",
        "Natural England",
        "Nature Recovery",
        "Nature-based solutions",
        "Wildlife"
    ],
    "pub_date": "2025-02-28T10:40:52+00:00",
    "content": [
        {
            "text": "By Stuart Otway, Principal Officer in Natural England’s Complex Cases Unit and Delphine Pouget, Principal Officer in Natural England’s Species Recovery & Reintroductions Team "
        },
        {
            "text": "After centuries of absence, beavers are beginning to reclaim their rightful place in the English landscape. These industrious mammals, once hunted to extinction, are now being returned to our rivers and wetlands, bringing with them a wealth of ecological benefits. The beaver’s ability to transform and revitalise our degraded landscape is extraordinary.  "
        },
        {
            "text": "Natural England believes that their successful reintroduction will play a vital part in restoring rivers and wetlands, addressing the nature crisis and contributing to the delivery of national biodiversity targets including the creation of wildlife-rich habitats and halting the decline in species abundance. This is based on the extensive research and experience that we and our partners have been able to acquire through a careful, rigorous approach to beaver reintroduction over the last twenty years. It has been a long journey to this point, during which we have helped to provide  feasibility studies, evidence, advice and recommendations to government in 2021, as well as successfully introducing a protection and licensing regime. We are proud of the work that has brought us to a very important new chapter for beavers and the natural world in this country. "
        },
        {
            "text": "Beaver wild release "
        },
        {
            "text": "The 28 February 2025 marks a historic day for nature recovery in England: the Government has announced its commitment to reintroducing beavers into the wild, moving beyond the previous system of release into enclosures. Included in the announcement is information regarding licensing the wild release of beavers, managing the existing wild beaver populations, and developing a long-term management plan for beavers in England. Natural England can now issue licences to projects wanting to reintroduce beavers into the wild, where these projects demonstrate clear benefits and where risks can be avoided, mitigated or managed. "
        },
        {
            "text": "The first project that we have licensed for wild release is the National Trust’s Purbeck Beaver Project in Dorset – where beavers are expected to deliver many benefits across the Purbeck Heaths National Nature Reserve including increasing biodiversity, restoring lost wetland habitats and improving the condition of the protected sites across the area. The project was assessed against beaver wild release criteria which have been developed through extensive engagement with stakeholders, in particular with the Environment Agency staff in our integrated project team.  "
        },
        {
            "text": "Reintroducing beavers is a complex process that requires careful planning and collaboration. Natural England’s licensing approach and criteria aim to achieve a measured pace of reintroduction, and prioritise areas where beavers can thrive without causing significant conflicts with people, agriculture and infrastructure. We will use an ‘expression of interest’ process to help understand and manage the flow of applications. This will ensure that applicant, Natural England and Environment Agency resources are focused on the projects most likely to meet the criteria. We will also be encouraging potential applicants to think and plan at the catchment scale, and to join up where appropriate. A link to the guidance on how to apply is at the end of this blog post. "
        },
        {
            "text": "Beaver management "
        },
        {
            "text": "Today Natural England has also published updated guidance on managing beaver activities. This is centred on the five-step approach to beaver management first adopted in 2022, starting with raising awareness and making space for beavers, followed by management that can be done without a licence, when a licence is needed, and the licences that are available. The guidance also contains information on grants that can help with managing dams, and protecting trees and crops. We have also trained 400 people in managing beavers, and they can register for one of the class licences that have been designed to enable rapid and proportionate responses to potential challenges.   "
        },
        {
            "text": "Beaver enclosures "
        },
        {
            "text": "Beaver enclosures have played an important role in raising awareness and understanding, but it is now time to focus on establishing and learning to live with beavers in the wild. We are therefore transitioning to a position where further enclosures will only be permitted in specific circumstances and more information on this will be shared in due course. We have run a series of workshops in January 2025 to help improve the monitoring and management of enclosed beavers. There will now be opportunities for beaver families or offspring from existing enclosures to be released into the wild as part of release projects. Any proposal to remove enclosure fences and integrate beaver families into an existing wild population or new wild release project must first secure a beaver wild release licence, and in the first instance enclosure owners should speak to their local beaver management group or wild release project team. "
        },
        {
            "text": "Beaver partnerships "
        },
        {
            "text": "Natural England is immensely grateful to our many partners who have helped pave the way and provided the critical evidence underpinning this decision. In particular we have benefited from Environment Agency staff joining our integrated project team and board. "
        },
        {
            "text": "Devon Wildlife Trust has been instrumental in gathering much of the evidence from the River Otter Beaver Trial (ROBT). The Beaver Trust has championed the return of this species and provided essential technical expertise for beaver translocation. The Universities of Exeter and Newcastle have developed cutting-edge tools to understand the complex interactions between beavers and their environment, as well as their impact on human communities. "
        },
        {
            "text": "Lessons from the ROBT have informed the creation of wider partnerships through beaver management and advisory groups. These groups aim to support local communities in adapting to the presence of beavers, particularly in areas where they have spread due to escapes from enclosures or illegal releases.  "
        },
        {
            "text": "Natural England has further fostered collaboration by establishing the National Beaver Forum. This forum brings together representatives from all sectors with an interest in the reintroduction and management of beavers in England. "
        },
        {
            "text": "What can you do? "
        },
        {
            "text": "Read the government policy statement on wild release and management of beavers in England  "
        },
        {
            "text": "Read our guidance on managing beaver activities, which includes links to beaver management groups, and information on grants and support for land managers "
        },
        {
            "text": "Engage with local beaver management groups and wild release projects: they may need help in identifying local risks and opportunities, and in monitoring and managing beavers and their activities. "
        },
        {
            "text": "Read our guidance on recording beavers and beaver activities  "
        },
        {
            "text": "Visit the Environment Agency's Water Hub to find how they see beaver as a key component of thriving, naturally functioning, climate resilient rivers and wetlands, and are adapting and embedding new ways of working.    "
        },
        {
            "text": "Read our guidance on ‘expressions of interest’ for wild release projects to understand the application process. "
        }
    ]
}