{
    "url": "https://moderncivilservice.blog.gov.uk/2025/02/28/lessons-from-the-government-property-agencys-one-big-thing-how-small-changes-are-making-a-big-impact/",
    "title": "Lessons from the Government Property Agency’s One Big Thing: How Small Changes are making a big impact",
    "authors": [
        "Government Reform"
    ],
    "categories": [
        "A Modern Civil Service",
        "Ambitious",
        "Capability",
        "Government Reform",
        "Innovation",
        "Modernisation and Reform",
        "One Big Thing",
        "Proud Civil Servant"
    ],
    "pub_date": "2025-02-28T09:51:53+00:00",
    "content": [
        {
            "heading": 6,
            "text": "A guest blog by Stuart Watts, Head of Customer Insights and Workplace Change at the GPA"
        },
        {
            "text": "Imagine if one small change to how your team works could save hours each week, or spark fresh, creative ideas. At the Government Property Agency (GPA), that's exactly what’s been happening. As part of the Civil Service’s One Big Thing (OBT) initiative, we’ve embraced the power of small changes to help unlock our innovation potential, empower teams, and challenge current ways of working."
        },
        {
            "text": "We began raising awareness about our participation in this year's initiative in October and officially kicked it off at our staff conference in November. Since then, our teams have been exploring simple, impactful changes they can make to their day to day work. No formal sign off required, no need to ask permission — just pick an idea, try it, learn from it, and share the results. It’s about removing barriers and creating a culture where it’s okay to fail, as long as we’re learning."
        },
        {
            "text": "Here's a look at how we’ve approached OBT at the GPA, the changes our teams are making and the lessons we’ve learned along the way."
        },
        {
            "heading": 2,
            "text": "Lessons learned: What we’d do differently (and what’s worked well)"
        },
        {
            "text": "Taking part in this year's OBT has taught us valuable lessons about how to create lasting change. It’s not always about big, dramatic shifts. It’s about starting small, not overwhelming colleagues, learning as you go and building momentum from there. Here are some of the things we’ve learned so far:"
        },
        {
            "heading": 3,
            "text": "Start with a bang"
        },
        {
            "text": "We launched OBT at the GPA with an energising, fun, and slightly awkward session at our staff conference in November. We used an activity called 25/10 crowdsourcing, where teams rapidly created, shared, and scored ideas. The result? Over 250 great ideas captured in 25 minutes."
        },
        {
            "text": "This really set the scene for the following months of experimentation and changes that we encouraged teams to take part in. Demonstrating that ideas don’t have to be big and game changing to make a difference. Some of the most impactful suggestions, like shorter meetings or shadowing opportunities scored most highly with colleagues."
        },
        {
            "heading": 3,
            "text": "Empowering teams to act"
        },
        {
            "text": "Removing barriers and processes, like needing formal sign off, was key. We encouraged teams to just go for it. The freedom to experiment created a bit of a buzz of activity and a willingness to try new things from the teams."
        },
        {
            "heading": 3,
            "text": "Leadership backing matters"
        },
        {
            "text": "Having leadership visibly support the initiative was crucial. From attending sessions to promoting the initiative across internal channels and all staff calls, their involvement gave teams the confidence to embrace change."
        },
        {
            "heading": 3,
            "text": "Facilitator network to drive engagement"
        },
        {
            "text": "Our network of volunteer facilitators was invaluable. They supported discussions, guided teams, and captured changes being implemented. This approach ensured the initiative reached all corners of the GPA."
        },
        {
            "heading": 3,
            "text": "Acknowledging time and capacity constraints"
        },
        {
            "text": "While many teams embraced OBT, we learned that future initiatives need to consider time and capacity to ensure more teams can engage meaningfully. Competing priorities meant that not every team could fully take part, despite their interest and enthusiasm at our away day."
        },
        {
            "text": "One key takeaway was that small changes are easiest to embed when they become part of existing team routines. Some teams found it helped by breaking their One Small Change into smaller chunks, adding it as a standing agenda in team meetings, and even incorporating it into away day activities. By weaving OBT into what teams were already doing, rather than treating it as an extra task helped make this easier for colleagues to take part in. "
        },
        {
            "heading": 2,
            "text": "What's next?"
        },
        {
            "text": "As the One Big Thing initiative concludes, its principles will live on as we’re focused on capturing its long term impact and ensuring the momentum continues. A key focus is reflecting on the lessons learned and integrating them into our broader approach to continuous improvement at the GPA. "
        },
        {
            "text": "The initiative has aligned perfectly with the GPAs core skills of innovation and change, ensuring a culture where colleagues feel empowered to experiment, share, and build on their ideas. By embedding these principles into our everyday practices, we’re ensuring they remain a vital part of how we grow and evolve as an organisation."
        },
        {
            "text": "Stuart Watts, Head of Customer Insights and Workplace Change - closing note: “Innovation doesn't always require a big plan or a big budget. Sometimes, it’s as simple as starting a conversation, trying something new, and seeing what happens. Through OBT, we’ve seen teams across the GPA do just that - and the results speak for themselves.”"
        },
        {
            "text": "If you’d like to learn more about the GPA’s experience with One Big Thing or have questions about how we’re driving continuous improvement, please contact Stuart Watts."
        }
    ]
}