{
    "url": "https://space.blog.gov.uk/2025/02/28/meet-the-space-exploration-advisory-committee-seac/",
    "title": "Meet the Space Exploration Advisory Committee (SEAC)",
    "authors": [
        "UK Space Agency"
    ],
    "categories": [
        "Advisory Boards",
        "Space exploration"
    ],
    "pub_date": "2025-02-28T10:38:07+00:00",
    "content": [
        {
            "text": "The Space Exploration Advisory Committee is composed of UK-based experts across scientific and technical disciplines related to space exploration. Its members are external to the UK Space Agency and are expected to represent the views of the community."
        },
        {
            "text": "The Committee advises the UK Space Agency on the UK’s Space Exploration programme, including participation in European Space Agency programmes and associated national activities, and any other related matters."
        },
        {
            "heading": 2,
            "text": "Professor Caroline Smith"
        },
        {
            "text": "Head of Collections and Principal Curator of Meteorites, Natural History Museum"
        },
        {
            "text": "BiographyProfessor Caroline Smith is the Head of Collections and Principal Curator of Meteorites at the Natural History Museum, UK. She was a member of the ESA/NASA Joint Science Working Group planning for a proposed Mars exploration mission, providing input and advice related to sample curation and containment during collection, caching and on return to Earth. She was UK representative for iMARS Phase 2, co-chairing the Science Team, and Co-PI of the European Commission Horizon2020 project EURO-CARES, which developed a roadmap for a future European Sample Curation Facility to curate samples returned from sample return missions. Professor Smith is also a member of ESA's Human Spaceflight and Exploration Science Advisory Committee (HESAC) and a member of UK Space Agency’s Discovery Advisory Committee for Science (DACS). She is working with colleagues at the Natural History Museum developing a new Space Exhibition. "
        },
        {
            "heading": 2,
            "text": "Professor Karen Olsson-Francis"
        },
        {
            "text": "Director of Astrobiology OU, Open University"
        },
        {
            "text": "Biography Professor Karen Olsson-Francis is the Director of AstrobiologyOU, a group that aims to bring together expertise in science, technology, international development, law and education to address the scientific and governance challenges associated with the advancement of astrobiology and related space exploration missions. Her research predominantly focuses on microorganisms that live in extreme environments, including the International Space Station. She is the UK representative on the international COSPAR (Committee on Space Research) Panel on Planetary Protection and a member of the ESA Life Science Working Group."
        },
        {
            "heading": 2,
            "text": "Dr Joel Davis"
        },
        {
            "text": "Lecturer in Planetary Science, Imperial College London"
        },
        {
            "text": "Biography Dr Joel Davis is a planetary geologist at Imperial College London, where he is a lecturer and UK Space Agency research fellow. He specialises in the geology and surface environment of Mars is currently affiliated with four ongoing missions: NASA’s Curiosity rover and HiRISE instrument, ESA’s CaSSIS camera, and the ExoMars rover’s Pancam instrument."
        },
        {
            "heading": 2,
            "text": "Professor Phil Williams"
        },
        {
            "text": "Professor of Biophysics, University of Nottingham"
        },
        {
            "text": "Biography"
        },
        {
            "text": "Professor Phil Williams is a qualified pharmacist, having graduated from the University of Nottingham in 1988 and undertaking pre-registration training in community pharmacy. He returned to Nottingham in 1989 to undertake a PhD titled ‘Computational Studies in Scanning Probe Microscopy’ and has remained there ever since. He is a Professor of Biophysics in the School of Pharmacy, and Associate Pro-Vice-Chancellor for Research and Knowledge Exchange of the Faculty of Science. His research developed an understanding of the mechanical properties of proteins and has led to global collaborations in the areas of single molecule biophysics and molecular evolution. His interdisciplinary research encompasses the application of experimental techniques linked to computational analysis and simulation, and theory. Examples of his research include developing on-site, on-demand manufacture of medicines, studying the role of force in haemostasis and adaptation that links to the effects and consequences of spaceflight and in altered environments, and the changes in mechanical properties of muscle in spaceflight. In 2018, he established the world’s first PhD cohort training programme in Astropharmacy; a subject that he also teaches to Pharmaceutical Science undergraduates."
        },
        {
            "heading": 2,
            "text": "Dr Frances Butcher"
        },
        {
            "text": "Leverhulme Trust Early Career Research Fellow, University of Sheffield"
        },
        {
            "text": "Biography"
        },
        {
            "text": "Dr Frances Butcher is a Leverhulme Trust Early Career Research Fellow in the Department of Geography at the University of Sheffield. She is a planetary scientist and glacial geomorphologist who researches the history of glaciation on Mars and Earth, and is working to inform future robotic and eventual human missions to Mars. Frances graduated with an undergraduate degree in Geography from the University of Cambridge in 2015. She then moved to The Open University for her PhD entitled 'Wet-Based Glaciation on Mars'. In 2019, Frances moved to the University of Sheffield as a postdoctoral research assistant working to reconstruct Earth's past ice sheets. She now holds a Leverhulme Early Career Research Fellowship at Sheffield, entitled 'Deciphering Mars' Glacial Landscapes to Underpin Science Goals of Human Missions'. In 2022, Frances served on the 'Measurement Definition Team' for the International Mars Ice Mapper (‘I-MIM’) orbital mission concept. She is also on the science team for the CaSSIS camera on ExoMars Trace Gas Orbiter. She founded and leads the 'CryoMars' network of UK researchers and international collaborators working on Mars cryosphere and Earth analogue topics."
        },
        {
            "heading": 2,
            "text": "Dr Romain Tartese"
        },
        {
            "text": "Senior Lecturer, University of Manchester"
        },
        {
            "text": "BiographyDr Romain Tartese obtained a PhD in Earth Sciences at the University of Rennes (France) in 2011. After a few years working as a postdoctoral researcher at the Open University and the Natural History Museum in Paris, Romain joined the University of Manchester in 2017 as a research fellow, where he is now a senior lecturer. Since joining Manchester, Romain has been working on science questions related to how planets formed and evolved, and to the volatile inventory of early Solar System bodies, and notably the Moon. Romain is also involved in developing and testing instrument packages for future missions, such as the ESA PROSPECT and the NASA DIMPLE payloads that should fly to the Moon in 2026."
        },
        {
            "heading": 2,
            "text": "Dr Samantha Jones"
        },
        {
            "text": "Postdoctoral Research Associate, University of Liverpool"
        },
        {
            "text": "BiographyDr Samantha Jones is currently a Research Project Manager based at the Institute of Life Course and Medical Sciences (ILCaMS), University of Liverpool. She is primarily responsible for the management of the microgravity research portfolio within the Institute, including two UK Space Agency (UKSA) funded national missions to the International Space Station, MicroAge and MicroAge II and a joint UKSA-ESA supported project, FLUMIAS-ISS."
        },
        {
            "text": "As the previous lead post-doctoral researcher for the MicroAge Mission, she was focussed on researching the effects of microgravity on skeletal muscle function and how it relates to musculoskeletal ageing on Earth. Her skills and knowledge-base are firmly seated in the areas of skeletal muscle micro-tissue engineering, skeletal muscle physiology, microgravity research (lower earth orbit), hardware validation for life science payloads and coordination of mission operations. Find Dr Samantha Jones on LinkedIn. MicroAge Website"
        },
        {
            "heading": 2,
            "text": "Marie-Claire Perkinson"
        },
        {
            "text": "Head of Mission and Spacecraft Chief Engineering, Airbus Defence and Space"
        },
        {
            "text": "Biography"
        },
        {
            "text": "Marie-Claire Perkinson manages the Mission and Spacecraft Chief Engineering department at Airbus Defence and Space UK overseeing the system engineering activities at all stages of the project lifecycle for Earth Observation, Science, Exploration and Telecommunications programmes. Previously she led the Exploration Future Programmes activities overseeing bidding for Mars, Moon and LEO early phase studies and implementation projects. "
        },
        {
            "text": "Marie-Claire has managed multiple science, and planetary exploration future projects and proposals since joining Airbus in 1999, including, LISA, XEUS/IXO, Marco Polo and Mars Sample Return. She is also the current Chair of the UKSpace Space Science and Exploration Committee. "
        },
        {
            "text": "Marie-Claire holds a Degree in Physics with Space Science and a Masters in Electromechanical Engineering from the University of Leicester. "
        },
        {
            "heading": 2,
            "text": "Steven Kay"
        },
        {
            "text": "Robotics Engineer, GMV"
        },
        {
            "text": "BiographySteven Kay is a Robotics Engineer at GMV UK. He leads the UK Robotics team as part of the Robotics and Onboard Autonomy (ROA) division. Steven works as a Project Manager and Technical Lead for ESA and national programmes. Currently, he is leading a number of activities relating to Lunar rover navigation for ESA, including the development of a novel continuous-drive based rover Guidance Navigation and Control system and early development and breadboarding of a GNSS/LCNS-based navigation filter for future rovers. Also, he is leading a number of orbital robotic initiatives relating to In-Orbit Servicing and Active Debris Removal."
        },
        {
            "heading": 2,
            "text": "Dr Manish Patel"
        },
        {
            "text": "Professor of Planetary Science, The Open University"
        },
        {
            "text": "BiographyDr Manish Patel is a Professor of Planetary Sciences at the Open University. He has over 20 years of spaceflight research experience and has participated in multiple successful space missions such as Beagle 2, Cassini-Huygens and the ExoMars Trace Gas Orbiter.  His research interests revolve around the atmospheric environments of Solar System bodies (in particular Mars and Venus) and detector technology for imaging instruments.  He is Co-PI of the NOMAD instrument currently operating on the ExoMars Trace Gas Orbiter and has numerous significant involvements in active missions such as JUICE, EnVision and the Rosalind Franklin Rover. Manish has served on national and international advisory panels and is currently the UK representative on the ESA Solar System Exploration Working Group."
        },
        {
            "heading": 2,
            "text": "Dr Ruth Bamford"
        },
        {
            "text": "Senior Research Scientist, UKRI/ STFC/ RAL Space"
        },
        {
            "text": "BiographyDr Ruth Bamford is currently working at UKRI/STFC/RAL Space based at the Rutherford Appleton Lab. She is a visiting Scientist in the Department of Physics, University of Oxford. A laboratory and space Plasma physicist, her research interests include Technology enabling crewed space exploration, Lunar Swirls and mini-magnetospheres, Mars environment and terraforming, Novel plasma-based propulsion systems, Novel plasma drill for lunar, asteroid and Mars, Ionospheric physics, radio propagation & Space Weather. Currently Dr Bamford is the Principle Investigator on the ESA/UK Space Agency DISCUS propulsion project concept proposed by Alan Bond, the UK Space Agency/ESA RE-Risk GSTP project AEGIS (Active Electromagnetically Generated Inductive Shield) and DIGGER (Drilling and Integrated GigaHertz-Generated Energy Resource) for Lunar and Asteroid applications."
        },
        {
            "heading": 2,
            "text": "Professor Peter Lee"
        },
        {
            "text": "Professor of Materials Science, University College London"
        },
        {
            "text": "BiographyProfessor Peter Lee holds the Royal Academy of Engineering Chair in the Emerging Technology of Additive Manufacturing. He is a Professor of Materials Science at University College London, but his group is based at three locations: 1. UCL, 2. the Research Complex at Harwell, where the UK’s Synchrotron, Neutron and Laser sources are located; and 3. ESRF, the European Synchrotron in Grenoble France. His research focusses on the computational simulation and X-ray imaging of materials at a microstructural level. He was one of the pioneers of multi-scale and through process modelling (now termed ICME), working at Alcan on the prediction of defects in light alloy components for companies such as Ford and Rolls-Royce. Peter is an avid experimentalist, developing nano-precision rigs that replicate the processing and service performance of materials on synchrotron beamlines, enabling us to see inside materials in 3D as they change in time. He has developed a series of additive manufacturing machines (both powder bed and Directed Energy Deposition blown powder) that work on synchrotron beamlines at Diamond Light Source, ESRF and APS. His work is revealing how microstructures evolve in processes ranging from additive manufacturing, volcanic eruptions and microstructures within the human body. His experimental techniques and open-source codes have been exploited internationally by aerospace, automotive, energy and biomedical companies to solve key engineering challenges – from developing additive manufactured human joint replacements to aerospace components."
        },
        {
            "text": "See “Peter D Lee Google Scholar” or his AM or bio homepages. "
        },
        {
            "heading": 2,
            "text": "Professor Damian Bailey"
        },
        {
            "text": "Royal Society Wolfson Research FellowProfessor of Physiology and Biochemistry, University of South Wales"
        },
        {
            "text": "BiographyProfessor Damian M. Baileyembarked on a PhD in clinical human physiology while working as a research physiologist at the British Olympic Medical Centre in collaboration with Oxford University.  Following training at the Universities of California San Diego, Colorado Health Sciences Center and Heidelberg, he returned to the University of South Wales where he is a Royal Society Wolfson Professor of Physiology & Biochemistry leading the Neurovascular Research Laboratory. He is Editor-in-Chief of Experimental Physiology and Chair of the Life Sciences Working Group to the European Space Agency. His research program is recognised internationally and takes an integrative approach to investigate how the human brain functions when challenged by changes in oxygen and gravity. He has published ~380 papers with an h-index of 60 and is the recipient of numerous prestigious fellowships and awards."
        },
        {
            "heading": 2,
            "text": "Professor Adam Amara"
        },
        {
            "text": "Professor of Astrophysics, University of SurreyChief Scientist, UK Space Agency"
        },
        {
            "text": "BiographyAdam Amara is a distinguished astrophysicist with a focus on cosmology, the evolution of the universe, and exoplanet research. Adam is a Professor of Astrophysics at the University of Surrey, he was appointed Chief Scientist at the UK Space Agency in November 2024. Throughout his career, Adam has made significant contributions to the understanding of dark matter, dark energy, and exoplanets. He played a pivotal role in the development of the Euclid space telescope, a mission designed to explore the dark universe. In addition to his work on Euclid, he has been actively involved in the Dark Energy Survey (DES), advancing research into the properties of dark energy and developing calibrated ultra-fast image simulations to refine weak lensing measurements. Adam is also known for co-developing PynPoint, a software tool for direct imaging of exoplanets. PynPoint enhances the detection of faint exoplanets near bright stars and has been successfully applied to real-world data, including beta Pictoris b. A passionate advocate for science education, Adam has worked at academic institutions across the UK, US, France, Switzerland, Hong Kong, Taiwan, and Liberia. He is committed to fostering international collaboration and inspiring the next generation of scientists."
        },
        {
            "text": "To find out more about the committee's structure and activities, see the Space Exploration Advisory Committee (SEAC) page on the UK Space Agency website."
        }
    ]
}