{
    "url": "https://nationalscreening.blog.gov.uk/2025/02/28/please-respond-to-uk-nsc-stakeholder-survey/",
    "title": "Please respond to UK NSC stakeholder survey",
    "authors": [
        "TJ Day"
    ],
    "categories": [
        "General"
    ],
    "pub_date": "2025-02-28T11:57:19+00:00",
    "content": [
        {
            "text": "In 2022, the UK National Screening Committee (UK NSC) published the UK NSC stakeholder engagement strategy following a review of its stakeholder and public involvement activities."
        },
        {
            "text": "We are committed to regularly reviewing this strategy to ensure the committee’s stakeholder engagement is effective, proportionate, and fit for purpose. As part of this review, we are asking for your feedback on the information the UK NSC provides and the way we engage with individuals and organisations."
        },
        {
            "text": "The committee could not do its work without drawing on the research, expertise, opinions, and experiences of a wide range of individuals and organisations. Stakeholders range from people with lived experience of a condition to patient groups, screening policy makers, researchers and commercial organisations."
        },
        {
            "text": "Effective consultation, collaboration and communication with stakeholders helps:"
        },
        {
            "text": "Your responses will be anonymous and will help us improve the way the UK NSC involves stakeholders and the public in its work. We will publish a summary of the survey responses on this blog in due course."
        },
        {
            "heading": 2,
            "text": "Keep up to date "
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK NSC. You can register to receive updates direct to your inbox, so there is no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, please email uknsc@dhsc.gov.uk. "
        }
    ]
}