{
    "url": "https://greatbritishnuclear.blog.gov.uk/2024/05/02/a-visit-to-the-largest-environmental-project-in-britain/",
    "title": "A visit to the largest environmental project in Britain",
    "authors": [
        "Lucky Nwosu"
    ],
    "categories": [
        "Nuclear"
    ],
    "pub_date": "2024-05-02T17:17:14+01:00",
    "content": [
        {
            "text": "In April 2024, colleagues from Great British Nuclear and the Department for Energy Security and Net Zero attended a guided visit to Hinkley Point C."
        },
        {
            "heading": 2,
            "text": "Touring the site"
        },
        {
            "text": "The 3.2 GW nuclear power station is the first to be built in over 20 years and is the biggest environmental project in the UK. The site is based in Somerset, and once completed it will house two nuclear reactors. This is the first in a new generation of nuclear power stations in the UK, which will provide zero-carbon electricity for millions of homes. Nuclear energy has a vital role to play in our energy future, and it’s a form of energy that has been providing the UK with clean electricity for 60 years."
        },
        {
            "text": "During the visit, the group had the chance to walk across the site, taking in the sheer scale of the work that is underway."
        },
        {
            "text": "Early in the tour, the group stopped to hear some facts about Big Carl, the world’s largest land-based crane. At 250 metres tall, it can lift 5,000 tones. It runs on rail tracks, allowing it to be moved in different directions. Late last year, the crane was used to place a 245-tonne steel dome on top of the first of two nuclear reactors on site."
        },
        {
            "text": "The crane is being used to lift sections of the power station into place, with the capacity and size of the crane helping to save time and boost efficiency."
        },
        {
            "text": "The group was shown a reactor building, which has the capacity to power 3 million homes. The core is due to be added at the end of 2024. In total, 6 million homes will be powered by Hinkley Point C."
        },
        {
            "text": "Work on a project of this size is no mean feat, with 10,500 staff on site."
        },
        {
            "text": "There is also a visitor centre located close-by, where people can explore how electricity is created."
        },
        {
            "heading": 2,
            "text": "The benefits of Hinkley Point C"
        },
        {
            "text": "The group heard first-hand about the employment and apprenticeship opportunities that have been created by the construction of Hinkley Point C."
        },
        {
            "text": "This includes:"
        },
        {
            "text": "The visit was highly positive and was enjoyed by the group, with many of the attendees struck by the sheer scale of the site."
        },
        {
            "text": "It was impactful to see a project of this scale as it develops, particularly considering how vital a role it has in the UK’s future energy security and aim of achieving Net Zero."
        },
        {
            "text": " "
        }
    ]
}