{
    "url": "https://grantscommunity.blog.gov.uk/2024/05/02/collaboration-across-government-grants-is-paving-the-way-for-more-efficiencies/",
    "title": "Collaboration across government grants is paving the way for more efficiencies",
    "authors": [
        "govtgrantscommunity"
    ],
    "categories": [
        "Accessibility",
        "Apply for a grant",
        "Department of Transport",
        "Evaluation",
        "Global Accessibility Awareness Day",
        "Government Grants Management Function"
    ],
    "pub_date": "2024-05-02T06:36:02+01:00",
    "content": [
        {
            "text": "If your interest is piqued by innovation, grants or charging up your electric car at home, keep reading."
        },
        {
            "heading": 2,
            "text": "Costing less to charge up"
        },
        {
            "text": "At the Department for Transport (DfT) and the Office for Zero Emission Vehicles (OZEV), we are making it easier for millions of electric vehicle (EV) drivers to access more reliable public charging close to home."
        },
        {
            "text": "You can now apply for a new and additional Electric Vehicle (EV) Chargepoint Grant. This grant targets those with access to on-street parking, supporting them to buy and install a cross-pavement solution to allow safe EV charging."
        },
        {
            "text": "If your house or block of flats has street parking near to a road that is wide enough for traffic to pass safely, and you have permission from your local planning and highways authorities, you could get 75% off the cost to buy and install a socket, up to a maximum of £350."
        },
        {
            "heading": 2,
            "text": "Innovation and efficiencies"
        },
        {
            "text": "Since March 2023 DfT has been part of a new, efficiency pilot led by Cabinet Office (which is itself part of the pilot) and four more government departments, which have between them offered up a total of ten schemes to date."
        },
        {
            "text": "DfT supports the Cabinet Office objective to streamline the grant management process, aiming for simplicity, speed, fairness and efficiency through increased automation. This approach benefits both grant applicants and administrators while upholding stringent measures to combat fraud and error."
        },
        {
            "text": "DfT also embraces the overarching goal of centralising a managed grant service, foreseeing enhanced efficiencies, improved capabilities, service delivery and user experience. This endeavour is aimed at ensuring grants are allocated to deserving recipients, thereby supporting the objectives of the DfT."
        },
        {
            "heading": 2,
            "text": "Collaboration"
        },
        {
            "text": "Innovation pilots all start with trust, collaboration and great communication. This efficiency pilot requires courage from grant administrators - to try new approaches, overcome challenges, embrace flexibility and compromise."
        },
        {
            "text": "DfT's participation in this pilot demonstrates its commitment to advancing broader efforts aimed at enhancing efficiency and innovation in grant management across government. DfT is eager to engage with the Managed Service and leverage specialised expertise, strengths, and technical proficiency to facilitate the administration of DfT grants."
        },
        {
            "text": "Led by the Cabinet Office and in collaboration with DfT, Home Office, Department for Science, Innovation and Technology, and Department for Business and Trade the pilot encompasses confirmed grants exceeding £22 million, catering to various government priorities such as sustainable transportation and climate change mitigation. DfT remains actively engaged with the Managed Service, making progress in the management of its EV Chargepoint grant."
        },
        {
            "text": "By January 2025, the Cabinet Office will conclude the evaluation of the pilot, paving the way to explore the feasibility of an alternative, thoroughly tested Managed Service for the setup, management, and execution of government grants and associated processes. DfT's involvement in this initiative is commendable."
        },
        {
            "text": "Remember to check out if and how a government grant could help you make the switch to electric vehicles."
        },
        {
            "text": " "
        },
        {
            "text": "Nadeem Ilyas\nHead of Financial Control and Counter Fraud, DfT Group Finance"
        }
    ]
}