{
    "url": "https://mhclgmedia.blog.gov.uk/2024/05/02/coverage-of-voter-id/",
    "title": "Coverage of voter ID",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Elections"
    ],
    "pub_date": "2024-05-02T22:44:29+01:00",
    "content": [
        {
            "text": "The 2024 local elections have been well run, and local authorities have delivered them robustly and securely, as they always do."
        },
        {
            "text": "Read The Electoral Commission's Statement here."
        },
        {
            "text": "As recommended by international election watchdogs, including the Electoral Commission, we have introduced a requirement to show photographic identification for voting in person across Great Britain, in line with longstanding arrangements in Northern Ireland and elsewhere. This is a reasonable approach to combat the inexcusable potential for voter fraud that existed in our electoral system. "
        },
        {
            "text": "The government has always been clear that the list of accepted identifications needs to strike the right balance between security and accessibility. It also needs to be manageable by staff in polling stations. This is the balance we aimed to achieve with the current list of 22 identification documents, which we keep under review. "
        },
        {
            "text": "Our intention in future is for the new Veteran Card, which was rolled out in January 2024, to be added to the official list of recognised identification – and we are already consulting on this. Defence Identity cards for serving Armed Forces members are already accepted, including expired cards as long as the photo remains a good likeness."
        },
        {
            "text": "Our research shows that 96% of electors already own one from the broad list of accepted photographic identifications, and we are confident that the vast majority of voters in the polling station will have been able to cast their vote successfully at the polls on 2 May 2024.  "
        },
        {
            "text": "We have also introduced the free Voter Authority Certificate, which is accepted as a form of identification at polling stations, so that anyone who is eligible to vote can continue to do so.  "
        },
        {
            "text": "The Electoral Commission will be conducting an evaluation of the May 2024 polls. Data collected by local authorities and public opinion research will contribute to this evaluation, helping us understand further the impact of voter identification and the other Elections Act changes on the polls. "
        },
        {
            "text": "We already know that during the local elections in England in May 2023 the vast majority of voters in the polling station - 99.75% - cast their vote successfully, following a number of successful pilots of this process in previous elections.  "
        },
        {
            "text": "We are continuing to work closely with local authorities and other partners to raise awareness both of the requirement to show identification in the polling station and of the types of identification which are accepted, including a widespread public information campaign led by the Electoral Commission. We are grateful for the ongoing work of local authorities and other partners to deliver these new requirements."
        }
    ]
}