{
    "url": "https://ukhsa.blog.gov.uk/2024/05/02/how-to-stay-safe-from-infections-carried-by-animals-when-visiting-a-farm/",
    "title": "How to stay safe from infections carried by animals when visiting a farm",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Health Protection"
    ],
    "pub_date": "2024-05-02T17:12:49+01:00",
    "content": [
        {
            "text": "Visiting a farm is an enjoyable and educational experience for the whole family, but it carries a risk of infection from animals or the environment. Farm animals may carry germs that can be passed from animals to humans and cause illness, with symptoms including diarrhoea, vomiting, fever, nausea and body aches. In vulnerable groups, such as young children, pregnant women and elderly or immunocompromised people these infections can be particularly serious."
        },
        {
            "text": "Infection can be picked up from the animal’s body, its poo or from areas where animals are kept or have recently been. If the germs are on your hands, you could accidentally pass them to your mouth and become infected. You can’t see the germs, so your hands may appear clean."
        },
        {
            "text": "Washing your hands thoroughly with liquid soap and warm running water immediately after you have had contact with animals or the areas where they have been and at the end of your visit will reduce the risk of infection. Dry your hands; ideally, with paper towels. Hand gels or wipes are not a substitute for washing your hands after visiting a farm, due to the types of germs you might be exposed to. These germs may not cause animals to be visibly ill so it’s difficult to tell whether an animal is infected, especially when they look clean and healthy."
        },
        {
            "heading": 2,
            "text": "What to do when visiting a farm"
        },
        {
            "text": "Following the simple rules listed below will help to keep you and your children safe from infections that may be found on open or petting farms. Vulnerable groups need to take particular care as infections acquired from animals can be harmful to them: for pregnant women this also includes their unborn baby."
        },
        {
            "heading": 2,
            "text": "Things to do:"
        },
        {
            "text": "• Follow any rules and guidelines provided by the farm staff and maintain safe distances from animals to ensure your safety and the wellbeing of the animals\n• Wash your hands thoroughly with soap and warm running water after you have touched animals, fences or other surfaces where animals may have been, and dry your hands with paper towels\n• Supervise children closely and ensure that they wash their hands thoroughly using liquid soap and warm running water\n• Wash your hands thoroughly with soap and water before eating or drinking\n• When visiting a farm, only eat and drink in picnic areas or cafes\n• Try to avoid wearing open-toed shoes. At the end of your visit remove and clean boots or shoes and clean pushchair wheels. Then wash your hands thoroughly with soap and warm running water\n• If you have held or had contact with an animal wash clothing at 40C or hotter when you return home."
        },
        {
            "heading": 2,
            "text": "Things to avoid:"
        },
        {
            "text": "• Touching your face or mouth while petting animals or walking around the farm\n• Kissing or putting your face close to farm animals eating or drinking while touching animals or walking around the farm; this includes avoiding eating sweets, crisps or chewing gum\n• Eating anything that has fallen on the floor\n• Using sanitising gels or wipes instead of washing hands with liquid soap and warm running water. Sanitising gels and wipes do not remove the type of bugs found on farms effectively"
        },
        {
            "text": "If you are planning a school or group visit to a farm, you also need to make sure that you’ve considered all the risks and taken steps to manage them. Guidance is available to help schools and teachers do this."
        },
        {
            "heading": 2,
            "text": "What should I do if I feel unwell after a farm visit?"
        },
        {
            "text": "If you or anyone in your group feels unwell or has any symptoms such as diarrhoea or vomiting within 2 weeks of visiting a farm, contact your GP or call NHS 111 as soon as possible. If you or anyone in your group - particularly if they fall into a vulnerable group - has bloody diarrhoea, seek immediate emergency medical attention."
        },
        {
            "text": "Anyone who has experienced sickness or diarrhoea after visiting a farm could pass the illness on to others, so they should not attend work, school or nursery until they have been free of symptoms for at least 2 days. However, with infections from some bugs, extra tests may be needed to ensure they have fully recovered and will not pass on the infection to others before starting back at work, school or nursery. People who handle food, children under 5 years and those who work closely with people who may be vulnerable to infections should discuss with their GP or local health protection team before returning to work, school or nursery."
        }
    ]
}