{
    "url": "https://healthmedia.blog.gov.uk/2024/05/02/start-for-life-and-family-hubs-everything-you-need-to-know/",
    "title": "Family Hubs and Start for Life - everything you need to know",
    "authors": [
        "DHSC Media Team"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2024-05-02T10:17:17+01:00",
    "content": [
        {
            "text": "We are committed to giving every baby the best start in life."
        },
        {
            "text": "Here’s what you need to know about the government’s Family Hubs and Start for Life programme."
        },
        {
            "heading": 2,
            "text": "What is Start for Life? "
        },
        {
            "text": "There is strong evidence that the 1,001 days from conception to the age of two set the foundations for our cognitive, emotional, and physical development."
        },
        {
            "text": "The government published the ‘Best Start for Life: A Vision for the 1,001 Critical Days’ in March 2021. This sets out six areas for improving support for families during 1,001 critical critical days from conception to the age of two to ensure every baby in England is given the best possible start in life, regardless of background."
        },
        {
            "text": "As part of this, the government has invested an additional £300 million to support families in 75 local authorities in England, including those with high levels of deprivation."
        },
        {
            "text": "All 75 local authorities have opened a family hub in their area, with around 400 family hubs now open in England, providing a one-stop-shop for a variety of universal and specialist support services for families with children aged 0-19, or up to 25 for young people with Special Educational Needs and Disabilities [SEND]."
        },
        {
            "text": "Not only do family hubs make it easier for families to know where to go to get help, they make it easier for professionals to work together as a team to provide holistic support and information at the right time, in a joined-up way."
        },
        {
            "text": "Many local authorities without programme funding have also chosen to implement elements of the Vision."
        },
        {
            "text": "The additional funding has also enabled the government to:"
        },
        {
            "heading": 2,
            "text": "What Start for Life services are delivered through family hubs?"
        },
        {
            "text": "Family hubs provide a single place to go for face-to-face support and information from a variety of services."
        },
        {
            "text": "The tailored range of services offered by family hubs will vary but include midwifery, health visiting, infant feeding advice, parenting classes and perinatal mental health support."
        },
        {
            "text": "At the heart of all family hubs are services for families with 0 to 2 year-olds, which give babies a great start for life."
        },
        {
            "text": "You can also get support from a family hub if you’re a parent or carer of a child aged 0 to 19, or 25 with special educational needs or a disability, you’re pregnant, or you’re a young person up to the age of 19, or up to 25 with special educational needs or a disability."
        },
        {
            "heading": 2,
            "text": "How many family hubs are there?"
        },
        {
            "text": "There are around 400 family hubs which cover half of all county councils."
        },
        {
            "heading": 2,
            "text": "How much funding has gone into Start for Life?"
        },
        {
            "text": "Around £300 million has been invested to improve support for families through the Family Hubs and Start for Life programme."
        },
        {
            "text": "Of the £300 million, the government is investing £170 million into essential services in the critical 1,001 days:"
        },
        {
            "text": "This investment in family hubs and Start for Life services is significant. It will have wide reach across the country improving outcomes for thousands of babies, children, and families."
        },
        {
            "heading": 2,
            "text": "How does this compare to the Sure Start policy?"
        },
        {
            "text": " The Family Hubs and Start for Life programme builds on lessons from Sure Start and provides a wider range of services under one roof – these will support parents and carers of children of all ages."
        },
        {
            "text": "At the core of family hubs is a Start for Life offer for babies.  This focus is in response to the strong evidence that the 1,001 critical days from conception to the age of two sets the foundations for an individual’s cognitive, emotional and physical development."
        },
        {
            "text": "Spend on Sure Start at its peak was just a quarter of current overall spending on early years – which includes the biggest ever investment in childcare to support parents."
        },
        {
            "heading": 2,
            "text": "Will the Family Hubs and Start for Life programme be expanded nationally? "
        },
        {
            "text": " The government would like to see family hubs across the country and encourage all local authorities in England to work towards implementing the Start for Life Vision."
        },
        {
            "text": "Our current focus is on delivering improvements for families in the 75 local authorities and building an evidence base for what works well for future plans."
        }
    ]
}