{
    "url": "https://hodigital.blog.gov.uk/2024/05/02/words-matter-shaping-our-home-office-content-style-guide/",
    "title": "Words matter: shaping our Home Office content style guide",
    "authors": [
        "Steven Shukor, Principal Content Designer"
    ],
    "categories": [
        "Content",
        "User centred design"
    ],
    "pub_date": "2024-05-02T10:33:55+01:00",
    "content": [
        {
            "text": "Should you use ‘permission to enter’ or ‘leave to enter’? Is it 'border control' or 'passport control'? What about ‘biometric passport’ or ‘ePassport’?"
        },
        {
            "text": "These are some of the questions about language consistency that the Home Office content style guide has been created to answer."
        },
        {
            "text": "The easy-to-access guide aims to help the organisation communicate in the same way across all its products and services, whether they are internal or public-facing."
        },
        {
            "text": "Bookmark the style guide in your web browser so that you can open it with one click."
        },
        {
            "heading": 2,
            "text": "Designed to provide content guidance on department-specific topics"
        },
        {
            "text": "The Home Office style guide provides advice on what words to use to ensure our language is clear, consistent and current."
        },
        {
            "text": "The GOV.UK style guide is the main style reference for government departments, but it doesn’t tend to provide guidance on department-specific topics."
        },
        {
            "text": "Home Office Content Designers need guidance on topics like visas, passports, policing and immigration."
        },
        {
            "text": "Before the guide, colleagues across the organisation were often using different words to describe the same thing."
        },
        {
            "text": "When we started work on the Home Office style guide, we knew that for it to be successful it needed to be:"
        },
        {
            "text": "The guide was designed for digital content, but colleagues across the organisation have found it helpful and have been involved in its ongoing development."
        },
        {
            "heading": 2,
            "text": "A style guide based on insights from usability testing"
        },
        {
            "text": "We aim to be evidence-based."
        },
        {
            "text": "Entries such as ‘acronyms’, ‘consignor’ and ‘contractions’ are based on language insights gathered from usability testing of internal and external Home Office services."
        },
        {
            "text": "Other entries, such as ‘electronic travel authorisation’, ‘digital status’ and ‘refugee’ are based on:"
        },
        {
            "text": "All evidence, including user research, desktop research, SME feedback and pre-publication sign off, is saved to provide a robust audit trail."
        },
        {
            "text": "Since going live in December 2022 with 65 entries, we’ve added more than 50 new words, including:"
        },
        {
            "text": "asylum claimant"
        },
        {
            "text": "You can use either 'asylum claimant' or 'asylum applicant' to describe someone who has applied for asylum in the UK. Do not use both in the same product or service."
        },
        {
            "text": "ePassport"
        },
        {
            "text": "Use 'passport' if the type of passport does not matter. When referring to passports with a chip, use 'biometric passport' instead of 'ePassport'."
        },
        {
            "text": "permission to enter"
        },
        {
            "text": "Use 'permission to enter' instead of 'leave to enter' or 'limited leave to enter', which are no longer in official use. For example, 'apply for permission to enter the UK'. For 'indefinite leave to enter' see settlement."
        },
        {
            "heading": 2,
            "text": "Aligning the need to use clear language with the GOV.UK style guide"
        },
        {
            "text": "The guide is helping us to communicate more clearly with the people who use our public-facing services, many of whom don’t speak English as their main language."
        },
        {
            "text": "For example, we recently published guidance on contractions using insights from user research for the EU Settlement Scheme service:"
        },
        {
            "text": "contractions"
        },
        {
            "text": "Avoid all contractions, including positive contractions like 'we'll', 'you've' or 'they're' if your users are not fluent in English. Research shows that contractions make content difficult to understand for people with limited fluency. See general guidance on contractions in the GOV.UK style guide."
        },
        {
            "text": "This guidance is in alignment with the GOV.UK style guide – we aren’t trying to introduce a new way of using content but complement content best practice."
        },
        {
            "text": "We’re preparing to publish guidance on designing services for people who aren’t fluent in English based on research with people going through the immigration process."
        },
        {
            "heading": 2,
            "text": "Words matter – our style guide reflects our values"
        },
        {
            "text": "The subjects we deal with at the Home Office are topical and often sensitive."
        },
        {
            "text": "Words matter. Words can be divisive. Words can exclude. The style guide reflects our Home Office values, including compassion and respect."
        },
        {
            "text": "For example, the guide advises against pigeon-holing people under potentially emotive labels like ‘migrants’ or ‘clandestines’."
        },
        {
            "heading": 2,
            "text": "How we built the style guide"
        },
        {
            "text": "Our 6-month journey to publishing the guide started with a conversation with fellow Content Designers about language consistency."
        },
        {
            "text": "We researched online style guides, including BBC News, Guardian, NHS Digital, HMRC, GOV.Wales and GOV.UK. We reached out to Content Designers across government to learn from their experiences of creating a style guide."
        },
        {
            "text": "For sensitive or complex topics, we  work with subject matter experts such as policy and legal advisers to ensure our guidance is accurate. For example, we collaborated closely with an asylum policy team using pair writing to produce guidance on  ‘asylum seeker’ and ‘refugee’."
        },
        {
            "text": "We have an open line of communication with the Government Digital Service team who manage the GOV.UK style guide to discuss new topics that may have cross-government relevance."
        },
        {
            "text": "We recently introduced an ongoing series of style guide meet-ups. 44 content creators across government attended our very first meeting in January this year to share stories, swap best practice and hear from guest speakers."
        },
        {
            "heading": 2,
            "text": "How we manage and govern the style guide"
        },
        {
            "text": "The guide is managed by the style council, a group of 25 content creators from across the organisation, covering communications, service design, internal guidance and public-facing information. We meet once a month to consider new additions to the guide."
        },
        {
            "text": "To make it into the style guide, the topic or word should:"
        },
        {
            "heading": 2,
            "text": "Giving our colleagues confidence to use the ‘right’ words"
        },
        {
            "text": "We’ve had lots of positive feedback from colleagues across the organisation who tell us that the guide gives their teams the confidence that they’re using appropriate words consistently, whether they’re designing an internal or external service, creating guidance or writing a blog."
        },
        {
            "text": "Migration and Borders Group Guidance team"
        },
        {
            "text": "User-centred design team, General Register Office"
        },
        {
            "text": "HM Passport Office’s Guidance team"
        },
        {
            "text": "We continue to gather feedback to ensure the guide meets the needs of as many teams as possible."
        },
        {
            "text": " "
        }
    ]
}