{
    "url": "https://civilservice.blog.gov.uk/2022/08/16/a-simple-guide-on-words-to-avoid-in-government/",
    "title": "A simple guide on words to avoid in government",
    "authors": [
        "Sam Gregory"
    ],
    "categories": [
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Ambitious Civil Service",
        "An Innovative Civil Service"
    ],
    "pub_date": "2022-08-16T08:18:45+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Sam Gregory is on a mission to root out jargon in government. He's here to explore the worst offenders and offer the best alternatives. "
        },
        {
            "text": "As civil servants, our choice of terminology makes a huge difference to how the public understands our policies and our projects. Using certain words can even shape and change the policies themselves. For example, you might only realise the flaw in your policy when you have to explain it in plain English."
        },
        {
            "heading": 4,
            "text": "Avoid jargon"
        },
        {
            "text": "Using the wrong words can muddy the waters, and make our work less understandable to the vast majority of people who’ve never worked in the Civil Service. In the past, government has been notorious for communicating in its own highly-developed form of jargon. For example, think about the archaic language MPs use as part of the rituals of the House of Commons. This kind of language is often impenetrable to anyone who isn't already in-the-know, though sometimes it can be deliberate. The Plain English Campaign has some amusing examples of government jargon from recent years."
        },
        {
            "text": "When GOV.UK launched in 2012, replacing the confusing previous website, one of the aims was to simplify the language of government. This helps everyone complete tasks (like registering to vote) quickly and with minimum fuss. The website's constantly updated style guide tells anyone who publishes on GOV.UK how to write for the site. We also use it internally on the Department for Education intranet, alongside our own education-specific style guide."
        },
        {
            "text": "The guide contains a somewhat infamous list of words that you should avoid using on GOV.UK. Many of these are terms you will see in your inbox every day – some are so commonplace you might have stopped noticing them. For example, the word 'key' (unless it's a physical key that unlocks a door)."
        },
        {
            "text": "The guide points out that you can usually remove 'key' from a sentence and it makes no difference. Are the 'key stakeholders' actually just the stakeholders? Even if you need to qualify, words like 'important' or 'significant' are simpler and better for the job."
        },
        {
            "heading": 4,
            "text": "Deliver rarely delivers!"
        },
        {
            "text": "'Deliver' is another banned word that we use thousands of times a day. According to the guide: \"pizzas, post and services are delivered – not abstract concepts like improvements.\" Use 'make', 'create' or a term more specific to your project. We don't 'combat' problems unless the military is involved – we solve them or fix them. We don't 'streamline' or 'slim down' our departments or our projects – we simplify them or make them smaller."
        },
        {
            "heading": 4,
            "text": "Keep it simple"
        },
        {
            "text": "We never 'land' anything, unless it's an aircraft. 'Dialogue' is a needlessly fancy way of saying 'spoke to', and both 'collaborate' and 'liaise' really mean 'work with.'"
        },
        {
            "text": "We don't 'tackle' anything unless we're playing rugby – instead we solve it, reduce it or stop it. Some words like 'overarching' can often be cut out completely. Think about whether there is any need to qualify. Is your 'overarching project plan' actually just the project plan?​​​​​​​"
        },
        {
            "text": "Metaphors should always be avoided – we're not aiming to win the Booker Prize. Many of these are outdated and make a policy announcement more confusing than it needs to be. For example, instead of a 'ring-fenced' budget, use 'separate' or just say 'money that will be spent on X'."
        },
        {
            "text": "We don't 'drive' anything forward unless we're in a car, and we haven't opened a 'one-stop shop' as we're not a supermarket. We've probably launched a website."
        },
        {
            "heading": 4,
            "text": "Hot topic"
        },
        {
            "text": "This last example is a particularly hot topic for us on the intranet team. Every single week we receive requests to create a 'one-stop shop', a 'hub', a 'single front door' or a 'portal'. We often wonder whether we're expecting colleagues to open the single front door or step through the portal and find themselves in the one-stop shop. In nine out of 10 cases, what people really want is some new pages on our intranet."
        },
        {
            "text": "Writing in plain English is better both for our colleagues in the department and for the general public. People should be able to understand what we're doing in government and what we expect them to do without having to wade through jargon, metaphors and corporate bluster. Check out the 'words to avoid' list on the GOV.UK style guide (under 'W') to make your writing simpler and clearer."
        }
    ]
}