{
    "url": "https://designnotes.blog.gov.uk/2022/08/16/join-us-for-design-system-day-2022/",
    "title": "Join us for Design System Day 2022",
    "authors": [
        "Design System Team"
    ],
    "categories": [
        "Design System"
    ],
    "pub_date": "2022-08-16T14:00:44+01:00",
    "content": [
        {
            "text": "The GOV.UK Design System relies on a strong cross-government community to make sure it represents the latest research, design, and development work used in digital services."
        },
        {
            "text": "To bring our community together, GOV.UK Design System and Prototype Kit teams regularly host events, workshops, and co-design sprints. Our team is always on the lookout for ways to engage users in different teams and departments to help strengthen the work we do, and to help to build better products. "
        },
        {
            "text": "To continue this work we’ve decided to run our flagship event ‘Design System Day’ again this year. This is an opportunity to celebrate and discuss topics of interest for design system teams in government, the public sector, and the private sector. We’re hoping that the mix of attendees will lead to some interesting discussions and make the event a great place to network. We’re curating a space for engaging discussions, learning opportunities and future collaboration. "
        },
        {
            "heading": 2,
            "text": "This year’s programme"
        },
        {
            "text": "The event will run over 2 days on 15 and 16 November. This year the event will be online and most sessions will run between 10:00am and 4:00pm Greenwich Mean Time (GMT)."
        },
        {
            "text": "We’d like to collaborate and share knowledge about design systems with like-minded people around our 2022 theme ‘Inclusivity by design’. We’re hoping to cover topics such as accessibility, community and decision-making."
        },
        {
            "text": "Each day will include a keynote event, a variety of educational or training workshops and some attendee-led breakout discussions. These sessions will be facilitated by a mixture of our team, guests speakers and members of the design community."
        },
        {
            "text": "Tuesday 15 November:"
        },
        {
            "text": "Wednesday 16 November:"
        },
        {
            "heading": 2,
            "text": "What’s special about 2022?"
        },
        {
            "text": "We’ve listened to feedback from last year and have made a host of changes to make this year’s event better. "
        },
        {
            "text": "We’re running the event over 2 days this year. This allows for more scheduled break time in-between sessions, enabling attendees to get the best out of each session. Each portion of the event has been designed to balance input and interactive elements, making the conference as enjoyable as it will be educational."
        },
        {
            "text": "Some of the workshops and training sessions will be repeated on day 2, which means that this year our attendees won’t miss out on the sessions that they want to see. We wanted to mix up the session timings to let people participate at the best time to fit their schedules and energy levels. The schedule on day 2 is the same as on day 1, but in reverse."
        },
        {
            "text": "We’ve increased the number of people who can attend to 500 people this year, however we do recommend booking your tickets early to avoid disappointment."
        },
        {
            "heading": 2,
            "text": "Keynote slots"
        },
        {
            "text": "We’re fortunate to have Amy Hupe as our opening keynote speaker. She’s a design system and content design consultant. In the face of complexity, Amy regularly makes the case for simplicity and inclusion. We’re very excited to hear what she has to share in her talk ‘Building conscious design systems’. "
        },
        {
            "text": "For our closing feature slot, we’ve lined up a panel of accessibility experts to talk around  ‘inclusivity by design’. They’ll be discussing how to take accessibility in design systems to the next level."
        },
        {
            "text": "Overall we have an exciting line-up planned for the event with a few notable names, which we’ll announce in the coming weeks."
        },
        {
            "heading": 2,
            "text": "Who should come?"
        },
        {
            "text": "Design System Day is aimed at people who frequently use design systems and teams who build and manage design systems. We’ are interested to learn and hear about the challenges of working with a design system from both the public and private sectors as well as other international government design systems."
        },
        {
            "heading": 2,
            "text": "Join the conversation"
        },
        {
            "text": "If you have a challenge or something you want to share with like minded people and would like to facilitate a workshop or breakout session, you can contact the team. All facilitators are guaranteed a ticket to attend the conference."
        }
    ]
}