{
    "url": "https://prisonjobs.blog.gov.uk/2022/08/16/lets-talk-pqip/",
    "title": "Let's talk PQiP",
    "authors": [
        "Ministry of Justice"
    ],
    "categories": [
        "Personal stories",
        "PQiP",
        "Probation"
    ],
    "pub_date": "2022-08-16T16:40:18+01:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "What made you apply to become a probation officer? "
        },
        {
            "text": "Before starting the trainee probation officer programme (PQiP), I worked as a prison officer. I decided to apply to the programme as I wanted to be able to do more work with people on a one-to-one basis, to try and make a difference. I liked the variety of jobs available within the Probation Service, such as working in courts, prisons and the community. I also wanted a job which was more regular hours, rather than the shift pattern I was on as a prison officer."
        },
        {
            "text": "\nWhat did you enjoy most about the PQiP programme? "
        },
        {
            "text": "I enjoyed the PQiP study days where we met with our cohort. I found these days helpful as we would share our personal experience of the programme and discuss any questions we had. It was nice to feel part of a team, with people going through the same journey as you."
        },
        {
            "text": "\nWhat did you find most challenging? "
        },
        {
            "text": "I initially found balancing my time to be quite challenging. On Vocational Qualification (VQ)/university study days I would struggle to switch off from my PSO work and focus just on my studies. I found that I would often be contacted by the office on these days for issues with my caseload for recalls to custody. I then found myself doing a fair bit of work outside of work hours to ensure I could get all my university work completed and gather VQ evidence."
        },
        {
            "text": "\nWhat did you learn during the programme?  "
        },
        {
            "text": "Learning to work with everyone equally and how to manage my own unconscious bias was a big thing. I feel like this is something that I have continued to develop throughout my career since completing the programme."
        },
        {
            "text": " "
        },
        {
            "text": "What was the balance between training and practical experience? "
        },
        {
            "text": "There was a lot of practical experience, most of the PQiP programme is spent learning on the job I’d say. At least once a month we’d have some formal training, but most of the time I learnt through ‘doing’, which is how I learn best."
        },
        {
            "text": " "
        },
        {
            "text": "What support did you receive during the programme? "
        },
        {
            "text": "We had a PQiP senior probation officer (SPO) who would meet with us monthly, do all our countersigning for reports and provide supervision. This was helpful as the SPO would focus on us specifically as trainees, and would give detailed feedback on our work. We also had our practice tutor assessor, who was based in my office, so I could go to them with any queries at any point."
        },
        {
            "text": " "
        },
        {
            "text": "How have you used your life experiences as part of role since completing PQiP? "
        },
        {
            "text": "My time as a prison officer, before joining PQiP, helped me to better understand where some of the people on probation I work with are coming from when they talk about their experiences within the justice system."
        },
        {
            "text": " "
        },
        {
            "text": "What would you say to someone who is considering joining PQiP? Do you have any tips for the application process? "
        },
        {
            "text": "It is a very intense job, where you will see and hear of some difficult cases which may cause you to feel a variety of emotions. It’s important to be able to switch off and have a solid work-life balance. Time management and prioritisation of work is key, so focus on these skills in the application process. You need to be willing to learn and be adaptable, as we deal with change on a daily basis."
        },
        {
            "text": " "
        },
        {
            "text": "Interested and want to find out more?"
        },
        {
            "text": "If you want to work in an environment where you can positively change people’s lives, a career in probation could be right for you. We are currently recruiting in seven regions. Find out more and apply to become a trainee probation officer."
        }
    ]
}