{
    "url": "https://educationhub.blog.gov.uk/2022/08/16/looking-for-guidance-on-your-next-steps-after-exams-heres-some-advice-from-a-national-careers-service-adviser/",
    "title": "Looking for guidance on your next steps after exams? Here’s some advice from a National Careers Service adviser",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Careers",
        "Exams and qualifications"
    ],
    "pub_date": "2022-08-16T13:24:22+01:00",
    "content": [
        {
            "text": "Julie Taylor, National Careers Service careers adviser provides some important advice for students receiving their exam results this month. "
        },
        {
            "heading": 3,
            "text": "What should I do if I don’t get the grades I expected? "
        },
        {
            "text": "Whether you get the results you expect or not, keep in mind that it’s not always just about the grades, your next step might be to think about gaining useful experience that an employer or institution might be looking for."
        },
        {
            "text": "Use this time to think about what experience and skills you might need to achieve your goals, and if you need help to do this, try talking to a careers adviser at the National Careers Service."
        },
        {
            "text": "It is important to remember that, whatever your results, you have options and there is often more than one route into most careers."
        },
        {
            "text": "Many companies offer school leaver schemes, or you may be able to start as an apprentice or a graduate."
        },
        {
            "heading": 3,
            "text": "How can I be sure I am making the right choice for me and my future? "
        },
        {
            "text": "Your next step doesn’t mean it’s forever – most people would probably tell you their career has been anything but a straight line."
        },
        {
            "text": "Careers can take a variety of interesting turns and there could be all kinds of unexpected opportunities around the corner."
        },
        {
            "text": "Take comfort in the fact that whatever you choose to do next, you can change your mind, but it doesn’t hurt to understand all your options first."
        },
        {
            "heading": 3,
            "text": "I seem to be the only person in my friendship group who doesn’t have a clear career plan and I’m worried! "
        },
        {
            "text": "Don’t compare yourself to others – it can be tempting to judge yourself against your friends or choose similar options, but it’s so important to consider what’s right for you."
        },
        {
            "text": "Their unique talents are not your unique talents, which means what’s right for them may not be the right choice for you. Focus on your situation and research all of the options available, thinking about your own personal interests, and strengths and goals."
        },
        {
            "heading": 3,
            "text": "Who is best to talk to about my next steps? "
        },
        {
            "text": "Your friends and family can be fantastic sources of support to bounce ideas off, but it can also be useful to talk it through with an expert who is totally impartial."
        },
        {
            "text": "That’s where the National Careers Service comes in – it can seem like quite a daunting prospect to think and talk about your career goals, but we love talking to people and helping them make sense of their options."
        },
        {
            "text": "All of our friendly careers advisers are here to help you think about your future and help you make the decision that’s right for you."
        },
        {
            "heading": 3,
            "text": "Where can I go for more advice about what to do after exams? "
        },
        {
            "text": "Whatever your results, if you want to find out more about all your education and training options, as well as practical advice about your exam results, visit ‘Get the Jump’ Skills for Life content hub on the National Careers Service website."
        },
        {
            "text": "You can also speak to a professional careers adviser for free and impartial confidential information and advice via the webchat, or by calling the National Careers Service Exam Results Helpline on 0800 100 900, open weekdays 8am-8pm Sat 10am-5pm."
        }
    ]
}