{
    "url": "https://despatch.blog.gov.uk/2022/08/16/over-2500-adis-opt-for-engagement-call-before-their-standards-check/",
    "title": "Over 2,500 ADIs opt for engagement call before their standards check",
    "authors": [
        "David Collings"
    ],
    "categories": [
        "Driving instructors"
    ],
    "pub_date": "2022-08-16T14:34:53+01:00",
    "content": [
        {
            "text": "DVSA ADI examiners have already completed over 2,500 ADI engagement calls and I am delighted to hear that you have found the service so valuable."
        },
        {
            "text": "My name is David Collings, and I have recently taken responsibility for the team that delivers the ADI standards checks in DVSA.  I’m excited to support you to continue driving road safety forward through high standards of instruction – something I know we are all passionate about."
        },
        {
            "text": "I’ve been really encouraged by some of the feedback we’ve had, like that from Rifat Mahood who made the most of his call. He quickly began putting into practice some of the feedback and advice provided to him, here’s what he said:"
        },
        {
            "text": "“I’ve started applying the key points into my pupils’ driving skills before presenting for test. Last month I presented 11 pupils for test and 7 passed - including 2 pupils passing with just 2 minors. Thanks very much for all of your time and guidance.”"
        },
        {
            "text": "It’s heartening to hear that ADIs are able to identify measurable and positive improvements in their instructing. It makes offering the call worthwhile."
        },
        {
            "text": "What is the ADI engagement call? "
        },
        {
            "text": "The call is purely voluntary and gives you the chance to talk through your ADI Driving Test Data Report before you have your standards check."
        },
        {
            "text": "During the call, we’ll offer guidance and support to help you identify any areas for self-development. We can also point you in the right direction for professional help."
        },
        {
            "text": "It is available for all ADIs in Great Britain who are called to take a standards check and gives you the opportunity to make any improvements you may need. It’s:"
        },
        {
            "text": "You will receive an email summarising the conversation which will include useful links to support you."
        },
        {
            "text": "I’d like to take this opportunity to thank Laura Great Rex who, in the role before me, introduced the ADI engagement call. Laura and her team developed the call with ORDIT instructors and National Associations Strategic Partnership (NASP). It is designed to support your professional development."
        },
        {
            "text": "Laura explains more about the parameters and the data we are now using to help us to prioritise standards checks in her blog post."
        },
        {
            "text": "The data we use to prioritise standards checks "
        },
        {
            "text": "I know some of you have fed back to NASP that you have concerns about the data we use to prioritise who gets a standards check and how accurate it is. I am confident that DVSA data is as accurate as it can be, but we need your help to record it by ensuring:"
        },
        {
            "text": "Some of you may also be concerned how your data will be affected if you need to step in and take someone else’s pupil for a test as their result will go against your record."
        },
        {
            "text": "Overall, a couple of driving tests over a twelve month period will have minimal effect on your data.  You can look at options to assess if the pupil is ready for their test, for example:"
        },
        {
            "text": "How to get your ADI Driving Test Data Report and request a standards check"
        },
        {
            "text": "We want to support you in providing the best training for your pupils. We believe sharing your performance data with you will help."
        },
        {
            "text": "Some ADIs have asked whether we could send their data reports automatically on a regular basis. While we appreciate this is what some ADIs would like, others do not want their data to be sent to them without asking for it."
        },
        {
            "text": "We’re looking at how we can deliver the data in the future so that that ADIs will have more options, but in the meantime, we will continue to send data when requested. We will also provide the reports for the engagement calls."
        },
        {
            "text": "If you would like to see your ADI Driving Test Data Report, please request a copy using our new email address: ADIdatareport@dvsa.gov.uk. If you have recently requested a report using the old email address, we will have received your request and we will respond."
        },
        {
            "text": "When requesting a report, please provide your name, PRN, and the email address and phone number on your registered account."
        },
        {
            "text": "You can also request a standards check if you email: PADI@dvsa.gov.uk explaining why you wish to have one."
        },
        {
            "text": "Here’s why Catherine Fallon, valued her standards check experience so much:"
        },
        {
            "text": "“I was very impressed. As a new ADI, this was my first standards check so it was a great opportunity to communicate first-hand with a member of the DVSA team. Our conversation covered everything! What really sold it to me, was being given a contact number for any future advice I may need, which I’ve already used. The advice enabled me to research managing driving test nerves and gave me the confidence to take a previously nervous pupil to the actual standards check. "
        },
        {
            "text": "We monitor the performance of our Driving Examiners  "
        },
        {
            "text": "I’d like to reassure you that as well as working with the ADI Industry to assess the quality of your training through the standards check, we also work closely with our examiners to ensure they continue to test to the required high standards."
        },
        {
            "text": "We regularly check the quality and consistency of driving examiners, at least 4 times every year and more if needed. We use a range of techniques to do this, including coaching sessions and regular accompanied tests.  As part of our quality monitoring, we use several data sets to help us ensure consistency, including:"
        },
        {
            "text": "The data is used as part of the 3 monthly quality checks carried out by local driving test centre managers (LDTMs) with the driving examiners at their centres. These checks make sure examiners are maintaining the quality and standard of testing."
        },
        {
            "text": "We’ve recently introduced a new driver quality team that will primarily work with LDTMs to maintain the quality of testing at their driving test centre."
        },
        {
            "text": "We use some of these data sets to monitor test routes so we can review them if needed to maintain consistency of tests."
        },
        {
            "text": "We also encourage driving test candidates to complete customer satisfaction surveys to get feedback on the service they received. The results of these surveys and any trends they show are used to help us improve the candidates' experiences."
        }
    ]
}