{
    "url": "https://ipa.blog.gov.uk/2022/08/16/reflecting-on-the-career-transitions-into-project-delivery-beyond-whitehall-panel/",
    "title": "Reflecting on the Role Models panel",
    "authors": [
        "laurenvamplew"
    ],
    "categories": [
        "Infrastructure",
        "Project Delivery Profession"
    ],
    "pub_date": "2022-08-16T10:21:37+01:00",
    "content": [
        {
            "text": "As part of the ‘Role Models’ campaign, which aims to increase diversity at all grades in the Project Delivery Profession, the Infrastructure and Projects Authority recently hosted a panel discussion in Birmingham, ‘career transitions into project delivery beyond Whitehall’. "
        },
        {
            "text": "Above, (from left to right) Caroline Boughton (Director of Acquisition and Project Delivery, Ministry of Defence), Keren Locke (Deputy Director of Delivery, Strategy & Transformation, Home Office), Karina Singh (Director of Function, Profession & Standards, IPA) and Annie Wareham (Deputy Director of Portfolio Delivery, HM Land Registry) in Birmingham offices for the panel."
        },
        {
            "text": "The event focussed on developing careers through to the Senior Civil Service in the UK regions. Karina Singh, IPA’s Director of Function, Profession & Standards moderated the panel, made up of Annie Wareham, Deputy Director of Portfolio Delivery, HM Land Registry; Caroline Boughton, Director of Acquisition and Project Delivery, Ministry of Defence; and Keren Locke, Deputy Director of Delivery, Strategy & Transformation, Home Office."
        },
        {
            "text": "The panel discussed the ease of joining the project delivery profession from wider professions. Annie Wareham reflected on her 18 years in the Civil Service, starting in operational delivery and later moving into project delivery, she said: "
        },
        {
            "text": "“The project delivery world recognises that there are many transferable skills from other roles and welcomes people bringing them in. These skills can also be a starting point to lead to professionalisation.” "
        },
        {
            "text": "This “amazing strength” of the profession has made project delivery more accessible, despite people’s working and educational backgrounds. Annie also described her caring responsibilities, emphasising that it is “possible to have personal circumstances that require some flexibility and still enable you to enjoy a fulfilling career”. "
        },
        {
            "text": "Next, the panel discussed advice for those who were hoping to enter the profession. The panellists were in unanimous agreement that building your skillset and taking advantage of formal training and learning and development opportunities, can aid your entry into project delivery. "
        },
        {
            "text": "Caroline was passionate in describing how the “government is leading the way on setting standards and upskilling for successful project delivery.” Despite noting that some of her projects are complex and difficult, she believes “there are so many transferable skills which make good project managers”, stressing the importance of “ building strong relationships and being well organised”. Keren also added that the “drive towards professional accreditation” is key."
        },
        {
            "text": "The panel gave examples of things they have done over time to build successful careers in the regions, without relocating to London. With their homes in Northumberland, Bristol and Northampton, the panellists gave a real sense of confidence that they did not need to be based in Whitehall to have a fulfilling career. "
        },
        {
            "text": "Likewise, regardless of gender and caring responsibilities, working in project delivery is possible for all. Echoing these sentiments, Karina recalled, \"as someone who has worked my way up the Civil Service, working part-time, and who came into formal project delivery mid-way through my career, I am proud of the training, experience and opportunities the project delivery profession can offer everyone.\"  "
        },
        {
            "text": "Reflecting on the panel, Keren explained how “these types of inclusive events are a great starting point” and “it was great to be able to share my personal journey of how as a woman I have developed my career in project delivery outside of London”.  "
        },
        {
            "text": "The panel showed how we encourage everyone interested in project delivery to take the first step – there are so many opportunities out there at all levels and so many great people willing to help! "
        },
        {
            "text": "A special thanks to Karina, Keren, Caroline and Annie, for taking part."
        }
    ]
}