{
    "url": "https://cspl.blog.gov.uk/2022/08/16/standards-commission-for-scotland-importance-of-objectivity/",
    "title": "Standards Commission for Scotland: Importance of Objectivity",
    "authors": [
        "Standards Commission for Scotland"
    ],
    "categories": [
        "Ethical standards",
        "Nolan Principles"
    ],
    "pub_date": "2022-08-16T14:27:32+01:00",
    "content": [
        {
            "text": "The Standards Commission for Scotland is an independent public body, responsible for encouraging high standards of behaviour by local government councillors and those appointed to the boards of devolved public bodies. Its role is to strengthen ethical standards in public life; including promoting the Codes of Conduct and issuing guidance to councils and devolved public bodies; and to adjudicate on alleged breaches of the Codes of Conduct, and where a breach is found, to apply a sanction."
        },
        {
            "heading": 2,
            "text": "Importance of Objectivity"
        },
        {
            "text": "One of the key principles of public life, commonly known as the ‘Nolan Principles’, is objectivity. The key principle of objectivity obliges those in public life, including politicians, to make decisions solely on merit, impartially and without discrimination or bias."
        },
        {
            "text": "Local government councillors and members of devolved public bodies make decisions that affect all communities and everyone’s daily lives. These include decisions in respect of education, health service provision, roads and waste collection."
        },
        {
            "text": "The Councillors’ Code of Conduct and the Model Code of Conduct for Members of Devolved Public Bodies oblige councillors and members to act objectively when making decisions in an official capacity."
        },
        {
            "text": "Members of the public have a right to expect that such decisions will be made in their best interests and not the personal interests of a councillor or board member (or those of their friends of family). To have trust and confidence in local authorities and in devolved public bodies, the public need to be satisfied that decisions made by councillors and board members are being made objectively and solely on merit. This includes not just decisions in respect of services, but also ones relating to appointments, the awarding of contracts or recommending individuals for rewards and benefits. The need for holders of public office to act objectively is fundamental, especially at a time when levels of trust in elected representatives are eroding."
        },
        {
            "text": "The need for objectivity is especially important in relation to decisions made by councillors on quasi-judicial and regulatory matters. Quasi-judicial and regulatory matters include decisions on planning applications and applications for alcohol, betting and gaming premises, and taxi licences, which will often have a significant impact on not only the applicant and any objectors, but also on others in the local community."
        },
        {
            "text": "The Councillors’ Code states that councillors must not only ensure there is a proper and fair hearing of any application, but that they must avoid any impression of bias in the whole decision-making process. Councillors must not just act fairly, they must also be seen to be acting fairly. This means that they are not allowed to:"
        },
        {
            "text": "The importance of such decisions can often mean that both the decision and the decision-makers can be subject to close scrutiny. Decisions on quasi-judicial and regulatory matters can be open to legal challenge, which will have financial and reputational consequences for a local authority even if any court action is ultimately unsuccessful."
        },
        {
            "text": "It is therefore vital those in public life are not only objective but are also seen to be objective in their decision-making."
        }
    ]
}