{
    "url": "https://defradigital.blog.gov.uk/2022/08/16/why-working-flexibly-works-for-me-and-my-family/",
    "title": "Why working flexibly works for me and my family",
    "authors": [
        "Jo Irving"
    ],
    "categories": [
        "Smarter working"
    ],
    "pub_date": "2022-08-16T15:03:57+01:00",
    "content": [
        {
            "text": "Jo Irving shares her thoughts on how working flexibly and being a homeworker too has enabled her to balance a busy home and work life, one which has responsibilities that include fostering children."
        },
        {
            "text": "As someone who works flexibly, I’m already in the majority in the UK because over half of full-time employees currently work in this way and many more say they want to."
        },
        {
            "text": "Moreover, a survey from Acas last year found that half of employers in Great Britain expected an increase in demand for flexible forms of working from employees once the pandemic was over. I’m also a registered homeworker, more of that later."
        },
        {
            "text": "Flexible working isn’t always easily defined, nor is it equally important for everyone. For some employees, at various points in their working lives, flexible working becomes of much greater importance and value, possibly even essential to participating at all in paid employment."
        },
        {
            "text": "Flexible working helps me plan my home and work life to reduce stress on juggling being a mum and a foster carer – it gives me permission to manage my time to suit me and my role."
        },
        {
            "heading": 2,
            "text": "Increasing demand, changing attitudes"
        },
        {
            "text": "More and more people value work-life balance. Some 92% of people born between 1980 and 2000 identified flexibility as a top priority when job hunting. Employers are beginning to see the social and economic benefits of a more agile labour market too. Part-time and flexible working patterns are now considered to be key means of enabling businesses to increase productivity and efficiency and retain talent."
        },
        {
            "text": "With both employers and employees increasingly recognising the benefits of flexible working, it’s more important than ever to offer flexible working wherever possible and respond to requests positively and creatively."
        },
        {
            "text": "I feel Defra is very progressive in this regard. There are various flexible working options available for us. For example, blended working, different working hours or working patterns."
        },
        {
            "text": "Any Defra employee can request to work flexibly. All requests are considered, and reasonable effort made to accommodate the proposed change. The journey begins with an informal chat with your line manager in the first instance about any changes you’d like to make to where, when, or how often you work."
        },
        {
            "text": "The manager will bear in mind some key factors such as business need (e.g., if you physically need to be in the office to carry out your role) and will also consider the effect on your team colleagues. Your line manager will need to agree any new arrangements. Moreover, flexible working arrangements can be agreed on an informal or formal basis."
        },
        {
            "heading": 2,
            "text": "Flexible working makes good business sense"
        },
        {
            "text": "Flexible working is a key contributor to business success, though it can sometimes be categorised by human resource functions as a “family friendly” benefit."
        },
        {
            "text": "The business benefits are numerous. These include greater cost-effectiveness and efficiency, the ability to develop a higher level of skills because the business can attract and retain a skilled and more diverse workforce, reduced recruitment costs, more job satisfaction, better staff morale, and reduced levels of sickness absence. The list goes on."
        },
        {
            "text": "In my case Defra benefits because I can still be there to meet critical deadlines, even if I’ve taken a few hours off to go to a school assembly, or to have a meeting with the foster team. I will work the extra hours in the evening to ensure I meet my deadlines."
        },
        {
            "heading": 2,
            "text": "The benefits of flexible working to me"
        },
        {
            "text": "What might seem a small thing to some, can make a real difference to others like me. If the kids are ill, or I need to take them to a medical appointment, I can do a short day to be there for them, but make up the time across the week to ensure my work commitments don’t suffer."
        },
        {
            "text": "If there’s an emergency at home, my working arrangement helps reduce the stress and pressure of dealing with the emergency as I can take the time I need, and then make up the time when the situation is resolved."
        },
        {
            "text": "I can plan forward by building up my hours and completing my tasks to be able to take a day off work with the family, without always using annual leave."
        },
        {
            "text": "Also, I don’t need to take a day’s leave to school assemblies and sports days. These milestones are so important for children to feel supported. My mum worked full time, and there was no flexible working. So, she and I missed out on enjoying these school events together."
        },
        {
            "text": "And when my father was dying, I was able to work from my parents’ home to spend more time with him – the flexibility which gave me that extra time with him was so precious."
        },
        {
            "heading": 2,
            "text": "Working from home – no longer seen as the enemy"
        },
        {
            "text": "Since the Covid-19 pandemic, homeworking is no longer seen as a barrier to productive working. For many years, working from home was labelled as unproductive, difficult and for most organisations, unrealistic. Now, because of the coronavirus pandemic many more people are set up for working from home, and perceptions are changing."
        },
        {
            "text": "I’ve been a contractual homeworker since 2003. It has benefits and downsides. Benefits include no commuting and reducing my carbon footprint, plus having a quiet space to focus on complex issues or presentations. The downside includes making it harder to collaborate with colleagues or building professional relationships – tech is great, but it doesn’t replace working with colleagues in person."
        },
        {
            "text": "While some of the things I’ve listed here aren’t necessarily unique to me – many others have similar circumstances – the way I work is unique to me, and the fact that I can work this way is a strong reason for me continuing to be a civil servant."
        },
        {
            "text": " "
        }
    ]
}