{
    "url": "https://disabilityunit.blog.gov.uk/2022/08/16/why-access-is-key-succeeding-in-work-with-a-visual-impairment/",
    "title": "Why access is key: succeeding in work with a visual impairment",
    "authors": [
        "Paul Arnold",
        "Disability Unit"
    ],
    "categories": [
        "Raising Awareness"
    ],
    "pub_date": "2022-08-16T15:23:24+01:00",
    "content": [
        {
            "heading": 3,
            "text": "We hear from Paul Arnold, ICO Deputy Chief Executive and Chief Operating Officer, who shares his story of being a leader with a visual impairment. Paul is responsible for the strategy, leadership and performance of the Information Commissioner’s Office. He deputises for the Information Commissioner in their capacity as CEO and Accounting Officer."
        },
        {
            "text": "Developing my career as a visually impaired person has involved striving for equal access to opportunities in life and in the workplace. In many ways my story is pretty ordinary, but I’m all too aware that it isn’t yet ordinary for many people with visual or other impairments to hold senior roles like mine."
        },
        {
            "text": "As my career has developed I’ve tried to be a positive role model and reminder that there’s really no reason why people with disabilities shouldn’t hold senior or high-profile roles, and in fact, it’s really rather beneficial if we do!"
        },
        {
            "heading": 2,
            "text": "The challenge of silent assumptions"
        },
        {
            "text": "For people with a visible or apparent impairment it can be challenging to just be themselves at work. Just being yourself can often mean risking others silently assuming lots of unhelpful things about your capability, or perhaps thinking your accomplishments are ‘in spite’ of your apparent impairment."
        },
        {
            "text": "It’s often access to places, information or assistive technology which grabs the headlines in any debate about accessibility. But true accessibility must also mean accessing an equal chance in the minds and imaginations of others. And I don’t just mean an equal chance to fit in or achieve the average. I mean an equal chance to change the world, lead large organisations or anything else you put your mind to."
        },
        {
            "heading": 2,
            "text": "Where it all began"
        },
        {
            "text": "I was born completely blind in my left eye and partially sighted in the other. When I was about 8 years old the vision in my good eye also got worse leaving me with minimal sight. Although pretty scary and devastating at the time, I was lucky in many ways."
        },
        {
            "text": "Thanks to a brilliant family and some great teachers my poor eyesight never got in the way of me participating in anything as a child. Before joining the workplace, I was lucky enough to learn to live my life with minimal sight whilst in ‘mainstream’ education, through competitive sport and through university."
        },
        {
            "text": "After my first proper year in the workplace (which I like to call my ‘getting used to not being a student and needing to be awake before lunchtime’ phase), I wasn’t happy. When I reflect back now it was a combination of my own lack of confidence about whether my visual impairment actually was going to limit my career, and my employer being quite nervous to make sure I was receiving the support I needed. I didn’t feel in control of the narrative I and others were telling about me and I’d started to stop ‘just being myself’."
        },
        {
            "text": "Thanks to some deep self-reflection and a lot of determination, I was able to realise this and start to take much greater ownership for my own destiny. I wanted to make sure that whatever I did go on to achieve in my career I wasn’t going to be left blaming others or wondering what might have been."
        },
        {
            "heading": 2,
            "text": "Finding your superpowers"
        },
        {
            "text": "During my career I’ve come to really embrace what I call my superpowers as a visually impaired person. For example, I find that, because it is inefficient to rely on written materials or notes, I almost automatically retain lots of technical information in my head and call upon it pretty easily. Likewise, I developed a natural way of communicating verbally because I wasn’t able to rely on reading from scripts or referring to notes. I also find it hard to pick up on body language. Most leadership textbooks would have me believe this is a problem, but I find it means I pay absolute attention to the things people say and, perhaps more importantly, the things they are not saying. This often proves invaluable when coaching or mentoring, supporting my teams or cutting through to the root cause of a problem in a crisis."
        },
        {
            "text": "I eventually came to appreciate that not everyone is able to work like this and these were real strengths for me."
        },
        {
            "text": "These days I’m responsible for the leadership and performance of a large organisation with my actions and inactions being of significance to a wide range of colleagues and stakeholders. Some of the skills I rely on today when leading teams, operating in the Boardroom, working with complex technical reports or when speaking to large audiences, are still those I started to develop in the early days of my career."
        },
        {
            "text": "Paul Arnold at work"
        },
        {
            "heading": 2,
            "text": "Old dogs need to learn new tricks"
        },
        {
            "text": "But I like to think that my other superpower is my commitment to continuous learning and development, both my own and those around me. It’s common to talk about someone’s ‘ability’ to learn. But I believe it’s someone’s curiosity and desire to unlearn bad habits or to learn new skills which sets them apart from the crowd. I don’t think my ability to learn is anything special, but I think my desire to challenge myself and others to be curious to explore new approaches and ideas is greater than most. ​​"
        },
        {
            "text": "I hope to be just as radically improved again in another 24 years’ time. But that won’t happen if I wait for society to learn to stop limiting its expectations on those of us who might just need to work differently to most. But that’s not about blame."
        },
        {
            "heading": 2,
            "text": "So what’s next?"
        },
        {
            "text": "Whatever the next phase of my career holds, as I increasingly talk about the part my visual impairment plays in my work, I hope to contribute to the creation of an increasingly safe space for others to do the same. I’d also like to think that I can encourage and enable other senior leaders to really examine what it means to provide absolute equality of access to opportunities."
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}