{
    "url": "https://dluhcdigital.blog.gov.uk/2024/02/27/allocation-of-funding-for-council-led-initiatives-advancing-innovative-digital-planning-services/",
    "title": "DLUHC announces allocation of funding for council-led initiatives advancing innovative digital planning services",
    "authors": [
        "Digital Planning"
    ],
    "categories": [
        "Digital Planning",
        "Innovation",
        "PropTech"
    ],
    "pub_date": "2024-02-27T09:17:23+00:00",
    "content": [
        {
            "text": "The DLUHC Digital Planning Programme is supporting further Local Planning Authorities (LPAs) through the latest funding round for digital services to improve planning.  "
        },
        {
            "text": "The LPA work we’re funding aligns with our vision of enabling a modern and efficient planning system in England, shifting a documents-based system to one that is data-driven, standards-based and powered by modern user-centred products and services. "
        },
        {
            "text": "LPAs were able to submit applications to 2 funds: "
        },
        {
            "heading": 2,
            "text": "Digital Planning Improvement Fund:\nRound 2 "
        },
        {
            "text": "Building on work with councils last year, the Digital Planning Improvement Fund is providing 43 LPAs with £100,000 of funding to support the adoption of modern planning practices within planning data, digital capabilities and development management software. "
        },
        {
            "text": "The funding will support LPAs to take advantage of digital service improvements, prepare for forthcoming legislation and begin collaborating with other local authorities, technology providers and DLUHC on software and data projects. "
        },
        {
            "text": "The successful LPAs will embark on a 5-step process where they will complete the following activities:"
        },
        {
            "text": "The successful LPAs are: "
        },
        {
            "text": " You can find out more about the Open Digital Planning community through our dedicated website, our LinkedIn page, and subscribe to the regular newsletter for all news and updates. "
        },
        {
            "heading": 2,
            "text": " The PropTech Innovation Fund:\nRound 4 "
        },
        {
            "text": "The PropTech Innovation Fund is the largest UK Government PropTech programme and it has supported 65 pilots across 47 LPAs to work with industry at pace and scale to radically transform how communities engage in the planning system.  "
        },
        {
            "text": "Key achievements from Round 1 of the PropTech Innovation Fund included a 119% increase in citizen participation and 280 hours of planning officer time saved. Round 2 saw some projects achieving 3 times greater response levels compared with previous consultations, a 40% reduction in officer time, and a 342% increase in respondents under the age of 34.  "
        },
        {
            "text": "Both were successful in increasing the quality and quantity of responses, engaging with different demographics, and enabling resource savings for local authorities.  "
        },
        {
            "text": "The remit of Round 4 projects responds to increased industry demand to accelerate land assessment and viability alongside visualisation of citizen engagement and plan-making. "
        },
        {
            "text": "Round 4 will support 37 pilot projects across 49 LPAs that demonstrate the benefits of how digital solutions can be leveraged across land assessment (improving current approaches to identifying and evaluating sites, including viability and feasibility assessments, analysing small sites, or land assembly projects) as well as digital citizen engagement work on visualising planning proposals. "
        },
        {
            "text": "The pilots will cover a wide range of potential use cases from local plan-making, capacity and constraints modelling, strategic housing or economic land availability, biodiversity net gain, small sites and visualisation for citizen engagement. "
        },
        {
            "text": "We are delighted to announce that the following 49 councils have been awarded funding to deliver outcomes under the themes above: "
        }
    ]
}