{
    "url": "https://ofsi.blog.gov.uk/2024/02/27/an-update-on-ofsis-licensing-process-and-policies/",
    "title": "An update on OFSI's licensing process and policies",
    "authors": [
        "OFSI"
    ],
    "categories": [
        "Compliance",
        "Financial Sanctions",
        "Licensing"
    ],
    "pub_date": "2024-02-27T10:31:01+00:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "This blog provides further information on how the Office of Financial Sanctions Implementation (OFSI) makes licensing decisions. We outline both the process involved in obtaining a licence, from submitting an application to (if the licence is granted) receiving a final licence, as well as providing an update regarding the new Designated Individuals Licensing Principles which OFSI will apply in its decision-making relating to designated individuals."
        },
        {
            "text": " "
        },
        {
            "text": "OFSI licensing process"
        },
        {
            "text": "Getting a licence from OFSI follows a step-by-step process. Each step is crucial to thoroughly evaluate applications. This structured process does not just check the urgency and validity of applications but also seeks to ensure that the correct licensing decisions are made."
        },
        {
            "text": "Stage 1 - Initial assessment of application"
        },
        {
            "text": "When you submit a new licence application, or an application for amendment to an existing licence, it will be triaged by OFSI’s licensing team. Applications will be prioritised where there is a genuine and evidenced need, such as for humanitarian purposes or where there may be a risk to life."
        },
        {
            "text": "OFSI’s licensing team reviews each application to ensure it contains the essential information required. If the application is incomplete, then it will be returned to you with an explanation of the further information required. OFSI's blog on returning incomplete applications explains how we manage incomplete applications."
        },
        {
            "text": "If it appears from the initial assessment that all necessary information has been provided, then the application will be forwarded to a caseworker for a comprehensive review."
        },
        {
            "text": "Stage 2 – Gathering information"
        },
        {
            "text": "The caseworker will conduct a detailed review. They examine the application for any information that requires clarification or supplementation, which may involve contacting you. This phase depends on factors such as whether the information you have provided supports the licensing purpose under which you have applied and whether the caseworker has enough information to make a well-informed recommendation."
        },
        {
            "text": "Stage 3 – Assessing the application"
        },
        {
            "text": "Once the caseworker is satisfied that all essential details have been provided, they assess that application in line with the applicable sanctions regulations, taking account of any necessary legal advice obtained and any relevant guidance, to determine whether to recommend that a licence be granted."
        },
        {
            "text": "Stage 4 – Making a decision"
        },
        {
            "text": "The case is then sent for a decision, in line with OFSI’s Delegation Framework. At this stage, we may request additional information."
        },
        {
            "text": "Stage 5 – Outcome notification and (if application granted) licence issuance "
        },
        {
            "text": "After the outcome of your licence application has been determined, the caseworker informs you of the decision. If the decision is a rejection or partial rejection we will give reasons for the decision (see 6.12 of OFSI’s General Guidance for further information)."
        },
        {
            "text": "If issuing or amending a licence the caseworker will provide a draft copy to you. You will have a chance to review and provide confirmation of the accuracy of the draft. After this point (and unless there are any issues), the caseworker will then issue you with the final licence."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": "Designated Individuals Licensing Principles"
        },
        {
            "text": "OFSI has published a series of policy principles, which it applies to licence applications relating to designated individuals under all UK financial sanctions regimes."
        },
        {
            "text": "Information for applicants"
        },
        {
            "text": "The principles will assist applicants to understand how OFSI interprets certain licensing purposes, common to all regimes, in relation to designated individuals. For example, the principles help clarify OFSI’s view on what constitutes a basic need, or the kind of maintenance works that OFSI may license on a designated individual’s frozen assets. The principles will also help applicants to understand the circumstances under which OFSI may refuse to license certain activities, even where a licensing purpose is met."
        },
        {
            "text": "Where relevant, applicants should consider the principles carefully before making a licence application to OFSI. Although OFSI considers all licence applications on a case-by-case basis, applicants should expect a licence will not be issued if doing so would require OFSI to deviate from any of the principles."
        },
        {
            "text": "When completing an OFSI licence application form it will be helpful to make clear how your application meets these principles."
        },
        {
            "text": "If licensing the proposed activity would require OFSI to deviate from the principles, you should provide additional supporting information to explain why this would be justified by the specific circumstances of your case."
        },
        {
            "text": "The new guidance should be considered in addition to OFSI’s:"
        },
        {
            "text": "It is not intended to replace any part of the above guidance or any legislation."
        },
        {
            "text": "How OFSI will use the Principles"
        },
        {
            "text": "OFSI will use the principles to inform our decision-making. OFSI will keep them up-to-date and may amend them from time to time. If OFSI makes any substantive changes to the principles, we will issue updated guidance to inform applicants, and notify email subscribers."
        },
        {
            "text": " "
        }
    ]
}