{
    "url": "https://mhclgmedia.blog.gov.uk/2024/02/27/coverage-of-cma-report-on-uk-housebuilding/",
    "title": "Coverage of CMA report on UK housebuilding",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Housing"
    ],
    "pub_date": "2024-02-27T12:49:41+00:00",
    "content": [
        {
            "text": "There has been significant coverage of the publication of the Competition and Markets Authority’s final report on the UK housebuilding market study."
        },
        {
            "text": "The full-market study, supported by the Housing Secretary Michael Gove, was launched in February 2023 and the final report received significant coverage, with stories in The FT,  Guardian, BBC, Independent, Express, Evening Standard, This is Money, City Am, Bloomberg and Inside Housing among others."
        },
        {
            "text": "The report found that limitations of speculative private development, together with the planning system – which we have announced numerous measures on how we are driving improvements to the planning system – is responsible for the under delivery of new homes. The stories predominantly lead on the CMA announcing it has launched an investigation into eight house builders after it found evidence some developers may be sharing commercially sensitive information, which could influence house prices."
        },
        {
            "text": "Sarah Cardell, chief executive of the CMA, spoke on Monday morning’s Today programme on BBC Radio 4 about the report, stressing that the housing market “needs intervention”. She said there are issues with the quality of new builds and shortage of housing, adding that the CMA has set out a package of options for consideration, which includes better use of targets and locals plans. She also mentioned the investigation into house builders."
        },
        {
            "text": "The Department for Levelling Up, Housing and Communities has welcomed the publication of the CMA’s final report and will now carefully consider its findings."
        },
        {
            "text": "A Department for Levelling Up, Housing & Communities spokesperson said:  "
        },
        {
            "text": "“We welcome the CMA’s final report following its full market study into housebuilding and the report will now be carefully considered."
        },
        {
            "text": "“Despite the economic challenges we remain on track to build 1 million homes this Parliament, backed by £10 billion investment in housing supply, while our long-term plan for housing will allow us to go even further to build the homes that local communities want and need.”"
        },
        {
            "text": "The CMA study found substantial concerns about estate management charges – with homeowners often facing high and unclear charges for the management of facilities such as roads, drainage, and green spaces. Concerns were also raised about the quality of some new housing after the number of owners reporting snagging issues increased over the last decade."
        },
        {
            "text": "The CMA has announced that they won’t be launching a market investigation but will recommend actions for Government in some areas. These include:"
        },
        {
            "text": "The Government will provide a formal response to the report within 90 days."
        }
    ]
}