{
    "url": "https://hmlandregistry.blog.gov.uk/2024/02/27/proptech-company-searchland-goes-from-strength-to-strength/",
    "title": "PropTech company Searchland goes from strength to strength",
    "authors": [
        "Caroline Bray, HM Land Registry Geovation Stakeholder Manager"
    ],
    "categories": [
        "Data"
    ],
    "pub_date": "2024-02-27T16:30:50+00:00",
    "content": [
        {
            "text": "We recently recorded a podcast with Hugh Gibbs, co-founder of Searchland. "
        },
        {
            "text": "Searchland took part in the Geovation Accelerator Programme in 2021. The programme is co-sponsored by HM Land Registry and Ordnance Survey and supports start-ups in the geospatial and property sectors."
        },
        {
            "text": "Searchland is a PropTech (property technology) company that uses various datasets, including those from HM Land Registry, to provide a business-to-business platform for property developers, architects, planners, agents and others. Searchland’s platform enables users to access and manipulate information, such as HM Land Registry’s ownership, leases, transaction prices and company ownership data. This helps their customers to make informed decisions about property development opportunities. "
        },
        {
            "text": "Other users include renewable energy and utility companies. For example, solar panel providers using Searchland’s platform can easily investigate the best sites according to proximity to substations, planning permissions and so on. "
        },
        {
            "heading": 2,
            "text": "Fast-tracked by Geovation"
        },
        {
            "text": "Hugh explains the benefits of taking part in the Geovation Accelerator Programme and how it probably sped up Searchland’s development by a year. It fast-tracked their journey from an idea to a business, providing access to valuable courses, mentorship and a supportive community of fellow start-ups. "
        },
        {
            "text": "Since taking part in the Geovation Accelerator Programme, Searchland has gone from strength to strength. Hugh says a recent data integration with Rightmove means customers can immediately see whether or not a site is on the market, which gives them a competitive advantage in acquiring land for potential development."
        },
        {
            "text": "Searchland’s goal is to become a comprehensive Customer Relationship Management-like platform for the property industry. With continued growth and strategic partnerships, they are poised to make further advances in streamlining property development processes. "
        },
        {
            "text": "We welcome your comments about this blog in the comments below. Please note that we are unable to discuss individual cases through the comments section and would request that all such queries be directed to our Contact Us web form where you will receive a response as soon as possible."
        }
    ]
}