{
    "url": "https://stratcommand.blog.gov.uk/2024/02/27/second-place-for-rg-soldier-in-inter-services-bouldering-competition/",
    "title": "SECOND PLACE FOR RG SOLDIER IN INTER-SERVICES BOULDERING COMPETITION",
    "authors": [
        "abievans"
    ],
    "categories": [
        "Gibraltar",
        "Overseas Bases"
    ],
    "pub_date": "2024-02-27T12:19:21+00:00",
    "content": [
        {
            "text": "Royal Gibraltar Regiment’s Sergeant Alec Spooner recently returned to Gibraltar after claiming second place in the 2024 Inter-Services Bouldering competition in the United Kingdom."
        },
        {
            "text": "Sgt Alec Spooner's achievement of finishing second in the Masters category at the Inter-Services bouldering competition marks a significant milestone in his climbing career."
        },
        {
            "text": "The event, hosted at the Sheffield Climbing Works, brought together climbers from all three military services to compete for the prestigious Inter-Services title."
        },
        {
            "text": "Representing the Army team, Sgt Spooner showcased his prowess by securing not only an impressive 11th place overall in the elite category but also a commendable second place in the Masters category."
        },
        {
            "text": "His remarkable performance is even more impressive considering the demanding nature of competing in multiple categories within a single event."
        },
        {
            "text": "What makes Sgt Spooner's achievement even more remarkable is the context of his recent participation in the Armed Forces bouldering league. Just the day before the Inter-Services competition, he wrapped up the league's sixth round with a standout performance, breaking the 200-point barrier with a stellar score of 213 out of a possible 250 – a testament to his dedication and skill."
        },
        {
            "text": "The recognition of his talent and achievements has translated into tangible support, as Sgt Spooner has received funding from the Infantry climbing team. This support will undoubtedly aid him in acquiring new climbing equipment, further enhancing his ability to excel in future competitions ."
        },
        {
            "text": "Looking ahead, Sgt Spooner is eagerly anticipating his next challenge: the Inter-Corps event, where he will proudly represent the Infantry."
        },
        {
            "text": "With his recent successes under his belt and newfound support behind him, Sgt Spooner is poised to continue making waves in the climbing community and inspiring fellow climbers with his dedication and determination."
        }
    ]
}