{
    "url": "https://defrafarming.blog.gov.uk/2024/02/27/the-sfi-pilot-designing-the-improved-offer-with-farmers/",
    "title": "The SFI pilot: designing the improved offer with farmers ",
    "authors": [
        "Joseph Evans"
    ],
    "categories": [
        "Sustainable Farming Incentive pilot"
    ],
    "pub_date": "2024-02-27T12:48:28+00:00",
    "content": [
        {
            "text": "Since 2021, over 800 farmers in England have been testing an early version of the Sustainable Farming Incentive (SFI), delivering 10,000 actions on their land. "
        },
        {
            "text": "This piece of work, known as the Sustainable Farming Incentive pilot, will run until 2025. "
        },
        {
            "text": "The breadth of farm and land types in the pilot means we’ve been able to better understand the real-world impact of the scheme’s actions in different contexts. "
        },
        {
            "text": "There are over 80,000 hectares (ha) of soils, 45,000 ha of arable land, 16,000 ha of grassland, and 2,800 kilometres of hedgerows in the SFI pilot. "
        },
        {
            "text": "Pilot participants (I’ll just call them ‘farmers’ from here on) take part in our surveys, workshops, interviews and on-farm events. Their feedback, views and experiences are helping us to design a scheme that works for as many people as possible. "
        },
        {
            "text": "We recently published an update to the Agricultural Transition Plan, in which we shared the new and expanded SFI and Countryside Stewardship (CS) offer.  "
        },
        {
            "text": "In this post, I’ll explain how farmers in the pilot have helped us to shape the current and future offer. "
        },
        {
            "text": "I've also included a video which gives an overview of our work."
        },
        {
            "heading": 2,
            "text": "Making the schemes more flexible "
        },
        {
            "text": "Through testing, it became clear that our schemes need to be both attractive and flexible. "
        },
        {
            "text": "We previously grouped actions into standards. They were, in turn, grouped into levels. You had to complete all the actions in a level to get paid. "
        },
        {
            "text": "Farmers told us that bundling actions together into standards made the scheme less flexible, so we removed them last year. You can now pick from any of the actions that work for you. "
        },
        {
            "text": "We’ve also made other changes to make the scheme more flexible. "
        },
        {
            "text": "We further improved the application process and introduced a rolling application window so you can apply when it suits you. That said, we encourage you to look at the 23 actions currently on offer and apply now rather than waiting for the new actions to become available this summer.  "
        },
        {
            "text": "By waiting for the new actions, you could be losing out on funding. If you apply now, you will be able to add actions to your agreement annually or have multiple agreements when the further actions are available. Over 11,000 farmers have already applied for SFI. "
        },
        {
            "text": "Farmers in the pilot also helped us to make the dates by which some actions need to be established less prescriptive. Rotational actions have also been introduced. "
        },
        {
            "text": "We’ve also expanded the range of hedgerow management options and included a Hedgerow Condition Assessment (HRW1) action."
        },
        {
            "text": "There’s now a tool for you to check what SFI actions you can get paid to do on your land. "
        },
        {
            "heading": 2,
            "text": "Advice and support "
        },
        {
            "text": "Farmers in the pilot told us that with appropriate advice and support, farmers and land managers feel more confident, ambitious and better able to carry out the actions in their agreement. As we expand our offer this year, we will: "
        },
        {
            "heading": 2,
            "text": "Making delivery easier "
        },
        {
            "text": "We’ve learned a great deal from farmers about how scheme guidance needs to be clear and informative, without being too prescriptive, so they know what they need to do and how to do it.  "
        },
        {
            "text": "We have continued to develop guidance for the full SFI scheme, including The SFI Handbook and series of supplementary (and optional) how-to guides. The handbook can be downloaded or printed as a single document or viewed online."
        },
        {
            "text": "We’ve been much clearer about exactly what’s mandatory and what’s not, giving you much more clarity around about what’s expected of you."
        },
        {
            "heading": 2,
            "text": "Compliance "
        },
        {
            "text": "Through the SFI pilot, we’ve been able to put into practice our new pragmatic and trusting approach to monitoring and checking farmers are complying with their agreements.  "
        },
        {
            "text": "This has been received positively by the Rural Payments Agency’s (RPA) field officers and farmers in the pilot who have found site visits to be helpful and supportive.  "
        },
        {
            "text": "Our approach is to work with you when things go wrong and help you to put them right.  "
        },
        {
            "text": "We are continuing with this new approach as we roll out our expanded offer. "
        },
        {
            "heading": 2,
            "text": "Environmental impact "
        },
        {
            "text": "Farmers in the pilot are already reporting environmental changes on their land because of their actions. "
        },
        {
            "text": "They reported greater prevalence of tall vegetation, trees, flowers, and other habitats across their farmland, adding that they noticed these habitats support greater biodiversity than before, such as increases in insects, birds and small mammals.  "
        },
        {
            "text": "The pilot has shown these positive environmental changes are particularly significant where multiple actions are carried out on the same area. For example, a pilot farmer with buffer strips, scrub and tall vegetation in the same field recently said:"
        },
        {
            "text": "As part of our work, we’re carrying out an environmental impact evaluation. This includes field surveys of farms in the pilot to see how environmental conditions change and modelling to predict the long-term effects of the scheme.  "
        },
        {
            "text": "Early results suggest we can expect positive impacts in several areas, including carbon storage, air quality and water quality, as well as reductions in agricultural emissions like sediment, phosphorous and nitrate. "
        },
        {
            "heading": 2,
            "text": "Looking ahead  "
        },
        {
            "text": "As the pilot enters its third and final year, we'll continue to learn from our farmers, building on what they've told us so far. We’ll also be helping them to transition into the full scheme as they approach the end of their agreements. "
        },
        {
            "text": "This year we’re also planning on giving you the opportunity to come out on-farm and see how pilot farmers have been delivering their agreements and helping to shape the expanded offers. I'll keep you posted."
        },
        {
            "text": "If you’d like to know more about the SFI pilot, leave a comment. I’ll also include some links to pilot case studies in the grey box below."
        }
    ]
}