{
    "url": "https://environmentagency.blog.gov.uk/2024/02/27/waste-criminals-weve-got-you-in-our-sights/",
    "title": "Waste criminals – we’ve got you in our sights",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Environment Agency",
        "Waste"
    ],
    "pub_date": "2024-02-27T10:30:29+00:00",
    "content": [
        {
            "text": "By Joanna Larmour, deputy director of the Environment Agency’s National Enforcement Service"
        },
        {
            "text": "Waste crime has been going on for too long – and the Environment Agency is taking action. That’s why we’re committing more resources than ever to find, identify and prosecute these people."
        },
        {
            "text": "Our message is simple – if you are a waste crook, we are coming for you."
        },
        {
            "text": "Regulators, the police, government agencies and business all understand the threat from waste crime – that’s why we’re combining our powers to root out the perpetrators. We’re committing new resources to this fight and sharing more information than ever before – leading to dozens of prosecutions in 2023. Criminals should know that there’s no place to hide."
        },
        {
            "text": "This year we’ve launched a new Economic Crime Unit to tackle money laundering and carry out financial investigations in the waste sector, ensuring crime doesn’t pay. The two teams making up the unit will freeze accounts and seize cash from criminals, while also building up the long-term investigations which can send them down for up to 14 years. We’ve got the assets to catch you."
        },
        {
            "text": "We’re working with the police and the law to make sure that evidence of wrongdoing supports investigations and prosecutions. We use the Proceeds of Crime Act to recover illegally gained profits and, since April 2022, the EA has had access to the Police National Computer, Police National Database and National Automatic Number Plate Recognition Service. Our strong relationship with the police has given us the means to shut down waste criminals faster. The combined powers of the EA and the police are a force to be reckoned with."
        },
        {
            "text": "We have also taken on the fight to criminals with coordinated operations over the last year – such as Operation Lyceum, Operation Iris, and Operation Angola – collaborating with the police, HMRC, DVSA and others to monitor dubious waste sites, stop and check lorries, and seize stolen or hazardous cargoes. Joint operations across the country are delivering results already."
        },
        {
            "text": "We continue to build new ways of working with partners across Government to shut down waste criminals. For instance, customs export data is now shared regularly with us from our partner HMRC to help identify illegal waste exports. This data helps to give us a much better picture of what is being exported where and by who to increase our intelligence picture and help identify and target criminality. Close cooperation with other government departments means there’s nowhere to hide."
        },
        {
            "text": "We have also launched our Waste Shipment Intelligence Service in partnership with the Shipping Line Mediterranean Shipping Company (UK) Ltd. Through this project we’re working in partnership with the shipping industry to protect the environment from harm caused by illegal shipments of waste. Industry is sharing knowledge and resources with us to prevent known illegal waste exporters from using shipping lines to facilitate their crimes. Legitimate businesses are helping us to spot you too – they see which way the wind is blowing."
        },
        {
            "text": "All this is delivering results and ensuring that criminals face justice. In 2023, we brought forward 52 prosecutions for waste crimes, and secured more than £400,000 in fines. On top of that we inspected nearly 1,100 locations of reported waste crime activity and closed down 585 illegal waste sites. But we’re not complacent – and we won’t stop shutting down waste criminals."
        }
    ]
}