{
    "url": "https://ruralpayments.blog.gov.uk/2025/05/23/the-management-of-hedgerows-england-regulations-2024-one-year-on/",
    "title": "The Management of Hedgerows (England) Regulations 2024: One year on",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Hedgerows"
    ],
    "pub_date": "2025-05-23T17:49:34+01:00",
    "content": [
        {
            "text": "The regulations to strengthen the protection of hedgerows came into force on 23 May 2024.  The rules now protect all hedgerows on or next to agricultural land in England.  "
        },
        {
            "text": "In this blog we reflect on how we’ve supported people to follow the rules this year. We recap on the guidance, videos and podcast we’ve created to help customers, and we pick out some of the frequently asked questions to try and answer your queries."
        },
        {
            "text": "Firstly, here’s a reminder of the rules."
        },
        {
            "text": "What have we done since the rules came into force?"
        },
        {
            "text": "Frequently Asked Questions"
        },
        {
            "text": "These are some of the frequently asked questions we’ve responded to this year."
        },
        {
            "text": "Are domestic hedgerows covered by the rules?"
        },
        {
            "text": "We’ve received a number of reports of cutting and trimming of domestic hedgerows. The cutting and trimming rules do not apply to hedgerows within the area of land around a domestic dwelling or to hedgerows that mark the boundary of the dwelling."
        },
        {
            "text": "The rules only cover hedgerows on, or next to, agricultural land. This could include hedgerows which are on agricultural land but form the boundary between other areas such as golf courses and village halls. The cutting and trimming rules also apply to hedgerows bordering allotments."
        },
        {
            "text": "Who do the rules apply to?"
        },
        {
            "text": "Farmers, landowners and contractors are the largest groups affected by these regulations. However, it is important to note that the rules could apply to any person responsible for the hedgerow. This includes owners and tenants, and anyone employed by or acting on behalf of those responsible.    "
        },
        {
            "text": "The cutting and trimming rules apply to the person who actually carries out the cutting and trimming. This means they apply to contractors who carry out such cutting and trimming. They can also apply to any person who causes or permits another person to cut or trim."
        },
        {
            "text": "Reporting possible breach of the rules"
        },
        {
            "text": "Anyone can report a possible breach of the hedgerow management rules to RPA. Details of how to do this can be found on the Hedgerow management rules: cutting and trimming  and Hedgerow management rules: buffer strips GOV.UK guidance pages. It is important to be aware that there are some exemptions to these rules which allow for cutting and trimming during the non-cutting period. These are set out on the Hedgerow management rules: cutting and trimming guidance. Please read these carefully before reporting a possible breach of the rules. For example, there is a public and private rights of way exemption that allows hedgerows to be cut or trimmed for road safety purposes."
        },
        {
            "text": "Removal of hedgerows dealt with by Local Authorities"
        },
        {
            "text": "We've also received a number of reports about the removal of hedgerows. The hedgerow management rules only cover cutting and trimming and buffer strips. They do not cover the removal of hedgerows which remains the responsibility of Local Authorities. For more information read the Countryside hedgerow protection: removing hedgerows - GOV.UK guidance.  "
        },
        {
            "text": "Derogations and agri-environment schemes (for example Sustainable Farming Incentive and Countryside Stewardship)"
        },
        {
            "text": "You can apply to RPA for written permission (a derogation) to be exempt from the rules for any of the following reasons:"
        },
        {
            "text": "Before applying for any derogation, consider the impact it may have on any agri-environment agreements you have. For example, if have you chosen the ‘Manage hedgerows’ action CHRW2 under the Sustainable Farming Incentive (SFI) scheme. This action permits hedgerow cutting or trimming in autumn and winter only. Would a derogation from the hedgerow management cutting and trimming rules impact on your ability to meet your obligations under this chosen action?  If so, please contact RPA to discuss your options before you request a derogation."
        },
        {
            "text": "Notifications for oilseed rape and temporary grass"
        },
        {
            "text": "Under Cross compliance which ended on 31 December 2023, farmers and land managers had to request a derogation to cut or trim their hedgerows in August to plant oilseed rape or temporary grass during that same August. They then had to wait for RPA’s written permission to do so. "
        },
        {
            "text": "We have introduced a simple notification process for the hedgerow management rules. You do not need to wait for written permission before carrying out cutting or trimming before sowing oilseed rape or temporary grass. As long as you meet the rules, you only need to make sure your notification is received by the RPA. Make sure you receive an acknowledgement of your notification from RPA before carrying out any work. For email notifications this will be the automated RPA acknowledgement. "
        },
        {
            "text": "You can find details of the notification process in the Hedgerow management rules: cutting and trimming and Hedgerow management rules: buffer strips guidance pages on GOV.UK. When you email your notification, please use the subject header 'Hedgerow management cutting and trimming rules notification’."
        },
        {
            "text": "Where can I find more information on the hedgerow management rules?"
        },
        {
            "text": "You can find more information about the rules, when exemptions apply and what you need to do on GOV.UK."
        },
        {
            "text": "Hedgerow management rules: cutting and trimming - GOV.UK"
        },
        {
            "text": "Hedgerow management rules: buffer strips - GOV.UK"
        }
    ]
}