{
    "url": "https://educationhub.blog.gov.uk/2023/04/10/what-are-reasonable-adjustments-and-how-do-they-help-disabled-pupils-at-school/",
    "title": "What are reasonable adjustments and how do they help disabled pupils at school?",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Equalities",
        "Schools",
        "SEND"
    ],
    "pub_date": "2023-04-10T14:27:22+01:00",
    "content": [
        {
            "text": "All pupils should be helped to fulfil their potential. Reasonable adjustments can help level the playing field by minimising the disadvantages that pupils with disabilities might face compared with their peers."
        },
        {
            "text": "Here’s everything you everything you need to know about reasonable adjustments and how they can help disabled pupils in schools."
        },
        {
            "heading": 3,
            "text": "What are reasonable adjustments?"
        },
        {
            "text": "Reasonable adjustments are changes that organisations and people providing services must make if someone’s physical or mental disability puts them at a disadvantage compared with others who aren’t disabled."
        },
        {
            "text": "This is separate to requirements related to physical changes that make a building accessible, such as disabled toilets."
        },
        {
            "text": "It means schools have a legal obligation under the Equality Act to support pupils who are disabled with reasonable adjustments, making sure they can benefit from what the school offers in the same way as a pupil who isn’t disabled."
        },
        {
            "text": "A school must not discriminate against a disabled pupil because of something that is a consequence of their disability."
        },
        {
            "text": "For example, preventing a disabled pupil on crutches from going out at break time because it would take too long to get out and back would be considered discriminatory."
        },
        {
            "text": "Schools should think about how all aspects of the school day could be adjusted to meet the needs of the disabled child, including attendance and behaviour, so that everyone is set high expectations and feels they belong in the school community."
        },
        {
            "heading": 3,
            "text": "What are some examples of reasonable adjustments?"
        },
        {
            "text": "Treating disabled pupils equally might mean doing things differently for them. Here are just some of ways schools can prevent disabled pupils facing disadvantage. For example:"
        },
        {
            "heading": 3,
            "text": "How to work with your child’s school to make reasonable adjustments"
        },
        {
            "text": "Schools are legally obliged to work with the pupil, their family and any other professionals involved, to agree to the necessary support."
        },
        {
            "text": "It is then the responsibility of the school to make a record of what reasonable adjustments have been agreed and ensure that all staff who work with your child are aware."
        },
        {
            "text": "It’s recommended that the reasonable adjustments are regularly reviewed to make sure that they’re effectively helping your child while at school. The support should be adjusted if your child’s needs have changed."
        },
        {
            "text": "For children on the school Special Education Needs (SEN) register, these reviews will take place as part of the regular SEN reviews and will be recorded as usual.  "
        },
        {
            "heading": 3,
            "text": "Can parents ask for adjustments to be made for children who aren’t disabled?"
        },
        {
            "text": "Schools aren’t legally obliged to provide reasonable adjustments for children who aren’t disabled, but many will work to provide similar support where needed."
        },
        {
            "text": "For example, a pupil who experiences anxiety may find it helpful to adjust what time they arrive at school."
        },
        {
            "text": "Working with pupils to make these adjustments can increase attendance and improve behaviour."
        },
        {
            "text": "Schools should consider this approach in these circumstances."
        }
    ]
}