{
    "url": "https://deframedia.blog.gov.uk/2021/09/06/9-million-fund-opens-for-local-projects-to-tackle-air-pollution/",
    "title": "£9 million fund opens for local projects to tackle air pollution",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2021-09-06T12:15:25+01:00",
    "content": [
        {
            "text": "There has been positive media coverage in the Daily Express, Yorkshire Post and Business Green about the launch of the Air Quality Grant scheme, which has received a £7 million funding boost this year for local projects to improve air quality."
        },
        {
            "text": "The annual government grant helps councils develop and implement measures to benefit schools, businesses and communities and reduce the impact of polluted air on people’s health. At least £1 million of the £9 million available this year will be dedicated to projects to improve public awareness in local communities about the risks of air pollution following a recommendation in the Coroner’s Prevention of Future Deaths report after the tragic death of Ella Kissi-Debrah in 2013. Local authorities can also bid for a portion of the fund for a wide range of other projects to create cleaner and healthier environments."
        },
        {
            "text": "The criteria for this year’s grant period will prioritise three areas:"
        },
        {
            "text": "Since it was established, the Air Quality Grant scheme has awarded almost £70 million to a variety of projects, including a digital education package to teach children and parents about the health impacts of particulate matter and nitrogen dioxide, the development of a community website to share air quality information and raise awareness with local residents and visitors, and a project to highlight the air quality issues that surround domestic burning."
        },
        {
            "text": "The projects funded by the grant scheme have contributed to the significant improvement in air quality seen in the UK in recent decades. Since 2010, levels of fine particulate matter (PM2.5) – particles or liquid droplets in the air which present the greatest risk to public health – have reduced by 11% while emissions of nitrogen oxides have fallen by 32% and are at their lowest level since records began."
        },
        {
            "text": "Environment Minister Rebecca Pow said:"
        },
        {
            "text": "Further details on how to apply are available on the Air Quality Grants GOV.UK page."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}