{
    "url": "https://ukhsa.blog.gov.uk/2021/09/06/blood-pressure-are-your-pipes-in-good-working-order/",
    "title": "Blood pressure: Are your pipes in good working order?",
    "authors": [
        "Katherine Thompson",
        "Hannah Sullivan"
    ],
    "categories": [
        "Health and Wellbeing",
        "NHS",
        "Reducing preventable deaths"
    ],
    "pub_date": "2021-09-06T11:44:42+01:00",
    "content": [
        {
            "text": "High blood pressure (or hypertension) is often known as a ‘silent killer’ because most people show no symptoms. If left untreated it can increase the risk of heart attack, heart disease, stroke and kidney disease. Recent evidence shows that it has been linked to more than 8.5 million deaths world-wide and that rates have doubled to 1.2 billion globally over the past 30 years."
        },
        {
            "text": "High blood pressure affects more than 1 in 4 adults in England. It disproportionately affects people from the most deprived areas who are 30% more likely to have high blood pressure than people from more affluent areas."
        },
        {
            "text": "More than 4.3 million people in England with high blood pressure go undiagnosed and untreated. Of those who are diagnosed, about half are optimally treated in line with NICE guidance. This places a considerable burden on the NHS, costing an estimated £2 billion every year."
        },
        {
            "text": "High blood pressure is also associated with 2.6 times higher odds of severe COVID-19 and 2.5 times higher odds of mortality from COVID-19. High blood pressure is preventable, and for those with high blood pressure a reduction of just 10mmHg can significantly reduce their risk of a heart attack or stroke. This means identifying, diagnosing and managing hypertension is more vital now than ever."
        },
        {
            "text": "The 10-year CVD prevention national ambitions and the NHS Long Term Plan set out a strategic commitment to improve detection and optimise the treatment of three high impact conditions – Atrial Fibrillation, High Blood Pressure and Cholesterol. Doing so offers the potential to prevent 150,000 heart attack and strokes over the next 10 years."
        },
        {
            "text": "The NHS Health Check programme continues to provide a systematic opportunity across England to detect and manage high blood pressure. NHS England and Improvement’s BP@Home initiative, the recently announced free blood pressure tests in pharmacies, and the focus on blood pressure assessments in the Primary Care Network (PCN) planning guidance, are helping to move us a step closer to improved rates of detection and management that other countries such as Canada have shown are achievable."
        },
        {
            "text": "This year marks the 21st anniversary of Know Your Numbers week (6 -12 September), a campaign led by Blood Pressure UK which encourages people to take control of their own blood pressure. This campaign aims to reach out to those at risk so they can get the treatment and support they need."
        },
        {
            "text": "We can all take steps to look after ourselves and others, and help reduce the burden high blood pressure places on the NHS and social care by:"
        },
        {
            "text": "Health care professionals can help by:"
        },
        {
            "text": "Further information on Know Your Numbers week can be found on the Blood Pressure UK website. Please show your support by sharing messaging amongst your networks and on social media."
        }
    ]
}