{
    "url": "https://defradigital.blog.gov.uk/2021/09/06/building-a-team-to-design-defra-services/",
    "title": "Building a team to design Defra services",
    "authors": [
        "Cathy Dutton, Head of Design"
    ],
    "categories": [
        "Defra digital",
        "Defra interaction",
        "Defra services",
        "Digital transformation",
        "User centred design"
    ],
    "pub_date": "2021-09-06T09:50:12+01:00",
    "content": [
        {
            "text": "“If your business was making chairs, you’d hire a furniture designer - government needs service designers to design services.” "
        },
        {
            "text": "Simple right? Well not quite, if there’s one thing I've learned in the last year it’s that hiring good service designers is hard. Secondly, we need to get the people we do hire into the right spaces, and the whole organisation needs to be on board for things to really work."
        },
        {
            "heading": 2,
            "text": "What makes a good service designer?"
        },
        {
            "text": "Before we go there, let’s start with ‘What is service design?’. One of my favourite service design definitions is:"
        },
        {
            "text": "“The majority of products that we encounter are actually part of a larger service network. In some cases, those touchpoints have been designed. But in many cases, they have just happened organically, with no thought for the whole picture. That’s where service design comes in.” Andy Polaine, Lavrans Løvlie, and Ben Reason - 'Service Design: From Insight to Implementation'."
        },
        {
            "text": "Service designers create the touchpoints, interactions, or building blocks that make a service. In government, greenfield work is rare so it’s more likely they will work on existing services to help connect discrete products delivering a joined-up service, providing cost efficiencies, and increasing the effectiveness with which end-user benefits are delivered."
        },
        {
            "text": "Service designers can come from a variety of different educational and professional backgrounds including analysis, design, delivery, research, user experience, architecture, psychology, and anthropology to name a few."
        },
        {
            "text": "Already having a service design job title is not important, what is important is that you enjoy solving problems, you are comfortable dealing with uncertainty, and have the drive to deliver the best possible outcomes for users."
        },
        {
            "heading": 2,
            "text": "Service design roles at Defra"
        },
        {
            "text": "We’re hiring a Senior Service Designer right now. If you want to work on things that result in improved recycling, a circular economy, and reduced single-use plastics then please apply. Take this widely shared advice from Janet Hughes, one of Defra’s Programme Directors, when tweeting about other Defra roles:"
        },
        {
            "text": "“If you know deep down that you are in fact qualified to do these roles, but are reading any of the application packs and are not sure if you meet the criteria, then I implore you: send your imposter syndrome to sit outside and think about its behaviour. We'd love you to apply.”"
        },
        {
            "text": "I stole that quote from Jeni Street’s excellent post about applying for content design roles at Defra. Jeni’s post is packed full of great advice on how to apply for content and service design roles. Particularly on how to tailor your experience gained in any number of roles to suit the points listed under skills and experience."
        },
        {
            "heading": 2,
            "text": "Creating space for service design at Defra"
        },
        {
            "text": "I wrote about creating a space for service design a few months ago. In particular moving the role away from typical discovery, alpha, beta phases, and product delivery teams where there can be a lot of overlap with other roles."
        },
        {
            "text": "I shared a definition of service design that we are starting to use in Defra."
        },
        {
            "text": "We’ve been working on getting service designers into these spaces, particularly in our Flood, Farming, and Trade portfolios, where we now have contract Service Designers working across full programmes of work. Here they can start to visualise the full service as a user would understand it, create a service vision to work towards, and begin to influence where product teams focus their efforts."
        },
        {
            "text": "In flood, this has resulted in a new team, set up to work on problems that span existing product teams and align to the strategic aims of the Environment Agency. Working across a whole programme of delivery is a huge task but one that presents exciting service design challenges to get stuck into."
        },
        {
            "text": "We will be transitioning these contract roles into permanent civil service ‘Programmes Service Designers’ very soon starting with our Future Farming Programme."
        },
        {
            "heading": 2,
            "text": "Service design is a team sport"
        },
        {
            "text": "Hiring Senior and Programme Service Designers is one thing, but as Tero points out in his brilliant article 'It takes a village to design a service' once we have the right people in the right spaces we need the support of others to really make things happen."
        },
        {
            "text": "This is why we are starting with our farming programme which is committed to taking a whole service approach to delivery."
        },
        {
            "text": "“Our work on the Future Farming and Countryside Programme presents a unique opportunity for anyone interested in service design in public services. Not only are we delivering complex services at scale, you will also have the opportunity to shape policy decisions and design greenfield services that have a very real impact on the lives of our users. We are also truly committed to user centred design, shaping and co-designing services based on the needs of our .” Rohan Gye, Future Farming and Countryside Programme."
        },
        {
            "text": "Upcoming design roles:"
        },
        {
            "text": "We’ll also be recruiting for Junior Designers, Programme Service Designers, Programme Heads of Design and Design Managers in the next few months. Keep checking back here."
        }
    ]
}