{
    "url": "https://deframedia.blog.gov.uk/2021/09/06/cpre-report-on-hedgerows/",
    "title": "CPRE report on hedgerows",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2021-09-06T13:23:39+01:00",
    "content": [
        {
            "text": "There has been widespread media coverage today (Monday 6 September) of the countryside charity CPRE’s report on hedgerows including in the Daily Telegraph, the Independent, Daily Express, Daily Mirror and Daily Star. The news also featured on BBC radio bulletins and regionally in the Yorkshire Post and Western Daily Press."
        },
        {
            "text": "CPRE’s research highlights the benefits of hedgerows for wildlife habitats and the wider economy. The charity are calling on the Government to increase the number of hedgerows by 40% by 2050 which their research claims would create 25,000 jobs in the UK."
        },
        {
            "text": "The Telegraph ran an opinion piece by the Defra Secretary of State on the importance of hedgerows as a crucial ecological building block of farmland. The piece welcomes today’s CPRE report highlighting the benefits of hedgerows and their role to improve air quality, store carbon and benefit rural economy. Wider coverage also carries a statement from Tony Juniper, the Chair of Natural England, outlining that we have a great opportunity to transform the countryside to increase the amount of hedgerows, and that we are working to ensure the new farming policy makes a real difference."
        },
        {
            "text": "Tony Juniper, Chair of Natural England, said:"
        },
        {
            "text": "A Defra spokesperson said:"
        },
        {
            "text": "The Environment Secretary delivered a speech at the NFU Conference 2021 in which he further set out his approach for future agriculture policy."
        },
        {
            "text": "Hedgerows are important environmental and landscape features that, managed well, provide essential habitats and food for wildlife, as well as providing carbon sequestration and other benefits."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}