{
    "url": "https://insidehmcts.blog.gov.uk/2021/09/06/how-the-courts-help-tackle-knife-crime/",
    "title": "How the courts help tackle knife crime",
    "authors": [
        "Jasmine Norton"
    ],
    "categories": [
        "Court and tribunal reform",
        "Crime"
    ],
    "pub_date": "2021-09-06T10:42:17+01:00",
    "content": [
        {
            "text": "When the Offensive Weapons Act 2019 introduced Knife Crime Prevention Orders to divert people away from knife crime, the courts were called upon to play a pivotal role in their delivery."
        },
        {
            "text": "Knife crime and other crimes involving sharp instruments have increased significantly since 2013. The Offensive Weapons Act was introduced in 2019 to deal with the misuse of firearms and corrosive products, and also includes provisions to help to tackle knife crime."
        },
        {
            "text": "The Act introduced Knife Crime Prevention Orders (KCPOs) – a new type of order designed to divert people away from being involved in knife crime. The police can use the orders to work with people including children over the age of 12, who may be carrying knives, or who are at risk of being drawn into serious violence."
        },
        {
            "text": "After a delay due to the pandemic, a 14-month pilot of KCPOs is now underway and is being led by the Metropolitan Police Service. The pilot will be evaluated before a decision is made on whether there should be a full roll out to all police forces."
        },
        {
            "text": "The background"
        },
        {
            "text": "So where do the courts fit in? Well, the police can apply to the courts for an order in the magistrates’ courts if they have reason to believe that a person is carrying knives. In these cases, the order is to protect the public or particular people from the risk of harm or to stop the defendant from committing an offence involving a bladed item."
        },
        {
            "text": "Alternatively, if the prosecution applies, an order can be made in the Crown or magistrates’ court, for a person over the age of 12 convicted of an offence involving violence, using or possessing a bladed article."
        },
        {
            "text": "The order can include curfews and restrictions on someone’s use of social media, travelling outside particular areas, as well as specifically banning them from carrying a knife."
        },
        {
            "text": "Courts can also impose positive interventions, such as educational courses, sports club referrals, relationship counselling, anger management, mentoring and drug rehabilitation."
        },
        {
            "text": "So for KCPOs to work successfully, you can see that it was essential for the courts to be ready as a central part of the justice system. This is where our team - the crime development team at HMCTS – played a really important part."
        },
        {
            "text": "Preparing the courts"
        },
        {
            "text": "We were part of a pilot board led by the Home Office alongside other justice partners, police representatives and MoJ youth justice colleagues. The team quickly gelled with counterparts, as a phase of investigation, discovery and preparation got underway. As the subject matter experts on the courts, we played an important role in contributing to statutory guidance, using our experience and understanding of court operations and processes to make sure that the requirements of the courts were understood and taken into consideration."
        },
        {
            "text": "Away from this, we also got hands on in giving direction to the preparation of the courts themselves, making sure they were ready for implementation, and addressing a range of challenges presented by orders involving both the civil and criminal jurisdictions of the criminal courts."
        },
        {
            "text": "Much of this work was captured and developed into guidance to support our own HMCTS staff, featuring process maps to cut through the complexity of the legislation and help them to understand and gain confidence in how to navigate KCPO applications through the system."
        },
        {
            "text": "Esperanza Gomez, a Home Office representative on the pilot board, commented on our critical role:"
        },
        {
            "text": "“In the long term, we expect that KCPOs will steer people at risk away from violent crime. They provide the courts with the ability to include positive interventions, and other requirements or prohibitions, in the order itself, so HMCTS involvement in the planning stages has been essential to successfully implementing these new orders."
        },
        {
            "text": "“KCPOs are an important tool within a wider, partnership approach to managing the risk of knife crime. The availability and range of interventions – which varies between local areas – are all essential to the success of the orders.”"
        },
        {
            "text": "Future plans "
        },
        {
            "text": "Thanks to the efforts of the team, processes are now in place to ensure all courts stand ready to accommodate national rollout, depending on the outcome of the London pilot."
        },
        {
            "text": "I’d like to thank all our staff and judicial colleagues for the hard work, adaptability and supportiveness that they have shown during the London pilot to get us to this point."
        }
    ]
}