{
    "url": "https://educationhub.blog.gov.uk/2021/09/i-am-truly-grateful-for-all-the-outstanding-work-you-have-done-education-secretary-gavin-williamsons-letter-to-teachers-as-pupils-go-back-to-school/",
    "title": "\"I am truly grateful for all the outstanding work you have done\": Education Secretary Gavin Williamson's letter to teachers as pupils go back to school",
    "authors": [
        "Media Officer"
    ],
    "categories": [
        "Coronavirus"
    ],
    "pub_date": "2021-09-06T16:33:01+01:00",
    "content": [
        {
            "text": "Education Secretary Gavin Williamson has written to teachers, leaders and other school staff all over the country to thank them for all their efforts over the last 18 months and to look ahead to a new academic year that brings a greater sense of normality. "
        },
        {
            "text": "Dear colleagues,"
        },
        {
            "text": "I know the return to educational settings this September is a significant moment for children, young people and education staff who have all shown enormous resilience over the past 18 months. Once again, I would like to thank you for your incredible efforts throughout the pandemic to provide the very best face-to-face and remote education for children, pupils and students."
        },
        {
            "text": "As we move into the autumn, we need to strike a balance between protecting public health and getting used to living with COVID-19 so that our children can continue with their lives and education in the best possible way. Evidence continues to suggest that cases in education and childcare settings reflect community transmission, including social contact between children and families, and that overall children and young people are much less susceptible to severe clinical disease. We also know that missed education has significant impacts for children, young people and adults."
        },
        {
            "text": "Testing continues to be crucial to help break chains of transmission. Following the summer holidays, all secondary and college students should take their first two tests at an Asymptomatic Test Site (ATS) before continuing twice weekly testing at home."
        },
        {
            "text": "Students attending Higher Education settings should test before they travel. On arrival at university, students should take two tests using home test kits or at an on-site testing facility."
        },
        {
            "text": "I appreciate the tremendous effort you have put into supporting your students to test regularly and I want to thank all of you who have supported the process."
        },
        {
            "text": "As you will be aware all adults and 12- to 17-year-olds with specific underlying health conditions, or who live with individuals who are immunosuppressed, are eligible for 2 doses of the COVID-19 vaccine. All other 16- and 17-year-olds are also eligible for a first dose of the COVID-19 vaccine. It has also been recently announced that people over 12 who were severely immunosuppressed at the time of their first or second dose should be offered a third dose."
        },
        {
            "text": "I am encouraged to see that many of the eligible young people have already taken up the offer to be vaccinated. Vaccines are the best way to protect people from COVID-19 and have saved thousands of lives. Vaccinated people are far less likely to get COVID-19 with symptoms and even more unlikely to get serious COVID-19."
        },
        {
            "text": "We announced on 21 August that we would be rolling out CO2 monitors to state-funded education settings. The first deliveries of monitors will start from this week. Special schools and alternative provision will be prioritised in the first phase given the higher-than-average number of vulnerable students attending those settings; however, all eligible settings are expected to start to receive their allocations during the autumn term."
        },
        {
            "text": "Finally, I would strongly urge all eligible schools and academies to sign up to the subsidised National Tutoring Programme and access direct funding for tuition, offering much needed catch-up support to those disadvantaged pupils who have fallen most behind as a result of the pandemic."
        },
        {
            "text": "I have every confidence that staff, parents, students, governors and trustees will continue to work together admirably, following pragmatic measures like testing and vaccinations to minimise disruption and keep us on track back to a greater sense of normality. I am truly grateful for all the outstanding work you have done to date and ahead of this academic year, I thank you for your continued dedication to providing the best education for our country’s children and young people."
        },
        {
            "text": "Rt Hon Gavin Williamson CBE MP \nSecretary of State for Education"
        }
    ]
}