{
    "url": "https://civilservicelocal.blog.gov.uk/2021/09/06/one-south-west-civil-service-careers-showcase/",
    "title": "One South West Civil Service careers showcase",
    "authors": [
        "Heidi Stephens"
    ],
    "categories": [
        "South West England"
    ],
    "pub_date": "2021-09-06T16:01:25+00:00",
    "content": [
        {
            "text": "On Wednesday 29 September we will be hosting an event for civil servants, which will showcase four departments in the South West. The event will include an introduction from senior leaders in the Met Office, Defence Science and Technology Laboratory, Valuation Office Agency and Department for Work and Pensions. Following that, there will be the opportunity to be involved in discussions with members of staff from those departments, to find out what it is like working there."
        },
        {
            "heading": 4,
            "text": "Background"
        },
        {
            "text": "This event is being delivered by a group of individuals from across the Civil Service participating in a Future Leaders Academy. The team are called G.R.O.W Your Career and they identified a lack of awareness around the variety of Civil Service opportunities across the South West. This is the first in a series of virtual events to highlight the range of departments and career paths available. It will provide a chance to find out more about people's roles in other departments and create connections."
        },
        {
            "heading": 4,
            "text": "Date and time"
        },
        {
            "text": "The event will take place on 29 September from 10:00am to 12:35pm on Microsoft Teams. It will begin with an introductory session at 10:00 am from the South West Head of Place Mike Greatwich (MOD), the G.R.O.W Your Career team and senior civil servants from departments in the region."
        },
        {
            "text": "You will then be able to join two of the four departmental discussion groups of your choice at the following times:"
        },
        {
            "text": "Discussion group one – 10:45am to 11:30am"
        },
        {
            "text": "Discussion group two and close – 11:45am to 12:35pm"
        },
        {
            "text": "There is a limit of 50 delegates for each of the discussion groups, so you may not get your first choice, but there will be future events you can attend."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}