{
    "url": "https://prisonjobs.blog.gov.uk/2021/09/06/people-are-often-at-their-lowest-when-we-see-them-in-prison-as-probation-officers-we-can-help-by-giving-them-the-tools-to-change/",
    "title": "“People are often at their lowest when we see them in prison. As probation officers, we can help by giving them the tools to change.”",
    "authors": [
        "Adam"
    ],
    "categories": [
        "Career progression",
        "Guest post",
        "Personal stories",
        "PQiP",
        "Probation",
        "Ways of working"
    ],
    "pub_date": "2021-09-06T13:51:14+01:00",
    "content": [
        {
            "text": "Probation officers don’t only work in the community – they also play a key role in courts and prisons. Adam tells us how his Professional Qualification in Probation (PQiP) training led to him working at HMP Lincoln, and what his role entails."
        },
        {
            "text": "Busy but enjoyable"
        },
        {
            "text": "I really enjoyed my 15 months on the PQiP: there’s a good balance between work-based training, university lectures, and doing the job. It can be busy working full-time as well as studying, and it’s a steep learning curve at times. But there’s support available from your practice tutor, line manager and university staff. And, when it’s something you’re interested in, it makes it much easier."
        },
        {
            "text": "As part of the recently introduced Offender Management in Custody (OMiC) model, probation officers work in prisons to help people make positive changes in preparation for their return to their communities. I did a placement in a category A and a category B prison while studying for my PQiP. One of these was at HMP Lincoln. So, when I’d finished my training and was asked to submit an expression of interest for a probation officer vacancy, I opted for one there – and got it."
        },
        {
            "text": "Working as a probation officer in a prison"
        },
        {
            "text": "I hold a caseload and work with people who have committed a wide range of crimes: from shoplifting, to domestic violence and sexual offences. Some of them are serving short sentences, others long-term or life sentences, or they’ve been recalled to prison after reoffending."
        },
        {
            "text": "My days are a mix of:"
        },
        {
            "text": "As well as sentence plans, which outline the work I want an individual to focus on while in custody, I also write parole reports. These provide recommendations on whether I think an individual should be released or not, based on my assessment of their risk of harm and reoffending. And, alongside a community-based probation officer, I attend parole hearings to answer questions about these reports and explain my decisions."
        },
        {
            "text": "Helping to change lives"
        },
        {
            "text": "Prior to their release from custody, I liaise with a range of agencies to ensure an individual has the necessary resources in place to support them to return to their community and reduce their risk of reoffending. This can include arranging accommodation or sorting mental health support, for example."
        },
        {
            "text": "The main pride I take in my work is seeing people change. Individuals are often at their lowest point when we see them in prison, and they have to want to make changes to turn their lives around. As probation officers, we can help by giving them the tools to do so. One of my proudest moments was working with a man who was on a life sentence after being been recalled to prison for reoffending. After completing some motivational and other offending behaviour work with me, he regained contact with his family and child, and was accepted for parole."
        },
        {
            "text": "A range of opportunities"
        },
        {
            "text": "I like the variety that comes with probation work. There are many different roles you can do once you’ve qualified as a probation officer, plus opportunities to progress. If you want to do a job that makes a real difference both for offenders and victims of crime, I’d recommend studying for the PQiP."
        }
    ]
}