{
    "url": "https://dluhcdigital.blog.gov.uk/2021/09/06/round-5-of-the-local-digital-fund-is-now-open/",
    "title": "Round 5 of the Local Digital Fund is now open",
    "authors": [
        "The Local Digital team"
    ],
    "categories": [
        "Local Digital",
        "Local Digital Fund"
    ],
    "pub_date": "2021-09-06T14:32:05+01:00",
    "content": [
        {
            "text": "We’re thrilled to announce that the Local Digital Fund is open for applications from council-led digital projects in its fifth round of funding."
        },
        {
            "text": "In this latest open round, we’re inviting local authorities to submit proposals for alpha and beta projects across two thematic areas: development platforms and software."
        },
        {
            "heading": 2,
            "text": "About the Local Digital Fund"
        },
        {
            "text": "The Local Digital Fund supports projects that solve shared local service problems in a common way, in keeping with the principles of the Local Digital Declaration. Set up to support a growing community of organisations working together, the Declaration outlines our shared vision to deliver more user-centred, cost effective, local public services through open, collaborative and reusable work."
        },
        {
            "text": "Since launching the fund in 2018, we have funded 35 unique projects through multiple phases of work. Cross-council collaboration has been at the core of our projects, and so far more than 100 councils have adopted and reused the outputs."
        },
        {
            "text": "Examples of this include supporting Data Analysts to help their authorities predict demand for children’s services during the pandemic, and supporting 16 councils to save money and learn from others by migrating their website to Drupal. We've also helped to develop Open Referral UK, the national data standard for human services, which makes it easier for residents and council staff to find the right support in their communities - 10 organisations are already compliant with the standard."
        },
        {
            "heading": 2,
            "text": "Iterating the Fund"
        },
        {
            "text": "We’re always looking for ways to improve our approach to funding, and over the last 3 years we have made numerous iterations to the Local Digital Fund based on learnings and project team feedback. In 2020, we launched the C-19 Challenge, which focused on combating some of the challenges local authorities faced as a direct result of COVID-19. More recently, we launched the Continuous Funding Model (CFM) to offer a more flexible way for our funded projects to apply for additional funding at the end of each phase."
        },
        {
            "text": "We’re excited to launch round 5 of the Local Digital Fund, which has been designed around the success of, and our learnings from, the CFM and C-19 Challenge iterations."
        },
        {
            "heading": 2,
            "text": "About this funding round"
        },
        {
            "text": "In this round of funding, we are only accepting applications from alpha and beta projects. Alpha projects can apply for funding of up to £150,000, whereas beta projects can apply for a maximum of £350,000."
        },
        {
            "text": "Each project must be able to deliver in these set timeframes:"
        },
        {
            "text": "Projects that apply for funding and are successful may be invited to apply for further funding via the Continuous Funding Model in the future. This has proven to be a successful way for projects to progress quickly once work has started."
        },
        {
            "heading": 3,
            "text": "Round 5 funding themes"
        },
        {
            "text": "Proposals must fall into one of two thematic areas:"
        },
        {
            "text": "1. Modern user-friendly development platforms that enable councils to design and build different types of front facing services."
        },
        {
            "text": "This may include:"
        },
        {
            "text": "2. An open theme to tackle inflexible and expensive software in councils, develop new software solutions or services, and/or help reduce your cyber vulnerability."
        },
        {
            "text": "This may include:"
        },
        {
            "heading": 3,
            "text": "Who can apply"
        },
        {
            "text": "Applications are encouraged from local authorities in England."
        },
        {
            "text": "All local authorities (including partner local authorities for theme 2) must sign the Local Digital Declaration in order to apply for funding. If you have not yet signed up, you can read our guidance on signing and then sign the Declaration online."
        },
        {
            "heading": 3,
            "text": "Project Criteria"
        },
        {
            "text": "Any local authority in England can apply to the fund if they meet the eligibility criteria. To be eligible, your project must:"
        },
        {
            "text": "Full details of the eligibility criteria can be found in the Local Digital Fund Prospectus 2021/22."
        },
        {
            "heading": 3,
            "text": "How to apply"
        },
        {
            "text": "Local Digital Round 5 applications are open from 6 - 26 September 2021. Visit the Local Digital website to apply."
        },
        {
            "text": "All applications must be submitted using the application forms on the Local Digital website by 11:59pm on Sunday 26 September 2021."
        },
        {
            "text": "We suggest that everyone who wants to submit an application has a read of the Local Digital Fund Prospectus 2021/22 first."
        },
        {
            "heading": 2,
            "text": "Fund Q&A"
        },
        {
            "text": "We will be hosting a live Slack Q&A for local authorities on 13 September between 10am - 12pm."
        },
        {
            "heading": 3,
            "text": "How to join"
        },
        {
            "heading": 2,
            "text": "Get in touch with us"
        },
        {
            "text": "If you have any further questions, please don’t hesitate to contact us by emailing fund@localdigital.gov.uk."
        },
        {
            "text": "You can get updates on our work and from the #LocalDigital community by registering to receive our newsletter, following us on Twitter or joining the LocalGov Digital slack community."
        }
    ]
}