{
    "url": "https://civilservice.blog.gov.uk/2021/09/06/the-pain-of-migraine/",
    "title": "The Pain of Migraine",
    "authors": [
        "Paul Scullion, Legal Secretary to the Advocate General"
    ],
    "categories": [
        "A Skilled Civil Service",
        "Health & Wellbeing"
    ],
    "pub_date": "2021-09-06T13:43:32+00:00",
    "content": [
        {
            "heading": 3,
            "text": "The condition can be crippling, but what can be done to ease the symptoms? To mark Migraine Awareness Week, Paul Scullion shares his own experiences."
        },
        {
            "text": "For the last three years, the Civil Service has teamed up with the Migraine Trust to mark Migraine Awareness Week and help promote greater awareness of migraines. "
        },
        {
            "text": "This year, Migraine Awareness Week runs from 5-11 September, and we want as many civil servants as possible to benefit from the support available – sufferers and line managers alike."
        },
        {
            "text": "I don’t always know exactly what triggers my own migraines, but it’s likely to be a mixture of what I eat and drink, sleep (or lack of it) as well as the health of my immune system, excess artificial light and stress.  "
        },
        {
            "text": "I take medication to ease pain from migraines which can last for a few days or more at a time. I try to keep a regular routine and limit my caffeine and alcohol consumption. I also try to stay hydrated, take regular breaks from my laptop, and exercise."
        },
        {
            "text": "Research undertaken in 2020 by the Migraine Trust suggested that migraines tended, on average, to be more frequent and painful during the pandemic. One challenge I faced was being unable to accomplish my work objectives through face-to-face meetings. I also became reliant on my laptop and the artificial light that it exposed me to. During the pandemic, I therefore tried to take breaks from the screen and conduct some meetings by phone instead."
        },
        {
            "text": "When someone experiences a migraine, it requires understanding and support from managers and teams. Often it might just be a case of tweaking priorities and deadlines in agreement with colleagues, or making adjustments such as using phones rather than screens."
        },
        {
            "text": "Changing work environment"
        },
        {
            "text": "The move to hybrid working and the return to the office is another significant change civil servants will soon be embarking upon. I think it offers opportunities for reducing problems associated with migraines - but everyone is different and some people’s migraines may get worse, at least for a time, due to their individual circumstances. "
        },
        {
            "text": "Migraine sufferers and their line managers will therefore need to monitor this closely and make adjustments where required. How we do this is going to be an important topic we discuss during Migraine Awareness Week. We look forward to hearing your experiences and views."
        },
        {
            "text": "Civil servants have demonstrated resilience and adaptability throughout the pandemic, so this is a challenge I know we are up to. I hope migraine sufferers and their line managers find Migraine Awareness Week, and the associated resources below, both useful and stimulating."
        }
    ]
}