{
    "url": "https://nationalscreening.blog.gov.uk/2021/09/06/uk-nsc-annual-call-for-topics/",
    "title": "UK NSC annual call for topics: your chance to suggest a new screening programme",
    "authors": [
        "Professor Anne Mackie"
    ],
    "categories": [
        "General"
    ],
    "pub_date": "2021-09-06T10:30:18+01:00",
    "content": [
        {
            "text": "The UK National Screening Committee (UK NSC) has welcomed new proposals for topics through our annual call since 2016. We’ve reviewed a total of 27 new conditions to date, varying from endometrial cancer and neurofibromatosis type 1, to Klinefelter syndrome and adrenoleukodystrophy."
        },
        {
            "text": "An evidence map is created for the proposals which meet the UK NSC’s initial criteria — setting out the amount and type of evidence available. They help the UK NSC to decide whether they can recommend a condition for screening."
        },
        {
            "heading": 2,
            "text": "Fetal presentation"
        },
        {
            "text": "One of the promising proposals was received in 2019 when Professor Gordon Smith suggested pregnant women could be screened using a handheld ultrasound device to find out what position their baby is in."
        },
        {
            "text": "Screening would aim to find which babies were not head-down, and offer options to:"
        },
        {
            "heading": 2,
            "text": "What happened next"
        },
        {
            "text": "The annual call evaluation group agreed that this proposal had not been considered before and fell within a defined whole population group."
        },
        {
            "text": "Although the evidence map only found a limited amount of evidence, a Health Technology Assessment suggested it did look promising as a potential screening programme."
        },
        {
            "text": "The UK NSC agreed to add it to their condition list and carry out further work to determine whether a screening programme might be introduced. This further work is ongoing."
        },
        {
            "text": "Professor Smith said:"
        },
        {
            "text": "Speaking more generally about the UK NSC call for topics, Professor Smith added:"
        },
        {
            "text": "So, if you have an idea for a screening programme that is backed up with good evidence, like the fetal presentation proposal, then let us know."
        },
        {
            "heading": 2,
            "text": "Making a submission in 2021"
        },
        {
            "text": "Before you write a proposal, please check."
        },
        {
            "text": "If your answer is ‘yes’ to all these questions you may have a strong case to send to the committee."
        },
        {
            "text": "Proposals are first internally assessed by the UK NSC secretariat to make sure they are within the remit of the UK NSC. They are then taken to an expert evaluation group for a more in-depth assessment."
        },
        {
            "text": "If they meet the criteria outlined in the guidance, the UK NSC will then formally consider them."
        },
        {
            "text": "Don’t worry if you don’t have the technical expertise or access to the research. If the condition is not already on the list, is found in the general population and you can refer to some published evidence, the evaluation group will consider your proposal."
        },
        {
            "text": "We look forward to reviewing your submissions."
        },
        {
            "heading": 2,
            "text": "UK NSC blog"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK National Screening Committee. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, please contact the UK NSC helpdesk."
        }
    ]
}