{
    "url": "https://naturalengland.blog.gov.uk/2023/09/16/further-increase-in-english-hen-harrier-numbers-recorded-in-2023/",
    "title": "Further increase in English Hen Harrier numbers recorded in 2023",
    "authors": [
        "John Holmes"
    ],
    "categories": [
        "Biodiversity",
        "Hen Harriers",
        "Species recovery",
        "Wildlife"
    ],
    "pub_date": "2023-09-16T09:31:12+01:00",
    "content": [
        {
            "text": "By John Holmes, Strategy Director, Natural England."
        },
        {
            "text": "The Hen Harrier, an iconic bird of upland landscapes, is one of our rarest birds of prey. Driven to extinction in mainland Britain in the 19th century, since recolonising England in the 1960s they have remained rare due to illegal persecution and disturbance, primarily in areas associated with grouse shooting. Just ten years ago, in 2013, no Hen Harriers nested in England, but there are now more Hen Harriers nesting in England than at any point since they were lost as a breeding species around 200 years ago."
        },
        {
            "text": "Encouraging progress "
        },
        {
            "text": "Natural England and partners are pleased to report a further increase in nests and chicks in England. In 2023, a total of 54 nests were recorded (up from 49 last year) of which 36 were successful (34 last year). A total of 141 Hen Harrier chicks fledged (119 last year), an average of 3.9 chicks per successful nest (up from 3.5 last year). It has been suggested that the increase in chicks fledged per nest compared to last year could be due to high numbers of small mammals this year, meaning the adults found it easier to supply their chicks with food."
        },
        {
            "text": "Some of these nests will be second attempts, where the same pair of birds tries again after a failure, and the total also includes polygamous groups, where one male has several nests with different females. This year it’s estimated that there were 50 nesting females in England."
        },
        {
            "text": "Nesting attempts per upland area of England:"
        },
        {
            "text": "Persecution remains a serious issue "
        },
        {
            "text": "We know that illegal killing of birds of prey remains a serious and ongoing issue. We continue to see persecution of NE tagged birds, and nests that fail when the male birds unexpectedly disappear, including those reported by the RSPB earlier this year. Investigation and enforcement of wildlife crime is the responsibility of the police, and Natural England works closely with the police and the National Wildlife Crime Unit to support their investigations into missing Hen Harriers."
        },
        {
            "text": "Hen Harrier Action Plan "
        },
        {
            "text": "In 2016, Defra published the Hen Harrier Action Plan, setting out actions to increase Hen Harrier numbers, mostly designed to reduce conflict with grouse shooting interests and associated persecution. These include continued police enforcement of bird of prey crime, as well as other activities intended to promote the coexistence of hen harriers and grouse shooting, such as providing substitute food to nesting harriers (diversionary feeding) and a trial of brood management. Also part of the action plan is the Southern England Hen Harrier Reintroduction Project, which aims to restore hen harrier populations in Southern England."
        },
        {
            "text": "Brood Management "
        },
        {
            "text": "Hen Harriers are illegally killed to due to their impact on driven grouse shooting. The Brood Management Trial tests whether removing hen harrier chicks from grouse moors, to be captive reared and later released, reduces conflict sufficiently to allow the hen harrier populations to recover. The link between brood management, the increase in hen harrier numbers and ongoing persecution, however, isn’t clear. This blog explained why the trial is being extended to investigate this link. The brood management trial remains controversial, but Natural England is committed to a full scientific investigation into the complex effects of the availability of this technique, and we are clear that this trial does not influence, or detract from, any work to tackle illegal persecution, by either Natural England or the police."
        },
        {
            "text": "The total number of 141 fledglings this year includes 24 brood-managed chicks, taken from six nests on grouse moors and reared to fledging in captivity. We were pleased that all 24 were released as healthy full-grown birds, and also to see brood-managed birds from previous years breeding successfully (7 individuals, producing 12 chicks between them in 2023)."
        },
        {
            "text": "Tagging and nest cameras "
        },
        {
            "text": "Natural England field staff survey upland areas to locate nesting attempts and monitor nests. They have fitted satellite tags to 17 of this year's fledglings to learn about their movements and causes of any deaths, including nine Moorland Association tags fitted to brood-managed birds. We periodically report the status of these birds on this page, which has been updated with the latest information."
        },
        {
            "text": "We also install cameras at many Hen Harrier nests to identify individual birds from their rings, learn about prey and provisioning rates, and the causes of any nest failures. Last year, one of our nest cameras recorded footage indicating that a brood of Hen Harrier chicks in North Yorkshire was deliberately killed. These cameras also record new and interesting facts about Hen Harrier ecology every year; this year a Golden Eagle from the South of Scotland Golden Eagle Project was recorded searching, unsuccessfully, for the just-fledged Hen Harrier chicks in a nest on a grouse moor in the Yorkshire Dales – and being mobbed by their mother."
        },
        {
            "text": "Working in partnership \nWe are grateful for the efforts of all of our partners to monitor, protect and manage Hen Harrier nests and breeding habitats. We work closely with RSPB staff who record the nesting attempts on RSPB reserves, and on the United Utilities Estate in Bowland. We are also grateful for the contributions of volunteer Raptor Study Groups to nest monitoring, and to landowners and authorities including National Parks and Areas of Outstanding Natural Beauty, the National Trust and Forestry England."
        },
        {
            "text": "Natural England field staff lead on liaison with privately-owned grouse shooting estates, and the Moorland Association, working in partnership with those land managers that are encouraging hen harriers to nest successfully alongside their wider estate management for grouse and other wildlife. Natural England staff oversee the monitoring and tagging of these nests, and provide support and guidance on diversionary feeding and brood management activities. We recognise the efforts put in by these estates and their staff."
        },
        {
            "text": "Partnership working is the key to ensuring we protect our rarest species and help nature recover, with the enormous benefits for wildlife and people this brings. Natural England welcomes the clear increase in Hen Harrier nests seen since the introduction of the Hen Harrier Action Plan but it is clear there is still a long way to go. As this blog goes to press the Police are actively investigating the deliberate killing of two brood-managed hen harriers, though we have been asked to give no further details at this time. These incidents hit our staff on the ground hard and can only detract from the efforts we and the partners we are working with to restore these special birds to our uplands."
        }
    ]
}