{
    "url": "https://veteranstoday.blog.gov.uk/2022/12/23/8-5m-for-fight-against-veteran-homelessness/",
    "title": "£8.5m for fight against veteran homelessness",
    "authors": [
        "michaelball"
    ],
    "categories": [
        "Veterans Today"
    ],
    "pub_date": "2022-12-23T13:53:15+00:00",
    "content": [
        {
            "text": "More than £8.5million of funding has been announced to ensure no veteran should sleep rough this Christmas and veteran homelessness is ended in 2023."
        },
        {
            "text": "The funding will deliver services in more than 900 housing units in England, where specialist help for veterans, including with health, education and employment needs are provided."
        },
        {
            "text": "The new money will also allow for the establishment of a new referral scheme - Op FORTITUDE, which will enable veterans at risk of homelessness to access supported housing and wraparound specialist care in health, housing and education."
        },
        {
            "text": "Working with charities, the funding will ensure a single central point for local authorities and charities to identify those in need and refer them to a network of support."
        },
        {
            "text": "Minister for Veterans’ Affairs Johnny Mercer worked with the veteran housing charity sector to establish a temporary referral scheme in England, Wales and Scotland for the Christmas period, ensuring that no veterans should be sleeping rough this Christmas."
        },
        {
            "text": "Veterans can access the scheme through a dedicated charity helpline, on the number 01748 833797."
        },
        {
            "text": "This temporary referral scheme should ensure that no veteran who seeks support is homeless at Christmas."
        },
        {
            "text": "The Prime Minister, Rishi Sunak, host an event at No10 attended by representatives of the charities Riverside and Stoll, along with veterans who were previously homeless. Mr Sunak discussed the issue of veteran homelessness and how the Government, including the Office for Veterans’ Affairs, can best ensure that everyone who needs support gets it."
        },
        {
            "text": "Mr Mercer said: 'No one, not least those who have served this country, should be homeless."
        },
        {
            "text": "'That’s why we are committing £8.5million in funding and supporting a dedicated pathway, set up in collaboration with our charity partners, so veterans can not only get the housing support they need this Christmas, but also the vital backing required to help them get on their feet again."
        },
        {
            "text": "'As a government we remain steadfastly committed to ending veteran homelessness in 2023.'"
        },
        {
            "text": "Chief Secretary to the Treasury, John Glen, said: 'It’s a sad fact that so many people who have served this country find themselves sleeping rough on the streets."
        },
        {
            "text": "'Our mission is to put a stop to that, which is why we’re providing £8.5million in funding for more than 900 housing units that support our veterans and creating a new service that will help those at risk of homeless access housing much more easily.'"
        },
        {
            "text": "The funding will ensure the government’s pledge in the Veterans’ Strategy Action Plan 2022-24 to end veteran rough sleeping within this parliament, is delivered a year early."
        }
    ]
}