{
    "url": "https://forestrycommission.blog.gov.uk/2025/01/20/into-the-woods-the-value-of-amenity-woodlands/",
    "title": "Into the woods: the value of amenity woodlands",
    "authors": [
        "Helen Townsend"
    ],
    "categories": [
        "Access",
        "Into the woods series",
        "Nature"
    ],
    "pub_date": "2025-01-20T09:00:00+00:00",
    "content": [
        {
            "text": "The previous government set out in their Environmental Improvement Plan a strong ambition that everyone in the UK should live within a 15-minute walk to a green or blue space. This arose after the 2020 lockdowns, where limitations renewed our appreciation for being able to go outside and experience nature, and the physical and mental health benefits it brings."
        },
        {
            "text": "I am one of those fortunate people who lives within a 15-minute walk from nature. In fact, our house backs onto a small wooded common with the entrance to the woodland a short walk away."
        },
        {
            "heading": 2,
            "text": "Introducing Wokefield Common"
        },
        {
            "text": "Wokefield Common is privately owned, leased to the West Berkshire Council and managed by the Berks, Bucks and Oxon Wildlife Trust. The site has open access rights through the Countryside Rights of Way Act 2000 and is criss-crossed with public footpaths and bridleways."
        },
        {
            "text": "It is a Plantation on Ancient Woodland Site, with a mix of tall Scots pine on one side and a broadleaf mix with holly starting to dominate on the other."
        },
        {
            "text": "The facilities in this woodland are minimal, just a few finger posts showing the Public Rights of Way, a notice board and bin at the main entrance to the woods. There is no real path surfacing and there is a low level of tree management (mostly removal of fallen trees across the Public Right of Way)."
        },
        {
            "text": "However, the wood is very much loved and appreciated by generations of local villagers, and there are lots of desire lines that take you on different routes through the woods – allowing you to avoid the muddy parts when needed, as well as people if you don’t fancy a chat."
        },
        {
            "heading": 2,
            "text": "Treasures on our doorstep"
        },
        {
            "text": "We have been walking in these woods for over 20 years now and know them intimately."
        },
        {
            "text": "The woods are rich in wildlife: we share the woods with a population of Muntjac and Roe deer, often seeing both on a morning walk. We hear and have seen a family of foxes playing near the ponds edge and can see the vast badger setts – with a visitor in our garden earlier this year. There is also a healthy population of tawny owls that shout to each other (very loudly in the middle of the night)."
        },
        {
            "text": "I often open my Merlin App when walking the woods (particularly in the mornings) and can easily pick up over 15 different bird species in an hour, including a kingfisher that frequents one of the ponds."
        },
        {
            "text": "It is a well-used piece of woodland for local people, mainly dog walkers, runners, a few horse riders and young ambitious cyclists. There’s an area in the woods called the 'cup and saucer' (nobody seems to know why) and is made of some interesting bumps and lumps which have been used by many young people over many years as an area to have some fun in. The Common is also well used by the neighbouring nursery and scout hut."
        },
        {
            "text": "Each year numerous fungi pop up and you start to see new people in the woods with carrier bags, harvesting mushrooms. It is also a good source of foliage for those making their own wreaths at Christmas."
        },
        {
            "heading": 2,
            "text": "Enabling contact with nature"
        },
        {
            "text": "My reasons to walk in these woods on a regular basis, each have four legs: two beautiful labradors, Stanley (age 4) and Chester (age 10). Dog walking is one of the most popular reasons to walk in woodlands. We have just published guidance for land managers on Managing visitors with dogs in your woodland and how to build a positive relationship with dog walkers."
        },
        {
            "text": "These types of small amenity woodlands do not feature highly in the overall woodland creation ambitions, they aren’t hugely interesting from a silvicultural point of view, but they add masses of value to the local community. They are spaces to enjoy and teach us the value from having close contact with nature. So when creating new woodlands and forests, let’s not forget these small treasures that often get overlooked."
        },
        {
            "text": "I’ll continue to enjoy my daily walk around the woods with my two trusted friends, often mulling the day over with my husband or meeting up with a friend to catch up."
        }
    ]
}