{
    "url": "https://marinescience.blog.gov.uk/2025/01/20/ocean-country-partnership-programme-in-maldives-pollution-update-and-the-fifth-maldives-marine-science-symposium/",
    "title": "Ocean Country Partnership Programme in Maldives - Pollution update and the Fifth Maldives Marine Science Symposium",
    "authors": [
        "angharadelliman",
        "Peter Randall"
    ],
    "categories": [
        "biodiversity",
        "Climate Change",
        "International",
        "marine protected areas",
        "OCPP",
        "Pollution"
    ],
    "pub_date": "2025-01-20T14:35:04+00:00",
    "content": [
        {
            "text": "In July the Ocean Country Partnership Programme (OCPP) team from Cefas visited Maldives to attend the Fifth Maldives Marine Science Symposium and to progress work with various OCPP partners."
        },
        {
            "text": "Aerial view of Maldives islands"
        },
        {
            "text": "The Ocean Country Partnership Programme (OCPP) is a bilateral technical assistance and capacity building programme that provides tailored support to countries to manage the marine environment more sustainably, including by strengthening marine science expertise, developing science-based policy and management tools and creating educational resources for coastal communities. The OCPP delivers work under three thematic areas: biodiversity, marine pollution, and sustainable seafood. Funding is provided through the Official Development Assistance (ODA) overarching Blue Planet Fund (BPF) by the UK Department for the Environment, Food and Rural Affairs (Defra) and delivered collaboratively by the Centre of Environment, Fisheries and Aquaculture Science (Cefas), Marine Management Organisation (MMO) and Joint Nature Conservation Committee (JNCC)."
        },
        {
            "text": "Fifth Maldives Marine Science Symposium"
        },
        {
            "text": "Peter Randall and Andy Smith (Cefas), along with Beth Flavell (JNCC), attended the Fifth Maldives Marine Science Symposium. The symposium was opened by Mr. Ahmed Shiyam, the Minister of Fisheries and Ocean Resources."
        },
        {
            "text": "Mr. Ahmed Shiyam, the Minister of Fisheries and Ocean Resources opens the symposium (Left), Peter and Andy and other audience members (Right)."
        },
        {
            "text": "Amongst the many interesting presentations were two supported by OCPP."
        },
        {
            "text": "Muhusina Abdul Rahman from the Environmental Protection Agency (EPA) and Beth Flavell from JNCC co-presented the OCPP study assessing Protected Area Management Effectiveness, leading to the development of SMART (Specific, Measurable, Achievable, Relevant, and Time-bound) management plans, and a National Framework to enhance Protected and Conserved Areas (PCA) management, stakeholder awareness, and consistent practices."
        },
        {
            "text": "Fathimath Nafha from MNU presented results from a circularity assessment conducted to tackle ocean plastic in Greater Male’ Area as part of the OCPP funded Maldives SHiFT project. Maldives SHiFT was led by eXXpedition CIC, in partnership with the Republic of Maldives’ Ministry of Environment, Climate Change and Technology, Cefas, the University of Georgia, The Maldives National University (MNU), Parley Maldives, The Commonwealth and Fauna & Flora. Findings revealed that most common litter categories include tobacco products, food-related plastic packaging and paper. Further information can be found at Maldives SHiFT - eXXpedition."
        },
        {
            "text": "Fathimath Nafha (MNU) presents a circularity assessment of ocean plastic (Left), Muhusina Abdul Rahman (EPA) and Beth Flavell (JNCC) MPA study (Right)"
        },
        {
            "text": "The symposium enabled a variety of networking opportunities including meeting with Olive Ridley Project’s (ORP) programme manager Isha Afeef regarding Abandoned, Lost and otherwise Discarded Fishing Gear (ALDFG) in the Maldives and Afrah Ismail of Zero Waste Maldives regarding the waste management plan in Maldives."
        },
        {
            "text": "Stakeholder Meetings"
        },
        {
            "text": "The OCPP team delivered both sampling and personal protective equipment for the EPA and the Maldives Coast Guard as part of the Emergency Response work and met with the EPA along with the Department of Water and Sanitation (DWS), part of the Ministry of Environment, Climate Change and Technology, to discuss how OCPP could assist with water quality monitoring in Maldives, including marine water quality survey planning and training of staff in sampling and assessment techniques."
        },
        {
            "text": "The OCPP team deliver sampling and personal protective equipment to the EPA (Left) and met with the EPA & DWS to discuss water quality assessments (Right)"
        },
        {
            "text": "The team then met with Dr Mizna Mohamed of the Small Island Geographic Society (SIGS) along with Water Solutions Private Limited to learn more about their work on climate change, biodiversity and promoting a plastic free lifestyle. SIGS also have experience in outreach within Maldives, and the team discussed possible collaboration on the OCPP ALDFG work. The team also met with Shaahina Ali and her team at Parley Maldives; another social outreach organisation with great schools’ impact, backed by Ministry of Education. The team discussed Parley’s programme AIR: Avoid, Intercept, Redesign — with initiatives focused on Education and Communication, Direct Impact, Eco-Innovation, and Research and Development."
        },
        {
            "text": "Meeting with Dr. Mizna Mohamed and teams of Small Island Geographic Society & Water Solutions Private Limited (Left), and  Shaahina Ali and team at Parley Maldives (Right)"
        },
        {
            "text": "The team met with Villi Joali, a community-based NGO that has expertise in social inclusion and disability awareness. The team described OCPP’s work and discussed how Gender, Equality and Social Inclusion (GESI) awareness might look in Maldives and how it could be better integrated into the programme."
        },
        {
            "text": "Special thanks to all our partners in Maldives and all those who participated in these trips: Cefas’ Peter Randall, Andy Smith, Andy Powell, Michelle Stone and Tom Hull, JNCC’s Beth Flavell and ERC’s Anthony Gallagher."
        },
        {
            "text": "Special thanks also to Cefas’ Isabel Banham for all her before, during and after the trip support and for acting as the key Cefas Primary Contact (CPC)."
        },
        {
            "text": "Look out for our next blog on OCPP’s October trip to the Madlives covering Abandoned Lost and otherwise Discarded Fishing Gear (ALDFG), Beach Monitoring training, and Water Quality."
        }
    ]
}