{
    "url": "https://ukhsa.blog.gov.uk/2022/11/17/an-update-on-avian-flu/",
    "title": "An update on avian flu",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Health Protection"
    ],
    "pub_date": "2022-11-17T11:21:44+01:00",
    "content": [
        {
            "heading": 2,
            "text": "The current situation"
        },
        {
            "text": "A record number of cases of avian influenza virus infections, or ‘bird flu’ , were confirmed across England, Scotland, and Wales in wild and captive birds last winter (2021/22). Normally, detections of bird flu decrease during the spring and summer months, however,  the epidemic has continued, particularly in ducks, geese or other large swimming birds and sea birds. As we head into winter 2022-3, there have been further increases in detections recently, both in wild and captive bird flocks, leading the Department of Environment, Food and Rural Affairs (DEFRA)  to put in place an Avian Influenza Prevention Zone in the UK."
        },
        {
            "text": "The winter migration of wild birds is likely to further increase transmission of bird flu as infected wild swimming birds can infect local and  wild bird species who do not migrate, poultry or other captive birds resulting in local transmission either directly between birds or indirectly by birds encountering environmental contamination, including faeces and feathers from infected birds."
        },
        {
            "heading": 2,
            "text": "What action should the public take?"
        },
        {
            "text": "It is important that people do not touch dead or sick birds. Members of the public should call the Defra helpline on 03459 33 55 77 if they find dead wild birds. Currently, in Great Britain, the public are encouraged to report findings of a single dead bird of prey (including owls), three or more dead wild waterfowl (swans, geese or ducks) or gulls, or five or more dead birds of any species."
        },
        {
            "text": "Some of these birds will then be collected and tested to help us understand what risk posed to poultry and other captive birds is through understanding how the disease is distributed geographically and in different types of wild bird. Reports to the Defra Helpline of found dead wild birds are triaged and not all birds will be collected."
        },
        {
            "text": "Further information on Defra’s approach to wild bird reports can be found here. If avian influenza is confirmed in wild birds, UKHSA put in place measures to reduce the risk to people who have encountered the dead birds."
        },
        {
            "text": "If you are a bird keeper, you must keep a close watch on your birds for signs of disease and maintain good biosecurity at all times. If you suspect any type of avian influenza in poultry or captive birds, you must report it immediately by calling in England the DEFRA Rural Services Helpline on 03000 200 301. In Wales, contact 0300 303 8268. In Scotland, contact your local Field Services Office."
        },
        {
            "text": "If you experience any symptoms of bird flu and have been in close contact (within 1 metre) of a confirmed case of avian influenza in domestic or wild birds in the past 10 days, it is important that you seek medical advice from a GP or by calling NHS 111. Your symptoms can be checked over the phone. It is also important to report any recent international travel, as bird flu is a disease that occurs globally, and some countries present an increased risk."
        },
        {
            "heading": 2,
            "text": "What happens when the disease is confirmed in poultry or captive birds?"
        },
        {
            "text": "The UK has a comprehensive biosecurity plan and monitoring in place to prevent the disease spreading. When avian influenza is confirmed or suspected in poultry or other captive birds, disease control zones are put in place around the infected premises to prevent onward spread. Within these zones, a range of restrictions can apply."
        },
        {
            "text": "For more information on the current situation in the UK including areas where cases have been confirmed, DEFRA provides live updates here."
        },
        {
            "text": "The UKHSA is meeting regularly with animal and public health experts from across the UK to monitor the situation and ensure all appropriate public health actions are taken."
        },
        {
            "heading": 2,
            "text": "Monitoring and responding to avian influenza incidents in birds"
        },
        {
            "text": "DEFRA and the Animal and Plant Health Agency (APHA) are responsible for responding to and managing avian influenza incidents in poultry and other captive birds."
        },
        {
            "text": "The APHA also carries out year-round avian influenza surveillance of dead wild birds notified via public reports and warden patrols. These surveillance data, together with regular risk assessments help the Government, industry and the public understand the risks that avian influenza in wild birds poses to poultry and other captive birds."
        },
        {
            "heading": 2,
            "text": "What are the different types of avian influenza?"
        },
        {
            "text": "There are four types of influenza viruses, A, B, C and D. Influenza A and B cause seasonal epidemics in humans..  Influenza A viruses are divided by the different types of virus proteins found on the surface of the virus, there are more than 130 influenza A subtype combinations identified so far."
        },
        {
            "text": "The H5 and H7s avian influenza subtypes currently cause the most concern as these cause severe disease and high numbers of deaths in birds. The current increase in avian influenza detections in the UK and in many other countries is due to H5N1 infection and it has had devastating consequences for our wild and captive bird populations."
        },
        {
            "heading": 2,
            "text": "What about the risk to humans from avian flu?"
        },
        {
            "text": "Influenza A and B cause seasonal outbreaks regularly in people. Currently the influenza A subtypes that infect people are H1N1 (which is related to the pandemic of 2009) and H3N2. Bird flu virus infections which cause disease in humans are very rare, but unfortunately when they do, they can cause serious disease and deaths. Bird flu infections in  people from birds usually requires very close contact with an infected bird so the risk to humans is currently considered very low."
        },
        {
            "text": "There are five strains of avian influenza that have threatened human health in recent years: H7N9, H9N2, H5N6, H5N8 and a type of H5N1 strain more commonly found in Asia. Although none of these strains easily infect people and they aren't usually spread from person to person, small numbers of people have been infected around the world, leading to a small number of deaths."
        },
        {
            "text": "Currently in the UK there have been detections in wild birds and confirmed cases in poultry and captive birds of the ‘Eurasian’ H5N1 strain of avian influenza. This ‘Eurasian’ H5N1 strain of bird flu causes high levels of disease in poultry and other birds, but the risk to human health from it is considered very low. This strain can be clearly distinguished from the previous ‘Asian’ H5N1 strains because it belongs to a different subgroup (clade)."
        },
        {
            "text": "There have been very few cases of bird flu transmission to people recorded in the UK. While previous cases were confirmed as the H7 strain, January 2022 was the first time H5 had been detected in a human in the UK when a single asymptomatic H5N1 infection was identified. This person who acquired the infection in the UK had very close, regular contact with many infected birds over a prolonged period. Currently there is no evidence that this strain detected in the UK can spread from person to person."
        },
        {
            "text": "Nonetheless, because of the seriousness of bird flu infections in humans, vigilance is required in responding to human exposures to birds suspected or confirmed as having the infection. Consequently, as part of the response to avian influenza incidents, the UKHSA has put measures in place to monitor individuals who have had concerning exposures to confirmed and suspected cases of avian influenza in birds to monitor their health and give preventative antiviral drugs to reduce the chances of them becoming unwell."
        },
        {
            "text": "The Food Standards Agency (FSA) has advised that based on the current scientific evidence, avian influenza poses a very low food safety risk for UK consumers. Properly cooked poultry and poultry products, including eggs, are safe to eat. Everyone should follow FSA’s food safety and hygiene advice."
        },
        {
            "heading": 2,
            "text": "What role does UKHSA play?"
        },
        {
            "text": "While the current evidence suggests that these strains don’t spread easily to or between people, viruses constantly evolve and that is why UKHSA has monitoring in place to ensure we pick up any early evidence that the virus has jumped from birds to humans."
        },
        {
            "text": "The UKHSA undertakes a risk assessment to identify individuals who have been in contact with a suspected/confirmed case of avian influenza in a bird to see if they require follow up. This usually involves daily contact to see if they have developed symptoms so that we can take appropriate action if so. Exposed people may also be offered anti-viral treatment after recent exposure to the virus."
        },
        {
            "text": " "
        }
    ]
}