{
    "url": "https://aphascience.blog.gov.uk/2022/11/17/annual-national-hive-count/",
    "title": "The Annual National Hive Count is now live",
    "authors": [
        "Adam Parker",
        "Bronwen Hopkins"
    ],
    "categories": [
        "Bee health"
    ],
    "pub_date": "2022-11-17T15:18:36+00:00",
    "content": [
        {
            "text": "The National Bee Unit (NBU)’s Annual National Hive Count was launched this month and invites all beekeepers to make a note of the number of colonies they will be taking into the winter as of 1 November. The information from the Hive Count is vital for planning and preparation for outbreaks of disease and exotic pest incursions. The survey runs until 31 December 2022."
        },
        {
            "text": "Last year 9,000 beekeepers responded to the Hive Count, and we hope to see more and more beekeepers get involved."
        },
        {
            "text": "Having accurate and up-to-date information regarding apiary locations enables the National Bee Unit’s Inspectorate Service to get in touch with beekeepers in areas with confirmed cases of foulbrood disease or identified exotic pests to inform them of the risk to their bees and arrange a free statutory inspection. This work is central to the role of the NBU under the Healthy Bees Plan 2030, which aims to keep honeybee pests, diseases and other hazards to the lowest achievable levels and enhance effective biosecurity."
        },
        {
            "text": "The NBU’s response to Asian hornet incursions over the course of recent years has emphasised the importance of up-to-date beekeeper records. The locations of apiaries local to confirmed sightings of Asian hornets - as identified on   - continue to inform the placement of traps and the deployment of Bee Inspectors to facilitate the swift location of hornet nests and their destruction, which is carried out by the National Wildlife Managements Centre team."
        },
        {
            "text": "Finally, the National Hive Count offers a useful indication of changes in UK honeybee colony populations, which gives us the opportunity to identify trends in terms of the popularity and prosperity of beekeeping in the UK. For instance, there were 191,000 colonies counted in 1986, which decreased dramatically to just under 80,000 colonies by 2008. Colony numbers recovered to 126,000 colonies in 2013 and this further increased to 272,631 in 2021. (Several assumptions form part of the calculations used to get these numbers, so it’s classed as an ‘experimental statistic’.)"
        },
        {
            "text": "As registration of honeybee colonies and apiaries is not mandatory in the UK it is essential that the NBU takes every opportunity to encourage beekeepers to keep their records up-to-date and clearly explain the benefits of registration."
        },
        {
            "heading": 3,
            "text": "Want to know more?"
        },
        {
            "text": "If you enjoyed reading this blog, why not take a look at our other bee-related blogs."
        },
        {
            "text": "You may also be interested in the following website:"
        },
        {
            "heading": 3,
            "text": "Subscribe to our science blog"
        },
        {
            "text": "Throughout the year, we publish blogs which highlight the breadth of scientific work we are involved in as well as sharing our latest news and events we have attended."
        },
        {
            "text": "Subscribing to our blog takes seconds and you will receive instant email alerts as soon as new blogs are published so why not subscribe today!"
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}