{
    "url": "https://ruralpayments.blog.gov.uk/2022/11/17/basic-payment-scheme-december-2022-payments/",
    "title": "Basic Payment Scheme: December 2022 Payments",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Agricultural Transition",
        "Basic Payment Scheme"
    ],
    "pub_date": "2022-11-17T15:58:24+00:00",
    "content": [
        {
            "text": "As most will be aware, Direct Payments are being gradually phased out from 2021 to 2027. Progressive reductions were introduced to the Basic Payment Scheme (BPS) in 2021, with the money saved going back to farmers through the rollout of future farming schemes."
        },
        {
            "text": "Direct payments due this year will see a further step in the reduction made on last year. The percentage reductions that will be made to BPS payments for the 2021 to 2024 scheme years were set out in the Rural Payments Agency December Update 2020."
        },
        {
            "text": "We have also seen this year, a permanent change in the cycle of BPS payments. They are now being made in two instalments each year for the remainder of the agricultural transition period to help farmers with their cashflow. Around 50% of the overall payment, amounting to over £679m was issued in the summer, with the remaining balance to be paid from December 2022."
        },
        {
            "text": "RPA Director, Rozanne Kidd, said:"
        },
        {
            "heading": 2,
            "text": "Opportunities for farmers"
        },
        {
            "text": "There is a package of ongoing and one-off payments for farmers, such as the new Sustainable Farming Incentive (SFI) introduced under the Agricultural Transition Plan. These are open to farmers who claim BPS only, or those who claim BPS but have land in Countryside Stewardship or Environmental Stewardship. BPS farmers with common land should contact the RPA who will help with their application. The SFI is easy to apply for online, and gives farmers an ongoing payment that will reward sustainable practices which support food production and benefit the environment. Further one-off grants are also available, including the Farming Investment Fund, Farming Innovation Programme and the Future Farming Resilience Fund."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Where can I go for further information?"
        },
        {
            "text": "You can use the online calculator to find out how the reductions could affect your BPS payment for scheme years 2021 to 2024. You don’t need to enter any personal information to use the calculator. The results are an estimate based on the reduction figures set out in the Farming is Changing leaflet and the data you enter. Further information on BPS progressive reductions and advance payments can be found on GOV.UK."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Be aware of fraud"
        },
        {
            "text": "Once a payment has been made, a remittance advice is sent in the post confirming the amount paid. A claim statement will also be sent to explain how payments have been worked out."
        },
        {
            "text": "Farmers are encouraged to sign into the Rural Payments service to check their details are up to date in the Rural Payments service, including email and mailing address."
        },
        {
            "text": "We’re aware farmers who receive subsidy payments may be targeted by fraudsters, and in the past some farmers and land managers have received scam emails, texts and telephone calls claiming to be from RPA or Defra. Links to a fake website designed to look like an authentic RPA or Defra online service are sometimes included in the message. We do not send emails or text messages with links to websites asking you to confirm your personal details or payment information. We strongly advise anyone who receives such a request not to open the link and to delete the item instead. As fraudsters may target farmers who receive subsidy payments, remember:"
        },
        {
            "text": "If you suspect an attempted fraud or feel you have been the subject of fraud, you can contact:"
        },
        {
            "text": "Further information on how to avoid fraud and what to do if you suspect an attempted fraud can be found on the RPA pages on Gov.uk."
        }
    ]
}