{
    "url": "https://space.blog.gov.uk/2022/11/17/esa-council-of-ministers-decision-time-for-shaping-the-future-of-space/",
    "title": "ESA Council of Ministers: Decision time for shaping the future of space",
    "authors": [
        "UK Space Agency"
    ],
    "categories": [
        "Events",
        "International"
    ],
    "pub_date": "2022-11-17T15:55:40+00:00",
    "content": [
        {
            "text": "The next meeting of the European Council of Ministers will take place in November in Paris. But what is it all about?"
        },
        {
            "text": "Firstly, what is ESA? "
        },
        {
            "text": "The UK has been a member of the European Space Agency (ESA) and its predecessor organisations since the 1960s. Independent of the EU, ESA is an inter-governmental organisation promoting cooperation in space research, technology, and applications development. "
        },
        {
            "text": "ESA has 22 Member States that include non-EU countries such as Norway and Switzerland, associate members Slovakia, Slovenia, Latvia and Lithuania, as well as Canada which participates via a cooperation agreement.  "
        },
        {
            "text": "ESA is currently the UK’s primary delivery route for UK space objectives. It provides a mechanism to undertake missions which no European nation alone can deliver, facilitating multilateral partnerships for science with European and global partners.  "
        },
        {
            "text": "The meeting of ESA countries: CMin "
        },
        {
            "text": "Investments are made in ESA at Ministerial Councils, more commonly referred to as CMin. ESA Council at Ministerial level is a meeting of the ministers from all ESA Member States, Associate States and Cooperating States.  "
        },
        {
            "text": "Ministers come together to discuss and agree exciting new multi-year space programmes and funding for ESA alongside any changes to its convention, articles, or resolutions. Major decisions about ESA are made at CMin and they normally take place every 3-4 years.  "
        },
        {
            "text": "The last Ministerial meeting was  November 2019 where the UK played a critical role, and invested €1.66bn across many programme areas such as Exploration, Space Science, Telecommunications and Applications, Earth Observation, Space Safety and Security, Technology, Navigation and Launch."
        },
        {
            "text": "CMin22 "
        },
        {
            "text": "CMin22 will take place in Paris on 22-23 November 2022 as France currently holds the ESA Presidency. The UK aims to build on the success of 2019 and achieve an outcome that delivers UK mission leadership driving growth, safety and sustainability on Earth, and discovery and inspiration for all. "
        },
        {
            "text": "CMin22 is an exciting opportunity to help set the future direction of ESA and ensure ESA remains a world-leading space agency, from helping tackle problems such as climate change to being at the forefront of scientific discovery.  "
        },
        {
            "text": "The UK is looking to achieve an outcome that delivers the National Space Strategy’s  objectives and secures UK roles in large science missions and cutting-edge technology.   "
        },
        {
            "text": "There are broadly two types of programmes on offer at CMin; mandatory and optional. The mandatory activities are the space science programmes and the general budget. They are funded by a financial contribution from all 22 Member States, calculated in accordance with each country’s gross national product. "
        },
        {
            "text": "In addition, ESA conducts several optional programmes. Each Member State decides which optional programme they wish to participate and the amount they wish to contribute. "
        },
        {
            "text": "At CMin22, 14 independent socio-economic studies will support critical decisions while providing evidence of the value generated by space in Europe. There are clear commercial, social, political, reputational, scientific, and economic benefits to working with ESA.  "
        },
        {
            "text": "The UK in ESA: £11.80 for every £1 "
        },
        {
            "text": "Our collaboration with ESA to date has delivered many successes, including inspiring the nation with Tim Peake’s flight to the International Space Station, the development of a key instrument on the James Webb Space Telescope (JWST), and helping to grow our own space economy through the creation of ESA’s Centre for Space Applications and Telecommunications (ECSAT) in Harwell. "
        },
        {
            "text": "ESA plays a significant role in the UK’s scientific discovery and the UK has won a leading role in every science mission selected by ESA since 2011. Additionally, every £1m invested in ESA is expected to generate £11.8m over time. "
        },
        {
            "text": "The UK is proud to be a founder member of ESA and through ESA, the UK can take part in - and often lead – internationally prestigious missions that raise the profile of the UK’s achievements in space. "
        }
    ]
}