{
    "url": "https://deframedia.blog.gov.uk/2022/11/17/further-reports-of-egg-shortages/",
    "title": "Further reports of egg shortages",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Weekly stories"
    ],
    "pub_date": "2022-11-17T14:44:12+00:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "There has been further coverage today (Thursday 17 November) of some supermarkets reporting shortages in supplies of eggs, following the avian influenza outbreak and rising costs for farmers due to the war in Ukraine."
        },
        {
            "text": "The Daily Mail reports on its front page that some supermarkets such as Asda and Lidl are due to limit the number of egg boxes that customers can buy. The piece notes that poultry farmers are facing the largest ever outbreak of bird flu with the number of cases on farms continuing to rise. It also references comments from producers who have raised concerns that current supermarket prices for eggs do not reflect the rising cost of energy and poultry feed."
        },
        {
            "text": "The Telegraph quotes the British Retail Consortium’s (BRC) director of food and sustainability, Andrew Opie, saying that while avian flu has disrupted the supply of some egg ranges, retailers are experts at managing supply chains and are working hard to minimise impact on customers."
        },
        {
            "text": "BBC News Online also states that some shops including Asda and Lidl have started to ration the number of boxes of eggs customers can buy, however, Tesco and Morrisons have said they do not face any major supply issues."
        },
        {
            "text": "While there is a tightening of the egg market due to a number of factors including rising input costs for feed and energy, partly caused by Russia’s invasion of Ukraine, the UK’s food supply chain is resilient. We are keeping the egg market under review through the UK Agriculture Market Monitoring Group."
        },
        {
            "text": "In response to the impacts of bird flu, we are also supporting farmers and producers through changes to the existing bird flu compensation scheme and a temporary relaxation of marketing rules allowing certain seasonal poultry products to be frozen and later sold as defrosted."
        },
        {
            "text": "The Environment Secretary Dr Thérèse Coffey highlighted in parliament today that recognising there are nearly 40 million egg laying hens available, she is confident we can get through this supply difficulty in the short term."
        },
        {
            "text": "A Defra spokesperson said:"
        },
        {
            "text": "“We understand the difficulties that rising input costs for feed and energy over the last year, combined with the bird flu outbreak, are causing for farmers and we are working with industry to monitor the market."
        },
        {
            "text": "“The UK’s food supply chain is resilient – there are 38 million laying hens across the country and we are not expecting any significant impact to the overall supply.\""
        },
        {
            "text": " "
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        },
        {
            "text": " "
        }
    ]
}