{
    "url": "https://insidehmcts.blog.gov.uk/2022/11/17/improving-access-to-justice-by-encouraging-early-engagement-with-legal-representation/",
    "title": "Improving access to justice by encouraging early engagement with legal representation",
    "authors": [
        "Anna Tiplady - Behavioural Insights Lead, HMCTS"
    ],
    "categories": [
        "Crime",
        "Customer experience and research"
    ],
    "pub_date": "2022-11-17T09:54:06+00:00",
    "content": [
        {
            "text": "In 2020, we commissioned a report to help us better understand and improve defendant engagement across the criminal court process."
        },
        {
            "text": "The research found that providing information and guidance to defendants early – while in police custody – was a critical point of intervention to support defendants to better navigate and engage with the court process."
        },
        {
            "text": "Research was conducted by Revolving Doors, an agency that champions long-term solutions for justice reform. They aim to tackle the root causes of reoffending and support people’s journeys towards better lives."
        },
        {
            "text": "Based on the recommendations from their research, we decided to pilot a behavioural trial. We used messaging at different points during police custody to help reinforce the message that legal representation is available and can be helpful."
        },
        {
            "text": "Read the Revolving Doors report."
        },
        {
            "heading": 2,
            "text": "Our approach"
        },
        {
            "text": "Using behavioural insight techniques such as salience of consequences and timely prompts to encourage action, we’ve designed a series of:"
        },
        {
            "text": "The interventions help to reinforce the message that legal representation is available and can be helpful. They also give defendants information about the next steps in their journey. We’re currently trialling the interventions in Norfolk and Suffolk custody suites."
        },
        {
            "text": "Posters are in prominent places, including booking-in areas and interview rooms."
        },
        {
            "text": "There are 2 leaflets given to the defendant in custody - one at pre-charge and another at the point of charge. The leaflets contain messaging to encourage defendants to seek legal representation, where appropriate. They also signpost to further information about going to court."
        },
        {
            "text": "We’ve also added stencilling to the cells to remind defendants that they can ask for legal advice and support when in the cell."
        },
        {
            "heading": 2,
            "text": "Measuring the pilot’s impact"
        },
        {
            "text": "To measure the effectiveness of the pilot, we’re gathering data and will compare the test sites in Norfolk and Suffolk to a non-intervention site. We expect to have the findings from this pilot early next year.  "
        },
        {
            "heading": 2,
            "text": "The Behavioural Insights team"
        },
        {
            "text": "Our team generates and applies behavioural insights to discover new, better and more cost-effective ways of delivering our services. We work with our service teams to:"
        }
    ]
}