{
    "url": "https://lifeathmrc.blog.gov.uk/2022/11/17/inter-faith-week-my-hijab-fatemas-story/",
    "title": "Inter Faith Week: My Hijab, Fatema's Story",
    "authors": [
        "ebonydouglas"
    ],
    "categories": [
        "Culture & Values",
        "Diversity",
        "General",
        "Inclusion",
        "Recruitment"
    ],
    "pub_date": "2022-11-17T10:51:04+00:00",
    "content": [
        {
            "text": "Inter Faith Week is all about 'working together with mutual respect'. We are excited to be able to share a powerful story from the perspective of one of our colleagues, Fatema, who has worked in HMRC for over 30 years. She takes us on a journey of self-discovery, faith and HMRC's positive response to diversity."
        },
        {
            "heading": 2,
            "text": "Making the choice  "
        },
        {
            "text": "I’m Fatema and I’d like to share why I choose to wear my headscarf to work."
        },
        {
            "text": "When I started working with HMRC back in 1991, it was very different. There were very few faces who looked or dressed like me. Colleagues were not always aware of Islamic beliefs, traditions and were naturally curious. There were no prayer rooms, and little was known of what my needs were. Those colleagues who knew me in my younger days will recall I didn't wear a hijab."
        },
        {
            "heading": 2,
            "text": "Tell us when this all changed for you..."
        },
        {
            "text": "This all changed in 2003 when I went to Saudi Arabia for the pilgrimage. Muslim women wear headscarves as a symbol of their faith and commitment to the Almighty. As part of the dress code, I’m expected to cover up and despite the stifling heat, I found it relatively easy to do. My faith and conviction increased during those blessed days so did my attachment to the headscarf."
        },
        {
            "text": "Not only did it cover bad hair days, (that is a blessing seen as the locks are no longer what they once were!) but my whole attitude to my faith changed. For the first time ever, I felt proud to be who I was and amongst the throng of women - I found my real self as a Muslim woman."
        },
        {
            "text": "Since then, the hijab has become my identity and I don't feel dressed without it. Each year when the Hajj, the pilgrimage to Saudi Arabia takes place, I am reminded of that special time."
        },
        {
            "heading": 2,
            "text": "What is HMRC like now?"
        },
        {
            "text": "Fast forward 30 years and HMRC can be proud of its rich diversity in the workforce. I am no longer conscious of what I wear and can feel confident wearing a hijab or traditional clothing without wondering if colleagues will ask awkward questions."
        },
        {
            "heading": 2,
            "text": "New Facilities"
        },
        {
            "text": "More recently, with the opening of the new Regional Centres there are specially designed Reflection/Prayer rooms with separate washing facilities for men and women in line with Islamic traditions. I noticed that there were no mirrors and several ladies had commented about this lack of provision. Anyone who wears a headscarf will testify, its near impossible to arrange the intricate folds without looking in a mirror. The solution was simple, I contacted the Estates teams in Leeds and requested a mirror, coat hooks and hand dryer to be added to the facilities."
        },
        {
            "heading": 2,
            "text": "What was the response?"
        },
        {
            "text": "They were more than happy to oblige and went as far as installing them in the men’s facilities too."
        },
        {
            "text": "A simple request and action was promptly taken. This is inclusivity at its best."
        },
        {
            "heading": 2,
            "text": "What is the Race Network?"
        },
        {
            "text": "The Race Network is an internal group that continues to support colleagues like myself, to bring our true self to work. We can all appreciate each other’s culture, celebrating commonalties and accepting differences. I am part of the Yorkshire Group and organised a Culture Day for Inclusion Week, encouraging colleagues to bring their authentic self to work by dressing up in their traditional attire. I have also created a video stream to showcase the team's multilingual talents which we enjoyed."
        },
        {
            "text": "We have a wide range of roles available, with vacancies being added to Civil Service Jobs each week. Check our current vacancies and apply now."
        },
        {
            "text": " "
        },
        {
            "text": "#InterFaithWeek"
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}