{
    "url": "https://ukhsa.blog.gov.uk/2022/11/17/norovirus-what-to-do-if-you-catch-it-and-helping-to-stop-the-spread/",
    "title": "Norovirus: What to do if you catch it and helping to stop the spread",
    "authors": [
        "laurajupp"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2022-11-17T11:23:56+01:00",
    "content": [
        {
            "text": "Norovirus, commonly known as the winter vomiting bug, is a stomach bug that causes sickness and diarrhoea. Following lower levels than normal throughout the COVID-19 pandemic, we have started to see an increase in norovirus activity as we head into the winter period."
        },
        {
            "text": "Norovirus is able to spread easily through communities and so outbreaks are common in settings where individuals have close contact such as hospitals, care homes, schools and nurseries."
        },
        {
            "text": "For most people this is an unpleasant, short-lived illness and they make a full recovery within 2-3 days without needing any medicine. However, some groups, including young children, the elderly or those with weakened immunity, are at risk of suffering more serious and prolonged illness which may require medical treatment."
        },
        {
            "heading": 2,
            "text": "Stopping the spread"
        },
        {
            "text": "Norovirus is easily transmitted through contact with people with the infection and any surfaces or objects which have been contaminated with the virus. Symptoms include sudden onset of nausea, projectile vomiting and diarrhoea but can also include a high temperature, abdominal pain and aching limbs."
        },
        {
            "text": "The incubation period of norovirus is 12-48 hours, which is the time between catching the virus and developing symptoms. Individuals are most infectious when symptomatic, but it is possible to pass on norovirus or shed the virus, thereby contaminating surfaces, objects or even food, both before developing symptoms and after symptoms have stopped."
        },
        {
            "text": "Good hand hygiene is important to stop norovirus spreading. To avoid catching norovirus or passing it on to others wash your hands frequently and thoroughly with soap and warm water. This is most important following an episode of illness, after using the toilet, before eating or preparing food as well as cleaning up vomit or diarrhoea. Alcohol-based hand sanitisers are not effective against norovirus."
        },
        {
            "heading": 2,
            "text": "If you’ve got norovirus, remember:"
        },
        {
            "text": "1) Norovirus cannot be treated with antibiotics. This is because antibiotics work to fight bacteria and not viruses."
        },
        {
            "text": "2) Vomiting and diarrhoea causes your body to lose water and salts, which can lead to dehydration, so it is important to drink plenty of fluids to prevent this. Elderly individuals, young children and those with weakened immune systems are at most at risk of becoming dehydrated and needing treatment."
        },
        {
            "text": "3) Stay at home. Do not return to work or send children to school until 48 hours after the symptoms have stopped and do not visit your GP or hospital while symptomatic. If you are concerned about your symptoms, talk to your GP by phone, contact NHS 111 or visit the NHS norovirus webpage."
        },
        {
            "text": "4) Avoid cooking and helping prepare meals for others until 48 hours after symptoms have stopped, as norovirus can be spread through contaminated food when it is handled by people shedding norovirus."
        },
        {
            "text": "5) Wash any contaminated clothing or bedding using detergent and at 60°C, and if possible, wear disposable gloves to handle contaminated items."
        },
        {
            "text": "6) To disinfect contaminated surfaces, use bleach-based cleaning products where possible."
        },
        {
            "text": "Norovirus immunity is short lived and there is no cross-strain immunity, therefore it is possible to have multiple norovirus infections in a short period of time if you’re exposed to different strains."
        },
        {
            "text": "Whilst norovirus spreads easily, taking the precautions listed above can dramatically reduce your risk of catching it this winter. Practicing good hygiene and avoiding contact with others while infectious are at the core of protecting yourself and others from the spread of the virus."
        },
        {
            "text": "Get more information on norovirus here."
        }
    ]
}