{
    "url": "https://ukhsa.blog.gov.uk/2022/11/17/raising-awareness-about-amr-toolkits-for-healthcare-professionals/",
    "title": "Raising awareness about AMR: toolkits for healthcare professionals",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Antimicrobial resistance"
    ],
    "pub_date": "2022-11-17T09:40:35+01:00",
    "content": [
        {
            "text": "Antimicrobial resistance (AMR) demands action and education by professionals and the public alike. This blog collates resources and materials for raising awareness that have been developed by UKHSA, Health Education England and partners."
        },
        {
            "heading": 2,
            "text": "Antimicrobial Stewardship in Primary Care:"
        },
        {
            "text": "Treat Antibiotics Responsibly, Guidance, Education, Tools – the TARGET toolkit"
        },
        {
            "text": "The TARGET Antibiotics Toolkit produced by UKHSA in collaboration with the Royal College of General Practitioners (RCGP) includes a range of resources that can be used to support prescribers and patients with responsible antibiotic use, helping to fulfil CPD and medical revalidation requirements."
        },
        {
            "text": "TARGET is designed to be used by the whole primary care team within the GP practice, out-of-hours setting or community pharmacy and the resources can be used flexibly, either as standalone materials or as part of an integrated package."
        },
        {
            "text": "Dental Antimicrobial Stewardship Toolkit"
        },
        {
            "text": "The Dental Antimicrobial Stewardship (AMS) Toolkit for primary care includes resources to help primary care practitioners promote the appropriate use of antibiotics in dental care. The toolkit was developed in collaboration between the Dental Subgroup of Public Health England’s English surveillance programme for antimicrobial utilisation and resistance (ESPAUR), Faculty of General Dental Practice (FGDP) and British Dental Association (BDA)."
        },
        {
            "text": "The Faculty of General Dental Practice UK (FGDP) and the Faculty of Dental Surgery of the Royal College of Surgeons of England (FDS) Antimicrobial Prescribing in Dentistry Good Practice Guidelines were updated in 2020 and support the judicious use of antimicrobials in dentistry."
        },
        {
            "text": "Additional resources are available via the British Dental Association and College of General Dentistry."
        },
        {
            "heading": 2,
            "text": "Antimicrobial Stewardship in Secondary Care"
        },
        {
            "text": "The Start Smart then Focus toolkit provides an outline of evidence-based antimicrobial stewardship in the secondary healthcare setting."
        },
        {
            "text": "The IV to Oral Switch Criteria and Decision Aid Tool was published to support early switching from intravenous to oral antibiotics, co-produced through a UK-wide consensus process."
        },
        {
            "text": "The Antibiotic Review Kit (ARK) is an antimicrobial stewardship initiative that aims to safely reduce antibiotic use in hospitals by helping staff stop unnecessary antibiotic treatments. The website includes a range of resources designed to help all healthcare professionals to reduce antibiotic overuse in hospitals. A stepped-wedge, cluster hospital-randomised controlled trial of the kit has recently been published in Lancet Infectious Disease"
        },
        {
            "heading": 2,
            "text": "Antimicrobial Awareness resources"
        },
        {
            "text": "The UKHSA has published a resource toolkit to help the NHS, local authorities and others support European Antibiotic Awareness Day (EAAD), World Antimicrobial Awareness Week 2021 (WAAW) and the Antibiotic Guardian campaign, to encourage responsible use of antibiotics. Our guidance details national resources developed for promoting antimicrobial stewardship, and suggestions for how these can be used to support local awareness raising initiatives. ."
        },
        {
            "heading": 2,
            "text": "e-Bug"
        },
        {
            "text": "e-Bug (operated by UKHSA) is a free educational resource designed to improve young people’s knowledge and understanding about microbes, infection prevention and control, and prudent antibiotic use, thereby empowering them to be proactive in looking after their own health."
        },
        {
            "text": "The resources consist of a range of fun and interactive activities to complement learning, including games, quizzes, and debate kits. All activities and lesson plans comply with the Department for Education educational standards for junior and senior schools (Early Years, Key Stage 1, 2, 3 and 4)."
        },
        {
            "text": "Other resources available in the e-Bug toolkit include:"
        },
        {
            "text": "Beat the Bugs: a six week community hygiene course aiming to increase awareness and change behaviour around antibiotic use"
        },
        {
            "text": "Educator training courses: for educators and members of the community who teach children and young people"
        },
        {
            "text": "Find out more on the e-Bug website and sign up now for the e-Bug newsletter. Receive quarterly updates on e-Bugs activities and learn more about how you could be involved."
        },
        {
            "heading": 2,
            "text": "Antibiotic Guardian "
        },
        {
            "text": "The Antibiotic Guardian website provides key actions in the form of pledges that healthcare professionals, health students and educators as well as members of the public can take to help keep antibiotics working."
        },
        {
            "text": "The number of Antibiotic Guardians per 100,000 population for each CCG is also available via UKHSA Fingertips and by local authority via Antibiotic Guardian website"
        },
        {
            "heading": 2,
            "text": "Antibiotic Guardian Schools Ambassadors"
        },
        {
            "text": "The Antibiotic Guardian Schools Ambassadors programme aims to connect public health, healthcare workers and scientists with local schools, in order to share learning on infection prevention, hygiene and AMR."
        },
        {
            "text": "In the first year (2019), AG Schools Ambassadors were able to deliver live sessions in schools during World Antimicrobial Awareness Week This was not possible in 2020, so instead, Ambassadors were asked promote a short article to schools for inclusion in their school newsletters."
        },
        {
            "text": "This year, an updated newsletter item has been provided to promote to local schools and a toolkit of teaching materials – based on eBug resources – has been provided. This allows ambassadors to either give a teaching session in person, online, or promote the toolkit to schools for them to plan a lesson themselves."
        },
        {
            "text": "To use the resources, register as an AG schools Ambassador here. Be sure to encourage your school to register their activity via this short online form."
        },
        {
            "heading": 2,
            "text": "Education and Training Resources"
        },
        {
            "text": "AMR and Infections programme – e-learning"
        },
        {
            "text": "The Antimicrobial Resistance (AMR) and Infections programme has been designed to support health and care staff – both clinical and non-clinical – in a variety of settings to understand the threats posed by antimicrobial resistance, and the ways they can help to tackle this major health issue. This programme has been developed by Health Education England (HEE) in collaboration with UKHSA, NHS England and NHS Improvement, Care Quality Commission and National Institute for Health and Care Excellence."
        },
        {
            "text": "Antibiotic resistance poses a major threat to everyday life and modern day medicine where lives could be lost as a result of antibiotics not working as they should. All health and care staff, as well as the public, have a very important role in preserving the power of antibiotics and in controlling and preventing the spread of infections. Among the approaches to reduce this threat includes adequate infection prevention and control practices, good antimicrobial stewardship and the use of diagnostics."
        },
        {
            "text": "Visit HEE  website for more information on our AMR work."
        },
        {
            "heading": 2,
            "text": "Antimicrobial Resistance, Prescribing and Stewardship data"
        },
        {
            "text": "We publish the English surveillance programme for antimicrobial utilisation and resistance (ESPAUR) report every year."
        },
        {
            "text": "The AMR indicators on UKHSA Fingertips provide a range of trust level data sets on antimicrobial resistance, healthcare-associated infections, antibiotic prescribing, infection prevention and antimicrobial stewardship that can be used"
        },
        {
            "text": "Other sources of presenting antibiotic prescribing data for primary care are also available."
        },
        {
            "heading": 2,
            "text": "Other national resources"
        },
        {
            "text": "The NICE Infection portal includes access to all NICE products on infections including guidelines that set out the antimicrobial prescribing strategies for a range of infections, guidance, advice and quality standards."
        },
        {
            "text": "The Future NHS AMR programme website site set up by NHS England is available for local, regional and national colleagues to access key national guidance, updates and content available relating to infection management and antimicrobial resistance, and as a mechanism to share knowledge and to network with other colleagues across the country."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}