{
    "url": "https://publicpolicydesign.blog.gov.uk/2022/11/17/untapped-potential-from-design-research-for-public-policy/",
    "title": "Untapped potential from design research for public policy",
    "authors": [
        "Ramia Mazé"
    ],
    "categories": [
        "Events",
        "PublicPolicyDesign",
        "Thought leadership"
    ],
    "pub_date": "2022-11-17T12:00:41+00:00",
    "content": [
        {
            "text": "How can ideas from design research – such as materiality, agonism and anticipation – be used in policy development? What are some untapped potentials from design research for public policy? This was the premiss of a lively meeting held on 3rd October and attended in a hybrid format by around 60 participants from all across the UK and beyond (including from Finland, Luxembourg, Sweden and Switzerland)."
        },
        {
            "text": "Co-chaired by Professors Lucy Kimbell and Liz Richardson, this was the second meeting of the AHRC Design and Policy Network, led by the University of Manchester and the Social Design Institute at University of the Arts London. This meeting followed a successful inaugural meeting in June. The aim of the network is to gather civil servants, policymakers and public servants together with designers and design scholars across multiple relevant contexts. Structured around three provocations, this session included three speakers spanning design, policymaking and political science, which then opened-up through multiple discussions in small groups and a culminating plenary discussion."
        },
        {
            "heading": 2,
            "text": "Design for vibrant democracy"
        },
        {
            "text": "Dr Carl DiSalvo (Georgia Institute of Technology, US) started the session by drawing our attention to some important distinctions between the work of designers and policymakers. He argued that design can do things that policy cannot, and that this can benefit policymaking. Specifically, he proposed a role for design in keeping democracy “vibrant” through its capacity to act within particular places and with people that may be beyond the direct reach or scope of policymaking."
        },
        {
            "text": "A case in point is the design work that Carl has been doing with colleagues for 15 years in Atlanta (see DiSalvo, Design as Democratic Inquiry, MIT Press, 2022). That work is community and place-based. In his words, “on-the-ground, in-the-streets”, in which participatory design and data-driven methods are means through which stakeholders gather and articulate their particular issues of concern. Issues relevant for example to housing policy may include community residents’ experience of inequitable provision, property mismanagement and code violations. In addition to a capacity to act within such particular places, Carl argued for the capacity of design to make – for example, maps, data collections and visualisations. Thus, design can not only ‘witness’ but make concrete, enduring evidence of citizen experiences in ways that are directly relevant to policy. For stakeholders, the materiality of design can empower them within agonistic and advocacy processes, thus contributing to democratic policymaking."
        },
        {
            "heading": 2,
            "text": "Design for public value"
        },
        {
            "text": "Andrew Knight (Head of the UK Policy Design Community, UK Civil Service) then presented his perspective on the untapped potentials of design. He spoke from his extensive experience as a public servant and from the UK Policy Design Community, a community of practitioners across about 60 local and central administrations across the UK. He started by pointing out a common but outdated view of policymaking: a slow, linear and top-down process in which a decision-maker has a brilliant idea, which is then handed over to policymakers, then to others to implement, and finally to an evaluator. In contrast to this, he proposed five improvements within contemporary policy design."
        },
        {
            "text": "Andrew pointed, firstly, to a design-led approach premised on experiments. As a means for gathering evidence and testing policies early on, experiments can reduce risks and assessing “public value” before full roll-out. Secondly, he articulated a particular design capability that is holistic and systematic, a “whole systems” approach that can support those in government to navigate the complexity of increasingly complex challenges such as the pandemic and climate change. Next, he argued that design can provide governments with a “multidisciplinary nervous system,” ways of working that are collaborative and constructive across silos and professions. Fourthly, by pointing to design in industry, he explained that design for or in government can improve productivity. Lastly, he concluded that design contributes to building “public trust” in government through approaches that are responsive to communities and citizens."
        },
        {
            "heading": 2,
            "text": "Design to open political imagination"
        },
        {
            "text": "Professor Catherine Durose (Heseltine Institute for Public Policy, Practice and Place at the University of Liverpool, UK) followed by affirming that the idea of “design for public policy” is now recognised across design, policymaking and her own field of political science. Provocatively, she pointed out that the turn to design may reveal some limits of policy – for example, limits to policymaking that is primarily technocratic and dominated by party politics. Our contemporary context is characterised by, in her words, “radical uncertainty,” in which there are high stakes and an urgency to act in relation to issues such as the pandemic and climate change. In this context, it’s difficult to anticipate events, to predict how they will unfold, and to handle the plurality of legitimate views on how to proceed. The turn to design can be a way to bring “the political” to policymaking, to disrupt some of the ontological assumptions and entrenched practices that limit policy today."
        },
        {
            "text": "Catherine continued by outlining three different potentials of design for policy in terms of “the political.” Firstly, by visualising and materialising issues that are complex, ambiguous and contested. Catherine argued that design can identify opportunities and enable “anticipation” of future policies. Secondly, design methods can open policy practices to different forms of expertise and to citizen’s experiences. This more instrumental potential may, on one hand, simply add to the set of tools available to policymakers or, on the other, catalyse systemic transformation. Lastly, she articulated a “pragmatic” use of design, in which experiments and innovations are means to learn incrementally in ways that are more quick, cheap and collaborative within inherently messy policy processes."
        },
        {
            "heading": 2,
            "text": "Reflections from the network"
        },
        {
            "text": "After these three provocations, the session shifted into participant discussions within smaller breakout groups. Within the groups, the various potentials of design were further explored."
        },
        {
            "text": "For example, the design role, on one hand, as facilitating policymaking processes (including accountability and experts), on the other, as disrupting through imagination and creativity beyond the current conditions or given expertise."
        },
        {
            "text": "There was an exchange about the multiple ‘places’ and ‘levels’ of activity relevant to policymaking, which resonates with Carl’s point that democracy is more than a form of government. Places (and power) inside and outside of the “machine room” of government were discussed. Resonating with both Andrew and Catherine’s contributions, some explored the issue of continuity versus change in current policymaking practices, and implications in terms of failure, risk, legitimacy and democracy. Resonant in one participant’s phrase: “the speed of trust,” there was a concern for learning and reflection in policymaking."
        },
        {
            "text": "Several discussed implications for the skills and capabilities of future policymakers (and future designers), and there were some hints of future initiatives."
        },
        {
            "text": "Watch this space – the third session of the network will be announced on this blog shortly!"
        }
    ]
}