{
    "url": "https://forestrycommission.blog.gov.uk/2022/11/17/want-to-help-protect-our-trees-find-out-what-you-can-do-with-simple-biosecurity/",
    "title": "Want to help protect our trees? Find out what you can do with simple biosecurity",
    "authors": [
        "Becki Gawthorpe"
    ],
    "categories": [
        "Biosecurity",
        "Tree health"
    ],
    "pub_date": "2022-11-17T08:00:00+00:00",
    "content": [
        {
            "text": "One of the most interesting parts of my role is getting out and about to a range of events and sites with my colleagues, meeting people to talk about tree health and the importance of good biosecurity"
        },
        {
            "text": "We know that trees beautify our landscapes, support our wildlife and are essential to our health and wellbeing, our communities, and our economy - it is therefore important that we do our best to keep them healthy."
        },
        {
            "text": "But, our trees, woodlands and forests are at risk from harmful tree pests, diseases and invasive non-native species, which can spread rapidly and have a devastating impact on our landscapes. This movement may be via natural pathways such as through watercourses, wildlife migration, or wind dispersal, but more frequently it is a result of human activity. It is not always possible to see tree pests and diseases and they spread easily in soil or organic material carried on footwear, clothing, and bike tyres. Some tree diseases need water to disperse, so the risk of these being spread increases when conditions are wet."
        },
        {
            "heading": 3,
            "text": "What is biosecurity?"
        },
        {
            "text": "There are measures we can take to reduce the risk of spreading tree pests and diseases. Practising good biosecurity when we're out and about is one of them."
        },
        {
            "text": "Biosecurity can mean different things to different people, and even the word itself isn’t commonly heard. So, the first thing we do when we’re talking to the public, is make sure they understand exactly what we mean by it."
        },
        {
            "text": "Put simply, biosecurity refers to any measures or precautions that aim to prevent the spread and/or introduction of tree pests, diseases, and invasive non-native species."
        },
        {
            "text": "It often surprises people how simple, inexpensive, and quick it can be to take these precautions, and what an important difference it can make."
        },
        {
            "heading": 3,
            "text": "What can I do?"
        },
        {
            "text": "Biosecurity measures, which essentially means keeping things clean, minimises the amount of soil, water and plant material we carry between visits to outdoor areas such as parks, gardens, or woodlands. At this time of year, as autumn turns to winter, there is more mud and leaf litter on the ground that can collect on your boots and tyres. By taking some very simple routine actions you can help keep trees healthy."
        },
        {
            "text": "The actions you need to take will depend on the activities or work you carry out. For most people it's straightforward - Keep it Clean! It's important to clean your boots, bikes, and buggies when you get back to the car or before you head out to enjoy nature, following the principles of: Arrive Clean, Leave Clean, and Keep it Clean!"
        },
        {
            "text": "Never assume an area to be free of pests, diseases, or invasive non-native species. Many threats are microscopic or are very hard to spot. Sometimes it can take a while for affected trees to display symptoms of infection or infestation."
        },
        {
            "heading": 3,
            "text": "Ways to ‘Keep it Clean’"
        },
        {
            "text": "We’ve encountered all kinds of creative methods people use to clean off their boots and kit. Here are just some of them (share yours in the comments if you like):"
        },
        {
            "text": "You might even want to put your own mini biosecurity kit together? If you do, we’d love you to tweet us some photos of your kits in action @ForestryComm."
        },
        {
            "heading": 3,
            "text": "Can I really make a difference?"
        },
        {
            "text": "People often ask us at the end of our biosecurity talks “will it really make much difference if I practice biosecurity?” The answer is yes, it can make all the difference, and we encourage people to lead by example. Explain to others what you are doing and why. My friends and family are all aware of why I’m cleaning my boots and kit at the end of a walk in the woods, and I’m happy to let any curious people in the car park know what I’m up to too. It’s all part of encouraging the cultural and behavioural change we need to help save our trees from damaging pests and disease so future generations can enjoy them. We want biosecurity to become the norm in the UK the way it has in countries like Australia or New Zealand."
        },
        {
            "heading": 3,
            "text": "Be a tree health hero"
        },
        {
            "text": "Why don’t you join us and become a tree health hero by helping us gather information about the health of the nation's trees. Report any unusual symptoms using Tree Alert, Forest Research's online reporting tool."
        }
    ]
}