{
    "url": "https://defradigital.blog.gov.uk/2022/11/17/working-with-content-designers-to-improve-gov-uk-information-for-cattle-keepers/",
    "title": "Working with content designers to improve GOV.UK information for cattle keepers",
    "authors": [
        "Danielle Vincent",
        "Paul Wilkinson"
    ],
    "categories": [
        "Defra content design",
        "Defra digital",
        "User centred design",
        "User research"
    ],
    "pub_date": "2022-11-17T07:30:10+00:00",
    "content": [
        {
            "text": "Paul Wilkinson and Danielle Vincent share their experience of their teams working together to make information on GOV.UK simpler and clearer for cattle keepers."
        },
        {
            "text": "We have information on GOV.UK to explain the rules cattle keepers must follow to help prevent and contain the outbreak of disease in their herd. Our teams have been working together to make that information easier to find and understand."
        },
        {
            "heading": 2,
            "text": "Why clear guidance is important "
        },
        {
            "text": "It matters that cattle keepers understand the guidance on GOV.UK. It’s the rules they must follow by law."
        },
        {
            "text": "As Paul explains:"
        },
        {
            "text": "“While GOV.UK isn’t the only place cattle keepers go to get this information, as the authority on the subject, I believe we have a duty to provide clear guidance and give those that use it a good experience."
        },
        {
            "text": "“If we make the rules to find and understand, we’re giving cattle keepers the best chance of complying with them.”"
        },
        {
            "heading": 2,
            "text": "Starting out"
        },
        {
            "text": "Before making improvements to the guidance, we wanted to understand any potential challenges users had with it."
        },
        {
            "text": "We started with some research with call centre handlers to understand what keepers call about most often and then moved onto research with keepers themselves."
        },
        {
            "text": "User research and data are vital to the work of a content designer as Danielle explains:"
        },
        {
            "text": "“These insights are integral to our work and help to make sure we’re improving the right things. Without this information, you can be stabbing in the dark.”"
        },
        {
            "text": "Paul found the user research process enlightening:"
        },
        {
            "text": "“It was so interesting to hear how the users of the guidance work with it and the problems they had. We also gained useful insights into their perceptions of the rules themselves."
        },
        {
            "text": "“One interesting thing we found was the importance of explaining why the rules are there in the first place. While it seems obvious to us, that wasn’t coming through in the guidance and it was making users question the importance of following them.”"
        },
        {
            "heading": 2,
            "text": "How we’ve worked together"
        },
        {
            "text": "Once we understood the problems, we were able to work on improvements together."
        },
        {
            "text": "We respected each other’s expertise, with content designers focusing on the writing and structuring of the guidance. Paul, and his colleagues Moira Banks and Steve Cullen, concentrated on checking it was factually accurate."
        },
        {
            "text": "The focus had been making the guidance simpler and clearer."
        },
        {
            "text": "As Danielle explains:"
        },
        {
            "text": "“We know our users don’t have the time  to spend lots of time wading through information. We’ve worked with Paul and his team to translate the policy and legislation into guidance that’s quicker and easier to understand and digest, without changing meaning.”"
        },
        {
            "text": "Paul has seen real value in this approach:"
        },
        {
            "text": "“Content designers always come at it from a user’s perspective, which can make you see things differently. We realised that we’d written the guidance and arranged it in a way that had made sense to us. But this didn’t always make sense to the person using it.”"
        },
        {
            "heading": 2,
            "text": "What we’ve done"
        },
        {
            "text": "We’ve redrafted and published more than 20 cattle tracing pages on GOV.UK and archived 11."
        },
        {
            "text": "A big focus has been on using plain English and breaking up the text, making it easier to understand, scan and digest."
        },
        {
            "text": "We also:"
        },
        {
            "text": "We’ve improved the ‘collection page’ - a landing page for all cattle tracing rules. This is a great place for keepers to start."
        },
        {
            "text": "We’ve also created a new page about the rules keepers must follow when moving cattle. Previously this information was scattered across pages, and we’ve brought it together in one place."
        },
        {
            "heading": 2,
            "text": "Not just words"
        },
        {
            "text": "Content designers also improved the guidance by mapping the ‘user journey’ - how users interact with and navigate through the guidance on GOV.UK."
        },
        {
            "text": "As Danielle explains:"
        },
        {
            "text": "“This work helped us to remove duplication and make sure there’s always a clear onward and backward journey. The aim is to make it much easier for users to navigate their way through the guidance.”"
        },
        {
            "text": "We also worked with the county parish holding (CPH) number team at RPA to improve the letters they send to customers when they first get a CPH number."
        },
        {
            "text": "This means that users will get consistent messaging and hopefully have a smooth journey between the information they get sent and the information they find online."
        },
        {
            "heading": 2,
            "text": "What next"
        },
        {
            "text": "Publication is not the end of the story. We plan to take what we’ve learnt so far and apply it to other areas of farming information on GOV.UK, starting with pig, sheep and goat tracing rules."
        },
        {
            "text": "And we’ll be continuing to improve the information for cattle keepers based on feedback."
        },
        {
            "text": "For Danielle, an overriding principle is better, not perfect."
        },
        {
            "text": "“I’m a perfectionist but I’ve had to let go of the idea of creating ‘perfect’ guidance. What works for some doesn’t work for others. Things change."
        },
        {
            "text": "“There will always be improvements we can make, and we’ll be looking to feedback and data to do this.\""
        },
        {
            "heading": 2,
            "text": "How you can help"
        },
        {
            "text": "When you’re on GOV.UK, make use of the ‘Is this page useful?’ banner at the bottom of the page. This is just one of the ways content designers track how well a page is working and make improvements based on comments."
        },
        {
            "text": "We’d love to hear from any pig, sheep or goat keepers who’d be interested in taking part in research to help us improve the information for them on GOV.UK. Contact farmingcontent@defra.gov.uk"
        },
        {
            "text": "If you’d like to take part in regular research, you can register your interest to join the farming user research panel."
        }
    ]
}