{
    "url": "https://civilservice.blog.gov.uk/2025/06/13/carers-week-9-15-june-2025/",
    "title": "Carers Week (9-15 June 2025)",
    "authors": [
        "Rebecca Sudworth, Director of Policy, Food Standards Agency"
    ],
    "categories": [
        "Health & Wellbeing"
    ],
    "pub_date": "2025-06-13T12:35:43+00:00",
    "content": [
        {
            "text": "Introduction by Rebecca Sudworth of the Food Standards Agency, Deputy Carers Champion for the Civil Service."
        },
        {
            "text": "Today marks the start of Carers Week 2025 - In the Civil Service, around a fifth of our colleagues are carers. They combine work with looking after an elderly relative, a child with a disability, another family member or friend who depends on their support. "
        },
        {
            "text": "It is really important that we support carers. This benefits both the carer and the workplace, making sure we don’t lose skills and experience. Our aim is to help people undertake their caring responsibilities while at the same time feeling engaged and productive in the work they do. This is part of our ambition to become the UK’s most inclusive employer, as set out in our Diversity and Inclusion Strategy."
        },
        {
            "text": "Just like Emma, whose story you can read below, it was a long time before I thought of myself as a ‘carer’. But, when I did, it opened up new connections, support and information that have been a big help as I’ve progressed in my career within and outside the Civil Service. "
        },
        {
            "text": "If you are a carer, please reach out to your manager for support and look on your intranet for the resources available to help you with this. The Carers Passport is a simple communication tool that enables you and your manager to discuss and document the flexibilities needed to combine caring and work."
        },
        {
            "text": "If you are a manager of a carer, it is important to know about the support available to carers in your department, for example, carers leave. You should be as flexible as you can, listen empathetically to the challenges they face and, when things change, work with the carer to amend their Carer’s Passport. Look out for the line manager toolkit on your intranet. "
        },
        {
            "text": "Chris, Emma, Vivien and Jacob have shared their caring stories as part of Carers Week. Read below how they combine work and caring and the benefits this has brought to them and their workplace.   "
        },
        {
            "text": "Chris Spencer"
        },
        {
            "text": "I’m a Content Designer as well as carer to my teenage son who has complex autism, severe ADHD, the whole spectrum of sensory processing disorders and more. He can be impulsive, does not recognise when he is ill until he’s seriously poorly, lacks awareness or understanding of safety or consequence and needs a high level of supervision for his own and others’ safety."
        },
        {
            "text": "The support I receive from my team allows me to flex and respond when my plans can (and do) change in the blink of an eye, without it I wouldn't be able to thrive or even stay in work. As a carer, I bring empathy to work, alongside an understanding that events and circumstances are not always fixed, and that it’s a good thing to be able to react to that when it happens. I've also learnt a tremendous amount about supporting those with neurodiversity related issues and I share that knowledge with my colleagues enabling all of us to design content that works more effectively for all."
        },
        {
            "text": "Emma Thraves-Ferguson"
        },
        {
            "text": "I support Fast Streamers and their managers to navigate their way through the scheme."
        },
        {
            "text": "I also care for both my daughter who has complex needs and severe trauma responses and my son who is autistic, but didn’t realise I was a ‘carer’ until around 9 years ago. My daughter is now 24 and in supported living. She has two staff 24/7 which certainly made me reflect on how I managed for so long with so little support. I am still a carer and I lead on all professional interactions for her and speak with her staff daily. "
        },
        {
            "text": "Joining the Civil Service after a career in education has been life changing for me. Having a Carers Passport has enabled me to openly discuss the real pressures I face and get support from my line manager. I am trusted to work flexibly to manage my caring and feel empowered to request special leave when I need to. As a carer, guilt is a key emotion and the support I have at work enables me to put this to one side and focus on my job. Due to my experiences, I am a master at juggling different aspects of my work, advocating for others and responding swiftly in times of crisis. I bring a high level of resilience and a real understanding of public service and the impact that policies have on the ground. My manager has been pivotal in making me feel valued and this means I believe in my ability and am dedicated to making a difference in the Civil Service."
        },
        {
            "text": "Vivien"
        },
        {
            "text": "I support analysts to inform decisions at all levels of government. I am also a carer for my 12 year old son who has complex needs; a severe learning disability rooted in a rare genetic condition and autism, alongside the lifelong effects of early trauma. Like many parent carers it took me a while to realise that I was a carer as well as a parent, handling additional, often unpredictable, practical, emotional and financial worries beyond those usual to parenting."
        },
        {
            "text": "An understanding and informed line manager has been key to me staying in work. By using the Carer Passport as a springboard to proactively and regularly discuss working patterns and locations they have made it easier to make flexible working requests and access Special Leave instead of using up holiday days and burning out. With a compressed hybrid work pattern in place to enable me to attend medical appointments and manage changes to support services for my son I can work. In return, my unit continues to benefit from my specialist knowledge developed over a long career."
        },
        {
            "text": "Carers bring so much to a workplace - my experiences make me a better team player and mentor. I know firsthand how to advocate for those struggling to be heard and have a passion for delivering people-centric services. Flexibility and adaptation in difficult situations - that's me!"
        },
        {
            "text": "Jacob Cain"
        },
        {
            "text": "I work on intergovernmental relations, but I am also a secondary carer for my younger brother who has a complex set of needs including learning disabilities and autism. Being a sibling carer means I’ve known nothing but being a carer my whole life."
        },
        {
            "text": "Being a carer is very hard, it demands resilience, empathy, patience, kindness, and great judgement. These qualities can absolutely make carers an asset to the work we do as civil servants. I feel I use the skills I have grown as a carer every day in my work. "
        },
        {
            "text": "Positive support which has helped me at difficult moments have been those managers who have done what might seem simple things, but simple things that can have such a big impact - kindness, understanding and listening."
        }
    ]
}