{
    "url": "https://charitycommission.blog.gov.uk/2025/06/13/lancashire-charities-making-a-difference/",
    "title": "Lancashire charities making a difference",
    "authors": [
        "Mark Simms OBE"
    ],
    "categories": [
        "Trustees",
        "Volunteering"
    ],
    "pub_date": "2025-06-13T15:10:27+01:00",
    "content": [
        {
            "text": "There’s something uniquely grounding about visiting a charity where the work isn’t just talked about, it’s happening. No slides, no theory, just people coming together to tackle the stuff that matters deeply to our communities. "
        },
        {
            "text": "This week I’ve been in Lancashire, meeting trustees, volunteers and staff across a wide range of local charities. Most of them are small. All of them are under pressure. But every one of them is making a difference and doing so with care, creativity and relentless energy."
        },
        {
            "text": "I imagine some charities might raise an eyebrow when they get a call saying the Chair of the Charity Commission is popping by. It’s not part of any formal regulatory inspection or audit – it’s not that kind of visit. It’s a chance to shine a light on the brilliant work happening in communities and to make sure those of us in national roles don’t lose sight of what charity actually looks like on the ground."
        },
        {
            "text": "And frankly, it’s also a chance for me to hear directly from people at the heart of this work: trustees, staff, volunteers and people who use those services. I want to hear what’s going well, what’s not, and how the Commission can do better in its own work. Regulation is only one part of our role. We should also be champions for the value and contribution of charities, and we can’t do that well from behind a desk."
        },
        {
            "text": "In Blackpool I visited:"
        },
        {
            "text": "Streetlife – a youth charity offering emergency shelter and support to young people who are homeless or at risk. They walked me through their work with quiet pride and showed me how they were preparing for ‘Blackpool in Bloom’. You can’t underestimate what it means for a young person to have a safe space that also believes in them"
        },
        {
            "text": "Blackpool Carers Centre – who support unpaid carers of all ages. Their centre includes a garden and activity space where carers can take a breath, stretch out a bit, and focus on themselves for a change. It was a calm and hopeful place, where the trustees that I met told me proudly of how they founded the organisation and why it's still as vital now"
        },
        {
            "text": "Renaissance UK – a specialist charity supporting people experiencing issues with drug use and sexual health. The staff and volunteers talked honestly about the challenges but also about the solidarity they feel with the people they support. This is community work at its sharpest edge, often with people who need the most support but often don't realise it"
        },
        {
            "text": "In Preston, I visited:"
        },
        {
            "text": "The Tribal Project – a grassroots, peer-led recovery project with a big heart. They’ve built something that feels safe and empowering for people working through addiction and mental health difficulties. It’s a place where lives are rebuilt, sometimes slowly but always with great care."
        },
        {
            "text": "The Foxton Centre – which offers wide-ranging support to young people, rough sleepers, and vulnerable women. I saw their brand new youth space, co-designed and built by the young people themselves. Not many buildings have that kind of story running through the bricks. I also had the opportunity to wish their CEO, Jeff, well as he is retiring this month. "
        },
        {
            "text": "In each visit, I heard about the real-world challenges facing charities right now – income pressures, staffing worries, and the constant balancing act of doing more with less. No surprise there. But what stood out even more was the sense of purpose and the clarity of mission. These charities might be small, but their impact is anything but."
        },
        {
            "text": "For trustees grappling with funding challenges, I’d gently point towards our financial toolkit for trustees. It doesn’t have all the answers, but it’s a useful framework if you’re trying to steady the ship."
        },
        {
            "text": "It’s heartening to see that despite the changing policy landscapes, the challenge of funding, reach and demand, none of this will defeat people power – the commitment of trustees, staff, and volunteers who keep charities going not for the glory, but because they believe in what they do."
        },
        {
            "text": "In Lancashire this week, I saw that belief in spades and I know it’s mirrored in communities right across England and Wales. As Chair, I’ll keep listening, learning and bringing what I see and hear into the conversations that shape the future of the sector and I’ll keep turning up to see first hand the breadth and depth of the contribution charities make to this country. "
        }
    ]
}