{
    "url": "https://environmentagency.blog.gov.uk/2025/06/13/raising-the-standard-for-water-efficiency-in-the-east-of-england/",
    "title": "Raising the standard for water efficiency in the east of England ",
    "authors": [
        "defrablogs"
    ],
    "categories": [
        "Climate change",
        "Drought",
        "Environment Agency",
        "Water"
    ],
    "pub_date": "2025-06-13T13:23:36+00:00",
    "content": [
        {
            "text": "Water is essential for people, businesses and the environment. Unless it is carefully managed, England will run out of this precious resource at the times we most need it. As demand for water increases in response to population growth, the impacts of climate change and the servicing of new technologies, such as the cooling of data centres powering AI, doing nothing is not an option. "
        },
        {
            "text": "As the driest region in England, and the one of the fastest growing, the east of England is on the frontline of water scarcity challenges that are threatening future development and the region's delicate ecosystems.   In response, the Environment Agency is working with Natural England, Local Authorities and regional water companies to launch the Shared Standards for the Water Efficiency in Local Plans initiative. This collaborative approach aims to balance growth and environmental protection in one of England's driest regions.  "
        },
        {
            "text": "What are the Shared Standards? "
        },
        {
            "text": "The Shared Standards provide recommendations on water efficiency policies that Local Planning Authorities (LPAs) can put into their local plans - strategic documents that guide future development - to require new homes to be built to more stringent standards for water efficiency.  "
        },
        {
            "text": "The standards recommend between 85 and 95 litres per person per day (l/p/d) for new housing, rather than the current of 110 (l/p/d). They will also encourage non-domestic buildings to include water-saving measures and water reuse in their designs. "
        },
        {
            "text": "If the Shared Standards are adopted by LPAs and the recommendations are followed, developers will need to design their development to comply with the water efficiency standards in local plan. "
        },
        {
            "text": "What is the role of water companies? "
        },
        {
            "text": "Water companies across the region are working together, as Water Resources East, to be proactive in supporting LPAs to secure water efficient policies in their local plans to achieve positive environmental outcomes. This covers a range of measures including advice, case studies and emerging evidence. Water companies also provide environmental incentive schemes to promote water efficiency and reduce costs for developers that sign up to these. "
        },
        {
            "text": "What is the Environment Agency’s role? "
        },
        {
            "text": "As the environmental regulator responsible for water resources, the Environment Agency plays a pivotal role in this initiative, providing crucial evidence and expertise.  In the Shared Standards the Environment Agency has identified key evidence from Water Resources Management Plans that support the case for more stringent water efficiency standards to support protection and recovery of waterbodies and to support growth. "
        },
        {
            "text": "The Environment Agency has also worked with water companies, Natural England and LPAs to set the water efficiency targets and measures needed to protect water resources in the region. These recommendations are based on rigorous modelling, water resources management plans, and findings from projects like Enabling Water Smart Communities. "
        },
        {
            "text": "As the Shared Standards are rolled out, Environment Agency planning officers will support LPAs who want to adopt the approach in the guidance to help them identify the appropriate water efficiency threshold and evidence to justify it. "
        },
        {
            "text": "What impact will the Shared Standards have on development in the east of England? "
        },
        {
            "text": "The main objective of the Shared Standards is to enable sustainable development by ensuring there is enough water to go around for all the developments being planned in this rapidly growing region, alongside protection and enhancement of the water environment. "
        },
        {
            "text": "The east of England's precious ecosystems are at risk of deterioration due to a potential lack of water. The Shared Standards have been developed to provide the evidence decision makers need to enable development in this water stressed geography.  "
        },
        {
            "text": "Is it possible to live on 85 litres, per person, per day? "
        },
        {
            "text": "Water efficient toilets, taps, showers and appliances, such as dishwashers and washing machines, are now widely available enabling a new property to achieve the 85 l/p/d target that the Shared Standards recommend. This will become easier to achieve for existing properties when the Government implements the mandatory water efficiency labelling scheme.  "
        },
        {
            "text": "With the water incentives in place and the reduced costs to water users, creating water efficient homes is a win win for developers and is already happening in many parts of the country.  "
        },
        {
            "text": "Clay Farm in Cambridge is just one example. The development of 208 dwellings includes an integrated water management scheme comprising sustainable urban drainage, community rainwater harvesting and water efficient fixtures and fittings reducing consumption to below 80 l/p/d.  "
        },
        {
            "text": "Added to that, there are moats that can store, and attenuate rainwater captured from rooves, hardstanding and roads. This rainwater is pre-treated in a reed bed before it enters a concrete tank. Eventually, following some filtration, it ends up being used to flush the development’s toilets.  "
        },
        {
            "text": "Is this the future of water efficiency? "
        },
        {
            "text": "The adoption of the Shared Standards will make water efficient developments like Clay Farm a common site across the east of England, ensuring we can balance the water needs of people that live and work in the region. With a sustainable supply of water we have an opportunity to create a stronger economy and a healthier and thriving environment. "
        },
        {
            "text": "The Shared Standards can be read here.  "
        }
    ]
}