{
    "url": "https://dcmslibraries.blog.gov.uk/2025/06/13/the-partnership-between-salford-libraries-and-salford-jobcentres/",
    "title": "The Partnership Between Salford Libraries and Salford Jobcentres",
    "authors": [
        "Paula Powell, JCP Senior Operations Leader, Greater Manchester"
    ],
    "categories": [
        "Case study"
    ],
    "pub_date": "2025-06-13T16:34:49+01:00",
    "content": [
        {
            "text": "Public library partnerships with other organisations can be hugely rewarding - for both sides. Last week, we celebrated the role libraries play in sustaining economic growth as this year’s theme for Libraries Week. This is evident in the partnership between Salford Libraries and Salford Jobcentres which we’re shining a spotlight on today as an example of how both parties can maximise their impact and connect with local communities. "
        },
        {
            "text": "🌟 Strengthening Community Support: The Partnership Between Salford Libraries and Salford Jobcentres"
        },
        {
            "text": "In today’s interconnected world, local partnerships are more important than ever in helping individuals navigate the path to employment and personal development. One inspiring example of this is the collaboration between Salford Libraries and Salford Jobcentres—a partnership that’s making a real difference in the lives of jobseekers across the city."
        },
        {
            "text": "🤝 A Shared Mission"
        },
        {
            "text": "At the heart of this partnership is a shared commitment to empowering individuals through accessible, community-based support. By combining resources and expertise, Salford Libraries and Jobcentres are creating a more connected and supportive environment for those seeking work or looking to improve their skills."
        },
        {
            "text": "📅 Promoting Events and Activities"
        },
        {
            "text": "One of the standout features of this collaboration is the sharing of event timetables. Salford Libraries regularly provide their schedules to local jobcentres, ensuring jobseekers are kept up to date with:"
        },
        {
            "text": "This proactive approach helps individuals stay engaged and informed about opportunities that can aid their job search and boost their confidence."
        },
        {
            "text": "🏛️ Hosting Jobcentre Sessions in Libraries"
        },
        {
            "text": "Libraries across Salford, such as Worsley Library, are also stepping up as venues for Jobcentre-run sessions. A great example is the ESOL (English for Speakers of Other Languages) classes hosted in library spaces. These sessions offer a welcoming and familiar environment, making it easier for participants to attend and benefit from the support available"
        },
        {
            "text": "🧠 Myth-Busting Universal Credit"
        },
        {
            "text": "Understanding Universal Credit can be a challenge—not just for jobseekers, but also for those supporting them. To bridge this gap, Partnership Managers and Employment Advisers from the Jobcentre have delivered myth-busting sessions for library staff. These sessions:"
        },
        {
            "text": "🌱 Building a Stronger Community"
        },
        {
            "text": "This partnership is more than just a practical arrangement—it’s a model for how community resources can work together to create lasting impact, by:"
        },
        {
            "text": "💬 Final Thoughts"
        },
        {
            "text": "The collaboration between Salford Libraries and Salford Jobcentres is a great example of community partnership in action. It shows how, by working together, local services can create a more inclusive, informed, and empowered community."
        },
        {
            "text": "The Department for Work and Pensions is working closely with Libraries Connected on connecting libraries with DWP services. For further information and support for libraries interested in cultivating similar local partnerships, please contact dcmslibraries@dcms.gov.uk "
        }
    ]
}