{
    "url": "https://educationhub.blog.gov.uk/2025/06/what-does-the-spending-review-2025-mean-for-education/",
    "title": "What does the Spending Review 2025 mean for education? ",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "early years",
        "Schools",
        "Skills"
    ],
    "pub_date": "2025-06-13T11:37:16+01:00",
    "content": [
        {
            "text": "On Wednesday 11 June, the Chancellor delivered the next steps of the government’s Spending Review. "
        },
        {
            "text": "A Spending Review is the process the government uses to set all departments’ budgets for future years. This covers both the services the public uses every day, like the NHS, schools and colleges, and transport, and how the government will invest in research, energy security and infrastructure. "
        },
        {
            "text": "In the same way that households budget what they spend, the government does this with public money to make sure it is spent effectively. This Spending Review sets out what the Department for Education and other departments have to spend from 2026-2027 to 2028-2029."
        },
        {
            "text": "Here we explain what the Spending Review 2025 means for early years, schools, colleges, skills and children’s social care.  "
        },
        {
            "heading": 3,
            "text": "Is there more money for schools in the Spending Review? "
        },
        {
            "text": "Funding for schools will rise by £4.7 billion per year by 2028-29. This includes the funding that we’ve already announced for the recent teacher pay award. This additional funding will take funding per pupil to its highest ever level and allow us to transform the SEND system with further details to be set out in the Autumn.     "
        },
        {
            "heading": 3,
            "text": "Is there new money for the roll out of free school meals for all children on Universal Credit? "
        },
        {
            "text": "Yes. The expansion of free school meals to all families who get Universal Credit will be supported through an increase in the core schools and 16-19 budgets. "
        },
        {
            "text": "This will pull 100,000 children across England out of poverty. Evidence suggests giving children access to a nutritious meal during the school day leads to higher attainment, improved behaviour and better outcomes. "
        },
        {
            "heading": 3,
            "text": "Will there be new investment in fixing school and buildings? "
        },
        {
            "text": "The School Rebuilding Programme will continue with £2.4 billion invested annually over the next four years, committing to the current programme of rebuilding over 500 schools across all regions of England.  We are committed to expand the School Rebuilding Programme, and will set out more details in the upcoming 10-year Infrastructure Strategy."
        },
        {
            "text": " For the first time, funding for school building maintenance will increase yearly with inflation, reaching approximately £2.3 billion by 2029-30 to improve the condition of school estates throughout the country. "
        },
        {
            "text": "We are also making available £2.6 billion from 2026-27 to 2029-30 to fund mainstream school places needed to meet the needs of the future."
        },
        {
            "text": "In the coming weeks we will we’ll set out further details on how funding will help ensure the further education estate is fit for purpose. "
        },
        {
            "heading": 3,
            "text": "Will further education and skills get more funding? "
        },
        {
            "text": "We are opening up opportunities for young people to build skills, drive up their income, supporting economic growth, and reducing our reliance on international labour.    "
        },
        {
            "text": "We are supporting young people into priority sectors like construction, through new foundation apprenticeships and £1.2 billion of additional investment per year in skills by 2028-29.  "
        },
        {
            "text": "This includes funding to support up to 1.3 million 16-19-year-olds each year – including 65,000 additional learners per year by 2028-29 – to access high quality education and training.  "
        },
        {
            "text": "We will publish our plans for higher education reform, as part of our Post-16 Education and Skills Strategy, in due course. "
        },
        {
            "heading": 3,
            "text": " How is the government supporting early years children?  "
        },
        {
            "text": "The 30 hours of free childcare offer continues to be funded, saving families up to £7,500 a year. This helps parents work while ensuring children get quality early education. "
        },
        {
            "text": "Free breakfast clubs are already available in 750 primary schools across England, with plans to roll them out nationwide. These clubs give children a healthy start to the day and help parents with morning childcare. "
        },
        {
            "text": "Nearly £370 million will be invested in building and expanding School-Based Nurseries from 2026 to 2030, creating more local childcare places for families. "
        },
        {
            "text": "Family hubs are being expanded to provide one-stop support for parents from pregnancy onwards. These hubs offer health checks, parenting advice, and early learning activities to help children develop the skills they need for school. "
        },
        {
            "text": "All these investments work together to support children’s development and make childcare more affordable and accessible for families across England. "
        },
        {
            "heading": 3,
            "text": "Is there money for children’s social care? "
        },
        {
            "text": "We’re investing £555 million over the next 2 years in partnership with Ministry for Housing, Communities and Local Government (MHCLG) to reform children's social care."
        },
        {
            "text": "This funding will help keep more families safely together through better early support, improve services for children already in care, and provide better support for young people leaving care "
        },
        {
            "text": "Additionally, over £560 million in capital funding will be provided over the next 4 years to refurbish and expand existing children's homes, create new foster care placements and fix problems in the care system that have left many children without suitable places to live."
        },
        {
            "text": "This combined investment of over £1.1 billion aims to transform the support available for our most vulnerable children and young people, making sure they have safe and stable homes and the care they need to thrive. This comes in addition to investment of more than £500 million per year announced for children's social care reform as part of the recent local government finance settlement. "
        }
    ]
}