{
    "url": "https://socialworkwithadults.blog.gov.uk/2017/12/18/two-great-opportunities-to-shape-social-works-future/",
    "title": "Two great opportunities to shape social work's future",
    "authors": [
        "Lyn Romeo"
    ],
    "categories": [
        "Consultation and engagement"
    ],
    "pub_date": "2017-12-18T12:23:10+00:00",
    "content": [
        {
            "text": "Have your say in improving the future of Social Work for Adults in England"
        },
        {
            "text": "Are social workers making a positive difference in people’s lives and could they be even more effective in their work?"
        },
        {
            "text": "And likewise, how do those who offer social work services know that they are adding value and improving outcomes?"
        },
        {
            "text": "What could we do to improve practice so that it really does support people to have the best possible lives?"
        },
        {
            "text": "I really want to hear from people who don’t always get a chance to influence the questions we should be asking about social work; people from black and minority ethnic backgrounds, older people and their families; young carers of adults and social work students."
        },
        {
            "text": "We really need your help. We have set up a survey to find out what you think social workers who work with adults need to know and should be able to do."
        },
        {
            "text": "I feel strongly that the development and use of research and evidence has a central role in improving social work and professional practice. It is our duty and desire to get it right for the people we are here to serve."
        },
        {
            "text": "I hope you will be willing to help."
        },
        {
            "text": "Please visit our James Lind Alliance project website to complete the survey before 14 January 2018 and help us influence future research in social work."
        },
        {
            "text": "Sound and vision: You can watch the filmed version of this request here."
        },
        {
            "text": "Knowledge and skills consultation for adult social work supervisors"
        },
        {
            "text": "A brief reminder that this important consultation into how best we can help social work supervisors demonstrate and support best practice is open until 26 January 2018."
        },
        {
            "text": "Supervisors create the reflective practice spaces within which practitioners can learn, improve their person centred practice, and grow in confidence (see my original blog for more details). Help me, help them, to help you!"
        }
    ]
}