{
    "url": "https://rtau.blog.gov.uk/2025/01/22/continuing-to-drive-responsible-adoption-of-technology/",
    "title": "Continuing to drive responsible adoption of technology",
    "authors": [
        "Responsible Technology Adoption Unit"
    ],
    "categories": [
        "Responsible innovation"
    ],
    "pub_date": "2025-01-22T12:03:43+00:00",
    "content": [
        {
            "text": "Since its establishment as the Centre for Data Ethics & Innovation in 2018, the Responsible Technology Adoption (RTA) Unit has provided a hub driving government’s work on responsible use of technology across both the public sector, and the broader economy, working closely with a range of teams across government and beyond."
        },
        {
            "text": "Now that we have set up the expanded Government Digital Service (GDS) and the AI Opportunities Unit within DSIT, the work of RTA will be integrated into these functions. As a result, this blog will no longer be updated."
        },
        {
            "text": "RTA’s key areas (and associated team members) are now embedded across DSIT as follows:"
        },
        {
            "text": "These changes are intended to strengthen DSIT’s focus on all aspects of responsible technology adoption, ethics and assurance by deploying specialists close to work to drive adoption of AI and digital technologies."
        },
        {
            "text": "Thank you to everyone who has engaged with us since the inception of this work under the former Centre for Data Ethics and Innovation in 2018. We will continue this engagement from across the department, and will soon share further information on a Responsible AI Advisory Panel to be established by the new GDS."
        },
        {
            "text": "Where to Find More Information"
        },
        {
            "text": "You can read more on the expanded Government Digital Service (GDS) which unifies the work of multiple units, including some of RTA’s, in the blueprint for modern digital government."
        },
        {
            "text": "See also government’s new plan to leverage technology to streamline public services, eliminate delays and reduce costs."
        },
        {
            "text": "You can also find information on previous work on the Responsible AI Toolkit, a toolkit for practitioners to support the responsible use of AI systems."
        },
        {
            "text": "Stay updated on DSIT’s work via the GOV.UK page and on LinkedIn for updates."
        }
    ]
}