{
    "url": "https://traderemedies.blog.gov.uk/2025/01/22/how-the-tra-uses-data/",
    "title": "How the TRA uses data",
    "authors": [
        "georgie"
    ],
    "categories": [
        "Engagement",
        "Investigations",
        "Policy",
        "Pre-application office"
    ],
    "pub_date": "2025-01-22T15:44:53+00:00",
    "content": [
        {
            "text": "The TRA is an evidence- and data-led independent authority. The quality of data collected during a case will have a real impact on its outcome, as this information is the basis for the decisions made by the Secretary of State when we present our findings and recommendations. "
        },
        {
            "text": "We recently held a webinar for anyone who was interested in finding out more how the TRA operates and manages industry data in its investigations. "
        },
        {
            "text": "Weichao Wang, TRA Head of Data, explained: "
        },
        {
            "text": "“Our mission as an organisation is to defend the UK from unfair international trade practices and what really underpins that is our investigations. To allow our investigations to be fair, impartial, rigorous, and efficient, we must have good data to use as evidence.” "
        },
        {
            "text": "We were also joined by Sarah Avery, who leads our Technical Support Function within our Pre-Application Office (PAO). Engagement with the PAO is the first interaction with the Trade Remedies Authority and is an important step on the data collection journey.  "
        },
        {
            "text": "With data provided from the business or industry, the PAO will look for evidence of: "
        },
        {
            "text": "The data can also give early indications of who the potential measure might affect and how. Sarah explained:  "
        },
        {
            "text": "“That's why it's really important that we hear from people on the production side, but also from importers, downstream users, upstream users and gather their data to really get a full picture of what's happening.” "
        },
        {
            "text": "Sarah and Wei were joined by Dan, Naomi, and Margaret to complete the TRA panel. They all shared interesting insights on how each department uses data.  "
        },
        {
            "text": "What level of support do you offer to smaller businesses who perhaps don't have the resources or the time to trawl through loads of data to find out what they need to submit? "
        },
        {
            "text": "The Pre-Application office is here to advise and direct businesses to the types of things that they’ll need to submit [an application], and we'll check those application forms and provide feedback on those to guide applicants and to explain what further information is needed or answer any questions. But we (TRA) can't go and find that evidence. It's the industry's case to bring as they are the experts in their field. But we can provide guidance around what we're looking for and how that application needs to be submitted. "
        },
        {
            "text": "Once a case is accepted it will be investigated by a dedicated team that includes investigators, analysts, verification advisers, policy advisers and legal experts. One of our Lead Investigators, Naomi Holland joined us to explain how there are different methods of collecting data used by the investigating teams, and how they use that data once collected. "
        },
        {
            "text": "Naomi explained that one of the major sets of data we need are key figures such as “detailed cost and sales data... quantitative financial data that's going to include information on cost of production and transaction level sales data, and that forms the basis of our calculations. "
        },
        {
            "text": "We’re also looking for qualitative information, providing a narrative surrounding the figures provided. This is basically a chance to present your company's narrative of the events”. "
        },
        {
            "text": "These questionnaires go to the parties raising the case, as well as producers, importers, and exporters in order to paint the clearest picture of the situation as possible.  "
        },
        {
            "text": "Sometimes the information provided is inadequate, and these are known as deficiencies. There are three main deficiencies: "
        },
        {
            "text": "Do you receive data that has been falsified for example from overseas companies wanting to play down the level of subsidy subsidisation they received from their governments? "
        },
        {
            "text": "This is why we conduct verification. We have certainly had instances where we've had two different parties registered to the same investigation, providing information that appears to contradict each other. But this is the whole purpose behind why we verify the data that we're given, and we will aim to make sure that we are confident in the data that we're using through these verification activities. "
        },
        {
            "text": "Has there been any user research into the factors that contribute to deficiencies? Is it users’ misunderstanding the question not having the information or deliberately withholding the information? "
        },
        {
            "text": "From a pre application point of view, the industry are having to engage with trade remedies for a lot of industries and so looking particularly to bring applications and things can be quite jargon heavy and the level of information, the detail of information that we need can be quite granular so that can be quite off putting or it can just be quite confusing. "
        },
        {
            "text": "Sometimes it is a case of parties not quite understanding what we've asked for. I think that's something that we are still learning as an organisation with going through a project to rethink about how we structure these questionnaires to simplify and making it easier to understand. "
        },
        {
            "text": "One of our Analyst’s, Dan Moore, explained the Economic Interest Test (EIT) which is a unique part of the TRA’s process for investigation. The EIT explores where a trade measure is in the interest of the UK economy. "
        },
        {
            "text": "“When you're submitting this survey, we'll ask you to write short written answers. This helps us to understand the qualitative decision making of the firms in the market as this helps us inform the EIT. This helps us get the most accurate and relevant data for the investigation”. "
        },
        {
            "text": "Is the EIT considered passed or failed by an estimated absolute value or is it balanced judgement across the affected groups or industry? "
        },
        {
            "text": " It is very much a number of factors. We try to quantify the economic value or the economic impact of each of our measures as much as possible. So, looking at when we look at things like injury, competition, and answers or where there is a feasibility for us to quantify it, we will as a good economist should do. But I said, certain elements of the work that we do sometimes can't be quantified in such a straightforward way.   "
        },
        {
            "text": "Lead Verification adviser, Margaret Shittu, explained how data is used and tested in the verification process. Outlining the importance of the submitted data, Margaret said: "
        },
        {
            "text": "“Verification is the process of assessing the data provided to the TRA for completeness, relevance, and accuracy. These three criteria’s gives us a reasonable level of assurance that over the data and that we may be able to rely on the data.” "
        },
        {
            "text": "You can find out more about the entire verification process here.  "
        },
        {
            "text": "Click here to watch the full webinar with the full Q&A.  "
        },
        {
            "text": "Click here for links to our Pre-app office and public file "
        },
        {
            "text": "If you would like to find out about our next webinars explaining how trade remedies can help in defending UK businesses in international trade follow us on X and LinkedIn."
        }
    ]
}