{
    "url": "https://forestrycommission.blog.gov.uk/2025/01/22/navigating-countryside-stewardship-higher-tier-funding-for-effective-woodland-management/",
    "title": "Navigating Countryside Stewardship Higher Tier funding for effective woodland management",
    "authors": [
        "Becky Hawkey"
    ],
    "categories": [
        "Woodland management"
    ],
    "pub_date": "2025-01-22T08:24:00+00:00",
    "content": [
        {
            "text": "Countryside Stewardship Higher Tier is one the core offers under the Environmental Land Management scheme. It pays farmers and land managers to manage land in a way that:"
        },
        {
            "text": "These are important foundations for sustainable and resilient farming and food production."
        },
        {
            "text": "On 11 December 2024, Defra published guidance outlining the Higher Tier land management practices called 'actions', which will have funding available from 2025."
        },
        {
            "text": "In total there will be 99 revenue base actions and 33 supplemental actions. This blog outlines the actions available to support woodland management in line with the UK Forestry Standard."
        },
        {
            "heading": 2,
            "text": "An approved woodland management plan"
        },
        {
            "text": "Before you can apply for Higher Tier woodland actions, you must have a woodland management plan approved by the Forestry Commission. Your plan should support the management objectives outlined in your Higher Tier application."
        },
        {
            "text": "A woodland management plan provides a structured way to plan and organise the sustainable management of woodland in line with the UK Forestry Standard. The plan of operations allows woodland managers to be issued with a felling licence for 10 years."
        },
        {
            "text": "You can apply for funding to write your plan using the capital item, PA3 Woodland management plan. The minimum eligible land size this item can support has been reduced from 3 hectares to 0.5 hectares, allowing more woodland to come into management."
        },
        {
            "text": "Alongside a woodland management plan, you may need to prepare other plans or studies to support your Higher Tier application such as a species management plan or a feasibility study."
        },
        {
            "heading": 2,
            "text": "Higher Tier woodland actions"
        },
        {
            "text": "The Higher Tier woodland actions consist of one revenue base action (woodland improvement) and 8 supplementary actions."
        },
        {
            "text": "Your local Woodland Officer will discuss and agree what you need to do, specific to your site, to fulfil the aim of an action you intent to apply for. These agreed activities will be set out in your agreement document. "
        },
        {
            "heading": 2,
            "text": "Starting with woodland improvement"
        },
        {
            "text": "CWD2 Woodland improvement is the 10-year revenue base action. To access the woodland supplement actions, you must include this action in your application. It is available on land that meets the definition of woodland and is a minimum size of 0.5 hectares."
        },
        {
            "text": "This base action supports sustainable woodland management in line with the UK Forestry Standard including:"
        },
        {
            "text": "Further detail on what you must to do to receive payment for this action, and all the woodland actions, can be found in the Countryside Stewardship Higher Tier actions guidance."
        },
        {
            "heading": 2,
            "text": "Woodland type supplements"
        },
        {
            "text": "There are three supplement actions to support specific woodland types. These supplements cannot be used on the same area. However, you can apply for them all in your overall application. These supplements are:"
        },
        {
            "heading": 2,
            "text": "Other woodland supplements"
        },
        {
            "text": "The remaining 5 woodland supplement actions can be used to support the management or maintenance of specific features or other objectives. They are: "
        },
        {
            "heading": 2,
            "text": "Additional Higher Tier actions that can be used in woodland"
        },
        {
            "text": "There are further actions available that sit outside of this list of ‘woodland actions’ but can support woodland management objectives relating to:"
        },
        {
            "heading": 2,
            "text": "Capital items to support your woodland management"
        },
        {
            "text": "In addition to the revenue base actions and supplementary actions, you can apply for funding to support capital works in your woodland. Defra have published a list of new capital items available under Higher Tier. You will need to discuss these items with your local Woodland Officer as part of your application."
        },
        {
            "text": "Annex D of the preview guidance outlines which capital items can be used to support your woodland management. Not all these items are currently available."
        },
        {
            "text": "Our recent blog, ‘Getting ready to apply for Countryside Stewardship Higher Tier’, outlined the capital funding that is available to support the production of plans and studies that may be required as part of pre-application. This includes:"
        },
        {
            "heading": 2,
            "text": "An expanded offer for better woodland management"
        },
        {
            "text": "The updated Higher Tier offer increases the support available for woodland management. This includes the"
        },
        {
            "text": "In addition to this, woodland owners can access multiple actions outside of these core woodland actions to support their management activities."
        },
        {
            "text": "By reducing the minimum application size for woodland improvement, from 3ha to 0.5ha, more land managers in England can access funding to support sustainable woodland management in line with the UK Forestry Standard. This will help to manage woodland in a way that greater protects, restores or enhances our environment and mitigate the effects of climate change."
        }
    ]
}