{
    "url": "https://marinescience.blog.gov.uk/2025/01/22/strengthening-marine-science-and-sustainability-the-ocean-country-partnership-programme-in-maldives/",
    "title": "Strengthening Marine Science and Sustainability: The Ocean Country Partnership Programme in Maldives",
    "authors": [
        "angharadelliman",
        "Peter Randall"
    ],
    "categories": [
        "Aquaculture",
        "biodiversity",
        "Climate Change",
        "International",
        "OCPP",
        "Pollution"
    ],
    "pub_date": "2025-01-22T15:31:41+00:00",
    "content": [
        {
            "text": "In October, the Ocean Country Partnership Programme (OCPP) team from Cefas visited the Maldives to enhance local expertise in the collection of data from fishers, water quality monitoring and OSPAR methods of beach monitoring. The visit began with adverse weather requiring the team to modify their plans for various fieldwork activities."
        },
        {
            "text": "Malé harbour sign"
        },
        {
            "text": "The Ocean Country Partnership Programme (OCPP) is a bilateral technical assistance and capacity building programme that provides tailored support to countries to manage the marine environment more sustainably, including by strengthening marine science expertise, developing science-based policy and management tools and creating educational resources for coastal communities. The OCPP delivers work under three thematic areas: biodiversity, marine pollution, and sustainable seafood. Funding is provided through the Official Development Assistance (ODA) overarching Blue Planet Fund (BPF) by the UK Department for the Environment, Food and Rural Affairs (Defra) and delivered collaboratively by the Centre of Environment, Fisheries and Aquaculture Science (Cefas), Marine Management Organisation (MMO) and Joint Nature Conservation Committee (JNCC)."
        },
        {
            "text": "Stormy skies over Malé harbour (Top) and flooded Malé high street (Bottom)"
        },
        {
            "text": "Abandoned Lost and otherwise Discarded Fishing Gear (ALDFG)"
        },
        {
            "text": "Peter Randall, OCPP pollution lead for Maldives, and Anthony Gallagher from Evolved Research and Consulting Ltd (ERC) have launched a national ALDFG baseline data collection project. They developed a fisher questionnaire with non-governmental organisation (NGO) SIGS (Small Island Geographic Society) and refined it with Dr. Ahmed Riyaz Jauharee, Dean of the College of Fisheries and Ocean Sciences in the Maldvies. Dr. Jauharee’s expertise on the bait fishery and Fish Aggregation Devices (FADs) enhanced the survey."
        },
        {
            "text": "The team also met with Adam Manik from the Ministry of Fisheries to discuss the project and gain insights into Maldives fisheries. Adam, along with Abdulla Shakir of the Maldives Fishing Association, will now lead the survey data collection. Their deep knowledge of local fisheries and strong connections with fishers will be critical to the project’s success."
        },
        {
            "text": "The locations of the national landing sites where the ALDFG fisher survey will be delivered (Left), some of the ALDFG survey questions (Right)"
        },
        {
            "text": "The OCPP ALDFG team visited Hai Fishing Tackles one of the main fishing gear suppliers in Malé to get a better understanding of the fishing gears used in the handline, pole and line, and the bait net fisheries. Hai provided data on various gears that will aid the ALDFG survey, enabling the identification of any domestic ALDFG litter when conducting beach monitoring."
        },
        {
            "text": "Some examples of nets used in the bait fishery (Left), various monofilament lines used in both hand line and pole and line fisheries in Maldives (Right)."
        },
        {
            "text": "The team also met with Isha Afeef of the Olive Ridley Project (ORP) to discuss ORP’s decade-long work on turtle entanglement in ALDFG and their standard sampling protocol. ORP agreed to share their data to support validation of the ALDFG fisher survey."
        },
        {
            "text": "The team then moved on to Himmafushi Island, Kaafu Atoll, a key fish landing site in Central Maldives, to pilot test and refine the fisher survey, producing a final polished version."
        },
        {
            "text": "Wall artwork located at Himmafushi harbour demonstrating local awareness of the marine litter issue."
        },
        {
            "text": "With support from Big Fish Maldives Pvt Ltd, the OCPP team began pilot testing the Maldives ALDFG survey. Despite infrequent landings and the quick turnaround of vessels targeting baitfish and tuna, several test surveys were successfully completed. This allowed the team to refine the survey tool for full implementation in the coming months."
        },
        {
            "text": "Freshly caught yellow fin tuna on the deck of a fishing vessel."
        },
        {
            "text": "The captain of the fishing vessel Faridhuveli 4 commented “Although we may not directly get anything from participating in the ALDFG survey, my hope is that ultimately fishers will benefit from the outcomes of this project”."
        },
        {
            "text": "SIGS complete pilot runs of the ALDFG survey with fishers landing at Himmafushi."
        },
        {
            "text": "Beach Monitoring training"
        },
        {
            "text": "With temperatures feeling like 40°C due to humidity, beach monitoring training took place at dawn on Himmafushi’s Jail Break beach. A 50m section was marked using GPS, and Peter demonstrated the OSPAR beach monitoring method to Hamza Moosa and Zara Athif of SIGS. The team profiled the beach, collected litter larger than 5cm, categorised it, weighed each category, and ensured proper disposal."
        },
        {
            "text": "Beach litter monitoring training (Left), Peter Randall demonstrates litter collection and categorisation to SIGS (Right)"
        },
        {
            "text": "ALDFG Outreach"
        },
        {
            "text": "On their return to Malé the OCPP team had a final meeting with SIGS to discuss the future outreach plan on completion of the national ALDFG baseline data collection survey. Outreach will be conducted in 3-4 locations near landing sites across the Maldives to fishers and other relevant stakeholders in Autumn 2025, followed by a national ALDFG conference in Malé."
        },
        {
            "text": "Water Quality (WQ)"
        },
        {
            "text": "Requests for Water Quality support and training from the Environmental Protection Agency (EPA) and Department of Water and Sanitation (DWS) of the Ministry of Environment, Climate Change and Technology resulted in the formation of a water quality team from Cefas consisting of Andy Powell and Michelle Stone  covering microbiological aspects, whilst Tom Hull and Andy Smith covered the water column and chemical pollution aspects."
        },
        {
            "text": "Maldives partners collaborated with OCPP to design and conduct marine surveys assessing the impacts of untreated sewage discharges from offshore outfalls around Greater Malé. The team provided training on identifying physical, chemical, and biological parameters to evaluate impacts on marine ecosystems and human health, ensuring wastewater meets the Utility Regulatory Authority (URA) standards. Additionally, they worked with URA to develop a roadmap for effective measurement and regulation of these standards."
        },
        {
            "text": "EPA’s Research Vessel Thimaaveshi used as a laboratory by Andy Powell and Michelle Stone"
        },
        {
            "text": "The OCPP WQ team started their visit by converting the wet laboratory on board the EPA’s vessel RV Thimaaveshi into a microbiology laboratory enabling the training of EPA staff in the microbiological processing of samples collect on survey."
        },
        {
            "text": "Training of EPA on board the RV Muraka (Left & Bottom Right), OCPP WQ team describing the water quality sampling to the Utility Regulatory Authority (Top Right)"
        },
        {
            "text": "The EPA’s second small vessel the RV Muraka was used for sample collection.  The team conducted water sampling for microbiological analysis; deployment of conductivity, temperature, and depth (CTD); deployment of tryptophan probe; and deployment of Niskin for nutrient samples."
        },
        {
            "text": "Samples for hydrocarbons, metals, and toxicity analysis were collected during the Maldives visit. Hydrocarbon and metals testing was conducted in partnership with a Sri Lankan laboratory to strengthen regional analytical capabilities. Toxicity testing was performed onboard the RV Thimaaveshi using Cefas' refined mobile laboratory."
        },
        {
            "text": "Unexpected issues with the RV Muraka curtailed boat-based work, but the experienced team shifted to a shore-based sampling plan, continuing data collection and training. Two wrap-up meetings followed, presenting findings, discussing next steps, and exploring applications for policy and regulatory improvements. Key topics included data management, monitoring programs, and water quality guidelines."
        },
        {
            "text": "Rifath Naeem, EPA Director, praised the effort: “Thank you very much for the important work we accomplished together. From sample collection to analysis, the entire program went well despite some hiccups with the boat and the weather. I would like to express my appreciation to Andy and the team for their efforts”."
        },
        {
            "text": "These visits advanced efforts to combat marine pollution and equipped Maldivians with skills to monitor the environment and support informed decision-making."
        },
        {
            "text": "Special thanks to all our partners in Maldives and all those who participated in this trip: Cefas’ Peter Randall, Andy Smith, Andy Powell, Michelle Stone and Tom Hull, and ERC’s Anthony Gallagher."
        },
        {
            "text": "Special thanks also to Cefas’ Charlotte Jessop for all her before, during and after the trip support and for acting as the key Cefas Primary Contact (CPC)."
        }
    ]
}