{
    "url": "https://enablingdigitalidentity.blog.gov.uk/2025/01/22/your-feedback-on-the-gamma-0-4-trust-framework/",
    "title": "Your feedback on the gamma (0.4) trust framework",
    "authors": [
        "Charlie Smith",
        "Georgina Wheatley"
    ],
    "categories": [
        "Digital identity",
        "UK digital identity and attributes trust framework"
    ],
    "pub_date": "2025-01-22T17:08:24+00:00",
    "content": [
        {
            "text": "In November, we pre-released the gamma (0.4) publication of the trust framework. We also highlighted that we would be seeking feedback on this latest publication to inform our ongoing work."
        },
        {
            "text": "This post kicks off that engagement cycle, explaining how we will be gathering views over the next fortnight and detailing our planned priorities for further development."
        },
        {
            "heading": 2,
            "text": "Working in the open"
        },
        {
            "text": "The trust framework is being developed iteratively – in consultation with a wide range of stakeholders across the public and private sectors, as well as civil society and academia. We call this ‘open policymaking’. The value of this approach is that it allows us to keep pace with the emerging digital identity market."
        },
        {
            "text": "For instance, the additional role types we introduced for gamma resulted directly from discussions with certified providers. And the strengthened rules on supporting users when things go wrong delivered on clear priorities for our public dialogue participants."
        },
        {
            "heading": 2,
            "text": "Preparing the next trust framework"
        },
        {
            "text": "We’ve only just pre-released the gamma publication, and know that no providers have yet been certified against it. But once the Data (Use and Access) Bill passes later this year, the Secretary of State will have a duty to review the trust framework at least annually. That means we need to start developing the first ‘statutory’ publication now, so that it will be ready to publish soon after the Bill’s passage."
        },
        {
            "text": "As always, we will be continuing with the iterative and collaborative approach we’ve pursued to date. From today, we are therefore welcoming responses to a written survey on the gamma publication and the future direction of the trust framework’s development. You can find a link to the survey at the end of this post."
        },
        {
            "heading": 2,
            "text": "Focusing on the ‘five i's’"
        },
        {
            "text": "While the government’s digital identity principles will continue to underpin our work on the trust framework, we intend to particularly focus on what we’re calling the ‘five i's’ over the next year or so. These five areas we’re targeting for development are:"
        },
        {
            "heading": 2,
            "text": "Stability and Supporting Documents"
        },
        {
            "text": "As we launch this next round of engagement, we want to reassure providers that we remain mindful of the potential business burden of successive changes to the trust framework. The gamma publication recently marked an important step forward, and so we intend to minimise changes to the trust framework this time around."
        },
        {
            "text": "While we still welcome feedback on the gamma publication, we’re therefore especially interested to hear how we could further develop the Good Practice Guides, data schema and other supporting documents that underpin the trust framework. This will should help us strengthen the foundations of the trust framework scheme as a whole."
        },
        {
            "heading": 2,
            "text": "Submitting your feedback"
        },
        {
            "text": "With that said, we want to hear from you. What do you think about the gamma publication? What do you think about the ‘five i's’ we plan to focus on? Are there any other areas for development we should be considering?"
        },
        {
            "text": "Our survey is available online and will be open for responses for the next fortnight, until the 3rd of February 2025. Thank you, as always, for your continued support and engagement with OfDIA’s work. We look forward to reading your feedback."
        }
    ]
}