{
    "url": "https://space.blog.gov.uk/2023/10/05/a-month-of-meteors-and-a-lunar-eclipse-the-night-sky-in-october/",
    "title": "A month of meteors and a lunar eclipse: the night sky in October",
    "authors": [
        "Derek Smale"
    ],
    "categories": [
        "Astronomy"
    ],
    "pub_date": "2023-10-05T16:22:38+01:00",
    "content": [
        {
            "text": "October’s night skies feature a partial lunar eclipse, two meteor showers and a great opportunity to see the gas giant planets of our Solar System, Jupiter and Saturn."
        },
        {
            "heading": 2,
            "text": "Partial Lunar Eclipse"
        },
        {
            "text": "Soon after the full Moon rises in the north-eastern sky on 28 October, part of its surface will fall into Earth’s shadow, a phenomenon known as a partial lunar eclipse."
        },
        {
            "text": "From around 7:00pm, the Moon’s surface will start to become slightly less bright as the Sun’s light is dispersed as it passes through Earth’s atmosphere before reaching the Moon, a phase known as the ‘Penumbral eclipse’."
        },
        {
            "text": "From around 8.30pm, a more distinct, darker shadow, or ‘Umbral eclipse’ will begin to appear on the Moon’s surface as our planet moves to block the light."
        },
        {
            "text": "Only a few percent of the Moon’s surface will be eclipsed, and it will be most pronounced at around 9.15pm.  It will be 2025 before the next total lunar eclipse is visible from the UK.  You can learn more about eclipses here."
        },
        {
            "text": " "
        },
        {
            "text": "Did you know?"
        },
        {
            "text": "21 October is NASA’s International ‘Observe the Moon’ night.  You can find more information on the event, including a forum to share your photos here."
        },
        {
            "text": "On that date here in the UK, the approximately 50% illuminated Moon rises in the south-east at around 3.15pm, reaches its highest point in the southern sky at around 6.45pm, and sets in the south-west at around 10.15pm."
        },
        {
            "heading": 2,
            "text": "The planets"
        },
        {
            "text": "It’s another great month to see the gas giant planets of our Solar System, Jupiter and Saturn."
        },
        {
            "text": "Jupiter rises in the east around 8:00pm and is visible throughout the night, lying low in the west by the time dawn approaches."
        },
        {
            "text": "Jupiter reaches ‘opposition’ early next month - its closest point to Earth as the two planets orbit the Sun.  This means it is unmistakably bright, sitting just to the right of the Pleiades star cluster in the constellation of Taurus."
        },
        {
            "text": "Although fading slowly in brightness now, Saturn is still much brighter than the stars around it as it sits in the constellation of Aquarius."
        },
        {
            "text": "It can be seen above the south-eastern horizon as darkness falls, reaching its highest point in the southern sky at around 10:00pm."
        },
        {
            "text": "Early risers will see the brightest planet Venus blazing in the east in the pre-dawn skies this month."
        },
        {
            "heading": 2,
            "text": "Other night sky sights"
        },
        {
            "text": "Look out for the Pleiades star cluster in the constellation of Taurus the Bull, which rises in the north-east around 8.30pm.  It’s a cluster of over a thousand stars, drifting through space together around 440 light years from Earth."
        },
        {
            "text": "Appearing to follow the Pleiades across the sky is the red-giant star Aldebaran, the eye of Taurus.  This star lies 65 light years away and is over 40 times larger than the Sun."
        },
        {
            "text": "Look for the constellation of Ursa Major (the Great Bear) dominating the north-west as darkness falls.  The distinctive pattern of the stars often referred to as the ‘Plough’ or ‘Sickle’ makes up the back and tail of the bear."
        },
        {
            "text": "The fainter stars of its nose point towards the northern horizon (lower-right in the photo below), while its feet hover just above the horizon in the lower centre."
        },
        {
            "heading": 2,
            "text": "Meteor showers this month"
        },
        {
            "text": "Meteors from the Draconid meteor shower are caused by fragments of debris from Comet Giacobini-Zinner entering our atmosphere."
        },
        {
            "text": "They will be visible from around the 6 - 11 October, with the peak likely falling around 8 - 9 October. These are among the slower meteors to streak across the sky, travelling at ‘just’ 21 kilometres (13 miles) per second."
        },
        {
            "text": "The fragments from Halley’s Comet that make up the Orionids meteor shower will enter our atmosphere at around 66 kilometres (40 miles) per second. This meteor shower is active all month and peaks around 21 - 22 October."
        },
        {
            "text": "Towards the end of the month, you may also start to see meteors from next month’s Taurid meteor shower, so it’s a great time to head out and see if you can spot any ‘shooting stars’."
        },
        {
            "text": "To increase your chances of spotting them, try to get as far away bright sources of ground-light as you can and give your eyes time to adapt to the dark."
        },
        {
            "text": "Unfortunately, the Annular solar eclipse on 14 October is only visible in the Americas, and will not be visible from the UK."
        },
        {
            "text": "The spectacular ‘Ring of Fire’ eclipse is caused by the Moon passing between the Sun and the Earth at a point where it is further away from Earth on its elliptical orbit around our planet."
        },
        {
            "text": "This means that the Moon is smaller in our skies, and doesn’t completely block the light from the Sun, leaving a ‘ring of fire’ visible around its edge."
        },
        {
            "heading": 2,
            "text": "Space Science and Exploration"
        },
        {
            "text": "As NASA’s Osiris-Rex spacecraft flew past Earth on the return journey from asteroid ‘Bennu’ last month, it successfully deployed a capsule that landed safely in the Utah Desert, containing grains of the asteroid that it collected back in 2020."
        },
        {
            "text": "Scientists are now studying the material, and NASA have set the Osiris-Rex spacecraft on a path to rendezvous with another asteroid, called ‘Apophis’."
        },
        {
            "text": "This 370-metre-wide rock will pass closer to Earth in 2029 than our geostationary satellites, providing an incredibly rare opportunity to study it."
        },
        {
            "text": "A mission to encounter another asteroid in 2029 launches on 12 October, but the target is an entirely different beast!"
        },
        {
            "text": "NASA’s ‘PSYCHE’ asteroid probe will study an enormous 280km (170 mile)-wide body of nickel and iron that travels around the Sun between the orbits of Mars and Jupiter."
        },
        {
            "text": "Believed to be the metallic core of a ‘failed planet’, the Psyche mission is expected to shed light on how the rocky, inner planets of our solar system formed and evolved.  You can find more information on this mission here."
        }
    ]
}