{
    "url": "https://defradigital.blog.gov.uk/2023/10/05/chris-thorn-what-we-mean-by-digital/",
    "title": "What we mean by digital",
    "authors": [
        "Chris Thorn"
    ],
    "categories": [
        "Defra digital",
        "Digital transformation"
    ],
    "pub_date": "2023-10-05T08:00:16+01:00",
    "content": [
        {
            "text": "Defra Chief Digital Officer Chris Thorn explains how the work to develop a Digital Transformation Strategy for the Defra group of organisations is gaining momentum, due in part to a strong focus on seeing digital as a way of thinking rather than just a technology or a service."
        },
        {
            "text": "I wrote a blog for Defra group colleagues recently about how we are developing our Digital Transformation Strategy, centred around our ambition to be a digital first organisation, and I shared some of my thinking which is shaping the work that’s already underway."
        },
        {
            "text": "The Strategy is due to go to our Executive Committee, as well as our Arms-Length Bodies (ALBs) Chief Executives this month – we’re doing this because the ALBs have a very important role to play in the transformation. It’s important the strategy supports their strategic goals, and they are committed to helping to implement it across the group."
        },
        {
            "text": "When we talk about digital transformation there’s often some confusion what we mean – after all digital is one of those words that can mean different things to different people."
        },
        {
            "heading": 2,
            "text": "So, what do we mean by digital, in a transformation context?"
        },
        {
            "text": "There’s a perception that when we talk about digital, we just mean technology or a digital service; when what we actually mean is something wider, it includes some of those things, but it also includes ways of working as per the Central Digital and Data Office (CDDO) definition:"
        },
        {
            "text": "I also really like this quote from Tom Loosemore, a former Deputy Director in Government Digital Services (GDS), about what digital means:"
        },
        {
            "text": "“Applying the culture, processes, business models and technologies of the internet era to respond to people’s raised expectations.”"
        },
        {
            "text": "You can hopefully start to see from this that digital goes beyond just using the latest technology – we see it more as a way of thinking about problems and working in a different way."
        },
        {
            "text": "For me, thinking and working in a digital way is about putting customers (whether internal or external) at the heart of what we do. It’s about agile working to deliver value to those customers more quickly and adjusting plans based on real world feedback from those customers."
        },
        {
            "text": "It’s about working in multi-disciplinary teams so that we don’t have blind spots and take a broad view of the problems we are trying to solve. But it’s also about how we structure and enable organisations to embrace the culture and processes of the digital age."
        },
        {
            "heading": 2,
            "text": "Identifying where we can make a difference"
        },
        {
            "text": "We’ve been working with the Central Digital and Data Office, and Defra Service Owners for our top nine services (which form part of Government’s Top 75 Services), to create an improvement plan to help them get to a ‘great’ standard. We want to apply the same performance framework to all our priority services in Defra group. Together with ALBs we are currently identifying all our priority services so we can co-create an improvement plan to help these services get to a ‘great’ standard."
        },
        {
            "text": "Defra group has 700+ public-facing services on GOV.UK, 580 (83%) of these services are paper-based. We estimate that Defra handles around 14 million transactions per year that involve paper forms. We are going to develop a digital form builder to help Defra group digitise paper forms and provide improvements for staff, users, and the taxpayer."
        },
        {
            "text": "We are currently in Discovery, which means we are focussing on developing our understanding of the needs across Defra group and exploring potential solutions from across Government such as GOV.UK Forms and other Government Department's form builder tools to determine suitable options for Defra."
        },
        {
            "text": "Alongside digitisation of forms, we will be undertaking user research and service design to identify for opportunities to improve the user journey, as well as exploring how automation of back-end processes could reduce the manual burden on staff to validate and process data."
        },
        {
            "heading": 2,
            "text": "Thinking differently, working differently"
        },
        {
            "text": "We cannot deliver Defra group’s ambitions if we continue to work as we do now. Digital Transformation is one of the ways that we will deliver change in Defra group, that will in turn help us deliver Defra’s ambitious outcomes."
        },
        {
            "text": "By embracing digital ways of working, we will ensure that decisions consider policy outcomes, operational needs, technology opportunities, and user needs - which will lead us to build better services that should deliver better outcomes."
        },
        {
            "text": "Becoming a truly digital organisation will fundamentally change our culture, how we operate, and how we deliver value to customers and achieve environmental outcomes."
        },
        {
            "text": "I’ll continue to provide updates about work on the Defra group Digital Transformation Strategy and what it means over the coming months as I’m keen to share what we’re doing, and to hear from others across Government and elsewhere who are also facing up to and embracing this challenge."
        }
    ]
}