{
    "url": "https://publicpolicydesign.blog.gov.uk/2023/10/05/future-directions-for-design-and-public-policy/",
    "title": "Future directions for design and public policy",
    "authors": [
        "Liz Richardson"
    ],
    "categories": [
        "Events",
        "PublicPolicyDesign",
        "Research"
    ],
    "pub_date": "2023-10-05T12:00:39+01:00",
    "content": [
        {
            "text": "There is growing interest in using design to improve policy-making. The AHRC Design and Policy Network is led by University of the Arts London and the University of Manchester, in partnership with the UK Government’s Policy Design Community. In our fourth event, we discussed what should be next for a research and practice agenda for design and public policy?"
        },
        {
            "heading": 2,
            "text": "‘It ain’t what you do, it’s the way that you do it’"
        },
        {
            "text": "Professor Catherine Durose (University of Liverpool) set out a heuristic for understanding three different types of relationships between design and policy.  The first was an instrumental relationship between design and policy, or ‘design as a tool’, where design is employed to meet existing policy goals. Toolkits can be useful. But they also risk contributing to negative perceptions of ‘design-as-post-it notes’, as a set of tools to be picked up and put down."
        },
        {
            "text": "The second relationship is improvisational, or ‘design as a process’. Here the relationship sees design as a practice that helps policymakers to respond to an unfolding landscape. Design is used to amend and expand upon existing policy. Here, there is obvious value in flexing with uncertain and complex problems, but its value also depends on how far a given policy issue has been framed in a way that will produce effective solutions."
        },
        {
            "text": "The third was an agonistic relationship, or ‘design as re-framing’, where design unsettles or re-envisions policy. Some strengths here include work on anticipatory design. However, this mode may not be attractive to those trying to making things work within given limits."
        },
        {
            "heading": 2,
            "text": "‘We can work it out’"
        },
        {
            "text": "Professor Michael Barzelay (London School of Economics) also rejected a reductivist idea of ‘design’ as a toolkit. Instead, Michael suggested that design, as a professional field, has some ‘essential’ elements as a framework for creating systems that work well. He argued that essentialising is important, that is, boiling complex ideas down into their core components that can be communicated in succinct understandable ways. Essentialising is different to being reductive."
        },
        {
            "text": "This perspective foregrounds using these design frameworks reflexively, rather than statically or applying them unreflexively.  For example, using frameworks to judge what could work – and what would need to be different to avoid poor results. Designers can do this by recovering designs from specific experience through disciplined professional inquiry. Doing this helps to stimulate imagination and help designers to discuss what could work and how."
        },
        {
            "heading": 2,
            "text": " ‘I’m a believer’"
        },
        {
            "text": "Associate Professor Marzia Mortati (Politecnio di Milano) emphasised that part of the value of design is that, while policy and design touch everyone, policy can seem intangible; in contrast, design can be highly tangible."
        },
        {
            "text": "Despite its potential value, design too often remains marginal in policy. She joined Michael and Catherine in a critique of design as reduced to ‘post-its and workshops’. Instead, we need to rethink processes at the core."
        },
        {
            "text": "The value of design needs to be communicated clearly. Frameworks for competencies in project development need to include design alongside other skills. Examples of comprehensive system change using design can inspire."
        },
        {
            "text": "Some system-wide examples don’t come from traditional designers but from people with cross-cutting skills. Audrey Tang, Taiwan’s first ever Minister of Digital Affairs, has brought about radical change in how government uses experimentation and co-creation."
        },
        {
            "text": "Marzia concluded with a call to arms that we reimagine governments as institutions capable of finding commonalities between different positions, and of using design practices like materialization and embodiment to imagine different futures."
        },
        {
            "heading": 2,
            "text": "‘Talking ‘bout my generation’"
        },
        {
            "text": "Noel Hatch (Head of Policy Design, Research and Partnerships at the London Borough of Newham), and co-ordinator of the London Strategy and Policy Network, said the heuristic resonated with his experiences. Often design advocates are working in an instrumental institutional environment, using improvisational practices but with an ambition to move towards an embedded ‘generative’ or agonistic model."
        },
        {
            "text": "Local authorities have some key levers they can use to promote design in local policy-making, centring on devolving power, and building healthy alternative forms of power. One area is to devolve ownership, for example of physical spaces, with examples from London Borough of Camden of co-creation spaces, also a Public Collaboration Lab with UAL Central St. Martins. Devolution of power could apply to investment decisions, and to workforce development to create institutional environments where staff are given space to work in more generative ways, as in the ‘Imagination Activists’."
        },
        {
            "text": "It can be hard for policy makers to unsettle themselves. Workforce development is a missing ingredient for agonistic design practices to be scaled up. Support for new practices can come though experience –‘unlearning’ and  putting yourself in other people’s shoes, experiments and embedding. Embedding is a challenge beyond the scale of specific projects, but legislation and policy such as the Welsh Government’s  Wellbeing of Future Generations Act, Transition Towns and the UK Climate Act point the way."
        },
        {
            "heading": 2,
            "text": "…What next?"
        },
        {
            "text": "Plenary discussions surfaced several key points for further scrutiny. Noel’s mention of the “p-word” – power – may resonate with some attendees’ queries and panel discussion concerning if and how design relates to a potential “land grab” in policy-making processes, as such processes inevitably seek to (re)distribute resources, agency and accountability. Rather than closing design down, as an accusation of ‘land grab’ might do, designers might instead open up new prospects, Catherine argued. While this may be unsettling for some policymakers, Noel welcomed the learning and participatory potentialities of “unsettling oneself” in policy."
        },
        {
            "text": "Several commented that the three heuristics were validating for the work they were doing and expressed interest in learning more about the ‘agonistic.’ A final discussion explored various issues of ‘evaluation’ in design and policymaking, particularly given the multiple and interdisciplinary ideas of design discussed. Professor Lucy Kimbell (co-convenor of the network) flagged her work for the British Design Council’s ‘design economy’ research on the value (and evaluation) of design."
        },
        {
            "text": "Several of the network’s members are participating in the Public Design Review which aim to make a landmark case to the UK’s Civil Service about the value of design."
        },
        {
            "text": "What happens next in the Network? The AHRC Design and Policy network officially closes this autumn, culminating in a report and dissemination activities. The report will elaborate perspectives, examples, outcomes and recommendations emerging from the 18 month initiative. Watch this space!"
        }
    ]
}