{
    "url": "https://defralanduse.blog.gov.uk/2023/10/05/irreplaceable-habitats-and-bng-what-you-need-to-know/",
    "title": "Irreplaceable habitats and BNG: what you need to know",
    "authors": [
        "Land Use Policy Team"
    ],
    "categories": [
        "BNG",
        "Land Use"
    ],
    "pub_date": "2023-10-05T17:21:48+01:00",
    "content": [
        {
            "text": "Ahead of mandatory BNG, we are confirming that the initial list of irreplaceable habitats for biodiversity net gain (BNG) purposes will broadly mirror the list of examples already within the National Planning Policy Framework. This will be followed by a consultation next year so that we can incorporate learnings from the initial months of BNG into the final irreplaceable habitats list."
        },
        {
            "heading": 2,
            "text": "How irreplaceable habitats interact with BNG"
        },
        {
            "text": "The irreplaceable habitats list recognises and protects England’s most valuable habitats. They have a high biodiversity value and are so difficult to recreate, that it would be impossible to achieve the requirement to increase biodiversity on top of no net loss."
        },
        {
            "text": "Irreplaceable habitats have significant protection in the National Planning Policy Framework. Impacts on these habitats from development require a strong justification. BNG will strengthen these protections further."
        },
        {
            "text": "For BNG purposes, the 10% net gain requirement is not applied to irreplaceable habitats, as they are so valuable, they cannot be easily recreated."
        },
        {
            "text": "Irreplaceable habitats must still be recorded in the biodiversity metric, but any impacts to these habitats will flag as unacceptable and requiring bespoke compensation to be agreed with the planning authority.  If there are no impacts, enhancement of irreplaceable habitats can contribute to towards a developments BNG requirement."
        },
        {
            "heading": 2,
            "text": "The BNG irreplaceable habitats list"
        },
        {
            "text": "The below irreplaceable habitats are an initial list, to support the launch of mandatory BNG, ahead of a public consultation on a broader definition of irreplaceable habitat in 2024."
        },
        {
            "text": "For now, in mandatory BNG, the list of habitats will be:"
        },
        {
            "text": "This list will be set out in secondary legislation and because it is a list already in use, provides certainty for developers and local planning authorities during the first phase of implementation of BNG whilst they are adjusting to the new mandatory requirement."
        },
        {
            "heading": 2,
            "text": "Future consultation on irreplaceable habitats"
        },
        {
            "text": "We will launch a public consultation on irreplaceable habitat in the second half of 2024. The consultation will seek views on the definition and list of irreplaceable habitats. The consultation will seek views related to BNG, but also the impact of any new definition or list on wider planning policy."
        },
        {
            "heading": 2,
            "text": "What developers need to know"
        },
        {
            "text": "Mandatory biodiversity net gain will not change the existing strong protections and compensation requirements for these habitats already required in planning policy."
        },
        {
            "text": "If you’re a developer, you should consider if these habitats are present on any of your sites and speak to your local authority at an early stage if they will be affected."
        },
        {
            "text": "If you have been granted planning permission on a site with irreplaceable habitat present, you should firstly try to minimise any impacts on those habitats. Where this isn’t possible and there is a loss of irreplaceable habitat as a result of the development, these habitats will be excluded from your BNG calculation as the habitats are so valuable, it could be impossible for you to meet the BNG requirement. Instead, you’ll need to agree bespoke compensation with your local planning authority as part of the planning application process."
        },
        {
            "text": "If you’re retaining or enhancing any irreplaceable on your site (which we encourage you to do), you should record this in your metric calculations. Any enhancements to irreplaceable habitat should be recorded in the metric and can count towards your 10% BNG."
        },
        {
            "text": "You’ll still need to achieve 10% BNG on any other non-irreplaceable habitat present on your development site."
        },
        {
            "heading": 2,
            "text": "Compensating for irreplaceable habitats"
        },
        {
            "text": "Where impact to irreplaceable habitat cannot be avoided, developers will be required to deliver bespoke compensation agreed with local planning authorities on a case-by-case basis. The planning authority must be satisfied that as a minimum, the compensation plan meets requirements in relevant policy and guidance and delivers appropriate compensation which should aim to reflect the same type of habitat that was lost."
        },
        {
            "text": "The legislation will also set out that off-site biodiversity units and statutory biodiversity credits cannot be used to compensate for the loss of irreplaceable habitat."
        },
        {
            "heading": 2,
            "text": "Varieties of saltmarsh"
        },
        {
            "text": "The National Planning Policy Framework lists a single broad category of ‘salt marsh’, but following the latest ecological evidence, we will list ‘Spartina saltmarsh swards’ and ‘Mediterranean saltmarsh scrub’ as irreplaceable for BNG purposes as these two categories of saltmarsh only are very rare and irreplaceable outside their natural range in the south and southeast of England. Other types of salt marsh habitat are considered replaceable, so we do not want to exempt these habitats from the 10% BNG condition."
        }
    ]
}