{
    "url": "https://dcmslibraries.blog.gov.uk/2023/10/05/the-green-libraries-partnership/",
    "title": "The Green Libraries Partnership",
    "authors": [
        "Maja Maricevic, Blerina Hashani (The British Library), Yvonne Morris and Hinna Vayani (CILIP)"
    ],
    "categories": [
        "Case study"
    ],
    "pub_date": "2023-10-05T09:23:17+01:00",
    "content": [
        {
            "text": "As referenced in our earlier blog, during Green Libraries Week, 2 to 8 October, Green Libraries Partnership are working with libraries across the UK to encourage library users and non-users of all ages to ‘Go Green at the library’. The Green Libraries Week interactive map plots the innovative and exciting green events and activities that are taking place around the country."
        },
        {
            "text": "What is the Green Libraries Partnership? "
        },
        {
            "text": "Launched in February 2022, in response to COP26 and the long-term climate commitments made by libraries and local authorities across England, the Green Libraries Partnership brought libraries together as a collective voice to learn, inspire and engage with the sector and beyond to support a better climate agenda.  Led by CILIP and supported by partners Libraries Connected, Julie’s Bicycle and the British Library, thanks to funding for phase 1  from Arts Council England we have undertaken research, developed an online hub to capture and share best practice, offered a grant fund, and hosted the first ever Green Libraries Conference. "
        },
        {
            "text": "Green Libraries Campaign"
        },
        {
            "text": "This week we will be launching the Green Libraries Campaign, an initiative which will  represent a new phase of development for libraries in supporting climate action. This will include include:"
        },
        {
            "text": "We want to develop a UK-wide, cross-sector, longer-term programme to encourage and support libraries to actively reduce their own carbon footprint. The programme also aims to support all libraries in their initiatives to increase environmental awareness within the communities they serve and activities to enable those communities to take positive action for the planet. "
        },
        {
            "text": "Our Green Libraries Survey in 2022 helped us to understand what public libraries are already doing to be green, what they would like to do, and what would help make this possible. We have four case studies that showcase existing examples from the landscape of current work in libraries around environmental action. "
        },
        {
            "text": "Next steps for the Green Libraries Campaign include collecting climate change related data and evidence of climate action from libraries across all sectors to grow the evidence base. "
        },
        {
            "text": "The Green Libraries Grants Fund 2022 offered small-scale grants to support environmental activity in public libraries in England. Applications were sought for grants of up to £2,500 per organisation or consortium for projects which explored and demonstrated Environmental Responsibility through innovative ideas."
        },
        {
            "text": "The first round concluded in August 2022 with grants awarded to 15 public library services."
        },
        {
            "text": "The Green Libraries Campaign has recently launched a sponsorship campaign to secure the continuation of the Grant Fund.  "
        },
        {
            "text": "The GLP hosted our inaugural Green Libraries Conference in March 2023 showcasing more than a year’s worth of sustainable and attainable green initiatives across the sector."
        },
        {
            "text": "Over 100 delegates representing libraries and local government came together at the Wellcome Collection in London to discuss the unique position libraries hold in educating, raising awareness and acting for the environment. The keynote speech was delivered by Lord Parkinson of Whitley Bay, Minister for Arts and Heritage. "
        },
        {
            "text": "The themes from the 2023 conference were captured live in the image below. "
        },
        {
            "text": "We are planning for the next Green Libraries Conference in 2024. Keep an eye out in the coming months for the confirmed date."
        },
        {
            "text": "Growing impact and collaborative potential"
        },
        {
            "text": "Libraries across the UK are ideal places to offer scientific information, inspire action and connect different communities and organisations that can make a difference. The Campaign is actively adding new partners, including the recent addition of Society of College, National and University Libraries (SCONUL), which will create a new powerful link with university libraries and climate science base. Our common aim is to respond to climate challenges by creating innovative solutions delivered in collaboration with our local communities. Working together will enable us to accelerate our learning and successes. Green Libraries Week helps us to  share and celebrate our work. "
        },
        {
            "text": "For more information, visit us at www.cilip.org.uk/GreenLibraries"
        },
        {
            "text": "Follow us on Follow us on X, formerly known as Twitter - @CILIPinfo and @librariesweek  "
        },
        {
            "text": "Instagram - @cilip_uk and @librariesweek  "
        },
        {
            "text": "Our LinkedIn page – CILIP: The library and information association"
        },
        {
            "text": " "
        }
    ]
}