{
    "url": "https://socialcare.blog.gov.uk/2023/10/05/the-adult-social-care-technology-fund-bid-update/",
    "title": "The Adult Social Care Technology Fund: bid update",
    "authors": [
        "Shantelle Million-Lawson"
    ],
    "categories": [
        "Care and support",
        "Information sharing",
        "Innovation",
        "Workforce"
    ],
    "pub_date": "2023-10-05T14:21:54+00:00",
    "content": [
        {
            "heading": 2,
            "text": "What is the fund designed to achieve?"
        },
        {
            "text": "The Digitising Social Care programme is funded by Department of Health and Social Care and delivered in partnership with NHS England. The programme aims to support the adoption of digital technologies in the adult social care sector."
        },
        {
            "text": "However, the rapid growth in innovative and exciting technology now available to support care can make it difficult for care providers to know which technologies to invest in."
        },
        {
            "text": "It was with this in mind that we launched our Adult Social Care Technology Fund in April 2023. We wanted this funding offer to help us identify care tech solutions that could have potential for wider rollout within the care sector, and in doing so support it with robust evidence to make decisions and prioritise investments in care technology."
        },
        {
            "text": "Alongside this, funding support continues to be available through the digitising social care programme for the adoption of digital social care record solutions (DSCR)."
        },
        {
            "text": "We invited Integrated Care Systems, care providers, local authorities, evaluation partners and technology suppliers to submit expressions of interest to apply for funding to support the procurement and implementation of technology solutions that focused on at least one of our three priority areas:"
        },
        {
            "heading": 2,
            "text": "The assessment process"
        },
        {
            "text": "Interest in the fund from the sector was high and we received more than 100 expressions of interest for the first wave. Following the review of these by a multi-disciplinary panel, as described in a previous blog post, we moved a total of 15 bids into the second stage of the process."
        },
        {
            "text": "We asked for more detailed implementation plans from bidders, as well as the completion of a separate evaluation plan and an economic modelling tool."
        },
        {
            "text": "We conducted a detailed analysis and review of each of the bids, assessing the applications across a range of criteria."
        },
        {
            "heading": 2,
            "text": "Four successful bids"
        },
        {
            "text": "National Care Group: Over £300,000 to improve the quality of medication management and recording and promote independence in taking medication using an Electronic Medication Administration Record System. This will improve the accuracy of recording medication and improve health outcomes for the people supported."
        },
        {
            "text": "Shropshire Council: Shropshire Council, in partnership with domiciliary care providers, Shropshire, Telford and Wrekin ICB, My Home Life England and TEC suppliers will use funding of almost £1.2m over two years to embed technology in people’s homes alongside a virtual care delivery service to help meet care and support needs digitally. This aims to support independence in the home, help people manage their daily needs and promote self-care."
        },
        {
            "text": "Reading Borough Council: Reading Borough Council, in partnership with Henley Business School, will use funding over just over £1 million to trial and understand the benefits and potential of technology which uses sensors to monitor any significant changes to a person's daily habits that may cause concern. The aim is to trial systems that support people to live sustained or increased independence, a sense of well-being, safety, and security."
        },
        {
            "text": "Greater Manchester ICB: NHS Greater Manchester, the University of Manchester and partners receive almost £380,000 to deliver a project to determine the effectiveness and cost-effectiveness of using a digital falls prevention programme for older people living the in the community who receive care and support at home. This enables the user to undertake a personalised falls prevention programme and incorporates health literacy games to improve awareness of activities that promote bone health, diet, safety at home, and hydration."
        }
    ]
}