{
    "url": "https://insidedio.blog.gov.uk/2024/06/13/dios-links-to-d-day-toms-story/",
    "title": "DIO's links to D-Day - Tom's story",
    "authors": [
        "DIO Communications Team"
    ],
    "categories": [
        "D-Day 80"
    ],
    "pub_date": "2024-06-13T09:50:09+00:00",
    "content": [
        {
            "text": "As we mark the 80th anniversary of D-Day, we at DIO are reflecting on our own experiences and stories of the invasion."
        },
        {
            "text": "Tom Niblett, from our External Communications team, has shared his family’s experience. Tom’s granddad, Thomas Payne was part of the 47th Royal Marine Commandos during WW2. His unit landed on Gold Beach on D-Day and would fight through Europe."
        },
        {
            "heading": 2,
            "text": "From Gold Beach to the Scheldt Estuary"
        },
        {
            "text": "Growing up my Granddad Tom was my hero; I was so proud to be his namesake and wanted to be just like him. My abiding memory is watching him hide his smirk (badly) after being told by my mom I’d been in a fight at school. ‘Never start a fight but know how to end one’ he told me afterwards, and weekly boxing lessons began…"
        },
        {
            "text": "As I got older, I naturally became curious about his life, what he had done as a younger man. I was told he was once a soldier and that he’d fought in the Second World War. I can recall times when I would ask him about his experiences, where had he been? Which battles? Why did he have those medals? I cannot recall any responses; the subject would change, and I would be left with the feeling that I was asking questions best left alone. The most I would get out of him would be that I was lucky not to experience the same things he had."
        },
        {
            "text": "My Granddad Tom passed away in 2008, and so with it any opportunity to find out more about his military service, at least directly from him. It would not be until the days of the COVID-19 lockdown that I would re-ignite interest in his time in the forces. I had enrolled in a War Studies course at Birkbeck University and felt I should know if my own family history had played a part in the very things I was studying."
        },
        {
            "text": "By reaching out to wider family and with the help of the 47 Royal Marine Association I was able to piece together his war story."
        },
        {
            "text": "Granddad was a butcher by trade, a reserved occupation for the first years of the war. He received his call-up papers in 1942, assigning him to training at Achnacarry, a country estate in the Scottish Highlands. It was here the newly formed Royal Marine Commandos were being assembled. Tom was assigned to the 47 Commandos, a dedicated unit training to be specialists in amphibious warfare."
        },
        {
            "text": "On D-day the men of the Royal Marine Commandos were amongst the first to land on the Normandy beaches. The 47s hit ground at Gold Beach with a mission to take the nearby town of Asnelles. From there they would push 9 miles west to take Port-en-Bessin, linking up with the US troops landing on Omaha beach."
        },
        {
            "text": "The landing did not go well, five of the fourteen landing crafts used to bring the men ashore were immediately sunk and the casualty rate was high. The chaotic nature of the landing had meant the men covered a space half-a-mile wide and advanced in much smaller groups than originally planned. It would be the following afternoon before the troops would reach and control the port . The RM Commando's performance has gone down as one of the most spectacular of all commando exploits during the invasion."
        },
        {
            "heading": 2,
            "text": "D-day for a second time"
        },
        {
            "text": "For the 47th Royal Marines the experience of D-day would be relived less than six-months on. The commandos would again be the lead for an amphibious assault. This time on 90,000 battle-hardened German soldiers, well dug-in on Walcheren, a small island at the mouth of the Scheldt Estuary. It would be the key to capturing the deep-water port of Antwerp, vital for the continued supplying of allied forces pushing further into Nazi occupied Europe."
        },
        {
            "text": "Tom would land in support of Canadian and Norwegian troops attempting to take the city of Westkapelle. By all accounts this was a grim, bloody battle, reminiscent of the grinding warfare that characterised the First World War: wire, fire, mud, and blood. The battle would rage for nearly a month before a German surrender on 8 November."
        },
        {
            "text": "So as we mark the 80th anniversary of the Normandy landings my thoughts will be with those brave men of the 47th Royal Marine Commandos. How the events of 6 June 1944 were just the beginning of their journey of fighting across Europe. The vast majority of these men are no longer around to tell their stories, but we will never forget."
        },
        {
            "text": "Reflecting on my Grandad’s experiences, it is easier for me to understand his reticence in discussing and re-living what must have been a harrowing experience. I don’t regret that I did not get the opportunity to have those conversations with him, he had his reasons. My only wish would be having the opportunity to tell him how proud I am of all he did. Per Mare Per Terram!"
        }
    ]
}