{
    "url": "https://geography.blog.gov.uk/2023/02/27/5-years-23-blogs-and-1500-members-later-reflections-and-forward-look/",
    "title": "5 years, 23 blogs and 1,500 members later... reflections and forward look",
    "authors": [
        "David Wood"
    ],
    "categories": [
        "Geography"
    ],
    "pub_date": "2023-02-27T16:59:36+00:00",
    "content": [
        {
            "text": "As the Head of the Government Geography Profession, I want to take the opportunity to mark the fact that five years ago today we posted our first blog as the Government Geography Profession."
        },
        {
            "text": "When I look back over the last 5 years my over-riding emotion is one of pride. I’m immensely proud of the work our 1,500 members have done in designing and delivering public services and how the profession has grown to support them.  "
        },
        {
            "text": "Our contribution is widely recognised. For example, by the Royal Geographical Society with IBG who have included our Geography in Government award as part of their annual awards and medals ceremony. Or within Government, where we are recognised as a formal profession, now based at the Department for Science, Innovation and Technology with our departmental sponsor the Geospatial Commission and by the Analysis Function where we help shape the future of government analysis alongside other professions.  "
        },
        {
            "text": "But most importantly is the impact our work is having improving the lives of people and communities across the country. You can get a glimpse of the important work our geographers in the public sector do, and the impact it is having, in the videos from our most recent annual awards. "
        },
        {
            "text": "Over the last 5 years we have held 5 annual conferences, 4 annual award ceremonies, run 27 webinars, launched our members site providing networking opportunities and updates and established collaborative and mutually beneficial relationships with our partners across the geo community. I’d like to take this opportunity to thank all our volunteers, partners in geo communities and members of our leadership team who have put in significant time and effort in getting us this far, some of whom I am pleased to say will continue to support us on our journey and others of whom have moved on to new opportunities with our thanks and immense gratitude. "
        },
        {
            "text": "But I don’t want to look back, I want to look forward to what the next 5 years will bring as we continue to grow and evolve to best support our members across the public sector, collaborating with our many partners both within government and across the geo community. We will set out how we will do this in our new strategy which we will launch in the coming months. "
        },
        {
            "text": "Today I would like to announce our new leadership team, who along with our volunteers and GGP manager will help us achieve our ambition; to create and grow a high profile, proud and effective geography profession that attracts fresh talent and has a secure place at the heart of government decision making.  "
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Head of Government Geography Profession "
        },
        {
            "text": "David Wood (Department for Environment, Food & Rural Affairs) "
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Deputy Head of Profession  "
        },
        {
            "text": "Patrick Rickles (North Sea Transition Authority) - Digital strategy and engagement and Equality, Diversity and Inclusion "
        },
        {
            "text": "Chris Gale (Office for National Statistics) - Professional Guidance and Engagement "
        },
        {
            "text": "Madeleine Hann (Ministry of Defence) - Outreach and Talent Pipelines "
        },
        {
            "text": "Claire Edwards (Natural England) and Carolyn Shears (Ministry of Defence) - jointly leading Skills, Training and Professional Accreditation. "
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Organisational and Community Head of Profession  "
        },
        {
            "text": "Alistair Edwardes – Head of Profession at Department for Environment, Food & Rural Affairs "
        },
        {
            "text": "Olive Powell – Head of Profession at Office for National Statistics "
        },
        {
            "text": "Ian Spencer – Head of Profession at Ministry of Defence "
        },
        {
            "text": "Brian Vinall – Head of Profession at Environment Agency "
        },
        {
            "text": "David Roberts – Head of Profession at Welsh Government "
        },
        {
            "text": "Rollo Home – Head of Community at Ordnance Survey "
        },
        {
            "text": "Ian Coady – Head of Community at Foreign, Commonwealth and Development Office "
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Geography Profession Manager  "
        },
        {
            "text": "Niamh Jefford (Department for Environment, Food & Rural Affairs) "
        },
        {
            "text": " "
        },
        {
            "text": "If you are a crown, civil or public servant and would like to join the profession you can register for free on our members site."
        }
    ]
}