{
    "url": "https://onsdigital.blog.gov.uk/2023/02/27/opening-a-new-world-of-opportunities-a-conversation-with-our-automation-engineer-apprentices/",
    "title": "Opening a new world of opportunities – a conversation with our automation engineer apprentices",
    "authors": [
        "soniaunsted"
    ],
    "categories": [
        "Automation",
        "DDaT academy",
        "ONS digital people",
        "People and skills"
    ],
    "pub_date": "2023-02-27T16:05:01+00:00",
    "content": [
        {
            "text": "The DDaT Academy at the ONS has several “grow our own” programmes that help us build our talent pipeline and last September, we welcomed three new automation engineer apprentices into the Automation Centre of Excellence and the Integrated Data Programme (IDP)."
        },
        {
            "text": "Our automation teams have an important role in realising efficiency opportunities for the ONS and delivering value for the taxpayer, enabling teams to work in a more streamlined way and reducing duplicated work and automating manual processes.  The apprentices didn’t need previous experience - just technical aptitude, business knowledge and a burning desire to turn problems into solutions and help drive process improvements"
        },
        {
            "text": "Five months later, the DDaT Academy caught up with Chris Herbert, Tom Weeks and Jonathan Parker during National Apprenticeship Week to find out how the roles and the apprenticeships are going."
        },
        {
            "heading": 2,
            "text": "What appealed to you about the apprenticeship?"
        },
        {
            "text": "Chris: The ability to learn new skills whilst still working full time. My current course also came with a promotion which made it more appealing to move into a tech role and learn the job around gaining a qualification in the subject."
        },
        {
            "text": "Jonathan: The opportunity to be trained as an automation engineer is what most appealed to me, whilst also getting the opportunity to undertake on the job learning that was both relevant to my role and which is helping me to develop my knowledgebase around IT related subjects."
        },
        {
            "heading": 2,
            "text": "Has it matched your expectations?"
        },
        {
            "text": "Tom: Honestly, I had no idea what to expect. The word ‘apprenticeship’ summons up the idea of a 16-year-old, fresh out of school, struggling to study and work at the same time. In reality, it couldn’t be further from that. I’m in a new role, learning new skills while completing a qualification. I’m given plenty of time to do coursework as well as picking up the skills for my new role and have been supported the whole way."
        },
        {
            "text": "Jonathan: It’s been similar to what I expected so far. It’s been interesting to learn about subjects such as robotic process automation and business automation workflow. I hope to learn more about security in the future as well."
        },
        {
            "heading": 2,
            "text": "How do you see the apprenticeship helping you professionally?"
        },
        {
            "text": "Tom: 5 months in and I can already see the benefits. I’m developing a whole new skillset in a role that’s very different to anything I’ve done before and, as a bonus, I’ll come out of it with a recognised qualification. It’s made my career path much clearer, giving me that tangible goal to work towards."
        },
        {
            "text": "And last, but definitely not least, I’m interested in and enjoying the work I’m doing, which is such an important aspect of any job!"
        },
        {
            "text": "Chris: This is the second apprenticeship I have undertaken within ONS, my first was a level 3 in IT User Skills whilst I was in Business Data Operations Division. That course gave me the skills and confidence to apply for promotion (which I was successful in getting) and led to me starting my current level 4 course alongside learning a new job."
        },
        {
            "heading": 2,
            "text": "What would you say to anyone thinking about applying for an apprenticeship?"
        },
        {
            "text": "Chris: Go for it, the apprenticeship courses cost you nothing to undertake but give you a recognised qualification. They open doors to further development and promotion opportunities that you may have not looked at otherwise"
        },
        {
            "text": "Tom: I was hesitant to apply but I’m so glad I did! If there’s an opportunity you’re interested in then go for it. The support we’ve had has been great, and it opens so many doors. Yeah, definitely go for it."
        },
        {
            "text": "Johnathan: If you like to learn while on the job and be given real world situations to test your knowledge then an apprenticeship is the way forward, I think. There are certainly advantages to picking an apprenticeship over a university course depending on the type of learner you are."
        }
    ]
}