{
    "url": "https://prisonjobs.blog.gov.uk/2023/02/27/why-i-became-a-probation-officer/",
    "title": "Why I became a probation officer",
    "authors": [
        "Ministry of Justice"
    ],
    "categories": [
        "Personal stories",
        "PQiP",
        "Probation"
    ],
    "pub_date": "2023-02-27T16:55:04+00:00",
    "content": [
        {
            "heading": 3,
            "text": "We spoke to probation officer, Alex, to discover what made him choose to become a probation officer and to find out about his journey so far."
        },
        {
            "text": "What inspired you to want to become a probation officer?"
        },
        {
            "text": "I have always had an interest in working directly with offenders. Having previously studied criminology at university, the criminal justice system has always interested me. One of my university lecturers also previously worked within the Probation Service and provided an insight into how the service operated and its core values."
        },
        {
            "text": "What did you do before becoming a probation officer?"
        },
        {
            "text": "I studied criminology at university, graduating in 2019. Following this, I worked odd jobs in my home city as I was unsure exactly what avenue to take with my career. I started volunteering with the Prison Advice and Care Trust (Pact), a through the gate support service for prisoners who have just been released from custody. This gave me experience in formulating risk assessments as well as interacting with people involved with the criminal justice system, and most importantly offenders. During this volunteering I applied for the trainee probation officer programme and was accepted."
        },
        {
            "text": "What did your friends and family think when you told them you were going to be a probation officer?"
        },
        {
            "text": "Initially, they were confused as most of the public have no clue about what a probation officer actually does. Nevertheless, they were proud of me, and very interested in the stories I would have and the people I would meet as part of the role."
        },
        {
            "text": "Do you think any of your personal or previous professional experience played a part in your decision in choosing to become a probation officer?"
        },
        {
            "text": "My work with Pact definitely played a part in becoming a probation officer. It cemented my desire to work directly with offenders and be involved in the criminal justice system."
        },
        {
            "text": "Is the job how you expected it to be?"
        },
        {
            "text": "I think my understanding of the Probation Service prior to starting my training gave me a good idea of how it would be. Nevertheless, the complex individuals that I work with provide a refreshing understanding of how my offender’s think and behave. Offenders will always keep you on your toes in that regard, and so my work as a probation officer is constantly changing."
        },
        {
            "text": "Is there anything about the role that you didn’t expect?"
        },
        {
            "text": "As someone’s probation officer, you are the lead professional and take the lead in terms of managing aspects of the offender’s life. This initially caught me off-guard during my training as it seemed daunting speaking during multi-agency meetings. However, the training is in place to give you the opportunity to learn and develop your skills within professional settings. In turn, making you a more proficient probation officer."
        },
        {
            "text": "What did you find most challenging when you started the trainee probation officer programme?"
        },
        {
            "text": "The most challenging aspect of the trainee probation officer programme was balancing the practical workload and the academic side of the programme. Thankfully, the probation team provide a lot of support during the process."
        },
        {
            "text": "How was your first experience working with offenders?"
        },
        {
            "text": "I started working in probation during the COVID-19 pandemic, so my first experience working with offenders directly was over the phone. This was initially difficult, as it is hard to build rapport with someone you have never met face to face. However, once restrictions eased and the office was used for appointments more and more, it became considerably easier."
        },
        {
            "text": "What skills do you think make an ideal probation officer?"
        },
        {
            "text": "Empathy, resilience, time-management, knowledge of risk, being able to communicate complex ideas across varying knowledge levels and organisational skills."
        },
        {
            "text": "What would you say is the most rewarding part of the job?"
        },
        {
            "text": "The most rewarding part of the job is seeing the positive change you can instil in someone’s life when they were previously putting others and themselves at risk. Often in probation we work with people who are struggling with various facets of their life, be it drug addiction, mental health issues or homelessness. So, it is very rewarding to use the opportunity of working with these people to help change the trajectory of their lives."
        },
        {
            "text": "Do you have any regrets or anything you would have done differently?"
        },
        {
            "text": "No, I am happy with where I have ended up. Probation has given me a wealth of experience for my career."
        },
        {
            "text": "What would you say to someone thinking of becoming a probation officer?"
        },
        {
            "text": "Research the Probation Service first and understand what it entails. This will give you a better idea of if you are the right fit. If it is something that you think is a good fit, then I would recommend applying. Whether it is a Learning Development Unit (LDU) close to home or a different city entirely, it’s an amazing experience."
        }
    ]
}