{
    "url": "https://insideDIO.blog.gov.uk/2023/02/27/yardley-chase-training-area-northamptonshires-hidden-gem/",
    "title": "Yardley Chase Training Area: Northamptonshire’s hidden gem",
    "authors": [
        "Joe Hamer"
    ],
    "categories": [
        "Conservation",
        "Defence Training Estate (DTE)",
        "Environment and Ecology"
    ],
    "pub_date": "2023-02-27T14:00:30+00:00",
    "content": [
        {
            "text": "Yardley Chase Training Area hosts a unique system of woodland and meadow ponds which provide habitats for a range of wildlife [Copyright Jeff Blincow]Yardley Chase Training Area in Northamptonshire is one of our lesser-known training areas, yet it’s truly a hidden gem. The site was recently showcased for its wildlife value in the nationally acclaimed British Wildlife magazine, thanks to the committed efforts of the Yardley Chase Conservation Team, our own DIO ecologists, and our partners at Landmarc, who’ve all been working together to protect and preserve the training area's unique wildlife and ecology."
        },
        {
            "heading": 2,
            "text": "The history of the training area"
        },
        {
            "text": "Yardley Chase Training Area is the most biodiverse part of the much larger area known as Yardley Chase. The site’s history, and the lack of intensive management in the training area, has created something very unique."
        },
        {
            "text": "From the 16th century, the site was part of a country estate, including a deer park, before being taken over and used as a munitions store during the Second World War (WW2). Subsequently, it became a military training area, which has meant that its habitats have survived relatively intact. Like many military sites, it took some time after WW2 before Yardley Chase Training Area appeared on maps, and few people knew about or visited the site before the 1980s. The ecological value of the training area was apparent nonetheless, gaining Site of Special Scientific Interest (SSSI) status in 1984. Over the last decade, it has become ever clearer just how special the site is for wildlife. Helped by the efforts of a dedicated conservation team, much has recently been learnt about its wildlife value."
        },
        {
            "heading": 2,
            "text": "Ancient woodlands and a unique pond system"
        },
        {
            "text": "The 200ha site comprises a mixture of woodland, pasture and parkland with large areas of grassland and 83 ponds. It’s home to a diversity of woodland types, with considerable quantities of standing and lying deadwood, providing habitats for an exceptional range of invertebrate life."
        },
        {
            "text": "The deer park sections of the training area comprise wood-pasture graced by ancient and veteran trees [Copyright Jeff Blincow]The deer park sections of the training area comprise wood-pasture graced by many large ancient trees and veteran trees – meaning they hold great value due to their age, size or condition. An extremely valuable feature is the varied age structure in the trees, so that as the very oldest falter the next generation will be maturing and beginning to offer the same ecological benefits. This rich abundance of dead and living wood of varying types supports many rare and little-known invertebrates across the site."
        },
        {
            "text": "Yardley Chase contains a unique system of woodland and meadow ponds created from ‘borrow pits’ of various shapes, sizes and depths, most of which were dug as part of the construction of storage bunkers during WW2. The lack of disturbance and isolation from the effects of intensive agriculture have produced a special selection of microhabitats which support a wide range of aquatic animals and plants."
        },
        {
            "text": "Yardley Chase Training Area's many ponds support toads, dragonflies, and a range of aquatic invertebrates [Copyright Jeff Blincow]Most of the 83 ponds are in woodland, where increasing cover of trees and scrub has caused problems with excessive plant and algal growth, which can reduce biodiversity. Threats to the biodiversity of the ponds in 2015 led Natural England to categorise the SSSI as being in ‘unfavourable’ condition. In response, significant funding has been invested by the DIO Conservation Stewardship Fund, enabling a programme of scrub and woodland management aimed at bringing the ponds into ‘favourable’ or ‘unfavourable recovering’ condition. Over several winters, DIO and teams from Landmarc have carried out careful woodland clearance, varying levels of clearance in and around the ponds to create the greatest possible range of conditions."
        },
        {
            "heading": 2,
            "text": "Wildlife at Yardley Chase Training Area"
        },
        {
            "text": "The site qualifies as an SSSI for several reasons, notably the population of Great Crested Newt, which is thought to be amongst the top ten in the country. Some of the ponds provide excellent breeding sites for the newts, while the adjacent mixture of habitats is perfect for foraging and hibernation."
        },
        {
            "text": "Impressive numbers of dragonflies fly over the ponds, which support a vast range of aquatic-invertebrate life – over 300 species, in fact. This includes a recent discovery of freshwater bryozoans, a tiny, filter-feeding aquatic invertebrate. Other notable invertebrates include a nationally scarce moth, the Concolorous (Photedes extrema), and two soldierflies, namely the Ornate Brigadier and Barred Snout, both of which are unusual so far inland."
        },
        {
            "text": "The site's Great Crested Newt population is thought to be amongst the top ten in the country [Copyright Jeff Blincow]When considering all of the site’s biological riches, it seems probable that the deadwood habitats and pond complexes at Yardley Chase represent some of the most valuable of their kind in Britain. Its long history of use as a country estate followed by the protection afforded by its use as military training area has given us a unique site. To maintain the complex mosaic of habitats and exceptional biodiversity will require continued monitoring and sensitive management, but the Yardley Chase Conservation Team, along with our DIO and Landmarc teams, will continue to work together to ensure that this hidden gem remains in good shape."
        }
    ]
}