{
    "url": "https://dcmslibraries.blog.gov.uk/2023/10/30/camden-libraries-unique-partnership-with-the-british-library/",
    "title": "Camden Libraries' unique partnership with The British Library",
    "authors": [
        "Fiona Tarn, Head of Camden Libraries"
    ],
    "categories": [
        "British Library",
        "Case study"
    ],
    "pub_date": "2023-10-30T11:15:15+00:00",
    "content": [
        {
            "text": "The British Library is internationally renowned as the UKs national library. Its iconic, imposing Grade 1 listed site at St Pancras is a London landmark welcoming over 1.5 million visitors a year. But as well as being a national institution, it is also a local one - sitting squarely in the London Borough of Camden, surrounded by local communities and families. As such Camden (and Camden Libraries especially) has a unique relationship with the British Library."
        },
        {
            "text": "How does Camden Libraries work with the BL?"
        },
        {
            "text": "I meet regularly with Liz Jolly, Chief Librarian, and Liz White, Director of Library Partnerships. These meetings are invaluable as they provide insight to what our national library is working on and helps me understand their challenges as a large organisation. It’s interesting to compare the synergies of a local library services’ struggles with changing the perception of what a modern public library service can offer with a national library."
        },
        {
            "text": "As part of our Camden Libraries staff conference in June we also welcomed Sally Halper, Director of Research Services, and Claire Wotherspoon, Head of Reference Services, to discuss the services that the British Library offer and how we can work together to refer customers to each other. "
        },
        {
            "text": "We are at the start of a journey with BL, working with Sally and Claire, on a joined-up staff development approach so both teams will come together on a quarterly basis to benefit from training on user engagement, information literacy and much more. Sally says: “Working with Camden Libraries on skills development is a great opportunity to learn from each other’s experiences and share good practice as well as developing our knowledge and practical skills. We’re really looking forward to taking this forward.”"
        },
        {
            "text": "Living Knowledge Network, LibraryOn and much more"
        },
        {
            "text": "We’re excited that Camden Libraries are the first London Library service to become a member of the Living Knowledge Network - a fantastic peer network of library services across the country who share best practice. The LKN is centred on exchanging knowledge and developing memorable experiences for public library users and does so by giving access to British Library curated exhibition panels to support simultaneous exhibitions and in-library screening experiences. Camden Libraries are about to launch their first Living Knowledge Network exhibition, Fantasy, which will be launched at Swiss Cottage Library at the end of October."
        },
        {
            "text": "These have been developed and supported through discussions with BL, including workshops as part of our staff conference with Katherine Blamire, Head of the Living Knowledge Network, to help the Camden team think about ideas for the Fantasy exhibition. "
        },
        {
            "text": "As a result not only will we be live-streaming some of the fantastic events programmed by the British Library for the exhibition period from 27th October 2023 to 25th February 2024 but we will also run our own events and activities on the theme of Fantasy including an exhibition and talk in the Local Studies and Archive centre in Holborn Library and a poetry and drawing competition for the borough."
        },
        {
            "text": "Katherine Blamire shares “We are hugely looking forward to working in partnership with Camden Libraries on our next exhibition. It’s inspiring to have this vibrant community centred library service on our doorstep, and we’ve already been having exciting conversations with teams in the Borough ahead of the exhibition opening."
        },
        {
            "text": "Camden Libraries will be a great benefit to the Network as a whole. Having an LKN partner near to the British Library in St Pancras will help us understand more fully the local application of our collaborative cultural activities and help us to improve the impact of our partnerships for communities across the UK.” "
        },
        {
            "text": "We were also pleased to host the first London Libraries Seminar since the pandemic at our newly decarbonised Swiss Cottage library. It was a lovely opportunity for colleagues from across London to come together, network and hear from some great speakers including two colleagues from the British Library Liz White, Director of Library Partnerships, who presented on the new BL strategy Knowledge Matters and the importance of partnerships and Jill Brown, Digital Grants Manager working on the LibraryOn project who explored how LibraryOn is supporting digital discoverability. "
        },
        {
            "text": "Over the Summer Camden Libraries worked with Camley Street nature reserve and the LibraryOn team created a video to celebrate libraries work to support nature and the green agenda which was released to mark #GreenLibrariesWeek. Camden Libraries and library users (plus our leisure spaces run by GLL) have been testing spaces for the BETA version of LibraryOn. Camden Libraries have been invited to be on the strategic steering group for the new community engagement space which will launch in December at the British Library which is very exciting and will give us an opportunity to promote our offer in a new venue and join up with the British Library on promoting libraries as places of knowledge and idea sharing."
        },
        {
            "text": "Camden Libraries is also increasing its engagement with the British Library Business and IP Centre (BIPC) network, purchasing the COBRA business resource so it can offer remote access to this valuable tool to those who access the fantastic BIPC at the British Library. We are working with Uto Patrick, the BIPC London Network Manager, so that Camden Libraries team members can access practitioner sessions along with other public library staff."
        },
        {
            "text": "And finally…"
        },
        {
            "text": "Colleagues from the British Library also fed into our LGA Peer Challenge in June which was a great opportunity for us to benefit from external input and support. In particular we’ll be looking at  seven key recommendations from that process, one of which is to build on the partnership working with the British Library and other key partner organisations in the Knowledge Quarter. Camden Libraries are planning to develop a library reading strategy by working with the Reading Agency and input from key stakeholders including the British Library. "
        },
        {
            "text": "So, it has been a busy year with lots going on and some great new partnership working developed. I am proud to say I have become a member of the British Library this year and Camden Libraries is looking forward to continuing the work together with the British Library and the Knowledge Quarter."
        }
    ]
}