{
    "url": "https://nationalscreening.blog.gov.uk/2023/10/30/health-screening-module-unlocks-opportunities-and-deepens-understanding/",
    "title": "Health Screening module unlocks opportunities and deepens understanding",
    "authors": [
        "Elizabeth Luckett"
    ],
    "categories": [
        "General"
    ],
    "pub_date": "2023-10-30T08:59:45+00:00",
    "content": [
        {
            "text": "Warwick Medical School runs the popular master’s level Health Screening module over a week every November."
        },
        {
            "text": "The collaborative module between the UK National Screening committee (UK NSC) and the University of Warwick is dedicated to evaluating health screening. It is delivered at master’s level and teaching is supported by expert academics and UK NSC staff."
        },
        {
            "text": "As this year’s students prepare for the 2023 module, I thought it would be a good time to share my experience of attending last year’s module and the opportunities it has provided for me."
        },
        {
            "text": "I had originally planned to attend the course in 2021, but life had other ideas. No matter, I made it in 2022."
        },
        {
            "heading": 2,
            "text": "Learning from experts and building great friendships"
        },
        {
            "text": "The walk through the campus’s tranquil woods and around a lake was a relaxing way to start each day."
        },
        {
            "text": "My fellow participants came from all areas of screening and all over the UK. There were clinicians and other health professionals, screening commissioners and quality assurance staff, public health experts and charity workers. We all had the same goal – to learn how to determine when screening is an appropriate intervention, and how screening programmes can be effectively monitored and improved."
        },
        {
            "text": "I was particularly interested in the ethics and policy issues of screening and enjoyed the opportunity to discuss these with experts in the room. One of these chats led to the offer of further developing my professional development as a public health expert in screening."
        },
        {
            "text": "So here I am, nearly a year later, having had the opportunity to work on some very interesting and varied pieces of work. These include the development of a new targeted national screening programme, the first of its kind in the UK, as well as the development of new national population-based screening programmes."
        },
        {
            "text": "I have been privileged to see the UK NSC’s decision-making process in action, work alongside screening and policy experts in the Office for Health Improvement and Disparities, build great friendships, and be mentored by a wonderful person."
        },
        {
            "text": "This has all enabled me to bring a distinct perspective and understanding of screening to my day-to-day work."
        },
        {
            "text": "I hope those of you who are attending the Health Screening module this year, and those considering attending in the future, enjoy it as much as I did. I’d encourage you to chat to the experts, as you never know what opportunities may come your way."
        },
        {
            "heading": 2,
            "text": "What the module involves"
        },
        {
            "text": "The Health Screening module covers the underlying epidemiological principles of screening, as well as ethics and policy issues. It explores when screening is an appropriate intervention, through the analysis of ethical, performance and economic issues, and how screening programmes can be effectively monitored and improved."
        },
        {
            "text": "It is suitable for a broad range of participants including:"
        },
        {
            "heading": 2,
            "text": "UK NSC blog"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK NSC. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, please email screeninginformation@dhsc.gov.uk."
        }
    ]
}