{
    "url": "https://mhclgdigital.blog.gov.uk/2023/10/30/switching-between-digital-roles-from-business-analysis-to-product/",
    "title": "Switching between digital roles: from Business Analysis to Product",
    "authors": [
        "Coco Chan"
    ],
    "categories": [
        "Careers"
    ],
    "pub_date": "2023-10-30T09:46:19+00:00",
    "content": [
        {
            "text": "Hi, I’m Coco. I’m a Senior Product Manager at the Department for Levelling Up, Housing and Communities (DLUHC), currently working in electoral services. I’m only a few weeks into this role, as I’ve just made a sideways move from Business Analysis in the Homes for Ukraine team. "
        },
        {
            "text": "This isn’t the first time I’ve changed paths, in fact I’ve been a Product Manager, a Delivery Manager and a Business Analyst all in the last five years. I’ve also made the jump from Local Government to the Civil Service, and from my training as a scientist into the public sector. "
        },
        {
            "text": "Changing careers can be daunting, especially if you’ve been in a profession or sector for a while and enjoy the comfort and familiarity of domain expertise. However, it can be an exciting and rewarding experience to pursue a new opportunity, especially in digital where there are overlaps of skills between roles. "
        },
        {
            "text": "Here are some things that helped me as I was considering my move into Product. "
        },
        {
            "heading": 3,
            "text": "Getting a sense of the role before making the jump "
        },
        {
            "text": "The fear of the unknown can feel like an insurmountable barrier to changing jobs. The good news is that you don’t need to wait until you start a new role to understand what it would be like. Digital teams are multi-disciplinary, which means we work alongside colleagues of different specialisms every day. If you’re curious about another role in the team, try observing how that person behaves, what they do day-to-day, and how they tackle problems. You could also ask them directly about their path into digital, or request to shadow them for a day.  "
        },
        {
            "text": "I’ve also been fortunate to have a series of excellent managers and mentors, to ask about career advice. "
        },
        {
            "text": "If you don’t have anyone in your immediate circle to have career conversations with, or are not currently in a digital team, you can still find out what it’s like to work in digital from teams and individuals who work in the open. In particular, I enjoy and learn a lot from reading weeknotes. "
        },
        {
            "heading": 3,
            "text": "Seek out a supportive environment for learning "
        },
        {
            "text": "I feel fortunate to work at DLUHC, as I'm surrounded by colleagues who support me and want me to succeed. I had little experience of Business Analysis when I joined the department, and I was encouraged by my manager to learn as much as possible and seek out different kinds of projects to gain a breadth of experience. This gave me confidence that I would be equally supported to learn my new role in Product. "
        },
        {
            "text": "I also have a number of close colleagues from previous projects and our business analysis community of practice who I keep in touch with, and we exchange supportive messages: they are my ‘pocket cheerleaders’. Before I applied for my new role I sought their opinion on whether it would be a good fit for me, as I knew I could call on them for judgement-free advice, and since they are my peers they would have no involvement in the recruitment process. "
        },
        {
            "heading": 3,
            "text": "Identify your strengths "
        },
        {
            "text": "Humans have a negativity bias, so we tend to focus on critique and areas for development rather than celebrating what we’re already good at. If you’re already in a digital role and looking to move to another you likely have many of the skills you would require; you’re not starting from scratch. "
        },
        {
            "text": "If you’re not currently in a digital role and aren’t sure what your strengths are or which role would suit you, I’d recommend reading the Digital, Data and Technology (DDaT) Profession Capability Framework or a handful of job advertisements, and ask yourself ‘which of these sounds most like me’? "
        },
        {
            "text": "I make a regular habit of reflecting and writing about my work. This helps me to take stock of what I’m doing well and what I still need to learn, and when my confidence dips (for instance when I’m starting something new and I’m overwhelmed by new information) I can refer back to my blog posts to remind me what I’m good at. "
        },
        {
            "heading": 3,
            "text": "Find your role models "
        },
        {
            "text": "I'm lucky to be surrounded by role models of successful career changers, both amongst my close family and professional acquaintances. Knowing that they made significant moves that worked well gave me confidence that it was possible for me. "
        },
        {
            "text": "If you don’t have clear and obvious role models, ask your friends how they got into digital. I’d hazard a guess that most have had squiggly career pathways, and may have experienced more than one digital role. This holds especially true for those who’ve worked across multiple sectors, where either budget constraints or different team structures mean they have skills that expand beyond the role they currently occupy. "
        },
        {
            "heading": 3,
            "text": "Connect with your values "
        },
        {
            "text": "If you’ve decided to make the leap – congratulations! "
        },
        {
            "text": "I’m sorry to break the news that it won’t be easy. Changing jobs is an emotional upheaval, and you'll almost certainly experience moments of unease and ‘imposter syndrome’ as you adjust to your new path. The first few months will be challenging, but once you’ve persisted through those early challenges you’ll be able to access the learning and job satisfaction you were seeking in making the switch. "
        },
        {
            "text": "When times are tough, I find it helpful to remind myself of my values and why I pursued this line of work in the first place. I reflect on: what was I most enthused about when I first applied for the role? What was the change I wanted to create in the world? Beyond the day-to-day or the small details, why is this work important?  If I can remind myself regularly of the personal mission I'm on, then it puts the temporary challenges into perspective. "
        }
    ]
}