{
    "url": "https://marinescience.blog.gov.uk/2022/05/13/discards-are-damaging-invasive-species-week/",
    "title": "Discards are damaging – Invasive Species Week",
    "authors": [
        "Debbie Murphy"
    ],
    "categories": [
        "Animal Health",
        "Aquaculture",
        "Invasive species"
    ],
    "pub_date": "2022-05-13T16:59:49+01:00",
    "content": [
        {
            "text": "The annual Invasive Species Week is taking place between the 16 and 22 May 2022, led by the GB Non-Native Species Secretariat (NNSS) with many organisations taking the opportunity to raise awareness of the issues and what work is being done to address invasive non-native species (NNS)."
        },
        {
            "text": "When you mention non-native species, especially invasive ones, most people will reply, “like grey squirrels?” But what about the ones lurking beneath the ripples of our lakes and rivers, and below the waves of our seas?"
        },
        {
            "text": "Non-native species are animals and plants that have been moved by humans, accidently or deliberately, to places they can’t reach without this help. Once there, many species can survive, and some will thrive and start to have a negative impact on the local biodiversity."
        },
        {
            "text": "An underlying problem with non-native species is a lack of awareness of the issues.  If a species doesn’t belong in a particular environment or location then it may have a negative effect on the native species already present and the surrounding habitat.  Its presence could destabilise riverbanks, affect fishing, introduce disease, or clog waterways,  limiting their use.  This lack of understanding can mistakenly lead people to believe that releasing an animal is the best option without realising that even one animal, or plant, could negatively impact a whole population or even ecosystem."
        },
        {
            "text": " "
        },
        {
            "text": "Probably the best-known aquatic invader in England is the signal crayfish.  Predicted to be a great new food source, farming boomed in the 1980s, but these crustaceans are able to climb tank walls and leave ponds, so they escaped into the wild where they now destroy river banks and spread disease, and have pushed our native white clawed crayfish near to extinction.  As a result, controls on the farming of non-native species now exist to ensure there is no repeat of this situation."
        },
        {
            "text": "Who remembers the days when you could win a goldfish at the fairground? Or have you wondered what to do with the unwanted contents of a garden pond?  Studies have shown a higher likelihood of non-native and/or ornamental aquatic species being found in waters near fairground sites and garden centres as a result of the animals being released when no longer wanted. Ornamental fish species such as koi carp have been introduced into commercial fisheries often bringing with them the risk of koi herpes virus, a disease that affects common carp, causing losses and an economic impact to fisheries. Even releasing the wrong animal or plant into your garden pond could start an unwanted invasion if they can spread from there into the wider countryside, for example in the event of a flood which connects your pond to a nearby river. Elsewhere, invasive species such as lionfish are damaging coral reef fish communities across the Caribbean following the first report of them off Florida in the 1980s, and the species is now becoming established in the Mediterranean as well."
        },
        {
            "text": "Since the 1950s, when air freight became the norm, a trend for more diverse food in UK restaurants, shops and fishmongers has grown.  Possibly the largest live aquatic animal trade is in American lobsters. In 2015, people participating in a religious festival released over 300 American lobsters into the sea off Sussex. Although the release was done through the belief that the compassionate act of releasing captive animals is positive, the reality was a potential introduction of disease, hybridisation and competition with native species, all of which could be damaging to our native lobsters."
        },
        {
            "text": "Animals in the food chain could also be purchased for other uses other than ending up on dinner plates.  A consignment of over 4000 live Gibel carp were recently seized at Dover by our Fish Health Inspectorate, en route to a fish merchant in England.  Gibel carp are a highly invasive species already spreading fast in Europe and the Environment Agency are currently investigating whether they are present in fishery waters here."
        },
        {
            "text": "Another route that both ornamental species and animals for food can find their way into the wild is when they are purchased and used as live fishing bait, both through animals escaping the hook and being released if unused at the end of a trip.  Fishing kit along, with small watercraft like paddle boards and dingys, also pose a hidden risk.  In 2010 the invasive pink or killer shrimp was identified in a reservoir in Cambridgeshire.  The most likely route of arrival in a UK lake was as a hitchhiker on wet kit or within puddles in niches on watercraft without the owners knowing or realising, that they were there, highlighting the need to clean and dry kit every time after use."
        },
        {
            "text": "Whether accidental or deliberate, the release of non-native species is illegal and must stop. Cefas is working hard to assess the risk associated with non-natives species, support enforcement of relevant legislation and adherence to guidance, raise awareness of threats, and contribute scientific expertise and understanding to inform monitoring and management of non-native species."
        },
        {
            "text": "One area that Cefas is leading the way in in the understanding of the threats posed by non-native species, is the development of a user-friendly, multi language screening tool, based on the level of risk each species poses to environments where they might show up. Our experts have knowledge of how to spot potential threats to local biodiversity and through this decision support tool (AS-ISK: Aquatic Species Invasiveness Screening Kit) we can help people understand the nature of the threat and what can be done to reduce it. And with the current trend for changing conditions here and abroad due to climate change, now is the time to reassess which non native species could become established in the coming years."
        },
        {
            "text": "Cefas and partners are working in many ways to prevent the introduction and understand the impacts of non-native species."
        },
        {
            "text": "Additional information on the areas covered in this article can be found at:"
        },
        {
            "text": "Pathways of ornamental and aquarium fish introductions into urban ponds of Epping Forest (London, England): the human vector "
        },
        {
            "text": "Non-native marine species risk screening and vector analysis to inform conservation management in the southern Caribbean"
        },
        {
            "text": "Is it absent or is it present? Detection of a non-native fish to inform management decisions using a new highly-sensitive eDNA protocol  "
        },
        {
            "text": "American lobster awareness"
        },
        {
            "text": "Enforcement regarding release of non-native species"
        },
        {
            "text": "Seizure of illegal imports of Prussian carp"
        },
        {
            "text": "Industry awareness raising and response to non-native species in UK waters "
        },
        {
            "text": "Development of species screening tools"
        },
        {
            "text": "Non-native species advice and licensing regarding what can be kept, when and where"
        },
        {
            "text": "Development of pathway action plans for recreational fishing and boating"
        },
        {
            "text": " "
        }
    ]
}