{
    "url": "https://aphascience.blog.gov.uk/2022/05/13/neeg/",
    "title": "APHA's emergency team are always alert to high risk animal disease",
    "authors": [
        "Vicky Kalogeropoulou"
    ],
    "categories": [
        "Diagnostics & testing",
        "Viral diseases"
    ],
    "pub_date": "2022-05-13T13:27:13+01:00",
    "content": [
        {
            "text": "You may not be aware that the Animal and Plant Health Agency co-ordinates the government response to any disease outbreak affecting animals in the UK by mobilising an incident management team called the National Emergency Epidemiology Group (NEEG). The actions of this group are vitally important to ensure livestock, wildlife and more recently pets are protected from any escalating disease situations. This is necessary to manage the disease by limiting its spread through biosecurity actions and minimising the impacts on associated industries and the economy."
        },
        {
            "text": "On confirmation of the presence of avian influenza in the UK towards the end of 2021, APHA immediately mobilised the National Emergency Epidemiology Group (NEEG). But what is the role of this group and why is it so important? In this blog, we hear from Dr Vicky Kalogeropoulou, senior scientific project manager and member of the NEEG as she explains more."
        },
        {
            "heading": 3,
            "text": "Emergency disease response"
        },
        {
            "text": "The NEEG is an APHA emergency group which is rapidly formed in response to disease incidents which have the potential for high impact on animal or public health, and rapid spread. These notifiable animal diseases must be reported to APHA. Typically, the NEEG is mobilised once a notifiable disease has been identified by our diagnostic team and confirmed at a disease confirmation teleconference led by the UK’s Chief Veterinary Officer (CVO) or the CVO for Wales, Scotland or Northern Ireland (depending on the where the outbreak is). One of the strengths of the NEEG is that it can also be mobilised before disease is confirmed, if there is a strong suspicion of a notifiable disease. This significantly increases the speed of the disease investigation, especially the gathering of potential source and spread tracings, which are key to disease control."
        },
        {
            "text": "The NEEG’s successful structure and incident management approach is also used within APHA for other disease threats, such as bovine tuberculosis (bTB) or investigations of imported disease cases (such as Brucella canis from dogs). Read our blog on this scenario."
        },
        {
            "text": "Our rapid response draws on world-renowned expertise from across APHA, Defra and beyond, and has been called upon most recently to respond to the current avian influenza outbreak."
        },
        {
            "heading": 3,
            "text": "Providing expert epidemiological opinion"
        },
        {
            "text": "The group’s purpose is to provide the UK CVOs and both Defra and devolved administration policy teams with expert epidemiological opinion relevant to government policies designed to protect the UK from disease threats."
        },
        {
            "text": "During an outbreak, the NEEG leads epidemiological investigations on farms and smallholdings to establish the facts about the outbreak and analyse how the disease may have spread.  The NEEG also delivers mathematical modelling to understand how an outbreak might develop and look at ways of controlling it. You will have seen similar modelling on television as part of the Covid-19 press conferences that the Prime Minister and Chris Witty frequently gave. Disease surveillance and tracing plans are prepared to investigate the possible source and spread of the disease which feed into the development of control strategies to prevent further spread."
        },
        {
            "text": "The NEEG also leads on, and provides information and expertise that contributes to:"
        },
        {
            "heading": 3,
            "text": "Who are the NEEG?"
        },
        {
            "text": "The NEEG is a multidisciplinary team, bringing together many people from across APHA: the NEEG executive, a team of epidemiologists that work ‘on the ground’ where disease and animals are found, a team of epidemiologists that analyse the data available from their desks, modellers, data specialists, wildlife experts, disease experts, laboratory teams that conduct the testing for diseases plus a business management and scientific project management team."
        },
        {
            "text": "Each team plays a different role, bringing different skillsets to the virtual team across the UK with the overarching goal being the successful and timely response to the outbreak."
        },
        {
            "text": "The virtual multidisciplinary NEEG relies heavily on key relationships with a range of experts, for example research and diagnostic scientists; disease experts; risk analysts; species experts; and teams that trace movements of infected animals and people (at Cardiff Customer Service Centre); international trade and disease monitoring. Inter-relationships between the science and policy groups during a disease outbreak are key to a successful response, and therefore many groups and committees meet and work collaboratively together to control and eradicate the disease during the outbreak. For this reason, a series of daily and weekly meetings are always established at the start of an outbreak to coordinate all activities, participants and events."
        },
        {
            "text": "Some NEEG members. Clockwise from the top left-hand corner: Charlotte Cook, Erika Galipó, Charles Byrne, Christina Papadopoulou, Jane Tennant, Jo Wheeler, Richard Hepple, Vicky Kalogeropoulou, Jemma Aston and Ruth Moir."
        },
        {
            "heading": 3,
            "text": "Preparing for an outbreak of disease"
        },
        {
            "text": "In between outbreaks, capability, expertise and relationships are maintained via specialised training and simulation exercises. The NEEG Management Team meet monthly to ensure all aspects of the ongoing outbreak preparedness development programme are up-to-date and still fit for purpose."
        },
        {
            "text": "The NEEG leads regular training for veterinary, technical, and scientific staff. This includes training APHA vets on how to perform the duty epidemiologist role, how to draft epidemiological reports and briefs for the UK CVOs and how to conduct veterinary risk assessments."
        },
        {
            "text": "The NEEG also provides expert input to national and local animal disease exercises. These simulations demonstrate the agency’s emergency preparedness capability to deal effectively with outbreaks of exotic notifiable diseases of animals. Each field team takes part in at least one full-scale simulation exercise per year involving many of our partners and stakeholders. Exercise assessment and the lessons learned from them is then used to highlight and promote best practice and to review and update contingency plans."
        },
        {
            "text": "Recent examples include a Disease Emergency Response Committee (DERC) Exercise, held in August 2021, testing the preparedness of the Contagious Equine Metritis (CEM) contingency plans. Exercise Holly was held in summer 2021 to rehearse the UK plans for African Swine Fever."
        },
        {
            "text": "Exercise Blackthorn, held in 2018, was the last UK-wide live-play exercise - involving Defra, the Scottish Government, the Welsh Government, the Department of Agriculture, Environment and Rural Affairs – Northern Ireland (DAERA-NI), APHA and their associated stakeholders. The exercise tested our response to a hypothetical outbreak of foot and mouth disease on 74 different premises. There were a number of lessons learned from this exercise, which can be viewed on GOV.UK."
        },
        {
            "text": "I hope this blog reassures you that APHAs National Emergency Epidemiology Group is fulfilling an important function to protect the country’s animals from potential disease outbreaks. Similar groups within APHA and Defra also exist to manage disease outbreaks or threats to plants and bees."
        }
    ]
}