{
    "url": "https://gds.blog.gov.uk/2022/05/13/why-working-with-an-agile-approach-matters-across-the-globe/",
    "title": "Why working with an agile approach matters across the globe",
    "authors": [
        "Jude Hanan - Principal Digital Advisor, Government Digital Service",
        "Max Fitzhugh - Senior Delivery Manager, Government Digital Service",
        "Raya Barghouti - Senior Analyst, Government Digital Service"
    ],
    "categories": [
        "People and skills",
        "Service design",
        "Transformation",
        "Ways of working"
    ],
    "pub_date": "2022-05-13T09:39:49+01:00",
    "content": [
        {
            "text": "In the last 3 years of helping governments across the globe we’ve seen how agile approaches can help organisations and teams who want to start delivering better public services."
        },
        {
            "text": "One of the main things we’ve learned is that every digital transformation initiative is different. While there are common challenges governments around the world face, localised issues and priorities means that the way reforms are approached can differ significantly."
        },
        {
            "text": "Frameworks and standards can achieve change, like in UK, but these can't necessarily be applied the same way in different countries. Instead, by understanding, testing and adapting different approaches in small, regular iterations, other governments can shape and contextualise good practice ways of working and delivery methods over time gradually and methodically."
        },
        {
            "text": "The approach we are taking with our international partners is:"
        },
        {
            "text": "Our work with Cyprus takes this approach with a GDS multidisciplinary team and a mirror team in the Cypriot government. We have been able to support them in adapting and building their skill sets so they can deliver more user focused services."
        },
        {
            "text": "We’ve learnt a lot over the last few years of working with countries and helping them adopt agile practices. Our experiences from our country work fall into 3 broad areas: leadership, building hard and soft skills, and creating a narrative that works."
        },
        {
            "heading": 2,
            "text": "It takes people to lead people"
        },
        {
            "text": "In the countries we work in, the focus has been on developing the technical digital skills to push forward the delivery of services - a necessity often borne of political and economic pressures. It is just as important to build soft skills in leaders - and teams - to support agile ways of working, like leading with direction, not dictats. It takes a real shift in mindsets across all levels, valuing collaboration over hierarchy and traditional structures. Our work focuses on dedicated coaching for leaders and teams to ensure that agile practices and behaviours are embedded and really understood in the organisations we work with."
        },
        {
            "text": "For leaders the shift in mindset is not only behavioural but also the need to focus on outcomes over outputs, evidencing tangible progress and working out what delivers the most value for the organisation and its users will help build the case for agile and build capacity through delivery. This also means that leaders need to adjust their focus, set expectations and help manage financial or political pressures so that teams can focus on what’s important - meeting user needs."
        },
        {
            "heading": 2,
            "text": "A ‘Big Bang’ approach does not (generally) work"
        },
        {
            "text": "Many of the countries we work with are looking for rapid change to help them meet user needs, often due to tight budgets and lower levels of digital capability in government. Over the pandemic, we saw that in some areas, that the rush to provide digital services has led to the fast implementation of solutions that don’t actually meet what users need, resulting in the loss of time and money as they have to be re-done, and damaging citizens’ trust in government."
        },
        {
            "text": "For organisations that are new to digital service delivery, it is crucial to introduce new skills and behaviours gradually to help mitigate risk. Part of this sometimes has to be done through managing demand for technical support from across government, so that the lead organisation can succeed in delivering value in a sustainable way, building in long-term sustainability and capability."
        },
        {
            "text": "Introducing change more slowly also helps teams developing digital tools and services to better understand citizen needs and incorporate them from the outset, and taking time to understand different regulatory approaches and attitudes to things like privacy that may impact how and what we help teams deliver."
        },
        {
            "heading": 2,
            "text": "Tell stories and celebrate wins"
        },
        {
            "text": "Another element of transformation that tends to be sidelined by the need for digital delivery is a narrative that underpins the work. Talking about what’s being delivered, what it means for the organisation, and how it impacts the organisation, is essential to helping get the buy-in and support at an organisational level."
        },
        {
            "text": "Storytelling can help change the conversation from requirements to a discussion of outcomes based on user needs - a critical element of change."
        },
        {
            "heading": 2,
            "text": "What does this mean for digital practitioners in the UK?"
        },
        {
            "text": "These key areas also offer reflections and lessons for digital leaders and digital delivery teams in government."
        },
        {
            "text": "Based on our experience in-country, as organisations move towards adopting agile practices, teams should consider how agile is scaled to take into account the organisational culture to ensure long-term sustainability - particularly in contexts where other factors might be driving an organisation’s agenda."
        },
        {
            "text": "For those working with other departments, finding the balance between making recommendations, and giving people structure to gain experience can be hard to achieve. Part of the approach should focus on testing out what gives the teams we work with (as well as our own) the safety and structure to try new things, a critical factor in agile adoption when there may be organisational or political pressures."
        },
        {
            "text": "In our next blog post on our international work, we will share more about our work in helping governments on the digital transformation journey by developing standards and assurance - one of the core foundations for digital transformation."
        }
    ]
}