{
    "url": "https://defradigital.blog.gov.uk/2022/05/13/why-im-supporting-mental-health-awareness-week-charlottes-story/",
    "title": "Why I’m supporting Mental Health Awareness Week: Charlotte’s story",
    "authors": [
        "Charlotte Bernthal"
    ],
    "categories": [
        "Defra digital"
    ],
    "pub_date": "2022-05-13T13:55:55+01:00",
    "content": [
        {
            "heading": 5,
            "text": "Charlotte is taking on the 3 Peaks Challenge in June."
        },
        {
            "text": "Hi, I’m Charlotte and I’ve been working in Defra’s Digital, data and technology function as a project and programme manager for a few years now. My focus recently has been on the deployment of Microsoft Teams and on moving us from existing communication services such as Jabber and WebEx onto this new platform."
        },
        {
            "text": "I’ve been working in IT Project and Programmes for approximately 20 years (scary!), since graduating from the University of West of England in Bristol in 2000 with a BA (Hons) in Business Information Systems. I’ve worked in public and private sector organisations, delivering a wide range of IT-related programmes, generally involving large transitions and change management."
        },
        {
            "text": "I love to travel (when we’re not in a pandemic) and I’ve been fortunate enough to spend time exploring Central and South America, Southeast Asia, and more recently I lived and worked in Australia for five years."
        },
        {
            "heading": 2,
            "text": "Mental health - a subject close to my heart"
        },
        {
            "text": "Mental wellbeing is a subject close to my heart and is the reason I’m supporting Mental Health Awareness Week. Over the last 25 years, both in my personal and professional life, I’ve known far too many people affected by mental health issues. Whether that be through serious depression, and the impact that has had on their daily life, or people who have taken their own lives due to mental illness and despair."
        },
        {
            "text": "Unless you’ve been directly involved, there are no words to describe how devastating and lasting the impact is – it’s almost too overwhelming to comprehend, and the reality is, the affect will be felt by generations to come."
        },
        {
            "text": "Growing up in South Wales, these issues reluctantly occur all too often; someone loses their life from suicide or drugs and alcohol related incidents on a regular basis. My family and I have lost a significant number of friends in our community, even as recently as this month. Charming, loving, caring sons, daughters, brothers and sisters who have succumbed to their mental health battles."
        },
        {
            "heading": 2,
            "text": "Feeling the effects of mental ill health"
        },
        {
            "text": "The devastating effect on families and friends sometimes defies comprehension, and unfortunately becomes an ingrained part of the culture in many communities. For those suffering, it seems there’s no hope or light on the horizon, making it harder for families to pull together and move forward."
        },
        {
            "text": "The statistics often shine a light on the challenges for working class areas, where high unemployment and socio-economic factors heavily impact those communities, resulting in greater numbers of mental health issues and all that comes with those."
        },
        {
            "text": "Sadly, time and again there has been someone I know who’s been taken too soon, with more family and close friends devastated. How has it come to this, in 2022?"
        },
        {
            "heading": 5,
            "text": "One in four adults feel lonely some or all of the time. "
        },
        {
            "heading": 2,
            "text": "Facing up to my own challenges\n"
        },
        {
            "text": "I’ve experienced my own mental health battles, which until recently I've struggled to discuss openly; a painful divorce coupled with legal proceedings and more. Thankfully I was able to get through it. As a single parent I count myself as very lucky. I was able to seek the help I needed through charities, plus my incredible close friends and family, and positively move on with my life."
        },
        {
            "text": "Many others in similar positions are not so lucky; they don’t feel they can ask for that help or are unaware it is available. How do we reach those people, how do we break down the barriers and help those struggling and stop the cycle?"
        },
        {
            "text": "The reality is there is no simple answer, though I do believe we can each contribute in our own way. Talking openly and supporting charities that do the groundwork; avoiding mental health \"taboo\" subjects, such as depression, self-harm, suicide and encouraging people that it's OK to get the help they need, such as counselling, therapy or even just picking up the phone to a professional/charity organisation such as the Samaritans, MIND and SOS Silence of Suicide."
        },
        {
            "text": "In the past, I’ve experienced people's reluctance to discuss these subjects, and they often shy away from the fact that, for many, mental health issues directly correlate to the use of drugs and alcohol, and ultimately suicide. Entire communities can be affected by these challenges, but collectively we can all help to break away from the ongoing sadness."
        },
        {
            "heading": 2,
            "text": "Overcoming loneliness is hard but can make a huge difference"
        },
        {
            "text": "I think we’d all be hard pushed not to have felt lonely at some point over the last two years. Living through a pandemic, for some, would have magnified mental health issues. As a single parent working from home (as someone ‘kindly’ pointed out at the school gate for me right at the start of it all), I’ve felt the strain of a single adult situation through the long days and nights, week on week pushing through to the next ‘Tier’ (remember those!?)."
        },
        {
            "text": "It was a slog; I won’t lie, but I was lucky to have an amazing support network around me and someone on the end of the phone (or Zoom party) at any point. My job at Defra also helped to keep me sane throughout it all; we have a range of resources and support mechanisms available to us and I will be forever grateful for that."
        },
        {
            "text": "I’m also resilient (a good ole divorce and the inside of a court gives you that), so silver linings have played their part in my journey. Again, I count myself lucky."
        },
        {
            "text": "Flippancy and humour will only get you so far though. For some, loneliness is not a laughing matter. Not everyone has an abundance of friends and family, or a job, they can rely on."
        },
        {
            "heading": 5,
            "text": "Charlotte has been getting plenty of training in ahead of her 3 Peaks Challenge."
        },
        {
            "heading": 2,
            "text": "My turn to give something back"
        },
        {
            "text": "I feel now it’s my turn to give something back. In the past I’ve completed ‘fun-runs’ for various charities, and last year I volunteered for the Matthew Tree Project, packing fruit and veg boxes to send out to families who are borderline homeless. Sadly there are more than you might think."
        },
        {
            "text": "The Matthew Tree Project is a Bristol-based charity, supplying food, financial advice and signposts to other important networks such as NextLink Housing, a women’s abuse helpline and charity for anyone across the region who might need help before they get to the point of being on the streets. Both are super worthy causes if you can spare the time, all run by fantastic volunteers."
        },
        {
            "text": "In my efforts to give something back this year I’m also taking on the 3 Peaks Challenge in June. I’m currently in ‘training’ (yes, real training, apparently!), including mini-mountain walks (I’m sure Pen-Y-Fan counts..?). I’m hoping to raise some money for the mental health charity MIND, to help tackle some of these issues and support those that are not so lucky, or who are so far into the black void they can’t see a way out. Please support me if you can, any little helps."
        }
    ]
}