{
    "url": "https://dragonsden.blog.gov.uk/2025/10/30/dragons-den-ip-blog-series-22-episode-14/",
    "title": "Dragons Den IP Blog - Series 22 Episode 14",
    "authors": [
        "Jeff Webb"
    ],
    "categories": [
        "Business",
        "IP",
        "Licensing",
        "Patents",
        "Trade marks"
    ],
    "pub_date": "2025-10-30T21:00:00+00:00",
    "content": [
        {
            "text": "Tonight was the final episode of this series of Dragons’ Den and I thoroughly enjoyed hearing about the products and seeing how the Dragons and entrepreneurs interacted with each other. As a patent examiner, there was one entrepreneur in particular that stood out to me - Rajan Bhojwani - pitching his business, SeeTheTape®.  "
        },
        {
            "heading": 3,
            "text": "Solutions for a sticky situation "
        },
        {
            "text": "SeeTheTape® shows how a simple idea can lead to a patented invention and a useful product. Rajan’s invention is trying to solve a problem we’ve all experienced; the frustration that is finding the end on a normal roll of sticky tape. It was his experience as an eye surgeon that inspired him to come up with a solution to this problem. "
        },
        {
            "text": "As part of Rajan’s medical work, he examines the cornea of the eye (the clear part in front of the pupil) to detect fine lines in it. Because the cornea has the dark pupil as a background, the lines are easier to see and so Rajan transferred this idea to the tape. "
        },
        {
            "text": "He realised that if clear tape is wound on to a reel with a black or dark background, it would become much easier to see the end of the tape. He experimented with this idea and found that it worked. A simple idea, but after conducting some research he realised that such a tape roll  had not been invented for this purpose before. Rajan then began the patent application process. "
        },
        {
            "heading": 3,
            "text": "Seeing patents "
        },
        {
            "text": "I was pleased to see that Rajan wisely used a patent attorney to file his patent application. While it is possible to file as a private applicant without a patent attorney, fewer applications are successful than those that have professional help.  "
        },
        {
            "text": "Rajan’s patent, with the agent’s help, is very well drafted, and this together with a solid new idea, has led to his granted patent which you can view at the following link.(GB2617648). "
        },
        {
            "text": "Pull out: If you’re considering applying for a patent, you can learn more about the process in our patent guidance, including getting professional support via the Chartered Insititute of Patent Attorneys.    "
        },
        {
            "text": "Deborah Meaden was initially surprised by the fact that Rajan had a patent for what sounded to them like a trivial idea. However, Rajan was able to show the documentation from the UK Intellectual Property Office proving that he was going to receive a granted patent and was also able to produce the claims- the set of statements that define the invention and its scope. Sara Davies looked at these and was impressed with how claim 1 (the main claim setting out the scope and main inventive concept) was a strong and clear claim to an invention.  "
        },
        {
            "heading": 3,
            "text": "Licensing advice from Dragons "
        },
        {
            "text": "Peter Jones was rather sceptical that such an idea would lead to a good business and recommended that a more successful business model would be to license his invention to a large, established tape manufacturer and receive royalty payments. "
        },
        {
            "text": "Licensing is certainly one way of using one’s intellectual property. However, Rajan clearly felt that his business, which had just started trading, had a good chance of success and wanted to develop it himself. He also had some samples of the tape to show the Dragons, and all of them were able to see (pun intended) how well it worked. "
        },
        {
            "heading": 3,
            "text": "Will Rajan stick a deal? "
        },
        {
            "text": "Finally, Steven Bartlett agreed to invest in his business. He was impressed with the patent support that the invention had and felt that it was worth investing in, as often it’s the seemingly simple ideas or products can lead to great success.  "
        },
        {
            "text": "Rajan had originally asked for an investment of £35,000 for a 25% stake in the company. He was initially offered all of the money for a 50% stake, but negotiated it down to 40%, which was accepted by the Dragon, and the deal was struck. "
        },
        {
            "text": "Well, it was another fascinating episode of Dragons’ Den, with a great study on how even simple products can earn patent protection.  "
        },
        {
            "text": "A key take away from this episode is that what may sound like a very simple idea, is not necessarily easy to think up in the first place. There are many tape manufacturers and tape has been made for a very long time. However, no one before had come up with Rajan’s particular solution to the hidden tape-end problem, showing that ideas don’t have to be complex to be innovative.  "
        },
        {
            "text": "Disclaimer:  "
        },
        {
            "text": "The purpose of the IPO's Dragons' Den IP blog is to help identify the IP in entrepreneurs’ pitches and highlight how IP works, or could work, in the real-life examples featured. IPO’s authorship of this blog does not constitute its endorsement or sponsorship of any products, individuals or businesses referenced within it. "
        }
    ]
}