{
    "url": "https://dcmslibraries.blog.gov.uk/2025/10/30/green-libraries-week-2025/",
    "title": "Green Libraries Week 2025",
    "authors": [
        "Hinna Vayani, CILIP"
    ],
    "categories": [
        "Library news"
    ],
    "pub_date": "2025-10-30T12:13:03+00:00",
    "content": [
        {
            "text": "Green Libraries Week, led by CILIP, is the national, annual celebration of libraries, across all sectors – from public libraries on the high street to national, health and academic libraries. The focus is on libraries leading climate and sustainability initiatives for their users and communities."
        },
        {
            "text": "The week is a showcase of the very best that libraries have to offer, where they can get creative with ideas and organise inspiring activities to engage and connect with communities, their local partners and the media to highlight the diverse ways that they are working with users to build skills and awareness around sustainability. "
        },
        {
            "text": "It connects libraries across England, Wales, Northern Ireland and Scotland to support them with green initiatives and the Green Libraries Week Map is the key feature that brings all activities together. "
        },
        {
            "text": "This year Green Libraries Week is running from Monday 27 October to Sunday 2 November 2025, celebrating libraries with a focus on the climate and sustainability through the theme for 2025 – Seeds of change – make a difference with your library.  "
        },
        {
            "text": "Some activities planned this year have had a focus on the theme and are featured on the 2025 map - "
        },
        {
            "text": "The week has proven to bring about better awareness and engagement with green action since its first year in 2023. In 2024, librarians fed back with some key reasons why this week is important to their services and communities. Some examples of the feedback were: "
        },
        {
            "text": "‘Green Libraries Week ties in with corporate priorities, net zero and sustainability targets by linking the week to corporate agenda for libraries.’ "
        },
        {
            "text": "‘Libraries get to work with partner agencies and make Green Libraries Week an educational week.’"
        },
        {
            "text": "‘The pupils showed high interest in participating in the workshops. It was a very good program for schools, and it could relate to the curriculum too.’"
        },
        {
            "text": "Green Libraries Week is part of the Green Libraries Campaign. For more information on the campaign’s previous and current work, visit: https://www.cilip.org.uk/page/GreenLibraries "
        }
    ]
}