{
    "url": "https://ofqual.blog.gov.uk/2025/10/30/qualifications-that-work-for-learners-and-accountability-when-they-dont/",
    "title": "Qualifications that work for learners – and accountability when they don't",
    "authors": [
        "Amanda Swann"
    ],
    "categories": [
        "Regulation"
    ],
    "pub_date": "2025-10-30T09:30:00+00:00",
    "content": [
        {
            "text": "Every year, over 11 million qualifications are awarded in England – from GCSEs and A levels to vocational qualifications in healthcare, construction, childcare and many other sectors. These qualifications are the foundation of opportunity. They recognise students’ achievements, help them progress, and give employers confidence in the people they're hiring."
        },
        {
            "text": "The system works well. But when things go wrong – when awarding organisations fall short of the standards we all expect of them – the consequences matter for the students taking qualifications and for everyone who relies on qualifications being fair and accurate.  "
        },
        {
            "text": "In some cases, failure to meet the high standards we expect of our qualifications can lead to stress for students and delays to their progression."
        },
        {
            "text": "We need a regulatory approach that is clear, proportionate and effective – one that enables awarding organisations to take swift action to deal with problems but also enables us to act decisively when our high standards are not met."
        },
        {
            "text": "Today, we're publishing an updated policy that does exactly that."
        },
        {
            "heading": 2,
            "text": "An agile enforcement policy for regulating exams and assessment"
        },
        {
            "text": "Ofqual has published an updated compliance policy for awarding organisations, now called Supporting Compliance and Taking Regulatory Action."
        },
        {
            "text": "Ofqual's previous policy was last updated in 2012. We received extensive feedback through consultations in 2019 and 2025, which directly shaped this revision. The updated policy reflects how we regulate today, with a focus on early engagement with awarding organisations, proportionality, and transparency."
        },
        {
            "heading": 2,
            "text": "Key updates"
        },
        {
            "text": "There are 3 main updates:"
        },
        {
            "text": "The Chief Regulator’s Rebuke is a new regulatory tool that fills an important gap in our enforcement options. We would propose to issue a rebuke when we have determined that an awarding organisation is in breach of our rules, but the matter may not be serious enough to warrant a financial penalty."
        },
        {
            "text": "2. A new appeals process for awarding organisations"
        },
        {
            "text": "Awarding organisations will have a right of appeal if they disagree with a determination of non-compliance or the issuing of a Chief Regulator's Rebuke. Appeals are to be heard by Ofqual's Enforcement Panel, providing a clear and fair route to challenge regulatory decisions. This adds an important layer of procedural fairness to our regulatory approach."
        },
        {
            "text": "3. Introducing a more efficient process when taking regulatory action"
        },
        {
            "text": "We have introduced more flexibility in how we issue Notices of Intention that reflects regulatory practice in other sectors. This will reduce the burden on awarding organisations and allow for the process to move swiftly to resolution."
        },
        {
            "heading": 2,
            "text": "Implications for awarding organisations"
        },
        {
            "text": "This policy does not introduce any new requirements for awarding organisations. Instead, it emphasises our commitment to working flexibly by using non-statutory tools – such as setting requirements or accepting undertakings – before considering formal enforcement action."
        },
        {
            "text": "This proactive and proportionate approach aims to resolve issues efficiently while maintaining the regulatory standards that protect learners and the value of qualifications."
        },
        {
            "text": "We have also clarified how and when we publish enforcement decisions, improving transparency while ensuring fairness. For example, as with our existing approaches, we will give awarding organisations a fair opportunity to consult with us and challenge decisions before they become public."
        },
        {
            "text": "These changes reflect Ofqual’s stewardship approach to regulation –  ensuring that qualifications remain high quality, and fair for all. "
        },
        {
            "text": "Amanda Swann"
        },
        {
            "text": "Executive Director for General Qualifications, Ofqual"
        }
    ]
}