{
    "url": "https://environmentagency.blog.gov.uk/2025/10/30/radioactivity-in-food-and-the-environment-2023-24/",
    "title": "Radioactivity in food and the environment (2023-24)",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Nuclear",
        "Regulated industry"
    ],
    "pub_date": "2025-10-30T09:40:10+00:00",
    "content": [
        {
            "text": "We’ve just published our annual report about radioactivity in food and the environment. Our radiological monitoring and assessment specialists Becca Williams and Rob Dean share the headlines from our monitoring and assessment work and talk about how artificial radioactivity gets into the environment."
        },
        {
            "text": "Headlines"
        },
        {
            "text": "Radioactivity in food and the environment is safe."
        },
        {
            "text": "Overall, between 2023 and 2024 there were no major changes to the radioactivity measured in food and the environment. And the public’s exposure to radiation from sites permitted by the Environment Agency was well below legal limits."
        },
        {
            "text": "Our radiological monitoring team"
        },
        {
            "text": "The Environment Agency’s radiological monitoring team work remotely in different parts of England. We manage several different monitoring programmes that measure radioactivity in the environment and support the production of the annual Radioactivity in Food and the Environment (RIFE) report. We also provide radiological assessment advice to ensure protection of the environment and the public from impacts of radioactive discharges."
        },
        {
            "text": "Independent monitoring programmes"
        },
        {
            "text": "We run several different radioactivity monitoring programmes that are independent of the nuclear industry in England and Wales. We monitor many different samples including air, rainwater and sources of drinking water. We also monitor grass and seaweed and our partner organisation monitors different food types such as milk."
        },
        {
            "text": "The results of all our programmes are published annually in the RIFE report. The programmes:"
        },
        {
            "text": "We use specialist laboratories to carry out the analysis and measurements and again this year’s RIFE report contains over 10,000 pieces of analysis and measurements."
        },
        {
            "text": "How do artificial sources of radioactivity get into the environment?"
        },
        {
            "text": "It’s worth remembering that radioactivity is all around us. It occurs naturally in the Earth’s crust and in most of our homes, in food we eat, water we drink and the air we breathe. We are also exposed to artificial sources of radioactivity, such as those used in medical settings, nuclear power stations and from nuclear weapons testing fallout and historic nuclear incidents."
        },
        {
            "text": "It’s a legal requirement to make sure the amount of artificial radioactivity that people are exposed to from discharges is kept within a safe limit. The requirements for regulating public exposure from the disposal of radioactive waste in England and Wales are set out in the Environmental Permitting (England and Wales) Regulations 2016 (as amended) which transposes the requirements of the Basic Safety Standard Directive."
        },
        {
            "text": "If any organisation in England, such as a nuclear power station operator, university research laboratory or hospital, wants to use radioactive substances they must have a permit from the Environment Agency. These environmental permits contain strict conditions (rules) that they must always follow. We also set specific limits on what they are allowed to release when carrying out certain activities."
        },
        {
            "text": "Before we issue a permit we assess how discharges of radioactivity will affect humans, plants and animals on land and in rivers and marine environments. The methodology and system used by our scientists to assess radiation doses to people and wildlife is published on gov.uk."
        },
        {
            "text": "Our nuclear regulators carry out checks to make sure that operators do not release radioactivity above the limits set in their permit conditions."
        },
        {
            "text": "But it’s worth emphasising, as the diagram below shows, only a small percentage of all radioactivity in the environment is artificial. Most is naturally occurring."
        },
        {
            "text": "How we assess exposure to radiation"
        },
        {
            "text": "Our monitoring programmes help us to understand the levels of radioactivity in food and the environment."
        },
        {
            "text": "We use habit surveys to investigate the behaviour and diet of people living near nuclear sites to assess their exposure to radiation. Experts conduct interviews with members of the public, focussing on identifying those who are most likely to be exposed to radiation. We use this data alongside environmental monitoring data to estimate doses of radiation the public is exposed to. These estimated doses are reported annually in our RIFE report."
        },
        {
            "text": "Habit surveys were published this year for Sellafield, Hartlepool and Hinkley Point."
        },
        {
            "text": "Learn more"
        },
        {
            "text": "We publish information from our monitoring programmes every autumn. You can read this year’s short summary and detailed report on GOV.UK  or look back at previous year’s reports on the National Archives."
        },
        {
            "text": "We’ll be sharing the results with communities around nuclear sites and environmental groups through our reports to site stakeholder groups and other local engagements. If you have any questions comment below or email nuclear@environment-agency.gov.uk"
        }
    ]
}