{
    "url": "https://ipo.blog.gov.uk/2025/10/30/the-ouija-board-the-invention-that-named-itself/",
    "title": "The Ouija board: the invention that named itself",
    "authors": [
        "Amber Ockenden"
    ],
    "categories": [
        "Innovation",
        "International",
        "Patents",
        "Trade marks"
    ],
    "pub_date": "2025-10-30T10:00:00+00:00",
    "content": [
        {
            "text": "The Ouija board remains one of the most recognisable items in popular culture. With its decorated wooden surface featuring letters, numbers, and the words \"yes\", \"no\", \"hello\", and \"goodbye\", it is said to connect the living with the dead. "
        },
        {
            "text": "But did you know the intellectual property (IP) history of the board is just as fascinating as its mystical reputation? From family feuds over patents to a trade mark that's survived nearly a century, this seemingly simple wooden board tells a compelling story of innovation, protection, and commercial genius. "
        },
        {
            "heading": 3,
            "text": "Spiritualism's golden age sets the stage "
        },
        {
            "text": "The board emerged during the late 19th century when spiritualism flourished across Europe and America. The enormous loss of life during the American Civil War sparked unprecedented interest in communicating with the deceased. Many families had no bodies to bury, making spiritualism's promise of contact particularly powerful. By 1897, spiritualism had more than eight million followers in the United States and Europe. Communicating with the dead wasn’t considered bizarre, and the users were primarily middle and upper class citizens seeking comfort and answers - the stage was set for a commercial breakthrough. "
        },
        {
            "heading": 3,
            "text": "From talking boards to business opportunity "
        },
        {
            "text": "When newspaper reports circulated about Ohio's mysterious \"talking board\" that could answer any question, entrepreneurs Charles Kennard and E.C. Reiche spotted a golden opportunity. They collaborated to manufacture their own version, with local attorney Elijah Bond investing in the venture."
        },
        {
            "text": "Whether you’re a believer or sceptic, according to its creators the Ouija board genuinely named itself. The distinctive name came from Helen Peters, a medium using the board with Bond one evening in 1890. When she asked what they should call it, the planchette spelled \"Ouija\". When asked what this meant, it responded \"Good Luck\". "
        },
        {
            "text": "The Kennard Novelty Company were formed the day before Halloween in 1890 – and securing IP protection proved challenging. Initially rejected by the local Patent Office, Bond travelled to Washington D.C. There, the Chief Patent Officer granted approval after the board correctly spelled out his name. Perhaps the most unusual patent demonstration in history! You can view the patent via this link: Patent US446054. "
        },
        {
            "heading": 3,
            "text": "Branding the board "
        },
        {
            "text": "After Kennard left the company in 1891, William Fuld began producing talking boards under license. Though he didn’t claim to have invented the Ouija board, Fuld's marketing brilliance transformed it completely. He pioneered the family's legal claim to the Ouija board, coming into possession of Elijah Bond’s patent (US479266, 1892) and shifted it from a simple answer-seeking tool into an occult device for communicating with the dead. He further expanded his IP portfolio by registering the United States (US) trade mark for the word \"Oracle\" in 1902 (US Number: 37806). "
        },
        {
            "text": "His practice of stamping \"Original Ouija Board\" and \"Inventor\" on his boards contributed significantly to this perception, and his commercial success continued until his death in 1927. Fuld died after falling from his new factory roof, and the claim that the Ouija board had instructed him to construct the very building added to the board's mysterious reputation. "
        },
        {
            "heading": 3,
            "text": "Family feuds and IP battles "
        },
        {
            "text": "The Fuld family's involvement with Ouija board IP wasn't without drama. William initially partnered with his brother Isaac to manufacture boards but when their relationship soured in 1901, the partnership split spectacularly. "
        },
        {
            "text": "Isaac continued manufacturing talking boards under the name \"Oriole\". These were exact replicas of their previous designs, directly violating an injunction. William sued his own brother in a legal battle that raged until 1919.  "
        },
        {
            "text": "Understanding market dynamics perfectly, Fuld even created his own cheaper competitor in 1919. The \"Mystifying Oracle\" was an exact replica of his Ouija board sold at a lower price point, all protected by the same IP rights"
        },
        {
            "text": "William's son William Andrew registered a US design patent (Number: d114,534) in 1939 and, most significantly, the \"Ouija\" trade mark in January 1950 (US Number: 519,636). This same trade mark still protects the brand in the US under toy giant Hasbro - nearly a century of continuous protection. "
        },
        {
            "heading": 3,
            "text": "From spiritualism to horror: cultural transformation changes everything "
        },
        {
            "text": "The 1973 film \"The Exorcist\" dramatically changed public perception of Ouija boards. The film's implication that a child became possessed after using the board shifted its image from spiritual tool to horror object, and subsequent films and public sentiment followed suit. "
        },
        {
            "text": "This cultural shift didn't diminish the board's commercial success - if anything, it expanded it. The horror association opened new markets, from Halloween decorations to collector's editions, while the original spiritualist audience remained loyal. Modern manufacturers have capitalised on both aspects, producing everything from glow-in-the-dark versions to vintage reproductions.  "
        },
        {
            "text": "The Ouija board's journey from spiritualist tool to household name demonstrates how IP protection enables both innovation and cultural evolution. The same trade mark registered over 70 years ago continues to protect this iconic brand, the American design patent from 1939 still influences modern board layouts. "
        },
        {
            "text": "The board continues to captivate imaginations worldwide, proving that sometimes the most enduring innovations come from the most unexpected places. Whether you believe in its supernatural powers or simply admire its commercial success, the Ouija board remains a masterclass in the power of protected IP. "
        }
    ]
}