{
    "url": "https://defradigital.blog.gov.uk/2021/11/10/all-in-a-days-work-the-life-of-a-delivery-manager-in-defra-digital/",
    "title": "All in a day’s work: the life of a Delivery Manager in Defra Digital",
    "authors": [
        "Mike Douthwaite"
    ],
    "categories": [
        "Defra digital",
        "Defra interaction",
        "Defra services",
        "Software tools",
        "User research"
    ],
    "pub_date": "2021-11-10T16:18:23+00:00",
    "content": [
        {
            "text": "With a departmental mission ‘to restore and enhance the environment for the next generation’ it’s easy to see why I’m proud to work at Defra."
        },
        {
            "text": "I’m currently working on a project to improve public access to several flood digital products, helping them to find the services and information relevant to their needs more easily."
        },
        {
            "text": "I also look after one of the main flood digital services ‘Check Your Long-Term Flood Risk’ and the increasingly important ‘Natural Flood Management’ digital content."
        },
        {
            "heading": 2,
            "text": "What I do as a Delivery Manager"
        },
        {
            "text": "As a Delivery Manager, I help to deliver new digital public services and improve existing ones, which is rewarding in itself, but it’s what’s involved in agile delivery that makes it great. I work with a diverse range of colleagues with different views, approaches, methods and personalities, all experts in their own specialisms, sharing a common passion to make life easier for end users."
        },
        {
            "text": "I support the teams to deliver by creating a psychologically safe working environment where they can thrive, protecting them from external influence, then leaving them to get on with it!"
        },
        {
            "text": "I empower my teams to decide the ways we work and what tools we use. Supporting my colleagues’ wellbeing and work-life balance helps to build trust.  Being flexible around timings and tools to give people that balance is something that Defra has personally been very supportive of through Covid."
        },
        {
            "text": "Traditional agile ways of working have sometimes been difficult to maintain away from the office, however with the increased use of digital communication tools, those ‘face to face’ informal conversations so critical to agile working have continued. With offices reopening, I look forward to the return of physical sticky note workshops."
        },
        {
            "heading": 2,
            "text": "Adding value and celebrating our successes"
        },
        {
            "text": "I ensure agile ceremonies add value, retros happen without fail, and are an enjoyable, fun experience wherever possible. I speak to individual team members daily, just to check in, but frequently pick something up about their current work or wellbeing. We’ll agree a plan and create a roadmap with the Product Owner to keep focus and direction and stakeholders up to speed."
        },
        {
            "text": "When the agile environment is in place and the team is happy, I help build and maintain momentum, grow confidence, not to be risk-averse, quash any last-minute nerves and release frequently - iterating based on user needs."
        },
        {
            "text": "I encourage the teams to shout about their work regularly through show and tells, blogs, share findings with their peers at their own community meet ups and, importantly, celebrate successes within the team!"
        },
        {
            "heading": 2,
            "text": "Is that everything?"
        },
        {
            "text": "No!  Before all of this I’ve supported the Product Owners with the business case and recruited the dev teams (it’s essential to get the right people in!). While the teams are working on their agreed sprint goals and activities, I’ll be focusing on any required governance - it helps to engage with the Portfolio Management Office team early and regularly throughout.  I’ll be addressing or escalating any identified blockers and linking up with other projects that may impact or overlap with ours."
        },
        {
            "text": "I’ll be coaching team members, if health-checks or one to one conversations have identified any agile development needs, or if I’ve noticed any issues."
        },
        {
            "text": "It’s also part of my role to advocate agile ways of working across the organisation, selling the benefits, particularly the reduced risk, by speaking to interested or unacquainted stakeholders individually, or inviting them along to observe ceremonies."
        },
        {
            "heading": 2,
            "text": "Is there any time left for development?"
        },
        {
            "text": "Yes! Professional development is actively encouraged; formal courses, conferences, mentoring, whatever you need to keep you up to speed in the agile world is all available and pushed by our leadership team.\nIn addition, support is readily available from my immediate Defra delivery management team, cross government department communities, and the wider UK civil service community all at the drop of a (Slack message) hat!"
        },
        {
            "text": "I’m lucky to be part of a great team in an amazing department – I would recommend it to anyone!"
        },
        {
            "heading": 2,
            "text": "Find out more about Delivery Manager roles in Defra\n"
        },
        {
            "text": "If you have been inspired and enthused by what you’ve read here, and you feel passionate about working in a role where you really can make a positive impact, we would love to hear from you."
        },
        {
            "text": "We’re currently recruiting for Delivery Managers at Defra. Read the job advert and find out how to apply."
        },
        {
            "text": "Top tips if you’re new to applying for Civil Service Jobs."
        },
        {
            "text": " "
        }
    ]
}