{
    "url": "https://educationhub.blog.gov.uk/2021/11/an-open-letter-to-parents-and-carers-of-children-and-young-people-with-special-educational-needs-and-disabilities-from-children-and-families-minister-will-quince/",
    "title": "An open letter to parents and carers of children and young people with special educational needs and disabilities from Children and Families Minister Will Quince",
    "authors": [
        "Media Officer"
    ],
    "categories": [
        "SEND"
    ],
    "pub_date": "2021-11-10T13:54:26+00:00",
    "content": [
        {
            "text": "Children and families Minister Will Quince has written to all parents and carers of children and young people with special educational needs and disabilities to talk about his ambitions for them and their children. "
        },
        {
            "heading": 3,
            "text": "To all parents and carers of children and young people with special educational needs and disabilities (SEND)"
        },
        {
            "text": "I am delighted to have been appointed as Parliamentary Under Secretary of State for Children and Families. I feel privileged to be in this role – working to improve the life chances of all children and ensuring those who need additional support get help quickly so they can realise their potential. I want to assure you that I am wholeheartedly committed to the SEND Review. It is vital work and as we move towards publication of our proposals in the coming months, it is key that your children, families, teachers and others who play a vital role are actively involved."
        },
        {
            "text": "As a father myself, I know how important it has been to get back to school in a way that, for most, should have felt more normal than last year. In our first few weeks, the Secretary of State and I have been on a number of visits because we wanted to speak to teachers, pupils, students, and parents early on. We heard about fantastic work in mainstream and specialist settings to make sure children and young people could access education throughout the pandemic and are able to access support to catch up now."
        },
        {
            "text": "As parents and carers of children with SEND, you are seeking change to the system so that your children get support earlier and outcomes improve alongside better access to jobs and services. I am committed to delivering the SEND Review quickly but we do need to make sure our proposed changes are robust. The Review has been delayed, in part due to the pandemic which has intensified some of the issues in the system, and we have needed time to reflect on those. We also wanted to do justice to the huge amount of input we have received and take time to check back with people that we had properly understood what they were telling us. I agree improvements are needed – and overdue."
        },
        {
            "text": "To help us move forward and enable us to publish proposals in the first quarter of 2022, we have established a steering group that brings together government departments with representatives of parents, schools, colleges and early years, local government, health and care and independent experts. You can find out more about the steering group here: www.gov.uk/government/groups/send-review-steering-group."
        },
        {
            "text": "We will of course continue to work with a wider range of organisations to hear further from young people, parents and those who work with them so they can inform and challenge our thinking."
        },
        {
            "text": "We still have work to do on the Review and I do not think it is helpful to offer up specific details ahead of publication of the full set of proposals. I think it would be more helpful for people to see them all together, so that they can make an informed judgement about whether they will lead to the lasting changes we all want to see. What I can say at this point is that, based on what we have heard and the evidence we have gathered, we know that it is important that proposals offer a way forward to reduce local variation. We also need to improve early intervention, make clearer the support and services everyone should be able to expect and have funding and accountability systems in place which support this. Improving complex systems is challenging and our proposals must align with other improvement work currently underway, such as the Care Review, recovery planning and wider reform. And we need to make sure changes we propose are supported and understood across health and care services, as well as education providers."
        },
        {
            "text": "As an indication of this government’s continued commitment to supporting the most disadvantaged children and young people, I was delighted that the recent budget announcement committed £2.6 billion over the next three years for school places for children and young people with SEND, more than tripling current capital funding levels to over £900 million by 2024-25. The Spending Review also delivers an additional £4.7bn for the core schools budget by 2024-25. This settlement includes an additional £1.6bn for schools and high needs in 2022-23, on top of the funding we previously announced. We will confirm in due course how this additional funding for 2022-23, and for the two subsequent years, will be allocated for schools and high needs. This is a hugely positive outcome."
        },
        {
            "text": "Over the coming months, I will be making more visits and listening to children, young people and their parents and school, college and local authority staff, as well as meeting with SEND organisations and experts, across education, health and care. Their views will influence the proposals we set out in a full public consultation. I strongly encourage people to get involved in that consultation. Your views really matter."
        },
        {
            "text": "I don’t underestimate the challenge we face. But continuing to listen, and working together, gives us the best chance to make sure all children and young people get the educational experience they deserve."
        },
        {
            "text": "Will Quince MP"
        },
        {
            "text": "Parliamentary Under-Secretary of State for Children and Families"
        }
    ]
}