{
    "url": "https://apprenticeships.blog.gov.uk/2021/11/10/automotive-apprentice-working-towards-an-electric-and-more-sustainable-future/",
    "title": "Automotive apprentice working towards an electric and more sustainable future",
    "authors": [
        "Institute for Apprenticeships"
    ],
    "categories": [
        "Apprentices",
        "Apprenticeship standards",
        "Employers",
        "Services"
    ],
    "pub_date": "2021-11-10T09:33:01+00:00",
    "content": [
        {
            "text": "As we move towards the end of COP26, we highlight the work of Luke Kwan, a product design and development apprentice. The work on his level 6 apprenticeship at Jaguar Land Rover involves moving away from fossil fuels towards electric vehicles. His apprenticeship has given him first-hand experience and a degree in engineering, and using all his new skills, he will help to create a greener future."
        },
        {
            "text": "\nLuke Kwan, 21, from Manchester, is currently doing an engineering degree apprenticeship at Jaguar Land Rover in Gaydon."
        },
        {
            "text": "After looking through all the options, the opportunity to do a degree apprenticeship was an offer Luke couldn’t turn down. Being able to work in a professional engineering environment while also learning the theory side of the work at a top-class university made the decision to join Jaguar Land Rover an easy one. He’s also been extremely impressed by the professional and personal development opportunities he has access to:"
        },
        {
            "text": "“Being at a company with a large early career’s population means there is a big community of apprentices, graduates and undergraduates which creates something akin to a university experience, just without the student debt!”"
        },
        {
            "text": "Luke joined Jaguar Land Rover at a time where the automotive industry is going through a huge transition with the development of new technologies and the move away from petrol and diesel to more sustainable alternatives. Luke’s work as part of the advanced product creation team means he has had direct involvement in developing these technologies with a clear focus on sustainability, not just by electrification but also through the materials they use. A role which helps Luke see how his decisions can affect vehicles launched in the future."
        },
        {
            "text": "Luke is part of a small team that is looking at how Jaguar as a brand can reimagine itself to an all-electric platform from 2025. As a vehicle engineer, Luke looks at all areas of a vehicle, including body components, electronics, powertrain and materials. Other tasks include reviews with clay model designers and organising the creation of a fleet of test vehicles."
        },
        {
            "text": "“Working at such an early stage in the development cycle means that I see the processes that are used to move a concept to reality. It’s really exciting to know that I have played a part in the development, and I can’t wait to see the reaction from customers in the future.”"
        },
        {
            "text": "As a small, very experienced and knowledgeable team, Luke has learnt a lot from them, which he says is one of the best parts about his apprenticeship. Luke says that he has been able to get involved directly with other teams like the marketing, finance and designs teams and that has opened his eyes to even more processes that are required to launch a new vehicle."
        },
        {
            "text": "Luke thinks everyone should consider a degree apprenticeship. The chance to become a degree qualified engineer whilst earning a wage is what makes it a really stand out opportunity:"
        },
        {
            "text": "“I love that every day at work is different and the work I am doing is directly impacting products that will be launched in the future. The opportunity to help reimagine such a prestigious brand comes along once in a career, and I am so grateful that I have been given the chance to contribute.”"
        }
    ]
}