{
    "url": "https://educationinspection.blog.gov.uk/2021/11/10/back-into-a-routine-looking-at-schools-in-light-of-covid/",
    "title": "Back into a routine: looking at schools in light of COVID",
    "authors": [
        "Christopher Russell"
    ],
    "categories": [
        "curriculum",
        "education inspection framework"
    ],
    "pub_date": "2021-11-10T10:17:47+00:00",
    "content": [
        {
            "text": "Chris Russell, National Director for Education, on our return to routine inspection and the COVID context. "
        },
        {
            "text": "This is my first blog post as National Director, and it’s fitting to start with a thank you – to schools, colleges and other providers – for all you’ve done for children over the last year and a half, and for what you’re still doing. While getting children back on track is no easy task, the effort is clearly well underway."
        },
        {
            "text": "To say that it’s been a difficult 18 months for education would be putting it mildly. And the pandemic is still posing many challenges, so I don’t think anyone would say we’re out of the woods just yet. Some schools are still having to deal with COVID-related absences and are working hard to bridge the gap for children at home."
        },
        {
            "text": "But it does feel like we’re moving – albeit slowly – towards normality. And I know many leaders and teachers are glad to be getting on with the business of educating, even if it isn’t exactly business as usual."
        },
        {
            "text": "At Ofsted, we’re glad to be working a bit more normally too – going back into schools and having conversations with leaders and teachers on inspection about how they’re helping children to catch up. I appreciate this feels like a big step. But it’s the right move – both for children, who’ve missed out on so much, and for parents, who want some assurance about what’s happening for their children."
        },
        {
            "heading": 3,
            "text": "The COVID context"
        },
        {
            "text": "We do understand that things aren’t ‘normal’, and it’s only fair that inspection recognises this. So that’s exactly what we’re doing. We’ve worked hard to adapt the education inspection framework (EIF) and train our inspectors so that we can inspect fairly and reliably this term, taking the full impact of COVID into account."
        },
        {
            "text": "Our expectation is that all inspections are grounded in a thorough understanding of the particular challenges a school has faced, and is still facing. So, we’ll always ask leaders about the impact of COVID. This will help us understand the context for the school – though we’ll only report on it in detail when we think it will help parents understand how a school is doing. So far this term, we’re seeing many schools doing great work and we haven’t needed to describe the COVID impact in detail."
        },
        {
            "text": "When we introduced the EIF, leaders and teachers said they really appreciated our focus on ‘substance’ and curriculum. This focus hasn’t changed. And, if anything, it couldn’t be more relevant than right now, as schools work so hard to get children back on track."
        },
        {
            "text": "We still want to see schools offering an ambitious curriculum, with a broad range of subjects. But we understand that tough choices have been made during the pandemic about what to keep in and what to leave out. And in many schools, curriculums might not be fully realised, or might still be in transition. Inspectors will want to discuss the reasons why, and to understand what leaders are doing to get their curriculum where they want it to be. We’re confident that our inspector training and ongoing checks will make sure we’re getting underneath these issues."
        },
        {
            "heading": 3,
            "text": "Rebalancing inspection"
        },
        {
            "text": "One of the biggest changes to inspection is, of course, the removal of the exemption from inspection for outstanding schools. It’s natural that schools in the top bracket might feel a bit of unease at this change. But it’s so important for children, and for parents, that we get a clear view of education in these schools. Some haven’t been inspected in over a decade. Many children will have gone all the way through these schools without anyone making sure things are still going well."
        },
        {
            "text": "This is a rebalancing exercise. Since 2010, there’s been a one-way valve on the outstanding grade; once achieved, it would almost never be lost. That has meant we’ve accumulated more and more outstanding schools over the years, so the current education picture is, in effect, skewed. When the exemption came in, about 1 in 10 schools were graded outstanding. Now, it’s about 1 in 5. Removing the outstanding exemption will help give us an accurate and up-to-date picture."
        },
        {
            "text": "It’s too early to estimate where we’ll end up, but we’re seeing that rebalancing start this term – particularly because we’re focusing on the schools that we haven’t inspected for a long time. A large number aren’t retaining their outstanding grade, which is to be expected. But this doesn’t mean that these aren’t good schools – the vast majority are, and parents should be pleased to send their children to them."
        },
        {
            "text": "It’s also important to stress that this isn’t to do with COVID. We haven’t inspected these schools in so long that it’s impossible to tell when a decline in standards might have happened. Indeed, some schools may have seen a drop in standards several years ago, and are now improving again. So it’s important not to view the loss of an outstanding grade too negatively."
        },
        {
            "text": "As I’ve said, we’re committed to taking the pandemic into account properly and sensitively to make sure changes in grade aren’t the result of COVID pressures. Schools are retaining their outstanding grade during the pandemic, which is great to see. Others are being graded outstanding for the first time, and we’re also seeing many requires improvement or inadequate schools achieving higher grades."
        },
        {
            "text": "Ultimately, we recognise the huge efforts that schools are making to give pupils the education and support they need through the pandemic. We know that there are still challenges ahead, but everything I’ve seen tells me that children are in good hands. Children only get one chance at school, and this cohort have already had their education severely disrupted. It’s up to all of us working in the sector, including Ofsted, to make sure that their education is as good as it can be."
        }
    ]
}