{
    "url": "https://rpc.blog.gov.uk/2021/11/10/considering-environmental-issues-in-impact-assessments/",
    "title": "Considering environmental issues in Impact Assessments",
    "authors": [
        "Stephen Gibson"
    ],
    "categories": [
        "Better regulation",
        "Independent scrutiny"
    ],
    "pub_date": "2021-11-10T12:19:56+00:00",
    "content": [
        {
            "text": "The UK is currently hosting the United Nations Climate Change Conference (COP26) in Glasgow. This has highlighted the importance, both domestically and internationally, of climate change and the global action required when it comes to the environment. As part of the international efforts to reduce global warming, the UK has committed to achieving Net Zero by 2050, i.e. by that date, all UK greenhouse gas emissions would be balanced by schemes to offset an equivalent amount of greenhouse gases from the atmosphere."
        },
        {
            "text": "Environmental impacts will cut across many sectors and policies, and environmental targets tend to be set at an aggregate level and are cumulative in nature. Therefore, identifying and assessing environmental impacts consistently across all areas of government, including regulatory proposals, will become increasingly important. This blog post looks at the current regulatory system in the UK and how it deals with environmental impacts, and how the Better Regulation Framework (BRF) could help us to understand the environmental impacts of new regulations to assist in achieving Net Zero."
        },
        {
            "heading": 2,
            "text": "The current regulatory framework"
        },
        {
            "text": "The current Better Regulation Framework focuses on the net direct costs to business of new regulations and measures the cumulative burden of significant new regulations in the Business Impact Target (BIT) account, which is reported annually by Government and verified by the RPC. It does not say how the environmental impacts of proposals should be assessed and does not provide for a similar measure of the total environmental cost of the regulations that are introduced each year."
        },
        {
            "text": "While the RPC has seen many proposals that directly affect the environment, their environmental impacts are generally considered under the ‘wider impacts’ heading in impact assessments (IAs). The need to consider wider environmental impacts is underpinned by the HMT Green Book guidance on policy appraisal. All regulatory proposals that are expected to have an environmental impact require a proportionate assessment of these impacts in the IA submission."
        },
        {
            "text": "The RPC cannot currently formally provide a ‘fitness-for-purpose’ rating on the assessment of wider impacts (including impacts on the environment). However, we comment on wider impacts and whether the evidence provided on these aspects is sufficient to support decision-making. We currently use a single “quality indicator” (‘good’, ‘satisfactory’, ‘weak’ or ‘very weak’) to summarise the quality and robustness of the evidence and analysis on wider impacts collectively."
        },
        {
            "heading": 2,
            "text": "Measuring environmental impacts"
        },
        {
            "text": "A very wide range of different issues are captured under the term environmental impacts - including biodiversity, energy use, marine health, plastic waste, water, air and noise pollution, ocean acidification, ozone layer depletion, as well as carbon dioxide and other greenhouse gas emissions. It is not possible to quantify all of these environmental impacts, let alone to capture them in a single metric although it would be possible to capture a range of measures in a scorecard. We consider regulatory IAs but it is also worth noting that, environmental impact assessments may also be required for development and infrastructure projects."
        },
        {
            "text": "The environmental impacts of regulatory proposals are complex and difficult to assess. Challenges include data limitations, time lags and uncertainties in measurement. There are several guidance documents available to policymakers and analysts to support them in assessing and quantifying environmental impacts. They include the HM Treasury’s Green Book supplementary guidance on ‘climate change and environmental valuation’ and ‘valuation of energy use and greenhouse gas emissions’ for appraisal and DEFRA’s guidance on ‘valuing environmental impacts’ and ‘enabling a natural capital approach’."
        },
        {
            "text": "The RPC regularly publishes guidance and case histories, on the methodological approach to IAs. It will be important to continue to develop these to ensure environmental impacts are robustly and consistently considered."
        },
        {
            "heading": 2,
            "text": "Including the effect of regulations on CO2 equivalent emissions in Impact Assessments"
        },
        {
            "text": "COP26 has focused attention on the 2050 Net Zero commitment – which the UK was the first to enshrine in law - and tackling climate change. This creates a strong case for assessing the impact on CO2 equivalent emissions in IAs. The Government’s recently closed consultation on reforming the BRF sought views on ways to assess the wider impacts of regulation including environmental impacts. This provides an opportunity for the BRF to assist in ensuring that our climate change objectives and commitments are adequately taken into account when considering new regulatory measures."
        },
        {
            "text": "IAs could highlight the choices and trade-offs that are necessary for measures that improve the environment but have a cost to businesses, or that improve consumer welfare but have an unintended adverse impact on greenhouse gas emissions, and so assist and inform government decision making. The framework could also provide transparency over the cumulative impact of new regulations on the environment to support the achievement of Net Zero. We look forward to the Government’s conclusions on the way forward."
        }
    ]
}