{
    "url": "https://technology.blog.gov.uk/2021/11/10/creating-a-new-sustainability-point-for-the-technology-code-of-practice/",
    "title": "Creating a new sustainability point for the Technology Code of Practice",
    "authors": [
        "Lewis Dunne, Senior Policy Advisor, CDDO",
        "Sophie Jenkins, Policy Advisor, CDDO"
    ],
    "categories": [
        "Transformation"
    ],
    "pub_date": "2021-11-10T10:28:42+00:00",
    "content": [
        {
            "text": "The UK is hosting COP26 this year. The goals of this conference are to secure global net zero, protect communities and natural habitats, invest in solutions to reduce environmental impact and for countries to work together to protect our planet."
        },
        {
            "text": "As part of meeting these goals the government has written the Greening government: ICT and digital services strategy 2020-2025. There are 3 main aims:"
        },
        {
            "text": "We’ve added a new sustainability point to the Technology Code of Practice to set out some practical steps that departments can make to improve the sustainability of their technology."
        },
        {
            "heading": 2,
            "text": "Our research"
        },
        {
            "text": "Throughout last year, we collaborated with the government digital sustainability community to understand what they’re doing about sustainability now, their successes and difficulties. "
        },
        {
            "text": "The community has developed and grown a lot over the last few years, and achieved large cuts to government digital carbon emissions and waste. However, the community still struggles with visibility and opportunities to provide early input to projects and programmes. This often puts teams at a disadvantage as it’s easier and more effective to identify sustainability implications from the start of a project or programme, rather than doing it retrospectively."
        },
        {
            "text": "We used the insights from the sustainability community to draft a new point for the Technology Code of Practice. It sets out some existing best practices, and draws together resources that departments can use to reduce their projects’ environmental impact."
        },
        {
            "text": "Earlier this year, we also did user research with people in a number of departments. Our participants included those involved in the sustainability community, people who work on departmental spend controls and assurance, and people involved in running projects. We blogged about our research at the time, and also what our next steps looked like."
        },
        {
            "text": "More recently, we did some more specific engagement with departmental spend controls. It provided some further collaboration opportunities with departments and feedback on how we could best apply the sustainability point as part of the spend control process."
        },
        {
            "heading": 2,
            "text": "The result"
        },
        {
            "text": "The result of this work is the new sustainability point that we’re publishing as point 12 of the Technology Code of Practice. This also means the Service Standard will become point 13. The new point pulls together examples of current best practices to help projects consider up-front the impact of their projects on their organisations’ plans to meet the Greening Government strategy, and Net Zero by 2050. "
        },
        {
            "text": "Each technology project and programme has unique requirements and processes. This means there isn’t a single approach that will meet the needs of all project teams. With this in mind we have provided a series of questions to consider. Some will be more relevant than others, but the overall aim is to make sure each technology project or programme is as sustainable as possible. "
        },
        {
            "heading": 2,
            "text": "The benefits"
        },
        {
            "text": "Actions which can help improve sustainability runs through many of our points, but we think this is such an important area that it deserves being called out explicitly, to help projects and teams give it the consideration it needs."
        },
        {
            "text": "The benefits of using this approach to technology means projects can identify early how they can achieve the sustainability goals, and make sure they are:"
        },
        {
            "text": "Doing things like optimising and reducing computing/processing/storage doesn’t just help reduce electricity consumption, and therefore any emissions, but also help reduce cost."
        },
        {
            "text": "We see publishing this point as the starting line, not the finish. Technology Code of Practice is obviously not the solution to climate change, or even a particularly big part of a solution. But it is a statement of intent, and a commitment on our part to helping make sure that we use technology in a way that helps us achieve the goals laid out in COP26."
        },
        {
            "text": "With that in mind, as with all of TCoP and our guidance, we will be adding to and improving it over the coming months."
        }
    ]
}