{
    "url": "https://deframedia.blog.gov.uk/2021/11/10/environment-act-coverage/",
    "title": "Environment Act coverage",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2021-11-10T15:25:46+00:00",
    "content": [
        {
            "text": "There has been positive coverage of the Environment Act passing into law yesterday including in BBC News Online, Daily Express and the Evening Standard, as well as in Business Green, ENDS Report, Edie and Let’s Recycle."
        },
        {
            "text": "Through our world-leading Environment Act, we will clean up the country’s air, restore natural habitats, increase biodiversity, reduce waste and make better use of our resources."
        },
        {
            "text": "It will halt the decline in species by 2030, require new developments to improve or create habitats for nature, and tackle deforestation overseas."
        },
        {
            "text": "It will help us transition to a more circular economy, incentivising people to recycle more, encouraging businesses to create sustainable packaging, making household recycling easier and stopping the export of polluting plastic waste to developing countries."
        },
        {
            "text": "These changes will be driven by new legally binding environmental targets, and enforced by a new, independent Office for Environmental Protection (OEP) which will hold government and public bodies to account on their environmental obligations."
        },
        {
            "text": "Environment Secretary George Eustice said:"
        },
        {
            "text": "“The Environment Act will deliver the most ambitious environmental programme of any country on earth."
        },
        {
            "text": "It will halt the decline of species by 2030, clean up our air and protect the health of our rivers, reform the way in which we deal with waste and tackle deforestation overseas."
        },
        {
            "text": "We are setting an example for the rest of the world to follow.”"
        },
        {
            "text": "Work on implementing Environment Act policies is well underway. We have started work on developing legally binding environmental targets, and launched consultations on the deposit return schemes for drinks containers, extended producer responsibility for packaging and consistent recycling collections which will transform the way we deal with our rubbish."
        },
        {
            "text": "We have also published a draft Principles Policy Statement which will put protecting the environment at the heart of future policy."
        },
        {
            "text": "The Office for Environmental Protection was set up in an interim, non-statutory form in July, providing independent oversight of the Government’s environmental progress and accelerating the foundation of the full body. The OEP will formally commence its statutory functions shortly."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        },
        {
            "text": " "
        }
    ]
}