{
    "url": "https://ukhsa.blog.gov.uk/2021/11/10/the-national-collection-of-type-cultures-a-window-to-the-past/",
    "title": "The National Collection of Type Cultures - a window to the past",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "UKHSA science"
    ],
    "pub_date": "2021-11-10T13:45:38+01:00",
    "content": [
        {
            "text": "During World War I, British soldier Private Ernest Cable arrived unwell at a hospital in France. A sample of Shigella flexneri – the bacteria that causes dysentery – was taken from Private Cable, and this sample was the first and founding culture of what is now among the oldest ‘living libraries’ of bacteria in the world – the National Collection of Type Cultures (NCTC)."
        },
        {
            "text": "Housed in one of UKHSA’s largest sites, the NCTC exists to support scientists all over the world understand infectious diseases. It has been in operation for 100 years, surviving one world war, six relocations and continuous expansion. The collection has been overseen by many scientists over the last century, and The Princess Royal visited recently as part of its centenary celebrations."
        },
        {
            "heading": 2,
            "text": "A window into the past"
        },
        {
            "text": "The collection was formally established on January 1, 1920 and was originally located at the Lister institute of Preventative Medicine in Chelsea, providing a trustworthy source of authentic bacteria for use in scientific studies. Its first 200 cultures — including Private Cable’s — were deposited by Sir Frederick William Andrewes, a pathologist who studied dysentery throughout World War I."
        },
        {
            "text": "The Lister Institute was bombed during World War II, but fortunately the collection had already been moved to a farmhouse just north of London where it was preserved throughout the war."
        },
        {
            "text": "From this point, the cultures were shared amongst scientists. The practice of sharing continues, and it forms a crucial part of the world-wide effort to understand and overcome the infectious diseases we deal with now."
        },
        {
            "text": "Whether it was their intention or not, the founders of the collection created a window to the past which continues to play a vital role in modern day medicine."
        },
        {
            "text": "Today, the cultures in the NCTC help us to develop vaccines and to discover new drugs; they are vital in ensuring results from clinical diagnostic microbiology tests are accurate and internationally comparable."
        },
        {
            "text": "The collection has around 6,000 bacterial strains and is composed of more than 900 species, the majority of which having either beneficial or detrimental effects on human and animal health, or are otherwise used in infectious disease diagnostics."
        },
        {
            "text": "There are almost 800 registered culture collections globally, but the NCTC is one of the few that has a remit to only curate bacteria that are of clinical and veterinary significance."
        },
        {
            "text": "Perhaps the most famous addition is ‘NCTC 6571’, or the Oxford Staphylococcus, was used to help develop and distribute the first modern antibiotic, penicillin. Penicillin was developed as a therapeutic agent at Oxford University’s Sir Willian Dunn School of Pathology in the late 1930s and early 1940s by a team that included Sir Alexander Fleming."
        },
        {
            "text": "In 1943, Fleming added NCTC 6571 Staphylococcus aureus to the NCTC collection and declared in a letter that “all of us on the Penicillin Trials are using it”. Today NCTC 6571 is still in use as an antibiotic sensitive control, helping to ensure that penicillin can fight the bacteria it targets."
        },
        {
            "heading": 2,
            "text": "Adding to the collection and sharing samples"
        },
        {
            "text": "Back then, the method for sharing samples was very different. Bacteria were delivered alive on a medium of agar made from egg yolks and then sealed with paraffin wax. This left the chance of infection to the people who handled it wide open."
        },
        {
            "text": "Today, we use a method call freeze drying to preserve all of the strains added to the collection. This technique was introduced into the collection in 1940 and remains largely unchanged to this day."
        },
        {
            "text": "When we receive a new strain of bacteria, it is first taken to the NCTC lab and examined to establish the best way to grow it, then they are freeze dried for long-term preservation before undergoing quality checks, which ensures they are pure, viable and retain the original characteristics as described."
        },
        {
            "heading": 2,
            "text": "Modern developments and looking to the future"
        },
        {
            "text": "Since the beginning of the 21st century, one of the most historic developments occurred between 2013 and 2018 when the NCTC and the Wellcome Sanger Institute delivered long-read whole genome sequence data for more than 3000 NCTC strains. Genome sequencing is the process by which the entire DNA sequence of an organism is determined, and all the type strains preserved in the NCTC collection underwent this process."
        },
        {
            "text": "Significantly, this genomic data is freely available and can be mined by microbiologists and bioinformaticians for years to come. Recently, it has allowed NCTC scientists to use genome sequence data to gain insight into how to tackle antimicrobial resistant gonorrhoeae."
        },
        {
            "text": "The teams operating NCTC over the past 100 years have always been dedicated to using new technologies to create innovative means for scientists to interact with the collection. In addition to advances in microbiology, this also includes the application of newer communication technology, digital imaging and social media."
        },
        {
            "text": "The curators create wide networks of scientists and scientific communicators, get involved with engagement programmes, help develop training for the biomedical scientists of the future and work with artists and writers to raise awareness of what we do, and why."
        },
        {
            "text": "The NCTC team is committed to developing global relationships and working to ensure we can deal with 21st century challenges to our health."
        },
        {
            "text": "The future looks bright as we move into NCTC’s second century of providing vital information for scientific studies and developments that will help us stay healthier and safer."
        }
    ]
}