{
    "url": "https://educationhub.blog.gov.uk/2021/11/what-you-need-to-know-about-holocaust-education/",
    "title": "What you need to know about Holocaust education",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Higher Education",
        "Schools"
    ],
    "pub_date": "2021-11-10T16:54:32+00:00",
    "content": [
        {
            "text": "This week the Education Secretary visited Auschwitz-Birkenau to discuss the role of education in eradicating antisemitism and making sure young people are aware of the atrocities of the holocaust."
        },
        {
            "text": "But what happens in the education system to make sure pupils and young people understand the lessons we must all learn from the Holocaust? Here we look at what is being done to educate about the Holocaust and  combat antisemitism."
        },
        {
            "heading": 3,
            "text": "Is the Holocaust taught in schools? "
        },
        {
            "text": "We believe that every young person should learn about the Holocaust and the lessons it teaches us today."
        },
        {
            "text": "In recognition of its significance, the Holocaust is the only historic event which is compulsory within the history curriculum. Pupils must be taught about it at at Key Stage 3 (usually when pupils are aged 13-14). The Holocaust has been a named topic within the history curriculum since the first curriculum of 1991."
        },
        {
            "heading": 3,
            "text": "Is there special funding to support teaching children and young people about the Holocaust?"
        },
        {
            "text": "We also further support school pupils’ and teachers’ understanding of the Holocaust by providing funding for the following:"
        },
        {
            "text": "Education Secretary Nadhim Zahawi went to the Auschwitz-Birkenau concentration camp this week to see how the Holocaust Education Trust works with schools all over the country, including by taking pupils to see the camp first-hand."
        },
        {
            "text": "Education Secretary Nadhim Zahawi said:"
        },
        {
            "text": "Karen Pollock CBE, Chief Executive of the Holocaust Education Trust said:"
        },
        {
            "heading": 3,
            "text": "What is the International Holocaust Remembrance Alliance (IHRA) and why is important that organisations sign up to its definition of antisemitism?"
        },
        {
            "text": "The IHRA is a leading international organisation focused on eradicating antisemitism in public life and educating about the holocaust."
        },
        {
            "text": "In order to properly tackle antisemitism, it is necessary for everyone to have a clear understanding of what it is and what it looks like. So, the IHRA is establishing global consensus around a single, agreed definition."
        },
        {
            "text": "The definition is:"
        },
        {
            "text": "The more institutions sign up to this definition the easier it is for everyone to present a united front in the fight against antisemitism."
        },
        {
            "text": "The IHRA definition of antisemitism is the gold standard in the international community, and an important step in tackling antisemitism because it sends a clear signal that universities takes these issues seriously."
        },
        {
            "text": "Today, The Office for Students (OfS) has published a list of higher education providers which have adopted the IHRA working definition of antisemitism. This shows a substantial rise in the number of providers that have adopted the IHRA definition over the last 12 months, from around 30 to over 210."
        },
        {
            "text": "Universities are also expected to consistently review their policies in this area to ensure that they are meeting the needs of Jewish students and staff and are in line with their duties under the Equality Act 2010."
        },
        {
            "heading": 3,
            "text": "What can schools do if they want to improve the Holocaust education they offer?"
        },
        {
            "text": " The Government has continued to take action to support schools in this area, including:"
        }
    ]
}