{
    "url": "https://dragonsden.blog.gov.uk/2022/04/07/dragons-den-episode-14-series-19/",
    "title": "Dragons' Den Episode 14 Series 19",
    "authors": [
        "Laurien Webb"
    ],
    "categories": [
        "Business",
        "Licensing",
        "Trade marks",
        "Trade secrets"
    ],
    "pub_date": "2022-04-07T21:03:25+01:00",
    "content": [
        {
            "text": "It’s hard to believe that we have reached the last Dragons’ Den episode for Series 19 - and what a series it’s been! Tonight’s episode once again sees the hopeful entrepreneurs undergoing trial by fire, seeing the Dragons just as fierce as always."
        },
        {
            "heading": 3,
            "text": " Putting pep in Deborah Meaden’s step…"
        },
        {
            "text": "First to enter the Den was David Hellard with his particularly unusual opening pitch. Bursting into song and shaking a packet of his product, ‘Caffeine Bullet’, like a single maraca, he had me instantly engaged and eager to hear more. David was asking for 60k for 5% of his business."
        },
        {
            "text": "Like David, I rely heavily on caffeine to give me that extra kick in the morning. Unlike David, I have never used or relied on caffeine or thought of it as a supplement that could make me run marathons...until now!"
        },
        {
            "text": "Hearing him proclaim that his product could work three times faster than any other supplement on the market, I was keen to find out more. Could this be my new morning substitute to encourage a morning’s work output before I even start work for the day? I can only dream of being that person."
        },
        {
            "heading": 3,
            "text": "“How many chews did he have?\"– Sara Davies"
        },
        {
            "text": "My favourite part of any of the pitches arrived shortly after David’s enthusiastic opening. Let’s get down to the IP. Sara asked, and rightly so, “...is this protectable?” What’s going to stop Deborah from putting caffeine into a different flavoured chew?"
        },
        {
            "text": "David proclaimed that unfortunately, he doesn’t have any IP protection. Now, I’ve been asked many times throughout my career how you can protect a recipe. The answer is - with a trade secret."
        },
        {
            "text": "Many food manufacturers, such as Coca Cola, rely on trade secrets to protect their recipes. Unlike patents there is no legal obligation to disclose information when using a trade secret."
        },
        {
            "text": "Trade secrets also have no expiry date, so providing you can keep the information from leaking out, they can last for a very long time. Centuries even! This could be a great way for David to protect his recipe. We would recommend asking those with the secret to sign a non-disclosure agreement."
        },
        {
            "text": "Find out more about trade secrets in our blog about trade secrets."
        },
        {
            "text": " "
        },
        {
            "text": "Luckily for David he managed to secure investment from Peter and Steven who agreed a deal for all of the money for 12.5% stake each in David’s business. They agreed that the stake will reduce to 10% if the money is paid back within 24 months. Well done David!"
        },
        {
            "heading": 3,
            "text": "A difficult past to a brighter future."
        },
        {
            "text": "Next to enter the Den is Matt Jones, who has experienced some tough times. As well as my role in the Campaigns team in the Intellectual Property Office, I also volunteer as a mental health advocate, so I was instantly hooked when Matt started his pitch by discussing wellbeing.  "
        },
        {
            "text": "Matt was asking for a 66k investment for 5% of his business Mesoa Men - a skin and hair care range for men. "
        },
        {
            "heading": 3,
            "text": " Branding oversight?"
        },
        {
            "text": "As we headed over to the Dragons for their views on Matt’s masculine skincare range, Deborah quickly picked up on the fact that his branding didn’t feature all of the qualities of the product."
        },
        {
            "text": "You can register your trade mark to protect your brand, such as the name of your product or service. When you register your trade mark, you'll be able to:"
        },
        {
            "text": " Find out about registering a trade mark in our video below."
        },
        {
            "heading": 3,
            "text": " You’re going to need a magic wand"
        },
        {
            "text": "Fortunately for Matt, Touker offered a deal he could not refuse, even if it was for a much higher stake in his business (all of the money for 35%). Well done Matt, it seems you cleaned up with your Mesoa skincare range!"
        }
    ]
}