{
    "url": "https://defrafarming.blog.gov.uk/2022/04/07/grazing-agri-environment-schemes-and-environmental-outcomes-in-the-uplands/",
    "title": "Grazing, agri-environment schemes and environmental outcomes in the uplands",
    "authors": [
        "Rob Cooke"
    ],
    "categories": [
        "Payments to better understand moorland"
    ],
    "pub_date": "2022-04-07T13:44:17+01:00",
    "content": [
        {
            "text": "Grazing is an important part of our farming industry and, for many, management of livestock is more than an occupation: it is a way of life. "
        },
        {
            "text": "It is the main use of land across much of the country and can have a profound effect on our environment, defining its landscape and habitats.  It is the reason much of our uplands are open landscapes and helps determine which plants form the dominant vegetation over large areas."
        },
        {
            "text": "Grazing remains an important part of the upland common traditions, often using traditional breeds but is, sadly, less prevalent today on our lowland commons.  "
        },
        {
            "text": "Natural England values grazing in the uplands. It maintains open habitats and landscapes. We also recognise the importance of pastoral traditions in rural communities. Like all land uses, grazing can be a good thing. It can also have some unintended consequences. "
        },
        {
            "heading": 2,
            "text": "Supporting our uplands"
        },
        {
            "text": "As we understand more about the pressures on our environment, be it climate change, long range airborne pollution or biodiversity loss, we need to look at how grazing can help support the restoration of rich environments that characterise our uplands."
        },
        {
            "text": "Different animals have different impacts. For example, ponies and cattle can be very useful in conservation management. They can graze down coarse vegetation that might otherwise choke out less robust wild flowers. They can also break up closed grassland swards with their hooves to create space for seeds to germinate. "
        },
        {
            "text": "On the other hand, the same qualities mean that an excessive number on a site can damage vegetation by grazing plants too heavily (leading to loss of sensitive species) and by ‘poaching’ the ground (churning it to mud and killing the vegetation).  "
        },
        {
            "text": "On particular sites, grazing regimes need to be tailored carefully to suit the type of land and vegetation. Too much livestock, especially in winter and bad weather, can be damaging, so the needs and welfare of the animals must be considered through the whole year, not just when they are wanted for conservation grazing. "
        },
        {
            "text": "Ultimately, we want to see the right livestock on the right sites for the right times, and to reward graziers for their contributions towards nature recovery."
        },
        {
            "text": "Working with graziers to achieve grazing levels that deliver a range of outcomes alongside maintaining rural traditions and economy is vital."
        },
        {
            "text": "The way upland areas are managed can have profound implications for society as a whole – delivering water for drinking, reducing flood-risk, contributing to improving wildlife and reducing the impact of climate change."
        },
        {
            "heading": 2,
            "text": "Our role"
        },
        {
            "text": "It is part of Natural England’s role to advise on how best to provide those benefits. We know that where changes are needed to meet these environmental outcomes then these cannot often be achieved overnight, and sometimes there needs to be a period of adjustment.  "
        },
        {
            "text": "We do need confidence that the trajectory is the right one and will deliver the desired outcomes. "
        },
        {
            "text": "This is especially the case where the area is a Site of Special Scientific Interest. It is also the case on commons where there is an added level of complexity in that an overall grazing regime needs to be agreed for the common and then the role played by each individual grazier agreed within the overall framework."
        },
        {
            "text": "As we move to a publicly funded regime which supports environmentally sustainable farming then livestock numbers, breed types, seasonality and shepherding are all important factors.  Stock density and patterns of grazing across the seasons are often considered in agri-environment agreements. "
        },
        {
            "text": "For most agreements, appropriate stocking calendars are quickly agreed, but in a minority of places they can be the subject of detailed and tricky negotiations.  "
        },
        {
            "text": "This can sometimes mean seeking a reduction in grazing pressure or a different balance in livestock types between sheep, cattle and, in places, ponies. We will look at all the aspects of how grazing is carried out to reflect the requirements on each individual site.  There is no blanket approach, nor a one-size-fits-all answer."
        },
        {
            "text": "We are keen to hear your thoughts on this, so do comment below."
        }
    ]
}