{
    "url": "https://nda.blog.gov.uk/making-the-move-project-professional-neal-on-why-sellafield-was-the-right-choice-for-his-career/",
    "title": "Making the move: Project professional Neal on why Sellafield was the right choice for his career",
    "authors": [
        "Chelsea Park"
    ],
    "categories": [
        "Skills"
    ],
    "pub_date": "2022-04-07T11:19:45+01:00",
    "content": [
        {
            "text": "Sellafield offers a unique opportunity for project managers who are looking for careers with purpose – a place where they can help deliver some of the most complex and exciting projects in the country. Projects that will help us create a clean and safe environment for future generations."
        },
        {
            "text": "The cherry on the cake? They can do it against the backdrop of one of the most beautiful parts of the UK."
        },
        {
            "text": "Don’t take our word for it. Meet Neal Patel. Neal works in programme support and moved from city to countryside while staying at the cutting edge of project management."
        },
        {
            "heading": 3,
            "text": "How long have you worked at Sellafield and what is your current role?"
        },
        {
            "text": "I’ve worked at Sellafield Ltd for just over 5 years now, I originally joined as part of the project management and controls graduate scheme."
        },
        {
            "text": "After completing my degree in chemical engineering at the University of Leeds I thought this would be a good step as I was really interested in the nuclear industry – so Sellafield was a great choice for me."
        },
        {
            "text": "I currently work in programme support within Special Nuclear Materials – it’s a really challenging job and I've had the opportunity to engage with a wide range of stakeholders such as Sellafield’s supply chain, regulators and the wider UK nuclear estate – it’s all focused on identifying projects and investments in specialist skills, expertise and facilities to sustain and enhance the UK’s alpha capabilities."
        },
        {
            "heading": 3,
            "text": "What has your experience working at Sellafield been like so far?  "
        },
        {
            "text": "I really enjoy working at Sellafield. I’ve been fortunate to work in a variety of roles; on my graduate scheme I moved around the business on different placements so was able to see the different aspects of project management."
        },
        {
            "text": "One of the best things about working here is the range of people I get to work with every day – I’m also able to interact with people from across the UK who all have different backgrounds and experience so we can learn from each other."
        },
        {
            "text": "I’ve also had lots of opportunities to get involved in - outside of my day-to-day role. I’m part of the Next Generation Executive where I represent our project director, Andy Sharples."
        },
        {
            "text": "It’s a programme designed for people in their early careers to offer a different perspective for our executive and drive positive change in the business."
        },
        {
            "text": "Our key areas of focus now are sustainability and delivering value – 2 topics that are key both in and outside of nuclear."
        },
        {
            "text": "I’m also one of the founding members of Sellafield’s BAME Network – we’re striving to improve diversity and inclusion across the business – diversity at Sellafield is something the organisation is really focused on; I feel proud to work for a company that values it so highly."
        },
        {
            "heading": 3,
            "text": "What was your background before joining Sellafield? "
        },
        {
            "text": "Before joining Sellafield, I studied chemical engineering at the University of Leeds."
        },
        {
            "text": "At university I did some work which looked at the nuclear sector, I found it interesting, so I started to look at what the different roles were and what was on offer."
        },
        {
            "text": "I saw Sellafield’s graduate scheme and thought it looked like a good opportunity – so I decided to apply."
        },
        {
            "text": "I was initially based on site in Cumbria for a 6-month placement in construction as part of my graduate scheme – I enjoyed being based where the work was being delivered as I could see the progress being made. It also made the job so much more rewarding when you can interact with the teams who are delivering the work."
        },
        {
            "text": "I enjoyed being based and working here to I decided to settle in Cumbria. I’m from Leeds originally so it was a different lifestyle to what I was used to – but it’s a quiet, safe area and I like the quality of life- so it was an easy decision for me to move up here."
        },
        {
            "text": "When I first moved here, I didn’t really know anyone, but it was easy to build a network of friends on the graduate scheme – I’m still friends with most of the people I met when I first moved here."
        },
        {
            "heading": 3,
            "text": "What has your experience of living in Cumbria been like?"
        },
        {
            "text": "I’ll be honest before moving here I didn’t spend that much time outdoors and I did wonder how I would spend my free time as it’s quite different to being based in a city."
        },
        {
            "text": "Since moving here I’ve made the most of the Lake District, I feel lucky to be so near to a beautiful place where other people visit to go on holiday."
        },
        {
            "text": "I really enjoy fell walking– my partner and I have two dogs, so we make the most of the fells on the weekends! We also live close to beaches, so there’s lots of opportunities to get outside and try new things."
        },
        {
            "text": "I play football so have been able to meet lots of new people through this. I also play cricket for Whitehaven - up here everyone lives close to each other so it’s easy to meet up and socialise."
        },
        {
            "text": "My lifestyle is a lot healthier now and I enjoy having the choice of being able to spend more time outside if I want to – it feels like a much better work life balance."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Would you recommend Cumbria as a place for other people to relocate to?"
        },
        {
            "text": "I would absolutely recommend Cumbria as a place to relocate to – it’s a great part of the country to live in. It’s quiet, safe and has lots of good job opportunities with Sellafield and its supply chain."
        },
        {
            "text": "Not many other employers can say they have a mission that is likely to last over the next 100 years – these long-term opportunities can really make a difference for people."
        },
        {
            "text": "I felt welcome as soon as I moved here, there were lots of team building opportunities and I went from knowing no one to meeting lots of people. I still have friends from 5 years ago when I first relocated here. I’ve been able to build a good social network and people relocating to Cumbria is a huge boost to the region – it brings new ideas, approaches and ways of thinking."
        },
        {
            "text": "One of the reasons I enjoy working here is that it’s clear to see the value you add to the business and everyone’s role is important for making Sellafield a clean and safe environment for future generations."
        },
        {
            "text": "Living in Cumbria is a huge bonus – the Lake District is on my doorstep and I can make the most of my time outside of work with family and friends."
        }
    ]
}