{
    "url": "https://videosurveillance.blog.gov.uk/2022/04/07/one-year-later-the-commissioner-reflects-on-his-time-in-post-so-far-at-the-national-npcc-cctv-conference/",
    "title": "One Year Later… The Commissioner reflects on his time in post so far at the National NPCC CCTV Conference",
    "authors": [
        "ocullen"
    ],
    "categories": [
        "ANPR",
        "CCTV",
        "Local authorities",
        "National surveillance camera strategy",
        "National surveillance camera stratgey",
        "Surveillance camera code of practice",
        "Surveillance cameras"
    ],
    "pub_date": "2022-04-07T11:52:38+01:00",
    "content": [
        {
            "text": "Officially one year into my term as the Biometrics and Surveillance Camera Commissioner, I gave the keynote speech at the NPCC’s National CCTV Conference in Bristol recently. I took this opportunity to reflect on several trends emerging of the last 12 months…"
        },
        {
            "text": "It has been a highly interesting first year, with not one but two public consultations being considered in parliament – first was the long awaited review of the Surveillance Camera Code of Practice and second the Department for Culture Media and Sport’s consultation Data: a new direction which contained a couple of surprise questions right at the end!"
        },
        {
            "text": "Within my presentation, however, I decided to focus on four main topics. The first of these was that biometric surveillance is not just data protection. Here, I talked about the harrowing case of David Fuller who was convicted of murder and videoing his abuse of the victims. However, while his behaviour went against everything we see as right (as pointed out by the trial judge) it didn’t breach any data protection rules because they only protect the dignity of the living.  The same was true of the egregious conduct by police officers who took pictures of two murder victims. To me these dreadful cases highlight how DP laws have not kept up with the potential intrusiveness of surveillance and why ‘data compliance’ is not always the same as acceptable surveillance behaviour."
        },
        {
            "text": "Secondly, I highlighted the direct link between the atrocities being committed in Xinxiang, China and the camps where Uyghurs have been detained and observed at every moment by CCTV surveillance. I have been closely following the public and parliamentary disquiet arising from this persecution  and, as  many public authorities have bought and installed surveillance systems from the companies linked to the human rights abuses in those camps – largely, it seems to me, on the basis that the cameras offer “value for money” - I therefore asked the audience to consider this question: you wouldn’t employ an individual surveillance operator who had designed, built and worked in one of these appalling places so why would you employ a company that designed, built and operated them?  I cannot see how the procurement of these systems meets the human rights obligations of public bodies nor how it would meet the National Decision-Making Model for policing which claims to put ethics at the heart of every decision."
        },
        {
            "text": "Thirdly I referred to a news story from last year titled “terminally ill dad arrested by 6 police officers for mooning at a speed camera”. I highlighted the relationship between the police and the citizen when in relation to surveillance. In this news story, the man in question was filmed by his wife and carer being wrestled to the ground and handcuffed by 6 police officers. This incident prompted the appearance of a ‘Banksy’ mural in the town and is a prime example of how we are moving from public bodies watching the citizen, to a world where the citizen is filming everything – some image captures we may not welcome and some we already rely on to do our jobs."
        },
        {
            "text": "Finally, I drew the audience’s attention to an interactive doll that was produced for the English-speaking market. Equipped with speech recognition systems, AI-based learning features and operating as an IoT (internet of things) device this doll was designed to have a child at one end and the internet at the other and is thankfully no longer on the market! My warning based on the menace of mixing these technologies was simple: do not connect dolls to the internet…"
        },
        {
            "text": "I was joined by an abundance of great speakers throughout the day including police forces, local authorities and industry experts, as well as the Forensic Science Regular Gary Pugh and a brief walk-on for stalwart supporter Tony Gleason from the PCMA. Furthermore, Professor William Webster, the lead for the Civil Engagement strand of the National Surveillance Camera Strategy (NSCS), did a tremendous job of leading the day and introducing all the speakers, alongside giving his own talk on The Governance of eMerging Tech: Issues for Surveillance Camera Provision."
        },
        {
            "text": "For me, a personal highlight is getting back out and about and carrying out my own facial recognition seeing so many people for the first time in real life. Delivering speeches behind my computer screen was still the norm many months into my tenure as Commissioner, so I am pleased to be entering my next year in person to engage with biometrics and surveillance colleagues."
        }
    ]
}