{
    "url": "https://competitionandmarkets.blog.gov.uk/2022/04/07/online-choice-architecture-how-do-we-end-up-making-decisions-we-dont-want/",
    "title": "Online choice architecture - how do we end up making decisions we don’t want to make?",
    "authors": [
        "Ollie Sugg",
        "Vedran Lesic"
    ],
    "categories": [
        "Consumer protection",
        "Online choice architecture"
    ],
    "pub_date": "2022-04-07T12:40:16+01:00",
    "content": [
        {
            "text": "When you last shopped online, did you find it difficult to get what you wanted – with lots of other options you had to navigate through?"
        },
        {
            "text": "Have you ever wondered why cancelling a subscription is so difficult when all it took was a click of a button to sign up?"
        },
        {
            "text": "And have you noticed how some options come pre-selected while others require a lot more effort to choose?"
        },
        {
            "text": "Online, businesses have much greater control over our interactions with them. Every bit of a website, online platform and app is designed by businesses, and can be personalised and optimised. These design choices often help consumers, but what happens when they don’t?"
        },
        {
            "text": "As the UK’s competition and consumer authority, we have launched a new programme of work focusing on understanding how digital design can influence people’s decisions. The programme aims to bolster existing research and learn from past cases, in particular, focusing on gaps in our knowledge about the scale, prevalence and harm of certain design practices."
        },
        {
            "text": "We recently launched the \"Online Rip-Off Tip-Off” consumer campaign as part of this programme, and today we are publishing 2 new papers: a discussion paper and an evidence review."
        },
        {
            "heading": 2,
            "text": "What is Online Choice Architecture and why does it matter"
        },
        {
            "text": "The design of online environments affects our decision making and actions. We call this Online Choice Architecture (OCA)."
        },
        {
            "text": "OCA is often used to help us:"
        },
        {
            "text": "However, it can also cause harm if designed in a way that weakens competition or doesn’t benefit consumers."
        },
        {
            "text": "Say you are searching for a new electric toothbrush online. The website presents you with a list of possible products, but you can only see the first 3 when the screen loads. This is by design but given that most of us rarely look past the top results, it also raises an important question: how does the website (or the underlying algorithm) decide which products to present first? Do they rank the products by customer ratings, relevance, price, commission paid by the seller, or something else?"
        },
        {
            "text": "The second search result catches your eye, and you click on it. The product page then flashes up in red: “14 people have added this to their bag in the last 24 hours’, and below that, “5 left in stock!”. These types of scarcity claims can provide helpful information, but they can also make you feel like you need to decide quickly – which is particularly concerning when such claims can be misleading or even untrue."
        },
        {
            "text": "You decide to buy the product and arrive at the checkout. You then realise that the final price has gone up by £5 due to compulsory charges for the additional toothbrush head that were not mentioned earlier. As we tend to focus on upfront prices, this type of drip pricing can make it difficult to compare between offers or reduce our willingness to go back and search for an alternative once we are at the checkout."
        },
        {
            "text": "You might be familiar with some of these practices from your shopping experiences online, but there are others that may be harder to spot. There is good evidence that such OCA practices, individually or in combination, can affect the decisions you make. Competition and consumer authorities can play a crucial role in understanding how the effects of OCA may be harmful to consumers, and taking action to help."
        },
        {
            "heading": 2,
            "text": "What the CMA is doing about OCA"
        },
        {
            "text": "We have identified that a range of OCA-related practices have played a role in many previous and ongoing issues that the CMA have dealt with. These include our consumer case work (such as our investigations into the online hotel booking and car rental intermediaries markets) and digital market studies (such as those relating to digital advertising and mobile ecosystems). OCA will remain relevant across a wide range of digital contexts the CMA and any future Digital Markets Unit will look at. It’s really important that we can understand the issues, to remedy them."
        },
        {
            "text": "We have now started a cross-cutting programme of work on OCA. We recently launched our “Online Rip-Off Tip-Off” campaign, which aims to raise awareness around 4 of the most common harmful practices online:"
        },
        {
            "text": "Today, we are publishing 2 papers that build on this campaign, diving deeper into a range of OCA practices that can cause harm, and exploring the emerging evidence underlying their effectiveness."
        },
        {
            "text": "These papers will inform our ongoing work challenging OCA practices that mislead and harm consumers or undermine their trust and confidence in online markets."
        },
        {
            "text": "We also hope that these papers will provide a valuable contribution to the emerging international discussion around the importance of OCA for consumer and competition authorities, particularly in preparation for the new digital markets regime."
        },
        {
            "text": "In addition to our programme of work, the CMA will consider its full range of powers and tools. This includes enforcement cases that set important precedents and deter unfair practices, as well as guidance to support businesses in ensuring they comply with the law."
        },
        {
            "text": "We welcome comments and expressions of interest in keeping in touch with our work programme and events from interested stakeholders: please get in touch at behavioural.hub@cma.gov.uk."
        }
    ]
}