{
    "url": "https://rpc.blog.gov.uk/2022/04/07/rpc-gives-evidence-to-the-house-of-lords-secondary-legislation-scrutiny-committee/",
    "title": "RPC gives evidence to the House of Lords’ Secondary Legislation Scrutiny Committee",
    "authors": [
        "Stephen Gibson"
    ],
    "categories": [
        "Better regulation",
        "Evaluation",
        "Independent scrutiny"
    ],
    "pub_date": "2022-04-07T14:53:59+01:00",
    "content": [
        {
            "text": "Stephen Gibson (Chair of the RPC) and Andrew Williams Fry (member of the RPC) gave evidence to the Secondary Legislation Scrutiny Committee (SLSC) in the Palace of Westminster on Tuesday 5 April. They were asked about the RPC’s work, how the current Better Regulation system is operating and what they would like to see from the reforms the Government is currently considering. The full session was broadcast and a recording is available here."
        },
        {
            "text": "Stephen and Andrew explained the work of the RPC, discussed some of the issues that we experience with the current Better Regulation system, and set out the key things that might be done to enhance the value of independent scrutiny in the future."
        },
        {
            "text": "Stephen explained that the RPC sees its role as helping to improve the analysis conducted across government to ensure that both ministers and Parliament have the best possible evidence on which to base regulatory decisions."
        },
        {
            "text": "Andrew explained the RPC’s approach of issuing ‘initial review notices’ which give departments an opportunity to improve impact assessments (IAs) during the scrutiny process. The fact that a significant number of IAs are improved during the course of RPC scrutiny is a positive feature of the process and shows the value that independent external scrutiny can add."
        },
        {
            "text": "A frustration with the current system is the increasing number of IAs received very late in the process and with requests for expedited scrutiny. This makes it harder for RPC input to be taken on board. For this reason, Stephen explained that the RPC is supportive of the Government’s intention to have mandatory scrutiny earlier in the process."
        },
        {
            "text": "Andrew also discussed the fact that the RPC currently sees fewer post-implementation reviews (PIRs) than expected. PIRs are a critical step in the policy-making process – checking whether regulation is having its intended effect and should be retained, or whether it should be amended, replaced or revoked."
        },
        {
            "text": "Scrutiny, ahead of implementation, of plans for monitoring and evaluating the effectiveness of regulation, and a better process for tracking when PIRs should be produced, could both help to ensure that regulation is as effective as possible while minimising negative impacts."
        },
        {
            "text": "Stephen argued that, while the current approach has value in ensuring that government considers the impacts of individual regulatory proposals on business and civil society organisations , there is little evidence that the current Business Impact Target (BIT) had been successful in making government focus on overall reductions in the burdens of regulation on business. For that reason, the RPC is supportive of the Government’s intention to reform the BIT."
        },
        {
            "text": "Stephen set out what the RPC would like to see in the reformed Better Regulation Framework and that it was important that some of the benefits of the current framework - such as requiring RPC review of final stage IAs to support effective Parliamentary scrutiny of government proposals - are not lost when designing a new framework."
        },
        {
            "text": "We look forward to seeing the SLSC’s conclusions from its current inquiry, and to continue engagement with the committee as we both seek to ensure that government regulatory decisions are properly evidence-based."
        }
    ]
}