{
    "url": "https://apprenticeships.blog.gov.uk/2022/04/07/talented-apprentice-shines-through-in-the-transport-sector/",
    "title": "Talented apprentice shines through in the transport sector",
    "authors": [
        "Leora Wilson"
    ],
    "categories": [
        "Apprentices"
    ],
    "pub_date": "2022-04-07T10:28:02+01:00",
    "content": [
        {
            "text": "Leora Wilson, is a level 3 transport planning technician at Mott MacDonald. Leora, who has autism, knew she was an extremely hands-on individual who wanted real-life work experience and the correct support, so she chose to go down the apprenticeship route."
        },
        {
            "text": "Read on to find out how her apprenticeship has helped her, as well as what advice she would give to anyone else."
        },
        {
            "text": "My apprenticeship has been completely life changing. I’ve had the opportunity to work on a range of projects, from major events to stakeholder engagement. I am so excited about work I wake every day with a smile on my face. The people I work with are extremely friendly and always finding ways to support my growth and development. I couldn’t ask for anything more. My apprenticeship has given me a massive confidence boost, which is translating into other aspects of my life, and I can’t wait for what the future holds."
        },
        {
            "text": "The biggest thing I have learnt is that every connection you make at work is a new opportunity. I’m now more confident meeting and talking to new people, and I am beginning to realise the importance of networking. It is a challenge for me to say ‘hello’ but by remembering to do this, I have formed new relationships, and this has resulted in opportunities to progress my career. These include being the site champion for our transport planning practice page, which involves me working with people from across the globe to inform the transport planning community at Mott MacDonald about all the amazing work going on in the team. I have also had the opportunity to speak with people who’d you describe as ‘transport planning royalty’ and discussed with them what the future holds and the importance of apprenticeships in the industry."
        },
        {
            "text": "The best part of my apprenticeship is the experience. I work on projects that reflect the theories I learned at school. From sitting in the classroom learning about regeneration to now actually planning the transport to support a regeneration project, or from learning about climate change to now actually being part of the journey to net-zero and supporting behaviour change and modal shift."
        },
        {
            "text": "I love being challenged, trying to find the solution to a problem. It is great that we are encouraged to be innovative and to work collaboratively to fit all the puzzle pieces together to find to the answer. It’s not always easy but it is what makes the job so interesting, and I am so happy I was picked for the apprenticeship!"
        },
        {
            "text": "My autism makes me have a very quirky personality, so I’m always full of energy and passionate about what I do. I love to spread a smile and make people laugh. At work, everyone is so friendly, and they always involve me, and this makes me so happy that I can be myself and don’t have to worry about being judged."
        },
        {
            "text": "For anyone considering doing an apprenticeship, my advice is to find something you are truly passionate about so that you can pick the best apprenticeship for you, and always have a positive attitude. I also recommend you take every opportunity possible and always seek to find more. But most importantly, don’t give up!"
        }
    ]
}