{
    "url": "https://openpolicy.blog.gov.uk/2022/04/07/tools-for-climate-policy-3-six-effects-of-art-in-policy/",
    "title": "Tools for climate policy (3): six effects of art in policy",
    "authors": [
        "Stephen Bennett"
    ],
    "categories": [
        "Policy Lab"
    ],
    "pub_date": "2022-04-07T13:08:37+00:00",
    "content": [
        {
            "text": "This is the third in a series of blogs about methods which Policy Lab has used in the context of climate-related policy issues. It describes using art in policy, with reference to Glass House, an installation/experience which I created as a practising visual artist and as part of a Clore Leadership Fellowship. The first blog in the series described a co-design process at the Design for Planet festival which coincided with COP26 and the second considered systems mapping."
        },
        {
            "heading": 2,
            "text": "Why art and policy?"
        },
        {
            "text": "“That feeling of being overwhelmed… and then a kind of emotional response of ‘I ought to do something’ when I see pieces about people whose lives are being impacted by climate change” - Jon Elliot, Director, AstraZenaca, at Glass House"
        },
        {
            "text": "I first wrote about the possibility of using art in policy in 2018 when I suggested there were three possible roles of art in policy. Since then I have continued this inquiry through a process of practice-based research. This includes learning from Policy Lab projects like our multimedia collaboration with the Department for Transport on the Manual for Streets and our speculative flags on the future of maritime autonomy. It also included my own research and practice conducted with the support of Clore Leadership, the Social Design Institute and the Arts and Humanities Research Council. "
        },
        {
            "text": "This process has expanded my sense of the multifaceted, profound effects art can have in policymaking which I now understand to include:"
        },
        {
            "text": "As a thought experiment, I have mapped these six effects of art to six stages of the policy cycle, and located 21 examples of existing artworks in this matrix, from Blue Planet II to arts in criminal justice."
        },
        {
            "text": "You can read more about this research here. The next part of this blog describes a process which is elemental to me as a practising artist. I used my hands, eyes and imagination to materialise these theoretical ideas into physical artefacts. "
        },
        {
            "text": "Glass House"
        },
        {
            "text": "“It is the connection of data to the real world that I think the combination of art and policy has to bring” - Paul Kett, Director General, Skills, Department for Education, at Glass House"
        },
        {
            "text": "In Autumn 2021, I produced Glass House. The installation/experience comprised seven artworks capturing data and information about climate change, portrayed on reclaimed glass, arranged in an evocative, low lit space. Glass House took place at Lumen Studios in a crypt in Bethnal Green and was attended by groups of 2-5 people who were specifically invited but who did not know each other. This invite-only approach was required to comply with the venue’s social distancing policy, but it also meant that people from different disciplines and life experience could be intentionally brought together in small groups. This video provides an overview of Glass House."
        },
        {
            "text": " "
        },
        {
            "text": "Each of the artworks in Glass House speaks to a possible role for art in policy. For example, the work Layers of Bangladesh provides a highly visual and interactive way of overlaying climate and socioeconomic data relating to Bangladesh. Layers of Southeast Asia, a piece comprising three glass panels, represents a human-sized counterpoint to this - the three panels showed changes in rainfall, flooding and population in the region. Participants noted how their own height, their physicality and how they moved in relation to the panels changed their understanding of the data."
        },
        {
            "text": "In all of the works in Glass House, data is depicted on glass sourced from allotment owners looking to revamp or remove old greenhouses on their plots. On some pieces I worked hard to polish and grind the panes back into a pristine state. For other artworks I sought to draw a line between the jagged and fragile materials and the emotional and existentialist nature of climate change. To this end, Broken Arctic Map shows the reduction in the Arctic ice sheet between 1979 and 2020, engraved on scratched and broken 10mm glass. The images of the effects of climate change depicted in Greenhouse Panes are distorted, blistered and washed out to the point of being illegible."
        },
        {
            "text": "The final piece in the show was Climate Data Discovery. This installation arranged 40 pieces of climate evidence around a space. Participants were invited to look at the information in their own time, focusing on what they found interesting. After 30 minutes I asked the guests to sit on the chairs, facing each other, and discuss what information they found most striking and the policy implications. The dialogue between participants, reflecting on the tangible and intangible aspects of the works they had seen, was intended as the final work of art in the Glass House installation."
        },
        {
            "text": "Looking back at the Artist Placement Group…"
        },
        {
            "text": "There are some interesting precedents to the use of art in policymaking contexts. Already, artworks adorn the walls of places where British policy decisions are taken in the guise of the Government Art Collection. The New York City Government runs a Public Artists in Residence programme, embedding artists in spaces like the NYC Department of Sanitation or NYC Department of Reports and Information Services, working on the premise that artists are ‘creative problem-solvers’."
        },
        {
            "text": "An intriguing example is the Artist Placement Group, a British innovation from the 1960s and 1970s. Initially the APG worked across the public sector and in private industries, but in 1972 the artist Barbara Steveni negotiated an agreement called the Whitehall Civil Service Memorandum with the UK government to expand the role of the APG to government organisations including the Scottish Office and the National Department of Health and Social Security. The artists worked alongside staff from all parts of the organisation for months or years, and sought to develop ‘proposals’ which could have a transformative impact upon the host organisations’ work. There are fascinating examples of impact, from video artworks broadcast on national TV to Ian Breakwell’s Diary, an ongoing multimedia journal which empowered a team at Broadmoor psychiatric hospital to introduce a more consultative approach to improving patients’ conditions."
        },
        {
            "text": "A multidisciplinary studio to address challenges like climate change"
        },
        {
            "text": "‘As someone who is probably immersed in this data, day-to-day, actually having to stop, pause, think about how the data is presented in a slightly different way… engage with it, even struggle to see and read it… is actually quite a good way to reconnect with the information.’ Amy Jenkins, Deputy Director, Head of Clean Growth, the Department Business, Energy and Climate Change at Glass House"
        },
        {
            "text": "In 1959 the writer CP Snow produced Two Cultures, an influential book which reflected and perhaps reinforced the notion that the arts and sciences sit on opposite sides of an academic debate. The last ten years have seen encouraging movements towards a more fluid, interchangeable and interdisciplinary understanding of the merits of different methods in addressing policy challenges. CERN, the large hadron collider in Geneva, presides over a formidable artistic programme. Central Saint Martins, a historic London art school, runs an MA in Art and Science. The UK’s Government Office for Science have used artistic photography in a report on waste and commissioned Policy Lab to use speculative design in a 2015 project on the ageing population, the first ever project using this method in a national government."
        },
        {
            "text": "At Policy Lab we have continued to evolve the practices we use and where we deploy them and we now comprise a multidisciplinary studio which includes artists, designers, researchers, curators, technologists, ethnographers, filmmakers, policymakers and others. These skills enable us to approach policy issues from multiple angles, bringing together big, deep and rich insights by using a number of methodologies. "
        },
        {
            "text": "Climate change is almost the quintessential complex, multi-system problem. It requires creativity, empathy, emotional sensitivity and intellectual rigour to address it. This will likely mean engaging citizens in meaningful conversations; demystifying and opening up evidence to a wider public audience; and thinking beyond the status quo in terms of what a solution could be. Art is one of the strategies we can bring to bear on policy challenges like this."
        },
        {
            "text": "If you are interested in supporting an innovative project exploring the use of techniques like art in policymaking, please get in touch with Policy Lab."
        }
    ]
}