{
    "url": "https://equalities.blog.gov.uk/2022/04/07/why-we-no-longer-use-the-term-bame-in-government/",
    "title": "Why we no longer use the term ‘BAME’ in government",
    "authors": [
        "Race Disparity Unit"
    ],
    "categories": [
        "Equalities"
    ],
    "pub_date": "2022-04-07T09:04:20+01:00",
    "content": [
        {
            "text": "How we write about race and ethnicity matters. "
        },
        {
            "text": "As civil servants, we need to be as precise as we can in the language we use when describing different ethnic groups, and also in how we develop solutions to address the more persistent disparities in outcomes between those groups."
        },
        {
            "text": "In the summer of 2020, the Prime Minister appointed the Commission on Race and Ethnic Disparities to review the causes for race inequality in the UK. In its report, published on 31 March 2021, the Commission found that aggregate terms like ‘BAME’ (black, Asian and minority ethnic) were no longer helpful and should be dropped, advocating instead a focus on understanding disparities and outcomes for specific ethnic groups."
        },
        {
            "text": "The government agrees. Its response to the Commission’s report, ‘Inclusive Britain’, was published on 17 March 2022. This sets out a ground-breaking action plan intended to tackle negative disparities, promote unity and build a fairer Britain for all. It also includes a commitment to no longer use the term ‘BAME’ in government. "
        },
        {
            "heading": 2,
            "text": "But why does this matter?  "
        },
        {
            "text": "‘BAME’ is frequently used to group all ethnic minorities together. This can disguise huge differences in outcomes between ethnic groups. For example, we know that the picture of educational attainment across different ethnic groups is complex. "
        },
        {
            "text": "In 2019, a higher than average percentage of children in state-funded schools from Chinese, Indian and Bangladeshi groups achieved strong passes in English and Maths GCSEs. But looking at these results from a ‘BAME’ perspective would have skewed the picture, masking the success of those particular groups and under-performance by others."
        },
        {
            "text": "The term ‘BAME’ emphasises certain ethnic minority groups (Asian and black) and excludes others, such as the ‘mixed’, Gypsy, Roma and Traveller and ‘other white’ ethnic minority groups that also face negative disparities. ‘BAME’ is also often used as a proxy for “non-white”, which can be unintentionally divisive."
        },
        {
            "text": "Perhaps more importantly though, many ethnic minorities themselves say they do not like the term ‘BAME’, a finding that has been reinforced by recent research commissioned by the Cabinet Office Race Disparity Unit (RDU) during the pandemic. "
        },
        {
            "heading": 2,
            "text": "So what should we say instead? "
        },
        {
            "text": "In 2019 the RDU issued guidance on how to write about ethnicity. This was updated in December last year and recommends that, wherever possible, we should use the specific ethnic classifications of the Census. Where it is absolutely necessary to group together people from different ethnic minority backgrounds, we should say ‘ethnic minorities’ or ‘people from ethnic minority backgrounds’."
        },
        {
            "text": "We are not the only ones to have reached this conclusion. In December, the BBC and other UK broadcasters said they would no longer use the term BAME. This followed research by the Sir Lenny Henry Centre for Media Diversity which found a lack of trust around the term, with some arguing that it allowed organisations to “average out” and hide a lack of representation or overlook issues faced by particular ethnic groups. "
        },
        {
            "text": "Inclusive Britain commits the RDU to improving our understanding of the impact of media reporting of race and ethnicity issues on ethnic minorities and, by June 2023, to develop recommendations that will encourage more responsible and accurate reporting on race-related issues."
        },
        {
            "heading": 2,
            "text": "What's next?"
        },
        {
            "text": "Going forward, we think more precision in our use of language around ethnicity will allow people to pinpoint in greater detail:"
        },
        {
            "text": "Doing so will help current and future governments, their agencies, and all those with an active part to play to close the gaps in a meaningful and sustainable way – here and overseas. "
        },
        {
            "text": "Change doesn’t happen overnight, but a collective long-term goal towards achieving better outcomes for all is in everyone’s interests."
        }
    ]
}