{
    "url": "https://forestrycommission.blog.gov.uk/2022/04/07/yorkshire-water-and-the-national-trust-how-planting-trees-on-our-land-can-benefit-nature-climate-and-people/",
    "title": "Yorkshire Water and the National Trust; How planting trees on our land can benefit nature, climate and people.",
    "authors": [
        "Victoria Holland"
    ],
    "categories": [
        "Woodland creation"
    ],
    "pub_date": "2022-04-07T16:12:26+01:00",
    "content": [
        {
            "text": "Looking after the breathtaking uplands of West Yorkshire is a crucial part of our work at both the National Trust and Yorkshire Water, and it’s vital to protect the South Pennines for generations to come. Combined, our two organisations are the largest landowners in Yorkshire, and we have a responsibility to look after this countryside and protect our downstream communities which are at risk of flooding."
        },
        {
            "text": "As part of our common-cause partnership, and as signatories of the White Rose Forest, our work focuses on how planting trees and upland restoration can go hand in hand, helping us to reduce flood risk. This benefits nature, the climate and the people who live in these catchments."
        },
        {
            "heading": 2,
            "text": "Gorpley Reservoir – a pilot project"
        },
        {
            "text": "Together with the Woodland Trust, we’ve already delivered the first part of our partnership work, a pilot project for the White Rose Forest. At Gorpley Reservoir near Todmorden, a Yorkshire Water site, around 112,000 broad leaf trees were planted in 2020. These trees, planted by contractors and volunteers on behalf of the Woodland Trust, were just one part of the project."
        },
        {
            "text": "We also focused on other natural flood management techniques, including stabilising banks, creating new ponds and building leaky dams. We also trialled techniques to retore and stabilise peat soils, such as peat bunds and reprofiling, vegetation management and planting thousands of sphagnum moss plugs. All these measures, together with the new trees, will help to slow the flow of water across our land, reduce peat erosion and capture carbon."
        },
        {
            "heading": 2,
            "text": "What difference have these trees made?"
        },
        {
            "text": "Looking at Gorpley Reservoir now, it’s exciting to imagine the woodland it will one day become. The scale of the work is impressive, with trees stretching across the valley. So far, the trees have established well, especially in the lower half of the site. As they grow, their roots will hold increasingly more water, slowing the flow in the catchment."
        },
        {
            "text": "Bank stabilisation has already led to increased vegetation cover, and wildlife surveys have recorded an increase in amphibians and invertebrates in and around the new ponds. The University of Leeds have been monitoring run-off and water levels at the site, and this will give us useful data to analyse the effect on flood risk."
        },
        {
            "heading": 2,
            "text": "Broadening our work"
        },
        {
            "text": "The same project team are now broadening this work across more of our land. Working closely with Yorkshire Water and the Woodland Trust, the National Trust are delivering part of the White Rose Forest’s Lanscapes For Water project – focusing on the Upper Calder catchment. The ambition is to create clough woodland across five different upland sites in the South Pennines. Although still in the early stages of development, this will also have a direct benefit on reducing flood risk."
        },
        {
            "heading": 2,
            "text": "Planting trees in the uplands"
        },
        {
            "text": "The wild, windswept moorlands of areas like Marsden Moor would once have been covered in trees. Surveys have revealed tree stumps hidden below the peat which are thousands of years old. Whilst we don’t necessarily want to restore these landscapes to prehistoric conditions, we can learn from these archaeological records to create new areas of woodland that are sensitive to the historic environment."
        },
        {
            "text": "When planting trees on sensitive areas such as SPAs (Special Protection Area and SACs (Special Area of Conservation, it’s crucial that we understand our landscape and the impacts our proposals will have as fully as possible. This involves undertaking detailed survey work including peat surveys, breeding bird surveys, archaeological studies and vegetation surveys. Picking the right species of tree is key too; we see naturally self-seeding rowan and birch on some parts of the moors, but also unsuitable species like pine and invasive non-native rhododendron."
        },
        {
            "heading": 2,
            "text": "The importance of peat"
        },
        {
            "text": "Tree planting is just one part of our partnership work with Yorkshire Water. We work closely with organisations like Moors For The Future and Yorkshire Peat Partnership to ensure that tree planting works in harmony with the incredible carbon capturing power of peat. Tree planting in these upland landscapes works best hand in hand with leaky dams, sphagnum moss planting and other upland restoration techniques to reduce flood risk for our downstream communities."
        },
        {
            "text": "Whilst in its early stages, our vision for the Upper Calder catchment is gathering momentum. Having identified five key sites, we are now in the process of completing the Woodland Creation Planning Grant. Our next step will involve any necessary surveys and then identifying areas that would benefit from clough woodlands and moorland restoration techniques."
        },
        {
            "heading": 2,
            "text": "Next steps"
        },
        {
            "text": "Woodlands are awe-inspiring places. Important for nature, carbon capture and people, but their benefits as a natural flood management tool can often be overlooked. By planting new trees in key locations on our land, the National Trust and Yorkshire Water’s partnership can go some way to reducing flood risk for those living in West Yorkshire."
        }
    ]
}