{
    "url": "https://disabilityunit.blog.gov.uk/2021/12/20/disability-and-access-ambassador-making-heritage-accessible-2/",
    "title": "Disability and Access Ambassador: Making Heritage Accessible",
    "authors": [
        "Chloe Smith MP",
        "Disability Unit"
    ],
    "categories": [
        "National Disability Strategy"
    ],
    "pub_date": "2021-12-20T10:55:06+00:00",
    "content": [
        {
            "heading": 2,
            "text": "The Minister for Disabled People speaks to Dr Heather Smith, Disability and Access Ambassador for Countryside and Heritage. "
        },
        {
            "text": "What is a Disability and Access Ambassador?"
        },
        {
            "text": "Disability and Access Ambassadors (DAA) are senior leaders who volunteer for a three year post to help ensure businesses are doing all they can to support disabled customers in their sector. "
        },
        {
            "text": "Dr Heather Smith, whose PhD focused on provisions in museums and art galleries for blind and partially sighted people, is coming to the end of her three year tenure as an Ambassador. She spoke to the Minister for Disabled People (MfDP) about what she’s learned, the ongoing challenge of the COVID-19 pandemic, and the launch of the Government’s National Disability Strategy this summer."
        },
        {
            "text": "Heather: \"The ambassador role is great because, beyond the Strategy and government, it allows us to have multiple conversations in different contexts. "
        },
        {
            "heading": 3,
            "text": "\"It’s boots on the ground and wheels on the ground that help make things happen. Then Ministers can see the things happening and you can have your view on what you want to push.\""
        },
        {
            "text": "MfDP: \"Ambassadors help the government get well-connected outwards, and help make actual change in the real world beyond the regulatory environment.\""
        },
        {
            "text": "For over half an hour, the Minister and the Ambassador spoke about expanding advocacy for what is possible for disabled people in the outdoors, supporting providers to think more openly about accessibility in leisure and heritage, and linking up with other departments and organisations. Heather says that she wants Ambassadors to think more \"laterally in all their sectors around the strategy\" to get the most out of the role that they can."
        },
        {
            "text": "Having 19 Disability and Access Ambassadors helps the Government expand their scope and learn more about the impact of their policies on the ground. They cover a wide range of fields - from advertising to creative industries, from housing to hospitality and many more.   "
        },
        {
            "text": "MfDP: \"What do you think are the top issues in terms of accessibility in Countryside and Heritage?\""
        },
        {
            "text": "Heather: \"I think a lot of it comes down to confidence on both sides. Confidence to give something new a go, if a disabled person has had a negative experience before. Confidence in what the law means, and what it doesn’t mean, and stopping organisations from being so welded to the Equality Act that they get paralysed over the meaning of the term 'reasonable'. "
        },
        {
            "heading": 3,
            "text": "\"Ask disabled people themselves. There’s so much concern that people are going to come in and say 'we're going to sue you' rather than 'we're going to help you' that it stops those conversations from happening.\""
        },
        {
            "text": "They discussed the difficulty of accessible transport routes to the UK’s brilliant outdoor spaces. Barriers around transportation were discussed in the workshops for the National Disability Strategy, and tackling them is one of its ongoing commitments. "
        },
        {
            "text": "The conversation also covered the unique challenge of trying to preserve the natural beauty of land and historic buildings, while putting in technology to make it as accessible as possible. Heather talked about the organisation Countryside Mobility in the Southwest who have helped about 20 National Trust properties deliver tramper (all-terrain mobility scooter) equipment, which goes a long way to helping disabled people experience more remote environments."
        },
        {
            "text": "Crucially, they talked about the pandemic, and keeping disabled people safe while ensuring quality of life is kept in mind. "
        },
        {
            "heading": 3,
            "text": "Heather: \"We need to think about how we safely transition out of the pandemic with disabled people’s wellbeing in mind. How do we think about the skills and confidence of disabled people to go out and enjoy a performance without feeling excluded from it?\""
        },
        {
            "text": "They ended the conversation with a question from the Minister."
        },
        {
            "text": "MfDP: \"Thank you so much for the chance for just a bit of a more in-depth conversation with you about how you've found things and how we can do things better, and of course the actual issues in your space. That’s hugely valuable. Is there anything else I can be thinking of to support you?\""
        },
        {
            "text": "Heather: \"Keeping this sector alive in your mind, remembering and thinking about Culture and Heritage.\""
        },
        {
            "text": "MfDP: \"Certainly. Let’s stay in touch.\""
        },
        {
            "text": "Businesses, citizens and local authorities all have a part to play in tackling barriers faced by disabled people across the country. The Disability and Access Ambassadors are a key part of joining up this approach and making sure the Strategy reaches those who need it. "
        },
        {
            "text": "To find out more about what the government is doing, visit the Disability Unit page or read up on the National Disability Strategy policy paper, easy-read or sign language copy. There is also a short video outlining the Strategy. "
        },
        {
            "text": "The National Disability Strategy set out an ambition to improve the lives of the 14 million disabled people across the UK. Each Government department has responsibility for an aspect of the strategy: for example, DCMS focuses on improving access to arts and culture, and DEFRA for making the countryside more accessible.  "
        },
        {
            "text": "The UK’s COVID-19 Alert Level has moved from Level 3 to Level 4 in response to the rapid increase in cases of the Omicron variant of COVID-19 and the increasing risk to the public and healthcare services."
        },
        {
            "text": "Getting fully vaccinated is the best way of protecting you and others against COVID-19. Boosters give you the best possible protection and should significantly reduce your risk of serious illness and hospital admission. Check the NHS website to find out more and make a booking."
        }
    ]
}