{
    "url": "https://civilservice.blog.gov.uk/2021/12/20/how-teamwork-makes-the-dream-work/",
    "title": "How teamwork makes the dream work",
    "authors": [
        "Nick Walker"
    ],
    "categories": [
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Innovative Civil Service",
        "Better policymaking"
    ],
    "pub_date": "2021-12-20T11:01:37+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Nick Walker shares what goes on when you bring (usually fierce) rivals  together to work towards the same goals."
        },
        {
            "text": "Strategic partnership is a term we use when we talk about working with the private sector in government, but what makes these partnerships successful? And why are they so important when it comes to providing you with high quality training?"
        },
        {
            "heading": 4,
            "text": "Sharing goals"
        },
        {
            "text": "In 2020, the Civil Service awarded two new contracts, one with EY and the other with KPMG, to provide much of the learning and development used by departments, professions and functions across government. "
        },
        {
            "text": "The frameworks make sure great training can be built once, and used time and again for common needs across the Government Campus, providing a responsive and flexible service to differing needs. When bespoke training is developed, the frameworks enable other parts of the campus to benefit and see what’s being developed elsewhere. "
        },
        {
            "text": "It also throws up an insightful set of data around what training is being used by which departments and professions. It takes away the headache of departmental procurement and assurance work when buying-in training.  "
        },
        {
            "text": "In other areas of business, EY and KPMG are usually fierce rivals, but that’s not the case within the Learning Frameworks. This is the name used for this partnership offer, which is part of the new Government Campus. In this situation, we’ve created a three-way relationship where we’re all focused on achieving the same goal - better skilled civil servants - and are clear about our respective roles and responsibilities."
        },
        {
            "heading": 4,
            "text": "We're one team"
        },
        {
            "text": "To make it work, we agreed on a few principles to set the bar. These included the mantras ‘the learner comes first,’ ‘we are one team,’ ‘we have collective ownership,’ ‘we are curious, innovative and ambitious,’ and ‘we challenge and welcome diversity.’ All highly valid and easy to say, but difficult to put in place!  "
        },
        {
            "text": "In order to make these principles stick in day-to-day working, we regularly rate ourselves against each of these. Then we get the collective team to assess how well we’re doing against these, and have a continuous improvement plan in place to make sure that we are always striving for better. No pressure! We agreed that if we got this partnership right, we would all lose sleep over the same things, but also celebrate the same things - so far this has held true!"
        },
        {
            "heading": 4,
            "text": "Not just quality training   "
        },
        {
            "text": "We are developing Prospectus Online, which will launch in early 2022. Over time, this will provide the latest training offer and will be where you book your training. You can also speak to a learning adviser by emailing support@governmentcampus.gov.uk. Your learning and development teams have self-service access to management information that shows the scale of training and location demands across the Government Campus."
        },
        {
            "heading": 4,
            "text": "Training offer"
        },
        {
            "text": "To help us to build a skilled Civil Service there is an excellent cross-Civil Service training offer, developed specifically with the needs of civil servants at the heart. It features case studies and examples from many different departments and professions. "
        },
        {
            "text": "This is complimented by a comprehensive catalogue of ‘off-the-shelf’ learning, covering a range of topics including professional qualifications for civil servants. You can also access a first-class bespoke learning offer. This can meet the specific needs of departments and functions with niche needs, as well as a cadre of coaches to support our most senior leaders through some of their toughest leadership challenges.  "
        },
        {
            "text": "In its first 12 months, the Learning Frameworks has supported the development of exciting new courses, including the OpDel Excel programme for our most senior operational delivery leaders, right through to supporting individuals and teams to improve their drafting and written communication skills, the new product is being launched in 2022."
        },
        {
            "heading": 4,
            "text": "Always getting better  "
        },
        {
            "text": "Whilst our strong partnership model has delivered extensively in a relatively short period, there’s always more to do."
        },
        {
            "text": "We know government departments offer comprehensive training. What isn’t always clear is what’s available right across government, and which bits of the offer are most relevant to you when you need them. "
        },
        {
            "text": "To answer these questions, as part of the new Government Campus, we’re developing a campus online. It’s a much better way to signpost, access and deliver all the fantastic training that’s out there. If you’re keen to get involved or find out more, please get in touch. "
        }
    ]
}