{
    "url": "https://insideDIO.blog.gov.uk/2021/12/20/year-in-review-looking-back-at-2021/",
    "title": "Year in Review: looking back at 2021",
    "authors": [
        "DIO Communications Team"
    ],
    "categories": [
        "Accommodation",
        "Communications",
        "Construction",
        "Defence Training Estate (DTE)",
        "Facilities Management",
        "Future Defence Infrastructure Services (FDIS)",
        "HMNB Clyde",
        "Kenya",
        "Procurement",
        "Runways",
        "Sanctuary Awards",
        "Space Command",
        "Training Estate Public Safety"
    ],
    "pub_date": "2021-12-20T15:49:19+00:00",
    "content": [
        {
            "text": "General Sir Nick Carter, then Chief of the Defence Staff, making a speech at the opening of the new DIO head office, St George's House. [Crown Copyright / MOD 2021]To nobody’s surprise, 2021 has presented just as many challenges as 2020. Fortunately, DIO’s teams have been up to the task and have continued to work hard for our Armed Forces customers."
        },
        {
            "text": "Here are some of the highlights of the year."
        },
        {
            "heading": 2,
            "text": "January to March"
        },
        {
            "text": "Work continues on the £45m Net Carbon Accommodation Programme (NetCAP), which is investing in new, carbon efficient accommodation blocks for training personnel. These are being installed on a number of sites across the UK Defence Training Estate, including Westdown Camp and Knook Camp on Salisbury Plain Training Area, Nesscliffe Training Area and Castlemartin Training Area among others. We’ve been working closely with our training estate contractors Landmarc Support Services, and the NetCAP building manufacturers Reds10, to make each new iteration more efficient to run and reduce the embodied carbon."
        },
        {
            "text": "NetCAP is being largely funded by a £200m Government investment in Armed Forces Accommodation, of which £122m is being used to upgrade thousands of Service Family Accommodation homes across the country. Some of these homes will see a complete refurbishment, some a little less, but all will be significant improvements. The changes might include new kitchens and bathrooms, new windows and doors, a new roof, new carpets and external wall insulation to improve energy efficiency and reduce heating bills."
        },
        {
            "text": "We welcomed Defence Secretary Ben Wallace and his Kenyan counterpart, Ambassador Dr Monica Juma, to BATUK. They opened a new BATUK headquarters, including accommodation, offices, a training HQ, a combined mess and more."
        },
        {
            "text": "March saw our annual Sanctuary Awards, recognising sustainability and conservation efforts on Defence sites by MOD staff, contractors and volunteers."
        },
        {
            "heading": 2,
            "text": "April to June"
        },
        {
            "text": "We started April with a celebration of DIO’s ten year anniversary and all that has been achieved in that time."
        },
        {
            "text": "In May our Principal Ecologist led an unusual event. He worked with the RAF and Army, as well as Hampshire and Isle of Wight Wildlife Trust, to restore and enhance Pewit Island in Portsmouth Harbour. The team used a floating barge and a Chinook helicopter to transport aggregate to the island, improving it as a habitat for sea birds."
        },
        {
            "text": "Royal Air Force Chinooks from 28 Sqn RAF Benson deliver aggregate underslung onto Pewit Island in the Portmouth Harbour. Pewit Island current has no birdlife. Aggregate will make it more attractive to nesting birds. Due to shallow water and amount of aggregate required, air delivery by helicopter is the only viable method. [Crown Copyright MOD 2021]We started work on the Submarine Training Facility at HMNB Clyde, part of the Royal Navy’s plan to make the base a Centre of Specialisation for submariners. The new facility will house a school for teaching submarine-specific skills to sailors."
        },
        {
            "text": "In mid-June we awarded the first four of a suite of new Future Defence Infrastructure Services (FDIS) contracts. These are designed to be customer-focused, incentivising good contractor performance and switching from ‘fix on fail’ to more of a preventative maintenance focus. These first four contracts cover hard facilities management, servicing, and repairs across the MOD Built Estate in Scotland and Northern Ireland, and our central, south east and south west regions."
        },
        {
            "heading": 2,
            "text": "July to September"
        },
        {
            "text": "In the school summer holidays, we used our ‘Respect the Range’ campaign to remind people to only access military land where it is legal and safe to do so. Much of our training estate is open to the public at times, but there are risks so it is vital people follow the rules and stick to open areas. These risks are varied and include live firing, fast moving vehicles and unexploded ordnance."
        },
        {
            "text": "In August we completed the first phase of refurbishment of a 70 year old building at RAF High Wycombe, to form the headquarters for the UK’s new Space Command. This included external and internal refurbishment of two large floors of offices, resurfacing the car park and more."
        },
        {
            "text": "At RAF Odiham, we resurfaced the runway, extending its life by 15 years, and replaced and relocated the airfield ground lighting."
        },
        {
            "heading": 2,
            "text": "October to December"
        },
        {
            "text": "October saw the opening of DIO’s new Head Office at DMS Whittington in Staffordshire. Staff were treated to a parachute display as well as speeches from General Sir Nick Carter, then Chief of Defence Staff, our Chief Executive Graham Dalton, and Peter Homa, Director General DMS Whittington, who welcomed us to the site and the DMS Whittington community. The new building is sustainable and provides a vastly improved work environment for staff."
        },
        {
            "text": "The Royal Logistic Corps' Silver Stars parachute team displayed for the attendees and presented a flag to DIO Chief Executive, Graham Dalton. [Crown Copyright / MOD 2021]At CTCRM Lympstone, we completed a new five storey accommodation block for Royal Marine recruits injured during training, ahead of schedule and on budget."
        },
        {
            "text": "One of the final big achievements for the year was the first of our FDIS contracts going into service. Mitie is providing hard facilities management, servicing, repairs and maintenance across MOD sites in Scotland and Northern Ireland."
        },
        {
            "text": "These are just some of the big highlights for the year. Alongside these, we’ve restored dune habitats at Penhale Training Area in Cornwall and are working on it at Braunton Burrows in Devon. We’ve also restored tussac grass habitats in the Falkland Islands and our team at BATUK in Kenya are using ‘seed bombing’ to increase the number of trees on our training land there."
        },
        {
            "text": "Some of the more unusual DIO projects for the year include an archaeological excavation to uncover and rebury skeletons on an island in Portsmouth Harbour and working with our contractors to remove unexploded ordnance from a beach."
        },
        {
            "text": "A close-in representative image, taken using a drone, of the blast from a 28lb munition which DIO's then Acting Chief Executive, Kate Harrison, detonated. [Crown Copyright / MOD 2021]As you can see, DIO’s work is varied and never done - on to 2022!"
        },
        {
            "text": " "
        }
    ]
}