{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2026/02/03/national-apprenticeship-week-2026-a-future-in-metrology-at-national-physical-laboratory-npl/",
    "title": "National Apprenticeship Week 2026: A future in metrology at National Physical Laboratory (NPL) ",
    "authors": [
        "gseprofession",
        "Andrew Burgon"
    ],
    "categories": [
        "Blog Series",
        "Guest Blog",
        "Learning & Development"
    ],
    "pub_date": "2026-02-03T14:00:43+00:00",
    "content": [
        {
            "text": "Andrew Burgon – Measurement Scientist Apprentice, NPL "
        },
        {
            "text": "Andrew shares his journey and growing passion for metrology and quantum technologies through his apprenticeship at the National Physical Laboratory (NPL) during National Apprenticeship Week 2026. "
        },
        {
            "text": "Discovering a new passion "
        },
        {
            "text": "I didn't necessarily have a deep passion for science or engineering when I started searching for a new career, but now that I'm over a year and a half into my apprenticeship in metrology, I’m convinced that I've finally found what I can truly say I am passionate about. After a 4-year long career in distribution I was inspired by my girlfriend, who was making a daily impact with her role in science, to take up something new – a step back into academia. "
        },
        {
            "text": "I wasn't sure at first what metrology even meant, but despite that I've gathered a great wealth of knowledge and met some extraordinary people along the way. Initially I thought that I had nowhere near enough experience to take on something like this, but as it turns out an apprenticeship was the perfect path to take. "
        },
        {
            "text": "First steps into metrology "
        },
        {
            "text": "I took my first step into metrology with the Time and Frequency (T&F) group at the National Physical Laboratory (NPL) in September 2024, more specifically with the Atomic Clocks & Sensors (ACS) department. I was incredibly excited at the prospect of contributing to such innovative and futuristic technology at such an early point in my apprenticeship; the opportunities only came flooding in from that point onwards. I was responsible for numerous computer-aided design and technical specification assets for an exciting space-level project putting us one step closer to space-age atomic clocks. I was so shocked at how much I was contributing to such an important development in science. "
        },
        {
            "text": "Exploring quantum technologies "
        },
        {
            "text": "For my second placement, I joined NPL’s Quantum Technologies (QT) group, where I would only flourish further. Within the exciting horizon that is quantum science, there is the Quantum Information (QI) department, where I was tasked with a largely experimental research project on mapping defects of silicon quantum dot semiconductor chips. This research underpins the future of optical science in applications like key distribution cryptography, quantum imaging, and telecommunications. "
        },
        {
            "text": "I am currently part way through my rotation in Quantum Information, and I feel so proud to contribute to such an awe-inspiring and ever-changing area of science. Recently, NPL's quantum group recently hosted the opening event of UK Quantum Week where Lord Vallance, Minister of State (Minister for Science, Innovation, Research and Nuclear), launched a new G7 and Australia collaboration on the future of measurement science underpinning quantum development.  "
        },
        {
            "text": "Looking ahead "
        },
        {
            "text": "The major goal I want to achieve during my exciting time in quantum is winning the Institute of Physics’ Apprentice Award. None of what I have achieved so far would be possible if not for the incredible accessibility of apprenticeships, and I can't vouch enough for how valuable they are for those unsure of their future like I was.  "
        },
        {
            "text": "Find out more about the Government Science and Engineering (GSE) profession!  "
        },
        {
            "text": "Visit the Government Science and Engineering careers website to explore the diverse expertise shaping government. "
        }
    ]
}