{
    "url": "https://teaching.blog.gov.uk/2026/02/03/school-improvement-rise-adviser-rise-anniversary-2026/",
    "title": "One year as a RISE adviser: What I've learned about school improvement",
    "authors": [
        "Narinder Gill"
    ],
    "categories": [
        "RISE"
    ],
    "pub_date": "2026-02-03T13:49:28+00:00",
    "content": [
        {
            "text": "As RISE celebrates its one-year anniversary on 3 February 2026, I've been reflecting on what this work has taught me – not just about outcomes, but about how improvement actually happens on the ground."
        },
        {
            "heading": 2,
            "text": "Why I applied to become a RISE adviser"
        },
        {
            "text": "After years as a headteacher, trust leader, and adviser, I've learned one thing with certainty: every school has something exceptional going on. Sometimes it's celebrated, sometimes it's fragile and held together by a small group working against the odds. But it's always there."
        },
        {
            "text": "Too often, improvement work overlooks this, focusing on gaps rather than strengths. I've also seen how easily improvement becomes about more initiatives and more expectations. This leaves leaders managing complexity rather than thinking clearly about what matters most for children."
        },
        {
            "text": "RISE felt different. It offered the chance to work with leaders, not on schools, through a universal offer that values where schools are now. The emphasis on clarity, coherence, and sustainability appealed to me most."
        },
        {
            "heading": 2,
            "text": "Why early years and Reception matter in RISE"
        },
        {
            "text": "The focus on Reception was particularly important. Reception isn't simply preparation for what comes next, it's where children begin to see themselves as learners, develop language and curiosity, and form relationships with learning itself."
        },
        {
            "text": "Working alongside the Department for Education’s Early Years Policy Team, including visiting settings together, has been invaluable. Seeing how policy translates into daily practice, and listening to practitioners talk honestly about what supports them, has reinforced something vital: policy and practice are strongest when developed together."
        },
        {
            "heading": 2,
            "text": "What does a RISE adviser do?"
        },
        {
            "text": "Being a RISE adviser is careful, relational work. It begins with listening - to responsible bodies, school leaders and their context. The role isn't about arriving with answers, but helping leaders sharpen their own thinking."
        },
        {
            "text": "A key part is recognising strong practice that already exists. Making this visible matters - not as reassurance, but as a foundation for sustainable improvement. Often, this means supporting leaders to slow the pace of change, embed what's working, and align systems so improvement feels manageable rather than relentless."
        },
        {
            "heading": 2,
            "text": "Key lessons from my first year as a RISE adviser"
        },
        {
            "text": "The moments that resonate most aren't dramatic turning points, but quieter shifts: leaders gaining clarity and feeling able to say no to work that dilutes focus, early years teams strengthening provision through pedagogy rather than new initiatives, and schools seeing their practice recognised regardless of starting point."
        },
        {
            "heading": 2,
            "text": "What's next for school improvement support"
        },
        {
            "text": "This year has reinforced some simple truths:"
        },
        {
            "text": "RISE has created space for these principles to be lived out. It's brought together policy and practice, valued professional judgment while holding firm to evidence, and kept children at the centre of everything."
        },
        {
            "text": "I'm grateful to be part of a programme that takes school leadership seriously and celebrates the exceptional work happening everywhere."
        },
        {
            "heading": 2,
            "text": "Find out more"
        },
        {
            "text": "Find out more about how the programme can support your school or contact your regional team to discuss the universal offer."
        }
    ]
}