{
    "url": "https://competitionandmarkets.blog.gov.uk/2026/02/03/update-on-our-approach-to-market-interventions/",
    "title": "Update on our approach to market interventions",
    "authors": [
        "Juliette Enser"
    ],
    "categories": [
        "Markets"
    ],
    "pub_date": "2026-02-03T10:10:23+00:00",
    "content": [
        {
            "text": "At the Competition and Markets Authority (CMA), we promote competition and protect consumers with a clear end goal – driving economic growth and improving household prosperity."
        },
        {
            "text": "Our market reviews, studies and investigations are 3 powerful tools here: they allow us to examine entire markets and find opportunities to make them work better for everyone."
        },
        {
            "heading": 3,
            "text": "Our journey through the 4Ps"
        },
        {
            "text": "In July 2025, our Chief Executive Sarah Cardell explained why we are transforming our approach to market interventions. She highlighted the fundamental changes we have been making to ensure our work supports economic growth, reduces uncertainty for businesses and investors, and delivers better outcomes for everyone."
        },
        {
            "text": "Central to this is our new framework, shaped by feedback from stakeholders and built around the 4Ps:"
        },
        {
            "text": "Alongside Sarah’s blog post we published our updated approach to markets work, which set out how we will apply the 4Ps through a project’s full life cycle and beyond."
        },
        {
            "text": "We have already started to embed our 4Ps approach in our ongoing work, such as our civil engineering for road and rail market study, which aims to improve outcomes in road and rail infrastructure – a sector that not only impacts consumers directly, but is also vital to driving economic growth."
        },
        {
            "heading": 3,
            "text": "New markets regime guidance"
        },
        {
            "text": "Today we’ve taken another step to fully embed the 4Ps, by publishing new guidance on how we carry out our markets work. This guidance consolidates our approach into 1 document, largely replacing all of our existing guidance documents. It will apply to all new market reviews, market studies and market investigations."
        },
        {
            "text": "In the new guidance, we have made a series of interconnected changes to deliver improvements consistent with the 4Ps. The changes include the following."
        },
        {
            "text": "The guidance also gives:"
        },
        {
            "heading": 3,
            "text": "What stakeholders told us"
        },
        {
            "text": "We consulted on draft guidance last year to get valuable feedback from stakeholders – thank you to everyone who responded."
        },
        {
            "text": "Many responses welcomed us adopting the 4Ps in our markets work, and supported us consolidating our guidance into 1 document. We were encouraged by comments that supported the aims of the guidance, and recognised the clarity we are looking to give. It was also noted our proposed changes reflected pragmatic, long-term thinking and a readiness to adapt our processes where necessary."
        },
        {
            "text": "Some responses suggested that we elaborate on certain areas and give specific examples. Listening to this feedback, we have added more detail where appropriate."
        },
        {
            "heading": 3,
            "text": "A new regime to come?"
        },
        {
            "text": "While the legislation that governs our markets work provides statutory time limits, this still means a market study could last up to 12 months, followed by a market investigation of up to 18 or 24 months. We are clear that an end-to-end process lasting, in some cases, up to 3 years is not consistent with minimising unnecessary burdens and uncertainty on businesses in nearly all cases. We must seek to complete our work as quickly as possible."
        },
        {
            "text": "The UK government has launched a consultation on proposed reforms to the competition regime, including changes to our markets work. The proposals to change our markets regime include:"
        },
        {
            "text": "The CMA welcomes these proposals, which build on our 4Ps programme, and would further enhance our work which helps secure well-functioning markets that serve the interests of the whole of the UK."
        },
        {
            "text": "There may need to be changes to our new markets regime guidance in future, if changes to the markets regime are enacted. However, we believe the core of the approach adopted in this guidance – reflecting as it does our commitment to delivering impact at pace while minimising burdens – is the right one and will endure."
        }
    ]
}