{
    "url": "https://environmentagency.blog.gov.uk/2024/10/18/advances-in-flood-forecasting-the-environment-agency-met-office-partnership-in-action/",
    "title": "Advances in flood forecasting - The Environment Agency / Met Office partnership in action",
    "authors": [
        "defrablogs"
    ],
    "categories": [
        "Flood",
        "Flood Mapping",
        "Flood Planning"
    ],
    "pub_date": "2024-10-18T15:02:27+00:00",
    "content": [
        {
            "text": "By Philip Duffy, Environment Agency CEO."
        },
        {
            "text": "This week is Flood Action Week, our annual media campaign to raise awareness about how everyone can take action to know their flood risk and prepare.  "
        },
        {
            "text": "Today alongside Penny Endersby, Chief Executive of the Met Office, I visited our Flood Forecasting Centre (FFC) in Exeter.  It’s a long-term strategic partnership between the Environment Agency and the Met Office supporting national flood resilience in a changing climate. The Centre forecasts for all natural forms of flooding including from rivers, surface water, groundwater and the sea.  They are a key link between Met Office Strategic Operations Centre and the EA’s Local Forecasting Centres and have been successfully running now for 15 years."
        },
        {
            "text": "We were there to discuss the work FFC is doing to maintain and improve national flood models and systems and our shared priorities for the future. We know from the past year and last month why this work is so important. The visit coincides with the one year anniversary of Storm Babet, which brought significant flooding across the country and saw the third wettest three-day period in a series for England and Wales since 1891. Nearly 96,900 properties were protected by the Environment Agency during Storm Babet, though sadly around 2,150 were flooded.  And in the last month, heavy rainfall led to the first major incident of the season with almost a thousand properties flooded. It followed the wettest 18 months on record in England up to February 2024.  Climate Change is happening now. "
        },
        {
            "text": "The FFC brings together the meteorological expertise of the MO and the hydrological expertise of the EA, creating a team of specialist hydrometeorologists working 24/7. Our people at the FFC work hard to monitor our weather and understand the likelihood of flooding. They issue guidance to emergency responders and forecasts that help our Environment Agency staff issue flood alerts and warnings and work with our partners to help communities respond.  "
        },
        {
            "text": "On the visit we heard about the trial of the new rapid flood guidance service through the summer to help with the difficult task of predicting where heavy summer storms may fall and cause rapid surface water flooding. Early results from the trial are incredibly positive. Further research will assess the value of the trial to the response community and government. This will inform recommendations for the future of the service for 2025 and beyond. The RFG trial is part of the Surface Water Flood Forecasting Improvement Project, a 3-year Defra and Environment Agency  funded initiative, completing in March 2026. Its an example of the strategic leadership we provide on surface water where we’re proactively providing more information and training to local authorities and partners. We are also collaborating with the Met Office looking ahead to the future and reviewing the environmental risks on the National Security Risk Register (NSRA). "
        },
        {
            "text": "The impacts on communities, our staff and the environment from last year’s storms are still being felt. And yet we are back into active response this year already. We are incredibly proud of our staff at the Flood Forecasting Centre, those that provide warnings based on their guidance, those that are on the ground responding, putting up barriers and helping evacuations. "
        },
        {
            "text": "We know our systems need to continue to improve to meet the challenge of climate change. We are making some quick improvements including using technology to help automatically issue warnings and a new National Operations Centre.  This helps provide improved situational awareness across EA, better identification and escalation of operational risk and support for Area teams."
        },
        {
            "text": "We have also worked with Local Resilience Forums and the Cabinet Office to plan how we will use the Emergency Alerts system to warn people about flooding. It allows us and our emergency responders to reach anyone with a mobile phone in a certain location, if there is a ‘risk to life’. This was used for the first time after a severe Flood Warning and Emergency Alert were issued in the early hours of Thursday 23rd May for Highbridge and Stokedalewath (small hamlets on River Roe, South of Carlisle)."
        },
        {
            "text": "The Environment Agency and its partners are continuing to help communities become more resilient to extreme weather and rising sea levels, but authorities can never stop all flood impacts.  We are listening to partners, communities and others about what they need from our incident service to help save lives and people’s homes into the future. We are also helping communities help themselves."
        },
        {
            "text": "Around 5.5 million homes and business in England are at risk of flooding. But our public insight shows that only around half of those at risk believe that their property is at risk and fewer than half feel they have a good understanding of how to protect their home.  This Flood Action Week we’re urging the public to be prepared for flooding."
        },
        {
            "text": "Planning ahead gives people the time and opportunity to think about simple steps they can take to protect themselves in advance and keep themselves safe in the event of a flood: Sign up to flood warnings, Know how to turn off your gas, electricity and water, plan where to move your valuables and pack a bag of essentials in advance. And remember never walk or drive through floodwater. Some of these small actions can reduce your risk and help avoid years of financial costs and mental stress.  "
        }
    ]
}