{
    "url": "https://environmentagency.blog.gov.uk/2024/10/18/bedford-ouse-floating-pennywort-project/",
    "title": "Bedford Ouse Floating Pennywort Project",
    "authors": [
        "defrablogs"
    ],
    "categories": [
        "Fisheries and biodiversity",
        "Flood",
        "Flood Maintenance",
        "Flood Planning",
        "Invasive species"
    ],
    "pub_date": "2024-10-18T08:29:46+00:00",
    "content": [
        {
            "text": "My name is Pippa Keynes and I work for the Environment Agency in East Anglia. Part of my job involves managing the Bedford Ouse Floating Pennywort project. This was launched by  Fisheries, biodiversity and geomorphology (FBG colleagues in 2017), and is a collaboration between the Environment Agency, Anglian Water and various local groups. This project is part of a strategic plan, approved by the East Anglia (West) Area Business Board, to control and eradicate floating pennywort (Hydrocotyle ranunculoides) along the Great River Ouse."
        },
        {
            "text": "The non-native plant was first recorded on the Bedford Ouse in 2015 and is a highly invasive aquatic plant that spreads rapidly from small plant fragments, growing up to 20 cm a day under suitable conditions. It forms dense mats that cover water surfaces, blocking sunlight and oxygen from reaching the water below, which poses significant threats to biodiversity and water management."
        },
        {
            "text": "The economic and environmental costs of managing floating pennywort in the UK are estimated to exceed £25 million annually. This unchecked growth can lead to loss of native species, deoxygenation, increased flood risk and can negatively impact recreational activities such as boating and fishing by clogging engines and rudders. If left untreated, the weed could severely impact the Ouse Washes which is a nationally and internationally important conservation site."
        },
        {
            "text": "The project has received funding through various sources, including Flood and Coastal Risk Management (FCRM) and WEIF (Water Environment Improvement Fund) funding, as well as contributions from Anglian Water. It has been extended on an annual basis due to the need to control and monitor floating pennywort."
        },
        {
            "text": "This also aligns with East Anglia’s commitment to improving water quality and protecting vital habitats as part of the 25-year Environment Plan (25 YEP). The plan emphasises managing invasive species to enhance biodiversity and maintain ecosystem health."
        },
        {
            "text": "The project has successfully helped to control the invasive floating pennywort, protect native biodiversity, reduce flood risk and improve recreational activities in the Great River Ouse."
        },
        {
            "text": "In the initial phase, large-scale mechanical removal was necessary to manage the infestation. This involved using specialised weed equipment to remove the floating pennywort from the river. However, over time the project has progressed to a stage where only minor herbicide treatments and hand-picking by contractors, Environment Agency staff and volunteers are required. This shift indicates the project’s success in reducing the weed’s presence."
        },
        {
            "text": "This year, for the first time, the first cycle of surveys on the river has not found any Floating Pennywort.  As mentioned above, it can grow from the tiniest of fragments, so the project will continue to monitor the river."
        },
        {
            "text": "As the project moves towards a monitoring phase, its continued success will depend on sustained funding and collective efforts from all stakeholders. The presence of Floating Pennywort still exists in other river systems in the East Anglian catchment, which will require continued vigilance and further efforts."
        }
    ]
}