{
    "url": "https://cddo.blog.gov.uk/2024/10/18/connected-thinking-across-data-communities/",
    "title": "Connected thinking across data communities",
    "authors": [
        "Rachael Richards, Data Community Lead, CDDO"
    ],
    "categories": [
        "AI",
        "CDDO",
        "Cross-government strategy",
        "Data",
        "Digital transformation",
        "Government Digital and Data"
    ],
    "pub_date": "2024-10-18T14:02:45+01:00",
    "content": [
        {
            "text": "This year’s DataConnect, government's largest virtual data conference, successfully consolidated the public sector data community, and brought together data leaders, academics, innovative thinkers, data scientists, data engineers, and AI specialists for one week, in late September. The spirit of the ‘for the community, by the community’ conference, was reflected in one attendee’s feedback: it ‘brought about connected thinking in a remote world’. "
        },
        {
            "heading": 3,
            "text": "A flavour of the event"
        },
        {
            "text": "The conference was launched by Peter Kyle, Secretary of State for Science, Innovation and Technology, Mike Potter, former Chief Digital Officer for Government and Craig Suckling, Chief Data Officer for Government. They set the tone for the event by stating that data and digital capacity is at the heart of the broader government agenda, and will help deliver better public services."
        },
        {
            "text": "Peter Kyle urged the community to think creatively, imaginatively and ambitiously during DataConnect, with the aim of thinking about what can be achieved together, and unlocking potential from the vast talent pool we already have. "
        },
        {
            "text": "The conference welcomed over 3,200 unique attendees, who attended multiple sessions from a programme of over 40, delivered by over 100 speakers from the Met Office, Ada Lovelace Institute, Alan Turing Institute, British Council, the Open Data Institute, Oxford University, Transport for London and the Estonian Government."
        },
        {
            "text": "Following the launch, a number of sessions throughout the week focused on one of the event’s key themes - data sharing: unlocking access across the system. The ability to share data is critical for driving innovation, improving decision-making, and fostering collaboration. This is a perennial cross-government challenge as many different departments have to go through lengthy processes to share data sets. Our Chief Data Architect for Government, Jenny Brooker, hosted a data sharing panel, with GCHQ, Cabinet Office and NHS England. The panel discussed the cultural, technical and regulatory barriers to data sharing, and offered solutions, including creating a shared platform for data sharing, and advocating for buy-in from senior stakeholders."
        },
        {
            "text": "Feedback from our audience stated that they enjoyed ‘teach in’ sessions, including ‘how to build your first data catalogue’. This panel discussion explored why data catalogues are needed, and how to develop them on a budget. Hosted by Douglas Ward, from PwC, it included panellists from British Council, Ordnance Survey, and Department for Business and Trade. Another panel debate which proved popular explored how Gen AI application was being put into practice across various government departments. This session was hosted by Craig Suckling, and panellists included: Dr Amanda Svensson, from the Government Communication Service, who discussed 'a new way to communicate: The role of data in empowering GCS's AI tooling'; Ganesh Sethi, from Government Digital Service, who talked about 'ask analytics: democratising data insights with Generative AI for GOV.UK'; and Steve Kingston, from Ordnance Survey, who explored 'the AI of where: unleashing the power of grid index systems and foundation machine learning models on Geospatial Data.'"
        },
        {
            "text": "To rewatch these sessions from this year's DataConnect, public sector data professionals are invited to go to the ‘replay’ section on Hopin, the virtual events platform. (You will need to have a public sector email address, and have registered on Hopin previously.)"
        },
        {
            "heading": 3,
            "text": "Community connection"
        },
        {
            "text": "The value of data community partnership across-government is huge. Peer networking through regular meetings and discussions allow for data professionals, at all grades, to pool and acquire knowledge, and find common solutions to challenging projects. "
        },
        {
            "text": "Encouraging collaboration and increasing capability on a community-wide level is the ethos of DataConnect. Feedback from one of our panellists, a representative from GCHQ, echoed this sentiment. He said:         "
        },
        {
            "text": "Our aim going forwards is to strengthen and enable an inclusive public sector data community. If you haven't done so already, please sign up to our mailing list, and you will be kept up-to-date with future community events, which will encourage networking and problem solving."
        },
        {
            "heading": 2,
            "text": "Community events calendar"
        },
        {
            "text": "Our new calendar of events will reflect the spirit of DataConnect, and run informally with partner organisations, and in regional offices. All will be free and aim to bring together UK public sector data leaders, academics, innovative thinkers, data scientists, data engineers, and AI specialists in a relaxed way. "
        },
        {
            "text": "Please get in touch via email on - dataconnect@digital.cabinet-office.gov.uk - with any suggested topics, challenges, hackathons, roundtables or meet-ups you would like to see, that explore the Government's aims to transform digital government. "
        },
        {
            "text": "As outlined by Craig Suckling, Chief Data Officer for Government, in his blog ‘activating data for national benefit and transformed public services’ our work to transform public services, is mission led, and we need to unlock access and break down silos, deliver mission aligned outcomes fast and sustainably, incentivise change with the right system-wide inputs, enable innovation and best practice at scale, and reduce cost and increase resilience. He said:"
        }
    ]
}