{
    "url": "https://naturalengland.blog.gov.uk/2024/10/18/how-natural-england-is-working-with-partners-to-improve-rural-flood-resilience/",
    "title": "How Natural England is working with partners to improve rural flood resilience",
    "authors": [
        "Bradley Tooze"
    ],
    "categories": [
        "Climate change",
        "Environmental Improvement Plan",
        "Farming",
        "Flood Management",
        "Green Infrastructure",
        "Natural England",
        "Nature Recovery",
        "Nature Recovery Network",
        "Site of Special Scientific Interest"
    ],
    "pub_date": "2024-10-18T11:18:44+01:00",
    "content": [
        {
            "text": "By Brad Tooze, Director for Greener Farming and Fisheries"
        },
        {
            "text": "People might be less familiar with how our projects and partnerships help improve flood resilience."
        },
        {
            "text": "In this National Flood Action Week (14-20 October), we wanted to outline some of our partnership work that achieves these goals and set out how Nature recovery helps mitigate the impacts of climate change."
        },
        {
            "text": "The Nature Recovery Network and Local Nature Recovery Strategies "
        },
        {
            "text": "An area of work that remains central to NE’s Action Plan for 2024-25 is the development of the Nature Recovery Network, with protected sites such as Sites of Special Scientific Interest (SSSI) at the core. Both the Network and protected sites need to be future-proof, adapting to pressures from climate change, and we’re working to develop our evidence and tools to aid land managers."
        },
        {
            "text": "Through this work and the development of Local Nature Recovery Strategies (LNRS) we can establish how the nation's natural assets can be managed to help manage and reduce flood risk to business and communities. We will share findings from this work with partners and implement the latest Natural Flood Management techniques through these projects."
        },
        {
            "text": "Working together is core to how Natural England operates – our mission is ‘building partnerships for nature’s recovery’. Natural England is focussing on action that delivers long-lasting multiple benefits for people and Nature from source to sea. A healthy natural environment helps to buffer the impacts of climate change, and thriving natural habitats underpin the resilience we seek."
        },
        {
            "text": "Working with farmers and land managers"
        },
        {
            "text": "As the government’s adviser for the natural environment in England we help to protect and restore our natural world. We will strengthen the contributions of several areas of work to deliver outcomes to improve rural flood resilience, including through our advice to landowners and land managers."
        },
        {
            "text": "Since 2022 through our Catchment Sensitive Farming advice programme we have engaged with at least 60 NFM projects and provided 1-to-1 NFM advice to over 1,500 holdings."
        },
        {
            "text": "Natural England helps to improve flood and drought resilience drawing on decades of experience advising on Agri-Environment schemes. We will continue to advise Defra on the development and delivery of new Agri-Environment options for water management to help reduce and manage flood risk and to lead the implementation of Landscape Recovery schemes."
        },
        {
            "text": "Landscape Recovery offers exciting opportunities to translate our evidence-based advice into direct action at landscape scale, building in resilience to floods and droughts at the start through working with nature. We’re seeing that in the Weald to Waves Landscape Recovery project, which focuses on adaptation to climate change impacts through linking the river corridor to the coast."
        },
        {
            "text": "We develop and run training on Natural Flood Management (NFM) with our partners, including the EA, and provide advice to partners, farmers and land managers on water management."
        },
        {
            "text": "Working with water and lowland peat"
        },
        {
            "text": "The developing field of Paludiculture (essentially ‘wet agriculture’) offers prospects to test new ways to farm within lowland areas through the Paludiculture Exploration Fund (PEF). The PEF is developing knowledge with partners and working toward viable business models for growing crops such as Bullrush (Typha latifolia). The focus for PEF is rewetting peat soils and locking up the carbon within them, but there are numerous other benefits including flood resilience and water quality. "
        },
        {
            "text": "Rural Flood Resilience Partnership"
        },
        {
            "text": "Natural England is a partner in the recently launched Rural Flood Resilience Partnership (RFRP). It was launched last month to help increase resilience to future flood risks, both for agricultural businesses and rural communities."
        },
        {
            "text": "Working collaboratively with the National Farmers Union (NFU), Environment Agency (EA), Country Landowners Association (CLA), Association of Drainage Authorities (ADA) and Action with Communities in Rural England (ACRE), the partnership as developed a two-year joint action plan. No one organisation can do this alone."
        },
        {
            "text": "The Rural Flood Resilience Partnership has developed an Action Plan which will also support delivery of the Environment Agency’s Flood and Coastal Erosion Risk Management Strategy Roadmap and National Farmers Union Integrated Water Management Strategy, specifically targeting the needs and vulnerabilities of rural communities when faced with flooding. Natural England will work with the partners to help deliver this Action Plan."
        },
        {
            "text": "The Partnership is working to achieve the following outcomes:"
        },
        {
            "text": "The future"
        },
        {
            "text": "We will need to adapt and learn as we work with partners to develop new tools, support new business models and work with the emerging green finance markets to complement Government funding. There will be challenges. We will all need to do things differently, but work is already in hand. We are committed to collaborating with our partners and stakeholders to help grow and evolve our workstreams to build the resilience we need to address the challenges ahead."
        }
    ]
}