{
    "url": "https://geospatialcommission.blog.gov.uk/2024/10/18/measuring-the-geospatial-ecosystem-innovation-to-quantify-complexity/",
    "title": "Measuring the geospatial ecosystem: innovation to quantify complexity",
    "authors": [
        "Karina Matjuhhina, Fast Stream Analyst, Geospatial Commission"
    ],
    "categories": [
        "Data",
        "Technology"
    ],
    "pub_date": "2024-10-18T15:45:37+01:00",
    "content": [
        {
            "text": "Karina Matjuhhina, Fast Stream Analyst, explores the UK's geospatial market, highlighting its economic, employment and investment impact. "
        },
        {
            "text": "Geospatial data describes where places, objects and people are in any given location. These data can be static such as the address of a school, hospital or telephone mast.  They can also be dynamic, such as the journey of an intercity train over the course of a day or your running route. "
        },
        {
            "heading": 2,
            "text": "What is the geospatial market? "
        },
        {
            "text": "The geospatial sector is a valuable part of the UK economy, providing critical data and technology that underpins a wide range of services and industries. The geospatial data and technology market is an ecosystem, spanning multiple sectors with a wide range of products and services and with distinct submarkets. This complexity makes it difficult to accurately define, measure and evaluate. "
        },
        {
            "text": "Here at the Geospatial Commission we are always up for a challenge!  "
        },
        {
            "text": "In our 2024 Geospatial Sector Market Report we offer an insight into this vibrant ecosystem, demonstrating its economic impact and employment contributions.  Building on some research conducted with Frontier Economics in 2020, we continue to develop this innovative methodology that enables us to size the market and its impact across the UK and will help us to track how this ecosystem develops.  "
        },
        {
            "text": "This blog gives you some insight into this £6 billion per annum sector, made up of 2,600 companies and which employs nearly 40,000 people - and into how we developed our analytical approach.  "
        },
        {
            "heading": 2,
            "text": "Sizing the sector "
        },
        {
            "text": "Identifying companies where geospatial data is core to their offerings helps provide a clearer picture of the sector’s scope and impact. Traditional sector definitions do not work because geospatial activities span multiple sectors and involve emerging technologies that do not fit neatly into existing classifications. "
        },
        {
            "text": "The approach we developed focuses on identifying companies that could not deliver their products or services without geospatial data. We used a tiered system of search terms related to geospatial data capture, analysis, and application to identify relevant companies. This method provides a more accurate estimation of the market’s value and highlights its broad economic, social and environmental contributions. "
        },
        {
            "text": "We estimate that there are over 2,600 companies in the UK for whom geospatial data is a core part of their product or service offering. These companies are pivotal in delivering location-based services, from mapping and navigation to environmental monitoring and urban planning. Notably, 96% of these companies are fully registered in the UK, underlining the geospatial sectors strong domestic presence. "
        },
        {
            "text": "In terms of economic impact, we estimate the value of the whole geospatial sector to be worth at least £6 billion per annum. This conservative estimate is based on company turnover coverage of the 8.3% of geospatial companies, out of the possible 2,600 companies identified in this assessment, that had made their financial information available. The sector also employs at least 37,500 people across the UK, based on available employment data from 79% of these same companies. These estimates also exclude large multinational companies as it is difficult to isolate and quantify their geospatial market activity. "
        },
        {
            "heading": 2,
            "text": "Geographic distribution and investment "
        },
        {
            "text": "Geospatial companies are well distributed across the UK, with significant concentrations of companies in London, south-east of England, south-west of England, East of England and north-west of England. Substantial clusters of companies are also found in Scotland, Wales and Northern Ireland.  "
        },
        {
            "heading": 3,
            "text": "Geographical distribution of UK geospatial companies, 2024 analysis"
        },
        {
            "text": "Note: Data available from 2,606 of 2,606 identified companies. Source: Analysis based on data from Beauhurst. "
        },
        {
            "text": "The sector has also attracted over £1.2 billion in fundraising between 2013 and 2024 (based on 7% of 2,606 companies that reported their fundraising data). Fundraising is calculated as the total known inward equity investments for identified geospatial companies. This does not include grants (e.g. from UKRI). "
        },
        {
            "text": "This level of investment reflects the sector’s growth potential and its importance in driving innovation and economic activity. Of the companies that reported their fundraising activities, around 62% of those raised more than £500 million between 2013 and 2024, indicating strong investor confidence in the sector’s future.  "
        },
        {
            "heading": 2,
            "text": "Wider impact "
        },
        {
            "text": "Economic value, in its widest sense, extends beyond direct turnover, and the conservative estimates in our report underrepresent the sector’s true value. What we have captured here does not account for any of the broader economic, social and environmental benefits that geospatial data provides. For example, enabling faster emergency services response times by providing precise location information for incidents or optimising vehicle routing, which helps to reduce emissions. "
        },
        {
            "text": "You can read more about how we approach the assessment and measurement of these wider benefits in the Geospatial Commission’s Value of Location Data Guidance. "
        },
        {
            "text": "Given the sector’s evolving nature, methodologies must be flexible and adaptive. The search terms, data sources and methodology will be regularly reviewed in collaboration with industry experts to ensure that it continues to be fit-for-purpose, and the analysis remains relevant and accurate. "
        },
        {
            "heading": 2,
            "text": "What next?"
        },
        {
            "text": "Despite the complexities and nuance involved in identifying and sizing the sector, the report underscores the important role, impact and value that geospatial data and technology brings to a large swathe of the UK economy and society.  "
        },
        {
            "text": "The Geospatial Commission will continue to explore and better understand this ecosystem to unlock its full potential and nurture its growth for the benefit of the UK. As the sector continues to grow and evolve, it will play a crucial role in driving economic development, enhancing public services and addressing environmental challenges.  "
        },
        {
            "text": "You can also  sign up to get an email notification every time we publish a new blog post. For more information about this and other news see our  website, or follow us on  LinkedIn  and  X (formerly Twitter). "
        }
    ]
}