{
    "url": "https://marinescience.blog.gov.uk/2024/10/18/ocean-country-partnership-programme-in-sri-lanka-july-august-2024/",
    "title": "Ocean Country Partnership Programme in Sri Lanka - climate change, seafood and pollution updates.  ",
    "authors": [
        "angharadelliman"
    ],
    "categories": [
        "Animal Health",
        "Aquaculture",
        "biodiversity",
        "Climate Change",
        "International",
        "OCPP",
        "Pollution"
    ],
    "pub_date": "2024-10-18T15:14:01+01:00",
    "content": [
        {
            "text": "Authors: Peter Randall, Charlotte Reeve, Alessandra Bielli, Bryan-Goodsir Thompson, Kelly Bateman, Angharad Elliman"
        },
        {
            "text": "Through the Ocean Country Partnership Programme (OCPP), Sri Lanka and the UK are collaborating to tackle the three key challenges of marine biodiversity, marine pollution and sustainable seafood. The programme aims to support the marine environment and to make a positive impact on the livelihoods of coastal communities that depend on healthy marine ecosystems. OCPP is a UK Government-led official development assistance (ODA) programme under the Blue Planet Fund, delivered by the Centre for Environment, Fisheries and Aquaculture Science (Cefas), the Joint Nature Conservation Committee (JNCC) and the Marine Management Organisation (MMO) on behalf of the UK Department for Environment, Food and Rural Affairs (Defra). "
        },
        {
            "text": "Sustainable Seafood  "
        },
        {
            "text": "In July, a team from Cefas visited Sri Lanka to enhance local expertise in aquatic animal health through specialised training workshops. The team conducted a five-day workshop on shrimp and mud crab disease diagnosis, DNA/RNA extraction, and Polymerase Chain Reaction (PCR) analysis. The goal was to train participants in diagnosing crustacean diseases and identifying new pathogens, using a \"train the trainer\" model to spread knowledge within local organisations. "
        },
        {
            "text": "Key institutions, including National Aquatic Resources Research (NARA), National Aquaculture Development Authority of Sri Lanka (NAQDA), Veterinary Research Institute (VRI), and the University of Peradeniya, were invited, with 32 participants. An extra day of training was offered to MPhil students (funded by the OCPP through the Association of Commonwealth Universities scholarship programme) and staff from the University of Peradeniya. All participants received certificates upon completion. These skills will help improve disease diagnosis, aquaculture, and sustainable food production in Sri Lanka. "
        },
        {
            "text": "Training participants commented, "
        },
        {
            "text": "“The workshop provided me with valuable skills in tissue fixation, precise dissection, and meticulous data recording. This experience has significantly enhanced my expertise in aquatic animal health research methodologies. I am eager to apply these new skills in future projects and collaborations!” "
        },
        {
            "text": "“Under the distinguished guidance of Dr. Kelly Bateman from Cefas we engaged in intensive hands-on training that profoundly deepened our expertise in tissue sampling for both histological and PCR analysis. We extend our heartfelt gratitude to Cefas for providing us with this invaluable learning opportunity.” "
        },
        {
            "text": "Workshop: hands-on dissection and PCR training for aquatic animal diseases. "
        },
        {
            "text": "The molecular biology training group with Cefas’ Morena Santi and Megan Parker."
        },
        {
            "text": "Tackling River Pollution "
        },
        {
            "text": "A team from Sri Lanka's National Aquatic Resources Research and Development Agency (NARA), supported by Cefas’ OCPP team, successfully deployed a large-scale litter boom to tackle pollution. The boom, placed in the Ja-Ela River due to unseasonal rainfall at the original Kelani River site, captures large debris flowing downriver, providing valuable data on plastic waste entering the ocean. "
        },
        {
            "text": "This initiative aims to monitor pollution levels, particularly in the Kelani River, which supplies 80% of Colombo's water. Collecting and analysing the litter will help better understand plastic pollution, allowing for targeted actions to reduce it, improving both environmental health and local livelihoods. "
        },
        {
            "text": "Left: Deployment! Utilising a generator powered winch to deploy the litter boom across the river; "
        },
        {
            "text": "Right: Deployed! - The boom is in the water gathering litter. "
        },
        {
            "text": "Official Handover of Climate Change Education Booklets "
        },
        {
            "text": "Regarding climate change, Cefas’ Charlotte Reeve (OCPP Sri Lanka Pollution Lead and Country co-ordinator) delivered the opening remarks at the formal handover of climate change education booklets at Nawala Boys College, Colombo. The event was attended by representatives from the Ministry of Education, the Ministry of Environment, the Central Environmental Authority (CEA), the British High Commissioner, Foreign Commonwealth and Development Office (FCDO) representatives, and a representative from the British Council as well as staff from both Cefas and JNCC. This event marked a significant step in raising awareness and integrating climate change education into the school curriculum. The team also met with representatives from the CEA and the Ministry of Education to discuss initiating a teacher training programme to use this new resource created by Cefas and JNCC. The resources will help create awareness on the harmful impacts of climate change amongst Sri Lanka’s youth.  "
        },
        {
            "text": "British High Commissioner Andrew Patrick tweeted “These resources will help create awareness on the harmful impacts of climate change amongst Sri Lanka’s youth.” "
        },
        {
            "text": "Official handover of climate change education packs to students of Nawala Boys College, Colombo."
        },
        {
            "text": "Workshop on Marine Pollution Prevention and Coastal Conservation "
        },
        {
            "text": "We were pleased to share highlights from the Marine Pollution Prevention and Coastal Ecosystem Conservation Workshop, organised by Rockland Distilleries (Pvt) Ltd in partnership with the OCPP, where the OCPP team from Cefas and JNCC provided outreach sessions on a range of pollution issues, including a practical fieldwork training session on OSPAR beach monitoring practices. This two-day event brought together youth from various environmental organisations to explore critical issues such as pollution prevention, coral conservation, and the threats facing Sri Lanka's marine ecosystems. "
        },
        {
            "text": "Participants engaged in practical activities, including waste mapping and biodiversity assessments along the coastline, which provided them with hands-on experience in coastal conservation. The workshop, aligned with the UN Environment Programme's Tide Turners Plastic Challenge initiative, was a valuable step towards building capacity for marine conservation in Sri Lanka.  "
        },
        {
            "text": "National ALDFG Conference "
        },
        {
            "text": "OCPP team members and International Union for Conservation of Nature (IUCN) staff supported the delivery of the second national ALDFG (Abandoned, Lost, or otherwise Discarded Fishing Gear) Conference, organised by the Centre for Poverty Analysis (CEPA). Cefas’ Peter Randall (ALDFG Lead scientist) participated in stakeholder discussions as a panellist. This workshop provided valuable insights to guide the direction of upcoming ALDFG work in Sri Lanka. The conference aims to share the findings of the completed initiatives on ALDFG in Sri Lanka and foster a meaningful dialogue on the subject towards identifying practical solutions and a way forward, bringing together government and non-government stakeholders. "
        },
        {
            "text": "Peter Randall (ALDFG lead) was invited to the panel discussion on: ”Exploring donor landscapes and potential collaborations”."
        },
        {
            "text": "Climate Change Risk Assessment Workshop "
        },
        {
            "text": "The Cefas OCPP team then also delivered a two-day Climate Change Risk Assessment Workshop was held in Colombo, Sri Lanka. The event aimed to evaluate the impacts of climate change on Sri Lanka's coastal and marine environments. In preparation for the workshop, the OCPP team drafted a comprehensive Marine Climate Change Evidence Report, which outlined a 'long-list' of 37 key risks—18 related to biodiversity and habitats, and 19 societal and economic risks—identified through a detailed literature review. "
        },
        {
            "text": "The first day focused on biodiversity and habitats, with 29 participants from 17 organisations assessing risks to Sri Lanka's marine biodiversity. On the second day, dedicated to Societal and Economic Risks, 23 participants from 15 organisations refined risks, including splitting the coastal fisheries risk into three concerns: employment, food security, and fish processing.   "
        },
        {
            "text": "This workshop served as a crucial step toward addressing climate change vulnerabilities in Sri Lanka, providing a clearer understanding of both environmental and socio-economic impacts, while identifying key gaps in evidence that require further research. "
        },
        {
            "text": "Strides Forward in the Sri Lanka OCPP Impacts "
        },
        {
            "text": "The Sri Lanka visits over the summer from the various OCPP teams marked a significant step forward in our ongoing efforts to support sustainable seafood production and aquatic animal health, and efforts to tackle marine pollution and climate change in the region. Addressing these challenges supports food security and healthy environments, and also contributes to improved livelihoods for communities. "
        },
        {
            "text": "Special thanks to all our partners in Sri Lanka and all those who participated in this trip: Cefas’ Peter Randall, Charlotte Reeve, Andy Smith, Julia Baker, Alessandra Bielli, Dave Limpenny, Bryan-Goodsir Thompson, Kelly Bateman, Megan Parker, Morena Santi, John Pinnegar, Karen Vanstaem and Piyali Chowdhury and JNCC’s Hannah Lawson and Jamie Small. "
        },
        {
            "text": "Look out for our next blog which will focus on Marine Spatial Planning (MSP) and Marine Protected Areas (MPAs) work in the Ocean Country Partnership Programme led by the Marine Management Organisation (MMO) and the JNCC."
        }
    ]
}