{
    "url": "https://socialcare.blog.gov.uk/2022/04/28/chief-nurse-for-adult-social-care-awards-inspirational-stories-part-one-of-two/",
    "title": "Chief Nurse for Adult Social Care Awards: inspirational stories (part one of two)",
    "authors": [
        "Deborah Sturdy"
    ],
    "categories": [
        "Recognition",
        "Workforce"
    ],
    "pub_date": "2022-04-28T13:35:49+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Ajeesh Thomas, Silver Award winner, Edbury Court Care Home"
        },
        {
            "text": "Growing up in India, Ajeesh Thomas wanted to be a teacher. By the age of 23, he was a qualified accountant, with a lucrative career ahead of him. However, he felt something was missing and came to London to answer his profound sense of vocation to work in a caring profession."
        },
        {
            "text": "Ajeesh found a job at Ebury Court Care Home (EC), in the London borough of Havering. He began as a part time morning care assistant but it quickly became apparent he demonstrated exceptional qualities of compassion, kindness and a thirst for knowledge. These qualities helped him to learn, grow and flourish and he was soon promoted to full time carer and, subsequently, senior carer."
        },
        {
            "text": "Ajeesh has also taken the lead for the co-ordination of end-of-life care (EOLC) at EC and there are many written accolades for his contribution to this vital area of support from families, friends and health and care professionals."
        },
        {
            "text": "During COVID-19, Ajeesh has taken on full responsibility for co-ordinating the testing process, ordering of stock and registering results. He has embraced this responsibility with enthusiasm, performing meticulously ensuring there is always a supply of testing equipment and that staff understand their role and responsibilities and the new guidance and protocols.  During the outbreak in January 2021, he showed outstanding commitment and despite being in a more vulnerable group, worked alongside his colleagues, supporting them and his service users 100%."
        },
        {
            "text": "After ten years of service, EC created a special post for Ajeesh, Senior Care Coordinator, a role committed to improving the well-being of its residents. Today, he has a huge range of responsibilities, becoming the teacher he wanted to be as a boy, training, coaching and supporting staff across the home."
        },
        {
            "heading": 2,
            "text": "Mairead Liston, Silver Award winner – Registered Manager, Cavendish Care Home"
        },
        {
            "text": "Mairead has made a unique contribution to nursing care for more than forty years. She has also found time to participate in substantial charitable fundraising activities."
        },
        {
            "text": "Moving to England from Ireland, Mairead trained in both general care and as a midwife. Her clinical experience, gained in specialist hospital coronary and intensive care units, continues to remind her to always consider those affected by sudden serious illness."
        },
        {
            "text": "For the past thirty-five years, Mairead has led home-based domiciliary care services in London. Cavendish Homecare has an enviable reputation, and an outstanding rating in care from the Care Quality Commission."
        },
        {
            "text": "Mairead’s is an excellent role model with a quiet demeanour, always offering a positive, nurturing approach to her colleagues. Her career choices, family ethos and benevolence to others finds expression in good causes."
        },
        {
            "text": "She has helped to raise substantial funds for many charities, including the British Heart Foundation and for SHABRA. Click the links to find out more about the work Mairead has supported."
        },
        {
            "text": "Throughout the COVID-19 pandemic, Mairead helped to keep staff safe whilst prioritising safe hospital discharge, enabling even clientas with more complex care needs to return home quickly – making a huge impact to the families traumatized by the virus."
        },
        {
            "text": "Are you an award winner? Share the buzz and submit details of colleagues whom you believe deserve recognition and thanks for the amazing work they do. Nominate today! "
        }
    ]
}