{
    "url": "https://dfedigital.blog.gov.uk/2022/04/28/design-community-objectives/",
    "title": "Setting our design community objectives",
    "authors": [
        "Jaskiran Kang, Head of Design"
    ],
    "categories": [
        "community of practice",
        "interaction design",
        "multidisciplinary teams"
    ],
    "pub_date": "2022-04-28T09:10:46+01:00",
    "content": [
        {
            "text": "Within our service and interaction design community, we've agreed  3 design imperatives to help us strengthen and grow our community of practice and capability."
        },
        {
            "text": "Here we examine the direct link between our imperatives, what our design community does, and how this work benefits designers, users and the wider DfE."
        },
        {
            "heading": 2,
            "text": "How it works"
        },
        {
            "text": "Our imperatives are an important strand of work for our community. Under each one, we discuss and choose specific objectives (or pieces of work) that we can complete within 3 months."
        },
        {
            "text": "We make sure that each objective can be measured so we can easily tell if we’ve made progress and if our work has had an impact."
        },
        {
            "text": "Every service and interaction designer selects one objective they want to focus on in the following 3-month period. We then self-organise into smaller working groups and begin mapping:"
        },
        {
            "text": "For consistency, we all use the same template, which I adapted from a visual by Sarah Drummond."
        },
        {
            "text": "We discuss and track our progress on each objective in our monthly development conversations with our profession manager or line manager."
        },
        {
            "text": "At DfE, we’re fortunate to have dedicated profession time, every Thursday afternoon – we set this time aside to work on our objectives."
        },
        {
            "text": "At the end of each quarter, we come together to share progress on each community objective with colleagues across the wider department. In this session we celebrate our successes, and refine our design backlog."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "What we’ve achieved"
        },
        {
            "text": "We’ve followed this process for the past 6 months and worked on 13 objectives. We’ve proven it works."
        },
        {
            "text": "Here are 3 of our 13 objectives. For each one, outputs and outcomes."
        },
        {
            "heading": 3,
            "text": "Roll out collaborative design reviews or critiques"
        },
        {
            "text": "We produced a framework and template for running online collaborative design review sessions (or crits)."
        },
        {
            "text": "The longer term benefits (or outcomes) of these design crits are:"
        },
        {
            "heading": 3,
            "text": "Organise training sessions on the GDS prototyping kit"
        },
        {
            "text": "We ran an ‘Introduction to the prototyping kit’ training session to upskill designers who did not feel confident using it."
        },
        {
            "text": "The longer term benefit (or outcome) is that we now have more design professionals who are confident using this excellent tool in their work."
        },
        {
            "heading": 3,
            "text": "Setting up pairing and buddy groups to have informal conversations and ask for design help and advice"
        },
        {
            "text": "We trialled random coffees with civil servant designers."
        },
        {
            "text": "The longer term benefits of individuals having less formal meetings are:"
        },
        {
            "heading": 2,
            "text": "Next steps"
        },
        {
            "text": "We'll be blogging in more detail about how we achieved some of our other objectives. We’ll post these on Medium and share through DfE Digital and Technology on Twitter."
        },
        {
            "text": "If you would like a copy of our template to set up community objectives, you can reach Jas Kang on Twitter."
        }
    ]
}