{
    "url": "https://educationhub.blog.gov.uk/2022/04/28/essay-mills-are-now-illegal-skills-minister-calls-on-internet-service-providers-to-crack-down-on-advertising/",
    "title": "Essay mills are now illegal - Skills Minister calls on internet service platforms to crack down on advertising",
    "authors": [
        "Media Officer"
    ],
    "categories": [
        "Skills"
    ],
    "pub_date": "2022-04-28T13:20:23+01:00",
    "content": [
        {
            "text": "Skills Minister Alex Burghart has written to internet service platforms to make sure they know that essay mills - which facilitate cheating by helping academic writing, often by appearing to be legitimate - have been made illegal and to call on their support in making sure they can no longer advertise online. Here you can read that letter."
        },
        {
            "text": "The Skills and Post-16 Education Bill has become law. Through this act, the Government has legislated for landmark reforms that will transform post-16 education and skills, including criminalising essay mills."
        },
        {
            "text": "As you may know, Essay Mills are online platforms that facilitate contract cheating. Contract cheating happens when a third party completes work for a student which is passed off by the student as their own work. Many essay mill companies use marketing techniques which indicate they are offering ‘legitimate’ academic writing support for students. Reports also indicate that some essay mills seek to blackmail students who use these services. It is right that we have legislated against these insidious crimes."
        },
        {
            "text": "It is now a criminal offence to provide or arrange for another person to provide contract cheating services for financial gain to students taking a qualification at a post-16 institution or sixth form in England, enrolled at a higher education provider in England and any other person over compulsory school age who has been entered for a regulated qualification at a place in England."
        },
        {
            "text": "Similarly, it is now an offence for a person to make arrangements for an advertisement in which that person offers, or is described as being available or competent, to provide or arrange for another person to provide a cheating service. Importantly, the offence centres around the act of advertising to students, and for the offence to be committed it does not need to be seen by its target demographic."
        },
        {
            "text": "There is now a strengthened, collaborative effort across the sector to tackle essay mills and we want you to be part of this campaign. Platforms such as yourself play an integral role in helping us to make the most effective use of the legislation; marketing and advertising are the lifeblood of any successful industry. We are aware that high numbers of essay mills have used your platform to promote their services to students in the past, paying for advertising to promote their companies. Essay mills are now illegal entities, and you should not carry their advertising. It is no longer a moral question; you will be facilitating an illegal activity. I ask you to do everything in your power to prevent the advertising these unscrupulous practices."
        },
        {
            "text": "Removing essay mill access to online marketing will seriously hamper their efforts to target vulnerable students and I implore you to do so following the introduction of this legislation. We must now all work together to capitalise on it."
        },
        {
            "text": "I hope that in writing to you today I have underlined the urgency of this issue and the important role that companies like yours play in stamping out essay mills once and for all and am sure I can be confident in your support."
        },
        {
            "text": "Thank you for your support with this important matter."
        },
        {
            "text": " "
        }
    ]
}