{
    "url": "https://insideDIO.blog.gov.uk/2022/04/28/infrastructure-investment-transforms-belize-estate/",
    "title": "Infrastructure investment transforms Belize estate",
    "authors": [
        "Lt Col Simon Nichols"
    ],
    "categories": [
        "BATSUB",
        "Belize",
        "British Army"
    ],
    "pub_date": "2022-04-28T16:15:03+00:00",
    "content": [
        {
            "text": "A programme of infrastructure improvement works has recently been completed across the British Army Training Support Unit Belize (BATSUB) estate. The works, delivered jointly by the Army and DIO, will help to improve the experience of exercising troops, staff, and their families."
        },
        {
            "text": "I’m Lt Col Simon Nichols, recent Commander BATSUB. I’ve been in post three years, and this is my last appointment in the Regular Army – all good things come to an end eventually! Before I leave, I wanted to share some of the magnificent work that has been completed in Belize to invest in, develop and improve our infrastructure."
        },
        {
            "heading": 2,
            "text": "BATSUB history"
        },
        {
            "text": "BATSUB enables jungle training exercises for our own forces and numerous partner nations. It has a licence to train up to 3,750 personnel a year in Belize across a network of both Government and privately-owned land, alongside the Belize Defence Force (BDF) and other foreign forces. ‘Mothballed’ in 2011, it was reactivated in 2016 by which time the infrastructure had deteriorated."
        },
        {
            "heading": 2,
            "text": "Infrastructure improvements and upgrades"
        },
        {
            "text": "Following on from the excellent work of my predecessor and the previous BATSUB/DIO Garrison Engineer, and with the added focus of the Integrated Review announcement, that BATSUB was to become a Land Regional Hub, me and my team have worked hard to transform the BATSUB training estate. The term Land Regional Hub means that Belize has been earmarked as one of several permanent bases that will receive investment to ensure it can support a sustained military presence."
        },
        {
            "text": "This year, like last year, the DIO team in Belize, supported by the Royal Engineers as part of exercise SAILFISH, has successfully completed a wide range of infrastructure improvement works. They form part of the CIPD (Command Infrastructure Development Programme - £525k this year) and the LIIF (Local Infrastructure Improvement Plan - £40k this year) which deliver new infrastructure and carry out improvements to existing infrastructure."
        },
        {
            "text": "This year the CIPD investment has seen an extension to the medical centre, road resurfacing, improvements to accommodation, ablution refurbishments, building upgrades and SFA/SLA improvements including painting, retiling and reconfiguring bathrooms. The LIIF has delivered a new HQ ATAP to brief families as they arrive in Belize and to act as a rest area for HQ military staff, a boat launching area to provide a proper boat launching pad for BATSUB boats in support of exercises and recreational activities, mess improvements and enhancements to the waiting room and other areas within the BDF hospital."
        },
        {
            "heading": 2,
            "text": "Working together brings success"
        },
        {
            "text": "The improvements to Price Barracks and the Belize estate are impressive and it's wonderful to see how much work has been undertaken, and the initiative and innovation that has been used, as well as the sheer hard work of the team to get the barracks to its current state. The joint work by personnel on Exercise SAILFISH, DIO staff and the Army has been fantastic. They have done themselves proud and they have transformed the BATSUB estate so it is ready to meet the challenges of becoming a Land Regional Hub."
        },
        {
            "text": "The Life Cycle Replacement investment programme (circa £6m) and the promise of a new Ammunition Holding Facility and Dining Facility (circa £11m), which will be supported by DIO’s Major Programmes and Projects team, will ensure that BATSUB is set to meet the challenges of providing a first-class training base for those conducting training in preparation for operations in the jungle environment and those conducting other activities, in support of UK Defence interests in the region."
        }
    ]
}