{
    "url": "https://insolvencyservice.blog.gov.uk/2022/04/28/insolvency-service-celebrating-international-girls-in-ict-day/",
    "title": "Insolvency Service: Celebrating International Girls in ICT Day",
    "authors": [
        "Sarah Holland"
    ],
    "categories": [
        "Inclusion",
        "People and culture",
        "Working for the Insolvency Service"
    ],
    "pub_date": "2022-04-28T14:01:37+00:00",
    "content": [
        {
            "text": "As part of the Insolvency Service’s Diversity and Inclusion strategy, and our commitment to representing people from a range of diverse characteristics and backgrounds, our Women’s Network Group has teamed up with our technology department, Digital Technology Services (DTS), on this update to celebrate International Girls in ICT Day. "
        },
        {
            "text": " "
        },
        {
            "text": "Girls in ICT Day is held annually to encourage girls and young women to pursue Science, Technology, Engineering and Maths (STEM) education. The event is also there to inspire girls and young women to work in STEM careers, and to engage the community and promote collaboration through partnerships. The Insolvency Service is proud to support our women in their technology careers."
        },
        {
            "text": "As part of her role as Chair of the Insolvency Service Women’s Network Group, Agata Faro has investigated how the agency enables opportunities for women in IT and how that compares to the wider industry. "
        },
        {
            "text": "Agata said that according to the latest Office of National Statistics report released in February 2022 , the number of women working in technology continues to increase, with 44% of UK tech jobs now held by women. However, industry websites suggest statistics that show women in the UK as still widely underrepresented in IT professional and technology leadership roles. "
        },
        {
            "text": "\"We represent the current trend, with 40% of our DTS team female. Few of those are developers (who identify, design, install and test software systems) and none are architects (who plan and implement digital infrastructure,\" said Agata. "
        },
        {
            "text": "\"This could be because of the proportionately lower number of girls and women choosing to study coding. STEM Women states that, in 2019, only around a quarter of graduates were women with STEM qualifications.\" "
        },
        {
            "text": "Agata added; \"When it comes to leadership, however, DTS has a healthy representation of female senior managers with Ranuka Jagpal, Chief Digital Information Officer, leading the directorate.  "
        },
        {
            "text": "Introducing Ranuka, Chief Digital Information Officer"
        },
        {
            "text": "Ranuka Jagpal, Chief Digital Information Officer (CDIO), was previously director for the agency’s Business Services Division – an operational function – until she moved to lead the Insolvency Service’s technology department."
        },
        {
            "heading": 2,
            "text": "Moving from operations to IT"
        },
        {
            "text": "“As a non-tech senior leader, I found the transition fairly smooth and focused on creating the time, space and expectation that technology and IT services are there to support and enable delivery within the agency,” said Ranuka."
        },
        {
            "text": "“The biggest learning curve and change for me was moving from operations to technology, which requires a completely different mindset and approach.”"
        },
        {
            "text": "Ranuka added: “I think not being highly technical helped me to bring a new perspective to leading this directorate. But even so, I needed to learn, so I made sure I upskilled myself in tech knowledge so I could put my leadership style to good use. We place enormous value on training and development in the Insolvency Service and our people receive training for a broad range of skills."
        },
        {
            "heading": 2,
            "text": "Technology is great option as a career"
        },
        {
            "text": "Ranuka said that as well as the Civil Service Diversity and Inclusion Strategy ambitions that will help increase the number and diversity of girls in ICT, Government Digital Services have done a lot of work over the past decade to ensure people of all backgrounds are welcomed into its profession, and earlier this year, the Government Science and Engineering profession published its goals to promote STEM as a profession of choice within schools. "
        },
        {
            "text": "“Technology is everywhere and used by nearly everyone, and the world is different to the one I grew up in,” said Ranuka. “I have two girls myself, and like all children, they are so adept at using tech, which in itself opens up curiosity and interest. Being introduced to coding and tech disciplines at school and the possibility of studying STEM through further education and apprenticeships shows how different the landscape is for the next generation of women."
        },
        {
            "text": "“Whether they pursue a STEM education or not, I still want my girls to realise that technology can be a viable option for a career, with lots of roles available to choose from, whether those are technical, leadership, building relationships, or managing performance or contracts.”"
        },
        {
            "heading": 2,
            "text": "Opportunities in tech at the Insolvency Service"
        },
        {
            "text": "“The Insolvency Service welcomes applications from everyone. There’s so much going on in in our technology team, from corporate support roles to security, architecture and development roles,” said Ranuka."
        },
        {
            "text": "“There’s huge variety in this function. You can find commercial, business analysis, contract, relationship and project and portfolio management roles to name a few, but also technical jobs in architecture, testing, development, and security, at all levels from apprenticeships to senior functional leads. You don’t always need to have technology skills or knowledge to join this team, but you do need to be able to collaborate, converse and plan well. Our job descriptions show what we can offer any applicant - flexibility, opportunities to grow, training, and commitments to diversity. We want to attract a broad range of talent from all walks of life.”"
        },
        {
            "text": "Introducing Emma, Service Delivery Manager "
        },
        {
            "text": "Emma Hart, Service Delivery Manager for DTS, has worked in DTS since 2015. "
        },
        {
            "heading": 2,
            "text": "My role as a Service Delivery Manager"
        },
        {
            "text": "Emma works within the Service Governance team, which puts the processes, functions, guidance and systems in place to implement, manage and monitor the IT used to support the Insolvency Service’s business objectives."
        },
        {
            "text": "“When I first joined you could count the number of female staff on one hand, perhaps 4, maximum, but at the time this was very reflective of most IT departments both in the public and private sectors,” said Emma."
        },
        {
            "text": "“Since then, the changes have been vast, most noticeably in the diversity within our teams. There are now far more female staff joining the technology function in DTS. My team, for example, is pretty much a 50/50 split now, which would never have been the case when I first joined.”\nEmma added: “There has also been a huge change in the types of skills required. When I first joined, I felt as though there was a perception that if you aren’t technical, you can’t really succeed in IT, which is simply not the case.”"
        },
        {
            "heading": 2,
            "text": "Switching to IT was a great career move"
        },
        {
            "text": "Emma said that all teams equally offer value and input to the delivery of our IT services."
        },
        {
            "text": "“I’ve never had a role that required in-depth technology knowledge in something like coding,” said Emma. “But I do have several Information Technology Infrastructure Library (ITIL), Service Integration and Management (SIAM) and Project Management qualifications, which is essentially learning best practices in IT service management and has provided me with knowledge on how our technology management methods should work.”"
        },
        {
            "text": "Emma added: “I had great interest in the role I first applied for (which focused mainly on Incident Management) because it was high paced and challenging, which I love. However, my move was also a strategic decision. Ever since joining The Insolvency Service in 2009, I’ve seen vast changes in technology, such as moving from paper case files to fully digital solutions, and the important role it holds for the future. IT is a very important sector in most organisations, therefore it felt as though it was a good career move.”"
        },
        {
            "heading": 3,
            "text": "Further information"
        }
    ]
}