{
    "url": "https://educationinspection.blog.gov.uk/2022/04/28/supporting-secondary-school-pupils-who-are-behind-with-reading/",
    "title": "Supporting secondary school pupils who are behind with reading",
    "authors": [
        "Gill Jones, Deputy Director, Schools and Early Education"
    ],
    "categories": [
        "deep dives",
        "English",
        "inspection",
        "reading",
        "schools"
    ],
    "pub_date": "2022-04-28T15:00:48+01:00",
    "content": [
        {
            "text": "Gill Jones, our Deputy Director, Schools and Early Education, on reading in secondary schools and supporting weaker readers."
        },
        {
            "text": "Since we have been back to inspecting, many of you have asked us about how we’re inspecting reading in secondary schools. You are concerned that more pupils are behind with reading on entry to secondary school. In this blog post, I explain how inspectors evaluate support for weaker readers. Although it relates to pupils in secondary schools who have fallen behind with reading, it is also relevant for pupils of any age who need to catch up with reading."
        },
        {
            "text": "The impact of COVID-19 on pupils’ reading"
        },
        {
            "text": "The COVID-19 pandemic has led to more pupils not reading well enough for their age. Our autumn 2021 education recovery in schools report told us that many secondary schools are having to focus more on helping pupils to catch up in reading. For example, some were targeting key stage 3 pupils who had been identified as needing additional phonics work. Others had introduced new reading programmes for whole cohorts, such as Year 7."
        },
        {
            "text": "Why reading is so important for schools to prioritise"
        },
        {
            "text": "Reading is the gateway to learning. It is the key to pupils’ future academic achievement and well-being. Pupils who struggle to read words accurately quickly fall behind their peers. They read less and do not accumulate the necessary background knowledge and vocabulary from reading. To fulfil the demands of the secondary school curriculum, pupils need to be able to read age-appropriate texts fluently. Pupils who cannot read well are not able to access the curriculum and are disadvantaged for life."
        },
        {
            "text": "It is therefore essential that reading is a priority to prevent pupils from falling any further behind with their education."
        },
        {
            "text": "Additional support for weaker readers"
        },
        {
            "text": "Pupils who are struggling with reading need help. Comprehension suffers when pupils cannot read words accurately and fluently. Pupils who are struggling to read the words on a page find that their working memory is overloaded. They can’t make sense of what they read, can’t recall previous content, and so fall behind in any subject that requires reading."
        },
        {
            "text": "So, it’s important that assessment checks exactly which aspect(s) of reading that pupils are struggling with – whether weaker readers are having difficulty reading words accurately and/or automatically. This makes sure that you can target extra support effectively. For example, pupils who can’t read unfamiliar words accurately will need phonics teaching. Regardless of age, special educational need or background, the same knowledge of the alphabetic code and phonics skills underpins all reading. Intensive practice should soon make sure that pupils can read age-appropriate texts accurately and automatically."
        },
        {
            "text": "Pupils’ understanding of language can still be developed while they get extra help with phonics. Age-appropriate texts should be read to them so that they can benefit from discussions and broaden their understanding of the vocabulary and concepts that the texts contain. This way, when their word reading catches up, they will have the understanding of language needed to comprehend what they read. It is also why it is so important to get phonics sorted quickly – so that pupils can read and gain knowledge for themselves."
        },
        {
            "text": "How leaders can prioritise reading without narrowing the curriculum"
        },
        {
            "text": "Having additional support may well mean that pupils need to miss some other lessons for a short period of time so that you can address their reading difficulties swiftly. Leaders have told us about ways they have managed this, for example by rotating the subject missed, using registration time or using a slot before the start of school."
        },
        {
            "text": "We recognise that there are difficult timetabling decisions for leaders to make but teaching pupils to read fluently is in their best long-term interests. Reading is the gateway to the curriculum."
        },
        {
            "text": "How we look at what support you’re giving struggling readers on inspection"
        },
        {
            "text": "Our focus on early reading in secondary schools is not new. This approach has always been in our school inspection handbook."
        },
        {
            "text": "We will look at how well reading is prioritised to allow pupils to access the full curriculum."
        },
        {
            "text": "'If pupils are not able to read to an age-appropriate level and fluency, they will be incapable of accessing the rest of the curriculum, and they will rapidly fall behind their peers' (school inspection handbook evaluation criteria, paragraph 221. See paragraphs 348 to 350 for further information on early reading)."
        },
        {
            "text": "We will use a range of evidence from various inspection activities, as follows:"
        },
        {
            "text": "Where can I find out more information?"
        },
        {
            "text": "We have created a SlideShare pack with some points that leaders may want to consider regarding assessment, curriculum and pedagogy for weaker readers. These messages are based on what research and inspection practice tell us about indicators of quality."
        },
        {
            "text": "The Department for Education’s reading framework also has a useful section (section 4) on older pupils who need to catch up with reading."
        }
    ]
}