{
    "url": "https://aphascience.blog.gov.uk/2022/04/28/tails-from-the-new-small-animal-species-expert-group/",
    "title": "‘Tails’ from the new Small Animal Species Expert Group",
    "authors": [
        "Gillian Diesel"
    ],
    "categories": [
        "Pets"
    ],
    "pub_date": "2022-04-28T09:00:05+01:00",
    "content": [
        {
            "text": "This month is National Pet Month which is coordinated by the Pet Food Manufacturers Association (PFMA) and the National Office for Animal Health (NOAH)."
        },
        {
            "text": "It was first established in 1989 and works in collaboration with animal charities and welfare organisations to promote responsible pet ownership, make people aware of the mutual benefit of living with pets, increase public awareness of the role of pet care specialists and to raise awareness of the value of working and assistance companion animals. They also encourage fundraising for UK pet welfare charities and organisations."
        },
        {
            "text": "In this blog, Gillian Diesel, Veterinary Lead for the Small Animal Species Expert Group, which focuses on companion animals, talks about her role in setting up this new expert group at APHA and how pets have been important in her own life."
        },
        {
            "heading": 3,
            "text": "Role and importance of pets"
        },
        {
            "text": "Recent events overseas have reminded me of the importance of pets in our lives and the many benefits they can bring. It has been heart-breaking to watch some of the scenes from Ukraine, and it really struck me the efforts that owners are going to for their pets. Their pets are treated as an equally important member of their family, often travelling hundreds of miles to the border, with the option of leaving them behind unthinkable. We have also seen an amazing response from surrounding countries who have opened their borders, not only to the Ukrainian people, but also to their pets."
        },
        {
            "text": "There have been recent updates to the permissions required for pets to enter the UK from Ukraine. For the most up-to-date information, please visit GOV.UK."
        },
        {
            "text": "COVID-19 lockdowns have also taught me how important pets are. The companionship that pets provided us with during that difficult time was hugely important to many of us. My daughter spent many hours playing with our cats; and I know for many people, particularly those who live on their own, their pets were their only form of companionship for a prolonged period of time."
        },
        {
            "text": "I also noticed that since working from home, some of my working relationships have been strengthened thanks to pets. Where once I was not aware of things in common with colleagues, when we suddenly noticed a dog in the background, or heard a bark or a cat wander in front of the camera, this suddenly opened up a new topic of conversation and highlighted something that brought us closer."
        },
        {
            "text": "My cat often waits patiently for me to settle down in front of my laptop each day so that he can snuggle up on my lap or in the cat bed next to me, and usually decides to stretch in front of the screen, just at the moment I am on a videocall!"
        },
        {
            "text": "I certainly know from my own personal experience, of having owned dogs or cats my entire life, the important role they played for me. Not only did they inspire me to achieve my goal of becoming a vet, but they acted as my confidante and companion during difficult moments."
        },
        {
            "heading": 3,
            "text": "My veterinary career"
        },
        {
            "text": "From a very young age, I always wanted to be a vet and I am lucky enough to have been able to pursue that dream. My veterinary career has been varied but it has almost always focused around pets."
        },
        {
            "text": "I worked predominantly in small animal practice before completing an epidemiology masters and PhD focusing on dog rehoming. I then spent many years working at the Veterinary Medicines Directorate, focusing on pharmacovigilance (the science focussing on understanding and preventing adverse effects of medicines or vaccines); where approximately 80% of all adverse event reports involve dogs and cats."
        },
        {
            "text": "I moved out of clinical practice many years ago as I was looking for a new challenge. I always enjoyed approaching things from a big picture perspective so moving my career into surveillance and epidemiology seemed the perfect fit. Since leaving clinical practice I have been able to make a difference at a population level, and by working in different areas of government, I have been able to influence policy decisions based on my veterinary knowledge."
        },
        {
            "text": "I recently joined APHA in a post which fits with my areas of passion - my love for pets and my veterinary and epidemiology training."
        },
        {
            "text": "Small Animal Expert Group and scanning surveillance"
        },
        {
            "text": "I am now the veterinary lead for the small animal expert group at APHA. For many years, APHA has had species expert groups for livestock and wildlife which sit within our Surveillance Intelligence Unit (SIU) and form integral parts of the scanning surveillance network in England and Wales. I have now been able to set up the small animal group to provide the same function for small animals."
        },
        {
            "text": "Scanning surveillance and the need to monitor diseases in animal populations is of critical importance for the government in order to detect new and re-emerging threats and protect animal and human health. These threats can include notifiable diseases, new pathogens or new strains of a known disease, a change in the patterns of an endemic disease or resistance to a veterinary medicine."
        },
        {
            "text": "Early identification and evaluation of these threats enables early intervention and mitigation to reduce the impact on public health, animal health and welfare and wider society. You may be interested in reading one of our previous blogs regarding the detection of Brucella canis in the UK following an alert from our surveillance teams."
        },
        {
            "text": "By setting up this new group, routes of information exchange will be developed throughout the small animal sector and pets will be better protected."
        },
        {
            "heading": 3,
            "text": "Find out more"
        },
        {
            "text": "For further information on the work of the species expert groups in the Surveillance Intelligence Unit can be found on the Vet Gateway website."
        },
        {
            "text": "Additionally, you may be interested in reading our other surveillance blogs."
        }
    ]
}