{
    "url": "https://educationhub.blog.gov.uk/2022/04/28/top-tips-for-exam-preparation-this-summer/",
    "title": "Top tips for exam preparation this summer",
    "authors": [
        "media officer"
    ],
    "categories": [
        "A Level",
        "Exams and qualifications",
        "GCSE",
        "T Levels"
    ],
    "pub_date": "2022-04-28T14:53:48+01:00",
    "content": [
        {
            "text": "This year students will sit exams set and assessed by exam boards including GCSEs, A levels, T Levels and more. For many young people this will be the first time you are taking formal exams and assessments so it may be worth taking the time to ensure you know what to expect and how you can best prepare for your exams."
        },
        {
            "text": "Exam and assessment arrangements are also a little different this year compared to past exam years to take into account the disruption caused by the pandemic."
        },
        {
            "text": "Here we have outlined some important tips to help with your exam preparation this year."
        },
        {
            "heading": 3,
            "text": "Familiarise yourself with exam arrangements"
        },
        {
            "text": "Ofqual have published a useful guide to exams which explains the support that is in place for you in taking exams and assessments. It also provides other information about this year’s arrangements."
        },
        {
            "text": "In partnership withmade changes to the arrangements for exams and assessments this year."
        },
        {
            "text": "If you want to know more, your teachers will be able to explain the changes to each of your subjects or you can look at Ofqual’s subject by subject guide to see all the changes."
        },
        {
            "text": "Familiarise yourself with your exam timetable and where your exams are taking place. Make sure you know the rules around what you can and can’t do in an exam. For example, taking your mobile phone into the exam is not allowed."
        },
        {
            "text": "Not following the rules could cause you to lose marks or be disqualified from the exam. Listen closely to all the instructions given by your school or college."
        },
        {
            "text": "You can also find out everything you need to know about Covid measures during exams this summer here."
        },
        {
            "heading": 3,
            "text": "Know your exam/syllabus "
        },
        {
            "text": "In some instances, as mentioned above, you may be assessed on less content this year. This is the case for any students studying GCSE English literature, history, geography and ancient history this year.  Make sure you are confident in what content you are revising and will be assessed on . If you are unsure, your teachers will be able to help."
        },
        {
            "text": "It is also beneficial to look at old exam papers and make sure you understand what type of questions you’ll have to answer and can practice."
        },
        {
            "text": "You can also use useful free tools such as BBC bitesize to aid your revision."
        },
        {
            "heading": 3,
            "text": "Find a form of revision that works for you"
        },
        {
            "text": " Some people find it helpful to stick with one style of revision, while for some, it’s helpful to have some variety. You can find some helpful revision techniques, including mind maps and using sounds here."
        },
        {
            "text": "Oak Academy also has a wide range of resources that can help you with your revision. You can access these tools here"
        },
        {
            "text": "You can also do mock exams, online quizzes, make cue cards, or read textbooks and revision guides."
        },
        {
            "text": "The most important thing is to find what works best for you."
        },
        {
            "heading": 3,
            "text": "Make a plan"
        },
        {
            "text": "Making a plan of what you need to revise and when you’re going to do it is a really good way to make sure you stay on track."
        },
        {
            "text": "Download a free revision planning tool to help you plan efficiently. You can then mark out what days and times your exams are."
        },
        {
            "text": "It may be a good idea to identify the key topics you need to revise and plan when you’ll fit it all in ahead of the exam."
        },
        {
            "heading": 3,
            "text": "Take care of yourself "
        },
        {
            "text": "It is normal to feel a little worried or stressed in the run up to your exams but there are things you can do to help manage this."
        },
        {
            "text": "Talk to your friends, family and teachers about how you are feeling. They are there to support and encourage you."
        },
        {
            "text": "Creating a revision plan, setting targets and focusing on your progress can help you feel more prepared. Make sure you take regular breaks to go outside for a walk or to do something you enjoy."
        },
        {
            "text": "Check out our recommendations for useful mental health resources here."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}