{
    "url": "https://hodigital.blog.gov.uk/2021/11/15/a-product-centric-approach-the-eu-settlement-scheme/",
    "title": "A product-centric approach: the EU Settlement Scheme",
    "authors": [
        "The EUSS team"
    ],
    "categories": [
        "Continuous improvement",
        "DDaT Strategy"
    ],
    "pub_date": "2021-11-15T10:36:39+00:00",
    "content": [
        {
            "text": "As set out in our Digital, Data and Technology (DDaT) Strategy 2024 we are shifting to a product-centric approach in how we deliver and operate our products, systems and services in the Home Office."
        },
        {
            "text": "This product-centric approach means our product teams base decisions on how they can help people get the best experience when they use our services. The ideal unit for delivery is a multidisciplinary team of technical, design and user-focussed roles all concentrating on different elements of the product."
        },
        {
            "text": "This blog is about how our delivery teams adopted a product-centric approach to establish the European Union Settlement Scheme (EUSS)."
        },
        {
            "heading": 2,
            "text": "The EU Settlement Scheme service"
        },
        {
            "text": "The EUSS was designed to help European Union (EU) and European Economic Areas (EEA) nationals and their families settle in the United Kingdom (UK)."
        },
        {
            "text": "To obtain settled and pre-settled status, EU and EEA nationals were required to demonstrate a period of residency in the UK."
        },
        {
            "heading": 2,
            "text": "The challenges we faced in delivering the service"
        },
        {
            "text": "The successful delivery of the service relied on overcoming complex challenges:"
        },
        {
            "heading": 2,
            "text": "Scoping the project to meet user needs"
        },
        {
            "text": "So that we could design a service which would enable EU and EEA nationals to demonstrate a period of residency in the UK, product, delivery, research and design teams worked alongside data and engineering teams to break down requirements into user stories."
        },
        {
            "text": "In six months we grew our team of three into multiple delivery teams with over 200 people. A small team of business analysts worked centrally across all the delivery teams, assessing new requirements and determining which teams would need to be involved in their delivery."
        },
        {
            "text": "We assessed the timescales, risks and interdependencies regularly to inform our roadmap for delivery. Working iteratively allowed us to adapt quickly to changing requirements."
        },
        {
            "text": "We worked closely with stakeholders to explain practical realities and trade-offs."
        },
        {
            "heading": 2,
            "text": "Understanding user needs and outcomes"
        },
        {
            "text": "Our multi-disciplinary product teams did comprehensive research, working closely with colleagues from across policy, development and operations, to understand how the product-centric service could meet user needs, which were to:"
        },
        {
            "text": "More specifically, based on feedback we also needed to:"
        },
        {
            "heading": 2,
            "text": "A successful product-centric approach"
        },
        {
            "text": "Over a million applicants applied to the scheme in the first eight months of opening. Feedback from applicants showed they appreciated that we listened to their views and created solutions to make the application process quick and easy."
        },
        {
            "text": "The product-centric iterative approach meant we could continue to align with the scheme’s changing scope and rules, while researching new user requirements associated with these changes."
        },
        {
            "heading": 2,
            "text": "Ensuring lasting impact"
        },
        {
            "text": "The product-centric approach meant the delivery teams also capitalised on using innovative technology including:"
        },
        {
            "text": "Our multidisciplinary teams have shared their learnings and innovations with their professional communities."
        },
        {
            "text": "This has meant many features of the service have laid the foundations for other work the Home Office is doing, such as digitising and streamlining the work undertaken by our Visas and Immigration case working teams."
        }
    ]
}