{
    "url": "https://defradesa.blog.gov.uk/2021/11/15/defra-unfccc-cop26-technology-for-climate-action/",
    "title": "Defra-UNFCCC COP26 Technology for Climate Action",
    "authors": [
        "Mattie Yeta",
        "Defra Desa"
    ],
    "categories": [
        "Climate action",
        "Sustainable Development"
    ],
    "pub_date": "2021-11-15T18:54:52+00:00",
    "content": [
        {
            "text": "Minister Jo Churchill welcomed those attending the UNFCCC-Defra COP26 Technology for Climate Action conference."
        },
        {
            "heading": 2,
            "text": "What we achieved during the Technology for Climate Action event"
        },
        {
            "text": "During the event in Glasgow, attended by close to 2000 stakeholders, CEOs and senior leaders from a range of technology companies came together to discuss how they could best help reduce the harmful impact industrialisation is having on the environment. Most of the companies in attendance could agree that the climate challenge could not be solved in isolation. The tech industry decided to collaborate and hold itself to account through transparency and reporting. Many businesses agreed to a 1.5-degree pathway of reducing emissions by 2050 and sooner (e.g. 2040, 2030 and 2025 for many companies there)."
        },
        {
            "text": "Watch this video for key highlights from the event with key messages from Sarah Homer (Defra's Director General) and Chris Howes (Defra's CDIO)"
        },
        {
            "text": "You can read more about the event on Insider News Media."
        },
        {
            "text": "Another highlight of the event was AXELOS’ introduction of the new ITIL® 4 module, ITIL 4 Specialist: Sustainability in Digital & IT across 150 countries where many companies pledged to adopt the framework. It explores how sustainability can be integrated into a service organisation’s strategy, tactics, and operations using the ITIL 4 framework. The new module has been developed in close collaboration with Defra, the UK ministerial Department for Environment, Food and Rural Affairs. You can read further about the module through WiredGov News Media."
        },
        {
            "text": "By far, the most significant development was the prospect of a global partnership  to drive nature-based technology solutions not just in the UK, but globally.  We’ll share developments of this work in due course."
        },
        {
            "text": "For further queries about the Defra e-alliance and partners please contact sustainableICT@defra.gov.uk Mattie Yeta – Ph.D. researcher (specialist natural capital, sustainability and engineering)."
        }
    ]
}