{
    "url": "https://teaching.blog.gov.uk/2021/11/15/developing-a-whole-school-approach-to-tackle-bullying/",
    "title": "Developing a whole school approach to tackle bullying",
    "authors": [
        "Holly Edwards"
    ],
    "categories": [
        "Primary schools",
        "Pupil wellbeing and behaviour"
    ],
    "pub_date": "2021-11-15T09:57:21+00:00",
    "content": [
        {
            "text": "Holly Edwards is Deputy Head and All Together Project Lead at Priory Junior School in Nottinghamshire. She talks us through their journey from an audit of their anti-bullying practice which identified a need for improvement, to being awarded Gold Status through the All Together Programme in 2021 for their dedication and robust approach to tackling bullying."
        },
        {
            "text": "School leadership"
        },
        {
            "text": "The decision to focus on bullying came about when an Ofsted inspector shared her findings about our school. She noted there were few incidents of bullying, but there was a mismatch in knowledge and understanding around bullying and the extent to which it can affect people’s lives. Therefore, we knew we needed to find an approach that included everyone, provided clear direction, and upskilled both staff and pupils to address it now and in the future."
        },
        {
            "text": "This is when we discovered the All Together Programme and I was assigned project lead, which meant I was responsible for coordinating the school’s approach to anti-bullying and supporting pupils to take a lead on anti-bullying initiatives."
        },
        {
            "text": "Training & development"
        },
        {
            "text": "I found there was little understanding in our school about the definition of bullying, the role people can play in prevention and the impact it can have. Before the launch of Anti-Bullying Week, all staff participated in professional development through inset training and completing the Anti-Bullying Alliance’s online modules. They were trained in facilitating resolution circles, emotion coaching and active listening. We viewed tackling bullying, just like supporting any other subject or area of safeguarding."
        },
        {
            "text": "A crucial factor to the success of the programme, was also to train some pupils to become ‘Peace Force’ members. They take part in termly meetings to discuss key topics and share their classes’ ideas to tackle bullying. This year we plan to train them in peer mentoring skills."
        },
        {
            "text": "School policy"
        },
        {
            "text": "Our anti-bullying policy was updated and explained to everyone, including parents. The message was clear, to tackle this we needed to work together. We launched an online parent hub through our website, this gave them access to our updated policy and support videos."
        },
        {
            "text": "The policy includes strategies to prevent bullying and typical response strategies. In English lessons, we have used quality texts in each class, to explore different bullying themes and bring the policy to life. A challenge we faced was exploring the difference between retaliation, revenge, and self-defence. To do this, pupils explored the definitions and learned to defend against bullying in an appropriate and safe way. As a result, pupils feel empowered and more confident in preventing and responding to bullying."
        },
        {
            "text": "Data collection & evidence  "
        },
        {
            "text": "We now monitor incidents of bullying more carefully and record all occurrences of conflict or retaliation on our online safeguarding system. This has enabled us to identify patterns. The message to pupils and parents is that we take every incident seriously and by keeping a record, planning for intervention, and monitoring, we can prevent similar incidents from happening again."
        },
        {
            "text": "What did we achieve?"
        },
        {
            "text": "Following completion of the All Together Programme, incidents of bullying and conflict have reduced dramatically across school. Pupils now have the knowledge and understanding to know when something is not right and how to resolve situations themselves. Pupils’ behaviour towards each other has become more empathetic and inclusive – showing an understanding that difference is to be celebrated. Our pupils are happier in school knowing that we fully support any bullying concerns raised."
        },
        {
            "text": "Read guidance for schools on preventing and responding to bullying"
        },
        {
            "text": "Visit the Anti-Bullying Alliance website"
        }
    ]
}