{
    "url": "https://deframedia.blog.gov.uk/2021/11/15/government-considering-new-action-on-wet-wipes/",
    "title": "Government considering new action on wet wipes",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "plastic",
        "Weekly stories"
    ],
    "pub_date": "2021-11-15T14:52:39+00:00",
    "content": [
        {
            "text": "There has been coverage in the Daily Mail of our intention to consider strict new standards for wet wipes to prevent dangerous pollution being flushed down our toilets and ending up in our rivers or littering our beaches."
        },
        {
            "text": "The Government intends to announce a call for evidence on problematic plastics this week, where future policy options that will be explored include a possible ban on wet wipes containing plastic to encourage the public to shift away from single-use items."
        },
        {
            "text": "Another measure being considered is overhauling wet wipe labels to help consumers dispose of these items correctly. The Government will also examine how we can put the responsibility firmly at manufacturers’ doors to make sure they are doing everything they can to tackle single-use plastics, including litter from cigarette butts."
        },
        {
            "text": "Single-use plastic plates, cutlery and expanded and extruded polystyrene cups are among a range of items that could be banned in England as part of a new public consultation being launched in the Autumn."
        },
        {
            "text": "A Defra spokesperson said:"
        },
        {
            "text": "The UK is a global leader in combatting plastic waste and has already taken major steps to tackle plastic pollution, banning microbeads in rinse-off personal care products, and restricting the supply of single-use plastic straws, stirrers and cotton buds."
        },
        {
            "text": "Following the huge success of the 5p charge on single-use carrier bags, which cut sales in the main supermarkets by 95% since 2015, we increased the minimum charge to 10p and extended it to all retailers, ensuring we can take billions more bags out of circulation."
        },
        {
            "text": "Through the Environment Act, the Government is bringing in a wide range of further measures to tackle plastic pollution and litter, including:"
        },
        {
            "text": "We will also introduce a world-leading plastic packaging tax from April 2022, set at £200 per tonne, on plastic packaging which doesn’t meet a minimum threshold of at least 30% recycled content. This will encourage greater use of recycled plastic, leading to increased levels of recycling and plastic waste collection, helping to tackle the problem of plastic waste and protect our environment."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}