{
    "url": "https://securityprofession.blog.gov.uk/2021/11/15/government-security-awards-2022-nominations-now-open/",
    "title": "Government Security Awards 2022 - Nominations Now Open!",
    "authors": [
        "Government Security Profession"
    ],
    "categories": [
        "Awards",
        "Events",
        "Government Security",
        "Professionals"
    ],
    "pub_date": "2021-11-15T12:25:50+00:00",
    "content": [
        {
            "text": "Dear All,"
        },
        {
            "text": "I am hugely excited to announce the launch of this year’s Government Security Awards. This is a great opportunity to celebrate our Government Security profession, who have worked tirelessly to ensure the highest standards across our function, and I ask for your support in encouraging nominations from across the security community. "
        },
        {
            "text": "The Government Security Awards are a celebration of success and help us identify and acknowledge exceptional achievements across the Function. They provide an opportunity to champion the hard work, enthusiasm and determination of our people and enable us to share knowledge and best practice right across government. "
        },
        {
            "text": "This year you will see the addition of a new category, the Diversity & Inclusion Award. Diversity & Inclusion continues to be a huge priority for us within Government Security and we want to celebrate those who are already making great strides and pushing this crucial priority forward.  "
        },
        {
            "text": "This year’s five categories are: "
        },
        {
            "text": "If you would like to submit a nomination, contact gsp@cabinetoffice.gov.uk and we will supply you with a nomination form and nomination guidelines, which will cover each award and how to submit a strong application."
        },
        {
            "text": "Nominations will officially close on Friday 31st December 2021. We will be celebrating virtually this year, with the ceremony taking place in March 2022. "
        },
        {
            "text": "Last year we received over 100 nominations, which is evidence that there is a huge amount of amazing work happening across the profession that deserves recognition.   In order to recognise the incredible work behind the scenes, we want everyone across the Function to have the opportunity to submit a nomination for the 2022 awards, so please do pass this on to any and all within the function so they can get involved."
        },
        {
            "text": "Joanna Billan, Deputy Director, Government Security Profession "
        }
    ]
}