{
    "url": "https://dwpdigital.blog.gov.uk/2021/11/15/how-ive-been-supported-in-my-trans-journey/",
    "title": "How I’ve been supported in my trans journey",
    "authors": [
        "Leonardo Gada - Higher Statistical Officer, Data as Statistics, DWP Digital"
    ],
    "categories": [
        "Data",
        "Diversity",
        "DWP Digital",
        "Transgender awareness"
    ],
    "pub_date": "2021-11-15T10:33:38+00:00",
    "content": [
        {
            "text": "I’ve worked as a data statistician at DWP Digital for the last two years and earlier this year I took on a voluntary role in a:gender, the network supporting all trans and intersex staff across government. I have the freedom to carry out this role as part of my full-time job."
        },
        {
            "heading": 2,
            "text": "Starting my transition at work "
        },
        {
            "text": "I started my transition at work in March 2020, just as the pandemic took hold and we were all asked to work from home. To begin with, I want to stress that in DWP I’ve been supported by everyone massively."
        },
        {
            "text": "I’m Italian, so not being a British citizen meant I also had some added hurdles to overcome. I never admitted this openly at work, but not having my family close to me added to an almost unsustainable amount of stress and anxiety. It was a real struggle at that time, but I also knew that everyone was doing all they could to help me. Despite that, I want whoever reads this to know it was all worth it and I would do it again, ten times over if needs be, to get to where I am now. I had everything to gain and nothing to lose by becoming my real self."
        },
        {
            "heading": 2,
            "text": "So much colleague support"
        },
        {
            "text": "My line manager really went above and beyond through an exhausting process that lasted for months. She has been an incredible ally, both practically by going through each step of the process with me and emotionally as I went through this remarkable journey. She’ll probably read this and tell you she doesn’t deserve this much recognition, but she does!"
        },
        {
            "text": "My team leader was also fantastic, always checking in with me to find out how I was doing and being very understanding of the situation. I’ll never forget the day I told her my intention to transition, expecting to have to argue my case to start the procedure at work and ‘justify myself’, but that never happened. She simply listened to what I had to say and said “Okay, so what do you need us to do now? Let me know if there is anything I can do.”"
        },
        {
            "text": "All my colleagues have been amazing. I asked for a communication to go out to inform them about my transition and preferred name, I then went on leave. When I came back it was an early-August morning I’ll never forget. My inbox was flooded with messages of support. I’ve saved them all in a special folder."
        },
        {
            "heading": 2,
            "text": "Working through the pandemic "
        },
        {
            "text": "When the pandemic began, my team created a WhatsApp group to keep in touch more easily. We often ran quizzes at the beginning of online meetings to keep in touch and remain positive, despite all that was happening. I think everyone felt the impact of the restrictions and we were all aware that being kind and showing understanding was the only way to go."
        },
        {
            "heading": 2,
            "text": "A supportive workplace in a difficult time"
        },
        {
            "text": "I’m not trying to sell this as an easy process though. It was hard to find someone that could guide me through the legalities of it. There is a lot that needs to be improved for trans people in the UK, but what’s in place works and achieves results."
        },
        {
            "text": "Often being trans means you need to become your own GP, therapist, lawyer, and secretary. It’s like having another full-time job, phone calls and emails included. On this note if you need help with understanding how being an immigrant and transitioning fit together, please get in touch with me, I’d love to help and my personal experience may be useful."
        },
        {
            "text": "What I want everyone to know is that gender-diverse people and transgender people are valued in DWP. There’s guidance, policies and set procedures to help people like us through this incredible, crazy, scary, and rewarding journey. And there are plenty of amazing supportive people here. This has helped me to feel happy, and everyone deserves to feel happy."
        },
        {
            "text": "We have plenty of information on our internal intranet pages and the transgender page has been recently refreshed. I’ve visited the pages and think they’re clear and complete. For more support there are networks such DWP Pride, the DWP LGBT+ staff network, and outside of DWP there’s a:gender that can help with navigating the process, both in practice and emotionally."
        },
        {
            "text": "I’ll also leave my contact here in case you wish to get in touch. I might not be able to help you directly but can signpost you to the right person. leonardo.gada@dwp.gov.uk"
        }
    ]
}