{
    "url": "https://educationinspection.blog.gov.uk/2021/11/15/investigating-unregistered-schools-how-you-can-help/",
    "title": "Investigating unregistered schools – how you can help",
    "authors": [
        "Christopher Russell"
    ],
    "categories": [
        "unregistered schools"
    ],
    "pub_date": "2021-11-15T12:15:28+00:00",
    "content": [
        {
            "text": "Chris Russell, our National Director, Education, explains the work of our unregistered schools taskforce and what you should do if you want to report an illegal, unregistered school. "
        },
        {
            "text": "Did you enjoy your school days? Whether you recall them with fondness or not, I doubt you went to school in a disused office block or a semi-commercial unit in a drab industrial estate. But believe it or not, some children do."
        },
        {
            "text": "Did you know that some schools operate under the radar, with no regulation or public oversight? Many of these places are charging parents and cash-strapped local authorities thousands of pounds, and offering a woeful standard of education in return."
        },
        {
            "text": "Before joining Ofsted, like most people, I wasn’t aware of unregistered schools. These ‘schools’ intentionally operate outside the framework of regulations that protect children’s welfare, safety and education standards."
        },
        {
            "text": "Unregistered schools are rarely found in purpose-built, high-quality grounds, with all the modern facilities that we expect for our children. Often, they are badly maintained, unsafe and squalid, with poor fire safety and inadequate hygiene facilities."
        },
        {
            "text": "All children deserve a good education in a good school. But many of these settings are providing a narrow curriculum that does not meet children’s educational needs. This limits their future choices and, if left unaddressed, will have profound consequences for the thousands of children who attend these institutions."
        },
        {
            "heading": 3,
            "text": "What is an unregistered school?"
        },
        {
            "text": "An unregistered school is an educational establishment that meets the legal definition of an independent (private) school, but is not registered with the DfE. It’s against the law to run an independent school unless it’s registered with the DfE, which is the regulating body for this kind of school. In fact, anyone who runs an unregistered school is guilty of a criminal offence, which carries a maximum penalty of 6 months’ imprisonment, an unlimited fine, or both."
        },
        {
            "text": "In law, an ‘independent school’ is an institution that is not a local authority maintained school or a non-maintained special school at which full-time education is provided to either:"
        },
        {
            "text": "Unfortunately, legislation has not kept up with the reality on the ground. Institutions have learned how to operate on the cusp of the law by exploiting loopholes, while government’s ability to regulate them effectively continues to lag behind. This means that in some cases, these places operate in plain sight."
        },
        {
            "heading": 3,
            "text": "Investigating unregistered schools"
        },
        {
            "text": "Since we established our Unregistered School’s Taskforce in 2016, we’ve investigated more than 800 institutions and issued over 100 warning notices to owners and managers who run them. We’ve prosecuted 4 of these places with support from the Crown Prosecution Service and the Department for Education (DfE)."
        },
        {
            "text": "However, this is not a widely known problem. Most people are still unaware that there are many hundreds of places providing a full-time education to children with no oversight or assurances about their quality or safety."
        },
        {
            "text": "Although there’s no reliable data on how many of these places are out there, our investigations show that this is a persistent problem. What we’ve uncovered so far is, I suspect, only the tip of the iceberg. We will continue to work closely with the DfE, local authorities and other agencies to identify and disrupt these places. But we need the support of the public too. "
        },
        {
            "heading": 3,
            "text": "How to report an unregistered school"
        },
        {
            "text": "Every single child deserves a decent education. But many children in illegal schools enter the adult world without the knowledge, skills and experience to lead a successful life and play their part in society."
        },
        {
            "text": "It’s vital that we uncover these schools and either make sure they register – so we can be sure they are safe – or close them down. If we don’t, we risk children being robbed of their life chances."
        },
        {
            "text": "Remember: unregistered means unsafe."
        },
        {
            "text": "If you think somewhere might be running as an unregistered school, you should report it to unregisteredschoolreferrals@ofsted.gov.uk so we can investigate."
        },
        {
            "text": "The unregistered schools team may contact you to find out more information. Just let us know if this is something you want to avoid and we will make sure your privacy is protected."
        },
        {
            "text": "Find out how to report an unregistered school."
        }
    ]
}