{
    "url": "https://ruralpayments.blog.gov.uk/2021/11/15/mp-roundtable-with-the-rpa-tim-farron-mp-westmorland-and-lonsdale/",
    "title": "MP Roundtable with the RPA - Tim Farron MP (Westmorland and Lonsdale)",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Agricultural Transition",
        "Sustainable Farming Incentive"
    ],
    "pub_date": "2021-11-15T10:12:38+00:00",
    "content": [
        {
            "text": "Café Ambio, Junction 36 at the Rural Auction Centre in Crookland was the perfect place to host our biggest MP Roundtable yet. With a huge turn out of over 100 farmers and land managers, this was a bit of a different event to normal. Less intimate than some of our smaller sessions, but great to see such a turn out from the farming community, particularly recognising that the timing of the event meant that many will have had to choose to give up their valuable time to share views."
        },
        {
            "text": "Tim Farron MP kindly hosted us in his constituency and provided everyone with a warm welcome. He has been the MP for Westmorland and Lonsdale since 2005 and has been described by the NFU as ‘a true ally of farmers’. First up to speak was Paul Caldwell, CEO of the RPA, to give an introduction on what the event was all about. As with our previous Roundtables, Paul explained what we were there to do - provide an update from the RPA, to give more details about the Agricultural Transition Plan and offer an opportunity for farmers and land agents to ask questions and provide feedback."
        },
        {
            "text": "Paul, Sandy Kapila and Martin Fagan (from the RPA Leadership Team) outlined the RPA 5-year strategy and stressed our ambition to build a different relationship with farmers, highlighting some of ways the Agency was transforming the way it worked with rural communities. 2021 saw us attend the most shows and events yet, and we got some really valuable insight from our customers which is helping to shape how we approach things in the future."
        },
        {
            "text": "The attendees were also given an update, from Louise Maguire from Future Farming Countryside Programme in Defra, on the work underway on the environmental land management schemes i.e. Sustainable Farming Incentive (SFI), Local Nature Recover and Landscape Recovery. The SFI pilot was launched in July 2021 and the Westmorland and Lonsdale constituency has 14 farms involved. Paul Caldwell confirmed that the SFI will be open to everyone next year and we’re using feedback from the pilot to make it a more attractive approach to everyone. The RPA will also be working on how they can support people through the application process."
        },
        {
            "text": "After the presentations, we moved onto a lengthy Q&A session. The attendees raised insightful points around the environmental land management schemes, food production and food security, which were the hot topics of the evening."
        },
        {
            "text": "A consistent theme throughout the Q&A session was the needs of tenant farmers; the impact of BPS reductions on upland farmers; incentivising food production; and a lack of recognition of the work that farmers do. While we are working on these areas we know there is more to do and we committed to feedback to Ministers and policy officials."
        },
        {
            "text": "We received some great feedback from the session and are grateful to everyone who took the time to listen to what we had to say and raise their concerns. It is evident that there is still is a real desire for the detail and farmers want to know more about the intricacies of the environmental land management schemes, what it means for them, and how in turn the RPA can help. A further announcement is due at the end of November which will provide some further detail around the next steps of the Agricultural Transition Plan."
        },
        {
            "text": "We are organising more roundtable events over the coming months with MPs across the country and we are arranging other sessions with farming bodies and associations, so keep an eye on our blog for more information. To receive further updates to your inbox, you can subscribe to the blog."
        }
    ]
}