{
    "url": "https://civilservicelocal.blog.gov.uk/2021/11/15/overcoming-personal-and-professional-barriers-your-next-junior-leaders-networking-event/",
    "title": "Overcoming Personal and Professional Barriers: Your next Junior Leaders Networking Event",
    "authors": [
        "Ian Barton"
    ],
    "categories": [
        "East, South East & London"
    ],
    "pub_date": "2021-11-15T10:14:20+00:00",
    "content": [
        {
            "text": "The next Junior Leaders Networking Event (JLNE) is a Lunch and Learn session taking place on Tuesday 30 November 2021."
        },
        {
            "text": " "
        },
        {
            "text": "JLNE is aimed at colleagues in the AO to EO grades from across government departments. It operates across the East, South East and London and provides junior leaders with the opportunity to network with peers in other departments, learn from senior leaders and access tools to enhance both their personal and professional development."
        },
        {
            "text": "From 2020, JLNE went virtual due to the pandemic and each event has been well attended and received. We continue the trend, using Microsoft Teams, which offers the event to many more attendees than if it was face to face."
        },
        {
            "heading": 4,
            "text": "Why attend?"
        },
        {
            "text": "Join us at our final 2021 JLNE event. It will be an opportunity to hear from 3 inspiring speakers."
        },
        {
            "text": "It will also be a time to self-reflect on this year, discover tips on overcoming imposter syndrome and addressing professional barriers and time for Q & A."
        },
        {
            "heading": 4,
            "text": "What is Imposter Syndrome?"
        },
        {
            "text": "Have you ever felt …"
        },
        {
            "text": "If so, you may be suffering from imposter syndrome."
        },
        {
            "text": "Imposter syndrome is the name given to the persistent feelings of self-doubt that many people experience, which may hold them back from achieving their full potential at work."
        },
        {
            "text": "Hannah O’Sullivan and Leah Clarkson will be leading this event. Hannah and Leah are part of the Home Office Gender Equality Network and have been leading a project on imposter syndrome since early 2020."
        },
        {
            "heading": 4,
            "text": "The session"
        },
        {
            "text": "Please note that you must be able to access Microsoft Teams via the app or browser to join this online event. Please use your work email address to register on Eventbrite. If you are unable to access Microsoft Teams on your work device, you may wish to join using a personal device. All links will be sent at least 24 hours prior to the event."
        },
        {
            "text": "Please discuss attendance at this event with your line manager."
        },
        {
            "text": "If having booked a ticket you are no longer able to attend, please ensure you cancel your ticket promptly, so another colleague has the opportunity to join the session."
        },
        {
            "text": "Find out more about our past offerings at JLNE past events"
        },
        {
            "text": " "
        }
    ]
}