{
    "url": "https://insideDIO.blog.gov.uk/2021/11/15/restoring-native-tussac-grass-habitats-in-the-falkland-islands/",
    "title": "Restoring native tussac grass habitats in the Falkland Islands",
    "authors": [
        "Captain John Gajdus"
    ],
    "categories": [
        "BFSAI",
        "Environment and Ecology",
        "Falkland Islands"
    ],
    "pub_date": "2021-11-15T15:15:24+00:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "One of the major responsibilities shared by DIO and British Forces South Atlantic Islands (BFSAI) is the sustainable management of land and facilities used by British forces in the Falkland Islands. This includes the conservation of some of the islands’ native ecosystems, which provide habitats for rare and threatened species including sea lions, Magellanic penguins, and the tussac-bird and Cobb’s wren."
        },
        {
            "text": "In September this year, DIO and BFSAI personnel worked in partnership with Falklands Conservation on a vital project to restore the landscape and ecology of Middle Island, near West Falkland."
        },
        {
            "heading": 2,
            "text": "The decline of the local ecology"
        },
        {
            "text": "Middle Island, like its neighbour Green Island, was once covered in the endemic tussac grass. A hardy plant that grows in large clumps, often more than two metres high and almost as wide, it once covered shoreline landscapes across the Falkland Islands."
        },
        {
            "text": "With the introduction of sheep to the islands, the sweet and nutritious tussac grass was ripe for destruction. A combination of over-grazing and damage caused by fires pushed the tussac coverage on Middle Island past a critical point and it began to die back. When tussac cover is removed, it exposes the soil underneath. This is usually peat, which is quickly dried by the incessant winds, turning it to a coarse, barren dust. Picked up by the same winds, this dust then chokes all nearby plant life, further weakening the regional ecosystem."
        },
        {
            "heading": 2,
            "text": "Working together to re-plant tussac grass habitats"
        },
        {
            "text": "Saving the coastal habitats of the Falkland Islands from decline is a key objective of the Falklands Conservation organisation. They have been working in partnership with the BFSAI Conservation Group to restore the landscape of Middle Island to its original state by re-planting tussac grass collected from nearby islands."
        },
        {
            "text": "Each morning over a four day period in early September, a group of volunteers including a number of DIO and BFSAI personnel headed by boat for the islands in the Choiseul Sound, and would spend the morning ‘pulling tillers’. A ‘tiller’ is a section of tussac grass that is formed as a whole and can be safely removed from the larger clump without damaging it or the remainder of the plant."
        },
        {
            "text": "The volunteers loaded the tillers into sacks which were shipped over to Middle Island, followed by a hike over challenging terrain to the planting location. Once there, they worked in pairs to re-plant the tillers."
        },
        {
            "heading": 2,
            "text": "Long term impacts"
        },
        {
            "text": "This replanting work is of vital importance as currently only 1% of the Falklands’ 778 islands are considered intact tussac habitats. Through the collaborative efforts of Falklands Conservation and personnel from the BFSAI Conservation Group and DIO, an area of approximately 200 by 50 metres was planted each day."
        },
        {
            "text": "Previous years have seen a re-growth success rate of well over 80%. If this year’s plants match that survival rate, the vast majority of the eroded northern shore of the island will be protected against further erosion. Continued efforts over the next two years will complete the work to replant the barren areas, helping to re-establish an ecosystem that supports a wide range of wildlife species."
        },
        {
            "text": "DIO’s involvement in projects such as these forms a key part of our commitment to becoming an expert in sustainability, climate change and the environment across the UK Defence Estate, both at home and overseas. Keep an eye on our blog for updates on other projects and initiatives through which we are sustainably managing land and facilities on behalf of the UK Armed Forces."
        }
    ]
}