{
    "url": "https://educationhub.blog.gov.uk/2021/11/what-you-need-to-know-about-skills-and-technical-education/",
    "title": "What you need to know about skills and technical education",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Further education"
    ],
    "pub_date": "2021-11-15T19:49:29+00:00",
    "content": [
        {
            "text": "We want to make sure that education and training gives people the skills they need to go on to get great jobs that are fulfilling for them and boost the economy."
        },
        {
            "text": "Today the Education Secretary Nadhim Zahawi opened a debate in the House of Commons on the Skills and Post-16 Education Bill – which is part of the way that we’re making it happen."
        },
        {
            "text": "But what does that mean in practice? Here we answer your questions."
        },
        {
            "heading": 3,
            "text": "How are you making sure education and training lead to good jobs? "
        },
        {
            "text": "In 2019 employers reported that they were unable to fill a quarter of all vacant positions because they couldn’t find people with the right skills."
        },
        {
            "text": "We are putting employers at the heart of our skills reforms, so that you know that whatever qualification you choose will be giving you the skills and experience that employers are after."
        },
        {
            "text": "The Bill will also make it a legal requirement for colleges and other providers of technical education and training to work with local employer representative bodies to develop local skills improvement plans to make sure training is meeting the skills needs of employers and local economies. Local skills improvement plans are currently being trailblazed in 8 local areas across the country."
        },
        {
            "heading": 3,
            "text": "It's confusing to know which courses and qualifications are worthwhile and which aren’t – what are you doing about that?"
        },
        {
            "text": "All students deserve to know that every course they take is one that employers value and leads to a good job."
        },
        {
            "text": "There are already high quality technical qualifications on offer, including T Levels, developed with employers and offering a mix of classroom learning and on the job training, and Apprenticeships. The recent Spending Review also announced a £3.8 billion investment in further education and skills across this Parliament – meaning more money for qualifications like T Levels and Apprenticeships and more funding for adults to upskill or retrain."
        },
        {
            "text": "However, there are currently around 12,000 qualifications at Level 3 and below, which can mean it is confusing for people making choices and for employers trying to understand the skills of prospective employees. By comparison, the Netherlands, Germany and Switzerland, have around 500 or fewer."
        },
        {
            "text": "That is why we will be simplifying the system. This will mean that funding is stopped for some Level 3 qualifications, including some Applied General qualifications and BTECs. We will continue to fund Applied General or similar qualifications where there is a clear need for them and so that all young people have access to high quality options and, after listening to colleges and providers, we will be delaying any defunding of qualifications by a year so that there’s time for the new T Levels to grow to meet demand."
        },
        {
            "text": "We also hear that students are being put off taking a T Level because they are worried that they will fail it if they do not reach level 2 in English and maths. While English and maths will remain central to T Level programmes, we do not want to unnecessarily inhibit talented students from taking these great new qualifications, so we have announced today that you will not fail your T Level just because you couldn’t get to Level 2 in English and Maths."
        },
        {
            "text": "In addition, new powers will also be introduced so that when colleges are failing to deliver good outcomes for their students and communities, we can intervene quickly where needed to ensure colleges improve."
        },
        {
            "heading": 3,
            "text": "I don’t have time to go to college and study all day – can qualifications and training fit around me?"
        },
        {
            "text": "We want everyone to be able to the gain the skills they want, when they need them and in a way that works for them, so they can retrain or upskill and access well paid jobs."
        },
        {
            "text": "The Bill will support the introduction of a Lifelong Loan Entitlement from 2025 that will transform the current student loans system so that adults will be able to access a flexible loan entitlement to the equivalent of 4 years of student loans for higher-level study and training at university or college."
        },
        {
            "text": "With 80% of 2030’s workforce already in work, it’s important that people can retrain or boost their skills so we can keep up with the new jobs that emerge in future."
        },
        {
            "text": "The loans will open opportunities for more people to study across their lifetime, for full-time or part-time study, for modules or full qualifications, for high-quality technical qualifications and academic education."
        }
    ]
}