{
    "url": "https://taxagents.blog.gov.uk/2022/03/29/authorisation-to-discuss-seiss-grants-on-behalf-of-your-clients/",
    "title": "Authorisation to discuss Self Employment Income Support Scheme (SEISS) grants on behalf of your clients ",
    "authors": [
        "geoffgreensmith"
    ],
    "categories": [
        "News and Updates"
    ],
    "pub_date": "2022-03-29T12:38:20+00:00",
    "content": [
        {
            "text": "We may not be able to talk to you about your clients’ SEISS grants unless we receive additional consent from them. This is because our existing process – the 64-8 agent authorisation – was not designed to cover the support provided in response to coronavirus, such as SEISS grants, so the usual taxpayer confidentiality rules apply. We require this additional authorisation to safeguard our customer information. How you can give us your consent is explained in more detail below."
        },
        {
            "text": "Before a Self Assessment return is filed:"
        },
        {
            "text": "• SEISS grant information cannot be disclosed to an agent without specific consent from their client.\n• written consent is our preferred option, although we can record consent if your client calls us on 0300 200 3310.\n• written consent should include your client’s name, address, tax reference number (for example their Unique Taxpayer Reference (UTR)) and signature in addition to the name and address of the agent they wish to authorise."
        },
        {
            "text": "This should be posted to: National Insurance contributions and Employers Office, HM Revenue and Customs, BX9 1AN."
        },
        {
            "text": "After a Self Assessment return is filed:"
        },
        {
            "text": "• as an authorised agent, we can talk to you about anything that your client entered on their return.\n• we can discuss any boxes on a return that have no entry (for example where we know a SEISS grant was paid but the return does not include this).\n• where we have corrected a SEISS grant amount following a mismatch between the customer’s SEISS figure and the figure we hold, we can discuss this with you too."
        },
        {
            "text": "If you plan to contact us regarding your client’s SEISS grants, please speak to them and make sure relevant consent is in place where necessary and allow time for required authorisation to be processed by us."
        },
        {
            "text": "We appreciate this is additional workload for agents, your clients and HMRC, but ensuring the security of customer information remains a priority for us."
        }
    ]
}