{
    "url": "https://food.blog.gov.uk/2022/03/29/chairs-stakeholder-update-the-fsas-new-five-year-strategy/",
    "title": "Chair's stakeholder update - The FSA’s new five-year strategy",
    "authors": [
        "Professor Susan Jebb, FSA Chair"
    ],
    "categories": [
        "Our mission"
    ],
    "pub_date": "2022-03-29T13:09:25+01:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "Our Chair, Professor Susan Jebb, introduces Food You Can Trust – The FSA’s new five-year strategy. As well as reaffirming our commitment to ensuring that food is safe and what it says it is, we have expanded our mission to include a role in helping the food system become healthier and more sustainable."
        },
        {
            "text": " "
        },
        {
            "text": "We have now published the FSA’s new strategy and I was delighted to join FSA Chief Executive Emily Miles and our Chief Scientific Adviser Professor Robin May in outlining the five-year strategy to many partners and stakeholders at our recent virtual launch event."
        },
        {
            "text": "The new strategy reaffirms the FSA’s commitment to ensuring that food is safe and what it says it is. Our core mission of food you can trust remains highly relevant in this uncertain world and our commitment to protect consumers is as strong as ever."
        },
        {
            "text": "We have also expanded our mission to include a role in helping the food system become healthier and more sustainable. This recognises that a poor diet is a key determinant of chronic ill-health and the impact of food production on the sustainability of our planet. We know that these issues are important to people, and at a time of increased pressure on household budgets, we need to consider how we can support access to safe, healthy and sustainable food for everyone."
        },
        {
            "text": "As the only government department that deals entirely with food, we are well placed to work with the UK government and the governments in Wales and Northern Ireland on these consumer interests in relation to food."
        },
        {
            "text": "Our strategy commits us to use our scientific evidence, our established relationships across the food chain and our consumer voice to deliver food you can trust that’s good for health, in the short and long-term, and good for the planet."
        },
        {
            "text": "We know we cannot do this alone. We need to work with and through many others, including people working directly in the food chain, our partners in local authorities and people with specific food concerns."
        },
        {
            "text": "The discussion we had at our strategy launch event showed how much is already happening and the shared commitment of so many people and organisations to a safe, healthy and sustainable food system. I look forward to working with many of you in the coming years and I hope you will support and challenge us to play our part and live up to the mission we have set ourselves of food you can trust."
        },
        {
            "text": "If you were not able to join us, please do read our strategy, send us any questions you have, and tell us your thoughts on how we can work together to meet the pressing challenges that are facing the food system. Please let us know, by commenting below."
        },
        {
            "heading": 2,
            "text": "Diweddariad y Cadeirydd i randdeiliaid - Strategaeth pum mlynedd newydd yr Asiantaeth Safonau Bwyd "
        },
        {
            "text": "Rydym bellach wedi cyhoeddi strategaeth newydd yr Asiantaeth Safonau Bwyd (ASB), ac roedd yn bleser cael ymuno â Phrif Weithredwr yr ASB, Emily Miles, a’n Prif Gynghorydd Gwyddonol, yr Athro Robin May, i amlinellu’r strategaeth pum mlynedd i lawer ohonoch chi yn ein digwyddiad lansio rhithwir diweddar."
        },
        {
            "text": "Mae'r strategaeth newydd yn ailddatgan ymrwymiad yr ASB i sicrhau bod bwyd yn ddiogel ac yn cyd-fynd â'r hyn sydd ar y label. Mae ein cenhadaeth graidd, sef bwyd y gallwch ymddiried ynddo, yn parhau i fod yn hynod berthnasol yn y byd ansicr sydd ohoni, ac mae ein hymrwymiad i ddiogelu defnyddwyr mor gadarn ag erioed."
        },
        {
            "text": "Rydym hefyd wedi ehangu ein cenhadaeth i gynnwys helpu i wneud y system fwyd i yn iachusach ac yn fwy cynaliadwy. Mae hyn yn cydnabod bod deiet gwael yn benderfynydd allweddol o ran  afiechyd cronig, ac effaith cynhyrchu bwyd ar gynaliadwyedd ein planed. Gwyddom fod y materion hyn yn bwysig i bobl, ac ar adeg o bwysau cynyddol ar gyllidebau cartrefi, mae angen inni ystyried sut y gallwn ni gefnogi mynediad at fwyd diogel, iachus a chynaliadwy i bawb."
        },
        {
            "text": "Ni yw’r unig adran o’r llywodraeth sy’n ymdrin yn gyfan gwbl â bwyd, ac felly rydym ni mewn sefyllfa dda i weithio gyda llywodraeth y DU a llywodraethau Cymru a Gogledd Iwerddon ar y buddiannau defnyddwyr hyn mewn perthynas â bwyd. Mae ein strategaeth yn ein hymrwymo i ddefnyddio ein tystiolaeth wyddonol, y perthnasoedd sefydledig sydd gennym ar draws y gadwyn fwyd, a llais defnyddwyr i ddarparu bwyd y gallwch ymddiried ynddo sy'n llesol i iechyd, yn y tymor byr a'r hirdymor, ac yn llesol i'r blaned."
        },
        {
            "text": "Gwyddom na allwn ni wneud hyn ar ein pennau ein hunain. Mae angen inni weithio gyda nifer eraill, a thrwyddynt, gan gynnwys pobl sy’n gweithio’n uniongyrchol yn y gadwyn fwyd, ein partneriaid mewn awdurdodau lleol a phobl â phryderon bwyd penodol. Roedd y drafodaeth a gawsom yn ein digwyddiad i lansio’r strategaeth yn dangos cymaint sy’n digwydd eisoes a’r ymrwymiad a rennir gan gynifer o bobl a sefydliadau i system fwyd ddiogel, iachus a chynaliadwy. Edrychaf ymlaen at weithio gyda llawer ohonoch yn y blynyddoedd i ddod a gobeithio y byddwch yn ein cefnogi a'n herio i chwarae ein rhan a chyflawni'r genhadaeth yr ydym wedi'i gosod i'n hunain, sef bwyd y gallwch ymddiried ynddo."
        },
        {
            "text": "Os nad oeddech chi’n gallu ymuno â ni, byddwn yn eich annog i ddarllen ein strategaeth. Anfonwch unrhyw gwestiynau sydd gennych, a dywedwch wrthym sut y gallwn weithio gyda'n gilydd i fodloni’r heriau uniongyrchol sy'n wynebu'r system fwyd. Gadewch i ni wybod trwy adael sylwadau isod."
        }
    ]
}