{
    "url": "https://cyberandspecialistoperationscommand.blog.gov.uk/2022/03/29/cyber-insider-spending-time-on-the-digital-front-line/",
    "title": "Cyber Insider: Spending time on the digital front line",
    "authors": [
        "Conrad Beckett"
    ],
    "categories": [
        "Cyber",
        "Personnel",
        "Technology"
    ],
    "pub_date": "2022-03-29T15:46:52+01:00",
    "content": [
        {
            "heading": 4,
            "text": "In this edition of Cyber Insider we look at what life is like on the digital front line, and how extraordinary people are keeping the UK and our allies safe every single day."
        },
        {
            "text": "When we say ‘the front line’ what image comes to your mind? Maybe a WW1 style trench system – two sides locked in a seemingly endless conflict with neither side willing to give an inch?"
        },
        {
            "text": "Or perhaps a Vietnam War style scenario – surrounded by impenetrable jungle where any second an attacker could appear from nowhere."
        },
        {
            "text": "Or perhaps a modern counter insurgency conflict, where hostile forces blend in with ordinary people, planning to launch an opportunistic attack."
        },
        {
            "text": "The truth is that all those scenarios have merit when describing the digital front line. There are cyber trenches, where well-understood adversaries repeatedly attack us on the same front relentlessly. There is a kind of cyber jungle where hackers blend into the digital undergrowth and watch us, waiting to strike.  And there are also those who disguise themselves as the things or people we interact with every day – hiding in plain sight."
        },
        {
            "text": "The added complication to the digital front line is that it changes much faster than the real world.  Yes, war can change the landscape, but advantages (such as high ground and dead ground) tend to remain.  In the digital world new code can dramatically change the landscape, opening up new exploits or closing off ones that previously existed and all of this can happen very quickly."
        },
        {
            "text": "The defining feature of the digital world is that it’s all man-made, and therefore it conforms to the logic of the code it was written in.  Once you understand that logic then even complex new code can be exploited, and that’s where our cyber experts come in."
        },
        {
            "text": "Whether they are working to use those exploits to our advantage, or they are working to defend us against them, our cyber experts need to intimately understand the complex systems we all take for granted."
        },
        {
            "text": "The real-world picture of a cyber expert at work might seem quite uninspiring for an audience steeped in cinema interpretations of cyber security. Real work on the digital front line is hours upon hours of staring at computers and reviewing lines of code. It might be checking log files to find that unusual bit of data. It might be reviewing the architecture of a system to help understand how you can bypass the security or change the functions it performs. It might be writing your own programmes to perform all those functions for you far quicker than any human ever could."
        },
        {
            "text": "The digital front line isn’t glamorous, and it isn’t flashy, but it is incredibly important. Computer systems impact on almost every facet of modern life. Whether it’s a system that controls a power station, a water treatment plant, or financial services, actions taken in cyberspace don’t just affect cyberspace – they have a serious real-world impact."
        },
        {
            "text": "We can’t talk about the people who are fighting this battle in any real detail, because we must protect their identities. The nature of the job they do means that they’re high-value targets for hostile actors."
        },
        {
            "text": "Likewise, we can’t really talk about their methods – the problem with cyber exploits is that once they’re revealed they can normally be quickly be patched. Cyber attacks can often be a “one-shot” kind of capability, so these methods are amongst some of our most closely guarded secrets."
        },
        {
            "text": "But you do know someone that’s part of that digital front line. That person is you."
        },
        {
            "text": "We’re all part of the digital front line because we’re all potential targets for hackers.  The most common way to exploit a system is still to influence regular users. Why bother spending time bypassing a complex security system when you could just steal the details of someone with access or administrative privileges?"
        },
        {
            "text": "That’s why we all need to help the cyber experts by becoming more cyber aware and ensuring we’re not a ‘soft target’. The National Cyber Security Centre offer a short quiz you can take which will give you a personalised cyber action plan."
        }
    ]
}