{
    "url": "https://hmlandregistry.blog.gov.uk/2022/03/29/electronic-signatures-our-new-practice-guide-and-the-future/",
    "title": "Electronic signatures: our new practice guide and the future",
    "authors": [
        "Michael Abraham, Product Owner"
    ],
    "categories": [
        "Buying and selling property",
        "Digital services",
        "Law and practice"
    ],
    "pub_date": "2022-03-29T10:43:47+01:00",
    "content": [
        {
            "text": "In August last year I wrote about the role of electronic signatures during and after the pandemic, the increase in their usage and the potential of Qualified Electronic Signatures."
        },
        {
            "text": "I recently attended a webinar held by an electronic signature platform, where they presented some really interesting stats from customers they had interviewed."
        },
        {
            "text": "These figures, combined with our own, show an increasing number of applications lodged have been signed electronically. The appetite to adopt electronic signatures is there and growing. Many customers see the future in them, even after the pandemic. We are therefore keen to do what we can to improve and build on our work in 2020 and 2021 to facilitate the use of electronic signatures more widely within the conveyancing process, while also looking forward through 2022 and beyond."
        },
        {
            "text": "We were also really encouraged by the recently published findings of the Ministry of Justice’s (MoJ) industry working group investigations into electronic signatures, in which the group voices support for the wider use of electronic signatures and our approach in issuing practice and guidance on the acceptance of electronic signatures. The report also recognises the potential for Qualified Electronic Signatures when underpinned by an identity verification process as part of a Digital Identity Trust Framework, such as that currently under development by the Department for Digital, Culture, Media and Sport."
        },
        {
            "heading": 2,
            "text": "A new practice guide dedicated to electronic signatures"
        },
        {
            "text": "In response to customers’ feedback we provided further guidance on which electronic signatures could be used for which purposes, and how amendments could be made to electronically signed documents. Our legal and policy teams also listened to comments on the location and content of the existing guidance."
        },
        {
            "text": "We have now brought all of the guidance together and are excited to launch a new dedicated practice guide for electronic signatures of deeds and documents. We hope it will give clarity where required and provide further confidence to users who are new to electronic signatures."
        },
        {
            "text": "One of the key changes the guide introduces is a shift in terminology. ‘Witnessed Electronic Signatures’ has evolved as a term used to describe the step-by-step signing process previously outlined in practice guide 8 section 13. We now refer to these kinds of signatures as ‘Conveyancer-Certified Electronic Signatures’. We have developed this name in collaboration with a cross-section of our customers. They tell us it serves as a useful reminder of the requirement to lodge a conveyancer’s certificate confirming the step-by-step requirements have been met in the signing process."
        },
        {
            "text": "We also used this opportunity to review the steps within the signing process and hope the minor changes made offer further clarity for completing each step."
        },
        {
            "heading": 2,
            "text": "Trialling the use of Qualified Electronic Signatures"
        },
        {
            "text": "We believe the new practice will make the adoption and use of existing electronic signature options simpler, but we have also been working hard on understanding the future of electronic signatures."
        },
        {
            "text": "Last year, we began a pilot looking into the viability of Qualified Electronic Signatures (QES) and in September we registered our first deed signed using a QES. This kind of signature is not currently widely used in the UK and the pilot has indicated that developments are required in the marketplace to make them simpler and more cost effective. For example, the wider use of digital identification to verify the signatory replacing face-to-face identification via a video call."
        },
        {
            "text": "We are confident that this type of signature will be increasingly viable in the future. We continue to be encouraged by the opportunities presented by QES, particularly in terms of security, both for the signing of deeds and their potential as a single source of identity verification in the future."
        },
        {
            "text": "Our strategy hasn’t changed, and we are pleased to see the growing use of electronic signatures in the property sector. We will continue to improve on our existing practice, while also working with key stakeholders in the financial sector to encourage the use of electronic signatures."
        },
        {
            "text": "We will also extend our QES pilot to learn more about their viability while engaging with the technology providers to develop new practice that encourages their use and development in a fair market."
        },
        {
            "text": "We will bring you updates as the pilot develops and conditions in the marketplace make this a more viable option."
        },
        {
            "text": "In the meantime, please refer to our new, consolidated guidance on the use of electronic signatures."
        }
    ]
}