{
    "url": "https://educationhub.blog.gov.uk/2022/03/how-we-are-improving-the-lives-of-children-and-young-people-with-special-educational-needs-and-disabilities/",
    "title": "How we are improving the lives of children and young people with special educational needs and disabilities",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Families",
        "SEND"
    ],
    "pub_date": "2022-03-29T00:01:28+01:00",
    "content": [
        {
            "text": "We want all children to have the best opportunities in life, no matter their background."
        },
        {
            "text": "That’s why we have set out our vision for a SEND system that offers children and young people the opportunity to thrive, with access to the right support so they can fulfil their potential and lead happy, healthy, and fulfilling adult lives."
        },
        {
            "text": "Here we outline what these proposals mean and how it will improve support for children and young people with SEND across the country."
        },
        {
            "heading": 3,
            "text": "How are you planning to change SEND education and provision?"
        },
        {
            "text": "We know that, too often, children and young people with SEND, and those educated in alternative provision, feel unsupported and their outcomes fall behind those of their peers. As well as this, too many parents face difficulty and delay in accessing support for their child."
        },
        {
            "text": "We commissioned the SEND Review in 2019 to understand these challenges better and determine what it would take to establish a system that consistently delivers for children and young people with SEND."
        },
        {
            "text": "We have listened carefully to children, young people, and their families. We have listened to those working in education across early years, schools and further education; those working across health, care, local government; and the many voluntary and community sector organisations that support children and young people with SEND."
        },
        {
            "text": "As a result we have published a SEND and Alternative Provision Green Paper for public consultation and set out a vision for a more inclusive, consistent, transparent, and accountable system."
        },
        {
            "text": "Green Papers are consultation documents produced by the government. The aim of this document is to allow people both inside and outside Parliament to give the department feedback."
        },
        {
            "text": "Children, parents, and those working in the SEND system will be able to give their views on proposals designed to provide the right support, in the right place, at the right time."
        },
        {
            "heading": 3,
            "text": "How will these proposals make it easier for parents of children and young people with SEND?"
        },
        {
            "text": "The Green Paper sets out proposals to ensure that every child and young person has their needs quickly identified and met more consistently."
        },
        {
            "text": "By moving to a system like this, children and young people will have the best support available to them based on their needs, not by where they live."
        },
        {
            "text": "Our proposals respond to the need to restore families’ trust and confidence in an inclusive education system with excellent mainstream provision that puts children and young people first; and the need to create a system that is financially sustainable and built for long-term success. We know that there are places where this is already the case, and we want to make this a reality across the whole country."
        },
        {
            "text": "We are proposing to establish a single national SEND and alternative provision system."
        },
        {
            "text": "The new system will set clear standards for the provision that children and young people should expect to receive, and the processes that should be in place to access it, no matter what their need is or where they live – ending the current post code lottery."
        },
        {
            "heading": 3,
            "text": "What else are you proposing?"
        },
        {
            "text": "The Green Paper also includes additional proposals that will better support the system."
        },
        {
            "text": "These include important items such as a new legal requirement for councils to introduce ‘local inclusion plans’ that bring together early years, schools and post-16 education with health and care services."
        },
        {
            "text": "There are also plans for improved training, oversight and transparency through the publication of new ‘local inclusion dashboards’. These dashboards will help drive better outcomes as they will help to make roles and responsibilities of all partners within the system clearer for parents and young people."
        },
        {
            "text": "In addition, we will also work to change the culture in mainstream education so that it is more inclusive. This will help to better identify and support needs, including through earlier intervention and improved targeted support."
        },
        {
            "text": "We are also setting out our plans to improve alternative provision. Alternative provision helps children and young people, with and without SEND, who need extra support to engage with school or behave well."
        },
        {
            "heading": 3,
            "text": "Will you be backing these proposals with additional investment? "
        },
        {
            "text": "We have announced £1.4 billion of capital funding allocations for councils to pay for new places and improve existing provision for children and young people with SEND, or those who will benefit from high-quality alternative provision."
        },
        {
            "text": "The government will also look to approve 40 new special and alternative provision free schools in regions where they are most needed. This is in addition to over 60 special and alternative provision free schools already in the pipeline."
        },
        {
            "text": "Low-income families with seriously ill or disabled children will be further supported through investment of £27.3 million next year. This funding will help pay for equipment, goods or services - from washing machines and fridges to sensory and educational equipment that they might not otherwise be able to afford. "
        },
        {
            "heading": 3,
            "text": "How can I take part in the consultation?"
        },
        {
            "text": "We are keen for as many parents and families as possible to take part and get their views heard."
        },
        {
            "text": "You can read and take part in the consultation here."
        }
    ]
}