{
    "url": "https://ipo.blog.gov.uk/2022/03/29/levelling-up-how-were-helping-uk-businesses-to-build-through-ip/",
    "title": "Levelling Up: how we’re helping UK businesses to build through IP ",
    "authors": [
        "Tim Moss"
    ],
    "categories": [
        "Business",
        "Copyright",
        "Design",
        "Design right",
        "Innovation",
        "Levelling Up",
        "Patents",
        "Trade marks"
    ],
    "pub_date": "2022-03-29T11:36:58+01:00",
    "content": [
        {
            "text": "Did you know that intellectual property (IP) is likely to play a part in the foundation of every business, generating key assets to kickstart future success?"
        },
        {
            "text": " This might be when you protect your name or business logo, protect your designs and the technical ways in which your product works, or when you protect your original literary, musical or artistic creations. IP protection through patents, trade marks, designs and copyright can be instrumental in a business’ survival and growth."
        },
        {
            "heading": 3,
            "text": "The Levelling Up White Paper – some background "
        },
        {
            "text": "The government unveiled its Levelling Up White Paper in February this year. Its objective is to spread opportunities and boost economic growth across the UK. IP’s capacity to generate business growth is central to this, through enabling increased innovation, export power, and productivity."
        },
        {
            "text": "Levelling Up has been described as the Government’s defining mission. Its aim is to tackle geographical inequalities and improve standards of living for every place in the UK. The Levelling Up paper sets out an ambitious plan that touches on every element of public life. It shares a vision of achieving UK prosperity through levelling up our local economies and services."
        },
        {
            "heading": 4,
            "text": "Recognition for intangible assets "
        },
        {
            "text": "Intangible assets (innovation, ideas, patents) are one of the six key 'capitals' that form the economic basis for the Levelling Up White Paper. The capitals - physical, human, intangible, financial, social, and institutional – describe the necessary drivers that make up a successful region. From local leadership to health of the workforce, each capital works with one another to unlock future prosperity."
        },
        {
            "text": "These capitals point towards areas of focus for policy making, to guide our work in Government through considering how we can help increase levels of all six capitals across the UK. For intangible assets, this means that recognition and understanding of IP as an asset must be strong in every region so that all businesses have the same opportunity to innovate and grow."
        },
        {
            "heading": 4,
            "text": "Investing in areas as well as ideas "
        },
        {
            "text": "Many of the UK’s strengths are in sectors that require investment in ideas rather than machines. Society’s ability to turn these ideas into innovative products and services is critical to both business success and economic growth.  "
        },
        {
            "text": "According to ONS data, in 2016 the UK market sector invested an estimated £134.3bn in knowledge assets, of which £63.8bn was protected by IP rights, equating to 3.2% of total GDP.   "
        },
        {
            "text": "Ownership of IP rights is strongly associated with improved economic performance. Data from the European Patent Office shows SMEs with registered IP rights have 68% higher revenue than SMEs without. "
        },
        {
            "text": "The government has committed to providing financial packages to encourage innovation in every region. There are plans within the White Paper to increase public R&D investment outside of the South East to at least 40% and provide £100m funding for the three Innovation Accelerator areas of Manchester, Glasgow, and the West Midlands.  "
        },
        {
            "heading": 3,
            "text": "How the IPO is playing its part "
        },
        {
            "text": "Building on this, I’m proud to take this opportunity to highlight the work we are doing to encourage regional economic growth through IP. At the IPO, we are committed to delivering the ambitions of the Levelling Up agenda and our own ambitions to create a world leading IP environment. Over the last year, we have started work to move from a ‘places blind’ to a ‘places focused’ approach. This means appreciating the different strengths of each region in the UK and developing support that is tailored to each local innovation landscape."
        },
        {
            "heading": 4,
            "text": "Introducing our regional policy advisor support  "
        },
        {
            "text": "We are already supporting SMEs through our regional policy advisors based in Greater Manchester and the West Midlands - two of the three Innovation Accelerator regions. We also have an advisor in the West of England and are considering how we could expand this network to additional regions. IP advisors are a key component in the IPO’s contribution to Levelling Up. We are working with partners across the UK to raise the importance of IP, the value of it as an asset and its importance to regional and national economies. "
        },
        {
            "text": "Our regional policy advisors work with local innovation support providers and aim to develop IP capability amongst local innovation and enterprise organisations. The intention is to integrate IP into existing innovation support activities and develop new ones to support the development of small and medium enterprises. The IPO is committed to providing a range of tools to build IP knowledge amongst business advisors.  "
        },
        {
            "text": "Regional policy advisors also influence local policy makers and support the addition of IP into local policies to strengthen the region’s innovation ecosystem. Through embedding IP into the local business support agenda, our regional advisors help businesses to flourish and grow.  "
        },
        {
            "heading": 4,
            "text": "Supporting businesses everywhere - our successes to date "
        },
        {
            "text": "Since the regional policy advisors have been in post, we are delighted to say that IP has been integrated into existing business support advice, new regional programmes and included in policies for strengthening the regions’ innovation ecosystem. This has resulted in more businesses articulating and using their IP to grow and contribute to local and UK economy.  "
        },
        {
            "heading": 4,
            "text": "Did you know?"
        },
        {
            "text": "Place-based interventions like this help to deliver the Levelling Up agenda through capitalising on the UK’s regional strengths and targeting our support in areas where it will have the greatest impacts."
        },
        {
            "text": "We are also supporting the education sector by increasing IP awareness across all ages and skill levels throughout the UK. We will continue using this approach to stay connected with local economies and their individual needs, to ensure our work is focused on facilitating the creativity of British business."
        },
        {
            "heading": 3,
            "text": "Resources - how we can help"
        },
        {
            "text": "For those unfamiliar with IP, our advisers can work with businesses to deliver relevant training, provide guidance on their IP management and support improvements to their use of IP as an asset."
        },
        {
            "text": "Now more than ever, the UK is being looked to as a global leader within the innovation sphere. The IPO is dedicated to supporting this rich organic ingenuity and seizing the opportunities that come with this, working with our colleagues across Government to support the Levelling Up agenda."
        },
        {
            "heading": 3,
            "text": "Get in touch"
        },
        {
            "text": "Looking for IP support for your business? Why not get in touch with your regional growth hub?"
        },
        {
            "text": "Greater Birmingham and Solihull\nGreater Manchester\nWest of England "
        },
        {
            "text": "Read more about the Levelling Up White Paper via this link."
        },
        {
            "heading": 3,
            "text": "You may be interested in some further reading:"
        },
        {
            "text": "2021_IP_Rights_and_firm_performance_in_the_EU_en.pdf (europa.eu) "
        },
        {
            "text": "Developing experimental estimates of investment in intangible assets in the UK - Office for National Statistics (ons.gov.uk) "
        }
    ]
}