{
    "url": "https://dwpdigital.blog.gov.uk/2022/03/29/meet-the-engineer-chloe/",
    "title": "Meet the engineer: Chloe",
    "authors": [
        "Chloe Williams - software engineer, DWP Digital"
    ],
    "categories": [
        "DWP Digital",
        "Software Engineering",
        "Women in Digital"
    ],
    "pub_date": "2022-03-29T11:23:29+01:00",
    "content": [
        {
            "heading": 2,
            "text": "Tell us a little bit about your role "
        },
        {
            "text": "My role involves creating new features for services under the ‘Helping people find work’ portfolio, as well as maintaining existing features so DWP work coaches can do their job effectively.   "
        },
        {
            "heading": 2,
            "text": "How long have you been working at DWP Digital and what roles have you done? "
        },
        {
            "text": "I’ve been at DWP Digital for just over a year, and since joining I’ve been part of the team responsible for delivering the Restart Scheme, which gives Universal Credit claimants who have been out of work for at least 9 months enhanced support to find jobs in their local area. "
        },
        {
            "text": "The scheme launched last June but that didn’t mean our work was done. We continuously get feedback from stakeholders and are striving to deliver improvements all the time.   "
        },
        {
            "heading": 2,
            "text": "What tech do you use? "
        },
        {
            "text": "Most of the code I write is Java, however we have a few applications that are written using Node. There’s a long list of tech we use across the department, such as MongoDB, Docker and Kafka. It definitely keeps us on our toes! "
        },
        {
            "heading": 2,
            "text": "What do you like most about your job? "
        },
        {
            "text": "As a software engineer I get to build things that add value to the end user. I like the satisfaction of seeing a feature I’ve worked on out there in the ‘wild’. Sometimes you get positive feedback, other times it’s negative but that’s the whole point of agile working; you’re constantly iterating to try and deliver improvements. And when it pays off, it’s a nice feeling.  "
        },
        {
            "heading": 2,
            "text": "What’s the best thing about DWP Digital? "
        },
        {
            "text": "I get to be part of a huge digital transformation – one of the biggest in Europe. It’s rewarding knowing that even the small part I play can make a difference to a Universal Credit claimant or work coach.  "
        },
        {
            "heading": 2,
            "text": "What are your career goals for the next few years? "
        },
        {
            "text": "I’m a still a tech newbie so I’d really like to keep honing my software engineer skills and learning as much as possible about the different aspects of software development.  "
        },
        {
            "heading": 2,
            "text": "What do you enjoy doing in your spare time? "
        },
        {
            "text": "At the weekend I play hockey and go on long walks or cycles in the countryside. This is usually followed by a trip to the pub for a couple of well-deserved drinks.  "
        }
    ]
}