{
    "url": "https://civilservice.blog.gov.uk/2022/03/29/neurodiversity-celebration-week-supporting-colleagues/",
    "title": "Neurodiversity Celebration Week: supporting colleagues",
    "authors": [
        "Abigail Agyei"
    ],
    "categories": [
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Ambitious Civil Service",
        "An Innovative Civil Service",
        "Uncategorized"
    ],
    "pub_date": "2022-03-29T10:59:26+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Abigail Agyei, a civil servant in the Department of Health and Social Care, shares her experiences with ADHD and dyspraxia, and explains how we can all support colleagues with neuro-differences."
        },
        {
            "text": "Last week (21 to 27 March) was Neurodiversity Celebration Week: a worldwide initiative that challenges the stereotypes and misconceptions about neurological differences and creates a balanced view which focuses equally on people’s talents and strengths."
        },
        {
            "text": "The term ‘neurodiversity’ was coined in the late 1990s to describe brain   differences in areas such as attention, learning and sociability - which are normal, rather than weaknesses. Neurodiversity commonly refers to people with autism spectrum disorder, ADHD, dyslexia, dyspraxia and other learning disabilities. Current estimates suggest that around one in seven of us in the UK is neurodivergent."
        },
        {
            "text": "Neuro-differences can often be stigmatised, invisible, or masked. When we look at how neurodiversity interacts with social, cultural and political identities, then we find there can be even more significant obstacles to success."
        },
        {
            "heading": 4,
            "text": "My journey           "
        },
        {
            "text": "I was formally diagnosed with dyspraxia at university and only received my official diagnosis for ADHD in the last six months. I’ve always been hardworking, creative and passionate but spent a lifetime feeling chronically overwhelmed, struggling with structure, feeling my mind was on constant overload, and worrying that I wasn’t reaching my full potential. After a year-long NHS process, I eventually got my ADHD diagnosis."
        },
        {
            "heading": 4,
            "text": "Anger and shame"
        },
        {
            "text": "On one hand, this left me feeling liberated – but feelings also surfaced of anger, shame and resentment over how long it had taken for this to be recognised."
        },
        {
            "text": "Figures show that men are three times more likely than women to be diagnosed with ADHD; many Black women only receive their diagnosis much later in life - if they do get a diagnosis. Similar figures between men and women are shown for other neuro-differences too."
        },
        {
            "text": "The current system is largely reliant on women with ADHD understanding their own traits and seeking a diagnosis. The problem is that the existing diagnostic criteria – the traits you need to identify – is still based on research that is biased towards boys and men. Yet girls and women don’t always conform to that clinical picture and are often socialised to assimilate, and are likely to develop coping mechanisms which help mask the disorder.      "
        },
        {
            "heading": 4,
            "text": "Societal pressures"
        },
        {
            "text": "When we look further at intersectionality, for Black women, inaccurate cultural beliefs and lack of cultural sensitivity from some practitioners in understanding their nuanced experiences, along with unrealistic societal pressures often placed on Black women to appear to “have it together”, can also add to a lack of diagnosis and awareness with these neuro-differences. This is why it is important we have more conversations to create neuro-inclusive organisations."
        },
        {
            "heading": 4,
            "text": "Supporting neurodiverse colleagues           "
        },
        {
            "text": "One of my biggest weaknesses has often been asking for help. I struggle in silence to do things that many others may find simple. Even after my diagnosis, I’m still having to reframe my thinking and remind myself of the many strengths my neuro-differences add to my work – such as my strong sense of fairness, empathy and emotional intelligence."
        },
        {
            "heading": 4,
            "text": "How to help"
        },
        {
            "text": "I am grateful I have a supportive manager. In A Modern Civil Service, we should recognise that many neurodiverse civil servants interact and interpret the world in unique ways. Whilst it can sometimes bring challenges, it can also lead to creative problem solving and new ideas that can benefit everyone - and the citizens we all serve. If you are working with a colleague who needs additional support, here are some suggestions of how you can help them:"
        },
        {
            "heading": 4,
            "text": "Research"
        },
        {
            "text": "Do your own research on anything a colleague discloses – let them know you’re learning and you can learn together if they’re still early in their diagnosis or understanding. Remember everybody’s experience is different. Check out the Civil Service Dyslexia and Dyspraxia Network toolkit for staff and their line managers."
        },
        {
            "heading": 4,
            "text": "Be discreet    "
        },
        {
            "text": "As a manager, it’s important to respect confidentiality. Don’t disclose anything with anyone else unless it has been agreed with the colleague."
        },
        {
            "text": "Remind your colleague that any reasonable adjustment they get in the workplace is not special treatment – it’s there to support them to work to the best of their ability."
        },
        {
            "heading": 4,
            "text": "Unique strengths"
        },
        {
            "text": "Let’s change the narrative! If you’re neurodiverse, take some time to recognise the unique strengths you bring to the Civil Service, and embrace and value your differences.    "
        },
        {
            "heading": 4,
            "text": "Find out more"
        },
        {
            "text": "For more information, contact the Civil Service Neurodiversity Network, Civil Service Dyslexia and Dyspraxia Network and Civil Service Disability Network.   "
        }
    ]
}