{
    "url": "https://rpc.blog.gov.uk/2022/03/29/rpc-gives-evidence-to-the-international-trade-committee/",
    "title": "RPC gives evidence to the International Trade Committee",
    "authors": [
        "Stephen Gibson"
    ],
    "categories": [
        "Better regulation",
        "Independent scrutiny"
    ],
    "pub_date": "2022-03-29T13:01:03+01:00",
    "content": [
        {
            "text": "Stephen Gibson (Chair of the RPC) and Jonathan Cave (Member of the RPC) gave evidence to the International Trade Committee (ITC) alongside Richard Price, Chief Economist at the Department for International Trade (DIT) and Tammy Holmes, Deputy Director at DIT. They were asked about the RPC’s reviews of the UK-Australia and UK-New Zealand Free Trade Agreement Impact Assessments (FTA IAs)."
        },
        {
            "text": "Stephen explained the role of the RPC to the committee and how, in September 2020, the Rt Hon Elizabeth Truss MP (who was at the time Secretary of State for International Trade) had asked if the RPC could extend its role to provide external independent scrutiny of new trade deal final impact assessments (IA)."
        },
        {
            "text": "He explained that the RPC had worked with DIT and the Better Regulation Executive (BRE) to develop a checklist of 20 categories of analytical focus that we use as the basis for rating FTA IAs, including:"
        },
        {
            "text": "Stephen explained that as well as the Australian and New Zealand FTA IAs, we have also reviewed the UK-Japan FTA IA and that all three FTA IAs were rated fit for purpose – although we did have some initial concerns about the Australian FTA IA. These concerns were subsequently addressed by the department, so that we were happy to rate the final Australian FTA IA as fit for purpose. Our opinions on the FTA IAs are published transparently on our website."
        },
        {
            "text": "When asked about our concerns about the Australia FTA IA, Stephen explained that there were three main issues that we had identified:"
        },
        {
            "text": "The Department took on board our concerns and amended the IA accordingly, resulting in a fit for purpose rating."
        },
        {
            "text": "The committee asked Jonathan Cave to expand on these points; he explained that our ratings of these IAs are not the same as those for domestic regulation IAs because they are ‘fit’ for different purposes. Domestic IAs are intended to inform regulatory decision-making whereas FTA IAs seek to provide a sense of thinking behind negotiations and the potential impacts of the agreement. Because trade deals are complex with many assumptions, it is quite easy either to overwhelm the reader with too much detail or to present an over- simplified picture. We scrutinise these IAs to ensure a balanced picture presenting both benefits and costs of the trade deal objectively and in a way that clarifies the strengths and weaknessses of the evidence and models used."
        },
        {
            "text": "Richard Price described the RPC’s contribution as a ‘really important part of the process’ and ‘genuinely improve what we do’."
        },
        {
            "text": "A recording of the session is available to view on-demand at Parliamentlive.tv - International Trade Committee. (Our contributions begin at 10:37 in the video)."
        },
        {
            "text": "A transcript will be published on the Committee’s website soon at: https://committees.parliament.uk/work/1732/uk-trade-negotiations-agreement-with-australia/publications/."
        },
        {
            "text": "We look forward to working with the department on future free trade agreement IAs."
        },
        {
            "text": " "
        }
    ]
}