{
    "url": "https://teaching.blog.gov.uk/2022/03/29/supporting-students-with-send-transition-into-higher-education/",
    "title": "Supporting students with SEND transition into higher education",
    "authors": [
        "Leila Morne"
    ],
    "categories": [
        "SEND"
    ],
    "pub_date": "2022-03-29T09:02:06+01:00",
    "content": [
        {
            "text": "Leila Morne is an Advanced Autism Practitioner and Lecturer in Autism at Weston College. Leila plays a key role in Weston College’s Centre for Excellence in special educational needs and disabilities (SEND) and explains how the college is supporting students with autism to transition into higher education. "
        },
        {
            "text": "The number of university students with autism is increasing every year, but we know some autistic students find aspects of the university experience challenging."
        },
        {
            "text": "Not only can this have a negative impact on individual students, their studies and their quality of life, but also on wider society and the contributions of this type of neurodiversity. The world needs different types of thinkers!"
        },
        {
            "text": "Our programme therefore aims to prepare them for a successful transition, as there is more support that is needed beyond the academic preparation needed to secure a place in higher education."
        },
        {
            "heading": 2,
            "text": "A smoother transition"
        },
        {
            "text": "Leaving home, family and all that is familiar and safe can be daunting for most young people. However, for individuals on the autism spectrum, university entrance may seem like an impossible dream or a predictable nightmare."
        },
        {
            "text": "At Weston College, we acknowledge that excellence in academia will not automatically mean success at university for students with autism. They may not even feel confident enough to apply in the first place."
        },
        {
            "text": "The difficulties associated with an autism diagnosis can mean that accepting a place at university is often a highly anxious journey into the unknown. An effective means of reducing anxiety and ensuring success is through experiential learning."
        },
        {
            "text": "An autism specific ‘dual curriculum’ can help students to gain the necessary skills and understanding for meaningful participation in university life."
        },
        {
            "heading": 2,
            "text": "Immersive learning experiences"
        },
        {
            "text": "The college has developed and invested in a new initiative that focuses on preparing learners with autism to successfully progress into higher education (HE). We provide an immersive experience where students can live in a HE halls of residence, alongside HE learners, as a transitional year."
        },
        {
            "text": "Students engage in exciting opportunities to gain relevant, age appropriate, real-life experiences which stretch and challenge them. They are encouraged to develop the independence, social and communication skills needed."
        },
        {
            "text": "The programme is largely experiential with students learning new skills by ‘doing’ tasks rather than listening to someone telling them how to do a task. Some of these include:"
        },
        {
            "heading": 2,
            "text": "Individualised programmes"
        },
        {
            "text": "We make sure that programmes are tailored to the individual student’s needs - many involve new experiences and unfamiliar environments. Ensuring our staff have access to high quality training and SEND practices is so important in order to deliver tailored support programmes for our students. We support and provide staff with opportunities to gain relevant qualifications ranging from Level 2 to Masters Level. All Specialist Practitioners hold a relevant degree in their chosen specialism."
        },
        {
            "text": "In most cases, these experiences are supported by young people trained as peer mentors by highly qualified Specialist Autism Practitioners. These experiences can include a range of different things from going out in the evening to pubs or clubs, joining sports’ clubs or gyms and accessing local community facilities. Students who find it challenging to cope with the social aspects of university life, are facilitated in doing so."
        },
        {
            "text": "It is so important that these skills are taught to ensure successful transition to university, future employment and that individual aspirations are achieved. As I’ve seen for myself from our students, the results can be absolutely life changing!"
        }
    ]
}