{
    "url": "https://services.blog.gov.uk/2022/03/29/what-its-like-to-work-as-a-designer-in-a-transformation-programme/",
    "title": "What it’s like to work as a designer in a transformation programme",
    "authors": [
        "Kuba Bartwicki – Lead designer, GDS (formerly Designer at Homes England)"
    ],
    "categories": [
        "Service design",
        "Service transformation"
    ],
    "pub_date": "2022-03-29T11:52:26+01:00",
    "content": [
        {
            "text": "If what makes words good is people agreeing on their meaning, then transformation is not a very good word, is it? Transformation means many different things to different people, and if you work in government, you hear it spoken about a lot. What most organisations mean by transformation is changing how they work to make better use of the opportunities afforded by digital."
        },
        {
            "text": "How this is done depends on the organisation, but it usually includes making services simpler to use and cheaper to run. Transformations in government tend to exist as programmes of work spanning a few years, and they mean a lot of change for everyone involved."
        },
        {
            "text": "The transformation I was part of in Homes England was often described as a ‘user-centred transformation’. This means that improving our users’ experience of working with us was central to it. The purpose of Homes England is to make the housing market work better for people by making it easier for people to buy a new build home or for developers to develop affordable housing, and our users included actors across the entire housing sector. So, I want to share a few things that I picked up in the two years I worked there."
        },
        {
            "heading": 2,
            "text": "It teaches you a lot about what your role actually is"
        },
        {
            "text": "People will probably agree with you in mature design organisations if you say ‘user needs are important’. In organisations new to a user-centred design approach, you need to ditch the lingo and assume no prior knowledge. "
        },
        {
            "text": "This is a good thing! It forces you to understand what your job actually is and why it’s crucial. You should refer to your work in terms of the value it’s adding, like ‘reducing the risk of building the wrong thing’ or ‘making sure people use the thing we’re making’. This makes a massive difference in people’s willingness to take your suggestions on board and makes you a better practitioner. "
        },
        {
            "text": "Few questions are less helpful than asking a colleague who is new to design about a user need for their service. More often than not, people have a good understanding of a problem their work is trying to solve, and it’s our job to help build their understanding rather than try to catch them out."
        },
        {
            "heading": 2,
            "text": "Don’t be a digital colonialist"
        },
        {
            "text": "People who have worked at an organisation for a decade and delivered countless services within it probably know more about what change should look like than recently hired digital specialists. You’re not there to “take people along on the journey”, because that would imply that you know the destination. You don’t, even if your business case says otherwise. The ‘I know best’ mentality among new joiners often leads to internal staff resenting transformation programmes."
        },
        {
            "text": "Designers working in transformation programmes need to be humble and pragmatic and see themselves more as facilitators than disruptors. Staff engagement is critical and co-designing change with colleagues most affected by it is crucial if you want your work to stick. You are unlikely to be a subject matter expert (yet!), so consider how you can include those that are in the design process."
        },
        {
            "heading": 2,
            "text": "It’s all about the people which means that it’s hard and slow"
        },
        {
            "text": "Working as part of a transformation programme, you will need to find opportunities for your skills in unusual places. Beyond an obsession with architecture, it’s why I went to work for Homes England: housing is an incredibly complex system with decades-long feedback loops. It takes a long time to see the effect of your interventions and in comparison to other industries, it’s uncharted territory for service design."
        },
        {
            "text": "You will have to understand ways of looking at the world, which are totally different from your own. You’re going to have to compromise and find joy in the little things. It will feel like going back to basics, and it means that skills like relationship management matter more than your ability to plan and facilitate a fantastic workshop every once in a while. It’s about taking 1000 small actions, rather than 10 big ones."
        },
        {
            "text": "This is slow work, and the way you measure success is different from how you would do it in a mature digital organisation. Find your leading indicators, such as a stakeholder talking about their funding stream as a service, and accept that it’s likely to take a while before it’s redesigned and users love it."
        },
        {
            "heading": 2,
            "text": "The success of your transformation depends on so many things, and most of them are outside of your control"
        },
        {
            "text": "Humans have a tendency to attribute fault to people and their personalities. In organisations, blame tends to be apportioned up the org chart. This is often right but is just as often unhelpful. When working on a transformation, consider things like political and organisational appetites for change: is the CEO on board? Is everyone going in the same direction? Does the organisation actually want it? Does it help meet any of our priority policies? These things can make or break your transformation and have very little to do with your individual performance. Transformations are complex, and grasping as much of their context as you can is key to staying sane and to recognising what’s feasible."
        },
        {
            "heading": 2,
            "text": "It can make for a very fulfilling job"
        },
        {
            "text": "I sincerely believe that public services are going to get better with time. User-centred practitioners all across government play a huge role in ensuring as much. Doing so in a transformation programme can put you at the cutting edge of our disciplines: trying to apply them in new, exciting contexts, which are full of opportunities."
        },
        {
            "text": "It isn’t going to look exactly how you imagined it. Transforming government organisations takes years or decades and sometimes many separate attempts. You might be planting the seeds for future change, and if you’re anything like me, you will find that very enjoyable."
        }
    ]
}