{
    "url": "https://defencedigital.blog.gov.uk/2024/01/08/content-toolkit/",
    "title": "Introducing a Content Toolkit for Defence",
    "authors": [
        "M.O'Donoghue.",
        "A. Fielding",
        "J. Szymanski"
    ],
    "categories": [
        "Design Thinking"
    ],
    "pub_date": "2024-01-08T13:13:09+00:00",
    "content": [
        {
            "text": "We have teams creating great content for their users. How can we share their ways of working across Defence?"
        },
        {
            "text": "The content toolkit is a collection of tools for you to create and manage user-centred content. It will help people find your content and rely on it to make better decisions."
        },
        {
            "heading": 2,
            "text": "Where you’ll find the toolkit"
        },
        {
            "text": "We’ve published the first version of the content toolkit in the Defence Service Manual. It includes:"
        },
        {
            "heading": 2,
            "text": "Check out the publishing process"
        },
        {
            "text": "The publishing process helps you create and manage great content — from identifying a need to archiving or deleting content."
        },
        {
            "text": "Using the step-by-step publishing process in the content toolkit, you can:"
        },
        {
            "heading": 2,
            "text": "Find out how to audit your content"
        },
        {
            "text": "A content audit is a way to understand how much content you have, the quality of your content and its value to Defence."
        },
        {
            "text": "Many teams do not know where to start with a content audit."
        },
        {
            "text": "Using the audit templates in the content toolkit, you can:"
        },
        {
            "heading": 2,
            "text": "How we build content tools"
        },
        {
            "text": "Content and Transaction Services (CTS) works on ways to get the right information to the right people – wherever and whenever they need it. The content toolkit is part of this vision."
        },
        {
            "text": "To build new tools, we spend time with people who publish and manage content in Defence. Their challenges and approaches help us shape things that you can reuse."
        },
        {
            "text": "Before publishing new tools, we ask a few teams to test them. Here are some of the things they have told us:"
        },
        {
            "text": "“It is helpful for us to think: do we need this content?”"
        },
        {
            "text": "“It's great to have a thorough system through which we can consistently push all of our content. This way nothing is overlooked and the user needs are always put front and centre!”"
        },
        {
            "text": "“I like having your template - an actual place to put down information, rather than jotting down notes.”"
        },
        {
            "text": "“These tools are easy to use and put user needs at the heart of content publishing. I spent some time working with the content audit tool and it helped me to understand the content. With it I was able to evaluate and plan what I needed to do.”"
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Making improvements and new tools"
        },
        {
            "text": "We’re always learning how teams use the tools so we can improve them. Remember to give us your feedback."
        },
        {
            "text": "You’ll find more tools in the content toolkit soon, for example a checklist for writing good content and ways to measure quality."
        },
        {
            "heading": 2,
            "text": "Get in touch"
        },
        {
            "text": "We’re working with many content teams across Defence. If we have not spoken to you yet, please get in touch."
        },
        {
            "text": "There is more content guidance in the Defence Service Manual."
        },
        {
            "text": "If you work in Defence, you can also join the content community."
        },
        {
            "heading": 2,
            "text": "Defence Digital Foundry"
        },
        {
            "text": "We work in the Defence Digital Foundry which provides user-facing digital services, plus enabling tools and platforms to help digital teams across Defence deliver better and faster."
        },
        {
            "text": "Its mission is to provide strategic advantage and capability for Defence through rapid and effective software delivery."
        },
        {
            "text": "Blog posts in this series"
        },
        {
            "text": "Definitive guidance for digital services 23 March 2023\nMaking the MOD an information-driven organisation 6 March 2023"
        }
    ]
}