{
    "url": "https://insidedio.blog.gov.uk/2024/01/08/dio-staff-recognised-with-honours/",
    "title": "DIO staff recognised with honours",
    "authors": [
        "DIO Communications Team"
    ],
    "categories": [
        "Cyprus",
        "Falkland Islands",
        "MOD Guard Service",
        "Working at DIO"
    ],
    "pub_date": "2024-01-08T16:40:25+00:00",
    "content": [
        {
            "text": "Congratulations to the DIO staff who have recently been recognised with honours for their work!  "
        },
        {
            "text": "Leading the way was Tom Meadows, Deputy Head of Security Services Group (SSG) and Technical Director, who was awarded an OBE in the New Year’s Honours List for his services to Defence. SSG is DIO’s team of experts which provides and maintains security systems for MOD sites, and from time to time, other important buildings. For example, they installed a security system at Westminster Hall for HM The Queen’s lying in state.  "
        },
        {
            "text": "Tom joined SSG as an apprentice electrical fitter all the way back in 1974 and has risen through the ranks in the years since, receiving his OBE in his 50th year of service. He had to keep the honour a secret between finding out in November and the end of the embargo on 29th December, when the details were made public. Happily, he was able to suprise his family with the unexpected news during a Christmas get-together.  "
        },
        {
            "heading": 2,
            "text": "Vice Chief of the Defence Staff Commendations "
        },
        {
            "text": "Twice a year alongside the honours list, the MOD publishes the Vice Chief of the Defence (VCDS) Commendations. These are awarded to service personnel, MOD staff and contractors who have provided exemplary service to the MOD.  "
        },
        {
            "text": "DIO and Sodexo’s Soft Facilities Management team in Cyprus was included in the list in recognition of their sterling work supporting Op POLAR BEAR. This was the evacuation of over 2400 UK nationals from Sudan to MOD bases in Cyprus in April and May last year. The team worked tirelessly to support the increase in military personnel and the civilians they evacuated. This included providing over 100,000 additional meals, and ensuring the availability of products such as sanitary towels and shower gel. Due to the nature of the evacuation, much of this was, by necessity, at extremely short notice and required hard work and dedication from all of the DIO and Sodexo personnel involved.  "
        },
        {
            "text": " "
        },
        {
            "text": "Ministry of Defence Guard Service (MGS) Operational Manager, Graham Kerridge, also received a VCDS Commendation. He was recognised for his and his great team’s work at RAF Lakenheath in Suffolk, used by the United States Air Force. After a couple of calls to make sure he wasn't being pranked, Graham was quick to credit his team, which also won the DIO Customer Excellence Award last year. "
        },
        {
            "text": "Congratulations are also due to Christina Williams, who is Sodexo’s Deputy Service Manager for the Falkland Islands. She has worked with Sodexo since 1995 and her commendation recognised the entirety of that time, but with a focus on a few particular acts of service. In 2015, Christina led the Sodexo team in supporting the evacuation of nearly 250 people from a cruise ship near the Falkland Islands. The team ensured sufficient accommodation was clean and available for use, arranged meals and phone lines, and Christina co-ordinated the provision of clothing donated by colleagues. During the Covid pandemic, Christina worked to ensure sufficient cleaning supplies were available despite a logistic chain made fragile by the challenges of the pandemic, as well as leading her team to make sure high standards of cleaning were maintained, helping to prevent infection and ensuring flights could continue to operate.  "
        },
        {
            "heading": 2,
            "text": "Air Officer Commanding Commendations"
        },
        {
            "text": "As well as the VCDS Commendations, a number of DIO staff from our South East Region were honoured with an Air Officer Commanding Commendation."
        },
        {
            "text": "Scott Tizzard and Stuart Dent were recognised as part of the RAF Vampire Block Operations Support Team, ensuring this operational building is well-maintained. Jon Lisle, our Airside Senior Facilities Manager for RAF Brize Norton, was also commended. His award was particularly in recognition of his role supporting works on the airfield operating surfaces. Finally, the Sodexo In Flight Catering team, also at RAF Brize Norton, received a commendation after a busy year where they supported Op POLAR BEAR and the training of Ukrainian troops."
        },
        {
            "text": "Congratulations and thank you to all! "
        }
    ]
}