{
    "url": "https://insidegovuk.blog.gov.uk/2024/01/08/in-numbers-how-people-used-gov-uk-in-2023/",
    "title": "In numbers: How people used GOV.UK in 2023",
    "authors": [
        "Paul Cronk, senior performance analyst, GOV.UK"
    ],
    "categories": [
        "Content",
        "Data",
        "User insights"
    ],
    "pub_date": "2024-01-08T15:08:01+00:00",
    "content": [
        {
            "text": "GOV.UK is at the centre of life in the United Kingdom. Millions of people visit us on a daily basis to do everything from tax a vehicle to apply for a passport."
        },
        {
            "text": "But every month there are moments when page views around a particular topic increase markedly. These can be driven by a variety of factors, including sudden events, historic milestones and government announcements. GOV.UK’s Data Insights team monitors these trends using tools such as Google Analytics, feedback and email subscription lists. This data, collected with a user’s consent, gives us crucial guidance about what our users are looking for and how we can develop GOV.UK to continue to meet their needs in future."
        },
        {
            "text": "In 2023 there were peaks around travel advice triggered by natural disasters, a new way of alerting the public to emergencies, the Coronation of His Majesty King Charles III and more. This post gives a month-by-month rundown of some of the biggest surges in traffic GOV.UK saw throughout the year and the reasons behind them."
        },
        {
            "heading": 2,
            "text": "January"
        },
        {
            "text": "The 31 January Self Assessment deadline is the best known and most reliable seasonal peak of traffic on GOV.UK. Annual patterns are similar, with traffic increasing as the deadline nears. The total number of visits to Self Assessment content in January 2023 reached 11.3 million - 13% up on 2022. In addition, searches for ‘self assessment’ rose by 190% compared with December."
        },
        {
            "heading": 2,
            "text": "February"
        },
        {
            "text": "Traffic to travel advice pages always reacts quickly to disturbances and natural disasters. This happened for the Turkey-Syria earthquakes on 6 and 20 February. The Foreign, Commonwealth and Development Office’s travel advice was the most popular page with 92,000 visits, while advice on how to make charity donations safely was the second most-viewed with 24,000 visits."
        },
        {
            "heading": 2,
            "text": "March"
        },
        {
            "text": "Visits to GOV.UK always surge around the Budget, with this year’s - taking place on 15 March - seeing traffic peaks exceeding figures for all previous Budgets. There were 528,000 visits to Budget content, with traffic being highly focused over 3 days. Queries using GOV.UK’s own search function on 15 March were also dominated by Budget terms and the key themes. Several less familiar acronyms surfaced in our list of new search terms as people looked them up - these included OOTLAR (overview of tax legislation and rates), LTA (lifetime allowance), MPAA (money purchase annual allowance) and CCUS (carbon capture, usage and storage)."
        },
        {
            "heading": 2,
            "text": "April"
        },
        {
            "text": "The national test of the Emergency Alerts Service took place at 3pm on Sunday 23 April amid much media attention. This followed local tests in 2021, with a message being sent out referring people to the alerts page on GOV.UK. Server logs recorded over 2 million hits on the alerts pages between 2pm and 7pm, and there were over 7,300 responses over 2 days to a survey on the alerts pages."
        },
        {
            "heading": 2,
            "text": "May"
        },
        {
            "text": "The popularity of Coronation content rose in May when Their Majesties King Charles III and Queen Camilla were crowned at Westminster Abbey. There were 330,000 visits to Coronation pages on GOV.UK, up from 143,000 in April, and interaction with content peaked the day before the Coronation. On this day the Coronation Medal received the most attention, accounting for 77% of the total page views. And during the ceremony itself, an overwhelming 99% of visits to Coronation pages used mobile devices."
        },
        {
            "heading": 2,
            "text": "June"
        },
        {
            "text": "Financial help for households drove traffic to GOV.UK in June when a £150 Cost of Living payment for qualifying disabled people began to be issued. The initiative was covered by the BBC and local media, leading to peak traffic to the Department for Work and Pensions’ press release about the payment which was published in May."
        },
        {
            "heading": 2,
            "text": "July"
        },
        {
            "text": "This month the chief traffic trend was P800 tax letters, sent out each year from mid-June onwards to tell people whether they have paid too much or too little tax. These letters encourage users to visit a short URL - gov.uk/p800refund - which redirects the user and includes a tracking code. By July there had been 1.17 million arrivals on GOV.UK using that short URL."
        },
        {
            "heading": 2,
            "text": "August"
        },
        {
            "text": "In August we noticed an increase in visits to content about EU Settled Status, which allows people to live, work and study in the UK indefinitely. Traffic levels reached 140,000 visits a week, the highest levels since November 2021. The increase is likely to be associated with an announcement on 17 July that from September 2023 people with pre-settled status under the EU Settlement Scheme (EUSS) would automatically have their status extended by 2 years before it expires, if they had not obtained settled status."
        },
        {
            "heading": 2,
            "text": "September"
        },
        {
            "text": "The confirmation of a future ban on XL Bully dogs brought people to GOV.UK this month, with searches for the breed exceeding 2,000 and peaking between 15 and 19 September."
        },
        {
            "heading": 2,
            "text": "October"
        },
        {
            "text": "As the seasons turned and autumn began in earnest in October, so did the latest series of named storms. Storm Babet brought high winds and heavy rain to much of the UK, with eastern Scotland being affected particularly badly. GOV.UK was a vital source of information during the severe weather, with our ‘check for flooding’ page seeing a 1,244% increase in engagement, and the ‘check the long-term flood risk for an area in England’ page experiencing a 117% growth in traffic."
        },
        {
            "heading": 2,
            "text": "November"
        },
        {
            "text": "Weather again brought users to GOV.UK in large numbers as November arrived. Announcements of school closures in response to Storm Ciarán led to a 4,000% increase in unique page views to the School Closures page."
        },
        {
            "heading": 2,
            "text": "December"
        },
        {
            "text": "And as temperatures dipped at the beginning of 2023’s final month, weather stayed on the agenda, but in a different way - in line with winter seasonal trends, engagement with our Cold Weather Payment pages increased by an average of 939%. The pages provide information about what people need to do to get the payments and when they will receive them."
        }
    ]
}