{
    "url": "https://insidehmcts.blog.gov.uk/2024/01/08/inside-the-criminal-courts/",
    "title": "Inside the criminal courts",
    "authors": [
        "Sarah Davies, Head of Crime Communications and Engagement",
        "Sian Wharton-Goodman, Senior Communications Manager"
    ],
    "categories": [
        "Crime",
        "Working at HMCTS"
    ],
    "pub_date": "2024-01-08T11:00:54+00:00",
    "content": [
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "text": " "
        },
        {
            "text": "Have you ever wondered what goes on behind the scenes in the criminal courts?"
        },
        {
            "text": "When you think of the people you might find in a criminal court, it's easy to picture a judge, a barrister or solicitor, and, of course, the jury. All these people, of course, play critical roles day in, day out. But alongside these more well-known figures are  over 5,000 HMCTS staff working on the front line in our Crown and magistrates’ courts, supporting court users and helping to keep the wheels of justice turning every day."
        },
        {
            "text": "Our latest video series will take you ‘Inside the Criminal Courts’ and seeks to highlight the efforts of dedicated HMCTS court staff and the various roles it takes to ensure a court runs smoothly and trials go ahead. Through a series of staff stories, we will delve deeper into the inner workings of the criminal courts and shine a spotlight on the individuals who work tirelessly within them, showcasing their vital contributions to the administration of justice."
        },
        {
            "text": "Nasima, Crown Court Clerk."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Shining a light on dedicated staff"
        },
        {
            "text": "'Inside the Criminal Courts' is about celebrating our people. We’ve developed a series of captivating short films that aim to showcase their expertise while working in unique and complex situations."
        },
        {
            "text": "No two days are the same for our staff, who will share their personal stories and reflections, helping to bring the hidden world of the criminal court system to life."
        },
        {
            "text": "You’ll hear from court clerks, ushers, delivery managers and building champions to name just a few of the roles that help to make sure that justice is delivered."
        },
        {
            "text": "Janette, Delivery Manager"
        },
        {
            "text": "As we engaged in conversations with our staff, we were struck by the remarkable passion and dedication with which they perform their roles. We uncovered countless tales of incredible commitment, from providing reassuring support to a nervous juror to ensuring that sensitive cases are listed as soon as possible. These stories demonstrate how our staff go the extra mile, turning their daily responsibilities into extraordinary examples of care and compassion."
        },
        {
            "text": "Jennifer, Crown Court Usher"
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Recognising diversity and resilience"
        },
        {
            "text": "The stories shared by our staff not only highlight the diverse breadth of work that goes on in the criminal courts but also reflects the diversity of our organisation, celebrating all the talented people who work for HMCTS. Recent years have seen our staff in the criminal courts face increasing pressures, pushing them to overcome unprecedented challenges. This is an opportunity to shine a light on our brilliant people, increase awareness of the range of roles they undertake, and, above all, recognise and appreciate our staff."
        },
        {
            "text": "Adrian, Operations Manager"
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Get involved"
        },
        {
            "text": "Please join us over the coming weeks as we uncover the human side of criminal justice, recognising and appreciating those HMCTS staff who support court users every day, ensuring justice is done despite the challenges. Follow us on social media  and please do share your reflections over the next few weeks as we go 'Inside the Criminal Courts' – where the stories of our people take centre stage."
        },
        {
            "text": " "
        },
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "text": " "
        },
        {
            "heading": 1,
            "text": "Tu mewn i'r llysoedd troseddol"
        },
        {
            "text": "Ydych chi erioed wedi meddwl beth sy'n digwydd tu ôl i'r llenni yn y llysoedd troseddol?"
        },
        {
            "text": "Pan fyddwch yn meddwl am y bobl y gallech ddod ar eu traws mewn llys troseddol, mae'n hawdd meddwl am farnwr, bargyfreithiwr neu gyfreithiwr, ac, wrth gwrs, y rheithgor. Mae'r bobl hyn i gyd, wrth gwrs, yn chwarae rhan hollbwysig o ddydd i ddydd. Ond ochr yn ochr â’r ffigurau mwy adnabyddus hyn mae dros 5,000 o staff GLlTEF yn gweithio ar y rheng flaen yn ein Llysoedd Ynadon a Llysoedd y Goron, yn cefnogi defnyddwyr y llysoedd ac yn helpu i gadw’r rhod cyfiawnder yn troi bob dydd."
        },
        {
            "text": "Bydd ein cyfres fideo ddiweddaraf ‘Tu mewn i’r Llysoedd Troseddol’ yn ceisio tynnu sylw at ymdrechion staff llys ymroddedig GLlTEF a’r rolau amrywiol sy’n hanfodol i sicrhau bod y llys yn rhedeg yn esmwyth a threialon yn mynd rhagddynt. Trwy gyfres o hanesion staff, byddwn yn edrych yn fanylach ar weithrediad mewnol y llysoedd troseddol ac yn tynnu sylw at yr unigolion sy'n gweithio'n ddiflino oddi mewn iddynt, gan arddangos eu cyfraniadau hanfodol at weinyddu cyfiawnder."
        },
        {
            "text": "Nasima, Clerc Llys y Goron."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Taflu goleuni ar staff ymroddedig"
        },
        {
            "text": "Mae ‘Tu mewn i’r Llysoedd Troseddol’ yn ymwneud â dathlu ein pobl ni. Rydym wedi datblygu cyfres o ffilmiau byr cyfareddol sy’n anelu at arddangos eu harbenigedd wrth weithio mewn sefyllfaoedd unigryw a chymhleth. Nid oes dau ddiwrnod yr un fath i’n staff, a fydd yn rhannu eu straeon personol a’u myfyrdodau, gan helpu i ddod â byd cudd y system llysoedd troseddol yn fyw. Byddwch yn clywed gan glercod llys, tywyswyr, rheolwyr cyflawni a phencampwyr adeiladau i enwi dim ond rhai o’r rolau sy’n helpu i sicrhau bod cyfiawnder yn cael ei ddarparu."
        },
        {
            "text": "Janette, Rheolwr Cyflawni"
        },
        {
            "text": "Wrth i ni gymryd rhan mewn sgyrsiau gyda'n staff, cawsom ein taro gan yr angerdd a'r ymroddiad rhyfeddol y maent yn ei ddangos wrth gyflawni eu rolau. Datgelwyd hanesion di-rif o ymrwymiad anhygoel o ddarparu cefnogaeth galonogol i reithiwr nerfus i sicrhau bod achosion sensitif yn cael eu rhestru cyn gynted â phosibl. Mae’r straeon hyn yn dangos sut mae ein staff yn mynd gam ymhellach, gan droi eu cyfrifoldebau dyddiol yn enghreifftiau rhyfeddol o ofal a thosturi."
        },
        {
            "text": "Jennifer, Tywysydd Llys y Goron."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Cydnabod amrywiaeth a gwytnwch"
        },
        {
            "text": "Mae’r straeon a rennir gan ein staff nid yn unig yn amlygu ehangder amrywiol y gwaith sy’n digwydd yn y llysoedd troseddol ond hefyd yn adlewyrchu amrywiaeth ein sefydliad, gan ddathlu’r holl bobl dalentog sy’n gweithio i GLlTEF. Yn ystod y blynyddoedd diwethaf, mae ein staff yn y llysoedd troseddol wedi wynebu pwysau cynyddol, gan eu gwthio i oresgyn heriau digynsail. Mae hwn yn gyfle i daflu goleuni ar ein pobl wych, cynyddu ymwybyddiaeth o’r amrywiaeth o rolau y maent yn eu cyflawni, ac, yn anad dim, cydnabod a gwerthfawrogi ein staff."
        },
        {
            "text": "Adrian, Rheolwr Gweithrediadau"
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Cymerwch ran"
        },
        {
            "text": "Ymunwch â ni dros yr wythnosau nesaf wrth i ni ddatgelu ochr ddynol cyfiawnder troseddol, gan gydnabod a gwerthfawrogi staff GLlTEF sy’n cefnogi defnyddwyr llys bob dydd, gan sicrhau bod cyfiawnder yn cael ei wneud er gwaethaf yr heriau. Dilynwch ni ar y cyfryngau cymdeithasol a chofiwch rannu eich myfyrdodau dros yr ychydig wythnosau nesaf wrth i ni fynd 'Tu Mewn i'r Llysoedd Troseddol' – lle mae straeon ein pobl ni yn cael sylw."
        }
    ]
}