{
    "url": "https://defrafarming.blog.gov.uk/2024/01/08/supporting-tenant-farmers-in-england/",
    "title": "Supporting tenant farmers in England",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Farming and Countryside Programme"
    ],
    "pub_date": "2024-01-08T12:12:03+00:00",
    "content": [
        {
            "text": "Tenant farmers are at the heart of the rural economy, managing a third of all farmland in England.  "
        },
        {
            "text": "To meet our food security and environmental objectives, we must make sure that all farmers, including tenant farmers, can access our schemes and build thriving farm businesses.  "
        },
        {
            "text": "The Rock Review, an independent report published in 2022, set out to explore how the new government financial schemes should be accessible, open, and flexible to tenant farmers. It also looked at the longer-term changes needed to ensure a robust and vibrant tenanted sector for the future. A summary of the Rock Review, with recommendations, is available on GOV.UK. "
        },
        {
            "text": "In our response to the Rock Review, we set out our commitment to supporting tenant farmers. We wrote a blog post about or response too.  "
        },
        {
            "text": "In this post, we’ll explain how we are continuing to design our schemes with tenant farmers in mind. We’ll provide an update on how we're embedding an understanding of the tenanted sector across Defra and summarise the progress we’ve made so far. "
        },
        {
            "heading": 2,
            "text": "Removing barriers for tenant farmers "
        },
        {
            "text": "We know that tenant farmers can face additional barriers when accessing environmental schemes. We’re continuing to make progress, adapting our policies and schemes so that tenant farmers can access them.  "
        },
        {
            "text": "The Sustainable Farming Incentive (SFI) has been designed to remove the barriers that tenants previously faced. "
        },
        {
            "text": "For example, SFI offers 3-year agreements. This is in line with the average length of farm business tenancies. We designed the rules so that tenants who expect to have management control for 3 years (even if their formal tenancy agreement or license does not extend that far) can still apply. This means that many farmers with annual rolling tenancy agreements can access SFI.  "
        },
        {
            "text": "We also changed the rules so that penalties are no longer applied for tenants who may have to exit a scheme early if their tenancy ends unexpectedly. "
        },
        {
            "text": "In addition, SFI does not require the tenant to gain landlord consent to enter the scheme. However, tenants should check the terms of their tenancy agreement before applying to SFI and, in the spirit of collaboration, they should communicate with their landlord about the SFI activities they will carry out.  "
        },
        {
            "text": "These changes have had a real impact with thousands of tenant farmers applying for SFI agreements. "
        },
        {
            "heading": 2,
            "text": "Acting on insight"
        },
        {
            "text": "We’ve taken what we learned while designing SFI into the development of Countryside Stewardship (CS), our combined offer for 2024 and the Farming Investment Fund.  "
        },
        {
            "text": "As we developed the offer for 2024, we assessed the impact on tenant farmers and the opportunities too. "
        },
        {
            "text": "We are working closely with the new joint Defra/industry Farm Tenancy Forum (representing tenants, landlords and professional advisors) using their expertise to help us consider when landlord consent might be needed. For example, when a permanent land use change is required. "
        },
        {
            "text": "As a result, we will introduce 16 new actions with a 3-year duration. We are exploring whether we can offer a further 41 existing CS actions of 3-year duration to make them more accessible to tenant farmers in 2024. "
        },
        {
            "text": "As recommended by the Rock Review, the themes under Farming Investment Fund large grants include second hand equipment. "
        },
        {
            "text": "We are also working with the Farm Tenancy Forum to examine the practical detail and implications of further changes to our environmental land management schemes to encourage and support tenants.  "
        },
        {
            "text": "We’re exploring a range of measures. These include: "
        },
        {
            "text": "We are also exploring whether landlord-led, or collaborative/joint tenant-landlord applications can be delivered for our large Farming Investment Fund grants. "
        },
        {
            "heading": 2,
            "text": "Monitoring the impact of our schemes"
        },
        {
            "text": "Through regular engagement with industry, we are aware of concerns about landlords taking land out of tenancy agreements."
        },
        {
            "text": "Our data currently shows the area of tenanted land rented for one year or more has remained very stable over the last 5 years at 2.9 million hectares. "
        },
        {
            "text": "However, we recognise there is a lag between changes on the ground feeding into national data so we are working with the Farm Tenancy Forum to monitor this issue and act as needed. "
        },
        {
            "text": "We want landlords to maintain their tenancies and work with tenants to access our schemes. "
        },
        {
            "heading": 2,
            "text": "Progressing commitments "
        },
        {
            "text": "The government response to the Rock Review offers an overarching framework for our work to support tenants through our policies and schemes.  "
        },
        {
            "text": "We established a dedicated Farm Tenancy Policy Team to coordinate, monitor and support this work and track progress.  "
        },
        {
            "text": "We have already actioned over a quarter of the commitments in our government response, including making our environmental land management schemes more accessible as mentioned above. "
        },
        {
            "text": "We are making good progress on the other actions, most of which are ongoing or will take longer to deliver, as set out below. "
        },
        {
            "heading": 2,
            "text": "Tenant/landlord relationships "
        },
        {
            "text": "We strengthened our engagement with the sector by establishing the joint Defra/industry Farm Tenancy Forum.  "
        },
        {
            "text": "We’re facilitating the development of a new industry-led code of practice to encourage more collaborative tenant/landlord relationships.  "
        },
        {
            "text": "We issued a call for evidence on the proposal for a Tenant Farming Commissioner and we continue to monitor farm tenancy rents. "
        },
        {
            "heading": 2,
            "text": "Trees and net zero "
        },
        {
            "text": "We amended the England Woodland Creation Offer application process to include questions to monitor land resumption. We’re analysing the data to inform policy development.  "
        },
        {
            "text": "We reduced the minimum scale of woodland creation in EWCO and are testing a farm woodland standard through SFI including smaller-scale agroforestry more suitable to tenant farmers.  "
        },
        {
            "text": "We’re designing our agroforestry offer in a way that is responsive to the needs of tenants.  "
        },
        {
            "heading": 2,
            "text": "Tax "
        },
        {
            "text": "We delivered a consultation on expanding Agricultural Property Relief to allow for non-agricultural land stewardship schemes and explore issues of taxation as a driver for length of tenancy agreements. We're working with Treasury to consider the responses and will respond in due course. "
        },
        {
            "heading": 2,
            "text": "Learn more "
        },
        {
            "text": "We recently set up a series of monthly sector-specific webinars for farmers, which tenant farmers are very welcome to attend. We plan to host a specific webinar for tenant farmers in the months ahead, so do look out for updates here on the blog once we have a date in the diary.  "
        },
        {
            "text": "Finally, if you have any questions about our work with tenants, do leave a comment below. "
        }
    ]
}