{
    "url": "https://nationalscreening.blog.gov.uk/2024/01/08/uk-nsc-expands-its-digital-reach-during-2023/",
    "title": "UK NSC expands its digital reach during 2023",
    "authors": [
        "Dexter Berridge"
    ],
    "categories": [
        "General"
    ],
    "pub_date": "2024-01-08T08:49:15+00:00",
    "content": [
        {
            "text": "The number of people going online to read about the UK National Screening Committee (UK NSC) increased steadily throughout 2023."
        },
        {
            "text": "The UK NSC’s online presence forms a major part of its efforts to continually improve engagement with stakeholders. We aim to provide clear, concise, transparent and accessible information about the committee’s work via the UK NSC’s:"
        },
        {
            "text": "Nearly 290,000 individual visits were recorded across all these 3 online platforms during 2023."
        },
        {
            "text": "More than 200,000 of those visits were to the web tool, which contains the UK NSC’s recommendations on more than 100 screening topics. We use the web tool to hold regular public consultations on screening topics, inviting stakeholders to review the latest evidence and submit comments."
        },
        {
            "text": "Well over 90% of the visitors to the recommendations web tool came from the UK in 2023 but there was also significant international interest. Visitors included nearly 2,000 people from the USA, more than 700 from India, more than 600 from Ireland and more than 500 from Australia."
        },
        {
            "text": "By far the most visited individual page on the site was the UK NSC’s targeted lung cancer screening programme recommendation with 13,268 hits."
        },
        {
            "text": "The very high level of interest in the committee’s positive recommendation for targeted lung cancer screening was also reflected by visitors to the blog. The most read blog post of 2023 was UK NSC recommends introduction of targeted lung cancer screening, even though that article was published back in September 2022."
        },
        {
            "text": "Overall, there were nearly 21,000 visits to the UK NSC blog in 2023 and the number of people subscribing to blog updates increased during the year from 1,192 to 1,881."
        },
        {
            "heading": 2,
            "text": "Top 10 blog posts of 2023"
        },
        {
            "text": "Many thanks to all our stakeholders for their continued interest in, and engagement with, the work of the UK NSC."
        },
        {
            "text": "We will aim to continue to develop this online engagement with stakeholders throughout 2024."
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK NSC. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, please email screeninginformation@dhsc.gov.uk."
        }
    ]
}