{
    "url": "https://digitaltrade.blog.gov.uk/2023/07/13/finding-innovative-solutions-through-the-dbt-data-challenge/",
    "title": "Finding innovative solutions through the DBT Data Challenge",
    "authors": [
        "Tayyib Sadiqque, Data Engineer",
        "Jennie Rich, Engagement and Strategic Adoption Officer"
    ],
    "categories": [
        "Professions"
    ],
    "pub_date": "2023-07-13T11:16:57+01:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "The Data Infrastructure team hosted a Data Challenge during the Digital, Data and Technology (DDaT) week for all Department for Business and Trade (DBT) staff. Colleagues had the opportunity to propose project ideas about how DBT could use data in new and creative ways to solve problems.  "
        },
        {
            "text": "The Data Infrastructure team manage DBT’s data catalogue and asset register. They are also responsible for Data Workspace which is DBT’s central reporting and analysis platform. It allows the department to effectively track and measure its activity related to the businesses it helps. "
        },
        {
            "text": "DDaT Week was a packed schedule of online, in-person and hybrid events and networking opportunities during the last week of April. It highlighted new ways for DDaT and DBT to collaborate across offices, regions and overseas.  Sessions included exhibitions of DDaT's products and services, interactive workshops and the all-staff DBT Data Challenge which all teams were encouraged to take part in. "
        },
        {
            "text": "The DBT Data Challenge aimed to:"
        },
        {
            "heading": 2,
            "text": "Shortlisting projects"
        },
        {
            "text": "The DBT Data Challenge attracted over 30 project proposals from across the department including from international colleagues. We had 7 project ideas shortlisted with participants engaging from Belfast and Cardiff.  "
        },
        {
            "text": "Some of our shortlisted projects included: "
        },
        {
            "text": "Participants from outside DDaT could develop their project ideas over the course of the week supported by a colleague from the DDaT Data team. They had the opportunity to produce meaningful analysis using data available on Data Workspace or sourced from elsewhere. At the end of the week, participants presented their analysis at our Showcase and Awards ceremony.  "
        },
        {
            "heading": 2,
            "text": "Presenting and judging the finalists"
        },
        {
            "text": "The ceremony was a hybrid event which took place in the Old Admiralty Building and virtually. Reception to the event was fantastic.  We had over 140 colleagues from across the department dialling in or attending in person.  "
        },
        {
            "text": "Each team presented the projects that they had been working on during the week. Audience members and our judging panel were then able to follow up with questions about each project. We had an oversubscribed judging panel which included: Sian Thomas (Chief Data Officer), Jane Naylor (Chief Statistician), Anthony Morris (Deputy Director - Analysis and Wages) and Martin Cook (Deputy Director - Export Design).  "
        },
        {
            "heading": 2,
            "text": "The winning project"
        },
        {
            "text": "After much deliberation, our judging panel announced Nick Avis, Jack O’Callaghan and Agnes Coaker were the chosen winners. Their project built a comprehensive and interactive Financial Vulnerability dashboard using data available from the credit reporting company, Experian. The dashboard was developed in a package called R Shiny that can build web-based applications. This meant it could be visualised using maps and tables which users could view and download. "
        },
        {
            "text": "Nick and Jack said “The Experian dashboard project has great potential to allow us to share high-level insights more rapidly across the department. It also eases the number of resources required for simpler and more regular analytical requests”."
        },
        {
            "heading": 2,
            "text": "Next steps"
        },
        {
            "text": "The DBT Data Challenge was a fantastic opportunity to showcase data-driven innovation and cross-collaboration across DBT. It was particularly exciting, especially considering the MOG changes happening. We’re already looking forward to hosting the DBT Data Challenge next year. "
        }
    ]
}