{
    "url": "https://valuationoffice.blog.gov.uk/2023/07/13/how-home-improvements-affect-your-council-tax-band/",
    "title": "How home improvements affect your Council Tax band",
    "authors": [
        "Richie Roberts - Council Tax Customer Journey Owner"
    ],
    "categories": [
        "Council Tax"
    ],
    "pub_date": "2023-07-13T11:25:29+01:00",
    "content": [
        {
            "text": "Many homes in England and Wales are renovated and extended. In this blog, we explain what happens to your Council Tax band when you make changes to your home. We also explain what an improvement indicator means and what you need to consider when purchasing a new home."
        },
        {
            "text": "The VOA follows strict laws around valuation. This means, legally, we cannot change the Council Tax band of a property that has been improved until it is sold, or there is a general revaluation of all domestic properties. This helps to make sure homeowners are not penalised for improving or maintaining their home."
        },
        {
            "text": "Instead, we give the property an improvement indicator."
        },
        {
            "text": "Improvement indicators show that major structural changes have been made to a property. This includes things like adding an extension or carrying out large-scale renovation work. We don’t consider redecorating to be a major change."
        },
        {
            "text": "If we’ve added an improvement indicator to your home, it will be shown on the property information for your address when you search your postcode online."
        },
        {
            "text": "Improvement indicators prompt a review of the Council Tax band once a property is sold."
        },
        {
            "text": "The process"
        },
        {
            "text": "Improvement indicators are added to properties when we receive information. For example, your council will let us know when you have built an extension. Or we may become aware of property changes during the course of our work."
        },
        {
            "text": "We follow a three-step process:"
        },
        {
            "text": "Council Tax bands cover a range of values, and often changes do not increase the value of a home enough to move it into a higher band."
        },
        {
            "text": "In most cases, we only review the Council Tax band after a sale, so any changes to the band will only affect the property’s new owners. But there are some circumstances when we’ll review a property’s Council Tax band without a sale, such as when an annexe is created."
        },
        {
            "text": "If you’ve purchased a property with an improvement indicator"
        },
        {
            "text": "If you’ve purchased an improved property in England and we increase its Council Tax band after a review, the new band will apply from the date we notify your local council. This is usually a few days after we complete our review. In Wales, the new band will apply from the date of purchase."
        }
    ]
}