{
    "url": "https://educationinspection.blog.gov.uk/2023/07/13/insights-from-our-first-full-inspections-of-lead-providers-of-the-new-early-career-framework-ecf/",
    "title": "Insights from our first full inspections of lead providers of the new early career framework (ECF)",
    "authors": [
        "Helen Matthews, Senior HMI for Teacher Development"
    ],
    "categories": [
        "professional development",
        "teacher training"
    ],
    "pub_date": "2023-07-13T15:30:49+01:00",
    "content": [
        {
            "text": "High-quality teachers are essential for giving all pupils the very best education. This is especially true for pupils from disadvantaged backgrounds, those with English as an additional language and those with special educational needs and disabilities (SEND). High-quality training and professional development are therefore vital at all stages of teachers and leaders’ careers: from initial teacher education (ITE) to support through the early career framework (ECF), and later development through national professional qualifications (NPQs)."
        },
        {
            "text": "These stages create a ‘golden thread’ of training and professional development for teachers. Our inspections of ECF and NPQ lead providers look at how they ensure the delivery of high-quality training and professional development through a national network of delivery partners."
        },
        {
            "text": "While the phase one findings from our independent review of teachers’ professional development made clear that teachers and leaders are often unimpressed with the quality of their recent training and development, it found that ‘the ECF and NPQs represent a significant step forward’. Our inspections this term found this to be true."
        },
        {
            "text": "Insights from the ECF inspections "
        },
        {
            "text": "Common good practice shared by all lead providers"
        },
        {
            "text": "We have now completed all 6 full inspections of ECF programmes delivered by lead providers. These are the first full inspections to take place under the new ECF and NPQ inspection framework, published in March 2022."
        },
        {
            "text": "This year, all the lead providers we inspected received a good or outstanding grade. The majority of early career teachers (ECTs) we spoke to during these inspections had a positive experience of their training. They said it was providing them with the knowledge, understanding and skills needed to progress in teaching and to meet the needs of learners in their specific phases."
        },
        {
            "text": "Some common features of good practice included:"
        },
        {
            "text": "While all lead provider curriculums were faithful to the ECF requirements, this did not result in identical training programmes. For example, we saw lead providers consider how they delivered the curriculum to provide high-quality, bespoke training. Some lead providers offered flexible online learning modules to supplement the training. This flexibility allowed mentors to pitch training to individual ECTs' learning needs, ultimately helping them to manage their workloads and support their well-being."
        },
        {
            "text": "Mentors and training leads were essential for adapting such activities to account for what ECTs knew and could do already. Lead providers made sure that mentors received high-quality training that allowed them to tailor training appropriately and ensured they understood their role and responsibilities fully."
        },
        {
            "text": "Mentors also understood their role in putting the generic statements of the ECF into context so that ECTs can apply them in their own settings and phases. Good facilitators and mentors brought the training to life. Examples included:"
        },
        {
            "text": "This contextualisation was happening in all lead providers, but some recognised that their provision had some gaps. For example, they may not have produced enough material to support some ECTs to understand how the training could apply in their specific phase. However, these providers had plans in place to rectify this. Providers are not expected to produce materials that exemplify every setting, phase and subject. But the best providers encouraged ECTs to be professionally reflective and helped them to look for ways to apply the training in the subject and phase they are teaching in."
        },
        {
            "text": "The most successful providers clearly explained the rationale behind their curriculum design. This meant that ECTs understood that the programme would deliberately revisit and build on elements from their ITE year to deepen understanding. The ECF sets out core principles that ECTs will revisit throughout their teaching careers, such as adaptive teaching and managing behaviour. Where this was done well, we saw that ECTs could successfully build, deepen, and apply their knowledge over time."
        },
        {
            "text": "Frequent good practice shared by many lead providers"
        },
        {
            "text": "Our framework explicitly considers teacher workload to help minimise any additional burden because we understand that many teachers are under significant pressure. We were encouraged to see that most lead providers took ECT workload very seriously and were prompt with support where needed. This was recognised and appreciated by the majority of ECTs."
        },
        {
            "text": "We also saw training programmes preparing ECTs for the realities of teaching. Strong programmes developed ECTs’ resilience and confidence to form solid foundations for their teaching career."
        },
        {
            "text": "ECF training delivered by lead providers is unique in that the programmes are delivered at a national scale through a network of delivery partners. Where this worked well, strong collaboration and communication enabled a cohesive approach to large-scale training delivery, with little evidence of regional differences."
        },
        {
            "text": "But these networks also mean that it is essential to monitor quality of delivery regularly and rigorously. Our monitoring visits last year found that some lead providers needed to improve their quality assurance processes. This year’s inspections found that many had improved and only a minority of lead providers still need to further embed their quality assurance processes."
        },
        {
            "text": "Forward look: what next?"
        },
        {
            "text": "We have been engaging closely with lead providers and their stakeholders throughout the development of the framework and the launch of full inspections. Lead providers tell us that they value our collaborative approach and the chance to have conversations about what great professional development for teachers looks like."
        },
        {
            "text": "We will be inspecting all lead providers of NPQ programmes next year and will continue to engage with lead providers and other stakeholders throughout the process."
        }
    ]
}