{
    "url": "https://educationhub.blog.gov.uk/2023/07/13/teacher-strikes-everything-you-need-to-know-about-the-2023-24-teacher-pay-award/",
    "title": "Teacher strikes: Everything you need to know about the 2023/24 teacher pay award",
    "authors": [
        "media officer"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2023-07-13T12:58:12+01:00",
    "content": [
        {
            "text": "School teachers in England have been given a pay award of 6.5% as the Government accepted all the recommendations set out by the independent body advising on teacher pay."
        },
        {
            "text": "The pay award the highest for teachers for 30 years - will boost starting salaries for new teachers to at least £30,000 across the country – meaning an increase of up to 7.1%. Here we tell you everything you need to know about our pay award for school teachers."
        },
        {
            "heading": 3,
            "text": "What is the pay award for school teachers?"
        },
        {
            "text": "The Schools Teachers’ Review Body (STRB) recommended a pay award of 6.5% across all pay scales, which has been accepted in full by the Education Secretary."
        },
        {
            "text": "This comes on top of the record pay rise in 2022/23 of 5.4% on average, meaning that over two years, teacher pay is increasing by more than 12% on average."
        },
        {
            "text": "There are also slightly higher pay increases for starting salaries outside London, so that new teachers receive £30,000 or above from September to deliver on the Government's commitment."
        },
        {
            "text": "The way school teachers’ salaries work means that each year around 40% of them progress up a scale to the next pay point. This means that these teachers will see even greater increases in their salary this year of at least 10% and up to 17.4%."
        },
        {
            "heading": 3,
            "text": "How can I work out my new pay?"
        },
        {
            "text": "You can use a teacher pay calculator to work out what this could mean for your salary based on your current pay."
        },
        {
            "heading": 3,
            "text": "How was the school teacher pay award decided?"
        },
        {
            "text": "The School Teachers’ Review Body (STRB) is an independent group that makes recommendations on the pay of teachers in England and reports to the Secretary of State for Education and the Prime Minister."
        },
        {
            "text": "Each year the STRB recommends a pay award based on different factors including the economy, school workforce data and evidence from organisations including the DfE, and the teaching unions (the National Education Union, the National Association of Headteachers, the Association of School and College Leaders and NASWUT)."
        },
        {
            "text": "The Government then considers the recommendations in depth and makes a decision on what pay teachers receive for the coming year."
        },
        {
            "text": "We know how important it is for schools to be able to plan effectively and will work to align the timing of the STRB process with the school budget cycle in future, to help with that."
        },
        {
            "heading": 3,
            "text": "Why are we publishing the STRB’s recommendations now?"
        },
        {
            "text": "We acknowledge that schools benefit from timely confirmation of the teacher pay award. However, it is important that we get the process right."
        },
        {
            "text": "After the STRB submitted its report and recommendations to the department, the Education Secretary, as part of the normal process, carefully considered these recommendations to decide on an award for teachers which was fair and reasonable and the right decision for our economy."
        },
        {
            "text": "This consideration took place to the same timescales as previous years. The Department then published our response in the usual way."
        },
        {
            "heading": 3,
            "text": "How will the school teacher pay award be funded?"
        },
        {
            "text": "The Government has listened to schools and head teachers and the additional funding announced today funds the full cost of the award above 3.5%, nationally. This is in recognition of the fact that many schools budgeted for a 3.5% pay increase."
        },
        {
            "text": "We calculated that, on average, schools can afford a 4% pay award from existing budgets, following the £2 billion announced in the Autumn statement.  So the additional funding to support this pay award is higher and more generous than what our calculations tell us schools can afford."
        },
        {
            "text": "Schools will receive an additional £525m in the 2023-24 financial year and £900m in the 2024-25 financial year. Our strong expectation is that all schools will use these additional funds for teacher pay as is intended."
        },
        {
            "text": "This means the pay award is fully funded and affordable, nationally."
        },
        {
            "heading": 3,
            "text": "Where is this funding coming from?"
        },
        {
            "text": "We are reprioritising within the Department for Education’s existing budget to deliver this additional funding to schools, while protecting core budgets."
        },
        {
            "text": "This means we are ensuring there are no cuts to core schools’ and colleges’ budgets, including SEND provision and funds for the early years' entitlements, and no cuts to allocations and programmes to address building safety."
        },
        {
            "heading": 3,
            "text": "What are we doing to encourage teachers to stay in the profession?"
        },
        {
            "text": "We want to ensure teaching remains an attractive career, which is why we are taking action to encourage teachers to stay in the profession."
        },
        {
            "text": "To help, we will convene a workload reduction taskforce to explore how we can go further to support school and trust leaders to minimise workload.  We are also setting an ambition to reduce teacher and leader workload by five hours per week."
        },
        {
            "text": "We also know that flexible working opportunities can help to recruit, retain and motivate teachers and leaders and help promote staff wellbeing. Last month, we appointed seven Flexible Working Ambassador multi-academy trusts and schools to offer practical advice to school leaders on implementing flexible working and we are currently in the process of recruiting more. This is part of a wider programme, funded by the department, to help embed flexible working in schools and trusts."
        },
        {
            "text": "You can read more about how we recruit and retain teachers here."
        },
        {
            "heading": 3,
            "text": "Will there be more teacher strikes?"
        },
        {
            "text": "The NEU have taken strike action to date while other unions (ASCL, NASUWT and NAHT) are balloting their members for a mandate to strike."
        },
        {
            "text": "Following intensive talks an offer was made in March which was rejected by NEU members. The Education Secretary then relied on the recommendation of the independent pay review body, the STRB, which has now been accepted."
        },
        {
            "text": "We hope that this significant pay award will mean an end to strikes."
        },
        {
            "heading": 3,
            "text": "What about further education?"
        },
        {
            "text": "We will invest £185 million in 2023-24 and £285 million in 2024-25 to drive forward skills delivery in the further education sector. This funding will help colleges and other providers to address key priorities which are of critical importance to our economic growth and prosperity."
        },
        {
            "text": "This is in addition to the £125 million of funding we have already announced for the financial year 2023-24 to ensure 16 to 19 year olds, regardless of where they live or their background, will continue to have access to the courses and qualifications they need to go on to successful and rewarding careers."
        },
        {
            "heading": 3,
            "text": "What does the pay award mean for college teachers?"
        },
        {
            "text": "This pay award covers 16 to 19 maintained schools. Further education providers, including sixth form colleges, set their own pay and conditions – the Government does not set their pay. This funding will help colleges and other providers to address key priorities which are of critical importance to our economic growth and prosperity."
        }
    ]
}