{
    "url": "https://ukhodigital.blog.gov.uk/2023/07/13/why-should-we-share-data/",
    "title": "Why should we share data?",
    "authors": [
        "Helen Phillips"
    ],
    "categories": [
        "Ways of working"
    ],
    "pub_date": "2023-07-13T14:35:19+01:00",
    "content": [
        {
            "text": "The South West Pacific Hydrographic Commission work together to establish the benefits of sharing marine spatial data."
        },
        {
            "text": "Members of the Marine Spatial Data Infrastructure (MSDI) Working Group, formed by representatives of the member states of the South West Pacific Hydrographic Commission (SWPHC), have worked together to establish the benefits of sharing marine spatial data, worldwide."
        },
        {
            "text": "This collaboration has culminated in the publication of a new report: ‘Why should we share data’?"
        },
        {
            "text": "This downloadable resource highlights the value of data held by hydrographic offices, and the benefits of sharing this data to the global maritime community."
        },
        {
            "text": "Trusted marine spatial data supports:"
        },
        {
            "text": "Hydrographic offices hold and manage a wealth of significant marine spatial data.  This data is often unique as it captures characteristics and features of the ocean and the seafloor that are usually difficult to observe and expensive to acquire. The marine spatial data managed and stored by hydrographic offices is trusted because of the way the data is collected. Hydrographic offices systematically collect data across large geographic areas and invest in quality assurance and control processes beyond the capacity of most data-collecting agencies."
        },
        {
            "text": "Traditionally this data is used to produce official navigational products to support safe navigation.  More recently these data assets have been repurposed into a multitude of applications to support many maritime activities, including economic development and environmental protection.  Unlike published charts or tide tables, statistical or geographic information systems can directly analyse data sets, making them useful in many applications."
        },
        {
            "text": "Access to marine spatial data creates opportunities"
        },
        {
            "text": "Routinely and proactively releasing quality data makes it available to governments, aid agencies, commercial users, and the public.  Access to trusted marine spatial data increases the reuse of the data to support a wide range of activities, including the opportunity to better understand the marine environment, and form more intelligent and sustainable decision-making."
        },
        {
            "text": "Publicly released data is more useful if it is made as FAIR (Findable, Accessible, Interoperable, Reusable) as possible, using appropriate community standards for the data and its metadata. If data from hydrographic offices are not easily accessible, many users will use data from a readily available source but of unknown quality."
        },
        {
            "text": "Sharing data is crucial to international conventions"
        },
        {
            "text": "Sharing data is a crucial part of international conventions that guide the work of hydrographic offices, including the United Nations Convention on the Law of the Sea (UNCLOS), the International Convention for the Prevention of Pollution from Ships (MARPOL), and the International Convention for the Safety of Life at Sea (SOLAS)."
        },
        {
            "text": "Sharing data also supports global regulators and reporting authorities, including the International Seabed Authority (ISA), Particularly Sensitive Sea Areas (PSSAs), the Convention on Biological Diversity (CBD), the United Nations Fish Stocks Agreement (UNFSA), the Agreement on Port State Measures (PMSA) and the Western and Central Pacific Fisheries Commission (WCPFC), and cooperation with global and regional scientific organisations."
        },
        {
            "text": "Making the data holdings of hydrographic offices publicly available also supports global initiatives, such as the Seabed 2030 project , which is aiming for a complete map of the ocean floor by 2030, and the United Nations Sustainable Development Goals (SDGs). The SDGs are a set of 17 goals adopted by the United Nations as a universal call to action to end poverty, protect the planet and ensure that by 2030 all people have peace and prosperity."
        },
        {
            "text": "The SDGs which are directly benefited by access to marine spatial data supplied by hydrographic office is set out in the ‘Why should we share data?’ publication, produced as part of the SWPHC MSDI Working Group."
        },
        {
            "text": "For more information visit the SWPHC MSDI Working Group website or visit the ADMIRALTY Marine Data Portal, which provides access to view and download marine data sets held by the UK Hydrographic Office (UKHO)."
        },
        {
            "text": " "
        },
        {
            "heading": 4,
            "text": "Read more on this topic:"
        },
        {
            "text": "Seabed mapping crucial to protecting our oceans"
        },
        {
            "text": "What is the UK Centre for Seabed Mapping?"
        }
    ]
}