{
    "url": "https://technology.blog.gov.uk/2025/02/18/governments-cloud-first-policy-is-12/",
    "title": "Government’s Cloud First Policy is 12!",
    "authors": [
        "Cloud and Platform team at GDS"
    ],
    "categories": [
        "Cloud"
    ],
    "pub_date": "2025-02-18T13:46:55+00:00",
    "content": [
        {
            "text": "Two landmark publications: the State of Digital Government Review, and the blueprint for modern digital government are clear - cloud technology is helping to reshape how government works."
        },
        {
            "text": "With the blueprint setting out the long-term vision, and with the Government Cloud First policy turning 12, we thought it was a good time to reflect on the successes, the challenges and our current focus."
        },
        {
            "text": "The objective of the Government Cloud First policy is that government departments and public organisations should use public cloud services as their first choice when buying IT services. This rule must be followed by central government and is strongly encouraged for other public sector organisations. The aim is for us to spend less time provisioning technology and more time improving public services."
        },
        {
            "heading": 3,
            "text": "Cloud technology has helped us improve our public services"
        },
        {
            "text": "The State of Digital Government Review found that about 60% of UK government and public sector IT systems are run on cloud services. This is a good percentage when compared to big private companies and other countries, and we now have lots of experience of cloud helping departments to deliver services."
        },
        {
            "text": "The Ministry of Justice (MoJ) has used the Cloud to simplify its operations, enhance internal collaboration, and reduce reliance on legacy systems. They have created a data and analytics platform that serves over 500 professionals daily with data from diverse sources; ranging from legacy databases to modern digital services."
        },
        {
            "text": "While this shift has delivered better public services, cost savings and improved security, it's not without its hurdles. Departments are grappling with the complexities of moving their remaining legacy systems, addressing skills shortages, and managing security concerns."
        },
        {
            "heading": 3,
            "text": "Our focus now"
        },
        {
            "text": "What we are doing"
        },
        {
            "text": "More information and resources to support your organisations’ cloud journey are available in the new GOV.UK collection: Cloud Guidance for the public sector, and by contacting the GDS Cloud Strategy mailbox."
        }
    ]
}