{
    "url": "https://gott.blog.gov.uk/2025/02/18/meet-the-trailblazer-james-spurr/",
    "title": "Meet the Trailblazer:      James Spurr",
    "authors": [
        "avneetkaur"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2025-02-18T08:00:00+00:00",
    "content": [
        {
            "text": "by James Spurr "
        },
        {
            "heading": 2,
            "text": "Tell us about a Knowledge Asset innovative project you’re proud of and why?"
        },
        {
            "text": "When I joined Ordnance Survey (OS) in summer 2024, I had the unique opportunity to take on a brand-new role in a household name organisation as OS’ Knowledge Asset Manager and write a Knowledge Asset Management Strategy (KAMS). "
        },
        {
            "text": "Knowing OS has a proud and cherished 230-year history of providing mapping for the country, the challenge to develop and enhance its Knowledge Asset (KA) management was quite daunting. From day one, when I was tasked with shaping the strategy, "
        },
        {
            "text": "I have been supported by OS’ incredible people and culture. With the guidance and support from my team and senior leadership, I feel immensely proud to be trusted to deliver this work."
        },
        {
            "heading": 2,
            "text": "At what point and why did you realise you wanted to take this project forward?"
        },
        {
            "text": "Experiencing the incredible talent of the research and development teams in creating data, products, and solutions has been my biggest influence in advancing this project. "
        },
        {
            "text": "I realised that developing the strategy would not only ensure Knowledge Assets are effectively managed and protected but also acknowledge and respect the hard work of OS’ people."
        },
        {
            "heading": 2,
            "text": "How has the support from GOTT made a difference to your project"
        },
        {
            "text": "The team at GOTT has been hugely supportive since my first day at OS. Access to their expertise in KA management and Tech Transfer across the public sector has provided a valuable sounding board to exploring ideas and opportunities. "
        },
        {
            "text": "Alongside the direct contact  with the GOTT team and their insights and advice, the guidance provided by the Rose Book has given me the best foundation to begin my role. In particular, the “Knowledge Asset Management Strategies: What to include and here to start” section has been a brilliant resource."
        },
        {
            "heading": 2,
            "text": "What’s been the biggest challenge to date?"
        },
        {
            "text": "The biggest challenge has been identifying and selecting the best mechanisms to identify, protect and exploit the range of Knowledge Assets developed by OS. With help from my team and engagement with senior leadership, we identified the options available and determined the best choices aligned to OS’ strategic direction. This collaborative approach has ensured that my strategy is being deployed with the best outcomes for OS in mind and the best chances of success."
        },
        {
            "heading": 2,
            "text": "What one piece of advice would you give to budding trailblazers in the public sector?"
        },
        {
            "text": "Understanding the strategic direction of your organisation is a crucial part of Knowledge Assets Management. Aligning my work to OS’ values and ambition has helped me define my role’s purpose, gain buy-in from senior leadership, and engage with the entire organisation. This approach to strategy development has also helped me define the scope and boundaries for future work."
        },
        {
            "heading": 2,
            "text": "What’s the best part of your job?"
        },
        {
            "text": "The best part of my job is the opportunity to engage with my colleagues and learn about their work. Having direct access to world-leading experts who are passionate about what they do is truly inspiring. Supporting them and seeing the outcomes of their hard work, whether through patenting inventions or licencing Knowledge Assets, is extremely fulfilling."
        }
    ]
}