{
    "url": "https://designnotes.blog.gov.uk/2025/02/18/sharing-camdens-work-on-universal-basic-services/",
    "title": "Sharing Camden’s work on Universal Basic Services ",
    "authors": [
        "Sophie Taylor – Senior Design Researcher, London Borough of Camden",
        "Benny Souto – Policy Designer, London Borough of Camden",
        "Hugh Smith – Corporate Strategy Portfolio Lead, London Borough of Camden"
    ],
    "categories": [
        "Community",
        "Design",
        "International"
    ],
    "pub_date": "2025-02-18T09:00:00+00:00",
    "content": [
        {
            "text": "Sharing learning across the public sector is crucial if we’re going to effectively tackle our shared challenges. So we were very excited when, at the end of 2024, we were invited to speak at the Service Design in Government conference in Edinburgh, and then in Helsinki at the International Design in Government conference."
        },
        {
            "text": "As part of the Strategy and Design team at Camden Council, our design practice spans service and policy design. We get to look beyond service improvement and imagine how we might do things differently into the future, and understand the policy levers that we can use for transformation. "
        },
        {
            "text": "To this end, Camden has been exploring the idea of Universal Basic Services (UBS) as a framework for future public services. UBS is a concept that has been developed by academics at the UCL Institute for Global Prosperity (IGP), which articulates a radical redesign of the welfare state. It sets out how a network of 7 kinds of public services (healthcare, education, legal and democracy, shelter, food, transport and information) could comprehensively meet people’s basic needs, enable them to thrive, and support social resilience in the 21st century. "
        },
        {
            "text": "Camden and IGP have a long-standing collaboration, with written reports on public services and a Camden-run pilot that looked at the impact of free travel and digital services for those seeking employment. At the beginning of 2024, our team had the opportunity to continue developing Camden’s thinking on what UBS could look like at a local level, by running a series of co-design workshops."
        },
        {
            "text": "Over 3 months we brought together groups of Camden staff, residents, and policymakers through 7 chronological sessions - imagining together what a welfare state that’s fit for the 21st century could look like. "
        },
        {
            "text": "We loved this piece of work and were really excited to be invited to share it with the international design community. Here are some of our reflections on the experience. "
        },
        {
            "heading": 2,
            "text": "Our organisational context in Camden "
        },
        {
            "text": "At both conferences, we had questions about how this work came about and how we had secured permission to explore so broadly. We recognise we’re lucky that at Camden we have a mandate from our leadership to design projects that help move us towards the ‘third horizon’ of public services - work that helps us understand, tackle and transform around some of the big issues of our society, such as housing or care. The ‘third horizon’ framework, developed by the International Futures Forum, helps us think through how we can design services that demonstrate the possibilities of a future system (our third horizon) alongside the ‘business as usual’.  "
        },
        {
            "text": "Our work on UBS fits in this framework of designing for the future. Working in a mission-led way inherently invites us to design with our eyes on the horizon and build capacity within our organisation to work with a ‘test and learn’ mindset. Going forward, we’re looking to scale up our testing so we can start prototyping what elements of UBS might look like in the real world through small pilots that will give us and others interested in exploring this idea with us a good roadmap for how we can begin to make this tangible. "
        },
        {
            "heading": 2,
            "text": "Sharing our co-design practice"
        },
        {
            "text": "We also had questions about how we built trust with residents and worked with them throughout the co-design process. Though we worked to build psychological safety through co-creating ‘ground rules’ for how we’d show up together, and compensated them for their time, we still had to navigate the tensions of doing this work as representatives of Camden Council. "
        },
        {
            "text": "Many residents had valid reasons for having low levels of trust in government, and found it  hard to trust us when we said we wanted to work with them to redesign the welfare system of the future. Part of our role was in knowing how to hold the tension between recognising we need to fix things now, but also to begin creating something that will work for future generations."
        },
        {
            "heading": 2,
            "text": "Learning from shared challenges"
        },
        {
            "text": "In Helsinki Kara Kane and Martin Jordan gave a keynote speech about the “long slog” of design in government. They argued that whilst many designers come from the private sector where work can be delivered in fast-spaced “sprints” - design in the public sector is tied to policy, funding cycles and parliamentary terms, which hugely slows things down. Generations of designers will pass down their work and ideas in an “ultramarathon baton relay” in the hope that the time will be right for ideas to make an impact. This really spoke to our work on UBS and the way we had to navigate engaging residents in this process. The hope is that the work we do now to shape a vision will have an impact when the right conditions are in place."
        },
        {
            "text": "We were also inspired by David Martens from the EU Policy Lab’s  talk on the role of design in making things more intimate and beautiful, and we recognise how important this can be in our work around UBS when looking to build stories and ideas that will inspire many others to join us as we create a different future."
        },
        {
            "text": "Our main takeaway was a sense of solidarity with international colleagues facing such similar challenges, and a renewed sense of the value of design for bringing new energy, creativity and thinking to the public sector. Although it may sometimes feel like an “ultramarathon,” employing design thinking in government spaces feels so much more meaningful when you know you’re not alone. The value of sharing at and attending conferences like these shouldn’t be understated. "
        }
    ]
}