{
    "url": "https://socialcare.blog.gov.uk/2020/05/12/new-health-and-wellbeing-guidance-reminds-us-all-to-take-care/",
    "title": "New health and wellbeing guidance reminds us all to take care",
    "authors": [
        "Mark Harvey",
        "Fran Leddra"
    ],
    "categories": [
        "Care and support",
        "Communities",
        "coronavirus",
        "Guidance",
        "Information sharing",
        "social work"
    ],
    "pub_date": "2020-05-12T10:08:00+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Staying strong in strange times"
        },
        {
            "text": "Over a month ago, on our Social Work With Adults blog, we posted about the importance of maintaining connections as the pandemic continues to have an emotional, societal and practical impact on individuals, organisations and our wider communities."
        },
        {
            "text": "As a sector, it remains important to foster resilience in the midst of these challenges as we all adjust to a ‘new normal’. This includes making sure we give ourselves some much needed care and compassion, even as we seek to do the same for others."
        },
        {
            "text": "The publication of new health and wellbeing guidance for care and support professionals is therefore hugely welcome at this time."
        },
        {
            "text": "Across the social care workforce, we have been moved by stories of dedication, kindness and empathy as so many of you continue to provide care and support in our communities, knowing the health risks involved, but going the extra mile anyway."
        },
        {
            "text": "Many of you will have done this with the support of loved ones, balancing caring responsibilities with protecting your own health and minimising the risk (as far as possible) of entering self-isolation."
        },
        {
            "heading": 2,
            "text": "Personal priorities"
        },
        {
            "text": "We cannot stress enough how important it is to prioritise your own wellbeing, especially now. There are a number of effective ways to support your mental health and improve your coping skills."
        },
        {
            "text": "Not surprisingly, these include exercising, staying in touch with family and friends and trying not to continuously check the news. It’s also incredibly important to maintain a regular sleeping pattern, eat well and make time to do the things you enjoy (in a socially distanced way of course!)."
        },
        {
            "text": "Here are a couple of examples of what we’ve been doing to take care of our own wellbeing over this period:"
        },
        {
            "heading": 2,
            "text": "Apps, advice and toolkits"
        },
        {
            "text": "We encourage you to take some time to explore the resources available to you. In addition to the new health and wellbeing guidance for the adult social care workforce there are many other sources of practical tips, advice and services, including:"
        },
        {
            "text": "You also have free access to a number of wellbeing apps to help you develop and maintain resilience, cope with stress, improve your sleeping patterns and explore mindfulness as a way of switching off from work."
        },
        {
            "text": "If you are struggling, please reach out for help. You can use Shout’s messaging support service or call Hospice UK’s specialist number for coping with bereavement, trauma or anxiety as a result of COVID-19:"
        },
        {
            "text": "We will get through this crisis, but the social care response will go way beyond this point. Working with people through times of grief, helping them re-build their lives, livelihood and supporting the communities they live in will be core to social care in the times ahead."
        },
        {
            "text": "It is vital that we look after ourselves and our loved ones too, so that we can all cope, respond and adapt to a situation which has already changed all our lives."
        }
    ]
}