{
    "url": "https://environmentagency.blog.gov.uk/2024/08/01/bringing-new-life-to-hulls-urban-waters/",
    "title": "Bringing new life to Hull’s urban waters",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Environment Agency",
        "Nature",
        "Sustainability"
    ],
    "pub_date": "2024-08-01T13:22:40+00:00",
    "content": [
        {
            "text": "Hull is a city that has long been defined by its relationship with water. Environment Programme Project Manager, Dan Jagucki, talks about an innovative project to bring new life into Hull’s urban waterways. "
        },
        {
            "text": "Hundreds of years ago the city and much land to the north was reclaimed from fresh and saltwater marshes."
        },
        {
            "text": "This land was protected from the rivers Hull and Humber by embankments and a large network of land drains cut into the land to carry water away."
        },
        {
            "text": "While many of these drains were covered over or filled in during the 1960s, some of them still remain as open watercourses flowing through the city."
        },
        {
            "text": "Rapid urbanisation and industrialisation and the associated pollution and littering have since taken its toll on the city’s drains."
        },
        {
            "text": "But a transformative project to improve the environment is underway – and already reaping rewards."
        },
        {
            "text": "Hull’s Dynamic Drains is a partnership project between the Environment Agency, Groundwork Yorkshire, Yorkshire Wildlife Trust and Hull City Council."
        },
        {
            "text": "It aims to reverse the trend by improving the condition of the city’s waterways, creating more accessible green spaces and new habitat for wildlife and fostering a renewed connection and sense of pride between Hull’s drains and its local community."
        },
        {
            "text": "Pilot project rejuvenates drain "
        },
        {
            "text": "The holistic approach has already helped to make significant changes in its pilot project watercourse at Beverley and Barmston Drain – which runs for 4km through the city, including residential, retail and industrial areas."
        },
        {
            "text": "Since it began in late 2020, the £500,000 project has made important progress."
        },
        {
            "text": "Silt dredged from the channel has created areas on the bankside for easier access, as well as creating better habitats for fish. Meanwhile two ‘pocket parks’ have been created – with a third in the works – providing green spaces with seating, wildflowers and native trees for people and wildlife to enjoy."
        },
        {
            "text": "A ‘pond dipping’ platform at the Clough Road pocket park is encouraging children and families to connect with the drain and what lives beneath its surface."
        },
        {
            "text": "Land along the drain has been cleared of historical fly tipping and invasive Japanese knotweed and replaced with native trees and shrubs as well as new otter holts and bird boxes to provide new homes for wildlife."
        },
        {
            "text": "The community has been integral to the work, with a number of community litter picking events – including support from Kingston Kayaks to collect rubbish from the drain using canoes."
        },
        {
            "text": "A schools engagement programme is also underway which includes creating wetland wildlife areas in local schools and diverting rainwater from the sewer into rain gardens and planters."
        },
        {
            "text": "New wildlife trail brings project to life "
        },
        {
            "text": "Our work at Beverley and Bramston Drain is sewn together by a new history and wildlife trail, which was launched earlier this year. Wildlife ‘guides’ Wendy the water vole and Percy the perch are helping reconnect people to their natural environment and bring the project to life."
        },
        {
            "text": "It involves a trail across nine bridges, each giving historical information and helping the community to spot wildlife native to the location."
        },
        {
            "text": "We hope the interactive trail will capture the community’s imagination and encourage them to get involved in the future of Hull’s Dynamic Drains as we roll it out to other areas of the city."
        },
        {
            "text": "Next is Holderness Drain, which kicked off with a community clean up in May led by the Environment Agency with support from the city council. This saw 3.28 tonnes of waste removed from the drain – including more than 50 shopping trollies. As well as being an eyesore, blocked rivers also increase flood risk and residents have been urged to ensure they dispose of their rubbish correctly."
        },
        {
            "text": "Future plans for Holderness Drain include restoring a neglected and overgrown area of land that has suffered from anti-social behaviour and fly-tipping, litter picks and creating new community green spaces including pocket parks and fishing areas."
        },
        {
            "text": "And then over the next three years we’ll also roll the project out to Setting Dyke, Foredyke and Old Fleet Drain."
        },
        {
            "text": "We’re really proud of what we’ve achieved so far as a partnership and hope the community continue to get involved and support us moving forward."
        },
        {
            "text": "While the drains are in the centre of what is an urban environment, and all the challenges that brings, it doesn’t mean we can’t have good water quality and biodiversity and that wildlife can thrive."
        },
        {
            "text": "We’re committed to helping people connect with water and nature and enjoy all of the benefits that brings."
        },
        {
            "text": "Follow the Environment Agency Yorkshire and North East, Yorkshire Wildlife Trust , Hull City Council and Groundwork Yorkshire on X."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}