{
    "url": "https://marinedevelopments.blog.gov.uk/2024/08/01/celebrating-marine-protected-areas-awareness-day/",
    "title": "Celebrating Marine Protected Areas Awareness Day",
    "authors": [
        "Dan Cutler, Communications & Engagement Manager"
    ],
    "categories": [
        "Blue Belt",
        "fisheries",
        "marine conservation"
    ],
    "pub_date": "2024-08-01T12:38:10+01:00",
    "content": [
        {
            "text": "As we celebrate Marine Protected Areas (MPA) Awareness Day, it's fitting that we reflect on the importance of MPAs, the role we play in manging those in English waters and the support we provide internationally to the UK Overseas Territories in the Blue Belt Programme. "
        },
        {
            "text": "The Importance of MPAs  "
        },
        {
            "text": "MPAs are areas of the ocean established to protect habitats, species and processes essential for healthy, functioning marine ecosystems.  "
        },
        {
            "text": "These areas are critical in maintaining the biodiversity of seas, protecting threatened or endangered species and preserving habitats from damage caused by human activities.  They play a crucial role by: "
        },
        {
            "text": "Global Success Stories of MPAs "
        },
        {
            "text": "The UK Overseas Territories (UKOTs) are home to some of the most incredible wildlife and habitats on the planet. In total, the UKOTs contain around 90% of the UK’s endemic species, which are found nowhere else on earth; the OTs also host a huge range of endangered species. Combined, their MPAs cover over 1% of the world’s ocean, meaning they have a significant impact in safeguarding precious marine environments and helping to combat global threats such as climate change.  "
        },
        {
            "text": "Together his group of Territories is the largest network of MPAs of its kind on the planet.  "
        },
        {
            "text": "The Blue Belt Programme, delivered by MMO and Cefas, is one of the UK Government’s flagship marine conservation programmes. Since 2016 it has worked closely with a number of the UKOTs to assist them in creating and maintaining healthy and productive ecosystems and sustainably managing and protecting 4.4 million square kilometres (km2) of marine environments. A timeline of MPA highlights from the Blue Belt Programme:  "
        },
        {
            "text": "2016 – St Helena designate their sustainable use MPA, comprising over 445,000 km2 "
        },
        {
            "text": "2016 – Pitcairn Islands designate their no-take MPA, one of the largest in the world at 834,000 km2. "
        },
        {
            "text": "2018 – The South Georgia & South Sandwich Islands MPA (designated in 2012) is enhanced, with the area closed to commercial fishing expanded and strengthened management measures"
        },
        {
            "text": "introduced to ensure sustainability. "
        },
        {
            "text": "2019 – Asension Island designates their entire exclusive economic zone as an MPA, covering over 440,000 km2. "
        },
        {
            "text": "2020 – Tristan da Cunha designates their 700,000 km2 MPA, one of the largest in the Atlantic. "
        },
        {
            "text": " "
        },
        {
            "text": "2023 – The Pitcairn Islands and its MPA is awarded Blue Park status, as an area of exemplary marine management and protection. "
        },
        {
            "text": "2023 – St Helena is awarded ‘Hope Spot’ status by Mission Blue as an area of critical importance to ocean science.  "
        },
        {
            "text": "2024 – Tristan da Cunha and its MPA is also awarded Blue Park status. "
        },
        {
            "text": "Impacts of MPAs "
        },
        {
            "text": "The effectiveness of MPAs is well-documented around the world, providing numerous examples of their positive impact on marine environments. Here are some compelling success stories:  "
        },
        {
            "text": "Our role in MPA management "
        },
        {
            "text": "It's MMO’s responsibility to manage fishing activities in English offshore MPAs and oversee marine non-licensable activities (which includes recreational activities such as sailing, motorboating, anchoring, diving, swimming) in inshore MPAs.  "
        },
        {
            "text": "In England we have an extensive network of MPAs, with 178 designated areas covering 51% of inshore waters and 37% of offshore waters. "
        },
        {
            "text": "Currently MMO has MPA byelaws in place protecting around 18,000 km2 off our coast from damaging fishing activity.  "
        },
        {
            "text": "References: "
        },
        {
            "text": " "
        }
    ]
}