{
    "url": "https://hodigital.blog.gov.uk/2024/08/01/debunking-5-product-management-myths/",
    "title": "Debunking 5 product management myths",
    "authors": [
        "Megha Jain, Head of Product, Networks and Infrastructure"
    ],
    "categories": [
        "Delivery",
        "Product"
    ],
    "pub_date": "2024-08-01T14:11:51+01:00",
    "content": [
        {
            "text": "Product managers define, own and solve problems related to products like software or data or any combination of software, hardware, facilities and services.  "
        },
        {
            "text": "Product management is a dynamic process where diverse skillsets come together, diving deep to understand users, customers, the market and business needs to craft innovative solutions. I see product managers as Avengers, a team of superheroes bringing unique powers (expertise) to solve problems and create something extraordinary.  "
        },
        {
            "text": "While there is a well-established understanding of product management in software development, there are quite a few myths surrounding the product-centric approach in areas like IT infrastructure and operations. "
        },
        {
            "text": "In my experience in the private sector as a software developer, business analyst, product manager, and now in the Civil Service as Head of Product in Networks and Infrastructure, I’ve seen how the agile and product-centric approach can complicate (as well as streamline) processes. "
        },
        {
            "text": "Here are some of the common myths that cloud our understanding of product management.  "
        },
        {
            "heading": 2,
            "text": "Myth 1: Product management is about sprint ceremonies or Scrum events "
        },
        {
            "text": "Many believe that product management is synonymous with agile ceremonies like daily stand-ups, backlog management and sprint planning.  "
        },
        {
            "text": "While these are important parts of a Scrum framework, they do not define product management. Our job is not confined to stand-ups and retrospectives.  "
        },
        {
            "text": "Sure, they are a piece of the puzzle, but they do not define true product management.  "
        },
        {
            "text": "True product management is about crafting a compelling vision, understanding user and customer pain points thoroughly, steering the product team towards a prioritised roadmap, and delivering a product that users adore: one that makes their lives a tiny bit easier.  "
        },
        {
            "heading": 2,
            "text": "Myth 2: Adding more features and delivering all user requests = happy users and a successful organisation "
        },
        {
            "text": "Nope! This cannot be further from the truth.  "
        },
        {
            "text": "Product management is about striking the balance between quality and the time it takes to solve user problems. It’s not about delivering quantity of features and addressing every single user request.  "
        },
        {
            "text": "Product management focuses on the crucial features that will make a real difference to your users’ and customers’ lives.  "
        },
        {
            "text": "Product managers identify these high impact features when testing and validating prototypes with users during the discovery.  "
        },
        {
            "text": "Remember: your user does not need the entire toolkit when all they really require is a spanner.  "
        },
        {
            "heading": 2,
            "text": "Myth 3: Product management is a one-person show "
        },
        {
            "text": "Absolutely not! It’s an All-Star team effort, just like the Avengers coming together to save the mission - but with fewer capes!  "
        },
        {
            "text": "Each member of the product team plays a crucial role in the success of your product. While a product manager understands the market and its users, prioritising and validating roadmap items, they cannot be expected to design the architecture and build the technical solution.  "
        },
        {
            "text": "It’s ideal when a product manager understands the technical side of the product, but they are not developers. Let them do what they do best - influencing complex sets of stakeholders with clear data and insights. "
        },
        {
            "text": "Imagine if Iron Man and Captain America had to file separate reports. It would be total chaos, right? Great products are not made by a single great superhero but by a team of great people who understand the vision and can do the challenging work to bring it to life. We do not want to be working in isolation from each other, nor in silos. "
        },
        {
            "text": "If you see a product manager trying to do absolutely everything, remind them that even Iron Man needed a little help from his friends. "
        },
        {
            "heading": 2,
            "text": "Myth 4: Customers want everything "
        },
        {
            "text": "The truth is that our customers want solutions to their problems. And they will conduct their own market research to find the solutions to those problems.   "
        },
        {
            "text": "They do not want every feature under the sun, but they do want their specific issues addressed efficiently. For example, in the Home Office in certain sensitive and risk intolerant work areas we’ve been able to consider a private cloud technology solution where the public cloud solution via Amazon Web Service (AWS) did not meet the criteria of the specific use case. "
        },
        {
            "text": "Consider your own online shopping experience. As customers, many of us will not hesitate to pay a little extra for a convenient and seamless delivery experience like that offered by Amazon Prime.  "
        },
        {
            "text": "Think of customers as Goldilocks: they do not want too much, and they do not want too little. They want it ‘just right.’  "
        },
        {
            "heading": 2,
            "text": "Myth 5: Set a product up and forget it "
        },
        {
            "text": "I am afraid not! Products need nurturing, much like pets and plants. If you neglect them, they will not thrive. Treat your products as you would your Tamagotchi: through dedicated and considered care your product will thrive. "
        },
        {
            "text": "Be prepared to show your product love by showering it with regular updates, effective communication, and continuous improvement. This keeps your product relevant for its users, customers, and your business. When we rolled out a mobile phone refresh across the Home Office we were able to offer relevant solutions to meet the business criteria, budget, and customer needs by gathering insights from over 1000 users.  "
        },
        {
            "text": "You must also be open-minded and pivot the vision of your product if there is product decline. For example, I didn’t hesitate to bring a supplier contract to an end when I saw that the Home Office wasn’t receiving value for money and users weren’t adopting the solution as we had anticipated. "
        },
        {
            "text": "I hope that by debunking these myths I’ve spotlighted more clearly what product management’s true superpower is: working with and for our customers and users, solving their day-to-day pain points and delivering products that they adore. "
        },
        {
            "text": "Product managers are innovators. Together, we want to create and manage a galaxy of amazing products for our organisations. From inception to launch and beyond, we keep products pulsing with life. So, buckle up and get ready to dive into the thrilling adventure of product lifecycles when a product manager next flies into your orbit! "
        },
        {
            "heading": 2,
            "text": "About Megha Jain"
        },
        {
            "text": "I’m Megha, a digital solutions enthusiast with a knack for turning complex problems into innovative solutions. My journey began with a Master's degree in web technologies and security, after which I launched my career as a software developer. After spending a decade in the private sector, creating mobile and web applications in an Agile Scrum environment, I took a leap into the Civil Service in the summer of 2020.  "
        }
    ]
}