{
    "url": "https://environmentagency.blog.gov.uk/2024/08/01/ensuring-nuclear-reactor-designs-meet-high-standards-of-environmental-protection/",
    "title": "Ensuring nuclear reactor designs meet high standards of environmental protection",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Nuclear",
        "Regulated industry"
    ],
    "pub_date": "2024-08-01T08:27:23+00:00",
    "content": [
        {
            "text": "The Environment Agency’s New Reactors Assessment Team is carrying out assessments of three small modular reactor nuclear power station designs. Andrew Pynn, Senior Advisor for the project, summarises what we have been doing on two of the projects and why."
        },
        {
            "text": "It’s our job (alongside Natural Resources Wales) to determine if new nuclear power station designs are environmentally acceptable for England and Wales."
        },
        {
            "text": "Our assessors and nuclear regulators have spent the past year scrutinising three designs. This week we’ve announced, alongside the Office for Nuclear Regulation (ONR), that two of these designs have progressed to the next stage of assessment. This is a huge milestone and reflects the hard work and expertise of our team as they work to ensure these designs meet our high standards for environmental protection."
        },
        {
            "text": "The importance and benefits of generic design assessment (GDA)"
        },
        {
            "text": "This is the first point at which British regulators scrutinise a design which could be deployed at sites in England and Wales."
        },
        {
            "text": "One of the benefits of GDA is that it can reduce the overall time for deployment of a design at more than one site by assessing generic aspects only once and before site specific proposals come forward. It allows us to assess environmental protection and radioactive waste management matters early when there is greater opportunity to influence the design. It helps ensure that proposals for a new nuclear power station at a specific site should be better developed and meet our regulatory requirements and expectations."
        },
        {
            "text": "Another benefit of GDA are the efficiencies of doing a joint assessment with the ONR who assess safety, security and safeguards arrangements."
        },
        {
            "text": "The stages of GDA"
        },
        {
            "text": "Step 1 – usually takes around a year – this is where we set up the project with the design company, agree the scope and agree what information we need to see. Crucially, our assessors also learn about the design and offer advice to the company to assist them in preparing for the assessment."
        },
        {
            "text": "Step 2 – usually takes around a year – here we assess the fundamentals of the design – have they got the basics of the design right, what’s missing? What are the intended functions of key systems? We’ll focus on features of the design which protect the environment including how the design can be optimised to reduce the amount of radioactive waste produced and how that waste is managed and disposed of."
        },
        {
            "text": "Here we scrutinise more detailed information from the company and if we’re concerned about something we’ll raise these with the company through a formal process – an issue, observation or query."
        },
        {
            "text": "Step 3 – usually takes around two years. This is where we look at the design in greater detail to ensure that it is sufficient to meet the key objectives and intended environmental protection functions. We ensure that that the design uses best available techniques to ensure that the radiation exposure of people and the environment are minimised and within statutory limits and guidelines, and that other environmental impacts are minimised"
        },
        {
            "text": "Improving how we work"
        },
        {
            "text": "The schedule for a GDA is agreed between the design company and the regulators; a full three-step GDA typically takes up to around four years to complete. We regularly review our processes to ensure that they are as efficient as possible while ensuring that the quality of the assessment is not compromised. High quality evidence submissions from the designer, and a mature design with operating experience will help keep the overall duration shorter."
        },
        {
            "text": "We work closely with the design company on their overall plans to develop and deploy a power station to ensure that our work in GDA does not cause delays to any plans to deploy the design."
        },
        {
            "text": "We will also work with international regulators for any designs that have been through a design assessment process overseas. We do this to explore opportunities to use their information or their assessment outcomes to speed up our processes."
        },
        {
            "text": "In 2019 we modernised the GDA process, using learning from previous assessments. We made it more flexible to help with the assessment of small modular reactors and less mature designs and introduced the option to stop after two steps."
        },
        {
            "text": "In 2023 we revised the guidance again to take account of recent learning and to strengthen sustainability and disposability of waste considerations."
        },
        {
            "text": "Environment Agency staff attend the nuclear hackathon"
        },
        {
            "text": "As part of the government’s Civil Nuclear Roadmap developments we supported DESNZ’s event in April (“Hackathon”) to explore and listen to views from stakeholders on the regulatory framework and its potential for further streamlining. We’re committed to building our capability and to ensure our processes are effective and efficient for the future."
        },
        {
            "text": "We’ve also just published new joint regulatory guidance for developers and designers of new nuclear power stations seeking early engagement prior to entering generic design assessment or permitting. This is an opportunity for applicants to meet with us to help develop their understanding of regulatory processes and requirements and to allow us to advise them on how to be ready to enter the regulatory process."
        },
        {
            "text": "The next GDA?"
        },
        {
            "text": "We’re currently assessing designs from three companies. And we’ve already completed four assessments – the UK EPR from France, the AP1000 from the USA, the UK ABWR from Japan and the UK HPR1000 from China."
        },
        {
            "text": "It’s been announced that Westinghouse has applied to DESNZ for its AP300 small modular reactor design and we’re waiting to hear whether we will be asked to carry out a GDA on that from the new Secretary of State."
        },
        {
            "text": "It’s likely that other companies will also submit requests to DESNZ asking to enter the GDA process."
        },
        {
            "text": "As our work expands there is increasing demand on our resources – and with that in mind, we’ll be launching another recruitment campaign this autumn."
        },
        {
            "text": "Working with communities and stakeholders"
        },
        {
            "text": "We’re always listening to local communities and our national stakeholders – and this includes the public, nuclear industry, retired nuclear engineers and scientists with valuable knowledge, research scientists and academics."
        },
        {
            "text": "Openness and transparency are important to us and is embedded in our ways of working, particularly when making decisions about nuclear power stations and the environment."
        },
        {
            "text": "If these designs are taken forward by developers in the future, we’ll explain our GDA work to the local community to help them understand our roles, processes, technical issues and our views."
        },
        {
            "text": "During a three-step GDA such as the Rolls-Royce SMR GDA, we’ll run a public consultation on our preliminary view of the design during Step 3. This could involve local engagement if the design has a site for deployment identified at that point."
        },
        {
            "text": "For a two-step GDA such as the Holtec Britain SMR GDA, there isn’t a consultation, so we’ll engage and consult with our stakeholders during environmental permitting. If a company wants to operate a nuclear power station it will need to apply to us for permits for radioactive substances, water discharge and combustion activities."
        },
        {
            "text": "Tell us what you think about the designs"
        },
        {
            "text": "You don’t have to wait for a consultation to share your views with us. Anyone can look at information about the design and ask a question and submit a comment through the GDA public comments process. Rolls-Royce SMR Limited set up the comments website in April 2023 and it’s already had 36 comments. Holtec Britain Limited launched its comments process this week. The regulators will see all your questions, comments and the answers from the company. We’ll consider relevant comments as part of our assessment."
        },
        {
            "text": "Contact us"
        },
        {
            "text": "nuclear@environment-agency.gov.uk"
        },
        {
            "text": "Previous blogs about GDA"
        },
        {
            "text": "Taking the Rolls-Royce Small Modular Reactor (SMR) to the next step – Creating a better place (blog.gov.uk)"
        },
        {
            "text": "Enabling nuclear regulation for a net zero future – Creating a better place (blog.gov.uk)"
        },
        {
            "text": "Why we’ve approved Hitachi-GE’s reactor design – Creating a better place (blog.gov.uk)"
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}