{
    "url": "https://mhclgmedia.blog.gov.uk/2024/08/01/expert-taskforce-to-be-at-the-forefront-of-new-towns-vision/",
    "title": "Expert taskforce to be at the forefront of new towns vision",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Housing"
    ],
    "pub_date": "2024-08-01T13:35:19+01:00",
    "content": [
        {
            "text": "This week the Deputy Prime Minister set out the Government’s plans for New Towns."
        },
        {
            "text": "There has been extensive national and regional coverage about this, including The Guardian, Sky News, The Independent, Manchester Evening News, and Yorkshire Post."
        },
        {
            "text": "The Housing Minister spoke to Times Radio, Sky News, BBC Breakfast, Today Programme, LBC, Good Morning Britain and GB News."
        },
        {
            "text": "The Deputy Prime Minister wrote for The Daily Telegraph about creating largescale communities of least 10,000 new homes each as well as extensions to and the regeneration of existing towns. She further said these new towns will prioritise more social rent and affordable homes, with a gold standard aim of 40 per cent."
        },
        {
            "text": "During a visit to Stevenage, the Housing Minister told I News outlined how some of the New Towns will make a significant contribution to the Government’s 1.5 million homes target. The Minister also spoke to BBC Look East as part of the visit."
        },
        {
            "text": "Speaking at the visit in Stevenage yesterday, Housing Minister Matthew Pennycook said: "
        },
        {
            "text": "“What we’ve got to take forward more than anything is the ambition of the post-war New Towns programme. The most transformational and ambitious housebuilding programme the UK has had. We need to support, regenerate and improve our existing, performing New Towns and we’ve got to bring forward that next generation of towns."
        },
        {
            "text": "“And that’s what the Taskforce announced today is the first step towards so Sir Michael and the members of his Taskforce will identify suitable locations across the grey belt for largescale new settlements.”"
        }
    ]
}