{
    "url": "https://gds.blog.gov.uk/2024/08/01/more-than-you-think-how-we-organise-design-system-day/",
    "title": "More than you think - how we organise Design System Day",
    "authors": [
        "Kam Nijjar, Associate Delivery Manager, Government Digital Service"
    ],
    "categories": [
        "Digital Service Platforms",
        "Service design"
    ],
    "pub_date": "2024-08-01T09:57:17+01:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "Since 2021 the GOV.UK Design System team has held an annual event showcasing how our thriving community works together across the breadth of all things design system."
        },
        {
            "text": "Whilst we're not professional event organisers, we have learned a lot from each of the events we've organised over the last 3 years."
        },
        {
            "text": "It involves a lot of work behind the scenes, but it's the happy place for people like myself, as a delivery manager. Here's what preparation is like for us as we move closer to Design System Day in Liverpool on 5 September."
        },
        {
            "heading": 2,
            "text": "The design system community"
        },
        {
            "text": "The GOV.UK Design System has a strong community sitting behind it. It brings together the latest research, design and development from across the government (and beyond) to make sure it's representative and relevant for its users. It's this community ethos that we bring to our Design System Day events."
        },
        {
            "text": "The first Design System Day in 2021 was online, with 150 people attending. It focused on design systems learning and how a design system is run behind the scenes."
        },
        {
            "text": "Since then we've strived to do something different, bigger and better every year."
        },
        {
            "text": "This year we're running 3 events throughout the year including an in-person event in Liverpool on 5 September."
        },
        {
            "heading": 2,
            "text": "What organising a Design System Day really involves"
        },
        {
            "text": "When I joined the team in 2023, the event was well into the planning stage and close to happening. As a delivery manager, I helped facilitate the organising group meetings to ensure all tasks were on track, looked at potential blockers with fresh eyes and recruited extra support. In a departure from my day job, I also made sure suppliers and speakers were paid on time, which was a bigger challenge than I expected."
        },
        {
            "text": "This year's event planning has involved the Community Designer, Senior Product Manager and Senior Delivery Manager. Together we started to think about what and how we could deliver the event with a limited budget."
        },
        {
            "text": "The result is we opted to run 3 - yes, 3 events - in 2024, both online and in-person. The first online event was hosted on 2 May 2024 with around 500 people coming together in a follow up to the in-person Design System Day 2023."
        },
        {
            "text": "The second in-person event is on 5 September 2024 in Liverpool, and the third-and-final online event is on 5 November 2024."
        },
        {
            "text": "For each event, we have to consider:"
        },
        {
            "heading": 2,
            "text": "Design System Day comes to Liverpool in 2024"
        },
        {
            "text": "For the in-person event, we wanted a venue that was central and accessible, for up to 300 guests. We also wanted breakout rooms, catering options, easy transport links and most of all it had to be within the tight budget."
        },
        {
            "text": "Researching 26 venues, from London to Cardiff to Leeds and beyond, we found St George's Hall in Liverpool to be the best venue."
        },
        {
            "text": "Sustainable travel options were important for a group of people spread across the country. We considered planes, trains and automobiles (or rather a mini-coach in our case). It does sound like a film! In the end we found train to be the best option for our needs."
        },
        {
            "text": "For me, my day job as a delivery manager still continues and I'm running team meetings, stand-ups and weekly check-ins with team leads on top of my regular workload. It makes for a very busy summer period!"
        },
        {
            "heading": 2,
            "text": "Design System Day 2024"
        },
        {
            "text": "This year our theme is 'Unsung Heroes of the Design System'. We're looking at people who help keep the design system running without being noticed."
        },
        {
            "text": "It has been encouraging to see all the hard work that goes into designing and preparing community events. Every detail has been well thought out to make sure that the events are inclusive, interesting, value for money and we continue to grow the GOV.UK Design System community."
        },
        {
            "text": "Slides, notes and recordings from Design System Day 2022 and Design System Day 2023."
        },
        {
            "heading": 2,
            "text": "Up next"
        },
        {
            "text": "If you have any questions about the Design System community or our events, either add a comment to this blog post, sign up for our mailing list to find out when we announce new events, workshops and ask for help from our community."
        },
        {
            "text": "Finally, look out for our final batch of tickets for Design System Day 2024 that will be available on Eventbrite at 10.30am today. We'd love to have you join us in Liverpool on 5 September as we discuss all things Design System."
        }
    ]
}