{
    "url": "https://actuaries.blog.gov.uk/2024/08/01/working-with-the-zambia-workers-compensation-fund/",
    "title": "Working with the Zambia Workers' Compensation Fund",
    "authors": [
        "Ben Cooper - Junior Trainee Actuary"
    ],
    "categories": [
        "Actuary",
        "Analysis",
        "Insurance",
        "Mortality"
    ],
    "pub_date": "2024-08-01T16:13:11+01:00",
    "content": [
        {
            "text": "One of my first projects at the Government Actuary’s Department (GAD) was an actuarial valuation of the Zambia Workers’ Compensation Fund (WCF)."
        },
        {
            "text": "In this blog post, I discuss what the Zambia WCF is, the work I was involved in and what I personally took away from this project."
        },
        {
            "heading": 2,
            "text": "Supports workers"
        },
        {
            "text": "The Zambia WCF is a social security programme designed to provide financial support to people who suffer accidents or contract diseases at work."
        },
        {
            "text": "The Fund was created in 1999 as a result of the Workers’ Compensation Act. This aimed to integrate the pre-existing Workers’ Compensation Board and the Pneumoconiosis Compensation Cap."
        },
        {
            "text": "Many countries around the world have similar schemes and the WCF is a key part of the social security of workers in Zambia. The workforce in Zambia is engaged in a diverse range of industries with a variety of risks to workers’ health which are managed by the WCF. Industries include agriculture, banking and finance, construction, mining, professional services, trading and commerce."
        },
        {
            "heading": 2,
            "text": "GAD’s role"
        },
        {
            "text": "Since 2014, GAD has provided an actuarial valuation of the Fund every 3 years. For the 2022 valuation, this exercise included:"
        },
        {
            "heading": 2,
            "text": "Personal development"
        },
        {
            "text": "Many of the skills I have developed working on this project have wider applicability and I am now using those skills on other projects in GAD. These skills include:"
        },
        {
            "heading": 3,
            "text": "1. More extensive actuarial knowledge"
        },
        {
            "text": "This project provided me a great opportunity to develop the breadth of my understanding of actuarial work."
        },
        {
            "text": "I was involved in every step of the valuation. This included analysing the data which the Zambia WCF provided, drafting the final valuation report, and presenting our findings to the WCF Board."
        },
        {
            "text": "My favourite part of the project was deriving implied mortality rates from the experience of the Fund over the inter-valuation period. The mortality rate is defined as the number of people who die each year per 100,000 of the population, split by categories such as age and sex. I used this analysis to critically consider how to set our mortality assumptions for the Fund."
        },
        {
            "text": "These demographic assumptions are important as they directly determine the size of the Fund’s liabilities. It was great to see graphs and figures I had produced, being used in reports sent to the Zambia WCF."
        },
        {
            "text": "I also enjoyed the exposure to reserving triangles. Reserving triangles allow us to understand how long it takes an accident to be reported (without needing to get a geometry set out!) In turn, this helps us determine the number of claims that have occurred but had not yet been reported to the WCF."
        },
        {
            "heading": 3,
            "text": "2. Project delivery responsibilities"
        },
        {
            "text": "Working on any project, it is important not only to produce high quality work but also to deliver to deadlines. Being trusted with supporting the management of the project gave me a chance to appreciate what delivering projects means in the context of the professional world."
        },
        {
            "text": "I was responsible for tracking the project milestones and notifying senior actuaries of the progress being made."
        },
        {
            "text": "Moving onto new projects, this has helped me realise that efficient processes, flexibility and communication allow the most value to be delivered to the client."
        },
        {
            "text": "The more effectively GAD can utilise resources at its disposal to deliver output, the greater opportunity GAD has in which to showcase our capabilities to our clients. This can help GAD make a more tailored difference to social security programmes both in the UK and overseas."
        },
        {
            "heading": 3,
            "text": "3. Adaptability to different projects"
        },
        {
            "text": "Working on a social security programme was different in nature to the insurance work and cashflow projections I had worked on at GAD up to that point."
        },
        {
            "text": "Coming out of this project, I felt a lot more confident in my ability to:"
        },
        {
            "text": "This project was challenging at times. However, I learnt how to be proactive in tackling issues and the importance of trusting colleagues to produce work everyone can be proud of."
        },
        {
            "text": "Disclaimer"
        },
        {
            "text": "The opinions in this blog post are not intended to provide specific advice. For our full disclaimer, please see the About this blog page."
        }
    ]
}