{
    "url": "https://digitaltrade.blog.gov.uk/2022/04/05/from-mumsnet-to-government-my-journey-to-senior-content-designer-at-dit/",
    "title": "From Mumsnet to government: my journey to Senior Content Designer at DIT",
    "authors": [
        "Stella Dalzell, Senior Content Designer"
    ],
    "categories": [
        "Careers",
        "Content",
        "Digital Services",
        "People and Skills"
    ],
    "pub_date": "2022-04-05T12:01:12+01:00",
    "content": [
        {
            "text": "My path to joining the Digital, Data and Technology (DDaT) Content Design team at the Department for International Trade (DIT) began in the private sector. I spent a couple of years growing my content skills at Mumsnet, a parenting website. I worked closely with other digital disciplines, including developers and User Experience (UX) designers. I also worked with external brands, resolving tensions between brand dominance and the tone and style of the website."
        },
        {
            "text": "These experiences helped me grow a combination of strong problem-solving and stakeholder management skills, setting me up well for a Civil Service Content Designer role. Following a simple application and one interview, I entered as a Content Designer at Higher Executive Officer (HEO) level, with no explicit experience in ‘Content Design’ or working in government. Two years later, I am a Senior Content Designer at Senior Executive Officer (SEO) level."
        },
        {
            "heading": 2,
            "text": "Career progression in Content Design"
        },
        {
            "text": "I now lead a Content Design Live Services team, managing updates to multiple platforms, prioritising work and evaluating what we do. My line manager, also originally from the private sector, has just moved up a job grade, and so has their line manager on an interim promotion."
        },
        {
            "text": "In addition, progression is possible without having to change roles at DIT. The DDaT team at DIT is signed up to the capability pay framework attached to the DDaT Profession Capability Framework. This means that there is a sliding pay scale based on your skills, alongside a clear and supportive structure for self-development."
        },
        {
            "text": "Opportunities to progress, up or across, permanent or temporary, are all very possible if you have the right skills. Check out our blog on the different ways to continue your professional development at DIT."
        },
        {
            "heading": 2,
            "text": "Content Design at DIT"
        },
        {
            "text": "The nature of Content Design work at DIT is complex, varied, and exciting. I was motivated to join the department by the range of services that DIT provides for exporters, investors and importers. The scope of the work across both GOV.UK web pages and digital products, and the opportunity to pursue more strategic roles at higher grades, also appealed to me. I’ve also had the chance to be involved in the delivery of projects at the heart of government, such as the publication of the UK’s new free trade agreements."
        },
        {
            "text": "Beyond the Content Design team, DIT’s line manager community empowers me to grow in my leadership role, with training opportunities and get-togethers to work through any challenges. With this support, I eagerly look ahead to future prospects. DIT offers such a variety of opportunities."
        },
        {
            "heading": 2,
            "text": "Part of the User-Centred Design Community"
        },
        {
            "text": "In DDaT, we work in multi-disciplinary teams on digital products, ensuring our profession has a voice in their design. Content Design is an equal partner in DIT’s User-Centred Design Professional Community, which also includes User Research and Visual and Interaction Design. Across DIT, we work with a wide range of colleagues from Policy, Strategic Communications, Marketing and Performance Analysis, which is great for networking."
        },
        {
            "heading": 2,
            "text": "Working across government"
        },
        {
            "text": "Participation in cross-government communities is encouraged, providing support from other departments’ perspectives. The UK’s Government Digital Service (GDS) is renowned worldwide for developing the Content Design discipline as a critical step in the design process. I am proud to be a part of that tradition and to draw on that wealth of experience."
        },
        {
            "text": "Finally, DIT is still quite a new department, only created after the UK voted to leave the European Union in 2016. This makes for a great mix of differing backgrounds and ideas, and we are not held back by legacy digital services. It also means that many people here are new to the department or to government, just as I was two years ago!"
        }
    ]
}