{
    "url": "https://charitycommission.blog.gov.uk/2022/04/05/help-us-gather-better-data-on-charities/",
    "title": "Help us gather better data on charities",
    "authors": [
        "Helen Stephenson"
    ],
    "categories": [
        "Data",
        "register"
    ],
    "pub_date": "2022-04-05T10:35:27+01:00",
    "content": [
        {
            "heading": 2,
            "text": "Can you help us test new ways of classifying charities?"
        },
        {
            "text": "In my recent blog, I set out why data – the information we gather and how we use and make it available – is a central theme of our work in the months and years ahead."
        },
        {
            "text": "Now I’m asking for your help with an early, important set of changes, which will impact each of the 170,000 charities on the charity register in England and Wales."
        },
        {
            "heading": 2,
            "text": "How do you do (and for whom)"
        },
        {
            "text": "We are improving the way we ask trustees to ‘classify’ their charities on the online register."
        },
        {
            "text": "These are the categories that explain how you fulfil your purposes, and who you help."
        },
        {
            "text": "The data we currently gather in this area is vague. For example, around half of all registered charities have educational purposes, but we cannot say how many of those run schools for example, or are pre-school providers, or research institutes, or vocational training centres."
        },
        {
            "text": "More specific information about the sort of charity we are dealing with will mean the Commission can provide better and more relevant support to the trustees. We will be able to ensure that you receive updates that are most helpful for the type of activity the charity does, and that this comes at the right time. Part of this improvement will come from increasing our ability to assess the risks facing different sub-categories of charities. For example, if we become aware that certain types of organisations are being targeted by cyber criminals, more accurate data will allow us to alert them directly, and quickly."
        },
        {
            "text": "We know from working with our partners at the Department for Digital, Culture, Media and Sport on this project that better data would also inform policy making at a national and local level. It will improve the quality of research and make it easier for charities and funders to find each other and work together. We also want to enable the public to make more confident, well informed choices about which charities to support."
        },
        {
            "text": "Of course, data security remains a critical feature of this research and our ambitions going forward. In all the data we gather, store and use, we are mindful of and will comply with data protection and privacy legislation."
        },
        {
            "heading": 2,
            "text": "Involving charities"
        },
        {
            "text": "It’s important we arrive at the right categories and descriptors (or ‘codes’) that will result in data that is specific, and measurable over time, without overburdening charities in the process."
        },
        {
            "text": "So, we have consulted with charity sector bodies and representative groups in different sub-sectors on draft proposals. The overwhelming response has been positive about the principles, but we’ve also received useful constructive feedback on the codes, which you can see on GOV.UK."
        },
        {
            "text": "Feedback suggested that our language in some places was no longer representative, and has been updated. For example, we have removed the category of ‘overseas aid / famine’ and replaced it with ‘international development / humanitarian aid’ to reflect this."
        },
        {
            "heading": 2,
            "text": "Help us user test the system"
        },
        {
            "text": "But we want to hear from more ‘grassroots’ charities – from the people who will be providing the information and using the new system once it is up and running."
        },
        {
            "text": "They are best placed to tell us whether the new codes are clear, and the system user friendly."
        },
        {
            "text": "We are inviting you to take part in ‘user testing’ until the end of May to help us spot problems, or gaps in our proposals."
        },
        {
            "text": "If you would like to take part, please email us on  UserResearchTeam@charitycommission.gov.uk. The team will be able to provide more information about how to be involved, as well as take into account any accessibility needs."
        },
        {
            "heading": 2,
            "text": "Support from ministers"
        },
        {
            "text": "We’re grateful for the support and backing we have received for this work from the Department of Digital, Culture, Media and Sport."
        },
        {
            "heading": 3,
            "text": "Minister for Civil Society and Youth Nigel Huddleston said:"
        },
        {
            "text": " “We know that data holds great potential to empower people across the charity sector and ensure our efforts are properly targeted in the places that need them most. "
        },
        {
            "text": " “We welcome and encourage the work the Charity Commission is doing in this area and urge all charities to take part in the classification process to ensure their valuable work is properly reflected.”"
        },
        {
            "heading": 2,
            "text": "Next steps"
        },
        {
            "text": "Once the user testing has completed towards the end of April, we will refine our plans, before launching the new online forms over the next year."
        },
        {
            "text": "We hope that over the months ahead, the new data will help shine a clearer light on the work, and impact, of charities the length and breadth of the country."
        },
        {
            "text": " "
        }
    ]
}