{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2022/04/05/how-do-you-spell-you-discovering-dyslexia-and-the-power-of-having-mentor/",
    "title": "How do you spell “you”?  Discovering dyslexia and the power of having mentor",
    "authors": [
        "Selina Khan"
    ],
    "categories": [
        "Diversity & Inclusion",
        "Role Model Series"
    ],
    "pub_date": "2022-04-05T21:37:36+01:00",
    "content": [
        {
            "text": "How do you spell “you”?  Discovering dyslexia and the power of having mentor\n\nNigel Barraclough, Government Science & Engineering (GSE) member and civil servant for over 20 years, writes about his experience managing dyslexia and how having a mentor made a significant difference."
        },
        {
            "text": "I wanted to change roles and to use and develop my GSE skills in another post.  I thought my competency examples were good and when I mentioned them to others they thought so too.  However, applications for other roles failed and I seemed to have hit a glass wall – I could see where I wanted to go but could not see what was stopping me."
        },
        {
            "text": "So, I found myself a mentor and showed him my examples."
        },
        {
            "text": "He asked “Did you read these before sending them to me?”, “Yes” I replied."
        },
        {
            "text": "But they were full of errors, basic errors - even though I had spell checked and re-read it and re-read it several times."
        },
        {
            "text": "He encouraged me to see if I was dyslexic and I found that I am – all be it mildly so.  I was surprised because I have written guidance documents and manuals, but it also explained some real horror stories of work I had done incredibly badly (I now wince at the thought of how bad they were!)."
        },
        {
            "text": "Incidentally my mentor did not have dyslexia but he knew the right approach, the right questions and how to help."
        },
        {
            "text": "I also had some coaching by someone who explained to me how someone with dyslexia may think and how we visualise things – for me what they said rang true.  Apparently, we, as dyslexics, tend to see the “whole” quite easily meaning we can see a finished article (useful) but tend to try and read a large paragraph in one chunk and not as a sequence of individual words or lines (very unhelpful)."
        },
        {
            "text": "In my current job I have prepared a poster about ECJU for the GSE conference in May using coloured boxes to break up the text and separate the case studies used to explain our work.  Someone asked, “where did you learn how to do it that way – it is much easier to read and take in?”.  I hadn’t, I just find it easier that way and it is how I think."
        },
        {
            "text": "Someone else who was watching me use the reading bar facility provided by the Read-Write software to help read a large and very technical document, asked me to show him how it worked and explain why I use it; he is not dyslexic at all but was sufficiently impressed that he tried to get it for himself."
        },
        {
            "text": "Some days are worse than others.  I also have a chronic condition akin to arthritis which can be painful and/or very tiring, being tired tends to make the dyslexia worse.   I know what can be difficult: some fonts especially if they are very small, reading some units eg nm or mm."
        },
        {
            "text": "Having a coach and a mentor helped me find little tricks, like using coloured backgrounds, breaking text up and getting the right font and colour - pink and blue are good for me, in Arial size 12. Tools like Read-Write also help.  Now I find myself in an interesting GSE role which I enjoy and (compared to some previous jobs) where the dyslexia can be more easily managed so that it doesn’t have such an impact."
        },
        {
            "text": "What is the significance of “you”? For me some words, even very simple ones like “you” are just plain awkward to spell and I almost always get them wrong!"
        },
        {
            "text": " "
        },
        {
            "text": "A plug for mentees, mentors and the neurodiversity networks."
        },
        {
            "text": "This blog has been about mentoring and dyslexia. In my case having a mentor certainly made a difference!  If possible, have a specific objective or tasks based on the outcomes you want to achieve through the arrangement.    Also be prepared for the fact that, sometimes, you might not like what the mentor says – even if you realise later that it was “good advice”!"
        },
        {
            "text": "As a mentor you need to be someone who will listen and give encouragement but also honest clear advice.  I have enjoyed being a mentor and have certainly learnt from my mentees – being one is very worthwhile."
        },
        {
            "text": "A plug for the Neurodiversity networks.  They promote the importance of neurodiversity and do a lot of “unsung” work on our behalf; they are also a useful means of knowing what is going on and (if needed) what support is available."
        },
        {
            "text": " "
        },
        {
            "text": "Who am I?"
        },
        {
            "text": "A Civil Servant for 20 years I have had various roles based largely on environmental protection policy – particularly industrial pollution control."
        },
        {
            "text": "Now I work in the Technical Assessment Unit of the Export Control Joint Unit (ECJU) in the Department for International Trade.  All of us in TAU have science and engineering backgrounds which we use to deliver technical advice on proposed exports of military and dual use goods for a wide range of technologies."
        },
        {
            "text": "I am a mentor and Mental Health First Aider with a special focus of working with people who have dyslexia. I am also a member of the Neurodiversity Network."
        },
        {
            "text": " "
        },
        {
            "text": "Nigel Barraclough\nTechnical Assessment Unit\nExport Control Joint Unit\nDept International Trade"
        }
    ]
}