{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2022/04/05/who-will-be-your-gse-winners-cast-your-vote-now/",
    "title": "Who will be your GSE winners? Cast your vote now!",
    "authors": [
        "Selina Khan"
    ],
    "categories": [
        "GSE Offer",
        "GSE Profession Updates"
    ],
    "pub_date": "2022-04-05T21:29:49+01:00",
    "content": [
        {
            "text": "Who will be your GSE winners? Cast your vote now! "
        },
        {
            "text": "The Government Science and Engineering (GSE) Profession Conference will be happening on 9 May at the London Science Museum. It will bring together decision-makers, scientists, and engineers from across government to share experiences, engage with other professionals and celebrate the scientific & engineering community. During this one-day, hybrid event attendees will be able to interact in a number of sessions including showcasing research within government."
        },
        {
            "text": "Members from across the Profession have already submitted posters to be presented at the conference and they were highlighted in the GSE March 2022 Newsletter. These fantastic posters allow members to share their latest work across the profession and give them an opportunity to connect and network with colleagues. They are also very important in demonstrating the incredible range of topics GSE members are working on - from antibiotic resistance and building nuclear-powered submarines to battery safety and machine learning in flood forecasting. We hope you’ll appreciate the incredible breadth of the profession, the expertise the profession offers, and the benefits of our work to society."
        },
        {
            "text": "Please support your fellow GSE colleagues by using the voting form to vote for your top poster in each of the three categories – ‘Achieving impact’, ‘Engineering’ and ‘Science’.  To access the poster booklet members should use the link shared in the GSE March 2022 Newsletter, or contact gse@go-science.gov.uk for a hard copy/link."
        },
        {
            "text": "The closing date for your entries is Thursday 21 April. The winner of each category will receive a £25 gift voucher, and will be announced at the closing session of the conference."
        },
        {
            "text": "If you are interested in attending the conference and would like to secure your place, registration for in-person and virtual attendance are available here, for GSE members only (become a member by completing this form). You must sign up using your government email address. All tickets registered to a personal email will be refunded."
        }
    ]
}