{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2025/06/23/international-women-in-engineering-day-2025/",
    "title": "International Women in Engineering Day 2025",
    "authors": [
        "gseprofession"
    ],
    "categories": [
        "Blog Series",
        "Diversity & Inclusion",
        "Role Model Series"
    ],
    "pub_date": "2025-06-23T12:32:23+01:00",
    "content": [
        {
            "text": "Together we engineer: Recognising the impact and leadership of women within engineering "
        },
        {
            "text": "Each year, International Women in Engineering Day provides an opportunity to recognise the vital contributions women make to engineering across the UK and beyond. It is a moment to reflect on the progress made, acknowledge the challenges that remain, and celebrate the individuals whose work is shaping a more innovative future."
        },
        {
            "text": "In 2025, we are proud to highlight the achievements of two women connected to engineering whose leadership and expertise are advancing national priorities in completely different ways. The theme for this year is ‘Together we engineer’."
        },
        {
            "text": "Engineering change by Chi Onwurah, Chair of the House of Commons Science, Innovation and Technology Select Committee"
        },
        {
            "text": "On International Women in Engineering Day, I’m reflecting on my own journey that began in Newcastle, where I was a curious girl who loved maths and wanted to understand how the world worked. I never imagined I’d one day chair Parliament’s Science, Innovation and Technology Select Committee."
        },
        {
            "text": "Certainly not when I entered Imperial College London in 1984 and found an atmosphere which could best be described as a boy's public school debating society. I was told I was part of an advance guard of what would soon be an army of female engineers, that engineering would become increasingly gender balanced. It didn’t quite work out that way."
        },
        {
            "text": "I had a great career as an Engineer, working all over the world, designing the world’s first double sided surface mount PABX (private automatic branch exchange) board, and building Nigeria’s first mobile phone network. But as a working engineer, I was so often the only woman, the only person of colour, the only working-class person, the only Northerner in the room."
        },
        {
            "text": "Now, in Parliament and in my role as Chair, I want to ensure that exciting careers in science and innovation are accessible for everyone. That means asking tough questions, championing diversity and making sure government policy is grounded in evidence and ambition."
        },
        {
            "text": "We face enormous challenges - climate change, AI, health - but also incredible opportunities. We need more women in engineering - not just to balance the numbers, but because diverse perspectives lead to better solutions. Diversity does matter. It is not a tick box exercise. It is an economic imperative. Without it, innovation is stifled, and valuable talent is excluded from the workforce. On this day, I celebrate the women who are breaking barriers, building futures, and engineering change."
        },
        {
            "text": "Let’s keep pushing forward."
        },
        {
            "text": "Reflections on a career in engineering – by Caryl Russell, MOD"
        },
        {
            "text": "As we come up to the International Women in Engineering Day, I reflect on my career and how a choice made to do engineering at university, because I did not know what else to do, has become a lifelong career of 32 and a half years as a civil servant in the Ministry of Defence."
        },
        {
            "text": "I started my career as an 18-year-old at the Royal Naval Engineering College Manadon in Plymouth. I was lucky enough to have been accepted for an undergraduate sponsorship by the Civil Service for the Ministry of Defence. This included a year at Manadon to learn about the Royal Navy, before going to university to study Naval Architecture. Having studied Maths, Physics, Chemistry and Further Maths at A Levels, I was used to being in a minority, but this was a new level. I was just one of three women in groups of 30 civilian student engineers and in the whole college there were about 15 women out of 400 Royal Navy trainee engineers. It made being a minority even more extreme, everything you did stood out and was noticed, for good or for bad. For me this was a motivator, it made me push forward to do my best, to build networks and to ensure that I stood out for good reasons. "
        },
        {
            "text": "Fast forward 30 years, and my career has taken me to do many different roles within the Ministry of Defence. These included core engineering roles, an operational deployment with the Army, a private office role, a project management role for the building of new submarines and now running a team of approximately 100 to provide logistics and engineering support to the Royal Navy’s submarines.  I have used the contacts I made at age 18 to help develop my career; and whilst engineering has been the heart of my career, I have used the logical approach to problem solving, that is to me at the heart of engineering, and a drive to make things better, to help me do numerous non-engineering roles."
        },
        {
            "text": "In all of these roles the most important factor in success, or failure, has been the goodness of the team in which I have worked. Teams where everyone whatever their profession, their background or their challenges can be themselves at work and focus their efforts on delivering, always gives a better result. This only happens when people see past gender (and other characteristics) to respect others’ knowledge, experience or alternative point of view so that ‘Together we engineer’ and deliver the outcome those that depend on us, be that the public, the armed forces, or our own families and friends, need and deserve."
        },
        {
            "text": "As we mark International Women in Engineering Day 2025, let’s continue to amplify the voices of female engineers. Their stories remind us that engineering is not only about solving technical problems, but also about shaping a future that is inclusive to the needs of all. By championing diversity and supporting the next generation of talent, we can ensure that engineering continues to benefit from a full range of perspectives."
        }
    ]
}