{
    "url": "https://cspl.blog.gov.uk/2025/06/23/the-nolan-principles-at-30/",
    "title": "The Nolan Principles at 30",
    "authors": [
        "Doug Chalmers"
    ],
    "categories": [
        "30th Anniversary",
        "Nolan Principles"
    ],
    "pub_date": "2025-06-23T15:28:46+01:00",
    "content": [
        {
            "text": "Last week’s conference on the ‘Nolan Principles at 30’ at the Institute for Government brought together experts, politicians and academics to discuss the importance of maintaining high standards across our public life."
        },
        {
            "text": "It was an opportunity to hear from Sir John Major, who, as Prime Minister, established the Committee in 1994, those leading standards work in the House of Commons, and those on the front line of public services about where they see the challenges and future of ethical standards. "
        },
        {
            "text": "Many participants talked about the fragile state of public trust in politics, the complexity of public sector decision making and the wider societal changes that pose major challenges to our institutions. The conference also highlighted the deep tradition of public service that exists in this country and how high standards can act as an enabler, helping demonstrate that the way in which decisions - however unpopular – are made in their interest. And how being open and honest about the trade offs can build, rather than erode, trust."
        },
        {
            "text": "We also heard about the importance of building wider, cross-party agreement on standards and how weaponisation of the standards system for short term political gain is damaging to the perception of standards more widely."
        },
        {
            "text": "The breadth and depth of the discussion – hearing about the challenges of ethical leadership for frontline officials in policing and health, for parliamentarians and regulators – demonstrated how important it is to keep on discussing while reinforcing the need for high standards. Although they are in nearly every code of conduct in public life, to be meaningful the Nolan Principles – honesty, integrity, selflessness, openness, objectivity, accountability and leadership - must be firmly embedded in the culture and norms of all public sector organisations. This takes the allocation of time and constant effort. It’s hard work."
        },
        {
            "text": "The conference confirmed that high standards matter. They are a public good. As well as maintaining trust in those taking decisions on their behalf, they are important for the economic stability of our nation and for our standing internationally. For the standards system to work effectively, regulatory bodies must be independent, able to scrutinise and adjudicate without fear or favour and – where necessary - there must be a range of sanctions for failures and breaches. Regulation must also be proportionate and fair. "
        },
        {
            "text": "The Committee’s work, using its evidence-based approach to make recommendations for change, has played a major part in developing the standards landscape we have today. We rely on the experience and expertise of the regulators, think tanks, parliamentarians and practitioners – many of whom were part of the conference – to help make the case for high standards."
        },
        {
            "text": "These are important discussions, and we need to have them regularly. Just as leaders across the public sector need to make space to talk about standards and ethics with their staff . As we wait to hear more from the government on its plans for a statutory Ethics and Integrity Commission, one thing is clear - Lord Nolan’s Principles have stood the test of time and remain very relevant in today’s rapidly changing world. They are the standards that our public expect and there is no doubt that they will continue to underpin our public life. "
        }
    ]
}