{
    "url": "https://nda.blog.gov.uk/nda-logs-in-to-preserve-digital-data-down-the-centuries/",
    "title": "NDA logs in to preserve digital data down the centuries",
    "authors": [
        "Deborah Ward - NDA Communications Manager"
    ],
    "categories": [
        "Innovation/savings",
        "International activities"
    ],
    "pub_date": "2018-06-25T15:01:59+01:00",
    "content": [
        {
            "text": "Risks of data that's entirely digital\nAs computers, software and digital storage methods undergo rapid evolution, the risks grow that existing data may be inaccessible for workforces still needing to decommission redundant nuclear facilities in the next century."
        },
        {
            "text": "So the NDA is embarking on a major initiative to ensure that all its digital information can be preserved and – critically - continue to be accessed in the future."
        },
        {
            "text": "In the case of records for the underground geological disposal facility (GDF) being developed to house higher-activity radioactive waste, the need will extend for many thousands of years.  The two-year project will see an NDA-funded digital specialist recruited to research how the challenge of preserving electronic  material is being approached by the 100-plus international organisations in the not-for-profit  Digital Preservation Coalition .  The aim is to  develop a comprehensive first-ever strategy for the NDA estate."
        },
        {
            "text": "Technological changes"
        },
        {
            "text": "Simon Tucker, the NDA’s Head of Information Governance, said:"
        },
        {
            "text": "Simon, who also serves as a non-Executive Director of the DPC, added that waste records for the geological disposal facility (GDF) would, for example, need to be kept in perpetuity, remain usable for its future workforce and satisfy regulatory requirements."
        },
        {
            "text": "Global coalition\nThe DPC was established in 2002 by a number of UK agencies including the British Library, The National Archives, The British Museum and the Bank of England. Supported by annual subscriptions, membership has grown steadily and now includes the European Central Bank, United Nations HQ, the Internet Archive (based in California) as well as many universities."
        },
        {
            "text": "Its mission is to enable members to deliver “resilient long-term access to digital content and services, helping them to derive enduring value from digital assets and raising awareness of the strategic, cultural and technological challenges they face”."
        },
        {
            "text": "The NDA’s embedded staff member will draw on the global experience of DPC member agencies and organisations who are dealing with similar requirements to preserve information digitally."
        },
        {
            "text": "Developing a solid body of research\nThe project will involve cycles of experimentation with different systems and approaches as well as regular evaluation to build a solid body of research. Possible solutions will be explored, tested and refined, eventually feeding into the NDA’s Digital Preservation Strategy."
        },
        {
            "text": "The partnership will bring together the DPC’s wide-ranging expertise in preservation with the detailed knowledge of the NDA and its businesses, to share and build good practice. The project is part of the NDA’s Information Governance Programme which aims to ensure consistent, effective management of all kinds of information, knowledge and the professional expertise of the estate’s workforce."
        },
        {
            "text": "The principle aims of the IGP are:"
        },
        {
            "text": "Read more about the Information Governance Programme"
        },
        {
            "text": "All Site Licence Companies, subsidiaries, relevant government departments and the nuclear regulators are involved in the programme."
        },
        {
            "text": " "
        }
    ]
}