{
    "url": "https://prisonleaversproject.blog.gov.uk/2021/10/01/a-year-in-the-life-of-the-prison-leavers-project/",
    "title": "A year in the life of… the Prison Leavers Project",
    "authors": [
        "Lizzie Ellis - Prison Leavers Project"
    ],
    "categories": [
        "Project background"
    ],
    "pub_date": "2021-10-01T15:14:03+01:00",
    "content": [
        {
            "text": "Our project works to reduce reoffending by testing new and innovative approaches to support people leaving prison to turn away from crime. But how did we get here and where are we going?"
        },
        {
            "heading": 2,
            "text": "Where we started"
        },
        {
            "text": "We know that reintegration into society plays a big part in former prisoners turning their back on crime and building productive lives. Our journey began by asking: what can affect a prison leaver’s reintegration into society?"
        },
        {
            "text": "These are cross-cutting issues – they require collaboration across government and all sectors locally and nationally - so we decided to develop a bid for the Shared Outcomes Fund. Things got really exciting in July 2020 when we were successful in our bid, which meant we could move from identifying problems to working to find solutions."
        },
        {
            "text": "We received £20 million to bring innovation to the reducing reoffending challenge - to build evidence on what works (and what doesn’t!) by rapidly testing multiple interventions at a small scale, before scaling up the most effective over time."
        },
        {
            "text": "The Prison Leavers Project acts as the ‘innovation hub’ of the Government’s reducing reoffending agenda, complementing existing policy development and interventions taking place."
        },
        {
            "text": "We recently celebrated the one-year anniversary of the project, so what have we done so far?"
        },
        {
            "heading": 2,
            "text": "Introducing our cross-sector teams"
        },
        {
            "text": "To reach genuinely innovative approaches to reoffending, we need to bring together diverse experiences and perspectives. We’ve seconded experts from across the public and third sectors to create four new teams – or ‘Service Communities’ – which will take forward work on some key reoffending challenges:"
        },
        {
            "text": "Since launching in early 2021, our teams have been busy! We started by mapping out the policies and services that already exist to help us identify priority areas for new interventions. Now teams are expanding their knowledge of these areas through user research and speaking to stakeholders to understand their perspectives."
        },
        {
            "heading": 4,
            "text": "What’s next for our Service Communities?"
        },
        {
            "text": "Within the next month, most of our Service Communities will have learned enough to start designing potential solutions. The goal is to identify the most promising concepts, and scale them up into pilots by April 2022."
        },
        {
            "heading": 2,
            "text": "Launching an Innovation Challenge"
        },
        {
            "text": "Dynamic organisations in the tech sector, such as start-ups, bring huge potential for innovative thinking through agile working and creatively using new technology to address existing  problems. We wanted to draw on this expertise by launching an innovation challenge."
        },
        {
            "text": "We started with an initial problem diagnosis, engaging with stakeholders from across the system, before coming up with six ‘challenge statements’ that we wanted the tech sector to solve. We published these challenge statements to launch the Prison Leavers Innovation Challenge in June and are now working with the successful suppliers from the first round to develop their prototypes."
        },
        {
            "heading": 4,
            "text": "What’s next"
        },
        {
            "text": "Our Innovation Challenge suppliers whose prototypes have the most potential will progress into piloting stage this winter, receiving up to £350k to test their solution."
        },
        {
            "heading": 2,
            "text": "Tackling reoffending at a local level"
        },
        {
            "text": "Back in February, we launched the Local Leadership and Innovation Fund (LLIF) - a grant funding scheme that invites organisations from across the wider public and third sector to come together in partnership to develop locally-led pilots which will improve outcomes for prison leavers and reduce reoffending, to better protect the public"
        },
        {
            "text": "The first round of funding was allocated to seven partnerships in June 2020 – you can read more about what they’ll be focusing on here."
        },
        {
            "heading": 4,
            "text": "What’s next for the LLIF"
        },
        {
            "text": "We opened the second round of the Fund for applications in early September and hope to have allocated all of our funding by early 2022. Meanwhile, the partnerships from round one will begin delivering their interventions by November."
        },
        {
            "heading": 2,
            "text": "Evaluating as we go"
        },
        {
            "text": "Evaluating what works to reduce reoffending and improve outcomes for prison leavers is a big element of the programme. We have partnered with TONIC (a social research consultancy) and the University of Kent to conduct an evaluation of the project on our behalf."
        },
        {
            "text": "This means we’ll have an objective assessment of the successes and challenges of the project from experts in the field of criminal justice. We’ll be learning what does and doesn’t work in the programme in real time, so we can make improvements as we go."
        },
        {
            "heading": 2,
            "text": "Where we’re going"
        },
        {
            "text": "As you can see, we are at an exciting stage of the project where we will begin to see our interventions developing and taking shape. Stay tuned to our blog for more updates on our progress and reflections on bringing innovation to the reoffending challenge."
        }
    ]
}