{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2021/10/01/associate-director-national-engineering-policy-centre/",
    "title": "Associate Director, National Engineering Policy Centre",
    "authors": [
        "Selina Khan"
    ],
    "categories": [
        "GSE Opportunities"
    ],
    "pub_date": "2021-10-01T23:02:06+01:00",
    "content": [
        {
            "text": "The Royal Academy of Engineering (RAENG) is harnessing the power of engineering to build a sustainable society and an inclusive economy that works for everyone. In collaboration with our Fellows and partners, RAENG are growing talent and developing skills for the future, driving innovation and building global partnerships, and influencing policy and engaging the public."
        },
        {
            "text": "As Associate Director, you will lead the work of the National Engineering Policy Centre at a hugely exciting time in its development."
        },
        {
            "text": "You will lead your team to develop and deliver highly influential, evidence-based outputs on a range of policy issues. As an important figure within the Academy, you will collaborate with colleagues across the organisation to integrate work on skills, research, enterprise, and diversity and inclusion into a compelling overall programme. This will combine with international colleagues to maximise the policy impact of our extensive international programme."
        },
        {
            "text": "You will be a genuine leader within the engineering profession working inclusively and openly with partners to the Policy Centre to shape and contribute to the Centre’s work and strategy, delivering a programme which carries the authority and expertise of the whole profession."
        },
        {
            "text": "You will grow the Academy’s ground-breaking work on systems approaches to policy challenges and drive our Policy Fellowships' scheme; both areas where the Academy has distinctive and innovative offers and continue to develop new approaches to supporting better policy."
        },
        {
            "text": "We are looking for someone who can build connections and collaborate across professional boundaries and who will proactively develop and nurture senior relationships with policy makers in UK regional and devolved governments."
        },
        {
            "text": "You will be an experienced and capable leader, comfortable with a high profile. You will be trusted by some of the country’s most senior and brilliant engineers, entrepreneurs, researchers and business leaders."
        },
        {
            "text": "You will need the policy background and analytic skills to ensure the quality and excellence of our policy output. You should have a sincere concern for impact and for delivering public benefit and will drive strong evaluation of our work."
        },
        {
            "text": "A commitment to diversity and inclusion which permeates your work and that of your team is essential."
        },
        {
            "text": "If you're interested in applying you can find more information here."
        }
    ]
}