{
    "url": "https://cyberandspecialistoperationscommand.blog.gov.uk/2021/10/01/cyber-insider-what-does-it-mean-to-be-an-rrt/",
    "title": "Cyber Insider: What does it mean to be an RRT?",
    "authors": [
        "Conrad Beckett"
    ],
    "categories": [
        "Cyber",
        "Personnel",
        "Technology",
        "Training"
    ],
    "pub_date": "2021-10-01T06:01:11+01:00",
    "content": [
        {
            "text": "In this edition of Cyber Insider we look at Rapid Reaction Teams (or RRTs), defence’s quick reaction cyber specialists. We speak to a couple of them and get an insight into how they train to be ready to deploy at short notice and provide cyber capabilities all over the world."
        },
        {
            "text": "In February 2021 a top UK General sat alongside the Director of GCHQ and warned that “the most important weapons don’t necessarily fire bullets”. That was the Commander of Strategic Command, General Sir Patrick Sanders."
        },
        {
            "text": "The weapons he was referring to were cyber capabilities. As digital technology continues to advance, we see an even greater battlefield opening up in cyberspace. Keeping us protected against the threats of that battlefield are UK’s cyber specialists, who defend us from an average 60 cyber attacks every day."
        },
        {
            "text": "Among those specialists there are an elite team of military experts, ready to deploy at short notice anywhere in the world. Their job is to respond to any potential cyber attack, eradicate the malicious actor, and secure the systems from further attack. They are the Rapid Reaction Team (RRT)."
        },
        {
            "text": "Being part of an RRT means being ready to deploy at any moment, and training hard to make sure you remain at the cutting edge of cyber threats. Those threats could target any kind of digital system, and new ways to exploit them are found all the time, which means no two attacks are ever quite the same."
        },
        {
            "text": "Maintaining this high level of understanding is extremely challenging and roles within an RRT are only offered to personnel who meet the rigorous standards required. It also means having to train hard to ensure their skills remain sharp, and recently a small number of RRT personnel virtually deployed on an international cyber exercise called Exercise Cyber Flag."
        },
        {
            "text": "Cyber Flag is a defensive cyber exercise, which is hosted on the US Cyber Command’s ‘Persistent Cyber Training Environment’. This allowed 8 teams from around the world to participate without having to leave their home countries."
        },
        {
            "text": "Squadron Leader Dave, the officer who is currently in charge of our RRT said: “Training in this way, especially during a pandemic where international travel is limited, is excellent and helps us to deepen our relationships with our international allies and partners”"
        },
        {
            "text": "The Exercise closely followed a real word scenario where each team’s mission involved protecting vital operational networks from the attacks of an opposing force of cyber experts (known as a red team). The red team’s job was to infiltrate the exercise’s network, and steal sensitive data before deploying ‘ransomware’. Ransomware is form of malware that locks a user out of their system, before demanding payment in return for granting access again."
        },
        {
            "text": "Flight Sergeant Chris, who led the UK’s RRT on Cyber Flag said: “These Exercises give the teams exposure to a number of situations that may be above their current understanding, but within a ‘safe to fail’ environment; the lessons identified and learnt are invaluable.”"
        },
        {
            "text": "Those lessons learned and skills practiced really are invaluable, because whilst Cyber Flag was a ‘safe to fail’ training environment, the RRT could be called upon at any time to deploy on a real world cyber attack."
        },
        {
            "text": "Squadron Leader Dave again: “As a team held at high readiness to deploy, the RRT must continue to train in the same way we would fight. This ensures that when an incident does occur we are able effectively respond, securing mission critical data, and ensure vital operational networks remain available to commanders.”"
        },
        {
            "text": "The cyber domain is becoming more important than ever for defence, and it’s up to our cyber specialists such as the RRT to protect our digital infrastructure. They train hard, and remain ready to deploy anywhere, and at any time."
        },
        {
            "text": "Could you see yourself in a Rapid Reaction Team? "
        },
        {
            "text": "There are both Regular and Reserve cyber roles in the Army, Royal Navy, Royal Air Force."
        },
        {
            "text": "For more information on Army roles, click here."
        },
        {
            "text": " If you are interested in joining the Navy, click here."
        },
        {
            "text": " To find your force as a part of the RAF, click here."
        },
        {
            "text": "There are also civilian cyber roles within the Ministry of Defence Civil Service."
        },
        {
            "text": "You can sign up for a job alert on CS Jobs here. Simply create an account, select the Job Alerts tab and follow the on-screen instructions."
        }
    ]
}