{
    "url": "https://marinedevelopments.blog.gov.uk/2021/10/01/mmo-work-with-marine-and-coastguard-agency-in-pollution-exercise/",
    "title": "MMO work with Marine and Coastguard Agency in pollution exercise",
    "authors": [
        "David Patrick, Digital Communications Manager"
    ],
    "categories": [
        "Coastal",
        "marine conservation",
        "Science"
    ],
    "pub_date": "2021-10-01T10:33:59+01:00",
    "content": [
        {
            "text": "The United Kingdom is surrounded by some of the world’s busiest seas. The English Channel alone accounts for up to 20% of global maritime trade and connects the Atlantic Ocean to the North Sea. This means that there is an ever-present risk of a pollution incident."
        },
        {
            "text": "Oil and other pollutants which are occasionally spilt into the sea can endanger environmental resources and can put human and marine life at risk. Due to the turbulent nature of our seas, it is rarely possible to recover spilled oil. However, treatment products can work with the ocean waves and disperse the oil."
        },
        {
            "text": "The Marine Management Organisation (MMO) is part of a response community ready to react to marine pollution incidents. We approve the use of oil spill treatment products, sit on groups to advise on the environmental impact and keep wider government briefed on developments during an incident."
        },
        {
            "text": "Thankfully major incidents rarely occur. To ensure preparedness and test out processes we regularly take part in training exercises. These can range from small local exercises to major cross-government scenarios that can last multiple days."
        },
        {
            "text": "Between the 11th and 14th of September, Ocean Osprey and MMO officers were involved in a heavy deployment exercise in Portland in conjunction with the Marine and Coastguard Agency (MCA)."
        },
        {
            "text": "The week-long training exercise provided all participants an overview of how offshore counter pollution equipment is deployed and operated on the shoreline, at sea and the harbour area. During this drill, beach booming and recovery equipment which are deployed in real incidents to help contain and remove oil from the sea surface."
        },
        {
            "text": "The exercise included working on the Ministry of Defence (MOD) training ship Sir Tristram and undertaking BA & Chemical detection training in a dead ship environment. Most of the tasks involved working on a variety of vessels under the instruction of experienced and qualified staff from the MCA."
        },
        {
            "text": "Principal Marine Officer, Patrick Gray from MMO, who attended the training day said: \"We worked with MCA on this training as it is vital that we understand oil containment and recovery systems in case we need to react to an incident at any time. The exercise provided some valuable experience for our officers and they gained an appreciation for the logistics that go on during an operation.”"
        },
        {
            "text": "\" During the exercise we used a giant inflatable counter-pollution kit named the Current Buster 6 which is nearly 40 metres long with a 27-metre-wide mouth. It is capable of collecting 64 tonnes of oil which can then be skimmed off and pumped into storage leaving the clean water to flow back into the sea.”"
        },
        {
            "text": "“It was fascinating to see this remarkable piece of equipment in action as it has never actually been used for a spill in the UK before and fingers crossed, we will never have to use it in the future.”"
        },
        {
            "text": "In response to incidents, the Maritime Rescue Co-ordination Centres act as co-ordinators during incidents and circulate all pollution or situation reports to the Marine Management Organisation (MMO) for English waters. Marine Scotland, Natural Resources Wales and the Northern Ireland Environment Agency are responsible for their waters. Copies are also sent to national and regional statutory nature conservation agencies, and local councils that may be affected by the oil spill."
        },
        {
            "text": "In the event of a major spill, these organisations set-up an environment group to give advice on the suitable response to changing circumstances."
        },
        {
            "text": "MMO aims to approve or refuse oil spill treatment product use within 1 hour of being asked to authorise dispersant use. MMO can also advise on the approved products suitable for use in a particular incident."
        },
        {
            "text": "In the case of major spills, any spraying of dispersants is normally supervised by the Marine and Coastguard Agency (MCA). MMO and statutory nature conservation agencies will be closely involved when there are important environmental concerns, so that any implications for fisheries and marine fauna and flora are considered."
        },
        {
            "text": "With less serious spills it is up to those dealing with the incident to make direct contact with MMO before any oil spill treatment products are used."
        }
    ]
}