{
    "url": "https://socialcareinspection.blog.gov.uk/2021/10/01/multi-building-childrens-homes-creating-more-capacity-in-the-system/",
    "title": "Multi-building children’s homes: creating more capacity in the system",
    "authors": [
        "Yvette Stanley"
    ],
    "categories": [
        "children's homes"
    ],
    "pub_date": "2021-10-01T09:50:32+01:00",
    "content": [
        {
            "text": "Yvette Stanley, Ofsted’s National Director for Regulation and Social Care, explains our plans for multi-building registrations of children’s homes."
        },
        {
            "text": "The care system is under pressure. Places to live for children with the most complex needs are scarce, and often not where they are most needed. And while the recent move to stop using unregulated accommodation for under-16s is welcome in principle, it’s likely to put even more pressure on a system already struggling to cope with demand."
        },
        {
            "text": "The use of unregistered provision – a symptom of these capacity issues – is still a huge concern. Of course, we can’t be sure of the quality of unregistered provision, so we don’t know whether children are safe or getting good quality care."
        },
        {
            "text": "Councils often resort to using unregistered placements in emergency situations, when there’s simply nowhere else for a child to go. And a shortage of secure accommodation for the most vulnerable children, at risk to themselves and others, means that the courts have little choice but to authorise the use of unregistered placements. Taken together, this is fuelling a need for children to live in small, sometimes single-bedded, homes, which are often required very quickly. Similarly, if a provider ends a placement with little or no notice, a local authority’s options may be limited."
        },
        {
            "heading": 3,
            "text": "More flexibility"
        },
        {
            "text": "As regulator of children’s social care, our first priority is keeping children safe and promoting their welfare. But we also want to boost capacity in the system and create more flexibility where we can."
        },
        {
            "text": "It’s with that aim that we’ve published new guidance that will allow children’s social care providers to make one registration application for up to four buildings, accommodating up to six children. This is a real step forward – allowing homes to work more flexibly, creatively, and to provide more options for children."
        },
        {
            "text": "Apart from residential special schools, children’s homes have always had to register each of the buildings where they provide care and accommodation separately. But this means that providing emergency placements, or places for children who can’t easily be placed in group living, is challenging. Providers argue it’s not financially viable to keep homes empty until a local authority needs a placement."
        },
        {
            "text": "The average children’s home can look after three or four children. Our new approach allows for a slightly larger arrangement, bringing more capacity, but keeping numbers within sensible limits to make sure there can still be effective leadership, management, and oversight. We think this strikes the right balance between creating more flexibility and keeping children safe."
        },
        {
            "text": "Although not exclusively open to local authorities, some councils have indicated that the new approach will be useful, given that they have access to housing stock and want more control over where they can place children."
        },
        {
            "heading": 3,
            "text": "Checks and balances"
        },
        {
            "text": "Above all, we want children to be safe, so as you’d expect, any providers wanting to register a multi-building children’s home will need to show us that they can operate safely and that the service will meet children’s needs. Applications will need to meet all current registration requirements, as well as our additional checks."
        },
        {
            "text": "The new approach will not cover secure children’s homes or residential special schools, which already operate across multiple buildings and sites."
        },
        {
            "heading": 3,
            "text": "Next steps"
        },
        {
            "text": "We’ve published initial guidance today, and over the coming months we’ll be developing guidance on how to inspect these registrations under the social care common inspection framework, with more emphasis on continuity of staffing and management oversight. The inspections are likely to be longer, given the different settings involved. We expect full inspections to start next year. We will accept registration applications from 15 November."
        },
        {
            "text": "This change is long overdue, bringing registration practice up to date to meet the system as it operates today. This much-needed extra capacity will go some way to ease the strain on our creaking care system, and, we hope, to help reduce the number of children living in unregistered and potentially unsafe provision."
        }
    ]
}