{
    "url": "https://insolvencyservice.blog.gov.uk/2021/10/01/my-role-as-a-business-analyst-at-the-insolvency-service/",
    "title": "My role as a business analyst at the Insolvency Service",
    "authors": [
        "Mohammed Nawaz"
    ],
    "categories": [
        "Inclusion",
        "Working for the Insolvency Service"
    ],
    "pub_date": "2021-10-01T13:04:07+00:00",
    "content": [
        {
            "text": "I’m Mohammed, and I’m a Business Analyst here at the Insolvency Service. This week the agency is supporting National Inclusion Week and I’m aware we’re also working alongside colleagues in R3 in promoting that."
        },
        {
            "text": "In fact, the Insolvency Service and R3 have teamed up to form a Joint Steering Group to look at inclusion in the insolvency sector. When I learned I could write about my working life as part of Inclusion Week, I was delighted to be given the opportunity to add my voice."
        },
        {
            "heading": 2,
            "text": "Proud Brummie"
        },
        {
            "text": "My parents were from the Afghanistan/Pakistan border, but I was born in Sheffield, so I consider myself a Yorkshireman by birth. At the tender age of 4 my parents decided to move young ‘Mo’ and the rest of the family to Birmingham. This is where I remain today, with a family of my own, so now I also count myself as a proud Brummie."
        },
        {
            "text": "I love to travel, as it gives me first-hand experience of different cultures, beliefs, and traditions, so it was easy for me to accept jobs that would take me abroad. I’ve worked in all sorts of different sectors, from local authorities to European banks. I’d previously worked at the Insolvency Service a couple of years ago when the agency was upgrading its IT across the estate, and that was a very enjoyable time for me."
        },
        {
            "heading": 2,
            "text": "Helping deliver our 5-year strategy"
        },
        {
            "text": "When that contract came to an end, I took a role as a business analyst in a completely different field. Unfortunately, before contracts were signed, COVID-19 arrived, and the planned move fell through."
        },
        {
            "text": "That was a difficult time for me, so when another opportunity presented itself back at the Insolvency Service to work as an analyst for the agency’s Director Education project, which is part of the agency's exciting new five-year strategy, I jumped at the chance."
        },
        {
            "heading": 2,
            "text": "My religion is important to me"
        },
        {
            "text": "I’m based in Birmingham, so near home, where I can take my kids to school and do all that family stuff, and it’s an office and an environment I really enjoy. My religion is also important to me, and I like to practice it as much as possible."
        },
        {
            "text": "The Insolvency Service offers space and time to pray, and this is important to me spiritually, but also for my mental wellbeing. If there are busy times in the office and you’ve got a lot on, it’s reassuring to know I can take time out and recharge my batteries."
        },
        {
            "text": "I’m really thankful to the agency for that, and not all previous employers have acknowledged my religion or my requirements."
        },
        {
            "text": "I enjoy my work here; it’s why I came back. A lot of my colleagues will remember me from issuing them with their new IT kit, but now I’m seen in the office or on screen working alongside the Project Manager for the Director Education project."
        },
        {
            "heading": 2,
            "text": "Life as a business analyst"
        },
        {
            "text": "My role as a business analyst requires analytical skill and the ability to work with different types of stakeholders, not only with regards to seniority, but also personalities. I have been lucky in that all my stakeholders are friendly and professional."
        },
        {
            "text": "As you can imagine, keeping a busy schedule does have its challenges, but I’m always able to reach out to management, friends, and colleagues to help tackle these challenges. It’s a great environment here. I’d like to become a leader and the agency is helping me further develop my skills to achieve that."
        },
        {
            "text": "As I mentioned earlier, this is my second stint at the agency and I'm now in a role where I’m learning a lot more about the agency’s work and the insolvency world as a whole. I have a much better understanding and appreciation for it. The work we do is important, but so are the people here. The agency is an inclusive employer and I’m proud to be a part of it."
        },
        {
            "heading": 3,
            "text": "Further information"
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}