{
    "url": "https://deframedia.blog.gov.uk/2021/10/01/natashas-law-comes-into-force/",
    "title": "Natasha’s Law comes into force",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2021-10-01T13:16:55+01:00",
    "content": [
        {
            "text": "There has been widespread coverage including in the Daily Mail, Telegraph, i news, City A.M., Sun, Mirror, Daily Express and BBC News Online of Natasha’s Law which comes into force today (1 October)."
        },
        {
            "text": "The changes require food businesses to include full ingredients labelling on pre-packed for direct sale foods, with the 14 major allergens emphasised in the list. They are being introduced following the tragic death of Natasha Ednan-Laperouse, who died after eating a pre-packaged baguette which at the time did not require ingredients labelling."
        },
        {
            "text": "This new allergen labelling law will allow millions of people living with food allergies, intolerances and coeliac disease to make safer choices about the food they buy."
        },
        {
            "text": "The Times Red Box carries an op-ed from the Environment Secretary George Eustice, in which the Secretary of State says he’s hopeful the changes being introduced will drive down the number of hospital admissions caused by food allergies and prevent another tragic death such as Natasha’s."
        },
        {
            "text": "The reforms cover labelling requirements for foods that are prepared and packed on the same premises from which they are sold – such as a packaged sandwich or salad made by staff earlier in the day and placed on a shelf for purchase."
        },
        {
            "text": "Environment Secretary George Eustice said:"
        },
        {
            "text": "Natasha’s parents, Nadim and Tanya Ednan-Laperouse, said:"
        },
        {
            "text": "Food Standards Agency Chief Executive Emily Miles said:"
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}