{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2021/10/01/national-inclusion-week-get-involved/",
    "title": "National Inclusion Week : Get Involved!",
    "authors": [
        "Philip Lawrence",
        "Vicki Chalker"
    ],
    "categories": [
        "Blog Series",
        "Diversity & Inclusion",
        "Guest Blog"
    ],
    "pub_date": "2021-10-01T10:30:51+01:00",
    "content": [
        {
            "text": "As regular readers will know, the GSE Diversity and Inclusivity Action Group (DIAG) has several working groups which deliver projects, blogs, articles for GSE members across government. In this blog the Chairs of the working groups will introduce themselves and give you a hint of what our future plans are. As I mentioned in my last post on Wednesday, we are all volunteers and things will only happen if people volunteer. If you would like to get involved please contact the GSE Profession Team and they can link you to the relevant group. If you are just passionate about D&I but aren’t sure what you’d like to do, please also get in touch with the team."
        },
        {
            "heading": 3,
            "text": "Diversity & Inclusion Action Group (DIAG) – Dr Vicki Chalker"
        },
        {
            "text": "Over the next year, with the help of more active volunteers, we’re hoping to increase our work across government, highlight excellent practice, and expand inspirational blogs such as the role modelling programme. We want to increase the GSE Connect partnership scheme and promote improved diversity data capture and analysis. Additionally, we want to celebrate and recognise the amazing work undertaken by government scientists and engineers and help inspire the next generation."
        },
        {
            "text": "The GSE Board are committed to improving the diversity and inclusion in GSE. This mission is summed up by Professor Paul Monks, the Chief Scientific Advisor (CSA) in BEIS: “Diversity in all its forms needs to be embraced to constantly change the world we work in for the better.”"
        },
        {
            "heading": 3,
            "text": "Disabilities Working Group (DWG) – David Kenyon"
        },
        {
            "text": "Over the next year we’re hoping to join up with the Civil Service Disability Network (CSDN) mentoring scheme, promoting its uptake across the Profession whilst being open to establishing a bespoke scheme for the GSE Profession if a need is identified. We will also be promoting the use of Disability Passports across the profession, easing movement between posts across government. Regrettably, there is still a stigma associated with disability, especially around mental ill-health and we will be looking to the Heads of Science and Engineering Profession (HoSEPs) to be vocal supporters alongside an active blog programme."
        },
        {
            "text": "With more volunteers we could provide a greater diversity of experiences and ideas, enabling us to develop a more proactive programme, including an event focused on disability in GSE. Additionally, greater representation from organisations across the GSE Profession will facilitate greater penetration and promotion of outputs."
        },
        {
            "heading": 3,
            "text": "Ethnic Minorities Working Group (EMWG) – Rameya Arulanantham"
        },
        {
            "text": "Over the next year, through this group, we’ll be working hard to drive forward improvements in diversity and inclusivity for ethnic minority staff. Our aim is to increase the equitable outcomes for members across the GSE Profession to encourage greater diversity throughout science and engineering within government."
        },
        {
            "text": "We are keen to run a series of events focusing on improving representation across government and to also develop links with other cross government networks to increase collaboration efforts and our visibility. We would like to have more volunteers join and work with us to deliver our programme, and together our efforts will help raise the profile of our working group."
        },
        {
            "text": "Rameya is a Senior Technical Adviser in the Export Control Joint Unit (ECJU) in the Department for International Trade (DIT). The ECJU brings together operational and policy expertise from the DIT’s Export Control Organisation, FCDO and MoD to promote global security through strategic export controls whilst facilitating responsible exports."
        },
        {
            "heading": 3,
            "text": "Social Mobility Working Group (SMWG) – Louise O’Sullivan"
        },
        {
            "text": "The Social Mobility Working Group (SMWG) is the newest working group in DIAG. Social mobility is the link between the occupation or income of their parents and the affects this has a person’s occupation or income."
        },
        {
            "text": "Over the next year we hope to provide aspiration and equitable opportunities to our members and signpost this for all, whilst highlighting the range of diverse careers, people, and backgrounds within the GSE Profession. We plan to develop a new quarterly newsletter with opportunities for training, development, and outreach opportunities. We hope to bring a co-chair to the group and expand our working group to ensure we are as representative as possible in a wide range of areas."
        },
        {
            "text": "With more volunteers we could start to run events that showcase the benefits of supporting social mobility for everyone. Additionally, we could provide an outreach programme to schools as part of the GSE Outreach Plan. This would allow us to to extend our influence as scientists from a range of backgrounds to schools across the country."
        },
        {
            "text": "Louise is an explosive atmospheres scientist for HSE, where she focuses on the study of hydrogen, or fuel hazards, and the consequences of ignition. Louise is currently investigating the consequence of igniting compressed hydrogen gas within fuel dispensers as part of the MultHyFuel EU Project. Louise is from Rotherham, South Yorkshire and attended the University of Liverpool where she studied Chemistry. "
        },
        {
            "heading": 3,
            "text": "Women’s Working Group (WWG)– Christine Maggs"
        },
        {
            "text": "Over the next year we’re hoping to evaluate the GSE Connect pilot and relaunch it to a larger number of women. We aim to continue holding regular cross-government Inspiring Women in STEM virtual talks and running our Inclusive Role Modelling blog series."
        },
        {
            "text": "With more volunteers we could investigate other interventions that could benefit women across the GSE Profession. We’re also keen to develop best practice (hints and tips) guidance for organisations for recruiting and retaining women in STEM roles."
        },
        {
            "text": "Christine is the first Chief Scientist of the UK’s Joint Nature Conservation Committee, part of the Defra group.  Christine was previously a senior academic in Queen’s University Belfast, where her department achieved Gold Athena SWAN awards for promoting gender equality.  In JNCC she supported HR in achieving Disability Confident leader status and now leads its EDI Group."
        },
        {
            "heading": 2,
            "text": "Next Steps"
        },
        {
            "text": "If you would like to be involved in Diversity and Inclusivity within the GSE, please contact the GSE Profession Team."
        }
    ]
}