{
    "url": "https://lifeathmrc.blog.gov.uk/2021/10/01/national-inclusion-week-at-hmrc-kits-story/",
    "title": "National Inclusion Week at HMRC, Kit's Story",
    "authors": [
        "Mems Bangura"
    ],
    "categories": [
        "General"
    ],
    "pub_date": "2021-10-01T10:00:11+00:00",
    "content": [
        {
            "text": "Kit is an Enterprise Architect with a vision impairment within our digital team. We interviewed Kit to find out about his experience at HMRC as a disabled person. Here’s what he had to say…"
        },
        {
            "text": "I’ve been at HMRC around 18 months. I originally worked for the Government Gateway and had experience working with a wide range of government organisations, including HMRC. The Government Gateway is an IT system that was developed to register for online services provided by the UK government, such as the HMRC Self Assessment tool. Once the Government Gateway went in-house, I transferred to HMRC as part of the process."
        },
        {
            "text": "In my role as an Enterprise Architect I have an ongoing overview of IT projects and confirm that they are progressing as expected. That also includes developing the direction for some aspects of the IT systems we have at HMRC. As the team is continually looking across all the tax regimes and working on the systems that support them, things are very varied and there’s truly so much to learn on the job."
        },
        {
            "text": "As I joined HMRC late in my career, I’m taking the opportunity to have a new experience in the workplace. I’m really enjoying my current role and it’s very interesting to see how such a large organisation within the Civil Service works – especially after working alongside HMRC previously at the Government Gateway."
        },
        {
            "text": "I am impressed with the attitudes of the people that work here; there’s a lot of thoughtfulness in how people work and interact. There is a positive approach to diversity and people have been very helpful. Working while blind means I need reasonable adjustments put in place for me and HMRC has shown a real commitment to ensuring I am fully supported, therefore allowing me to fulfil my role comfortably. Elements such as travel adjustments, accessibility tools on my computer equipment and personal assistance by describing technical diagrams are some examples."
        },
        {
            "text": "HMRC has very much accepted that I need a special type of assistance. I have no doubt that I’ll be able to progress my career here and my disability isn’t seen as a limitation."
        },
        {
            "text": "At HMRC we believe diversity and inclusion is key to creating a great place to work, where everyone feels they are being treated fairly and that they have access to a rewarding career. It’s vital to us people get the support that they may need."
        },
        {
            "text": "We hope you enjoyed our National Inclusion week 3-part series and if you didn’t get a chance to read them all, check out Dom’s experience and Christine’s Story."
        }
    ]
}