{
    "url": "https://ipo.blog.gov.uk/2021/10/01/spotlight-on-inclusion-words-from-our-staff-networks/",
    "title": "Spotlight on Inclusion – Words from our Staff Networks",
    "authors": [
        "Oliver Downey"
    ],
    "categories": [
        "Inclusion and diversity"
    ],
    "pub_date": "2021-10-01T11:58:12+01:00",
    "content": [
        {
            "text": "National Inclusion Week 2021 has begun; it’s a week to celebrate, inspire and recognise our staff networks and to value the differences we each bring to the workplace, making the Intellectual Property Office (IPO) a fair and brilliant place to work. "
        },
        {
            "text": "A huge achievement of our people has been the creation and development of several staff networks, designed to create an environment where people feel that they belong - an inclusive, open environment, one where diversity is embraced, and our differences valued.  "
        },
        {
            "text": "Diversity and Inclusion Manager, Annie-Marie Switzer, said: “We really believe that we are ‘one IPO’ family. The support our networks and allies give to all individuals helps bring people together. It provides the nurturing environment in which they can hopefully feel comfortable in bringing their whole selves to work, in a safe setting. The IPO benefits not just in terms of our people, but their diversity of thought, perspectives and experiences; from shaping our policies to serving our diverse customers.” "
        },
        {
            "heading": 3,
            "text": "Women’s Inclusive Network "
        },
        {
            "text": "This network was set up in 2018 to help women to feel empowered, valued and help everybody reach their full potential, regardless of gender. Some of the services the Women’s Network has provided over the last few years include myth-busting coffee sessions with senior leaders, sponsorship of women on a structured Positive Action Pathway and the launch of a tool for people to report behaviours or situations that they feel are inappropriate.  "
        },
        {
            "text": "IPO senior patent examiner and chair of the Women’s Network, Hazel Thorpe said: “The Women’s Inclusive Network provides a safe space for people to discuss gender related issues, work with corporate resources to optimise IPO’s policies/services and cultivate a culture which respects and values the experience and contribution of women and gender-fluid people.” "
        },
        {
            "heading": 3,
            "text": "Men’s Network "
        },
        {
            "text": "We know that men’s mental health is a huge social issue and that is why we set up a Men’s Network to run alongside our Women’s Network. The purpose of this network is to create balance and ensure that our staff counsellor service is accessible to all men when they need it.   "
        },
        {
            "text": "Head of the Men’s Network, Peter Mason told me it’s crucial that the Men’s Network is there for the benefit of all staff, not just men. He said that everybody has an important man in their lives and men’s issues affect everybody. The Men’s Network supports and collaborates closely with other gender networks to ensure inclusion is driven by all. "
        },
        {
            "heading": 3,
            "text": "BAME Network "
        },
        {
            "text": "Today is the start of #BlackHistoryMonth2021 but all-year-round, it is our aim to ensure that the IPO remains a brilliant place to work for all people and that we continue to encourage people from BAME backgrounds to join us in working at the IPO. "
        },
        {
            "text": "Anne-Marie Switzer said: “The BAME Network collaborates with the other networks and other Organisations to promote and emphasise the inclusivity in the IPO. As a network, we support the business with its ambitions to be inclusive and accessible by default. We celebrate events such as Black History Month, provide support to our peers, role model inclusivity and work with the business to resolve issues and shape change.” "
        },
        {
            "heading": 3,
            "text": "Mental Health services "
        },
        {
            "text": "This pandemic has been especially tough on those who suffer with their mental health. From counsellors, trained mental health first-aiders and an Employee Assistance Programme, we recognise the significant importance of our mental health services. Our goal is to be an organisation where mental health issues are widely recognised, understood and de-stigmatised.  "
        },
        {
            "text": "Mental health first-aider and digital communications manager, Laurien Webb said: “Mental health should be given the same level of care and attention as physical health. There’s still many myths and outdated stereotypes and it's important to understand peoples' concerns and to know how to talk about them. "
        },
        {
            "text": "\"As mental health first-aiders, it is our duty to support and signpost colleagues with mental health concerns, as well as line managers at times of distress or crisis. It is essential that our relationship with colleagues is based on trust and discretion so that all staff can feel safe and secure speaking about whatever they’re struggling with.\" "
        },
        {
            "text": "At the beginning of the year, IPO CEO Tim Moss said: “As CEO, I pledge to keep striving towards creating a brilliant place to work for all our people.” This work to create a diverse and inclusive environment for all continues every day. Find a full list of our staff networks and articles on inclusion in the IPO here.  "
        },
        {
            "text": "To finish this blog off, I wanted to provide a list of things we’re so proud of that our staff have helped the IPO achieve and why we consider it a #BrilliantPlaceToWork. "
        }
    ]
}