{
    "url": "https://gfie.blog.gov.uk/2021/10/01/this-is-inclusion-in-action-and-we-want-you-to-get-involved/",
    "title": "This is inclusion in action and we want you to get involved!",
    "authors": [
        "danmason"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2021-10-01T11:05:27+01:00",
    "content": [
        {
            "text": "'To me this a life changing opportunity. It’s almost like a second chance in life to enable me to create a more stable, better future for myself.'"
        },
        {
            "text": "We create a pathway for great people to join the civil service by removing barriers for people including Veterans & Military Spouse/Partners care experienced people, people who have been homeless and prison leavers.  The result is a win – win.  Candidates get an opportunity to gain experience and grow in confidence and the civil service gets a great colleague with a new perspective."
        },
        {
            "text": "This is inclusion in action and we want you to get involved, but you don’t have to take our word for it. We spoke to some colleagues about their experiences.  Here’s what they told us."
        },
        {
            "text": "The DWP Social Mobility Apprenticeship is targeted at those lacking in work experience and education who are struggling to get into employment. Thomas is one such apprentice: 'When I got the agreement on my house, the thing I was most looking forward to was to sleep in my own bed. I’d like to shout out to all my colleagues who have supported me every step of the way and been really patient, believing in me and never giving up on me.'"
        },
        {
            "text": "The Movement to Work (MtW) programme is a scheme that offers placements for 16-30 year olds who are Not in Education, Employment or Training (NEET) to gain valuable work experience. We are currently running our MtW programme virtually and have been since the pandemic.'The positive outcomes have been fantastic with over 50% of participants who have taken part in the programme finding some form of employment including work in the Civil Service, Apprenticeships, Private Sector roles, Kickstart Placements and many more opportunities.'"
        },
        {
            "text": "The MtW virtual programme can be adapted to suit all business areas and there are no cost implications, no recruitment involved - all we require is your time to deliver the programme whether it be over one week or two and DWP colleagues will provide any support required pre, during and post placement. Megan said “The movement to work course has really helped me to gain confidence and skills that will help me so much in work placement. “"
        },
        {
            "text": "The Care Leavers Internship Scheme run by DfE is a 12 month fixed term appointment for 18-30 year olds who have left care are entitled to a care package. Designed to give care leavers experience and skills to progress in work in either the Civil Service or elsewhere, the scheme removes barriers, levelling the ‘field’ with other young people and supporting social mobility. Suad from FCDO says of the scheme: "
        },
        {
            "text": "‘I have been in my internship in the Foreign, Commonwealth and Development Office (FCDO) for nearly a year. 'My experience in the FCDO has been absolutely life changing!I have such a lovely team and an amazing line manager and a mentor who have always been there for me from my first day.'"
        },
        {
            "text": " I have gained so much experience, and have made great strides in improving my written and communication skills. I have also been given the opportunity to do job shadowing in other departments, which I am looking forward to. I have learned to believe in myself, stop doubting myself and be happy. I am proud to be part of the FCDO and look forward to hopefully being made permanent in the future. I would definitely encourage other care leavers to take up this life changing opportunity. Most importantly, I would like to thank the Care Leavers Team for making it possible. I have grown from a person who felt not good enough to even make friends, to someone who is happy and always looking forward to the future. Thank you from the bottom of my heart.’"
        },
        {
            "text": "Chris  Richardson is Deputy Director Service Delivery – Government Recruitment Service. (GRS) and has been piloting a new care leavers scheme working with Newcastle City Council to match care experienced young people directly into civil service roles.\"As part of the Government Levelling Up agenda but more importantly being a good citizen I feel it is important to spread opportunity throughout the community and especially where we know people have been historically disadvantaged.  GRS therefore volunteered to pilot the GFiE Care Leavers initiative to give opportunities and promote the Civil Service as a socially responsible and inclusive employer. 'I would encourage all vacancy holders with suitable positions to consider engaging with the programme to give opportunity to candidates from one of the GFiE streams.' "
        },
        {
            "text": "The process is simple and much more about assessing the fit for both the candidate and the business unit in an informal way.  GRS have been impressed with the quality of the candidates that we engaged as our initial pilot and are now looking to commence selection of a second and larger group from the initiative.\""
        },
        {
            "text": "A participant on the DWP & GFIE Homelessness recruitment pilot scheme said“The impact personally has been huge. It has really given me a sense of belonging to society once again and given me my sense of self- worth that had dwindled a little with being out of work for over three years. I am really proud of myself getting this job. In the past I would never of dreamed of applying for such a position. With the help of the working health team and seeing the ins and outs of the role in the past few weeks it has really boosted my confidence and distinguished any fears I had that I would not be able to perform in the role thus making me believe that the transferable skills I am able to bring over to this role will stand me in good stead for the future and what will hopefully be a fruitful career”."
        },
        {
            "text": "Lisa Jackson is Prison Leaver Delivery and Engagement Lead (GFIE)  "
        },
        {
            "text": "During the Covid-19 pandemic, it has been difficult to get out and about to see how prisons and the people within have been affected by the restrictions. Seeing how things operate in practice is really important to the successful running of Life Chances schemes, as we have to understand who we are trying to reach through our different methods of recruitment, and what barriers they might face. Speaking to Prison Service colleagues on a recent visit to a Young Offender Institution, I was shocked to hear that nearly a quarter of the young men being held in custody there had come from care-experienced backgrounds. The prison had been working to adopt an approach based around Adverse Childhood Experiences (ACES), and training staff to understand the impact these experiences may have on the people in their care. A significant number of the young men had experienced violence and trauma growing up, and continued to be affected by influences as they grew up such as the gang culture that was prevalent in that area. I was struck by how easy it is to forget that these types of backgrounds and barriers exist, particularly when I have the privilege of a supportive family and friends, and how difficult it must be to get onto the right track when your start to adult life is affected by what has gone before.  But it also brought home to me how important our collective work is - 'The first step is in recognising that not everyone has the same opportunities, and the life chances that we create might be the turning point to a better future'."
        },
        {
            "text": "You can recruit using one of our life chance schemes to AO and EO (and equivalent) grades.   You can volunteer to mentor a life chance candidate. Interested?"
        },
        {
            "text": "Contact us for more information GFIE@cabinetoffice.gov.uk"
        },
        {
            "text": "You can find a full list of schemes here https://civilservicecommission.independent.gov.uk/recruitment/exceptions/"
        }
    ]
}