{
    "url": "https://ukhsa.blog.gov.uk/2021/10/01/uk-health-security-agency-addressing-the-impact-of-health-threats-on-the-nation/",
    "title": "UK Health Security Agency: Addressing the impact of health threats on the nation",
    "authors": [
        "Jenny Harries"
    ],
    "categories": [
        "UKHSA"
    ],
    "pub_date": "2021-10-01T09:03:04+01:00",
    "content": [
        {
            "text": "I am delighted to announce that the UK Health Security Agency (UKHSA) is now fully operational, bringing together the strengths and expertise of Public Health England and NHS Test and Trace."
        },
        {
            "text": "The creation of UKHSA has meant reimagining the country’s health security defences and how we can keep people safe and save lives."
        },
        {
            "text": "Transforming the public health system is about ensuring we meet current health protection challenges, but it is also about protecting us from those yet to come."
        },
        {
            "text": "The UKHSA will work to do just that. We will build a standing capacity to prepare for, prevent and respond to all threats to health, including future pandemics and infectious diseases, as well as chemical, biological, radiological, nuclear and environmental hazards."
        },
        {
            "text": "By bringing Public Health England and NHS Test and Trace together, we already have a brilliant scientific and professional foundation to do this work. I want the organisation to grow to be an intellectual, scientific and operational leader for health security, playing vital roles from the local to the global stage."
        },
        {
            "text": "Health security not only impacts us on an individual level, but it also underpins our wellbeing and chances in life and strongly influences the performance of our economy. While the UKHSA continues the round-the-clock response to COVID-19, it will also take an active role in the post-pandemic health and community system, to build back better and fairer."
        },
        {
            "text": "We will ensure our work supports cross-cutting government priorities to improve people’s health, including climate change, levelling up and reducing health inequalities."
        },
        {
            "text": "The pandemic has shown us that health threats do not affect everyone equally - people in underserved communities or who have other vulnerabilities have suffered the worst outcomes. We will learn from that."
        },
        {
            "text": "Our mission is to save lives by protecting the whole nation from infectious disease and other external health hazards. However, I also see UKHSA's establishment as an opportunity to drive forward the innovations brought to the forefront by the pandemic such as the development of new diagnostic tools and the opportunity to bring testing to your postbox."
        },
        {
            "text": "Working with life science and business, new innovations will help us not only to support people’s health, but to bring opportunities, improve livelihoods, promote community resilience and support critical government agenda."
        },
        {
            "text": "We will be an organisation that runs forwards to help solve problems and embraces partnerships with colleagues in research and academia, local government and local health protection teams and - most importantly - the communities we serve."
        },
        {
            "text": "And of course, we will work alongside our colleagues leading on health improvement and public health at the Office for Health Improvement and Disparities, NHS England and Improvement and NHS Digital."
        },
        {
            "text": "This is just the start of a period of transformation and I want to thank everyone who has contributed to redesigning the public health system and worked so relentlessly on the COVID-19 response."
        },
        {
            "text": "Change is never straightforward, but we are all striving to protect, improve and save lives and nothing matters more than that."
        },
        {
            "heading": 2,
            "text": "Working with us"
        },
        {
            "text": "The creation of UKHSA is being managed to ensure continuity of the response to COVID-19 and existing health protection services."
        },
        {
            "text": "This means that contact details and email addresses will change gradually, so please continue to contact us through existing routes until you are advised otherwise."
        },
        {
            "text": "I look forward to maintaining our vital working relationships and partnerships and developing many new ones over the coming months."
        }
    ]
}