{
    "url": "https://dragonsden.blog.gov.uk/2024/01/04/dragons-den-ip-blog-series-21-episode-1/",
    "title": "Dragons' Den IP Blog - Series 21 Episode 1",
    "authors": [
        "jennymanders",
        "christinawatts"
    ],
    "categories": [
        "Business",
        "Copyright",
        "Designs",
        "IP",
        "Licensing",
        "Patents",
        "Trade marks"
    ],
    "pub_date": "2024-01-04T21:00:37+00:00",
    "content": [
        {
            "text": "Series 21 of BBC Dragons’ Den has returned, and what a start! Episode 1 had us gripped with stories of socks that make a difference, specs that pop and super speedy gadgets to keep your washing dry if it rains. It was a brilliant watch."
        },
        {
            "text": "\nSocks that Stand Out"
        },
        {
            "text": "Now I love it when there's a good story behind a business, and here’s one that had me inspired from head to toe. Meet Christian Laing, little brother Ross Laing and Natalie Dickson, all of Stand Out Enterprises Limited. They told the Dragons their tale."
        },
        {
            "text": "The Stand Out team retails brightly coloured, premium, unisex socks – but these are socks with a difference. This business idea was inspired by co-founder Ross, a young man with Down Syndrome. The team developed their sock business to increase awareness of Down Syndrome and provide employment opportunities and financial independence for individuals with learning disabilities.\n"
        },
        {
            "text": "Did you know, as few as 5.1% UK adults with learning disabilities are known to be in paid employment? Recognising that brother Ross was part of that statistic, Christian and Natalie set out to create a job for him, giving rise to Stand Out Socks Enterprises."
        },
        {
            "text": "After a perfect pitch from the three entrepreneurs, the team asked the Dragons for £30,000 in exchange for 25% equity in their business."
        },
        {
            "text": "With such an inspiring story and a compelling trading history, the team attracted offers from all four Dragons."
        },
        {
            "text": "\"Let's do this! Let's Stand Out!\" said Ross, excitedly, when the team went to ‘speak to the wall’ to decide which Dragon they would like to walk beside them on their Stand Out Socks journey."
        },
        {
            "text": "Ultimately, snazzy sock-wearer Peter Jones and digital Dragon Steven Bartlett socked it to them with a shared offer of 25% for the £30,000 asked for, leaving the Stand Out team dancing out of the Den."
        },
        {
            "text": "\nPatents for a rainy day\n"
        },
        {
            "text": "It’s inventors like Colin O’Brien of PeggyRain that solve the world's problems. He entered the Den with a trio of inventions that can keep the rain off your washing, sound a 10 decibel alarm when someone tries to steal your bike or help you pull your suitcase up steps by means of a giant roller."
        },
        {
            "text": "One quick search of the register showed us that Colin is clued up about patenting his inventions in order to protect (or potentially monetise) them. While the Dragons were impressed by his array of ideas, it was Touker who decided to pair up with the innovative Irishman, settling on an offer of £80,000 for a 45% stake in his business."
        },
        {
            "text": "\nEyewear that pops"
        },
        {
            "text": "One very impressive entrepreneurial pair to come under the scrutiny of the Dragons’ lenses were Daniel Barnes and Lina Tejoprayitno, founders of innovative eyewear business, Pop Specs. The team’s proposition is to provide stylish, personalised eyewear in double quick time from kiosks sited within shopping parks."
        },
        {
            "text": "Daniel and Lina had Touker Suleyman firmly in their sights for sampling one of their products – a fetching pair of blue rimmed glasses. Chief Technician John Santos demonstrated the speediness of the service by cutting and finishing the stylish spectacles to Touker's personal prescription in around 20 minutes."
        },
        {
            "text": "Lina told how the Pop Specs team already has kiosks in 7 locations and they are ready to open in more locations across the country. “We want to disrupt, redefine and breath some fire into the eyewear industry”, added Daniel."
        },
        {
            "text": "The pair asked for £75,000 in return for a 5% share in their business."
        },
        {
            "text": "Daniel explained that the idea of kiosks in retail locations is that it saves on high rents. That helps to keep the price point low, which in turn helps to attract impulse purchasers. Shoppers can present their prescription, make their frame choice, pay their £50 and be back in 20 minutes to collect their glasses."
        },
        {
            "text": "The Dragons looked amazed when Lina outlined the figures so far: a turnover figure of £2 million with £400,000 net profit, and a net forecast of £5 million with £1.5 million net profit. It was when she mentioned the 3 to 4 month payback time for the set-up cost of a new kiosk - £60,000 for the kiosk and £20,000 for the equipment – that the Dragons’ eyes truly started popping."
        },
        {
            "text": "Daniel confessed that money wasn’t the key aspect of their pitch, however."
        },
        {
            "text": "Daniel shared the Pop Specs vision with the Dragons: a kiosk within 20 minutes of everyone in the UK and links to major supermarket chains."
        },
        {
            "text": "There was praise all round after the Pop Specs pitch, with Peter Jones branding the team a “breath of fresh air” and Steven Bartlett describing them as “credible”. Deborah and Steven declared themselves out of the frame, however, leaving the pair with an offer from Dragons Peter Jones, Touker Suleyman and Sara Davies. Each agreed to take a 4% stake in the business for a combined £75,000."
        },
        {
            "text": "Daniel and Lina are clearly entrepreneurs with a keen eye for business."
        },
        {
            "text": "Have you enjoyed our Dragons' Den IP Blog? Keep an eye out for our next editions as we follow the BBC Dragons' Den series."
        },
        {
            "text": " "
        },
        {
            "text": "Disclaimer:\nThe Intellectual Property Office (IPO) has an arrangement in place with the BBC to publish the Dragons’ Den IP Blog after each BBC Dragons’ Den episode. The purpose of the blog is to help identify the IP in entrepreneurs’ pitches and highlight how IP works, or could work, in the real-life examples featured. IPO’s authorship of this blog does not constitute its endorsement or sponsorship of any products, individuals or businesses referenced within it."
        }
    ]
}