{
    "url": "https://ofqual.blog.gov.uk/2024/01/04/embracing-challenges-a-reflective-journey-in-exams-administration/",
    "title": "Embracing challenges: a reflective journey in exams administration",
    "authors": [
        "Nicki Hlousek"
    ],
    "categories": [
        "A levels and GCSEs",
        "Exams",
        "Vocational and technical qualifications"
    ],
    "pub_date": "2024-01-04T09:30:32+00:00",
    "content": [
        {
            "text": "Nicki Hlousek, exams manager at Newcastle College, reflects on his experience as an exams officer and shares tips on how to be successful in the role."
        },
        {
            "text": "It has been quite a ride since my last blog back in April 2023, in which I wrote about the daily challenges all of us working in exams delivery face. Fast forward to the present, and we have been through another summer exam series, processed and released results to learners, dealt with new registrations, and concluded the autumn re-sits."
        },
        {
            "text": "It only proves the point I was trying to make – that our roles are as varied as they are challenging. Looking back at what we have achieved and how far we have come in just a few short months proves my other point – that our roles can be incredibly rewarding. The last academic year was full of new challenges and new opportunities."
        },
        {
            "text": "Reflecting on the past academic year, I admit it was tough at times for our exams office team at Newcastle College. However, there is a sense of pride and delight in the improvements we have made. Successfully delivering exam series and ensuring timely results would not have been possible without the hard work and dedication of our entire team, supported by our leadership, quality assurance, curriculum, admin, and learner support teams. This is another element of my earlier blog – collaboration with others, which I will focus on this time around too."
        },
        {
            "text": "Welcoming new team members to our team prompted me to focus on equipping them with the tools and knowledge needed to excel in their roles. I know from my own experience (and I hear this all the time from other exams officers) that it is exceptionally rare to have an opportunity of shadowing an experienced exams officer. This lack of meaningful handover is not unique to exams teams, but it seems more pronounced, possibly due to the unique demands of the role."
        },
        {
            "text": "We sometimes hear that new exams officers can experience especially tough times at the beginning, but with each exams series we learn to love our work. It is, therefore, hugely important for both new and experienced exams officers and SLT to take up awarding organisation training; training that supports us in understanding our roles and awarding organisations’ requirements. I have previously emphasised the pride and joy exams officers take in their roles once they become accustomed to the expectations. Here are my insights into what worked well for me, and I hope you find them useful if you are a new exams officer."
        },
        {
            "heading": 2,
            "text": "Strategic planning: the bedrock of success"
        },
        {
            "text": "Planning is crucial in any role, but in exams administration, it is paramount. Even if you’ve stepped into the role midway through the academic year, I would encourage you to take the time to go through the following tasks. It might help you identify what your school or college is already doing well, what will require your immediate attention and where you will need support from your line manager, senior leaders, or other colleagues."
        },
        {
            "heading": 2,
            "text": "Collaborate, communicate and cooperate"
        },
        {
            "text": "Identify key collaborators and meet with them to discuss the above-mentioned tasks. I believe you will be better able to navigate your role if you build your exam diary by considering key tasks, dates, and those colleagues you need to work closely with. These may include:"
        },
        {
            "heading": 2,
            "text": "Proactive approach: your key to success"
        },
        {
            "text": "While there may be many tasks to consider, you do not have to tackle everything simultaneously. Build your own exam diary that includes internal deadlines. You also do not need to tackle everything on your own. Consider who will need to supply you with information or help you achieve external deadlines, complete term-time data checkpoints, submit learner results and release of results."
        },
        {
            "heading": 2,
            "text": "Positive changes ahead"
        },
        {
            "text": "On another positive note, it is evident that the feedback from exams officers is being heard. Ofqual’s recent updates on the Delivery of VTQ results for 2024 and beyond reflect a commitment to addressing difficulties faced by exams officers. Changes include better dates for term-time checkpoints, advance release of results, and enhanced communication strategies."
        },
        {
            "text": "In conclusion, the journey of an exams officer may seem daunting, but with strategic planning, collaboration, a proactive approach, as well as positive changes on the horizon, the path becomes more manageable. Remember, you are not alone – reach out, seek support, and embrace the challenges as opportunities. And if you find the odd moment when you are having a good time, that is an extra bonus."
        },
        {
            "text": "I hope your academic year is a story of growth and success."
        }
    ]
}