{
    "url": "https://defrafarming.blog.gov.uk/2024/01/04/environmental-land-management-in-2024-details-of-actions-and-payments/",
    "title": "Environmental land management in 2024: details of actions and payments",
    "authors": [
        "Jonathan Baker"
    ],
    "categories": [
        "Countryside Stewardship",
        "Farming and Countryside Programme",
        "Sustainable Farming Incentive"
    ],
    "pub_date": "2024-01-04T11:29:57+00:00",
    "content": [
        {
            "text": "Today we published an update to the Agricultural Transition Plan on GOV.UK. It includes our progress, priorities and plans for the coming years.     "
        },
        {
            "text": "In it, you'll find our overall approach to agricultural reform: that food production can, and must, go hand in hand with the environment. Additionally, that by supporting productivity, innovation and ensuring our schemes work with food production, we will reach our ambitious environmental targets and maintain food production.  "
        },
        {
            "text": "We're pleased that farmers across the country continue to sign up to our schemes. To get to where we want to be, we want to support even more farmers to get involved and encourage those already taking action to go even further."
        },
        {
            "text": "We will achieve this by making environmental schemes and regulation more attractive, fair and workable. We also need ambition, which we will support by encouraging and enabling more targeted and effective action. "
        },
        {
            "text": "In 2024, we are taking a significant step forward to achieve that. We are: "
        },
        {
            "text": "This, and other changes, will make it easier for our schemes to slot into farm businesses, providing more money for farmers deliver change and ensure we get the scale and ambition we need to- positively impact the environment."
        },
        {
            "text": "There is something for every farm regardless of where it is and the land is owned or rented.  The Agricultural Transition Plan update  is designed to provide greater certainty. A full list of actions can be found in its technical annex."
        },
        {
            "text": "In this post, I’ll share a summary of the update. In the coming weeks, we will publish posts on the offer for farmers by sector. "
        },
        {
            "heading": 2,
            "text": "The offer in 2024 "
        },
        {
            "heading": 3,
            "text": "Update to scheme payment rates"
        },
        {
            "text": "We are updating scheme payment rates to reflect current market conditions, which for some actions like species rich grassland mean big increases.  "
        },
        {
            "text": "Scheme rates will increase by 10% on average. If you have a live SFI or CS agreement, you don't need to do anything to benefit, we will automatically apply any uplifts to existing agreements where applicable.  "
        },
        {
            "heading": 3,
            "text": "50 new actions"
        },
        {
            "text": "In summer, we will launch up to 50 new actions, which will allow you to access scheme funding for things like precision farming and agroforestry for the first time. The new actions improve the offer for all farm types, but especially those on moorland and grassland.  "
        },
        {
            "text": "We listened to feedback and introduced more ‘maintenance’ actions, alongside improving existing actions. These actions pay farmers who are already protecting the environment. For example, through maintaining grasslands, wetlands and scrub. "
        },
        {
            "text": "We made these changes so that farmers will get paid more for existing actions to maintain habitats, with the price of maintaining species rich grassland rising from £182 to £646 per hectare. This better reflects the reality of delivering these habitats and creates an incentive for farmers to create more. "
        },
        {
            "text": "Also, more actions will be available for shorter 3-year agreements, allowing greater flexibility. This will be of particular benefit to tenant farmers. "
        },
        {
            "text": "Elsewhere, we will introduce precision farming actions which use technology to target farming activities and reduce the use of costly pesticides or fertilisers.  "
        },
        {
            "heading": 3,
            "text": "Contracts for innovation"
        },
        {
            "text": "We will award up to 5, multi-million-pound contracts, with an initial value of up to £15 million, to promote crop innovation."
        },
        {
            "text": "By offering payments which support agricultural technology, such as robotic mechanical weeding technology, in addition to launching more grants in 2024, we will help you to adopt new technology or practices so you can grow more, sell more and have more resilient businesses."
        },
        {
            "heading": 3,
            "text": "Single application service"
        },
        {
            "text": "Not only will there be more choice, but the way you access the offer will improve. From summer, there will be a streamlined single application service for you to apply for SFI and CS Mid Tier actions. It will replace the separate application windows and processes."
        },
        {
            "text": "This simpler, clearer, and faster service will enable you to select from the range of actions available on your land and  combine compatible actions from SFI and CS on your land parcels more easily. "
        },
        {
            "text": "We will remove duplication between CS Mid-Tier and SFI actions, wherever possible. SFI agreement holders who entered into an agreement in 2023 will be able to either upgrade their existing agreement or apply for, and enter into, a separate 2024 agreement. "
        },
        {
            "text": "This change will make it easier for farmers to access our services but will have no reduction in ambition. It will allow us to combine the breadth of the CS offer with the simple and flexible administration of SFI. "
        },
        {
            "text": "CS Higher Tier agreements are different on each farm, and are more complex requiring advice, support and in many cases formal consent. We will continue to operate a separate process for these agreements, but we will offer the agreements through a simpler, clearer and faster service.  "
        },
        {
            "text": "Actions that are currently only available in CS Higher Tier will also be made available through our other offers. This means that, where appropriate, more farmers will be able access those ambitious elements, along with the accompanying advice and support for those, without having to have an entire bespoke Higher Tier agreement where that is not appropriate. "
        },
        {
            "text": "After 2025, we will start offering other schemes through this integrated service, including the England Woodland Creation Offer. "
        },
        {
            "heading": 3,
            "text": "Premium payments"
        },
        {
            "text": "We will introduce premium payment actions with the biggest environmental impact and also for combinations of actions that deliver benefits at scale. "
        },
        {
            "text": "Premium payment rates will be introduced from 2024 for the 21 high priority actions listed below. "
        },
        {
            "heading": 3,
            "text": "Regulation approach: advise and prevent"
        },
        {
            "text": "We are continuing to deliver a ‘advise and prevent’ approach across schemes and regulation, which will make things fairer for all farmers participating in schemes. Meaning the many farmers who want to do the right things will get the support you need if things go wrong.    "
        },
        {
            "text": "We will support farmers back into compliance with greater communication rather than immediate penalties and are firmly committed to safeguarding environmental standards and animal health through proportionate regulation and outcome-based incentives to drive change.  "
        },
        {
            "text": "Significant improvements have already been made but are continuing to go further. We are rebuilding the system with a tailored, risk-based approach to regulation that makes it easy to follow the rules. "
        },
        {
            "heading": 2,
            "text": "Plan for the future "
        },
        {
            "text": "With improved choice and payment rates, now is the time to apply for SFI. For more information visit our dedicated SFI site. It sets out the full offer."
        },
        {
            "text": "To help you manage the transition and plan, you can get free advice from an independent provider. "
        },
        {
            "text": "In this post, I’ve just covered our environmental land management schemes. The guidance for every scheme and grant on offer can be found on the Funding for farmers, growers and land managers page on GOV.UK. "
        }
    ]
}