{
    "url": "https://homeofficemedia.blog.gov.uk/2024/01/04/windrush-schemes-factsheet-november-2023/",
    "title": "Windrush Schemes Factsheet – November 2023",
    "authors": [
        "Home Office news team"
    ],
    "categories": [
        "Fact sheet"
    ],
    "pub_date": "2024-01-04T15:38:20+00:00",
    "content": [
        {
            "text": "We are determined to put right the terrible injustices faced by some people from the Windrush generation and the wider Commonwealth, which happened under successive governments."
        },
        {
            "text": "The Windrush Scheme ensures members of the Windrush generation can get the documentation they need to prove their right to be in the UK, free of charge.  Find out about the Windrush Scheme and how you can apply for a document to prove you can live and work in the UK, here. Once you have received your documentation, you might want to check if you are eligible to apply for compensation."
        },
        {
            "text": "Windrush Compensation Scheme"
        },
        {
            "text": "The Windrush Compensation Scheme was launched on 3 April 2019. You may be able to claim compensation if you suffered losses because you could not show that you had a right to live in the UK."
        },
        {
            "text": "The Windrush Documentation Scheme and the Windrush Compensation Scheme will remain open as long as they are needed, so no one is prevented from making a claim because a deadline has passed."
        },
        {
            "text": "To claim compensation, please check that you are eligible to make a claim. You will be eligible and can make a claim if:"
        },
        {
            "text": "You will also be eligible and can make a claim if you are:"
        },
        {
            "text": "You should complete all sections of the claim form and provide us with as much information as possible about how being unable to show your right to live in the UK affected you. This will ensure we are able to award you the maximum amount of compensation to which you are entitled."
        },
        {
            "text": "We will review Home Office records and will work with other Government Departments and statutory bodies to help gather and check the information you have provided as part of your claim."
        },
        {
            "text": "Further details on how to apply to the Windrush Compensation Scheme can be found at GOV.UK"
        },
        {
            "text": "On 4 January 2024, the Home Office published the latest set of data on the Scheme, which covers the period to the end of November 2023."
        },
        {
            "text": "The total amount paid to claimants through the Scheme has increased to over £75 million."
        },
        {
            "text": "£75.23 million has been paid across 2,076 claims. The statistics also show that over 78% of claims have had a final decision."
        },
        {
            "text": "During the month of November, the Home Office paid out over £1.66 million in compensation."
        },
        {
            "text": "Compensation payments are made as quickly as possible, but each person’s claim is deeply personal and deserves to be processed with the utmost care and sensitivity so that the maximum payment can be made to them."
        },
        {
            "text": "Individuals must accept their offer of compensation before it can be paid, or, if they are dissatisfied, they can ask for a review. This is first through an independent internal review (Tier 1) and, if someone remains dissatisfied, through an independent review by the independent Adjudicator (Tier 2)."
        },
        {
            "text": "For those who do need support, the Home Office has funded an organisation to provide free, independent claimant assistance to individuals for the duration of the Scheme, We Are Group (formerly We Are Digital)."
        },
        {
            "text": "If you need help filling in the claim form, the Windrush Help Team can put you in touch with a free independent adviser at We Are Group, or you can call them directly on 0808 196 8496."
        },
        {
            "text": "You can also call the Windrush Help Team for free."
        },
        {
            "text": "Telephone: 0800 678 1925\nMonday to Friday, 9am to 5pm"
        },
        {
            "text": "Improvements to the Compensation Scheme"
        },
        {
            "text": "Since the launch of the Compensation Scheme in 2019, we have continued to listen and respond to feedback from affected communities and stakeholders to ensure people receive the maximum compensation they deserve."
        },
        {
            "text": "In 2020, we made changes so people would receive significantly more money, more quickly. We introduced an early payment of £10,000 to people as soon as we identify they are entitled to an award. We raised the value of awards under the impact on life category at every level, with the maximum award increasing from £10,000 to £100,000. A total of over £75 million has been paid as of the end of November 2023."
        },
        {
            "text": "In 2021 we launched a package of support to help those making, or who have already made claims on behalf of a relative who has passed away, to obtain the legal documentation required to process their claims."
        },
        {
            "text": "We also removed the end date of the scheme to ensure no one is prevented from making a claim if they are eligible, simply because a deadline has passed or because we received more claims than we had planned for."
        },
        {
            "text": "In 2021 and August 2022 we published new claim forms, developed in consultation with stakeholders, that are easier to complete. The new forms include more targeted and closed questions to help people understand and provide the key information we need from them."
        },
        {
            "text": "The forms now have flexible options for claim submission, allowing customers to choose between filling in and submitting their claims digitally or opting for the traditional method of printing the forms and completing them by hand. They also have a Crystal Mark from the Plain English Campaign demonstrating our commitment to ensuring the scheme is accessible and as easy to use as possible."
        },
        {
            "text": "In August 2022 we broadened the homelessness category to allow awards to be made to people who were already homeless and then continued to be homeless due to an inability to demonstrate lawful status."
        },
        {
            "text": "The changes also included the removal of the cap, and removal of the requirement to demonstrate physical or mental health impacts due to homelessness. These changes ensure people are compensated for the full period they were homeless."
        },
        {
            "text": "We also introduced a fourth ‘Living Costs’ category for close family member claims for costs incurred whilst supporting someone who lost their employment or benefits because they were unable to prove their immigration status."
        },
        {
            "text": "In October 2023, we made changes to the Loss of Access to Employment category so that people who secured further employment before their status was resolved will continue to be compensated if their new earnings were less than the value of their monthly employment award. The period we will compensate for will now normally continue until 3 months after their status is resolved. This will mean some people will be compensated for longer periods and receive more money."
        },
        {
            "text": "We also removed the requirement for children and grandchildren of Commonwealth citizens settled in the UK before 1973, who were born in the UK or arrived in the UK before the age of 18, who are British citizens and were automatically British citizens or citizens of the UK and colonies at birth, to have been continuously resident in the UK since their birth or arrival. This change has also been made for children applying to the Windrush Documentation Scheme"
        },
        {
            "text": "Changes are always applied retrospectively and we notify individuals who are affected by the changes to let them know what this means for them. Please note, we are conducting an internal review of all claims where an award for Loss of Access to Employment has been paid or offered to identify those who benefit from the changes. We will write to those who do benefit in due course with an additional offer of compensation. People who do not benefit can contact the Help Team to request the reasons for this if they wish."
        },
        {
            "text": "We remain open to making further improvements and will continue to engage regularly with stakeholders and applicants."
        },
        {
            "text": "Example cases of people who have received compensation:"
        },
        {
            "text": "Windrush Scheme for Documentation"
        },
        {
            "text": "In May 2018 the Windrush Scheme was launched to ensure members of the Windrush generation could get the documentation they need to prove their right to be in the UK, free of charge."
        },
        {
            "text": "Over 16,700 people have been issued with documentation confirming their status or British citizenship up to Quarter 3, 2023."
        },
        {
            "text": "Individuals from a wide range of nationalities have been granted documentation after applying to the Windrush Scheme from within the UK, including a wide range of Commonwealth countries."
        },
        {
            "text": " Urgent and exceptional cases"
        },
        {
            "text": "In December 2018, the Home Office established an Urgent and Exceptional Payments process. The policy has a very clear purpose to provide support, including financial support, to members of the Windrush cohort who have an urgent and exceptional need, where this cannot wait for the full compensation scheme decision."
        },
        {
            "text": "The process remains open for those who need it."
        },
        {
            "text": "The total value of the payments approved to the end of November 2023, is £351,213.04."
        },
        {
            "text": "But this is just one way we help those in urgent need. There is also a dedicated Vulnerable Persons Team (VPT) to provide help and advice for more vulnerable people. This service also helps people:"
        },
        {
            "text": "To the end of November 2023, the VPT has provided support to 2,399 individuals."
        },
        {
            "text": "Community Engagement Fund"
        },
        {
            "text": "On 1 August 2023, the Home Office launched a £150,000 Community Engagement Fund. The aim of the 2023-24 Community Engagement Fund is to support charities, community, or grassroots organisations to raise awareness of the Windrush Schemes and gain insights from communities affected by Windrush, particularly around barriers to applying for the Windrush Schemes."
        },
        {
            "text": "The application process closed on 30 August. The Home Office has reviewed the applications against the criteria published in the ‘Guidance for Applicants’. Sixteen organisations were successful and funding has now been awarded to the 16 diverse groups and organisations, who applied for grants of between £5,000 and £10,000, to assist their engagement with individuals and communities about the Windrush Schemes."
        },
        {
            "text": "This will bolster efforts to reach as many individuals as possible who may be eligible to apply for documentation to confirm their status or for compensation."
        },
        {
            "text": "The funding will support activities and events to provide individuals with information about eligibility criteria, guidance on the application process, and to address any misunderstandings about what the Schemes cover."
        },
        {
            "text": "The successful bidders have demonstrated how they will reach communities and individuals within and beyond the Caribbean community, including Bangladesh, Pakistan, Nigeria, Ghana, and India. This follows feedback from Wendy Williams’ progress update that said more needed to be done to identify and reach out to wider affected groups."
        },
        {
            "text": "Through the fund, the Home Office will build on insights and learnings, already taken from the previous Windrush Community Fund, to understand why some individuals may not yet have come forward to apply for documentation or compensation and how best to encourage eligible individuals to apply for both schemes."
        },
        {
            "text": "Promotion of the Schemes and supporting communities"
        },
        {
            "text": "The £500,000 Windrush Community Fund (WCF) was launched in December 2020 to support community and grassroots organisations to run outreach and promotional activity to raise awareness of the Windrush Scheme (Documentation) and Windrush Compensation Scheme."
        },
        {
            "text": "Twenty-seven community organisations were awarded monies under the two phases of the WCF. Phase one projects were completed by end of August 2022. Phase two projects have also now been completed."
        },
        {
            "text": "Projects successfully reached out to and supported individuals in a variety of ways including signposting to additional support, assisting with Windrush Compensation or Documentation Scheme applications, sharing knowledge, and addressing misinformation about the Schemes or the role of the Home Office.”"
        },
        {
            "text": "Amounts offered and paid month by month to Windrush Compensation Scheme claimants up to the end of November 2023"
        },
        {
            "text": "Notes:"
        },
        {
            "text": "Breakdown of full and final offers and payments made to Windrush Compensation Scheme claimants, up to the end of November 2023"
        },
        {
            "text": "Table Special Values: * indicates fewer than 5 customers; and - indicates no offers or payments in the given pay range."
        }
    ]
}