{
    "url": "https://forestrycommission.blog.gov.uk/2023/01/30/defras-trees-and-forestry-team-looking-back-at-a-busy-year/",
    "title": "Defra’s Trees and Forestry team – looking back at a busy year",
    "authors": [
        "Bella Murfin and Naomi Matthiessen"
    ],
    "categories": [
        "Tree Planting",
        "Woodland creation"
    ],
    "pub_date": "2023-01-30T16:47:15+00:00",
    "content": [
        {
            "text": "We’re now into our third planting season since the Programme got off the ground, and we explored some of the build-up in our August blog. This one looks back at the last 6 months delivering the Government’s commitment to treble tree planting in England by the end of 2025."
        },
        {
            "text": "Our fantastic team continue to make real progress towards tree planting targets and transforming the way that we create and manage woodlands in England. There have been some great highlights, including:"
        },
        {
            "text": "To learn more about these highlights and what the Trees and Forestry team have been up to, read on!"
        },
        {
            "heading": 2,
            "text": "Summer’s seeds of change"
        },
        {
            "text": "In August we launched a £44.2 million fund to support our Community Forests and woodland creation partners. This will support the creation of more diverse and innovative woodlands, designed to increase resilience to climate change and flood risks as well as provide habitat cover for nature and offset biodiversity loss."
        },
        {
            "text": "England’s 13 Community Forests will benefit from the funding. Work also started to select two more Community Forests to add to the network, and once these are up and running, they too will benefit from this funding."
        },
        {
            "text": "In September, Defra helped to organize the world’s first ever International Plant Health Conference (IPHC) in London, attended by around 500 policymakers, academics and experts from over 74 countries. By sharing knowledge and research across a range of issues such as pests, diseases and invasive species, the conference has fostered a level of international collaboration that will strengthen global biosecurity standards and international plant health for generations to come."
        },
        {
            "text": "Later in September we announced a £1.2m Seed Sourcing Grant to boost domestic tree seed production, create green jobs and meet the increased demand for trees in line with our planting targets. It’s so important to be growing and developing every part of the story when it comes to trees, from seeds to trees to people."
        },
        {
            "heading": 2,
            "text": "Our new Forestry Apprentices put down roots"
        },
        {
            "text": "And on the people front, we saw the first cohort of 15 Development Woodland Officers starting their apprenticeships in forestry management at the University of Cumbria. This exciting scheme will help to upskill and diversify the forestry sector workforce, which in turn will expand the workforce capacity for the long-term, supporting the Government’s tree planting and woodland creation ambitions over the coming years. It’s a great example of the transformational work of the Nature for Climate Tree Programme, alongside getting trees in the ground."
        },
        {
            "text": "Apprentices will undertake a placement in Forestry Commission host teams across England to receive additional on-the-job training. We’ve been hearing about why apprentices have joined the scheme, like Charlotte Heslop who has talked about how she wants to develop a foundation of knowledge that will support her future career, and help others to get informed, interested, and passionate about forestry in the UK."
        },
        {
            "heading": 2,
            "text": "Celebrating all things trees with National Tree Week"
        },
        {
            "text": "November and December were busy months for Team Trees as we supported both COP27 and National Tree Week. At COP, we announced the appointment of Federated Hermes and Finance Earth as fund managers for the ground-breaking Big Nature Impact Fund, after a rigorous procurement exercise. Defra’s seed investment was announced alongside other key funding at the COP27 summit, where Environment Secretary Thérèse Coffey called on countries to come together to tackle nature loss."
        },
        {
            "text": "The UK government will commit £30million of seed finance into the Big Nature Impact Fund, unlocking private investment for potential projects such as tree planting or restoring peatlands, supporting habitat creation, carbon sequestering and improving air and water quality."
        },
        {
            "text": "National Tree Week kicked off with the announcement of £20 million for three different funds that facilitate tree planting, timber production and woodland innovation and resilience. The Woods into Management Forestry Innovation Funds, Tree Production Innovation Fund and the Woodland Creation Accelerator Fund, will support local authority tree planting initiatives in communities across England."
        },
        {
            "text": "To celebrate National Tree Week, our delivery partners The National Forest teamed up with Aardman Animations' famous Sean the Sheep, to help get to their 10 millionth planted tree. We sadly didn’t get to meet Sean ourselves (much to our children’s disappointment!) but Minister for Environment Trudy Harrison did when she visited the NCF funded Minorca Woods site on November 29th and helped to plant a native oak tree."
        },
        {
            "text": "It was during National Tree Week that analysis on the extent of damage caused to trees from last year’s winter storms was published. Forest Research assessments showed around 12,750 hectares of trees were lost as result of winter storms, with most of the damage being attributed to Storm Arwen in November 2021. Over 90 percent of trees which fall as a result of storm damage will be replanted, meaning only a small percent of forest is lost in the long term where it is not possible to restock."
        },
        {
            "text": "More diverse tree species and better designed woodlands are key to creating resilient woodland in the face of climate change, namely stronger gales, severe weather, drought in the summer and emerging pests and diseases."
        },
        {
            "text": "National Tree Week concluded with the announcement of funding to plant trees in communities across the country in honour of the late Her Majesty Queen Elizabeth through The Queen’s Green Canopy (QGC) initiative. Almost half a million pounds will be used to plant trees across England and engage communities with limited access to nature and green spaces."
        },
        {
            "text": "Planting plans are already underway, with The Tree Council planning to plant 69,000 whips and create 14km of hedgerow in up to 50 locations, which will be chosen to increase biodiversity, local nature recovery and future flood alleviation. Trees for Cities will extend their “Forgotten Places” programme across five areas that are nature-deprived, planting a total of over 5,000 trees and Earthwatch will plant 1,800 trees to create three “Tiny Forests” (a dense, fast-growing native woodland the size of a tennis court) in urban areas with low woodland cover."
        },
        {
            "text": "To close this blog, we want to highlight just how much trees are already worth to the economy, estimated by Forest Research at the end of the year. Single trees (defined as trees outside of woodlands in urban and rural areas) have been valued at an incredible £3.8 billion. This valuation takes in to account the role trees play in mitigating climate change and damage caused to infrastructure and the public as result of flooding and other extreme weather. Other benefits include temperature regulation as our summers get hotter and drier, as well reducing noise and air pollution in urban areas. It’s an absolute privilege to be helping that number to grow."
        },
        {
            "text": "What a year it’s been! With even more funding and projects to look forward to in the year ahead, we’re optimistic about what we can all achieve in 2023."
        }
    ]
}