{
    "url": "https://dluhcdigital.blog.gov.uk/2023/01/30/dluhc-housing-and-planning-minister-visits-buckinghamshire-council/",
    "title": "DLUHC Housing and Planning Minister visits Buckinghamshire Council to see new Digital Planning software in action",
    "authors": [
        "Digital Planning"
    ],
    "categories": [
        "Digital Planning"
    ],
    "pub_date": "2023-01-30T16:01:33+00:00",
    "content": [
        {
            "text": "DLUHC’s Housing and Planning Minister, Lucy Frazer, visited Buckinghamshire Council on the 26 January to learn more about Buckinghamshire’s experience of being part of the Open Digital Planning (ODP) project, demo new user-centred Digital Planning services and hear more about the council’s wider ideas for streamlining the planning system as part of the department’s Digital Planning Programme. "
        },
        {
            "text": "The minister met with a range of representatives from across the council including leaders, members and council officers who have been directly involved in the DLUHC funded ODP Project which brings together pioneering councils who have joined together with digital agencies to co-design, build, test and launch better software used for planning."
        },
        {
            "text": "Together with ODP project partners Lambeth and Southwark Councils, Buckinghamshire was one of the first LPAs to launch new live services to citizens in 2022. Two of the ODP products were demonstrated to Minister Frazer during the visit - PlanX and BOPS (formally RIPA and BOPS). "
        },
        {
            "text": "PlanX is a digital platform designed to simplify citizen-facing services, including the “Find Out If You Need Planning Permission” guidance service and “Apply for a Lawful Development Certificate” application service. "
        },
        {
            "text": "These two services help residents and professionals to understand which permitted development rights exist on a property, and to submit proposals where planning permission is unlikely to be needed. A Lawful Development Certificate is the proof that a project is lawful for planning purposes, such as works allowed under permitted development."
        },
        {
            "text": "PlanX allows planners to write planning legislation and policies in a machine-readable way based around simple rules such as whether a proposed extension is above or below a specified height. This simple approach to permitted development rights allows applicants to learn what they can do by answering a series of simple questions written in plain English and supported by visual guides."
        },
        {
            "text": "Lawful Development Certificate applications received by local councils can then be validated and processed via the Back Office Planning System (BOPS) service. BOPS is primarily a user-centred case-management system for local authorities, allowing planning officers to reach planning decisions quickly, but it also enables direct communications between planning officers and applicants, for example, when amendments to a proposal are needed."
        },
        {
            "text": "BOPS clearly indicates whether the application meets the criteria set out in the rules-based elements of the system, and points planning officers to the core decision they need to make using their experience and judgement. "
        },
        {
            "text": "Housing and Planning Minister, Lucy Frazer said:"
        },
        {
            "text": "“It was fantastic to hear about the work going on in Buckinghamshire in the Digital Planning space. We want to ensure the public are better connected to the planning issues and decisions that affect them whilst also supporting councils to develop cutting edge services which will save them time and money."
        },
        {
            "text": "These new digital services will modernise the planning system, speeding up applications and help us to deliver our levelling up mission.”"
        },
        {
            "text": "Councillor Martin Tett, Leader of Buckinghamshire Council said:"
        },
        {
            "text": "“We’re proud to be working with government to pilot new prototype software which will streamline and simplify the planning process for applicants and the council alike – and we’ve been delighted to welcome the Minister to Buckinghamshire today so show her this software in action."
        },
        {
            "text": "As a new council, we’re proud to be at the forefront of developing and trialling new ways of working for councils that ultimately bring big benefits to our residents.”"
        },
        {
            "text": "The Planning Software Improvement Fund was open for applications at the end of 2022, with successful councils set to be announced within the next month. Funding will be awarded to councils who have applied to one of three tracks, one of which is to join the ODP project and work alongside current project councils like Buckinghamshire to co-design and adopt user-centred Digital Planning software. "
        },
        {
            "text": "You can find out more about ODP on the project’s dedicated website."
        },
        {
            "text": "Work to improve the software used to process planning applications is only one part of DLUHC’s Digital Planning programme which is using digital tools and data to improve the current planning system, saving time and money for people and Local Planning Authorities (LPAs)."
        },
        {
            "text": "Other areas of the programme include:"
        },
        {
            "text": "You can follow the DLUHC Digital Planning Programme’s Twitter and LinkedIn pages for regular programme updates."
        }
    ]
}