{
    "url": "https://educationhub.blog.gov.uk/2023/10/19/israel-hamas-conflict-advice-schools-ministers/",
    "title": "Israel-Hamas conflict: Advice for schools from Ministers",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Colleges",
        "Schools"
    ],
    "pub_date": "2023-10-19T13:03:26+01:00",
    "content": [
        {
            "text": "Education Secretary Gillian Keegan, the Minister for Schools and the Minister for Skills have written to schools and colleges (17 October 2023) to provide advice on how to respond to the Israel-Hamas conflict in the classroom."
        },
        {
            "text": "Dear school and college leaders,"
        },
        {
            "text": "Following the barbaric terrorist attacks in Israel, we are writing to provide advice for schools and colleges. The UK unequivocally condemns these terrorist attacks and stands in solidarity with Israel in its hour of need."
        },
        {
            "text": "The Prime Minister has announced that £3 million of extra funding will be provided to the Community Security Trust to protect schools, colleges, nurseries and synagogues and other Jewish community buildings."
        },
        {
            "text": "Schools and colleges offer children, young people and staff a safe environment in which to learn and work."
        },
        {
            "text": "Hamas is a proscribed terrorist organisation, and it is illegal to encourage support for them. This would also be contrary to the British values that schools and colleges should promote and embody."
        },
        {
            "text": "To support senior leaders and teachers manage these discussions, there are several reputable organisations that offer resources to teach about this sensitive topic in a balanced way and challenge extreme and hateful narratives. The Department’s Educate Against Hate website provides a range of resources to support with challenging discrimination and intolerance. It also provides advice on how to respond where you have concerns."
        },
        {
            "text": "We know that recent events will result in teachers being put in difficult positions at school, as children understandably ask questions and share their opinions. In some cases, children may have been exposed to false or inappropriate information outside of school, making the role of the teacher in responding to children even harder.  As with other sensitive topics, teachers and staff will of course be using their judgement and expertise to navigate these discussions, in a way that maintains high standards of ethics and behaviour."
        },
        {
            "text": "We know that young people may have a strong personal interest in these issues, which could lead to political activity. Schools and colleges should ensure that any political expression is conducted sensitively, meaning that it is not disruptive and does not create an atmosphere of intimidation or fear for their peers and staff. This includes not only where behaviour appears to celebrate or glorify violence, but also any expression of views that feels targeted against specific groups or stigmatises others. The Department has published guidance to help schools navigate teaching about political issues."
        },
        {
            "text": "In the past, we have seen how events in the Middle East are used as an excuse to stir up hatred against communities, including in schools and colleges. It is of the utmost importance that schools and colleges tackle this head on and ensure that where behaviour extends into antisemitism or other discriminatory bullying, it is responded to with all due seriousness. There is also support through the Prevent programme if teachers consider that abusive or discriminatory views indicate a wider vulnerability to radicalisation. There is guidance available on GOV.UK on how to assess risk of radicalisation and make a referral."
        },
        {
            "text": "There are trusted external bodies, which can provide support:"
        },
        {
            "text": "We ask that you do whatever you can to actively provide Jewish and all young people with the reassurance they need and respond swiftly to any incidents. We know that you will work to ensure that your schools and colleges remain calm, safe and supportive environments, where everyone can thrive in safety and respect."
        },
        {
            "text": "Yours sincerely,"
        },
        {
            "text": "The Rt Hon Gillian Keegan MP, Secretary of State for Education"
        },
        {
            "text": "The Rt Hon Nick Gibb MP, Minister for Schools"
        },
        {
            "text": "The Rt Hon Robert Halfon MP, Minister for Skills, Apprenticeships and Higher Education"
        }
    ]
}