{
    "url": "https://environmentagency.blog.gov.uk/2023/10/19/my-experience-interning-with-the-environment-agency/",
    "title": "My Experience Interning with the Environment Agency",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Environment Agency"
    ],
    "pub_date": "2023-10-19T14:00:48+00:00",
    "content": [
        {
            "text": "By Arani Jivithkumar, Climate Change and Energy Team Intern at the Environment Agency "
        },
        {
            "text": "Mitigating and adapting to the effects of climate change is something I’m very passionate about. From experiencing heatwaves first-hand here in the UK, to hearing about drinking-water wells drying up due to drought in my parents’ villages in Sri Lanka, witnessing the negative impacts of climate change across the world is what initially pushed me to pursue a career in this field."
        },
        {
            "text": "After graduating with an MSc in climate science, I was struggling to find a job in the sector. Although I had the relevant knowledge from my masters, I didn’t have any relevant work experience. Through the Summer Diversity Internship Programme (SDIP) here at the Environment Agency (EA), I’ve been able to get this experience and so much more. Everyone I’ve worked with has been welcoming and continuously encouraged me to provide my thoughts and challenge ideas."
        },
        {
            "text": "I began my internship in July 2023, within the EA’s Sustainable Business Team (SBT) and have gained first-hand experience working on the EA’s ambition to reach Net Zero by 2030, as part of the Environment Agency EA2025 plan. My role has included:"
        },
        {
            "text": "One of the particularly rewarding tasks was helping provide Carbon Literacy Training to all EA staff, alongside the Carbon Literacy Trust. It has been amazing to see for example, how 7,300 employees out of about 11,000 employees have become Carbon Literates here at the EA!"
        },
        {
            "text": "I also had the opportunity to take this training myself, which helped me understand the EA’s ambition to reach Net Zero by 2030, as well as my own carbon footprint and what I can do to reduce it. The training also gave me a great summary of climate change policies, causes, and impacts. Leading a discussion (a vital part of the training) with other EA employees helped me understand their thoughts on climate change too and we all learned to really think about and share how we can reduce our carbon footprints - from how we get to and from work, to saving energy at home."
        },
        {
            "text": "I hope that everyone in the UK and abroad can get access to some form of climate learning, as I believe it’s vital to help each of us effectively reduce our carbon footprints and win our fight against climate change."
        },
        {
            "text": "Beyond the internship itself, I was also able to gain access to valuable volunteering opportunities. I became a Volunteer Climate Officer with the Collective for Climate Action, which helped me develop my skillset further, network, and learn more about climate change in practice."
        },
        {
            "text": "I hope to continue to volunteer as a Climate Officer with the Collective for Climate Action even after my internship for many years to come, as I also believe that greater communication is necessary for greater climate action."
        },
        {
            "text": " What’s next?"
        },
        {
            "text": "In October 2023, I’m excited to be extending my internship with the EA in the Climate Change and Energy Team. I hope to broaden my network, continue to work with stakeholders, and gain new experiences in the climate sector. After my internship concludes next year, I want to stay on as a permanent employee here at the EA or continue to work in the public sector as a Civil Servant."
        },
        {
            "text": "Interning here at the EA has been a once-in-a-lifetime experience for me. I am so thankful to everyone I’ve worked with and the SDIP organisers who have helped me to develop my skills, and get my foot-in-the-door in the climate sector."
        },
        {
            "text": "One of the major lessons I learned from the people I worked with here at the EA is that with climate change, you should never give up, and no action to reduce our contributions to climate change is too small. Whether you support climate education in your workplace, volunteer for a climate organisation, reduce the food you waste, use reusable products, reduce car travel, write to your local MP, or plant trees, I encourage you to do what you can to help our planet."
        },
        {
            "text": "At the Environment Agency, we know our people are our greatest asset. We want our workforce to reflect the diverse communities we work with, to help us create a better place for everyone."
        }
    ]
}