{
    "url": "https://nationalscreening.blog.gov.uk/2023/10/19/progress-update-on-uk-nsc-work-to-assess-newborn-screening-for-sma/",
    "title": "Progress update on UK NSC work to assess newborn screening for SMA ",
    "authors": [
        "Jo Harcombe"
    ],
    "categories": [
        "General"
    ],
    "pub_date": "2023-10-19T13:47:55+01:00",
    "content": [
        {
            "text": "In August, we blogged about the UK National Screening Committee’s (UK NSC’s) assessment of newborn screening for spinal muscular atrophy (SMA). "
        },
        {
            "text": "The project’s next steps, as endorsed by UK NSC committee members at their June 2023 meeting, are to: "
        },
        {
            "text": "SMA stakeholders played an active role in 2 workshops over the summer as part of the model scoping stage of the project.  "
        },
        {
            "text": "Commissioning and procurement of the new cost-effectiveness model has begun and scoping work for the ISE is progressing well.  "
        },
        {
            "text": "An SMA ISE Oversight Group will be established to support development of the ISE. A planning meeting for this oversight group is scheduled for November 2023 and will comprise UK NSC members and colleagues from the 4 NHS’s. The purpose of the November meeting will be to agree the ISE’s governance and stakeholder engagement arrangements. "
        },
        {
            "text": "The first full SMA ISE Oversight Group will be held after this with a range of appropriate stakeholders invited as members.  "
        },
        {
            "heading": 2,
            "text": "UK NSC's recommendation "
        },
        {
            "text": "At its June 2023 meeting, the UK NSC recommended that a new independent modelling study on screening for SMA in the UK should be commissioned. "
        },
        {
            "text": "Members also supported a proposal from the UK NSC’s fetal, maternal and child health (FMCH) expert group that work should start, in tandem, on planning for an ISE to test how SMA screening could be implemented in NHS services in the UK.  "
        },
        {
            "text": "The new model will help define important issues for the ISE while the evaluation will be used to collect data to feed into the model and test its assumptions. The findings of the evaluation will provide specific evidence on how newborn screening for SMA might work safely in the UK. "
        },
        {
            "text": "The model and ISE will then inform the final UK NSC recommendation to ministers in all 4 UK countries on whether to recommend that SMA should be added to the UK’s newborn blood spot screening programmes. "
        },
        {
            "heading": 2,
            "text": "UK NSC blog"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK NSC. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, please email screeninginformation@dhsc.gov.uk."
        }
    ]
}