{
    "url": "https://levellingupadvisorycouncil.blog.gov.uk/2023/10/19/the-framework-for-levelling-up-the-uk-part-iii/",
    "title": "The Framework for Levelling Up the UK - Part III",
    "authors": [
        "Andy Haldane"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2023-10-19T07:00:33+01:00",
    "content": [
        {
            "heading": 2,
            "text": "Part III - Looking Forward "
        },
        {
            "text": "As set out in part II of this blog, the framework for levelling up outlined in the Levelling Up White Paper (LUWP) is beginning to take shape, not least through with the passage later this year of the Levelling Up Bill, the on-going process of devolution and the evolving role of the LUAC. Overall, my judgement is there has been greater progress in enacting the regional policy framework laid out in LUWP than is commonly appreciated. "
        },
        {
            "text": "At the same time, while policy decision-making processes may have changed, the outcomes faced by most people, especially in poorer parts of the UK, so far have not. To some extent this simply reflects the fact that it takes time to reverse long-standing vicious cycles in performance. That is why missions were set a decade ahead. "
        },
        {
            "text": "Nonetheless this means that, while the progress towards levelling up might be greater than the general public realise, it is less than many were expecting. This expectations gap needs to close if the credibility of levelling up policies is to grow over time. What more might be done to enhance the credibility of this framework for regional policies?  Let me conclude with a few speculative suggestions for doing so. "
        },
        {
            "heading": 3,
            "text": "Conclusion "
        },
        {
            "text": "This blog has set some of the progress on levelling up since the publication of the LUWP. Future blogs will explore in detail some of the issues being pursued by the LUAC and other ideas for supporting the Government’s levelling up agenda. This is an agenda on which good progress is being made but whose importance to the UK’s citizens has continued to grow and disparities across the UK have continued to widen.  "
        }
    ]
}