{
    "url": "https://levellingupadvisorycouncil.blog.gov.uk/2023/10/19/the-framework-for-levelling-up-the-uk-part-ii/",
    "title": "The Framework for Levelling Up the UK - Part II",
    "authors": [
        "Andy Haldane"
    ],
    "categories": [
        "Levelling up"
    ],
    "pub_date": "2023-10-19T07:00:57+01:00",
    "content": [
        {
            "heading": 2,
            "text": "Missions, Governance and Accountability"
        },
        {
            "text": "In Part I of this blog I set out the framework for levelling up the UK. Part II asks how are we performing against this framework.   "
        },
        {
            "heading": 3,
            "text": "Missions  "
        },
        {
            "text": "The purpose of the 12 missions set out in the Levelling Up White Paper (LUWP) is to support long-term decision-making across a wide range of policy fronts. To do so effectively, these missions need to be set out transparently in advance, calibrated in a way that balances ambition and feasibility. They need to be evaluated rigorously to ensure policy actions and final outcomes are on the critical path towards meeting the missions.  "
        },
        {
            "text": "In the eighteen months since the LUWP was published, many of these elements are, or are about to be put, in place. The thinking behind the choice of these missions, and their calibration, was set out clearly in the LUWP. These missions are now being put into UK primary legislation through the Levelling Up and Regeneration Bill. This is currently working its way through Parliament, with Royal Assent likely in the third quarter of 2023.  "
        },
        {
            "text": "This Bill requires the Government to issue a statement of levelling up missions and to update this at least once every five years, openly and transparently. This will mean the missions themselves are subject to regular Parliamentary and public scrutiny. The Bill also requires annual reporting by the Government on progress towards meeting these missions, with this reporting to start no later than a year after Royal Assent.  "
        },
        {
            "text": "As long-term objectives, meeting the missions will take time. So key aspect of this accountability will be determining a set of intermediate metrics to track and assess progress towards meeting the missions. The LUWP set out a provisional set of monitoring metrics and it is likely that the first published annual report on meeting the missions will elaborate on them. "
        },
        {
            "text": "Having the missions, and a reporting framework for them, set out in primary legislation would represent a significant strengthening of the framework for regional policy in the UK. It would provide clarity, long-termism and greater robustness in policy through enhanced transparency and scrutiny. The missions themselves would require Parliamentary approval before being significantly altered or abandoned. "
        },
        {
            "text": "As this statutory framework is not yet in place, it is too early to know how in practice it will operate. How rigorous will be the scrutiny of the missions? How objective will be the reporting on progress relative to the missions? These will be the acid tests of the credibility of the new framework. So far, external evaluations suggest progress towards meeting the missions has been modest."
        },
        {
            "heading": 3,
            "text": "Governance "
        },
        {
            "text": "On governance and decision-making, there have been significant changes to the machinery of both central and local government over the past eighteen months. To a significant extent, these changes have so far gone under the radar, despite their important implications for spatial decision-making. "
        },
        {
            "text": "Within central government, levelling-up is an across-Whitehall endeavour. To that end, Whitehall departments have been allocated lead responsibility for taking forward each of the missions. Departmental decision-making, monitoring and co-ordination is then brought together at regular meetings of an Inter-Ministerial Group (IMG) drawn from across ministries.  "
        },
        {
            "text": "IMG deliberations are not made public but will presumably help shape annual reporting on the missions. The last Government Spending Review made progress in reporting on the geographic allocation of spending by different departments. It will be important to build on that at future Spending Reviews, so that every Whitehall department is clear about its spatial footprint and hence its contribution to levelling up. "
        },
        {
            "text": "There are some early-stage signs of spending being reallocated towards less well-performing places in some Whitehall departments. For example, recent decisions as part of the National Portfolio Organisation review by Arts Council England (ACE) saw a significant reallocation towards the North of England. Elsewhere, the Government has ensured that additional investment is growing emerging clusters outside the Greater South East - for example the launch of three Innovation Accelerators in Glasgow, Manchester and the West Midlands. This supports the growth of high-potential innovation clusters with £100 million invested in 26 projects across the three areas.     "
        },
        {
            "text": "On local decision-making, there has been material progress in rolling out the framework for devolution over the past eighteen months. A significant number of places have begun the process of becoming Mayoral combined authorities or are pursuing county deals, among them York and North Yorkshire, the East Midlands, the North-East, Norfolk and Suffolk.  When this mission was set in 2022, around 40% of the English population lived in an area with a devolution deal. The five deals agreed in 2022 will bring devolution to more than half of the English population. "
        },
        {
            "text": "In addition, the Greater Manchester and West Midlands combined authorities have both signed “trailblazer” deals, materially extending their powers and serving as a blueprint for others. A significant element was the move to a single department-style funding settlement at the next Spending Review. This will not only simplify the funding landscape for these regions, but will also increase the West Midlands Combined Authority and Greater Manchester Combined Authority’s autonomy, ability to prioritise decisions locally, and ability to reprioritise across their own budgets.  "
        },
        {
            "text": "In his speech to the Local Government Association (LGA) in July, Secretary of State Michael Gove set out the principles guiding future local government financing, including making its less subject to costly competitive bidding.2 Once applied to all devolved areas, these principles would mark a transformation in the relationship between central and local government, with a far less complex, competitive, fragmented, short-term local financing landscape.   "
        },
        {
            "text": "As important as devolution for local regeneration is enhanced strategic partnership across the different sectors in a region – private sector businesses, universities, charity and community groups, as well as local government. This new model of governance is essential if local strategies are to be designed and delivered in a way that work for all interested parties. Two new initiatives have recently been implemented to enhance this cross-sector coordination. "
        },
        {
            "text": "The first are the Investment Zones (IZs), announced in the Budget earlier this year in 12 regions across all nations of the UK.3 These are intended to serve as a catalyst for innovation clusters, drawing together local business, government and universities in a local industrial strategy. The first of these IZs was launched in South Yorkshire in July, centred on advanced manufacturing with more due to follow.  "
        },
        {
            "text": "The second are Levelling Up Partnerships (LUPs). These are also intended to foster regeneration at the community level, including by developing social infrastructure.  The LUP programme, also announced at the Spring Budget, is providing bespoke place-based regeneration in an initial twenty of England’s areas most in need of levelling up. The intention is to consult with the Devolved Administrations to explore potential options in Scotland, Wales, and Northern Ireland. Partnership locations were selected based on analysis in the Levelling Up White Paper and metrics of levelling up need. Partnerships will include local leaders and mayors in councils and combined authorities, local businesses from all sectors, community organisations and residents coming together to identify and address the biggest barriers to levelling up. "
        },
        {
            "heading": 3,
            "text": "Transparency and Accountability "
        },
        {
            "text": "Finally, on transparency and accountability, there have also been significant strides forward since publication of the LUWP. On data, the Office for National Statistics have progressed significantly their sub-national data strategy.  One example of this is public-funded research and development (R&D) expenditure, where the ONS led an exercise with the three central government departments with the highest expenditure to compile financial microdata. The output was a new dataset that revealed the distribution of public R&D expenditure sub-nationally, allowing government to monitor progress on the Levelling Up mission to increase public R&D expenditure outside the Greater South East. In parallel, the Department for Levelling Up, Housing and Communities (DLUHC) have put in place a spatial data unit to inform decision-making on local issues.  "
        },
        {
            "text": "Most recently, the Office for Local Government (Oflog) has been launched. Oflog is intended to serve as a central repository of data and analysis on the performance of local government. This will enhance accountability and performance-tracking both by central government and by local citizens. In time, it should enable lessons to be drawn from local experience and practice.  "
        },
        {
            "text": "Complementing this new accountability infrastructure is the LUAC – an independent, expert body charged with supporting the Government’s levelling up policies. The LUAC comprises 12 experts drawn from across all sectors and nations of the UK.4 It aims to provide rigorous advice and analysis to support the design and delivery of the Government’s levelling up missions, supported by a staff secretariat in DLUHC. "
        },
        {
            "text": "The LUAC is a non-statutory body, reporting into the Secretary of State for Levelling Up. It meets on a regular quarterly basis and so far has met on 9 occasions. Members of the LUAC have spoken externally on a number of occasions about levelling up. In time, I would expect LUAC members to give evidence at Parliamentary hearings, including on progress against the missions. Members of LUAC attend, when invited, the IMG meetings in Government on the missions. "
        },
        {
            "text": "The LUAC has put in place a range of workstreams covering on topics central to the success of levelling up. These are typically led by individual LUAC members, supported by a working group of expert participants drawn from local communities, central government, universities, think-tanks and businesses. The topics covered include:  "
        },
        {
            "text": "In addition, and supporting this work, the LUAC has drawn up a wide ranging long-term research agenda to explore a number of the most pressing questions facing levelling up policies. The LUAC is currently putting in place a research infrastructure to take forward these questions. "
        },
        {
            "text": " "
        }
    ]
}