{
    "url": "https://levellingupadvisorycouncil.blog.gov.uk/2023/10/19/the-framework-for-levelling-up-the-uk/",
    "title": "The Framework for Levelling Up the UK - Part I",
    "authors": [
        "Andy Haldane"
    ],
    "categories": [
        "Levelling up"
    ],
    "pub_date": "2023-10-19T07:00:40+01:00",
    "content": [
        {
            "text": "The UK’s geographic disparities have been a long-standing policy concern. But having widened further over recent years, to levels last seen a century ago, closing these disparities has risen to the top of the UK’s public policy agenda. This is so-called “levelling up”. As co-author of the Government’s Levelling Up White Paper, and now as Chair of its Levelling Up Advisory Council (LUAC), I have had the benefit of a ringside seat as levelling up has moved from conceptual design to practical delivery.   "
        },
        {
            "text": "Historically, the UK has not lacked for regional policies. There have been at least a dozen attempts since the Second World War to redress imbalances across the UK’s regions. As regional disparities have widened materially over the same period, to their highest levels in more than a century and to higher levels than in most Western advanced economies, these attempts have plainly fallen short of their ambitions. "
        },
        {
            "text": "The reasons for this are not difficult to diagnose. Evidence suggests successful regional strategies combine three key ingredients. First scale, with investment needing to be sufficiently large to reverse vicious cycles of decline in failing places. Second, co-ordination of the different arms of policy, necessary when places have multiple, complex policy needs. And third, longevity in these initiatives, without which it is difficult to make inroads into long-standing, deep-seated disparities. "
        },
        {
            "text": "If the past has been a story of failure, how do we make the future a story of regional policy success? Ultimately, this means putting in place a framework for regional policies capable of delivering the key ingredients - scale, co-ordination and longevity. By framework, we mean a robust and enduring set of institutional structures and incentives which can shape regional policy decision-making to ensure it meets its long-term ambitions. "
        },
        {
            "text": "The Levelling Up White Paper (LUWP), published by the UK Government in March 2022, sought to put in place such a robust and enduring framework of regional policy. As in other successful spheres of public policy, this framework had three key mutually complementary elements, individually and collectively supporting long-term decision-making at the spatial level.1 "
        },
        {
            "text": "The first was a set of long-term objectives for levelling up policies, encapsulated in a set of 12 missions covering a wide range of issues – from income to health to education to skills to transport to digital to pride in place. This plurality of missions reflects the complex needs facing many places. It also reflects the fact that deficiencies in any one of these areas, if left unattended, would risk derailing progress on the others. "
        },
        {
            "text": "The second was a set of changes to decision-making at the central and local level. As shorthand, this was referred to, respectively, as a new model of government and a new model of governance. The new model of government was needed to coordinate the different arms of Whitehall policy, necessary given the expansive and cross-cutting nature of the missions. This was to be achieved through regular inter-ministerial meetings, to discuss progress and agree action on achieving the set of levelling up missions.  "
        },
        {
            "text": "The new model of governance recognises that placed-based decision-making needs to involve greater delegation of decision-making to the local level. This was to be achieved, inter alia, through a tiered framework for the devolution of powers, with voluntary incentives for local areas to develop strong and stream-lined models of local governance and the reward for which was enhanced delegated powers and additional monies. "
        },
        {
            "text": "The third element of the levelling up framework concerned transparency and accountability. This is crucial to enable learning-by-doing and to sharpen incentives for sound local decision-making. It was to be achieved by improving publicly available spatial data, overseen by an Office of Local Government (Oflog). It included the creation of a LUAC to provide independent, expert advice on levelling up policies. "
        },
        {
            "text": "Eighteen months on, and twelve months into the life of the LUAC, part II of this blog assesses progress on these three aspects of the levelling up policy framework. Overall, it seems reasonable to conclude that there has been greater progress than many people realise, if less than some were hoping for. Part III concludes by setting out a few thoughts on ways in which this levelling up framework might be further improved. "
        }
    ]
}