{
    "url": "https://teaching.blog.gov.uk/2023/09/27/a-headteachers-top-tips-to-effectively-manage-pupil-premium-funding/",
    "title": "A headteacher’s top tips to effectively manage Pupil Premium funding",
    "authors": [
        "Clare Greene"
    ],
    "categories": [
        "Pupil premium & PE premium",
        "Uncategorized"
    ],
    "pub_date": "2023-09-27T12:29:07+01:00",
    "content": [
        {
            "text": "Clare Greene, an executive headteacher in the South West of England and evidence lead in education for West Somerset Research School, tells us her tips about how to effectively manage a school budget including Pupil Premium funding."
        },
        {
            "text": "The challenges "
        },
        {
            "text": "Maximising school budgets and making sure we get the most possible from our Pupil Premium funding can be a daunting task. The Pupil Premium Grant (PPG) states the funding should be spent for the benefit of the pupils and must be spent on activities that support the quality of teaching, provide targeted academic support, and tackle non-academic barriers to success. However, with the numbers of pupils in my school entitled to PPG and those with SEND far higher than the national average, how do we prioritise the funding?"
        },
        {
            "text": "As a reminder, many use the term ‘disadvantaged’ to talk about those who have faced inequity and as a result, experienced unequal opportunity. It’s important to remain mindful  when using labels, particularly with children, and work hard to accurately identify and address individual needs rather than making assumptions."
        },
        {
            "text": "1. Identify the challenges - and diagnose your pupils’ needs."
        },
        {
            "text": "Sometimes it’s easy to focus on the challenges for the school rather than those faced individually by the pupils. Take reading for example. Often the challenge stated is that parents/ carers do not read regularly with their children.  If outcomes for reading at the end of KS2 demonstrate that pupils are not adequately prepared for their next stage in education, it’s important that leaders think carefully at what more the school can do for their pupils and what is in their control. The challenge or problem must be explored in detail, this is where the EEF’s Putting Evidence to Work – a School’s Guide to Implementation guidance report provides helpful guidance about ensuring approaches  chosen in your school meet the actual problem not the perceived one."
        },
        {
            "text": "2. Explore the problem / use strong evidence to support your strategy."
        },
        {
            "text": "Knowing your school’s context is key here. For my junior school, this meant knowing that a higher-than-average number of children are likely to have experienced 4 or more Adverse Childhood Experiences (ACEs) and had many of the vulnerabilities listed in Keeping Children Safe in Education 2022. Elements of the EEF’s Improving Social and Emotional Learning in Primary Schools guidance report could be used to help provide protective factors for children with vulnerabilities but also support children who have not experienced them."
        },
        {
            "text": "The EEF Teaching and Learning Toolkit states that a social and emotional learning (SEL) approach to a whole school emotional regulation framework could be implemented at  a low cost and could yield 4 months’ progress. Funding at our school or schools? was then used for universal programmes on  developing, resilience, empathy, communication, and teamwork amongst other things."
        },
        {
            "text": "Funding was also allocated to evidence-based programmes targeted at pupils with particular needs such as funding emotional literacy support assistants.  These approaches support the tiered model of school improvement from the EEF guide to Pupil Premium and sit firmly within the DfE’s menu of approaches."
        },
        {
            "text": "3. Long term planning"
        },
        {
            "text": "Getting the whole school approach right allows for money to be better targeted at pupils. Only when we know what the problem is and by using research-based approaches along with contextual knowledge and long-term planning can we start to mitigate some of the barriers that pupils experience that are beyond our control."
        },
        {
            "text": "Our Pupil Premium strategy builds year on year. Spending money is the easy bit, spending it in the right way takes time – it is important to understand the specific challenges, improve awareness of the evidence base and develop a long-term iterative planning process."
        },
        {
            "text": "Pupil premium 2022 to 2023: conditions of grant for academies and free schools - GOV.UK (www.gov.uk)"
        },
        {
            "text": "Using pupil premium | EEF (educationendowmentfoundation.org.uk)"
        },
        {
            "text": "Keeping children safe in education 2022 (publishing.service.gov.uk)"
        },
        {
            "text": "School planning support 2022-23 | EEF (educationendowmentfoundation.org.uk)"
        }
    ]
}