{
    "url": "https://ace.blog.gov.uk/2023/09/27/building-local-innovation-partnerships-to-aid-the-race-to-net-zero/",
    "title": "Building local innovation partnerships to aid the race to net zero",
    "authors": [
        "Sam Brooks"
    ],
    "categories": [
        "Data",
        "Data science",
        "Innovation",
        "People and skills",
        "Security",
        "Uncategorized"
    ],
    "pub_date": "2023-09-27T09:29:59+01:00",
    "content": [
        {
            "text": "ACE and Newcastle University have successfully co-hosted an ACE Research Network (ARN) and community event focused on how the fields of digital, data and security can contribute towards reaching net zero."
        },
        {
            "text": "The aim of the event, which took place at The Core, a state-of-the-art building in Newcastle’s Helix site, was to build relationships between government, industry and academia across the Northeast."
        },
        {
            "text": "Opened in 2014, the Helix is built on the former site of the Newcastle Brown Ale brewery and is a mixed-use innovation district which aims to facilitate collaboration, skill and knowledge sharing, and network building across sectors. It is a perfect example of how urban regeneration can be done effectively, balancing the needs of local communities and businesses."
        },
        {
            "text": "The day began with a welcome from Professor Boguslaw Obara, Dean of Business, Innovation and Skills at Newcastle University. Professor Boguslaw gave an engaging presentation on the past, present and future of innovation at Newcastle. Boguslaw also outlined the many ways that the university aims to collaborate with and support businesses, such as through Learning Partnerships, which align student upskilling to business needs."
        },
        {
            "text": "Professor Mike Capaldi, Dean of Innovation and Business, then spoke about the Electrification Process Innovation Centre (EPIC). This is a collection of engineers, technicians and academics working to upskill workforces and drive new technological developments in innovative manufacturing processes, which will be key to delivering our net zero targets."
        },
        {
            "text": "ACE and Intandem, an innovation and corporate venturing consultancy in our community, then presented a project spotlight on Collective Intelligence (Collint), which aims to bring minds and technologies together around complex problems to more effectively achieve outcomes. This project helped identify potential vulnerabilities within key supply chains that could threaten the UK’s net zero transition plans."
        },
        {
            "text": "Professor Sara Walker from the Newcastle University Centre for Energy then explored what energy demand may look like in 2050. One key point was the role that building design can play in energy efficiency – a capability that Newcastle University is already harnessing to achieve its own goal of net zero emissions by 2030."
        },
        {
            "text": "Professor Barry Hodgson then introduced attendees to the National Innovation Centre for Data (NIC-D), which aims to address the data skills gap. NIC-D is funded by the Department for Science, Innovation and Technology and works with many public and private sector collaborators. A recent project with the Port of Tyne delivered dashboards that enabled greater visibility of CO2 emissions to allow better decision making."
        },
        {
            "text": "Attendees then came together for breakout discussions on how public, private and academic sectors can collaborate to achieve our net zero ambitions. A thought leadership piece will be shared soon summarising the key points from this incredibly fruitful and valuable discussion."
        },
        {
            "text": "Lastly, Dr Scott Linfoot delivered a customer spotlight on how ACE supported the Department for Business and Trade on deploying digital twins for net zero in the Isle of Wight."
        },
        {
            "text": "ACE would like to thank all the speakers for their interesting talks, attendees for their enthusiasm during the breakout sessions, and Newcastle University for their hospitality."
        },
        {
            "text": "Any academics not already engaged with ACE who would like to hear about the ARN, future ACE events or commission opportunities can contact us at aceresearchnetwork@vivace.tech."
        }
    ]
}