{
    "url": "https://ipa.blog.gov.uk/2023/09/27/civil-service-fast-stream-we-were-led-to-the-scene-of-a-ruined-street-strewn-with-debris-and-blanketed-in-smoke/",
    "title": "Civil Service Fast Stream: \"We were led to the scene of a ruined street, strewn with debris and blanketed in smoke\"",
    "authors": [
        "laurenvamplew"
    ],
    "categories": [
        "Infrastructure",
        "Major projects",
        "Project Delivery Profession"
    ],
    "pub_date": "2023-09-27T15:19:38+01:00",
    "content": [
        {
            "text": "Jack Linley, a statistics fast Streamer in the Transformation Team and Sophie Cliff, a project delivery fast streamer working in project set-up, tell us about their experiences of working on major defence programmes as part of their first-year placements on the Civil Service Fast Stream at the Infrastructure and Projects Authority (IPA). "
        },
        {
            "text": "The IPA has provided a great introduction to the breadth of projects and programmes across government. In both our roles, we have had the opportunity to work with IPA project delivery advisors and commercial advisors on the Government Major Projects Portfolio (GMPP). In perhaps our most exciting opportunity yet, we spent a week working with the IPA’s project delivery defence team, undertaking site visits and shadowing senior responsible officers (SROs) and programme directors (PDs) for some of the Ministry of Defence’s biggest and most complex projects and programmes. "
        },
        {
            "heading": 6,
            "text": "Programme Director of the Armoured Cavalry Programme, Col Kieran Sheldon, showcasing the world class capabilities of the Ajax armoured fighting vehicle to Jack Linley and Sophie Cliff"
        },
        {
            "heading": 3,
            "text": "AJAX - Merthyr Tydfil"
        },
        {
            "text": "We begin with a trip to the General Dynamics site at Merthyr Tydfil - a specialised engineering hub for the British Army’s AJAX Armoured Fighting Vehicles (AFV). AFVs are military vehicles, protected by armour and armed with weapons. AJAX is a next generation Armoured Fighting Vehicle, fit for the modern battlefield. They are fully-digital and fully-integrated vehicles which will provide the British Army with a step-change in transformational capability. "
        },
        {
            "text": "The day began with a presentation on the AJAX family of vehicles. We learnt that there are six variants of the vehicle, and only one is named AJAX, the other five are named after other figures from Greek Mythology. Each of these variants have different specifications depending on the defence requirement. Prime Contractor, General Dynamics will be delivering 589 vehicles to the British Army. The vehicles have a lifespan of at least 35 years, meaning they have the best-in-class protection and survivability, reliability and mobility, and all-weather intelligence, surveillance, target acquisition and recognition (ISTAR). They can operate in combined-arms and multi-national situations, across a wide-range of future operating environments. "
        },
        {
            "text": "We then walked the production line, where we heard how the complexities of each variant meant that what was originally one production line was now three ‘value streams’. This has allowed similar variants to be built more efficiently. We saw the schedules for each vehicle on site and learnt about the wide range of requirements that each design had to meet. We finished our day with a visit to the vehicle test track, where the AJAX vehicles are tried and tested before being released to the British Army. "
        },
        {
            "heading": 3,
            "text": "Navy HQ - Portsmouth"
        },
        {
            "text": "We then had the opportunity to visit the Navy HQ on Whale Island, Portsmouth. Here, we shadowed an IPA advisor meeting with the SROs and directors of GMPP naval projects and programmes. The projects discussed included the Naval Support Integrated Global Network, which is responsible for the re-provision of services contracted through the Future Maritime Support Programme. We also met the programme director for the Maritime Electronic Warfare Programme, who explained that the programme will deliver anti-ship missile capabilities and the necessary protection, through automated coordination of response to missile attacks. This was followed by an insight into Type 31 from its programme manager. This is a general purpose frigate programme that will be at the heart of the Royal Navy’s surface fleet, deterring aggression and maintaining the UK security and interests."
        },
        {
            "text": "Shadowing defence meetings demonstrated the value IPA provides to the UK Government's biggest and most complex programmes, including setting them up for delivery success. The positive relationships developed between IPA and MoD colleagues has enabled them to manage their stakeholders effectively and create a safe space to provide much-needed constructive support and challenge to their projects and programmes, including assurance, contract management and governance. "
        },
        {
            "text": "In addition to this, the IPA advisor discussed professional development options with the programme directors. Development of project delivery professionals is essential to the delivery of major projects and a key priority for the IPA. Therefore, we have a vast learning offer, including the Projects Leadership Programme (PLP) and Major Projects Leadership Academy (MPLA), to support the growth of government project professionals. "
        },
        {
            "heading": 3,
            "text": "Army Expo - London"
        },
        {
            "text": "As the week concluded, we were joined by Cabinet Office and HM Treasury colleagues in attending the British Army Expo. This immersive experience took place at the historic Wellington Barracks, nestled in the heart of Westminster. The expo showcased the work of the British Army today, as well as its long term vision to ensure the United Kingdom continues to be protected from threats and adversaries."
        },
        {
            "text": "We first attended a networking session with senior serving army officers, leaders and stakeholders from across government and industry. We were welcomed with a recorded message from General Sir Patrick Sanders, Chief of the General Staff, before enjoying a presentation from Forces TV."
        },
        {
            "text": "This was followed by three immersive displays. The first of these showcased the work of the British Army at home, from those at the coal face currently serving in the army. We heard of lived experiences, including the incredible work done to support the NHS during the COVID-19 pandemic, the civil servants underpinning the work of the Ministry of Defence, and the training provided by the Harrogate Army Foundation College."
        },
        {
            "heading": 6,
            "text": " The Ceremonial March at the Army Expo 2023"
        },
        {
            "text": "In the second demonstration, we were led to the scene of a ruined street, strewn with debris and blanketed in smoke. In the centre stood a Challenger 2 Main Battle Tank. The tank crew spoke of the material support and training that the UK has provided to the Ukrainian war effort. They highlighted the British decision to send 14 Challengers, which then prompted other allies to provide their tanks in support of Ukraine. We then entered a marquee, and were given a demonstration of a simulated precision strike - showing Britain leading the way in modern warfare."
        },
        {
            "heading": 6,
            "text": "Members of the Royal Armoured Corps standing atop a Challenger 2 Main Battle Tank"
        },
        {
            "text": "The third demonstration provided a top level view of the relationship between the British Army and industry; creating jobs and stimulating economic growth around the United Kingdom. This included an overview of the strategy on future investment, and organisational changes needed to be ready for challenges of the next few decades. The day concluded with a showcase of the latest equipment that the Army has at its disposal. Some of these, including the new AJAX Armoured Fighting Vehicles, were the result of GMPP projects and programmes, emphasising the importance of the IPA’s work in protecting the nation."
        },
        {
            "text": "Thanks to the IPA’s defence team and colleagues, we have had a fantastic deep-dive into defence. We have been privileged to learn about, first-hand, the unique circumstances and key challenges of major project delivery across the Royal Navy and British Army, and learnt from senior leaders and IPA advisors about the key skills - at an individual, team and project or programme level - for project delivery success. This has been an incredibly rewarding experience so early on in our careers, and we look forward to taking these learnings forward into other major projects and programmes across government. "
        },
        {
            "text": "Applications for the Civil Service Fast Stream open in Autumn 2023.  Through the Fast Stream you will be encouraged, enabled and empowered to shape your way in postings where you'll have real responsibility from day one and tackle issues that matter to people across the UK. You can browse the available opportunities here - https://www.faststream.gov.uk/how-to-apply/index.html"
        },
        {
            "text": "To learn more about the GMPP, you can read the IPA’s recently published Annual Report 2022-23. Link here - https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/1175756/IPA-Annual-report-2022-2023.pdf.pdf"
        },
        {
            "heading": 6,
            "text": "IPA colleagues in front of an Apache Helicopter"
        }
    ]
}