{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2023/09/27/gse-profession-mentoring-and-peer-support-offers/",
    "title": "GSE Profession Mentoring and Peer Support Offers",
    "authors": [
        "gseprofession"
    ],
    "categories": [
        "Blog Series",
        "GSE Opportunities",
        "Learning & Development"
    ],
    "pub_date": "2023-09-27T15:50:23+01:00",
    "content": [
        {
            "text": "Mentoring and peer support programmes help you to identify and build on your strengths, reflect on your career journey and develop your skills. "
        },
        {
            "text": "The GSE Profession has five different mentoring and peer support offers. Use the summaries below to find one that suits you. "
        },
        {
            "heading": 2,
            "text": "GSE Empowering Leadership Mentoring "
        },
        {
            "text": "Who are the mentees? All GSE Profession members with an interest in developing their leadership. "
        },
        {
            "text": "Who are the mentors? GSE Profession members a minimum of one grade above mentees. "
        },
        {
            "text": "Details: Aligned with the GSE Leadership Values in support of your leadership development, this six-month mentoring programme launches twice a year. "
        },
        {
            "text": "How to access: Look out for registration and mentor recruitment announcements in our GSE Newsletter. Sign up to become a GSE member if you are not already.   "
        },
        {
            "heading": 2,
            "text": "Mentoring via the GSE Professional Recognition Offer  "
        },
        {
            "text": "Who are the mentees? GSE members across government completing professional recognition through our Professional Recognition Offer. "
        },
        {
            "text": "Who are the mentors? GSE members across government who have completed chartership/registration. This is a great way to keep your competencies up to standard to maintain your professional recognition.  "
        },
        {
            "text": "Details: You can access the overall GSE Professional Recognition Offer at any time, but mentor pairing will take place up to every 3 months. The mentor-mentee ratio, frequency and duration of mentoring will complement the professional recognition timelines mentees are working to.  "
        },
        {
            "text": "How to access: Email gse@go-science.gov.uk to register your interest in our professional recognition offer or to become a mentor. "
        },
        {
            "heading": 2,
            "text": "GSE Connect – a peer support programme "
        },
        {
            "text": "Who is this peer support offer for? Women working in science and engineering are paired from different organisations at random to discuss and provide support and encouragement on matters important to career, personal and professional development. "
        },
        {
            "text": "Details: The duration is agreed individually between pairs, although an initial commitment of at least 6 meetings over one year is recommended.    "
        },
        {
            "text": "How to access: Pairing periods take place at certain points throughout the year. Look out for announcements in the GSE newsletter for new programme sign-up dates. "
        },
        {
            "text": "This programme is run by GSE members. If you would like to volunteer your help, please contact GSE@ipo.gov.uk. "
        },
        {
            "heading": 2,
            "text": "Royal Society Pairing Scheme  "
        },
        {
            "text": "Who is this scheme for? Royal Society research scientists are matched with parliamentarians and civil servants who work in a policy area that corresponds with their fields of study. This upskills policymakers on how best to engage with academia. "
        },
        {
            "text": "Details: This is an annual one-week event which includes workshops, visits organised by the Royal Society and GSE, and talks from guest speakers. Civil servants will also be shadowed by scientists for up to two days.  "
        },
        {
            "text": "How to apply: Application open annually. Refer to the Royal Society Pairing scheme blog for full eligibility criteria and to complete the application form.  "
        },
        {
            "heading": 2,
            "text": "Mentoring via STEM Futures "
        },
        {
            "text": "Who are the mentees? Individuals within STEM Futures Partner organisations, working in technical areas aligned with the STEM Futures hubs. This is best suited to those looking for cross-sector knowledge exchange between government, academia and industry. "
        },
        {
            "text": "Who are the mentors? Individuals within STEM Futures Partner organisations. Bespoke pairings are agreed between Partner organisations to meet a specified organisational need.   "
        },
        {
            "text": "Details: Individuals must belong to a partner organisation and their work should align with the STEM Futures Technical Hubs. The mentoring opportunities are individual and flexible with no fixed availability.   "
        },
        {
            "text": "How to access: Representatives within Partner organisations will communicate opportunities that arise. Note the STEM Futures programme also offers opportunities for shadowing, placements and secondments. "
        },
        {
            "text": "Got a story to share on your experience with a GSE mentoring or peer support programme? Or perhaps you've got some feedback on the offer? We'd love to hear from you. Get in touch by emailing gse@go-science.gov.uk.   "
        }
    ]
}