{
    "url": "https://companieshouse.blog.gov.uk/2023/09/27/how-to-boost-your-business-in-global-markets/",
    "title": "How to boost your business in global markets",
    "authors": [
        "Irina Shmakova - UK Export Academy Trade Adviser, Department for Business and Trade"
    ],
    "categories": [
        "Company guidance"
    ],
    "pub_date": "2023-09-27T13:31:32+01:00",
    "content": [
        {
            "text": "Businesses that sell overseas can be more competitive, profitable and can grow their sales faster. Here we look at the key topics that businesses should consider when exporting for the first time."
        },
        {
            "heading": 2,
            "text": "Weigh up the benefits and barriers of exporting"
        },
        {
            "text": "Selling overseas can yield huge benefits to your business, including:"
        },
        {
            "text": "Take time to create an export action plan that identifies your business strengths as well as any areas of weakness where you need to improve. Determining whether your business is export-ready or not can have a marked difference in your future global success."
        },
        {
            "heading": 2,
            "text": "Research your international markets"
        },
        {
            "text": "With so many potential customers across the globe, it can be tempting to target them all at once. However, by undertaking research and choosing key markets for your product or service, you could save your business valuable time and money. Use your international research as a guide for future marketing decisions and be prepared to adapt your approach when expanding to a different customer demographic or country."
        },
        {
            "heading": 2,
            "text": "Be aware of customs procedures"
        },
        {
            "text": "All exporters have a legal responsibility for the products and services they sell. HMRC require key information before goods can leave the UK, along with requiring you to submit an export customs declaration. Check the requirements in advance, make sure you know what documentation you must produce, and keep up to date on UK customs procedures."
        },
        {
            "heading": 2,
            "text": "Consider your pricing and route to market"
        },
        {
            "text": "British companies often under-price their goods and services, without considering local market conditions. The market research you conducted at the start of your strategy will help determine your export price. Also consider the length of your supply chain and the best route to market and gain as much information as possible before negotiating with a possible representative such as an in-market agent."
        },
        {
            "heading": 2,
            "text": "Decide how to get paid"
        },
        {
            "text": "Different methods of payment comes with different levels of risk depending on whether you’re the exporter or importer. With international payments, there are also different exchange rates and currencies to consider. Explore options such as:"
        },
        {
            "heading": 2,
            "text": "Brush up on Incoterms®"
        },
        {
            "text": "Incoterms® (International Commercial Terms) clarify functions and cost and risk between the buyer and the seller, as required by the sales contract. By having a clear understanding of responsibility before purchase, they can help form a contract that benefits both parties."
        },
        {
            "text": "Take time to review the different terms and fully explore the benefits and risks of each one. It’s worth noting that Incoterms® do not replace insurance policies but do indicate where the responsibility lies."
        },
        {
            "heading": 2,
            "text": "Check for export controls"
        },
        {
            "text": "Some goods, software, and technologies are restricted or prohibited by international export controls, to align with security, policy and other obligations."
        },
        {
            "text": "You may require an export license or permit to approve the sale of your product or service. This includes ‘dual-use goods’, which may not be designed for military use, but is capable of doing so, including electronics, chemicals, and marine equipment."
        }
    ]
}