{
    "url": "https://defrafarming.blog.gov.uk/2023/09/27/woodland-creation-supporting-your-business-and-the-environment/",
    "title": "Woodland creation: supporting your business and the environment",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Payments to plant trees and manage woodland"
    ],
    "pub_date": "2023-09-27T12:52:21+01:00",
    "content": [
        {
            "text": "If you are a farmer or landowner in England, woodland creation grants are available to support tree planting projects of all shapes and sizes.  "
        },
        {
            "text": "In this post, we’ll explain how planting the right trees in the right place can diversify your business, boost income, support food production and enhance the environment. "
        },
        {
            "text": "We’ll also share links for you to find out about the grants on offer.  "
        },
        {
            "heading": 2,
            "text": "Integrating trees on your farm "
        },
        {
            "text": "There are a range of options for tree planting that can be shaped around  your needs and goals."
        },
        {
            "text": "Some grants support tree planting on as little as 0.1 hectares, while larger plots can help to create woodlands that can be used for camping and other leisure activities. "
        },
        {
            "text": "If you farm livestock, shelter belts provide shade, shelter, and selective grazing. "
        },
        {
            "text": "Depending on the size, type, and composition of your woodland, you can generate income selling timber and other wood products.  "
        },
        {
            "text": "By registering with the Woodland Carbon Code before you begin your tree planting project, you can also generate additional long-term income through carbon credits. "
        },
        {
            "text": "As your woodland grows, you can gain carbon units that you can then sell (prices range from £10 to £30+ per unit) or use to offset your business’s carbon emissions.  "
        },
        {
            "text": "Woodland can also help to boost biodiversity – a single oak tree can support 2,300 species, including beneficial pollinators – as well as improve water quality, reduce erosion and mitigate flooding.  "
        },
        {
            "text": "Planting trees can benefit your land and the wider environment. Trees improve air quality and act as a natural carbon sink. They absorb harmful gases and help to tackle climate change. "
        },
        {
            "heading": 2,
            "text": "Choosing the right grant for your farm business "
        },
        {
            "text": "Consistent with our other offers, we’ve designed our tree planting schemes so you can choose what works for your business.  "
        },
        {
            "text": "The 2 main grants are:"
        },
        {
            "heading": 3,
            "text": "The England Woodland Creation Offer (EWCO)"
        },
        {
            "text": "EWCO is a national grant administered by the Forestry Commission to plant woodland over an area of 1 hectare upwards. It covers standard capital costs of up to £10,200 per hectare.  "
        },
        {
            "text": "EWCO has additional stackable payments of up to £8,000 per hectare for tree planting projects that support wider benefits to society, nature recovery and the environment.  "
        },
        {
            "text": "The full guidance for the England Woodland Creation Offer is on GOV.UK."
        },
        {
            "text": "It includes a step-by-step guide on how to apply, which starts with contacting your local Woodland Creation Officer.  They can advise on eligibility and can visit your site for free to advise on everything from woodland design to species selection.  "
        },
        {
            "text": "They can support you to make the best choices for your business and land in the long-term.  "
        },
        {
            "heading": 3,
            "text": "Regional Woodland Creation grants"
        },
        {
            "text": "This grant covers up to 100% of the costs of planning and planting on your farm. "
        },
        {
            "text": "These grants are issued in the catchment areas below and are tailored to individual circumstances.  "
        },
        {
            "text": "If your land is located within one of the catchment areas highlighted above, get in touch with the relevant Woodland Creation Partner to get started:"
        },
        {
            "text": "England’s Community Forests​"
        },
        {
            "text": "Forest for Cornwall​"
        },
        {
            "text": "Great Northumberland Forest​"
        },
        {
            "text": "National Forest​"
        },
        {
            "text": "The Northern Forest"
        },
        {
            "heading": 2,
            "text": "Learn more"
        },
        {
            "text": "The process of creating and managing woodland is different for every farm business. Find out more about the range of woodland creation support available. "
        },
        {
            "text": "Or, for more information on payments for carrying out actions which supports the environment on your farm, consider the Sustainable Farming Incentive. Payments are available for planting and maintaining hedgerow trees among a wide range of other actions."
        }
    ]
}