{
    "url": "https://mojdigital.blog.gov.uk/2021/07/28/building-and-improving-the-child-arrangements-service/",
    "title": "Building and improving the Child Arrangements Service",
    "authors": [
        "Laura Payten"
    ],
    "categories": [
        "Child Arrangements Service",
        "User centred policy design"
    ],
    "pub_date": "2021-07-28T15:07:47+01:00",
    "content": [
        {
            "text": "The User Centred Policy Design ( UCPD) Cross Justice Delivery team said goodbye to the Child Arrangements Service at the end of March, and handed the service over to its new home in Her Majesty's Courts and Tribunals Service (HMCTS). We took  the service from discovery all the way through to public beta over the last four years and are excited to share some of the excellent work our team did to deliver benefits to our users."
        },
        {
            "text": "The Child Arrangements Service helps thousands of users a month to apply to court for child arrangements, with an average of 2,300 users each month so far this year and a 92% user satisfaction rate in April 2021."
        },
        {
            "text": "If you needed to apply to court to make arrangements for your children, grandchildren, or children you are legally responsible for, you would need to complete a C100, C1A and C8 form. The Child Arrangements Service allows users to complete and submit digital versions of these forms. By digitising the forms we hoped to:"
        },
        {
            "text": "Enabling users to pay online"
        },
        {
            "text": "We wanted the digital version of the form, and the service, to meet as many different types of user needs as possible, so the Child Arrangements Service allows for submission either via print and post, or electronically, direct to courts. The applicant can also choose their preferred payment method, whether it be online through GOV.UK Pay, via Child Arrangements Service or cheque to court, or by phone. "
        },
        {
            "text": "Enabling users to pause and return to application "
        },
        {
            "text": "Thanks to user research, we found that many users needed to gather evidence or information during the form completion process, which might take time. So the Child Arrangements Service allows users to save and return to their online application by creating a user account, meaning they can return to the account anytime within 28 days to complete the application, whenever it’s convenient for them."
        },
        {
            "text": "Centralisation"
        },
        {
            "text": "In early 2021, courts moved to a centralised process for handling and sifting the forms submitted to court for child arrangements. We reduced form processing SLAs from 2 days to 24 hours. This enabled users in vulnerable situations to have their forms processed and addressed sooner, rather than having to wait for a manually written and submitted form to make its way through a decentralised court system."
        },
        {
            "text": "What’s next?"
        },
        {
            "text": "During our time building the Child Arrangements Service, we introduced a number of features that increased the service’s usefulness to users. We introduced the ability for solicitors to be able to apply on behalf of clients, for grandparents to apply through our non-parents journey, and by making significant refinements to the requirements around mediation to make it simpler and more clear for applicants. And many more!"
        },
        {
            "text": "HMCTS now manage Child Arrangements Service and will continue to look after it, making sure it meets the needs of people making arrangements for children."
        },
        {
            "text": "The UCPD Cross Justice Delivery team is now focusing on one of our other services, the ‘Disclosure Checker’ with the Criminal Records Policy team at MOJ. "
        },
        {
            "text": "If you would like to know more about user centred policy design and building services with policy teams, leave us a comment below. "
        }
    ]
}