{
    "url": "https://deframedia.blog.gov.uk/2021/07/28/coverage-of-eurasian-curlews-released-on-the-sandringham-estate/",
    "title": "Coverage of Eurasian Curlews released on the Sandringham Estate",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Wildlife"
    ],
    "pub_date": "2021-07-28T12:30:03+01:00",
    "content": [
        {
            "text": "There has been coverage on a Natural England (NE)-led partnership project to boost populations of Eurasian curlew in the Daily Telegraph, BBC Online, Eastern Daily Press, Hello, Daily Express and BBC Radio Norfolk and Times Radio. HRH The Prince of Wales attended the release of a clutch of the rare chicks on the Wild Ken Hill and Sandringham estates, alongside the chair of Natural England, Tony Juniper, yesterday (Tuesday 27th July)."
        },
        {
            "text": "The birds release follow rearing at Pensthorpe Conservation Trust (PCT). The Eurasian curlew, Europe's largest wading bird, is listed as \"near-threatened\" on the International Union for Conservation of Nature's Red List index, and that the UK is home to around a quarter of its breeding population."
        },
        {
            "text": "Following a successful trial in 2019, the release is the first year of a new NE project which aims to prevent the licensed destruction of curlew eggs at airfields in the East of England. Previously, where curlew nested too close to runways, eggs were destroyed to prevent bird strike and maintain air safety."
        },
        {
            "text": "Natural England Chair, Tony Juniper said:"
        },
        {
            "text": "The releases aim to expand an existing breeding population of curlew in Breckland, creating a new curlew nature recovery network."
        },
        {
            "text": "HRH The Prince of Wales said yesterday at Sandringham:"
        },
        {
            "text": "Some of the birds have been fitted with GPS or radio tags by the British Trust for Ornithology (BTO), so we can continue to monitor their progress after they are released, gathering information on their dispersal, habitat use and survival."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}