{
    "url": "https://phescreening.blog.gov.uk/2021/07/28/easy-guide-for-downs-syndrome-edwards-syndrome-and-pataus-syndrome-screening-updated-thanks-to-expert-users/",
    "title": "Easy guide for Down’s syndrome, Edwards’ syndrome and Patau’s syndrome screening updated thanks to expert users",
    "authors": [
        "Liane Powell"
    ],
    "categories": [
        "NHS Fetal Anomaly Screening Programme"
    ],
    "pub_date": "2021-07-28T10:24:23+01:00",
    "content": [
        {
            "text": "We have updated the easy guide to NHS screening for Down’s syndrome, Edwards’ syndrome and Patau’s syndrome."
        },
        {
            "text": "The 8 Screening tests for you and your baby easy guides help explain NHS screening tests offered during and after pregnancy for people with learning disabilities and others who struggle with written English and benefit from easy read information. Midwives and carers can read through the easy guides with any individuals who need information in this format."
        },
        {
            "text": "The updated easy guide is based on the standard national information on screening for Down’s syndrome, Edwards’ syndrome and Patau’s syndrome. We have made it easier to read by writing in clear, simple sentences and using images to illustrate each important message."
        },
        {
            "text": "The updated version contains information about non-invasive prenatal testing (NIPT), which has recently been added to the existing screening pathway for screening for Down’s syndrome, Edwards’ syndrome and Patau’s syndrome as an additional option."
        },
        {
            "heading": 2,
            "text": "Virtual partnership working"
        },
        {
            "text": "Public Health England (PHE) and The Elfrida Society, a London-based learning disability charity, worked together in 2020 to update and improve accessible antenatal and newborn screening information. Building on this successful partnership, we asked The Elfrida Society to help us update the easy guide to screening for Down’s syndrome, Edwards’ syndrome and Patau’s syndrome."
        },
        {
            "text": "The Elfrida Society experts by experience provided invaluable feedback, highlighting several minor issues with the text and images that we have now addressed to improve understanding. Many thanks to them for this excellent example of partnership work in ensuring that people who use easy read materials are involved in their development and design."
        },
        {
            "text": "This was our first ‘virtual’ focus group with The Elfrida Society and we joined one of the regular Zoom meetings of their parents group."
        },
        {
            "text": "As well as adding information about NIPT to the updated easy guide, we have also:"
        },
        {
            "text": "We would advise fetal anomaly screening providers to download, print off and use this newly updated easy guide to support conversations in explaining NHS screening for Down’s syndrome, Edwards’ syndrome and Patau’s syndrome to any women and partners who require information in this format."
        },
        {
            "text": "If possible, you should print the easy guides in colour and single-sided to improve accessibility."
        },
        {
            "heading": 2,
            "text": "PHE Screening blog"
        },
        {
            "text": "The PHE Screening blog provides up to date news from all NHS screening programmes. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new blogs. If you have any questions about this blog article, or about population screening in England, please contact the PHE screening helpdesk."
        }
    ]
}