{
    "url": "https://disabilityunit.blog.gov.uk/2021/07/28/education-national-disability-strategy-explained/",
    "title": "Education: National Disability Strategy explained",
    "authors": [
        "Disability Unit"
    ],
    "categories": [
        "National Strategy for Disabled People"
    ],
    "pub_date": "2021-07-28T08:00:04+01:00",
    "content": [
        {
            "text": "We have published the Government’s National Disability Strategy."
        },
        {
            "text": "Over one in five people in the UK are disabled."
        },
        {
            "text": "'What does disability mean to me? The usual connotations - I find it harder to do certain things than others would. I see things differently. I don’t struggle. I have just spent my life finding efficient ways of getting round the challenges I’ve had.'"
        },
        {
            "text": "   -  Beth                                                                                                                 "
        },
        {
            "text": "Our vision is to transform the everyday lives of disabled people by tackling the barriers people face. So we can build back better towards a society that works for everyone. The strategy sets out immediate actions we will take on our path towards a longer-term goal, rooting the strategy in the everyday experience of disabled people."
        },
        {
            "text": "This series explains the strategy’s eight key themes, and how we are making improvements to every part of a disabled person’s day. From the moment someone gets up to the moment they end their day."
        },
        {
            "heading": 3,
            "text": "Education: ensuring children and young people fulfil their potential"
        },
        {
            "text": "Access to education is a cornerstone to our society, but it can be difficult for many pupils to receive the support they need to get the education they deserve. In the National Disability Strategy, we have committed to improving the experience for disabled people."
        },
        {
            "heading": 2,
            "text": "Going to school"
        },
        {
            "text": "The school day can be challenging for some disabled children. In the UK, 8% of children are disabled as defined under the Equality Act 2010."
        },
        {
            "text": "'When I was in the Juniors at Primary School we had a cloakroom where we hung our coats. Due to being short I was unable to reach the pegs so a peg was put lower down for me on the wall. Whilst I was very grateful for this it meant that my peg stayed in the same place for all the years I was in the Juniors.  Every year we would move up a line in the cloakroom, I never did. This meant that I missed out on all the talk that went on in the cloakroom with my classmates. I was always in the line for year 3 even when I was in year 4, 5 and 6.'"
        },
        {
            "text": "    - Donna"
        },
        {
            "heading": 2,
            "text": "SEND system"
        },
        {
            "text": "The Department for Education made radical changes to the Special Educational Needs and Disabilities (SEND) system in England in 2014. These changes extended support to everyone aged 25 and under and aimed to improve outcomes by putting the child or young person at the centre of the system."
        },
        {
            "text": "Despite the investment and good practice prompted by these reforms, disabled children and young people are not always experiencing improved outcomes as a result. "
        },
        {
            "text": "DfE will consult on improvements to the SEND system through the SEND Review, due for publication in 2021. "
        },
        {
            "text": "The SEND Review will focus on improving support and preparing disabled children and young people for fulfilled adulthood. "
        },
        {
            "text": "‘My school has always strived to include me in lessons: sending lesson plans ahead of the lesson so they can be made more accessible; setting me a question at the start of the lesson to give me plenty of time to write my answer and adapting tests so my level of understanding could be assessed without too much repetition.  Using a spelling board to say everything I want can be exhausting, but with these changes I feel I can contribute as a valued member of the class.’ "
        },
        {
            "text": "    - Jonathan, aged 14"
        },
        {
            "heading": 2,
            "text": "Adulthood and university "
        },
        {
            "text": "We want disabled young people to be supported and have positive experiences as they transition to adulthood. This remains a challenging time for some. "
        },
        {
            "text": "A disabled person with a degree is still no more likely to be in work than a non-disabled person whose highest qualification is at GCSE."
        },
        {
            "text": "23% of disabled people had a degree or equivalent in 2020, compared with 39.7% of non-disabled people. 38% of disabled people who responded to the UK Disability Survey said that concerns about other people’s views have stopped them from pursuing education."
        },
        {
            "text": "'One of the biggest things that the Open University has given me is belief in myself and in my own actions and ability. When they said I wouldn’t, I didn’t. When I believed I could, I did.'"
        },
        {
            "text": "    - Amy"
        },
        {
            "text": "We are taking immediate action to improve education for disabled people."
        },
        {
            "heading": 2,
            "text": "What are our next steps?"
        },
        {
            "text": "The Department for Education will:"
        },
        {
            "text": "This is only the beginning. "
        },
        {
            "text": "We see the National Disability Strategy as a dynamic plan that we will refresh regularly in response to disabled people’s priorities."
        },
        {
            "heading": 2,
            "text": "Join the conversation"
        },
        {
            "heading": 2,
            "text": "Want to know more about the National Disability Strategy?"
        },
        {
            "text": "Read about the other seven Strategy themes:"
        }
    ]
}