{
    "url": "https://disabilityunit.blog.gov.uk/2021/07/28/home-national-disability-strategy-explained/",
    "title": "Home: National Disability Strategy explained",
    "authors": [
        "Disability Unit"
    ],
    "categories": [
        "National Strategy for Disabled People"
    ],
    "pub_date": "2021-07-28T08:03:27+01:00",
    "content": [
        {
            "text": "We have published the Government’s National Disability Strategy."
        },
        {
            "text": "Over one in five people in the UK are disabled. "
        },
        {
            "text": "'What does disability mean to me? The usual connotations - I find it harder to do certain things than others would. I see things differently. I don’t struggle. I have just spent my life finding efficient ways of getting round the challenges I’ve had.'"
        },
        {
            "text": "    - Beth"
        },
        {
            "text": "Our vision is to transform the everyday lives of disabled people by tackling the barriers people face. So we can build back better towards a society that works for everyone. The strategy sets out immediate actions we will take on our path towards a longer-term goal, rooting the strategy in the everyday experience of disabled people."
        },
        {
            "text": "This series explains the strategy’s eight key themes, and how we are making improvements to every part of a disabled person’s day. From the moment someone gets up to the moment they end their day."
        },
        {
            "heading": 2,
            "text": "Home: Creating more accessible, adapted and safer homes "
        },
        {
            "text": "Having a home that is suitable for a person’s needs is fundamental to being able to thrive and live an independent life in our society. However, many disabled people wake up every morning in a home that is not adapted to their needs. "
        },
        {
            "text": "47% of disabled respondents to the UK Disability Survey reported having at least ‘some difficulty’ getting in and out of where they live."
        },
        {
            "heading": 2,
            "text": "Accessible housing"
        },
        {
            "text": "Although there have been many improvements in accessible housing for disabled people in recent decades, disabled people tell us there is still much further to go. "
        },
        {
            "text": "Housing improvements have been aided by tightened regulations and increased awareness of inclusive design. Homes in England with key accessible features nearly doubled between 2009 and 2018, from 5% to 9%."
        },
        {
            "heading": 2,
            "text": "A decent home"
        },
        {
            "text": "A decent home is the foundation of an independent life. A decent home will mean different things to different people. A home with good public transport, close to family and friends, can be as important as a home with the right adaptations. Driving choice is key."
        },
        {
            "text": "'It’s so important to see things and still be part of the world.' "
        },
        {
            "text": "     -Tony"
        },
        {
            "text": "We will take immediate steps to:"
        },
        {
            "text": "We want to ensure that disabled people also have the opportunity to own their own home. About half of the homes delivered under the £11.5 billion Affordable Homes programme will be open to a new Shared Ownership scheme. This will help aspiring homeowners to take their first step on to the housing ladder. "
        },
        {
            "text": "We will accelerate the delivery of adaptations to existing homes too. In England and Wales we will do this by improving local delivery of the Disabled Facilities Grant. "
        },
        {
            "text": "'To actually go out of the door, without anyone helping me, was incredible.'"
        },
        {
            "text": "     -Joyce "
        },
        {
            "heading": 2,
            "text": "What are our next steps?"
        },
        {
            "text": "This is only the beginning. "
        },
        {
            "text": "We see the National Disability Strategy as a dynamic plan that we will refresh regularly in response to disabled people’s priorities."
        },
        {
            "heading": 2,
            "text": "Join the conversation"
        },
        {
            "heading": 2,
            "text": "Want to know more about the National Disability Strategy?"
        },
        {
            "text": "Read about the other seven Strategy themes:"
        }
    ]
}