{
    "url": "https://phescreening.blog.gov.uk/2021/07/28/isoss-reports/",
    "title": "Integrated Screening Outcomes Surveillance Service (ISOSS) reports published",
    "authors": [
        "Laura Smeaton"
    ],
    "categories": [
        "NHS Infectious Diseases in Pregnancy Screening Programme"
    ],
    "pub_date": "2021-07-28T14:06:57+01:00",
    "content": [
        {
            "text": "We are pleased to announce the publication of the first annual Integrated Screening Outcomes Surveillance Service (ISOSS) report, and a one-off retrospective report into congenital syphilis."
        },
        {
            "text": "The annual ISOSS report presents outcomes for the NHS infectious diseases in pregnancy screening (IDPS) programme for pregnant women who are known to be living with HIV or who screen positive for HIV during pregnancy. It also covers infants who have acquired HIV through vertical transmission. The report focuses on maternity data for women booked with an estimated delivery date (EDD) in 2019."
        },
        {
            "text": "The congenital syphilis report is a retrospective review, summarising the data and findings from infants born between January 2015 and June 2020 who were found to have congenital syphilis."
        },
        {
            "heading": 2,
            "text": "Highlights"
        },
        {
            "text": "The annual report shows:"
        },
        {
            "text": "The congenital syphilis report shows:"
        },
        {
            "heading": 2,
            "text": "Main findings"
        },
        {
            "text": "For infants with HIV born to diagnosed women, the most common contributing factors for transmission were undisclosed breastfeeding and difficulties engaging with health care services. For infants born to undiagnosed mothers, the main issue was seroconversion, meaning the women acquired HIV infection later during the pregnancy or while breastfeeding."
        },
        {
            "text": "It is too early to establish if there is a rising rate of congenital syphilis in England, and ISOSS will continue to monitor pregnancy outcomes to identify any trends."
        },
        {
            "text": "Some women suspected of having a sexually transmitted infection (STI) in pregnancy were not referred to sexual health services or offered a full STI screen (as per British Association for Sexual Health and HIV (BASHH) guidelines). A reliance on screening results from earlier in pregnancy also appeared to influence clinical diagnosis and care for unwell infants."
        },
        {
            "heading": 2,
            "text": "Recommendations"
        },
        {
            "text": "The clinical expert review panels (CERPs) reviewed the case summaries of infants found to have HIV or congenital syphilis and made a series of recommendations. These will feed into the IDPS programme workstreams, in particular the syphilis quality improvement project, as a part of the maternity strand of the PHE syphilis action plan."
        },
        {
            "heading": 2,
            "text": "Thank you"
        },
        {
            "text": "The report is a reflection of the hard work and continued support of all of our clinicians, screening teams and partner organisations, including the third sector."
        },
        {
            "text": "We would like to thank all of our respondents who take the time to submit this valuable data. A special thank you to the clinicians who are members of our CERPs and whose clinical input is greatly appreciated."
        },
        {
            "heading": 2,
            "text": "PHE Screening blog"
        },
        {
            "text": "The PHE Screening blog provides up to date news from all NHS screening programmes. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new blogs. If you have any questions about this blog article, or about population screening in England, please contact the PHE screening helpdesk."
        }
    ]
}