{
    "url": "https://disabilityunit.blog.gov.uk/2021/07/28/jobs-national-disability-strategy-explained/",
    "title": "Jobs: National Disability Strategy explained",
    "authors": [
        "Disability Unit"
    ],
    "categories": [
        "National Strategy for Disabled People"
    ],
    "pub_date": "2021-07-28T08:03:39+01:00",
    "content": [
        {
            "text": "We have published the Government’s National Disability Strategy."
        },
        {
            "text": "Over one in five people in the UK are disabled."
        },
        {
            "text": "'What does disability mean to me? The usual connotations - I find it harder to do certain things than others would. I see things differently. I don’t struggle. I have just spent my life finding efficient ways of getting round the challenges I’ve had.'"
        },
        {
            "text": "    - Beth"
        },
        {
            "text": "Our vision is to transform the everyday lives of disabled people by tackling the barriers people face. So we can build back better towards a society that works for everyone. The strategy sets out immediate actions we will take on our path towards a longer-term goal, rooting the strategy in the everyday experience of disabled people."
        },
        {
            "text": "This series explains the strategy’s eight key themes, and how we are making improvements to every part of a disabled person’s day. From the moment someone gets up to the moment they end their day."
        },
        {
            "heading": 3,
            "text": "Jobs: Making the world of work more inclusive and accessible"
        },
        {
            "text": "We know working is not an option for all disabled people, but many people that want to work don’t have the opportunity to do so. This has to change."
        },
        {
            "text": "There are 7 million working-age people with a disability or long-term health condition in the UK, but only a little over half are in work. 56% of disabled people who are not employed who responded to the UK Disability Survey ‘agree’ or ‘strongly agree’ that they would like more support in finding a job."
        },
        {
            "text": "'I've never had trouble going to interviews dealing with them, carrying them out. The biggest problem comes after the interview because employers will make any sort of excuse not to take the leap of faith, they don't want to take the risk on you.'"
        },
        {
            "text": "The National Disability Strategy demonstrates real progress to support those that can and want to work into employment, with a commitment to continue to break down barriers and improve support."
        },
        {
            "heading": 3,
            "text": "More support for disabled people to start and stay in work"
        },
        {
            "text": "We want to do more to support disabled people and people with health conditions to start and stay in work. To be truly effective, a range of support is required. This includes earlier back-to-work support and help staying in work where possible, ensuring our Jobcentres are engaging, welcoming and expert, and personalising support to recognise that one size does not fit all."
        },
        {
            "text": "Because health and employment are related, DWP wants to do more to join up employment support with health services. DWP is continuing to build on current evidence based programmes that provide specialised support to disabled people and people with health conditions."
        },
        {
            "heading": 3,
            "text": "Transforming Access to Work"
        },
        {
            "text": "Access to Work provides support for disabled people at work that is not covered by employers’ responsibility to make reasonable adjustments. This could include special equipment, support worker services, or help getting to and from work. "
        },
        {
            "text": "DWP is working to make Access to Work a digital service, fit for the 21st century, which is innovative, visible and accessible. DWP will radically improve employers and disabled people’s experience of using the service, including improving the payment process for employers and streamlining the user journey."
        },
        {
            "text": "'As a Deaf professional, work has enabled me to achieve my aspirations and to feel that I am making worthwhile contributions to society. I face many challenges, obstacles and the highs and lows of working across such demanding employment.'"
        },
        {
            "text": "   - Claire"
        },
        {
            "heading": 3,
            "text": "Disseminating best practice to employers"
        },
        {
            "text": "We are committed to ensuring that employers, especially small and medium sized enterprises (SMEs), have the best possible information and advice to support disabled people in the workplace. Employers have told us, in recent consultations, about shortfalls in the current offer. They report that they sometimes find this fractured, difficult to navigate and hard to apply in practice.  "
        },
        {
            "text": "We are working to provide a more tailored offer for employers, which helps them to support employees in a range of workplace situations.  The design process also involves disabled people and SMEs. "
        },
        {
            "text": "'I had no idea I was on the autistic spectrum until I watched a documentary on Channel 4 called “Are you autistic?”, what I saw really rang true with my experiences of life. This started me on the journey to being diagnosed. I was then able to sit down with a manager at Sainsbury’s, which gave me a chance to reflect on my challenges at work, and also look at ways of making my job easier.'  "
        },
        {
            "text": "    - Roy"
        },
        {
            "text": "We will:"
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "What are our next steps?"
        },
        {
            "text": "This is only the beginning. "
        },
        {
            "text": "We see the National Disability Strategy as a dynamic plan that we will refresh regularly in response to disabled people’s priorities."
        },
        {
            "heading": 2,
            "text": "Join the conversation"
        },
        {
            "heading": 2,
            "text": "Want to know more about the National Disability Strategy?"
        },
        {
            "text": "Read about the other seven Strategy themes:"
        }
    ]
}