{
    "url": "https://disabilityunit.blog.gov.uk/2021/07/28/leisure-national-disability-strategy-explained/",
    "title": "Leisure: National Disability Strategy explained",
    "authors": [
        "Disability Unit"
    ],
    "categories": [
        "National Strategy for Disabled People"
    ],
    "pub_date": "2021-07-28T08:00:16+01:00",
    "content": [
        {
            "text": "We have published the Government’s National Disability Strategy."
        },
        {
            "text": "Over one in five people in the UK are disabled."
        },
        {
            "text": "'What does disability mean to me? The usual connotations - I find it harder to do certain things than others would. I see things differently. I don’t struggle. I have just spent my life finding efficient ways of getting round the challenges I’ve had.'"
        },
        {
            "text": "    -Beth"
        },
        {
            "text": "Our vision is to transform the everyday lives of disabled people by tackling the barriers people face. So we can build back better towards a society that works for everyone. The strategy sets out immediate actions we will take on our path towards a longer-term goal, rooting the strategy in the everyday experience of disabled people."
        },
        {
            "text": "This series explains the strategy’s eight key themes, and how we are making improvements to every part of a disabled person’s day. From the moment someone gets up to the moment they end their day."
        },
        {
            "heading": 3,
            "text": "Leisure: Widening access to arts, culture, sport and the great outdoors"
        },
        {
            "text": "Spending time with family and friends and doing the things we enjoy is a vital part of everyday life. But too many disabled people are missing out."
        },
        {
            "text": "Practical accessibility issues, stigma, and the need to carefully manage energy levels and pain, are all barriers to socialising and participation. 90% of disabled people who had accessed culture, sport and leisure services had experienced at least some difficulties."
        },
        {
            "text": "Each person has the right to enjoy their lives, we want everyone to have access to arts, culture, sport and the great outdoors."
        },
        {
            "heading": 3,
            "text": "Widening participation in art, culture and sport"
        },
        {
            "text": "We will widen participation in arts, culture and sport. Disability is one of the main barriers people give for not attending art and cultural events, and disabled people are nearly twice as likely to be physically inactive."
        },
        {
            "text": "There is wide support amongst disabled people for a national arts access scheme."
        },
        {
            "text": "'I have disabilities as a result of Meningitis. Whilst a student at The Orpheus Centre in Godstone I developed a passion for song-writing and performance. Working with places like Orpheus, and later Freewheelers and Extant, make me realise how important the performing arts are in helping disabled people develop confidence.'"
        },
        {
            "text": "    -Luke"
        },
        {
            "heading": 2,
            "text": "Tourism"
        },
        {
            "text": "We are committed to making the UK the most accessible tourism destination in Europe by 2025, as set out in the Tourism Recovery Plan. "
        },
        {
            "text": "The ultimate ambition is for the UK to have the most accessible tourism offer in the world."
        },
        {
            "text": "DCMS will:"
        },
        {
            "heading": 3,
            "text": "Improving access to nature"
        },
        {
            "text": "People with a long-term illness or health conditions are around 25% less likely to have enjoyed nature in the past 14 days than others. "
        },
        {
            "text": "In our 25 year Environment Plan, we committed to making sure that there are accessible natural spaces close to where people live and work, and to encourage more people to spend time in them to benefit their health and wellbeing."
        },
        {
            "text": "The Department for Environment, Food and Rural Affairs (DEFRA) leads a £5.7 million investment in green social prescribing - supporting people to engage in nature based interventions to prevent mental ill health and reduce health inequalities. Many disabled people will benefit."
        },
        {
            "heading": 3,
            "text": "More inclusive playgrounds"
        },
        {
            "text": "Play is an important part of growing up. It offers not only enjoyment but supports children’s social, emotional, intellectual and physical development."
        },
        {
            "text": "Yet for disabled children, the opportunities to join in play are far fewer. As a result, the opportunities to develop are also reduced. Playgrounds and other play settings can fall short in providing inclusive facilities."
        },
        {
            "text": "'My youngest son, who has cerebral palsy and epilepsy and is registered blind, loves to play and be swung around as much as any child. But as he’s grown older and bigger we’ve found it hard to find playgrounds that are accessible. This has left our whole family excluded. All children deserve and have a right to access play parks.'"
        },
        {
            "text": "- Becky"
        },
        {
            "text": "We are determined to increase opportunities for disabled children and their families, tackle barriers and enable the simple enjoyment of play for every child, wherever they live."
        },
        {
            "heading": 2,
            "text": "What are our next steps?"
        },
        {
            "text": "This is only the beginning. "
        },
        {
            "text": "We see the National Disability Strategy as a dynamic plan that we will refresh regularly in response to disabled people’s priorities."
        },
        {
            "heading": 2,
            "text": "Join the conversation"
        },
        {
            "heading": 2,
            "text": "Want to know more about the National Disability Strategy?"
        },
        {
            "text": "Read about the other seven Strategy themes:"
        }
    ]
}