{
    "url": "https://marinescience.blog.gov.uk/2021/07/28/monitoring-the-impact-of-a-changing-climate-the-global-ocean-wildlife-analysis-network-and-british-antarctic-territory/",
    "title": "Monitoring the impact of climate change: The Global Ocean Wildlife Analysis Network and British Antarctic Territory",
    "authors": [
        "Simon Morley"
    ],
    "categories": [
        "Climate Change",
        "Science",
        "Technology",
        "Vulnerable species"
    ],
    "pub_date": "2021-07-28T04:00:49+01:00",
    "content": [
        {
            "text": "In the latest of our blog series on the Global Ocean Wildlife Analysis Network, we hear from Simon Morley at the British Antarctic Survey (BAS) about what this project means for the British Antarctic Territory (BAT)."
        },
        {
            "text": "Simon Morley, British Antarctic Survey:"
        },
        {
            "text": "We are excited to be a part of the Blue Belt Programme’s Global Ocean Wildlife Analysis Network, deploying Baited Remote Underwater Video Systems (BRUVS) in BAT. We will use BRUVS in waters around Rothera Research station on the Antarctic Peninsula. The British Antarctic Survey is the UK Government’s polar research institute, and from Rothera we have been monitoring the near shore marine environment in Ryder Bay for more than 20 years. We hope that BRUVS will add an additional capacity to our research, allowing us to monitor the animals living in the surface waters."
        },
        {
            "text": "BRUVS will allow us to fill a gap in our knowledge of this mid-water system. Rothera is situated at 69°S, a region where the sea freezes for a period over winter and then ice then melts in the summer. We know the duration of the sea ice over winter has a massive effect on food availability and the level of iceberg scour, which impacts animals living on the seafloor."
        },
        {
            "text": "With the overall warming trend recorded on the Western Antarctic Peninsula since the 1970’s, the duration of winter sea ice cover has shortened, and this has affected krill numbers and distributions. Mid-Ocean research cruises have been monitoring krill and fish populations further north in the Southern Ocean for many years and have shown marked reductions in krill numbers. Some of the most charismatic animals in the oceans, such as whales, seals, and penguins, are heavily reliant on krill and fish for food and so it is important to understand how these populations are changing in response to climate change."
        },
        {
            "text": "We know there are pelagic fish and krill in Ryder Bay but this near shore region is rarely sampled by the UK’s Polar Research Vessel. Science is constantly striving to find innovative solutions to monitor the marine environment and these BRUVS offer a solution to help us better understand mid-water communities close to shore. Partnering with the Blue Belt Programme, Blue Abacus and the University of Western Australia will allow us to investigate specific questions about the marine system in Ryder Bay."
        },
        {
            "text": "The early life stages of krill rely heavily on algae living on the underside of the sea-ice for food, and so changes in the winter sea ice are expected to have a marked effect on krill populations. We want to use BRUVS to learn how the annual variation in oceanography and sea ice affects these species. The wintering marine team in BAT will be responsible for deploying the baited cameras at the beginning of the Antarctic summer, when the sea ice has melted. When there is open water and sufficient day length for the cameras to record what is attracted to the bait, they can launch the rigid inflatable boats to deploy the BRUVS."
        },
        {
            "text": "The first season will definitely be one of exploration as we learn how the cameras can be deployed and recovered in Antarctic conditions. It will also be an opportunity to find out what is attracted to the cameras as we quantify what is there. We eventually hope to turn this into a regular monitoring program, which can become part of the evidence that BAT provides to the UK Government to help inform climate policies and marine protection strategies."
        },
        {
            "text": "The value of life in the oceans is increasingly being recognised, not just for the intrinsic value of biodiversity, but for the key ecosystem services it provides to human society. One of the emerging questions is to better understand how healthy marine ecosystems capture carbon from the atmosphere and store it into the seafloor. Being part of this global network gives us an excellent opportunity to compare different marine environments and understand more about our changing oceans."
        },
        {
            "text": "Read other blogs from the series:"
        }
    ]
}