{
    "url": "https://disabilityunit.blog.gov.uk/2021/07/28/public-services-national-disability-strategy-explained/",
    "title": "Public services: National Disability Strategy explained",
    "authors": [
        "Disability Unit"
    ],
    "categories": [
        "National Strategy for Disabled People"
    ],
    "pub_date": "2021-07-28T08:00:23+01:00",
    "content": [
        {
            "text": "We have published the Government’s National Disability Strategy."
        },
        {
            "text": "Over one in five people in the UK are disabled. "
        },
        {
            "text": "'What does disability mean to me? The usual connotations - I find it harder to do certain things than others would. I see things differently. I don’t struggle. I have just spent my life finding efficient ways of getting round the challenges I’ve had.'"
        },
        {
            "text": "    -Beth"
        },
        {
            "text": "Our vision is to transform the everyday lives of disabled people by tackling the barriers people face. So we can build back better towards a society that works for everyone. The strategy sets out immediate actions we will take on our path towards a longer-term goal, rooting the strategy in the everyday experience of disabled people."
        },
        {
            "text": "This series explains the strategy’s eight key themes, and how we are making improvements to every part of a disabled person’s day. From the moment someone gets up to the moment they end their day."
        },
        {
            "heading": 3,
            "text": "Public services: Making access as smooth and easy as possible"
        },
        {
            "text": "From visiting the GP surgery to regular visits from paid carers, services such as health, social care and welfare are an important part of everyday life for many disabled people. Too often, these services can be difficult to access and fragmented."
        },
        {
            "text": "44% of disabled people who received formal care said it made them feel ‘more in control’ or ‘much more in control’ of their lives (UK Disability Survey)."
        },
        {
            "heading": 2,
            "text": "Improving access to disability benefits"
        },
        {
            "text": "Eight in 10 disabled people who had accessed benefits and pension services said they had experienced at least some difficulties (UK Disability Survey)."
        },
        {
            "text": "'Most of our lives are sat waiting.'"
        },
        {
            "text": "    -Jessica"
        },
        {
            "text": "The Department for Work and Pension (DWP) Health and Disability Support Green Paper Enabling Independent Living and Employment aims to help people to live independently and to help more people to find, stay and progress in work, wherever people are able to do so. "
        },
        {
            "text": "The proposals aim to ensure the health and disability benefits system meets the expectations of the people who use them, so people have a better experience and feel confident to engage with the full range of support. "
        },
        {
            "heading": 2,
            "text": "Health and adult social care reform"
        },
        {
            "text": "Disabled people across the UK have told us that health and social care services are a vital part of living an independent life. "
        },
        {
            "text": "However, nearly three quarters (74%) of disabled people who had accessed social services had experienced at least some difficulties, a figure that rises to 78% for those who had accessed health services."
        },
        {
            "text": "'They have the power to decide what is a ‘necessity’ and what is a ‘luxury’ when it comes to my support. I don’t have enough hours with my carer to be able to go outside or to see my friends. Going outside and social interaction is viewed as a basic human need for non-disabled people, but not for me.'"
        },
        {
            "text": "    -Efstathia"
        },
        {
            "text": "We know that a bold response is required. We are committed to sustainable reform of the adult social care system and will bring forward proposals this year (2021). "
        },
        {
            "heading": 2,
            "text": "Improving disability data and evidence"
        },
        {
            "text": "The health system does not consistently collect data on disability. "
        },
        {
            "text": "This means we do not currently have an accurate picture of the health and social care support needs of disabled people in the UK. We will take action to improve the availability, quality and use of disability data in health and adult social care."
        },
        {
            "text": "The Department for Health and Social Care will create a new disability data working group to look at health and adult social care data to highlight priority areas where there are data gaps."
        },
        {
            "heading": 3,
            "text": "Supporting autistic people and those with a learning disability"
        },
        {
            "text": "Autistic people and people with a learning disability across the UK experience health inequalities."
        },
        {
            "text": "The life expectancy for people with a learning disability is 27 years below average for women and 23 years below average for men. Autistic people die 16 years earlier than non-autistic people, on average."
        },
        {
            "text": "NHS England and NHS Improvement confirmed in March 2021 that autistic people without a learning disability will be included for the first time in their programme to learn from the lives and deaths of people with a learning disability and autistic people (LeDeR). "
        },
        {
            "text": "The second annual LeDeR report, published in December 2017, recommended that mandatory learning disability awareness training should be provided to all staff, and be delivered in conjunction with people with a learning disability and their families. "
        },
        {
            "text": "This training would improve the experiences of health and social care for people with a learning disability and autistic people. "
        },
        {
            "text": "We are taking immediate action to improve online access to public services. "
        },
        {
            "text": "We will:"
        },
        {
            "heading": 2,
            "text": "What are our next steps?"
        },
        {
            "text": "This is only the beginning. "
        },
        {
            "text": "We see the National Disability Strategy as a dynamic plan that we will refresh regularly in response to disabled people’s priorities."
        },
        {
            "heading": 2,
            "text": "Join the conversation"
        },
        {
            "heading": 2,
            "text": "Want to know more about the National Disability Strategy?"
        },
        {
            "text": "Read about the other seven Strategy themes:"
        }
    ]
}