{
    "url": "https://civilservice.blog.gov.uk/2021/07/28/putting-disability-at-the-heart-of-everything-we-do/",
    "title": "Putting disability at the heart of everything we do",
    "authors": [
        "Sarah Healey, DCMS Permanent Secretary and CS Disability Champion"
    ],
    "categories": [
        "A great place to work",
        "A Modern Civil Service",
        "An Innovative Civil Service"
    ],
    "pub_date": "2021-07-28T09:54:03+00:00",
    "content": [
        {
            "text": "The National Disability Strategy aims to improve disabled people’s everyday lives. Learn more about the Civil Service’s commitment to support disabled civil servants to thrive at work."
        },
        {
            "text": "Today the Government has published the National Disability Strategy, which aims to tackle the barriers that prevent disabled people from fully benefiting from, and contributing to, every aspect of our society and daily life."
        },
        {
            "text": "This is the culmination of months of work led by the Cabinet Office Disability Unit, setting out the widest-ranging set of practical actions to improve the lives of disabled people ever developed, across jobs, housing, transport, education, shopping, culture, justice, public services, and data and evidence."
        },
        {
            "text": "I’m pleased that the Civil Service has committed to a number of actions to improve the working lives of disabled civil servants. Many of these are aligned to the priorities I have set out in my role as Civil Service Inclusion Champion for Disability. They include; supporting leaders at every level to change behaviour and remove the barriers our disabled colleagues experience, increasing development and progression opportunities for existing civil servants who have disabilities and long-term health conditions and for those wishing to join, and working as a collective to improve IT accessibility and interoperability."
        },
        {
            "text": "It is important that we support our colleagues with disabilities to continue to thrive in their careers. Only by increasing the representation of disabled people at all grades within the Civil Service can we truly reflect British society. "
        },
        {
            "text": "How you can help"
        },
        {
            "text": "We know that 13.6% of civil servants have recorded that they have a disability in 2021, up from 7.6% a decade ago. The percentage for the working population is 14.2%, so while we still have some way to go, we’ve made good progress so far. "
        },
        {
            "text": "We’re all responsible for making the Civil Service an inclusive employer for disabled people. It is important to ensure you are thinking about disability and accessibility in all areas of your work, in how you interact with your colleagues, your wider business unit and your department. "
        },
        {
            "text": "Ask yourself..."
        },
        {
            "text": "When developing policy, ask yourself if you have taken into account the experiences of disabled people. In an interview panel or an event, ask whether or not disabled people are positively represented. When introducing new systems or processes, question if they can be used equally by everyone. When producing communications, think through how accessible your communications are and make sure accessibility is part of your standard practice, and not an afterthought."
        },
        {
            "text": "Listen and engage"
        },
        {
            "text": "If you manage a colleague with a disability or health condition, ask them about it, actively listen and engage. This is more empowering and helpful than making assumptions about the best way of working or imposing limitations based on your understanding of their condition. It is helpful to remember too that not all disabilities are visible to others."
        },
        {
            "text": "Allyship"
        },
        {
            "text": "Challenge yourself to feel comfortable sharing your experiences of disability and encourage colleagues to do the same. You don’t have to be disabled to be part of a disability network or to support disabled colleagues. Allyship is a valuable way of offering support and creating a more inclusive environment. "
        },
        {
            "text": "Finally, remember to undertake learning activities on the Learning Platform for Government. There is a wealth of information on everything from becoming disability confident, workplace adjustments, flexible work arrangements, to mental health awareness and disability awareness. In particular, disabled colleagues have consistently cited to me that their line managers’s confidence and approach has been critical to getting the best out of them, so if you're managing someone with a disability, I strongly urge you to take up these learning opportunities. "
        },
        {
            "text": "This strategy is a really positive step for the Civil Service in our collective commitment to improving the working lives of disabled colleagues. I look forward to championing the implementation of it across the Civil Service."
        }
    ]
}