{
    "url": "https://dcmslibraries.blog.gov.uk/2021/07/28/read-iscover-summer-celebrating-reading-week/",
    "title": "Read-iscover Summer: Celebrating Reading Week",
    "authors": [
        "Sarah Mears, Programme Manager, Libraries Connected"
    ],
    "categories": [
        "Events"
    ],
    "pub_date": "2021-07-28T12:53:05+01:00",
    "content": [
        {
            "text": "As we Rediscover Summer, we celebrate Reading Week from 26 July to 1 August. From reading your favourite books to visiting the places that inspired them, where will reading take you this summer?"
        },
        {
            "text": "On a sunny day, there are few things lovelier than finding a shady spot and settling down with a really good book. And if the Great British weather lets you down, a book is a great way to escape the rain and experience new worlds."
        },
        {
            "text": "During the past year reading has become a lifeline for many children. In 2020, The National Literacy Trust[footnote1]surveyed 4000 children aged 8 to 18 about their reading during lockdown. Children reported a 35% increase in the amount they were reading and a 28% increase in reading enjoyment. 29% of children said that reading made them feel better and 32% said it helped when they missed family and friends and felt sad."
        },
        {
            "text": "And it isn’t surprising! Reading has been described by Professor Keith Oatley as the mind’s flight simulator.[footnote2]By identifying with the feelings of book characters, we can better understand other people in real life. Reading takes us to places beyond our experience, broadening our horizons and celebrating our differences."
        },
        {
            "text": "But reading is also about valuing who we are, which is why it is particularly important that children from diverse backgrounds see themselves accurately portrayed in the stories they read. Stories are a wonderful way to help children cope with traumatic situations and also to provide comfort and reassurance."
        },
        {
            "text": "This week the Rediscover Summer Campaign highlights and celebrates reading.  What a wonderful way to start the summer holidays especially as the annual Summer Reading Challenge is now underway and public libraries are encouraging children to visit and sign up to become ‘Wild World Heroes’.  The Summer Reading Challenge is developed by The Reading Agency, this year in partnership with WWF and delivered to children via the public library network. It is free to join and this year, children can also join online if they are not close to a library. Children can read any book they choose from the library and collect rewards for each book they read."
        },
        {
            "text": "Reading is not just brilliant for children, it is a great opportunity for adults to have a bit of much needed downtime too. I know that libraries have been loving The Duchess of Cornwall’s Reading Room this year. She has been recommending some of her favourite books and it has generated some lovely library book displays and lots of discussion."
        },
        {
            "text": "So, my three top tips to Rediscover Summer this Reading Week."
        },
        {
            "heading": 3,
            "text": "Footnotes"
        },
        {
            "text": "[footnote1] Clark C and Picton I, Children and young people’s reading in 2020 before and during the COVID-19 lockdown, National Literacy Trust, https://literacytrust.org.uk/news/our-new-research-with-puffin-shows-a-rise-in-childrens-reading-during-lockdown-has-supported-their-mental-wellbeing-and-inspired-them-to-dream-big/2020, (Accessed 01/12/2020)"
        },
        {
            "text": "[footnote2] The mind s flight simulator | The Psychologist (accessed 18/07/2021)"
        }
    ]
}