{
    "url": "https://disabilityunit.blog.gov.uk/2021/07/28/rights-and-perceptions-national-disability-strategy-explained/",
    "title": "Rights and Perceptions: National Disability Strategy explained",
    "authors": [
        "Disability Unit"
    ],
    "categories": [
        "National Strategy for Disabled People"
    ],
    "pub_date": "2021-07-28T08:03:41+01:00",
    "content": [
        {
            "text": "We have published the Government’s National Disability Strategy."
        },
        {
            "text": "Over one in five people in the UK are disabled. "
        },
        {
            "text": "'What does disability mean to me? The usual connotations - I find it harder to do certain things than others would. I see things differently. I don’t struggle. I have just spent my life finding efficient ways of getting round the challenges I’ve had.'"
        },
        {
            "text": "     - Beth"
        },
        {
            "text": "Our vision is to transform the everyday lives of disabled people by tackling the barriers people face. So we can build back better towards a society that works for everyone. The strategy sets out immediate actions we will take on our path towards a longer-term goal, rooting the strategy in the everyday experience of disabled people."
        },
        {
            "text": "This series explains the strategy’s eight key themes, and how we are making improvements to every part of a disabled person’s day. From the moment someone gets up to the moment they end their day. "
        },
        {
            "heading": 2,
            "text": "Rights and Perceptions: Removing barriers to participating fully in public and civic life and wider society "
        },
        {
            "text": "We believe that everyone has the right to live without judgement, and to access our public services and justice system. However, that is not fully the case for many disabled people. "
        },
        {
            "text": "Disabled people have told us that the negative attitudes of others have a significant impact across all areas of their everyday lives. "
        },
        {
            "text": "'One of the worst things is people being patronising.'"
        },
        {
            "text": "    - Kathryn"
        },
        {
            "text": "There are wide-ranging impacts of negative perceptions on disabled people. They include, but are not limited to:"
        },
        {
            "text": "Over half (54%) of disabled people worry about being insulted or harassed in the street, and 45% worry about being physically attacked by strangers."
        },
        {
            "heading": 2,
            "text": "Attitudes towards disabled people"
        },
        {
            "text": "'Very often second class, you're not seen as equal. And we have every right. We still only have one go at life like everyone else. And just because we can't walk as well, see as well, hear as well, whatever. That doesn't make us any less of a person.'"
        },
        {
            "text": "     -Wales roundtable participant"
        },
        {
            "text": "Just 8% of disabled people, 8% of carers, and 12% of the general public ‘agree’ or ‘strongly agree’ that the views held by members of the public about disability are generally helpful for disabled people."
        },
        {
            "text": "Attitudes are changing, but have further to go. Data from the British Social Attitudes Survey in 2017 found that 83% of respondents thought of disabled people as the same as everyone else, compared with 77% in 2005."
        },
        {
            "heading": 2,
            "text": "Changing perceptions"
        },
        {
            "text": "Societal change takes time, but there is more that the government can do to change negative perceptions of disabled people. "
        },
        {
            "text": "To help ensure disabled people can play a full role in society, we are:"
        },
        {
            "heading": 2,
            "text": "Crime"
        },
        {
            "text": "Disabled people are disproportionately affected by crime. Disabled adults are more likely to be victims of crime (20.8%) than other adults (19%), and disabled children aged 10 to 15 (12.%) are almost twice as likely to be victims of crime than other children (6.3%). "
        },
        {
            "text": "Disabled women are more likely to experience domestic abuse and sexual assault than non-disabled women. Those with mental health conditions, learning difficulties and social and behavioural impairments are most frequently victimised. "
        },
        {
            "text": "The Ministry of Justice is investing £1 million by spring 2022 to recruit more disabled magistrates in England and Wales as part of a wider effort to improve diversity, alongside other under-represented groups."
        },
        {
            "text": "We are ambitious to do more to tackle crime against disabled people. The Disability Unit will prioritise further cross-government action to tackle hate crime in 2021–2022."
        },
        {
            "heading": 2,
            "text": "What are our next steps?"
        },
        {
            "text": "This is only the beginning. "
        },
        {
            "text": "We see the National Disability Strategy as a dynamic plan that we will refresh regularly in response to disabled people’s priorities."
        },
        {
            "heading": 2,
            "text": "Join the conversation"
        },
        {
            "heading": 2,
            "text": "Want to know more about the National Disability Strategy?"
        },
        {
            "text": "Read about the other seven Strategy themes:"
        },
        {
            "text": " "
        }
    ]
}