{
    "url": "https://disabilityunit.blog.gov.uk/2021/07/28/shopping-national-disability-strategy-explained/",
    "title": "Shopping: National Disability Strategy explained",
    "authors": [
        "Disability Unit"
    ],
    "categories": [
        "National Strategy for Disabled People"
    ],
    "pub_date": "2021-07-28T08:00:17+01:00",
    "content": [
        {
            "text": "We have published the Government’s National Disability Strategy."
        },
        {
            "text": "Over one in five people in the UK are disabled. "
        },
        {
            "text": "'What does disability mean to me? The usual connotations - I find it harder to do certain things than others would. I see things differently. I don’t struggle. I have just spent my life finding efficient ways of getting round the challenges I’ve had.'"
        },
        {
            "text": "   -Beth "
        },
        {
            "text": "Our vision is to transform the everyday lives of disabled people by tackling the barriers people face. So we can build back better towards a society that works for everyone. The strategy sets out immediate actions we will take on our path towards a longer-term goal, rooting the strategy in the everyday experience of disabled people."
        },
        {
            "text": "This series explains the strategy’s eight key themes, and how we are making improvements to every part of a disabled person’s day. From the moment someone gets up to the moment they end their day."
        },
        {
            "heading": 3,
            "text": "Shopping: Creating more consumer choice and convenience  "
        },
        {
            "text": "Too often, disabled consumers experience hard to navigate high street store layouts, inaccessible special offers, cluttered websites with difficult to read text and a retail workforce not yet routinely delivering excellent customer service to meet their needs."
        },
        {
            "text": "Many businesses on UK high streets are still inaccessible for disabled consumers. The buildings that disabled respondents to the UK Disability Survey had most frequently been unable to access or had extreme difficulty accessing were shops and shopping centres (78%), and pubs, bars, restaurants and cafes (66%)."
        },
        {
            "text": "Shopping online can be a similarly frustrating experience. 98% of the million most visited web pages did not meet accessibility standards and 69% of disabled internet users click away from sites with barriers."
        },
        {
            "heading": 2,
            "text": "Transforming the accessibility of our towns and high streets"
        },
        {
            "text": "‘If I’m using my scooter or wheelchair to mobilise around or even on crutches, I find that the actual physical space between in aisles and between, you know, garment rails are either too high, around the shop, there’s not enough accessibility to get round at all.’"
        },
        {
            "text": "   -UK Disability Survey respondent"
        },
        {
            "text": "We want our high streets and town centres to be welcoming and accessible for everyone. Yet for many disabled people, they can be an obstacle course."
        },
        {
            "text": "Responding to the UK Disability Survey, nearly a third (31%) of disabled people found using public spaces difficult ‘all the time’ or ‘often’."
        },
        {
            "text": "This is not only a social injustice but a potentially huge loss to high street businesses. One estimate puts the spending power of disabled people and their families at £274 billion."
        },
        {
            "text": "DfT issues guidance for local authorities and other organisations in England, which is also referred to in devolved administrations, on accessible pedestrian and transport infrastructure. We will strengthen our guidance in 2021."
        },
        {
            "heading": 2,
            "text": "Driving innovation in assistive technology"
        },
        {
            "text": "‘Because we couldn’t work out doing an online food shop, we just couldn’t get the technology. Our devices that we had at the time were just not conducive for trying to do a food shop on it. And then once you got on, there were no spaces, no delivery slots. So, we quickly gave up with that.’"
        },
        {
            "text": "    -Jessica"
        },
        {
            "text": "Technology offers a range of potential solutions to many of the everyday challenges that disabled people face. The impact of products that support everyday tasks is huge. Over three quarters (78%) of disabled people find access to mobile technologies helpful for living independently."
        },
        {
            "text": "We have yet to take full advantage of the potential of technology to increase disabled people’s independence."
        },
        {
            "text": "To champion disabled consumers and help make the UK the most accessible place in the world to live and work with technology, we will:"
        },
        {
            "text": "We want to do more in the longer term. The Disability Unit recognises the huge potential of action in this area and will prioritise further cross-government work in 2021/22. As a first step, we will improve our understanding of disabled people’s experiences accessing products and services in the UK. This will include commissioning research and exploring the extra costs some disabled people may face."
        },
        {
            "heading": 2,
            "text": "What are our next steps?"
        },
        {
            "text": "This is only the beginning. "
        },
        {
            "text": "We see the National Disability Strategy as a dynamic plan that we will refresh regularly in response to disabled people’s priorities."
        },
        {
            "heading": 2,
            "text": "Join the conversation"
        },
        {
            "heading": 2,
            "text": "Want to know more about the National Disability Strategy"
        },
        {
            "text": "Read about the other seven Strategy themes:"
        }
    ]
}