{
    "url": "https://disabilityunit.blog.gov.uk/2021/07/28/the-launch-of-the-national-disability-strategy/",
    "title": "The launch of the National Disability Strategy",
    "authors": [
        "Justin Tomlinson MP"
    ],
    "categories": [
        "National Strategy for Disabled People"
    ],
    "pub_date": "2021-07-28T07:00:44+01:00",
    "content": [
        {
            "text": "Today we are launching our National Disability Strategy – a cross-government effort to transform disabled people’s everyday lives."
        },
        {
            "text": "The strategy will build on progress made over the last 25 years since the Disability Discrimination Act. It will make the United Kingdom a place in which disabled people can truly share opportunities and fully reach their potential to fully participate in our modern, forward looking society."
        },
        {
            "heading": 2,
            "text": "Transforming disabled people’s everyday lives"
        },
        {
            "text": "Whoever you are. Wherever you live. Whatever your background. From the youngest to the oldest disabled person. Whether or not you have a disability – and whether that disability or health condition is visible or non-visible – everyone should be able to participate in everyday life. "
        },
        {
            "text": " The strategy was produced with the everyday experiences of disabled people at the heart of the process. We are acting on feedback from disabled people and their families, friends and carers across a range of areas that disabled people have told us are important."
        },
        {
            "text": "For example, my constituent Becky shared some of her experiences:"
        },
        {
            "text": "'My youngest son, who has cerebral palsy and epilepsy and is registered blind, loves to play and be swung around as much as any child. But as he’s grown older and bigger we’ve found it hard to find playgrounds that are accessible. This has left our whole family excluded. It has become increasingly more difficult to take my 3 children to our local play parks as my youngest son gets extremely upset as he wants to join in and be included. We will often avoid going to parks which is not fair on him or his brothers. All children deserve and have a right to access play parks.'"
        },
        {
            "text": "    -   Becky"
        },
        {
            "text": "We will make playgrounds more inclusive. We are determined to increase opportunities for disabled children and their families, tackle barriers and enable the simple enjoyment of play for every child, wherever they live."
        },
        {
            "heading": 2,
            "text": "A strategy by disabled people, for disabled people"
        },
        {
            "text": "Real lived experience will be key to our work now and going forwards. Disabled people, disabled people’s organisations, charities and groups are empowered to help shape and develop our priorities."
        },
        {
            "text": "We carried out the biggest listening exercise with disabled people in recent history. Over 16,000 people responded to our UK Disability Survey. As a result, this strategy is far more wide-ranging than approaches of the past."
        },
        {
            "text": " The individual actions presented in this strategy are steps that will make a real difference whether at home, in work or school, whilst shopping, enjoying leisure, accessing services, travelling or exercising rights like voting."
        },
        {
            "heading": 2,
            "text": "Holding government to account"
        },
        {
            "text": "The strategy is the start of a series of practical, tangible steps we can take right across government to improve disabled people’s everyday lives. It highlights our plans for all parts of life that matter to disabled people in one place. A very real cross-government focus, personally backed by the Prime Minister."
        },
        {
            "text": "The strategy will hold to account every part of government. Each department has nominated a Ministerial Disability Champion. They will ensure the needs of disabled people are at the heart of policy-making in their department."
        },
        {
            "text": " We will publish an annual report that will:"
        },
        {
            "text": "- measure progress"
        },
        {
            "text": "- offer the opportunity to update the strategy."
        },
        {
            "heading": 2,
            "text": "Breaking down barriers holding disabled people back"
        },
        {
            "text": "The breadth of this strategy reflects the reality that disability affects people differently. Disability affects different aspects of everyday life."
        },
        {
            "text": " We are understanding and dismantling the barriers and attitudes that hold disabled people back."
        },
        {
            "text": "Thank you to everyone who has supported and helped shape this vital work. This strategy represents the single greatest focus in collaboration across government. Solely focussed on levelling up opportunity, now and embedded for the future."
        },
        {
            "text": "Read the National Disability Strategy."
        },
        {
            "heading": 3,
            "text": "Read about the National Disability Strategy themes:"
        }
    ]
}