{
    "url": "https://disabilityunit.blog.gov.uk/2021/07/28/transport-national-disability-strategy-explained/",
    "title": "Transport: National Disability Strategy explained",
    "authors": [
        "Disability Unit"
    ],
    "categories": [
        "National Strategy for Disabled People"
    ],
    "pub_date": "2021-07-28T08:03:15+01:00",
    "content": [
        {
            "text": "We have published the Government’s National Disability Strategy."
        },
        {
            "text": "Over one in five people in the UK are disabled. "
        },
        {
            "text": "'What does disability mean to me? The usual connotations - I find it harder to do certain things than others would. I see things differently. I don’t struggle. I have just spent my life finding efficient ways of getting round the challenges I’ve had.'"
        },
        {
            "text": "    -Beth"
        },
        {
            "text": "Our vision is to transform the everyday lives of disabled people by tackling the barriers people face. So we can build back better towards a society that works for everyone. The strategy sets out immediate actions we will take on our path towards a longer-term goal, rooting the strategy in the everyday experience of disabled people."
        },
        {
            "text": "This series explains the strategy’s eight key themes, and how we are making improvements to every part of a disabled person’s day. From the moment someone gets up to the moment they end their day."
        },
        {
            "heading": 2,
            "text": "Transport: improving the accessibility and experience of everyday journeys"
        },
        {
            "text": "Every day, many disabled people rely on a transport network to get out and about that can present obstacles as much as convenience."
        },
        {
            "text": "The current evidence base on disability is incomplete and often needs improving, but nonetheless underlines the scale of the challenge in tackling the enduring barriers disabled people may face throughout their day. When commuting, just a quarter of train stations have step-free access between all platforms."
        },
        {
            "text": "'The world is different. You have to book if you want to use a bus; you have to book if you want to get a train. [Spontaneity] ... is a luxury.'"
        },
        {
            "text": "    -Jessica"
        },
        {
            "text": "Our determination to deliver a transport system which is accessible for all remains unchanged. We know from our own lived experience research that reliable transport can be transformational in supporting an independent life. "
        },
        {
            "heading": 3,
            "text": "Transforming the accessibility of the railway station network "
        },
        {
            "text": "We published the Williams-Shapps Plan for Rail in May 2021, which commits to the establishment of a new rail body, Great British Railways. The white paper contains a suite of accessibility reforms, including:"
        },
        {
            "text": "This strategy will provide the first, joined-up, system-wide approach to accessibility, including getting to, from and around stations and on and off trains."
        },
        {
            "text": "Transport is a partially devolved issue, allowing Scotland, Wales and Northern Ireland to benefit from UK wide infrastructure investment while also responding to local needs."
        },
        {
            "heading": 3,
            "text": "Improving the accessibility of buses, bus stations and bus stops"
        },
        {
            "text": "'Public transport is a major issue for disabled people - there are countless barriers to accessing trains, tubes, taxis, buses etc. Manual boarding ramps aren't good enough - that's not genuine independence, especially when staff can treat you like a nuisance when you want to turn up and go (we have a right to spontaneous travel too). The majority of train and tube stations aren't even accessible, that needs to change.'"
        },
        {
            "text": "    -UK Disability Survey respondent "
        },
        {
            "text": "We want disabled people to be able to complete bus journeys independently and with confidence. Audible and visible next stop announcements can make it easier for everyone to use buses. "
        },
        {
            "text": "As announced in Bus Back Better, the National Bus Strategy for England, subject to final analysis, DfT will introduce Regulations by summer 2022 to require bus companies to provide audible and visual announcements onboard their services in Great Britain."
        },
        {
            "text": "DfT has already committed £2 million to help the smallest bus companies to provide audible and visible information on services. "
        },
        {
            "text": "DfT will review the Public Service Vehicles Accessibility Regulations 2000, starting with research in 2022. The department will also commission research into the design of bus stations and bus stops in England by April 2022. "
        },
        {
            "heading": 3,
            "text": "Improving the accessibility of taxis and private hire vehicles "
        },
        {
            "text": " Current protection for disabled people using taxis and private hire vehicles (PHVs) is patchy."
        },
        {
            "text": "Except where drivers have a medical exemption, it is an offence to refuse a wheelchair user access to a designated wheelchair accessible vehicle. It is similarly an offence to refuse an assistance dog owner access to any vehicle. But other disabled people do not share the same protections."
        },
        {
            "text": "Disabled people continue to report being discriminated against by taxi and PHV drivers or not given necessary assistance. "
        },
        {
            "text": "DfT will take forward legislation during the current Parliament to strengthen the law on the carriage of disabled people in taxis and PHVs across Great Britain. This will ensure protection from overcharging and the provision of appropriate assistance, regardless of the service they choose to use."
        },
        {
            "heading": 3,
            "text": "Making ‘lifeline’ ports more accessible for disabled passengers"
        },
        {
            "text": "Disabled residents on the Isle of Wight and the Isles of Scilly rely on ferry services to connect with the UK mainland for work, leisure and access to essential services, such as healthcare. "
        },
        {
            "text": "DfT will provide up to £1 million to improve the accessibility of lifeline seaports serving the Isle of Wight and the Isles of Scilly for disabled people, with ports invited to apply for funding for improvements in the financial year 2021 to 2022."
        },
        {
            "heading": 2,
            "text": "What are our next steps?"
        },
        {
            "text": "We are taking immediate action to improve access to transport for disabled people. "
        },
        {
            "text": "The Department for Transport will:"
        },
        {
            "text": "This is only the beginning. "
        },
        {
            "text": "We see the National Disability Strategy as a dynamic plan that we will refresh regularly in response to disabled people’s priorities."
        },
        {
            "heading": 2,
            "text": "Join the conversation"
        },
        {
            "heading": 2,
            "text": "Want to know more about the National Disability Strategy?"
        },
        {
            "text": "Read about the other seven Strategy themes:"
        }
    ]
}