{
    "url": "https://history.blog.gov.uk/2021/07/28/when-the-wall-went-up-britain-and-the-berlin-crisis-1961/",
    "title": "When the Wall went up: Britain and the Berlin Crisis, 1961",
    "authors": [
        "Dr Richard Smith"
    ],
    "categories": [
        "FCDO Historians",
        "Foreign affairs and diplomacy",
        "Foreign Office Historians",
        "What's the context? series"
    ],
    "pub_date": "2021-07-28T15:45:02+01:00",
    "content": [
        {
            "text": "Sixty years ago simmering Cold-War tensions were dramatically brought to a head in Berlin. A new volume of documents from the FCDO Historians tells how Britain responded to the crisis brought about by the construction of the Berlin Wall."
        },
        {
            "text": "In the early hours of Sunday 13 August 1961, Brigadier L.F. Richards of the British military police in Berlin, was woken from his sleep by a patrol who reported unusual activity along the border. Driving to the Brandenburg Gate, he saw the border between East and West Berlin \"being blocked off with concrete and barbed wire, and columns of vehicles unloading police, soldiers and engineering stores \"as far as the eye could see\". "
        },
        {
            "text": "Crossing into East Berlin, he found a scene of intense activity. \"I could feel considerable tension’, he recalled. ‘There were uniformed men everywhere, all heavily armed. Almost every open space of ground had military vehicles of one sort or another on it.\" The main roads \"were jammed; packed with military vehicles including armoured vehicles and a lot of transport vehicles carrying barbed wire and other materials\". The few civilians he saw in East Berlin seemed \"bewildered and apprehensive\". "
        },
        {
            "text": "He was witnessing the erection of the Berlin Wall, dividing the Soviet sector in the east from the British, French and American sectors in the west. It became the most visible symbol of the Cold War and the division of Europe until it was breached dramatically on the night of 9 November 1989. "
        },
        {
            "text": "Keep tabs on the past: sign up for our email alerts"
        },
        {
            "text": "Follow our FCDO Historians on Twitter @FCDOHistorians"
        }
    ]
}