{
    "url": "https://socialcare.blog.gov.uk/2021/07/28/wres-stories-less-talking-more-action/",
    "title": "WRES stories: less talking, more action",
    "authors": [
        "Gina Walton"
    ],
    "categories": [
        "Information sharing",
        "Workforce",
        "WRES"
    ],
    "pub_date": "2021-07-28T13:41:48+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Time to get to work"
        },
        {
            "text": "For too long, there have been conversations about the need to establish true racial equality, across all tranches of society, but not enough tangible action to bring it about."
        },
        {
            "text": "We feel the social care workforce race equality standard (WRES) will help increase visibility of racial issues in the workplace – for instance, the need for greater representation of people from different ethnic backgrounds in leadership positions, and, more broadly, greater career development opportunities at all levels."
        },
        {
            "text": "Here at Kent County Council (KCC) we’re really excited to be part of the WRES, as it will hold us accountable for the progress we make to achieve racial equality."
        },
        {
            "text": "This is about promoting a fair organisational culture, one which has the potential to expand across the entire council and inspire others."
        },
        {
            "heading": 2,
            "text": "Forming a team"
        },
        {
            "text": "Kent is a very large local authority. As such, finding the right people to regularly support a piece of work can sometimes prove challenging."
        },
        {
            "text": "Securing strong endorsement from our Directors of Social Care in both Adult’s and Children’s services was the first piece of the puzzle. Next, came linking in with our HR department, particularly in relation to wider organisational work on equalities undertaken by KCC."
        },
        {
            "text": "We also knew we’d need the analytical expertise of colleagues from our central business performance team. We then reached out to the Principal Social Workers, in both our adult’s and children’s functions, inviting them to be part of the project team heading up this work."
        },
        {
            "text": "Finally, we made sure representation from staff from ethnic minority backgrounds was included front-and-centre by inviting the Chair of their representative staff group."
        },
        {
            "text": "With our project team assembled, we felt in a much more certain position to move forward."
        },
        {
            "heading": 2,
            "text": "Our achievements to date"
        },
        {
            "text": "To help us understand our position in Kent and identify any challenges, we have been reviewing our data – including identifying how many minority ethnic staff have been appointed to roles within the council from shortlisting in the last 12 months."
        },
        {
            "text": "In total there are 9 metrics. Each month we focus on two metrics, looking at the data and what it is telling us, following which we test our assumptions with the wider staff group. This is helping us prepare our action plan."
        },
        {
            "text": "After hearing KCC had been selected as a pilot site for the WRES, and the announcement of engagement sessions with the Department of Health and Social Care (DHSC) WRES team, we promoted this invitation to social care practitioners across our adults and children’s social care departments."
        },
        {
            "text": "Many of our staff attended the first engagement event and shared sentiments about appreciating an open and safe space to share lived experiences. We have since heard many sobering personal stories, which bolster the need for change, but also express an understandable degree of scepticism given the relatively slow progress of racial equality to date across society."
        },
        {
            "text": "However, the broad consensus has been one of real hope – and more importantly belief – that the WRES can accelerate those long overdue changes. It is our aim that this principle of openness continues throughout the life of the WRES programme, and feeds into the ongoing annual reporting."
        },
        {
            "text": "We want to build on conversation to create action."
        }
    ]
}