{
    "url": "https://healthmedia.blog.gov.uk/2025/05/27/nhs-pay-everything-you-need-to-know-about-the-2025-pay-award/",
    "title": "NHS Pay: everything you need to know about the 2025 pay award ",
    "authors": [
        "DHSC Media Team"
    ],
    "categories": [
        "Pay awards"
    ],
    "pub_date": "2025-05-27T11:42:03+01:00",
    "content": [
        {
            "text": "The Health and Social Care Secretary has accepted the recommendations of the independent pay review bodies to confirm pay awards for 2025-26 for doctors, nurses, dentists, and other NHS staff.  "
        },
        {
            "text": "This confirms what these groups will be paid for the next financial year – every group is receiving an above inflation pay rise for the second year in a row. "
        },
        {
            "text": "Here’s what you need to know about NHS pay awards. "
        },
        {
            "heading": 3,
            "text": "How much are the pay awards? "
        },
        {
            "text": "Resident Doctors will see their pay rise by an average of 5.4% (a 4% rise plus a consolidated payment of £750). "
        },
        {
            "text": "We are also funding a pay rise of 4% for consultants, specialty doctors, specialists and GPs, with dentists also receiving a contract uplift to increase their pay. "
        },
        {
            "text": "Agenda for Change (AfC) staff, which includes nurses, health visitors, midwives, ambulance staff, porters and cleaners will see their pay rise by 3.6%.  "
        },
        {
            "text": "Very Senior Managers (VSMs) are receiving an award of 3.25% . "
        },
        {
            "heading": 3,
            "text": "Why are doctors being given higher pay rises than nurses again?  "
        },
        {
            "text": "Each independent Pay Review Body (PRB) makes recommendations based on evidence from government, employers and unions.  "
        },
        {
            "text": "Different conclusions between PRBs reflect the specific circumstances of each workforce.  "
        },
        {
            "text": "Following last year's 5.5% award, we are accepting the recommendations of the NHSPRB (the pay review body which sets pay for Agenda for Change staff including nurses), based on evidence submitted by government, employers and unions, to give Agenda for Change staff, including nurses, an uplift of 3.6% for 2025-26. "
        },
        {
            "text": "This means more money in nurses’ pockets. The average starting salary for a nurse will now be around £31,050, up from around £27,050 in 2023. "
        },
        {
            "text": "We've also committed to issuing the NHS Staff Council with a funded mandate for 2026/27 to begin to resolve outstanding concerns within the Agenda for Change pay structure, including issues with pay banding and career progression. "
        },
        {
            "heading": 3,
            "text": "Are resident doctors going to strike again? "
        },
        {
            "text": "In April, the BMA announced its intention to ballot its members for strike action, with the ballot opening on 27 May and closing on 7 July. "
        },
        {
            "text": "We want to work constructively with all unions to avoid disrupting patient services and it's disappointing that the BMA chose to ballot members before even knowing the pay rise.   "
        },
        {
            "text": "The resident doctor pay award for 2025/26 is an average of 5.4% (4% plus a consolidated payment of £750, with a range of between 5.1% and 6%). This above inflation uplift is the highest across the public sector."
        },
        {
            "text": "This builds on last year's pay deal, which resident doctors voted to accept and means Resident Doctors have seen an average increase in pay of 28.9% over the last three years.  "
        },
        {
            "text": "We expect the average full-time basic pay of a resident doctor will reach about £54,300 in 2025-26.  "
        },
        {
            "heading": 3,
            "text": "Are the pay awards fully funded?  "
        },
        {
            "text": "Yes – the pay award will be fully funded. "
        },
        {
            "heading": 3,
            "text": "How are you affording this pay rise? "
        },
        {
            "text": "The Chancellor has been clear that departments would need to find savings to afford pay awards.   "
        },
        {
            "text": "We are eliminating waste and low-value spending across the health sector, including reducing Integrated Care Board costs by 50%. "
        },
        {
            "text": "Every penny saved is being redirected to support frontline services and staff, which includes these pay awards. These increases are essential for recruiting and retaining the talented staff we need to create an NHS fit for the future."
        },
        {
            "heading": 3,
            "text": "When will NHS staff receive their pay rise? "
        },
        {
            "text": "Staff will receive their pay uplifts from August – two months earlier than last year. "
        },
        {
            "text": "Pay uplifts will be backdated to 1 April. "
        },
        {
            "text": "Looking ahead, we're committed to improving this timeline further by remitting the health Pay Review Bodies for 2026/27 in July, with an ambition to implement pay awards as soon as possible in 2026/27. "
        },
        {
            "heading": 3,
            "text": "What else are you doing to ensure working in the NHS is an attractive profession? "
        },
        {
            "text": "With NHS staff, we have already delivered over 3.5 million more appointments and cut waiting lists by over 200,000 since July 2024. Working together, we are creating a healthcare system that works for both staff and patients. "
        },
        {
            "text": "Just some of the measures we’ve put in place to improve working conditions include: "
        }
    ]
}