{
    "url": "https://naturalengland.blog.gov.uk/2025/05/27/were-better-together-the-bollin-to-mersey-nature-recovery-partnership/",
    "title": "We're better together - the Bollin to Mersey Nature Recovery Partnership",
    "authors": [
        "Hilary Wood"
    ],
    "categories": [
        "Biodiversity",
        "Natural England",
        "Nature",
        "Nature Recovery",
        "Nature Recovery Network",
        "Wildlife"
    ],
    "pub_date": "2025-05-27T11:01:09+01:00",
    "content": [
        {
            "heading": 4,
            "text": "What is the Bollin to Mersey Nature Recovery Partnership?"
        },
        {
            "text": "It seems at first glance that the contrast between the Southern part of Greater Manchester and the Northern part of its neighbouring county Cheshire, is massive. Urban versus rural, grey rather than green, nature poor not nature rich, municipal parks in housing estates versus stately homes in historic parkland, Coronation Street versus the Real Housewives of Cheshire."
        },
        {
            "text": "But of course, it’s not as simple as that and that’s just one of the challenges of working on the Bollin to Mersey Nature Recovery Partnership."
        },
        {
            "text": "This is just one of twelve Nature Recovery Projects across England covering more than 285,000ha across England – the first round of which was announced in 2022 by Natural England and Defra. These multi-partnership projects are designed to fast-track nature recovery by working collaboratively to create and restore wildlife-rich habitats, corridors and stepping-stones to help wildlife populations to move around freely."
        },
        {
            "text": "This partnership has seen Natural England working with the Wildlife Trust for Lancashire, Manchester and North Merseyside as well as Manchester City Council – and with some great results."
        },
        {
            "heading": 4,
            "text": "Connections along the Mersey"
        },
        {
            "text": "The River Mersey has shaped the low-lying landscape as it flows east to west through the Greater Manchester conurbation of Stockport town centre through to Irlam Locks where it meets Manchester Ship Canal. A string of well visited wildlife sites and green spaces follow this length of riverside, providing a vital nature corridor between housing, transport and industrial development."
        },
        {
            "text": "Many species that you might expect to find only in rural areas live here. The woodlands are home to Tawny Owls, Song Thrushes, and small numbers of rare, endangered Willow Tits. The wide pathways between trees provide feeding routes for Pipistrelle and Daubenton’s Bats; the rough grassland meadows support Grasshopper Warblers, Ringlet butterflies and provide a wealth of insects for Swifts to feed on.  "
        },
        {
            "text": "With such rich and varied habitats within the city, Manchester’s Mersey Valley needs well informed management. Through the Nature Recovery Partnership, we have been able to work with Lancashire Wildlife Trust and Manchester City Council to better understand   the roles that all the sites – plus the wildlife corridor as a whole - play for nature recovery."
        },
        {
            "text": " Wildlife Trust staff have carried out soil analysis and plant surveys, collated species records, and assessed how the sites provide ecological connectivity, helping species thrive and move through the river valley."
        },
        {
            "heading": 4,
            "text": "Priority ponds"
        },
        {
            "text": "This research shows that prioritising the creation, restoration and maintenance work on wetlands, grassland, fen, reedbed and scrub habitats is critical."
        },
        {
            "text": "And three ponds have already been restored at Chorlton Ees, a Local Nature Reserve in the heart of Manchester’s Mersey Valley. Overhanging branches and trees were removed to reduce overshading, and reed beds were managed to promote a diverse structure and reduce encroachment by scrub or invasive species."
        },
        {
            "text": "Silt was dug out and water levels deepened, enhancing this network of ponds and returning them as great habitats for invertebrates, pond plants and amphibians. It’s early days but the signs are good and we’re looking out for the first frog spawn of the spring."
        },
        {
            "heading": 4,
            "text": "Managing meadows"
        },
        {
            "text": "The Mersey Valley’s grasslands require management too. Regular mowing and removal of the cut grasses maintains and diversifies plant species growing in the meadows, which in turn maximises the number and variety of insects which will thrive. "
        },
        {
            "text": "Local Friends group members have been trained in traditional hay cutting practices and use scythes for hay cutting in small fields. In large fields, more modern technology is embraced and “cut and collect” machinery was used."
        },
        {
            "heading": 4,
            "text": "Building future nature recovery"
        },
        {
            "text": "We know that a growing national network of expanded, improved, and better-connected wildlife-rich places not only helps nature to recover, but also benefits people for their health, wealth and wellbeing. "
        },
        {
            "text": " Improving the quality of habitats, whether they are in rural or urban areas, does this. They also play a critical role in contributing to the country’s Nature Recovery Network."
        },
        {
            "text": "This article previously appeared in Lapwing, the magazine of The Wildlife Trust for Lancashire, Manchester and North Merseyside."
        }
    ]
}