{
    "url": "https://digitaltrade.blog.gov.uk/2025/05/27/working-on-matrix-working-looking-back-after-4-years/",
    "title": "Working on matrix working: looking back after 4 years",
    "authors": [
        "Jason Kitcat, DDaT Director"
    ],
    "categories": [
        "People"
    ],
    "pub_date": "2025-05-27T10:26:37+01:00",
    "content": [
        {
            "heading": 3,
            "text": "Jason Kitcat"
        },
        {
            "text": "In DBT’s Digital, Data and Technology teams, we have been matrix working for 4 years now. In this post, I’m going to reflect on how we changed our structure and ways of working, and how it has matured over time."
        },
        {
            "text": "In late 2020, as we considered how to introduce the DDaT Capability Framework and associated pay system, we were also keen to reinforce the importance of multi-disciplinary working. In the rush to create our teams for the then Department for International Trade (DIT), team structures grew organically at pace. Under pressure to deliver new systems, reporting lines had a rag-tag mix of professions, roles and services. Unfortunately, this led to pools of inconsistent practice and technology. This made quality control and cyber monitoring difficult, but it also meant it was hard to move people across priorities. We felt this impacted people’s professional development and career opportunities, and our function felt too siloed from the rest of the department."
        },
        {
            "text": "With the possibility of a new pay and capability system coming in, we felt it was the ideal time to look at our structure overall. The DDaT Capability Framework defines a range of professions and roles within them. It also creates the structure for colleagues to progress on their capability scores as they demonstrate improving skills and knowledge. Increasing your capability score can lead to increased pay without having to change grade or job."
        },
        {
            "text": "With help from North Highland, who had supported other parts of government to implement these frameworks, we collectively worked with our teams to plan our approach to this.  We used a panel of staff volunteers as our main sounding board along with our leadership team to agree on these principles for our new structure:"
        },
        {
            "text": "Through this we aligned to a model where Heads of Profession line-managed their professions. Each Chief (SMT member, usually a Deputy Director) would sponsor several professions and so line manage the Heads of Profession. We ensured these professions, and their roles, aligned to the DDaT capability framework."
        },
        {
            "text": "Then we created portfolios for task management that reflected the department’s priorities. For cross-cutting work, we recognised enabling teams that sat outside of the portfolios. Each Chief would sponsor one or more portfolios and so would be task managing multi-disciplinary teams to deliver those outcomes."
        },
        {
            "text": "It naturally took us some time to adjust to this way of working. It was more disruptive for some teams and professions than others. In the meantime, we continued to grow our permanent headcount, starting at roughly 120 to over 500 full time equivalents. This growth, as well as increased demands on us to deliver, created some tensions and strains in the ways of working. This was added to as we grew to take on a third of the former Department for Business, Energy and Industrial Strategy (BEIS)."
        },
        {
            "text": "We were fortunate to be able to receive coaching and support from Emily Webber and Rebecca Kemp over 2023 and 2024 to help us with these challenges. I cannot do justice to all that we worked on since moving to this way of working.  However, some key ‘aha’ moments were when we found much clearer language to explain what we meant. Sounds obvious but when everyone has such differing responses to similar words, and there are lots of us, it’s vital."
        },
        {
            "text": "Working in collaboration we explored and agreed language. Lots of post-it notes (real and virtual) were used in getting there. In doing so we clarified our thinking on roles, responsibilities and how to negotiate on tricky issues like sharing resources."
        },
        {
            "text": "This led us to being more careful with our language for explaining and defining teams. Through this process we improved our understanding of the needs and purpose of teams, and so how best to support people in them."
        },
        {
            "text": "The dimensions we decided were important were:"
        },
        {
            "text": "So for example, our data science team is of the:"
        },
        {
            "text": " In contrast our regulatory services delivery team is of the:"
        },
        {
            "text": "Emily wrote up some of this work in this post on her blog. Being clear and using commonly agreed language genuinely unlocked something important for us. As a result. we rearranged our portfolios, changed some of their names and re-cast some teams to be clearer in their purpose."
        },
        {
            "text": "We have since been working on clarifying the different roles Heads of Profession play in relation and contrast to those at the same seniority who are managing portfolios. As leaders who sit on both sides of the matrix – line and task management – we are reflecting on how our behaviours and preferences can nudge and influence outcomes."
        },
        {
            "text": "Why does this matter? Why should anyone choose this type of matrix working?  The reason why is it means you will have multidisciplinary working baked into your essence. You will have communities of professions supporting each other, developing common ways of working and learning. You will also have the flexibility to respond to the changing needs of your stakeholders: Portfolios and teams can shift and move (ours have many times now) without it becoming a whole ‘restructure’ with all the fear, uncertainty and delay that entails."
        },
        {
            "text": "This way of working also aligns well with how the DDaT Capability Framework expects things to happen. Groups of professionals support each other’s development and moderate their capability scoring."
        },
        {
            "text": "We will continue to listen, reflect and adjust as we evolve and mature. I’m not claiming it’s all perfect, but I do think this way of working is best for digital, data and technology professions. We have happy teams (according to the surveys). Areas of challenge we continue to work on are:"
        },
        {
            "text": "Meanwhile we successfully work collaboratively across disciplines to deliver a vast array of outcomes for our colleagues whilst continually learning and improving what we do."
        },
        {
            "heading": 2,
            "text": "Ready to join us?"
        },
        {
            "text": "Digital, Data, and Technology are always looking for a wide range of skills. Explore current opportunities and discover how you can make a difference."
        }
    ]
}