{
    "url": "https://naturalengland.blog.gov.uk/2025/08/15/how-to-save-1000-species-from-extinction/",
    "title": "How to save 1000 species from extinction?",
    "authors": [
        "Tim Wilkins"
    ],
    "categories": [
        "Biodiversity",
        "Environmental Improvement Plan",
        "Natural Capital",
        "Natural England",
        "Nature",
        "Nature Recovery",
        "Science and evidence",
        "Species recovery",
        "Wildlife"
    ],
    "pub_date": "2025-08-15T08:53:37+01:00",
    "content": [
        {
            "text": "By Tim Wilkins, Principal Specialist in Species Recovery"
        },
        {
            "text": "When a legally-binding target to reduce species extinction risk in England was set by government in 2023: The Environmental Targets (Biodiversity) (England) Regulations 2023, this question – How to save a 1000 species from extinction? – went from being hypothetical, to haunting me on a daily basis. As the principal specialist in species recovery, how could I not know the answer to this question? Thus began the start of a 2 ½ year rollercoaster-of-a-project, bringing together a dizzying array of knowledge and expertise from across the environmental sector, to produce individual species action plans."
        },
        {
            "text": "The outcome is published this week (13 August 2025): Threatened Species Recovery Actions (TSRA), comprising a spreadsheet and report/user-guide. Although published by Natural England, this is the result of large and diverse partnership of environmental non-governmental organisations, expert societies and government agencies, involving over 80 specialists from across the natural history spectrum. My thanks go to everyone who has contributed, TSRA simply could not have happened without their input."
        },
        {
            "text": "In many ways the project is reminiscent of the UK Biodiversity Action Plan (UKBAP), but marks a shift towards a more prioritised approach, focusing only on species most in need of targeted action in England today, and limiting recovery actions to the top three most important. My hope is that going forward TSRA will influence species conservation priorities nationally and provide an information resource for future project development."
        },
        {
            "text": "A small team at Natural England oversaw the project, first compiling a long list of over 2,000 species of conservation concern, largely drawn from the British Red Lists. Specifically, those species that were classed as Critically Endangered, Endangered, Vulnerable or Near Threatened, and those that had been entirely lost from England, along with the addition of ‘Species of Principal Importance in England’ (Section 41 of the NERC Act 2006). It was important to me that the species list was as diverse as possible, so it was encouraging to find that over 40 taxonomic groups were represented, spanning a wide range of terrestrial, freshwater and marine habitats."
        },
        {
            "text": "Contributors were asked to sift the species list using two criteria, evaluating the status of each species in England today, and assessing whether broader nature recovery measures would be sufficient, or whether something additional and more bespoke was necessary. Actions were only drafted for those species identified as priorities for tailored measures.  As a result over 1,900 species were evaluated and 1,384 species were action planned, generating more than 3,600 actions."
        },
        {
            "text": "Although these numbers sound daunting, this isn’t unworkable complexity. While landscape-scale measures to restore, create and link up habitats are vital for species and nature recovery as a whole, both macro and micro approaches have key roles to play. Increasing our understanding of what wildlife needs species by species, provides an evidence base on which measures at more macro scales can draw, resulting in more integrated and successful outcomes overall. "
        },
        {
            "text": "Datasets like TSRA also have the potential to be transformative, highlighting groups of species with common recovery needs, and providing a smorgasbord of options for innovative project development. All of the above will collectively lead to improved delivery, and ultimately to a reduction in extinction risk levels."
        },
        {
            "text": "With thanks to my team at Natural England who provided the answer to the question in the title:  Tim Baker, Christine Hipperson-Jervis, and Maria Thompson. "
        },
        {
            "text": "This project has been funded by Natural England’s Species Recovery Programme, which has been delivering species recovery projects for over 30 years, through a programme of targeted action for threatened species with bespoke needs. TSRA will be used as an evidence base to underpin the Programme in the future, which will contribute to the restoration and recovery of our most threatened species."
        }
    ]
}