{
    "url": "https://enablingdigitalidentity.blog.gov.uk/2025/08/15/using-government-data-to-verify-your-identity-the-role-of-the-gov-uk-wallet/",
    "title": "Using government data to verify your identity: the role of the GOV.UK Wallet",
    "authors": [
        "Hannah Rutter"
    ],
    "categories": [
        "Digital identity"
    ],
    "pub_date": "2025-08-15T10:55:54+01:00",
    "content": [
        {
            "text": "Every day, people use official government documents like passports or driving licences to prove things about themselves in the economy. However, these physical documents weren’t designed for the digital age.  "
        },
        {
            "text": "This is why, through the Data (Use and Access) Act, we are making it easier for people to digitally share information that the government holds about them to prove who they are, if they wish to. "
        },
        {
            "text": "The ‘information gateway’ powers established by the Data Act set out the conditions under which information sharing can take place. Public authorities will only be able to rely on this power to share information if the individual chooses.  Data must only be shared with registered digital verification services who are following government rules, and only for the purposes of identity or eligibility verification.  "
        },
        {
            "heading": 2,
            "text": "The GOV.UK Wallet will help people manage and share their data "
        },
        {
            "text": "The GOV.UK Wallet will be one of the first ways this information gateway moves from policy to reality, bringing many public authorities together to digitise their credentials and make them available to users. "
        },
        {
            "text": "Using the GOV.UK Wallet, people will be able to instigate the sharing of their data with registered private sector digital verification services to securely prove things about themselves for uses across the economy, like proving their age to buy an age-restricted product. These registered services will be critical intermediaries to ensure information is shared safely from the GOV.UK Wallet. "
        },
        {
            "text": "People can also use the digital versions of their documents in their GOV.UK Wallet as source documents for a whole range of identity and attribute proofing.  "
        },
        {
            "text": "This includes creating ‘derived credentials’ with a registered provider. This is currently done using physical documents. GOV.UK Wallet will make this process much more seamless. These credentials can then be reused across the economy without the user needing to return to the GOV.UK Wallet each time.  "
        },
        {
            "text": "Privacy, control and choice will be integral to this process. No data will be shared without the user instigating the process and giving their permission first.  "
        },
        {
            "text": "You can read more about the critical role for digital verification services in enabling the GOV.UK Wallet over on the GDS blog. "
        }
    ]
}