{
    "url": "https://dvladigital.blog.gov.uk/2021/10/28/an-inside-look-into-dvlas-stem-programme/",
    "title": "An inside look into DVLA’s STEM programme",
    "authors": [
        "Mark Jones"
    ],
    "categories": [
        "DVLA Digital Services"
    ],
    "pub_date": "2021-10-28T10:36:30+01:00",
    "content": [
        {
            "text": "At DVLA, we invest in the digital skills of our community through our science, technology, engineering, and mathematics (STEM) volunteer programme."
        },
        {
            "text": "I started the STEM programme at DVLA in 2014 and now we have more than 40 STEM volunteer ambassadors. We partner with schools and colleges to build interest in STEM subjects among young people across Wales and support DVLA’s Centre of Digital Excellence (CoDE) initiatives."
        },
        {
            "text": "Over the years, we’ve represented DVLA at a variety of events, including Swansea Science Festival and the National Eisteddfod. Since launching the programme, we’ve provided 15 schools in the Swansea region with after school ‘Code Clubs’, as well as running school hosting days to teach the children how to code. We’ve also hosted 3 annual DVLA Code Challenge events, which have reached over 2,000 schools."
        },
        {
            "text": "So, what’s new? Our latest initiatives include the relaunch of our STEM website and the launch of our Digital Inclusion scheme, which I’m excited to share with you!"
        },
        {
            "heading": 2,
            "text": "Redesigning our STEM website"
        },
        {
            "text": "DVLA’s STEM website has relaunched and now includes information on all activities taking place as part of the STEM programme. The website was redesigned by students from Gower College Swansea as part of their work experience. I’d like to say a massive thank you to all those students who worked on the site – well done!"
        },
        {
            "text": "The new website includes archives of DVLA Code Challenges and guidance on how schools and colleges can sign up to this year’s Code Challenge event through our Eventbrite page."
        },
        {
            "text": "Visitors to our website can also find details about our projects, such as our new…"
        },
        {
            "heading": 2,
            "text": "Digital Inclusion scheme"
        },
        {
            "text": "The Digital Inclusion scheme, launched in September 2021, donates IT equipment that DVLA no longer needs to primary and secondary schools across Wales."
        },
        {
            "text": "The aim of the scheme is to improve access to IT for all children. Reusing DVLA's IT equipment offers children in Wales increased opportunity to access the IT equipment they need to develop their digital skills and supports the circular economy in Wales."
        },
        {
            "text": "We are proud to be able to support the community in this way. The launch of the Digital Inclusion scheme also supports our ambition of contributing to a strong digital economy."
        },
        {
            "text": "Equipment will be distributed across Wales in collaboration with Welsh Local Education Authorities. Swansea City Council was the first local council to join, and over the next year we’ll see as many as 1,200 laptops distributed across all local authorities in Wales."
        },
        {
            "text": "It’s been amazing to see how successful the launch of the scheme has been. We’ve had great feedback from Swansea Council Leader Rob Stewart, who said:"
        },
        {
            "heading": 2,
            "text": "Code Challenge December 2021"
        },
        {
            "text": "This brings us onto our 2021 Code Challenge, taking place on Tuesday 7 December 2021."
        },
        {
            "text": "Usually, our Code Challenges give children the opportunity to showcase their STEM skills and win prizes. To date, our annual Code Challenge has donated £125,000 of IT equipment to over 100 schools, with £80,000 raised in sponsorship."
        },
        {
            "text": "This year’s Code Challenge is slightly different due to coronavirus (COVID-19) and will be more of a celebration event. Hosted by BBC’s Sian Lloyd, it will be the first ever virtual DVLA Code Challenge, celebrating the best games and videos from past competitions. But there’s more…"
        },
        {
            "text": "There’ll be £20,000 worth of IT equipment available to win via a prize draw for attendees, and we’ll be revealing the themes for next year’s Code Challenge! We hope schools and colleges will attend what is sure to be a fantastic event. Spaces can be booked now on Eventbrite."
        },
        {
            "heading": 2,
            "text": "What’s next..."
        },
        {
            "text": "We have exciting plans for the future."
        },
        {
            "text": "We’ll be launching our ‘Commerce in Code’ competition on 7 December, which will give students aged between 16 and 18 the opportunity to get involved in our STEM programme. More details will be revealed during the Code Challenge event and on our website, so keep an eye out!"
        },
        {
            "text": "Initiatives like Digital Inclusion and the Code Challenge are all made possible by the many volunteers from across DVLA, who’ve dedicated their time to promoting STEM in our community. A huge thank you goes to our STEM ambassadors for all their hard work, and our partners and sponsors who support the STEM programme."
        },
        {
            "text": "We’re always looking for more volunteers to help grow our community. If you’d like to become a sponsor or STEM ambassador, our new ‘Get Involved’ page has the information you need! You can also visit the ‘What’s On’ page to find information on our community projects."
        }
    ]
}