{
    "url": "https://civilservice.blog.gov.uk/2021/10/28/black-history-month-2021-in-the-civil-service/",
    "title": "Black History Month 2021 in the Civil Service",
    "authors": [
        "Lorraine McBride, Editor of the Civil Service Blog Channel"
    ],
    "categories": [
        "A great place to work",
        "A Modern Civil Service",
        "An Innovative Civil Service"
    ],
    "pub_date": "2021-10-28T13:15:44+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Thirty four years, and still going strong, October has marked Black History Month here in the UK. But what is it, and how does it impact civil servants?"
        },
        {
            "text": "As Black History Month draws to a close, it’s got me thinking about the annual event that raises awareness and celebrates the proud heritage and achievements that trailblazing Black people across all generations have made throughout history - and continue to make. "
        },
        {
            "text": "BHM builds a solid base and narrative to learn about history from a Black perspective. This year’s campaign theme ‘Proud to Be’ invited Black people around the UK to share why they’re Proud to Be for a festival of celebration throughout October. Here in the Civil Service, a series of cross-government internal events took place to celebrate the history and contributions of African and Caribbean men and women in British society. "
        },
        {
            "text": "The Cabinet Office hosted an event on the honours system, celebrating Black civil servants who are deservedly ‘proud to be’ honours recipients, sharing their experiences of what it’s like to be awarded an honour, and why it’s important to recognise those in our workplaces and communities making an exceptional contribution. Inspiring stuff!"
        },
        {
            "heading": 4,
            "text": "Pride"
        },
        {
            "text": "Talking of pride, the UK Civil Service is ‘proud to be’ a rich, diverse organisation - a truly welcoming and inclusive workforce - for people of all generations, colours and creeds, who feel valued and respected for who they are and what they can contribute to improve life for all our citizens. "
        },
        {
            "text": "One senior Black civil servant is Bernadette Thompson OBE, Deputy Director for Inclusion, Wellbeing and Employee Engagement at the Department for Levelling Up, Housing and Communities (DLUHC). "
        },
        {
            "text": "Bernadette joined the Civil Service in 1998 starting with the Legal Aid Board and quickly climbed the ladder, holding a string of key posts across many government departments including the Ministry of Justice, Home Office, HM Treasury and Cabinet Office. "
        },
        {
            "heading": 4,
            "text": "Culture of inclusion"
        },
        {
            "text": "A notable diversity campaigner, Bernadette worked closely with government leaders, forging a culture of inclusion, where she champions representation of BAME staff for senior grades so race can no longer thwart career ambitions. "
        },
        {
            "text": "Bernadette co-chaired the award-winning Race to the Top G6/7 network, helping boost the career prospects for BAME Grade 6/7 employees across government departments and agencies. Away from Whitehall, Bernadette is a school governor and volunteered as an athletics official in both the 2012 Olympics and the 2017 World Athletics Games. Last year, Bernadette was awarded an OBE for services to diversity and inclusion. "
        },
        {
            "text": "As is the norm, there have been a lot of BHM stories in the press this month. They celebrate pride in the past, but also show we can also have confidence in the future. As the Civil Service, we both serve and represent the citizens of the UK so it’s paramount that we’re a good reflection of society and the people who we work for every day. The latest data from Civil Service Statistics (March 2021) shows there are 56,860 civil servants from an ethnic minority background (14.3% of civil servants who declared their ethnicity). "
        },
        {
            "heading": 4,
            "text": "Shining a light"
        },
        {
            "text": "This year’s BHM theme ‘Proud to Be’ is pretty apt when thinking of countless successful Black colleagues successfully shining a light across a variety of areas. "
        },
        {
            "text": "You only have to look at Abigail Agyei [left] from DLUHC (then MHCLG). At the 2021 Civil Service Awards in February, Abigail snapped up the Rising Star Award for her work supporting marginalised and minority communities. Notably, Abigail worked with the Grenfell community as well as with faith and Black, Asian and minority ethnic communities as part of DLUHC’s pandemic response, and was instrumental in leading on race in the Civil Service."
        },
        {
            "heading": 4,
            "text": "No exception"
        },
        {
            "text": "A month later at the Cabinet Office Awards 2021, Shernett Ranson scooped the prestigious Diversity & Inclusion Award for her work as co-chair & wellbeing champion in the Cabinet Office Race Equality Network. But Abigail and Shernett are no exception. Whilst BHM tells the story of contributions made by their forebears to British society, Bernadette, Abigail and Shernett are bringing the story bang up to date."
        },
        {
            "text": "Bernadette, Abigail and Shernett are just three people among many, reinventing proud values within a Civil Service that values all employees regardless of background, where everyone can contribute and feels valued."
        }
    ]
}