{
    "url": "https://food.blog.gov.uk/2021/10/28/celebrating-black-history-month-2021-at-the-food-standards-agency/",
    "title": "Celebrating Black History Month 2021 at the Food Standards Agency",
    "authors": [
        "Freddie Lachhman, Transaction Officer"
    ],
    "categories": [
        "People"
    ],
    "pub_date": "2021-10-28T10:10:16+01:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "As Black History Month (BHM) 2021 draws to a close, Freddie Lachhman, Transaction Officer at the Food Standards Agency and part of the planning team for BHM, reflects on this year’s events. "
        },
        {
            "text": " "
        },
        {
            "text": "This year for Black History Month (BHM), FSA colleagues were invited to come together to celebrate achievements in the areas of science and technology, history and politics, literature, and culture."
        },
        {
            "text": "I was part of the BHM planning team this year. We worked endlessly and long hours, to plan the weekly events; ‘lunch and learns’, quizzes, panel discussions, debates, articles, blogs, guest speaker events and of course ‘The Great BHM2021 Cooking Challenge’."
        },
        {
            "text": "The activities for this year’s celebrations were further broken down into four themes:"
        },
        {
            "heading": 2,
            "text": "Proud to be"
        },
        {
            "text": "Where we celebrated the culture and histories of black communities."
        },
        {
            "heading": 2,
            "text": "Allies"
        },
        {
            "text": "This theme was strongly emphasised during National Inclusion Week, and we wanted to build on this during BHM. Going forward we are looking for race allies to actively promote and aspire to advance the culture of inclusion for BAME staff through intentional, positive, and conscious efforts."
        },
        {
            "heading": 2,
            "text": "Respect"
        },
        {
            "text": "Building on last year’s theme we want to continue to emphasise the point around respect. Receiving respect from others is important because it helps us to feel safe and to express ourselves. It means that you accept somebody for who they are, even when they're different from you or you don't agree with them. Respect in your relationships builds feelings of trust, safety, and wellbeing."
        },
        {
            "heading": 2,
            "text": "Connecting"
        },
        {
            "text": "We wanted to continue to encourage individuals to share stories to celebrate, inspire, educate, and raise awareness of inclusion in the FSA. National Inclusion Week and other such initiatives such as BHM enabled us to connect with one another. Connecting with just one person starts an inclusion chain and conversation that leads to others getting involved."
        },
        {
            "heading": 2,
            "text": "My favourite event this year"
        },
        {
            "text": "Our Chief Executive Emily Miles launched this year’s events and introduced our first guest speaker Joe Griffin, Scottish Government Director-General for Education and Justice. Wow, what a great speaker! Joe spoke about allyship and his black heroes, and colleagues were able to ask questions. I was really impressed with his honesty and knowledge of black history and culture. I learnt a lot from this session especially on the positive benefits of allyship. His musical knowledge is great too! What a cool guy."
        },
        {
            "text": "During History and Politics week, FSA colleagues participated in our Loose Women-themed panel discussion where they explored the topic of ‘Don’t touch my hair’ with guest panellist Dr George Watley from the Department for Education. This event was informative and educational, it was great to see all the ‘throwback’ hairstyles and the references to some of my favourite films like Coming to America and the movie's presentation of the Jheri curl."
        },
        {
            "text": "Other notable events during the month were:"
        },
        {
            "text": "Our closing event this year will be a talk by our guest speaker Bernadette Thompson OBE, Deputy Director at the Department for Levelling Up, Housing and Communities."
        },
        {
            "text": "Thanks from the #BHM2021 #FSABHM21 #OURBHM Team to all those that participated, making the event a very successful one. We will see you next year!"
        },
        {
            "heading": 1,
            "text": "Dathlu Mis Hanes Pobl Dduon 2021 yn yr Asiantaeth Safonau Bwyd."
        },
        {
            "text": "Wrth i Fis Hanes Pobl Dduon 2021 ddirwyn i ben, , yn yr Asiantaeth Safonau Bwyd, yn myfyrio ar ddigwyddiadau eleni. "
        },
        {
            "text": " "
        },
        {
            "text": "Eleni ar gyfer Mis Hanes Pobl Dduon, gwahoddwyd cydweithwyr yn yr Asiantaeth Safonau Bwyd (ASB) i ddod ynghyd i ddathlu cyflawniadau ym meysydd gwyddoniaeth a thechnoleg, hanes a gwleidyddiaeth, llenyddiaeth a diwylliant."
        },
        {
            "text": "Roeddwn i'n rhan o dîm cynllunio Mis Hanes Pobl Dduon eleni. Buom ni’n gweithio’n ddi-baid ac am oriau maith i gynllunio’r digwyddiadau wythnosol: cwisiau ‘sesiwn dysgu dros ginio’, trafodaethau panel, dadleuon, erthyglau, blogiau, digwyddiadau siaradwr gwadd, ac wrth gwrs, ‘Her Goginio Fawr Mis Hanes Pobl Dduon 2021’."
        },
        {
            "text": "Rhannwyd y gweithgareddau ar gyfer dathliadau eleni yn themâu penodol:"
        },
        {
            "heading": 2,
            "text": "Yn falch o fod yr hyn ydym"
        },
        {
            "text": "Lle rydyn ni'n dathlu hanes a diwylliant cymunedau du."
        },
        {
            "heading": 2,
            "text": "Cynghreiriaid"
        },
        {
            "text": "Pwysleisiwyd y thema hon yn gryf yn ystod Wythnos Cynhwysiant Genedlaethol, ac roeddem ni am adeiladu arni yn ystod Mis Hanes Pobl Dduon. Wrth edrych tua’r dyfodol, rydym ni’n chwilio am gynghreiriaid i hyrwyddo diwylliant cynhwysiant ar gyfer staff BAME ac anelu at ei symud yn ei flaen mewn modd gweithredol, trwy ymdrechion bwriadol, cadarnhaol, ac ymwybodol."
        },
        {
            "heading": 2,
            "text": "Parch"
        },
        {
            "text": "Gan adeiladu ar thema'r llynedd, rydym ni am barhau i bwysleisio parch. Mae cael ein parchu gan eraill yn bwysig gan ei fod yn ein helpu i deimlo’n ddiogel ac i fynegi ein hunain. Mae’n golygu eich bod yn parchu rhywun am yr hyn ydyn nhw, hyd yn oed pan fyddant yn wahanol i chi, neu pan na fyddwch chi’n cytuno â nhw. Mae perthnasoedd sydd wedi eu selio ar barch yn adeiladu ymddiriedaeth, diogelwch, a lles."
        },
        {
            "heading": 2,
            "text": "Cysylltu"
        },
        {
            "text": "Roeddem ni am barhau i annog unigolion i rannu straeon er mwyn dathlu, ysbrydoli, addysgu, a chodi ymwybyddiaeth am gynhwysiant yn yr ASB. Mae Wythnos Cynhwysiant Genedlaethol a mentrau eraill o’r fath fel Mis Hanes Pobl Dduon yn ein galluogi i gysylltu â’n gilydd. Mae cysylltu ag un person yn unig yn cychwyn cadwyn gynhwysiant a thrafodaeth sy’n peri bod pobl eraill yn cymryd rhan hefyd."
        },
        {
            "heading": 2,
            "text": "Cafwyd fy hoff ddigwyddiad eleni yn ystod wythnos Hanes a Gwleidyddiaeth"
        },
        {
            "text": "Fe wnaeth ein Prif Weithredwr Gweithredol, Emily Miles, lansio’r digwyddiadau eleni trwy gyflwyno ein siaradwr gwadd cyntaf, Joe Griffin, Cyfarwyddwr Cyffredinol Addysg a Chyfiawnder Llywodraeth yr Alban. Waw, am siaradwr gwych! Siaradodd Joe am gynghreiriad a'i arwyr du, a chafodd cydweithwyr cyfle i ofyn cwestiynau. Fe wnaeth ei onestrwydd a'i wybodaeth am hanes a diwylliant du argraff fawr arnaf. Dysgais lawer gan y sesiwn hon, yn enwedig am fuddion cadarnhaol cynghreiriad. Mae ei wybodaeth am gerddoriaeth yn wych hefyd! Am foi cŵl."
        },
        {
            "text": "Fe wnaeth cydweithwyr yn yr ASB gymryd rhan yn ein trafodaeth banel, ar lun Loose Women, a wnaeth archwilio’r thema ‘Peidiwch â chyffwrdd â fy ngwallt’ gyda’r panelwr gwadd Dr George Watley o’r Adran Addysg. Roedd y digwyddiad hwn yn addysgiadol ac yn llawn gwybodaeth. Gwych oedd gweld yr holl arddulliau gwallt o’r gorffennol a'r cyfeiriadau at rai o fy hoff ffilmiau fel Coming to America, a’r cyfeiriadau at y ‘Jheri curl’."
        },
        {
            "text": "Digwyddiadau nodedig eraill yn ystod y mis:"
        },
        {
            "text": "Ein digwyddiad cloi eleni fydd sgwrs gan ein siaradwr gwadd, Bernadette Thompson OBE, Dirprwy Gyfarwyddwr yn Adran Codi’r Gwastad, Tai a Chymunedau."
        },
        {
            "text": "Diolch gan Dîm #BHM2021 #FSABHM21 #OURBHM i bawb a gymerodd ran, gan wneud y digwyddiad yn un llwyddiannus iawn. Fe welwn ni chi'r flwyddyn nesaf!"
        }
    ]
}