{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2021/10/28/gse-strategy-a-commitment-to-inclusivity/",
    "title": "GSE Strategy: A commitment to inclusivity",
    "authors": [
        "Sir Patrick Vallance"
    ],
    "categories": [
        "Diversity & Inclusion"
    ],
    "pub_date": "2021-10-28T19:32:20+01:00",
    "content": [
        {
            "text": "I am pleased to announce the launch of the Government Science & Engineering (GSE) Profession Diversity and Inclusion (D&I) Strategy."
        },
        {
            "text": "Following the launch of the 2021 GSE Profession Strategy, the Profession committed to providing detailed plans which would outline how the commitments in each strand of the strategy would be achieved. This D&I strategy  details how we will be working hard to ensure that diversity and inclusivity are integral throughout all of our work, embedding science and engineering in government alongside building our diverse people capability."
        },
        {
            "text": " "
        },
        {
            "text": "Recognising the strength in diversity and inclusion is an integral part of the profession, and is incorporated into the GSE mission statement: The Government Science and Engineering Profession values the diversity of science and engineering skills found in government.  It is a profession where everybody’s STEM talent or interest is nurtured and celebrated, delivering world class science and engineering. Our aim is for this to become a familiar mantra. We should not underplay the importance of representing our society."
        },
        {
            "text": " "
        },
        {
            "text": "We have celebrated the richness of diversity that exists within our Profession through a wealth of inclusive events. In October alone members of our community shared their experiences during events such as UK Black History Month, World Menopause Month World, Dyslexia Awareness Week and Intersex Awareness Day."
        },
        {
            "text": " "
        },
        {
            "text": "We have also ensured alignment with the Civil Service Diversity and Inclusion Strategy and Government Reform. Focus is mirrored on making improvements to how we attract an even wider range of talent from diverse backgrounds, to our recruitment processes, investment in our people, tailored learning and development offers, and championing diversity of backgrounds and opinions with the merit principle front and centre."
        },
        {
            "text": "I encourage all our members to read this D&I strategy because it applies to everyone individually; we all have different backgrounds and experiences and it is important that work together and embrace this to affect fairer and more effective outcomes in government science and engineering decision making. The strategy highlights that inclusivity is our collective and corporate responsibility and that by being inclusive, we will help all our members feel like they belong and can work at their best."
        },
        {
            "text": "I want to recognise and thank all our members and stakeholders who have collaborated with us throughout the development of this strategy, and acknowledge the value gained by involving you all in the process of delivering this work to benefit all our members."
        },
        {
            "text": " "
        },
        {
            "text": "Professor Dame Angela McLean , Chief Scientific Adviser at the Ministry of Defence is a advocate for the strategy, and has said:"
        },
        {
            "text": "“Diversity in GSE is essential for innovation and maximising our impact. We thrive and succeed with a mix of skills, experience, thought and approach in our people, and when people from all backgrounds can fully apply and develop their talent. I am committed to equality and diversity in GSE because it is an essential pillar of our society and work – both the right thing to do, and mission critical. In MOD, we are committed to having a diverse workforce. We are stronger through our difference. “"
        },
        {
            "text": " "
        },
        {
            "text": "Read our new diversity and inclusion strategy in full. If you would like to provide feedback, please get in touch with the GSE Profession Team."
        }
    ]
}