{
    "url": "https://socialcareinspection.blog.gov.uk/2021/10/28/planning-for-leaving-care-some-initial-thoughts-from-our-research/",
    "title": "Planning for leaving care: some initial thoughts from our research",
    "authors": [
        "Yvette Stanley"
    ],
    "categories": [
        "care experienced",
        "care leavers",
        "children looked after"
    ],
    "pub_date": "2021-10-28T12:18:39+01:00",
    "content": [
        {
            "text": "During National Care Leavers' Week, Yvette Stanley, our National Lead for Regulation and Social Care, discusses our forthcoming research publication on planning for leaving care."
        },
        {
            "text": "I think all of us can remember what it was like to start living independently, whether it was going to university, getting a job, or moving in with friends or partners. It can be exciting, but it’s also an uncertain time, and feels like a huge step."
        },
        {
            "text": "For most young people, this happens with a great deal of support from family, but this often isn’t the case for young people leaving the care system. While young people who aren’t in care are usually able to stay at home until they’re ready for their next steps, care leavers don’t always have this security. Sadly, too many young people are forced to move on before they would like, and before they are ready."
        },
        {
            "text": "Previous research has often focused on outcomes for care leavers, such as educational attainment, where they are living and the number who have difficult life experiences – such as being homeless or spending time in custody. These are all really important issues. But there’s much less research on the preparation and planning care leavers receive, how ready they feel for independence and what involvement they have in plans for their life after care. We wanted to address this gap with our research."
        },
        {
            "text": "In this post, I’ll talk a bit about how we carried out the research, and what we’ll do based on what we learned."
        },
        {
            "heading": 3,
            "text": "How did we go about it?"
        },
        {
            "text": "In July 2021, we launched a nationwide online survey aimed at children in care (aged 16 and over) and care leavers to ask for their views on preparation and planning for leaving care. Because of the pandemic, face-to-face research was more challenging. So, while a survey has its downsides, it did mean we could reach a larger number and more diverse range of care leavers."
        },
        {
            "text": "To help us design the questions, and to make sure we looked at the things that mattered most to care leavers, we engaged some small groups of care leavers with the help of Catch-22 – a charity working with care leavers – and ran virtual workshops. The care leavers involved told us that they really appreciated ‘being listened to with such care’ and that ‘...it's good to know that things are being looked at to change [them] for the better and that young people are at the heart of… helping make [that] change’."
        },
        {
            "text": "Over 250 care leavers responded to our survey. We received good numbers of responses from children in care and more recent care leavers (especially those aged 18–21). Unfortunately though, we had fewer responses from care leavers who left care a while ago."
        },
        {
            "text": "The perspective of these older care leavers is important. We wanted to know whether preparation for leaving care, or a lack of planning, impacts on the lives of care leavers into adult life. So, to address this gap, we held some follow-up discussions with care leavers aged 26 and over. We asked them about their experiences, and whether they felt that the extent to which they were prepared for leaving care has had an impact on their life up to now."
        },
        {
            "heading": 3,
            "text": "What did we learn?"
        },
        {
            "text": "Working with care leavers to design our survey gave us some helpful insights. For example, when discussing how to word a question about being supported to stay in touch with people important to them, care leavers said that an important emphasis should be on whether they had someone that they could trust and rely on."
        },
        {
            "text": "This was an excellent question for our follow-up discussions, as several interviewees spoke about their vulnerability as a care leaver and the risk of overreliance on people who might exploit their vulnerability. Working with care leavers also helped us to make sure we used the right language and tone."
        },
        {
            "text": "The care leavers we worked with identified topics that they felt we should ask about. This included:"
        },
        {
            "text": "We included these topics in the survey for recent care leavers. They also tended to come up organically in the conversations with care leavers who had left care some time ago."
        },
        {
            "text": "This recurrence might indicate that the experience of leaving care hasn’t changed as much as it could have, especially considering the increased focus in recent years on the rights and benefits for young people who leave care. This includes the Children and Social Work Act 2017, which requires local authorities to set out clearly what young people can expect in the way of help. On this point, only around a third of children still in care, and half of those who had left care, reported that they had been made aware of the support that was available to them in the local offer."
        },
        {
            "text": "Some care leavers were concerned that their voices might not be heard and that we wouldn’t read their responses to our survey. However, they felt their involvement was important if it could help other young people. One young person told us ‘...more needs to be done for the next generation, that’s why I [am] doing this’."
        },
        {
            "text": "I’d like to reassure everyone who took part that we have heard what you said, and we’re incredibly grateful for your time and willingness to share your experiences!"
        },
        {
            "heading": 3,
            "text": "What next?"
        },
        {
            "text": "The insights that care leavers have shared with us strike a powerful chord and are hugely valuable in helping us make sure we focus on the things that matter most to children and young people."
        },
        {
            "text": "We’ll analyse the messages carefully and make sure that they shape the work we do. We’ll also be working with our care leaver co-design groups to think about different ways to share the findings with children in care, care leavers and those who care for them."
        },
        {
            "text": "We’re still working through all the data from our survey and in-depth discussions. We will publish our findings from these in early 2022. We hope they will make a real difference to how care leavers are helped to prepare for leaving care."
        }
    ]
}