{
    "url": "https://ukhsa.blog.gov.uk/2021/10/28/responding-to-the-challenge-of-cold-weather-and-winter/",
    "title": "Responding to the challenge of cold weather and winter",
    "authors": [
        "Agostinho Moreira Sousa"
    ],
    "categories": [
        "Winter"
    ],
    "pub_date": "2021-10-28T09:55:20+01:00",
    "content": [
        {
            "text": "The Cold Weather Plan for England (CWP) outlines actions and advice for reducing preventable cold weather-related deaths and ill-health. This blog explores how the plan meets the challenge posed by cold weather by planning for and responding to cold temperatures."
        },
        {
            "heading": 2,
            "text": "The challenge of cold weather and winter"
        },
        {
            "text": "Every year as temperatures drop over the winter period, cold weather affects health and wellbeing."
        },
        {
            "text": "Physical hazards such as snow and ice increase the likelihood of falls and injuries. Exposure to cold temperatures can increase blood pressure, suppress the immune system and make fighting infection more difficult. These factors add up to cold-related deaths being the most significant weather-related source of mortality in England."
        },
        {
            "text": "The Cold Weather Plan for England seeks to reduce the tens of thousands of excess winter deaths by:"
        },
        {
            "heading": 2,
            "text": "Protecting the most vulnerable"
        },
        {
            "text": "Thousands of people die each year from conditions linked to exposure to cold weather. The Cold Weather Plan aims to prevent the major avoidable effects on health during cold weather periods by raising awareness and sharing guidance to protect the most vulnerable, who include:"
        },
        {
            "text": "Whilst extremely low temperatures can cause significant harm to health, even temperatures that appear to be mild (4°C–8°C) can have negative consequences for health, particularly for the most vulnerable who are unsurprisingly the hardest hit during winter."
        },
        {
            "text": "Paying attention to cold weather is essential. Whilst it is a significant health risk for many people, simple preventative actions often could avoid many deaths, illnesses, and injuries associated with the cold."
        },
        {
            "heading": 2,
            "text": "Keeping well, staying warm "
        },
        {
            "text": "The Cold Weather Plan for England includes advice and guidance on keeping well and staying warm during cold weather, including:"
        },
        {
            "text": "It is also imperative to look out for others, especially the most vulnerable. Everyone likely knows someone in one of these groups, and you can help out by checking in. We also know that cold weather can also mean that some people are isolated, so it may be that a chat and a friendly face is all they need."
        },
        {
            "text": "You can read the full plan here and find additional COVID-19 resources here."
        }
    ]
}