{
    "url": "https://educationhub.blog.gov.uk/2021/10/28/secondary-school-applications-what-parents-and-prospective-pupils-need-to-know-before-secondary-school-deadline-day/",
    "title": "Secondary school applications: What parents and prospective pupils need to know before deadline day",
    "authors": [
        "media officer"
    ],
    "categories": [
        "Admissions",
        "Secondary schools"
    ],
    "pub_date": "2021-10-28T18:01:55+01:00",
    "content": [
        {
            "text": "This Sunday (31 October) is the deadline for prospective pupils to submit their applications for state-funded secondary school places. Secondary school is an important and exciting step in pupils’ education, and many parents and guardians will have already submitted applications for their children. We know that applications can be daunting, but we want to make clear that this is a simple and straightforward process which is built around the needs of parents and pupils."
        },
        {
            "text": "Here is everything you need to know about the process:"
        },
        {
            "heading": 3,
            "text": "How do secondary school applications work?"
        },
        {
            "text": " To secure a place at a state-funded secondary school for your child, you must follow your local council’s application process. Applications to schools are run locally, and you must apply, even if your chosen school is linked to your child’s nursery or primary school."
        },
        {
            "text": "Each council’s process may be a little different, but you will typically be asked to:"
        },
        {
            "text": "Each council opens applications at different times, with the deadline for secondary school applications falling on 31 October, 2021."
        },
        {
            "text": "For more information on the applications process contact your local council."
        },
        {
            "heading": 3,
            "text": "Is the admissions process different for different types of schools?"
        },
        {
            "text": "Many schools will run open days for parents and prospective students to go and experience what their school has to offer. This is a great opportunity for you to find the school that’s right for your child."
        },
        {
            "text": "There are several types of state-funded schools to choose from, including academies,  faith schools and grammar schools,  and some may have a different process for applications with additional tests or entry requirements. Check in with your desired schools to see what their process is, to avoid disappointment."
        },
        {
            "text": "For places at private schools or 6th form college places, please contact the chosen school directly."
        },
        {
            "heading": 3,
            "text": " What happens if I miss the deadline? Can my child still apply?"
        },
        {
            "text": "Yes - although it is strongly encouraged that pupils’ applications are received in time for 31 October to ensure their application is considered alongside all the other applicants, where an application has been submitted after the deadline, the application may still be considered but after those who have applied on time."
        },
        {
            "heading": 3,
            "text": "What happens if I don’t get into my first choice school?"
        },
        {
            "text": "While most pupils will get their first choice, there is a chance that your chosen school is unable to offer your child a place. In this case, do not worry. There are plenty of options available:"
        },
        {
            "text": "Contact your local council to see what other schools are available in your catchment area."
        },
        {
            "text": "Schools are required to keep a waiting list open for at least the first term of each school year. You can still add your child to a waiting list even if they have been offered a place at another school, and if they are offered a place at their desired school they can accept it, even if they have already started elsewhere."
        },
        {
            "text": "If your child is refused a place at their chosen school, you can appeal against the decision through the admissions authority."
        },
        {
            "heading": 3,
            "text": "How does the appeals process work for secondary school applications?"
        },
        {
            "text": "If your child receives a rejection letter from your chosen school, you will have 20 school days to raise an appeal. Your case must then be heard within 40 days of your appeal, and your schools’ admissions authority must give you 10 days notice before the hearing."
        },
        {
            "text": "Your case will be heard by a panel of 3 or more people, where the admissions authority will explain why they turned your child’s application down, and you will be given the chance to make a case for why your child should be admitted."
        },
        {
            "text": "The appeals panel will then assess your case against your chosen school’s admissions criteria, with a decision usually sent to you within 5 days."
        },
        {
            "text": "If the panel decides your reasons for why you think your child should be admitted to the school outweighs the reasons the school put forward to rejecting your child, your appeal will be upheld, and the school must admit your child. More information on the appeals process can be found here."
        }
    ]
}