{
    "url": "https://charitycommission.blog.gov.uk/2021/10/28/what-new-research-tells-us-about-the-impact-of-covid-19-on-charities/",
    "title": "What new research tells us about the impact of COVID-19 on charities",
    "authors": [
        "Amie McWilliam Reynolds"
    ],
    "categories": [
        "Research"
    ],
    "pub_date": "2021-10-28T16:03:18+01:00",
    "content": [
        {
            "heading": 2,
            "text": "Why we need research on COVID-19 impacts"
        },
        {
            "text": "We have long known anecdotally that the COVID-19 pandemic is having a profound impact on many charities. There have been many reports in the media over the last 18 months about charities hit by increased demand, about others struggling to fund their services as restrictions were imposed, and, in a few cases, we’ve heard of charities whose income sky-rocketed thanks to extraordinary fundraising efforts. These anecdotal accounts help us understand what the pandemic ‘felt like’ from the perspective of people involved in, and reliant on, individual charities. But as regulator, we needed more concrete data to help us understand how the pandemic has shaped charities so far, and, crucially, to gain a picture of the risks that may lie ahead. To that end, we undertook a project to assess the impacts of COVID-19. This involved interrogating the data we already hold – including through the annual return, through reports from auditors, whistleblowers and charities themselves, as well as existing research prepared by charity sector bodies. We also worked with our research partner Yonder to commission independent research looking at how charities of different sizes perceive the impact of the pandemic on their finances, governance and operations."
        },
        {
            "text": "Today we are publishing the findings of that research, so that others draw their own insights and conclusions from the data."
        },
        {
            "heading": 2,
            "text": "What the research tells us"
        },
        {
            "text": "They make for a complex picture. The charity sector is immensely diverse – many charities are tiny and are entirely reliant on volunteer trustees, while others run complex national or international operations, employing hundreds of staff. So it is not possible to make a simple summary of what COVID-19 has meant for charities in England and Wales."
        },
        {
            "text": "Nonetheless, the research does allow us to draw a few clear conclusions. Perhaps the most striking finding is that nearly all charities were impacted by the pandemic – over 90% told us that they have experienced some negative impact from Covid-19, whether on their service delivery, finances, staff, or indeed on staff morale, resulting from the months of frustration and uncertainty. The majority (60%) saw a loss of income, and a third (32%) said they experienced a shortage of volunteers. Given these findings, it is perhaps surprising that we haven’t seen a significant number of charities fold since March 2021. Last year, 97 charities reported to us that they were insolvent, as part of their annual return to the Commission. That is up by a third on the previous year, but still a relatively small number when compared to the 170,000 charities on our register.  Overall, the number of charities closing did not vary significantly compared to the previous year."
        },
        {
            "heading": 2,
            "text": "Charities have proven adaptable"
        },
        {
            "text": "This resilience may result from charities’ willingness and ability to take steps to address the immediate challenges facing them. Of the 91%who were affected by the pandemic, nearly half (45%) say they took some action to adapt their services to restrictions caused by the pandemic.  Some changed the way they delivered services, moving them online, refocusing on core projects, taking difficult decisions to cut staffing or spend on things like research.  Around 40% say they dipped into their reserves. Smaller charities were especially likely to have taken drastic measures to remain afloat or simply in response to the restrictions imposed early on in the pandemic. One in four charities with incomes of less than £10k paused their activities completely during the first lockdown. It’s also clear that government support, including the furlough scheme, helped bolster many charities’ resilience. Over half of the largest charities we surveyed (those with incomes of over £500,000), said they made use of furlough, or other emergency funding schemes."
        },
        {
            "text": "So while it’s a mixed picture across the sector, there is no doubt that the past 18 months have had a significant impact on the way charities deliver services to their beneficiaries."
        },
        {
            "heading": 2,
            "text": "What might the future hold?"
        },
        {
            "text": "Looking ahead, the picture is again complicated, with grounds for concern as well as optimism. On the one hand, over half (62%) of those asked anticipate some level of threat to their charity’s financial viability in the next 12 months. But only 1% foresee that threat being critical to the charity’s survival."
        },
        {
            "text": "Financial risks of course don’t tell the full story. Drawing on our own data, as well as the research findings, we consider that there may be more subtle threats on the horizon for charities, relating to their governance and culture. We know from our own case work, for example, that disputes in charities seem to be increasing in volume and, in some cases, in ferocity. It is also our experience that disputes between trustees are often at the heart of governance failures. We fear that will continue, to the detriment of charities’ beneficiaries, and perhaps also to public trust in charities. But even in respect of relationships and governance, the picture is not all gloomy. Nearly half of those asked (49%) say their staff and/ or volunteers have learnt to make better use of digital technology over the past year or so, and a significant minority (18%) say communication between trustees has improved since the beginning of the pandemic. Similarly, some trustees say the events of recent months have prompted better relationships with the local community, statutory authorities or other local charities and businesses."
        },
        {
            "text": "As mentioned, it is dangerous to draw firm, generalised conclusions from this research, precisely because it describes a sector that has been unevenly impacted by the pandemic. But our tentative impression, looking back as well as ahead, is that adaptability and a willingness to embrace change and work with uncertainty will be required of many trustees in the months ahead. As in other parts of society, we may be seeing a slow shift in the skills and attitudes required of those in leadership positions – certainly ‘softer’ skills around communication and co-operation may grow in importance in the months and years ahead. Because this is not the ‘end’. While society has been re-opening over the summer, uncertainty about the course of the pandemic continues, and we are yet to see the impact of the closure of the furlough scheme. Many trustees and senior leaders will face tough decisions about their charity’s long-term future in the months ahead."
        },
        {
            "heading": 2,
            "text": "Key lesson for charity leaders"
        },
        {
            "text": "The resulting message for trustees and senior leaders is not new, but is perhaps even more important in the face of significant external challenge: ensure you are led always by your charity’s purposes, and the best interests of those you exist to serve. Don’t avoid or delay tough decisions, but know that how you make them – how you behave and communicate along the way – can be as important as what action you choose."
        }
    ]
}