{
    "url": "https://competitionandmarkets.blog.gov.uk/2025/06/19/driving-economic-growth-in-uk-markets/",
    "title": "Road work ahead: driving economic growth in UK markets",
    "authors": [
        "Daniel Turnbull"
    ],
    "categories": [
        "Markets"
    ],
    "pub_date": "2025-06-19T12:21:00+01:00",
    "content": [
        {
            "text": "Market studies, investigations and reviews are an important part of how the Competition and Markets Authority (CMA) seeks to make markets work well for people, businesses and the UK economy."
        },
        {
            "text": "Today, we have announced our next piece of work, launching a market study into civil engineering in the road and rail sector. This is the first markets project that we have started since we:"
        },
        {
            "text": "In this post, I set out how both have informed our decisions."
        },
        {
            "text": "The UK government has called on regulators and agencies, including the CMA, to play their part in delivering on its number one priority: economic growth. In particular, the strategic steer asks us to prioritise pro-growth and pro-investment interventions in areas where we have discretion over which cases to open."
        },
        {
            "heading": 2,
            "text": "Applying the strategic steer to our markets work"
        },
        {
            "text": "We have considered growth and investment:"
        },
        {
            "heading": 3,
            "text": "Deciding which markets to focus on"
        },
        {
            "text": "The launch of this study shows that we are focusing some of our work on markets that are important to productivity and growth across the whole UK economy. Not only is civil engineering for road and rail a huge area of economic activity in itself; it’s also very important for the productivity of businesses across the wider economy. This market study has the potential to drive significant gains in productivity and growth in the economy."
        },
        {
            "text": "Alongside this renewed pro-growth focus for our markets work, the CMA will continue to examine markets that are not delivering what consumers need – as in our recent work on road fuel, infant formula and vet services. This will continue to be a crucial strand of our work. Going forward, we also expect to devote more of our resource on areas where improvements would have a big impact on productivity and growth."
        },
        {
            "heading": 3,
            "text": "Deciding how we will carry out our markets work"
        },
        {
            "text": "While our markets work can greatly benefit consumers, firms and the wider economy, we know that businesses also need stability and certainty in how they operate, and that this can support investment decisions. In particular:"
        },
        {
            "text": "Given these trade-offs, we need to make sure that where we carry out markets cases, we work hard to avoid imposing any unnecessary burdens on business – and maximise the net benefit of our work."
        },
        {
            "heading": 2,
            "text": "Taking the 4Ps approach to our new market study"
        },
        {
            "text": "To address these and similar concerns across its wider toolkit, the CMA has announced that it is making improvements to pace, predictability, proportionality and process (the ‘4Ps’) – ‘process’ meaning how we engage with important stakeholders, including businesses and investors. We will shortly be sharing a fuller update on how we are developing a 4Ps framework for our markets work."
        },
        {
            "text": "In the meantime, we have accelerated our thinking in the approach we will take to the civil engineering market study. In particular, we have:"
        },
        {
            "text": "Next month, we will publish an approach document and revised markets guidance setting out clearly the principles that we will hold ourselves to. Given the variation in our markets projects, this will not mean a one-size-fits-all approach, but rather a statement of our core principles and objectives for operating the markets regime. "
        },
        {
            "text": "In the meantime, I hope the way we carry out the civil engineering market study provides a good preview of what this will look like in practice."
        },
        {
            "heading": 2,
            "text": "Share your views on the study's purpose and scope"
        },
        {
            "text": "Send us your views on the purpose and proposed scope of the market study by responding to the questions in the statement of scope. The deadline is 17 July 2025."
        }
    ]
}