{
    "url": "https://mhclgmedia.blog.gov.uk/2025/06/19/greater-access-to-social-housing-for-vulnerable-people/",
    "title": "Greater access to social housing for vulnerable people",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Housing"
    ],
    "pub_date": "2025-06-19T11:12:11+01:00",
    "content": [
        {
            "text": "Today the government has laid regulations to exempt care leavers under 25 and victims of domestic abuse from local connection rules so they can have better access to social housing."
        },
        {
            "text": "Under the new rules these groups will no longer be unfairly penalised for not having a local connection as the government recognises the unique challenges they can face, such as transitioning out of care or fleeing an unsafe home to seek safety."
        },
        {
            "text": "These changes will come into force next month and follows reforms last year to remove barriers for all former UK Armed Forces Veterans, as pledged by the Prime Minister.The Daily Mirror covers today’s announcement reporting that young care leavers and domestic abuse survivors will no longer need to prove a local connection – such as living, working or having family nearby – to access social housing."
        },
        {
            "text": "Deputy Prime Minister and Housing Secretary, Angela Rayner said:   “It breaks my heart to hear countless stories of people leaving the care system or fleeing an abusive relationship and not having a place they can truly call home. We’re rewriting the rules to help get them a roof over their heads and the security they deserve."
        },
        {
            "text": "“Our changes will make sure these vulnerable groups do not face unfair barriers to safe and secure housing. This is backed by our commitment to secure the biggest boost to social and affordable housing in a generation, and through our Plan for Change we are going further and faster to make this a reality.”  "
        }
    ]
}