{
    "url": "https://defrafmp.blog.gov.uk/2025/06/19/help-us-to-build-the-evidence-we-need-for-the-fisheries-we-want/",
    "title": "Help us to build the evidence we need for the fisheries we want",
    "authors": [
        "Katie St John Glew - FMP Evidence Lead, Defra"
    ],
    "categories": [
        "- Defra led FMPs",
        "Evidence"
    ],
    "pub_date": "2025-06-19T12:16:03+01:00",
    "content": [
        {
            "text": "We are pleased to announce that the list of evidence gaps has been updated to include new gaps identified in the Southern North Sea and Channel skates and rays, North Sea and Channel sprat, cockle, queen scallop, and Southern North Sea demersal non-quota species (NQS) fisheries management plans (FMPs) which will be published later this year. "
        },
        {
            "text": "These gaps were identified through preparing the evidence statements for each plan, which included engagement with stakeholders and the consultation process.  "
        },
        {
            "text": "Our post on evidence explains our approach for FMPs - Introduction to the role of evidence in fisheries management plans. "
        },
        {
            "heading": 2,
            "text": "Summary of evidence gaps "
        },
        {
            "text": "Addressing the gaps in evidence is essential to understanding and progressing towards sustainable fisheries management and to support the effective implementation of measures and goals that are set out in the FMPs.  "
        },
        {
            "text": "A broad range of topics are covered such as: "
        },
        {
            "heading": 2,
            "text": "A call for collaboration "
        },
        {
            "text": "We are starting to address some of the highest priority gaps through Defra funded research projects.  "
        },
        {
            "text": "But Defra cannot fill all these gaps alone. We need the expertise, commitment and input from across the FMP community to help us work together to provide the evidence that is required to support FMP implementation.  "
        },
        {
            "text": "We would love to hear if you are working on any projects that contribute towards filling these gaps and are keen to hear ideas on how we can continue to improve transparency and collaboration in our evidence going forwards. Comment below or let us know at FMPs@defra.gov.uk "
        },
        {
            "text": "Let's work together to fill these gaps and deliver the goals of our FMPs!  "
        },
        {
            "heading": 2,
            "text": "Get support for projects addressing FMP gaps "
        },
        {
            "text": "The Fisheries and Seafood Scheme (FaSS) provides financial assistance for projects that support the development of the catching, processing and aquaculture sectors, and for projects that enhance the marine environment.  "
        },
        {
            "text": "FaSS grants can support science and fisheries partnerships in addressing FMP evidence gaps so check the full eligibility criteria and how to apply at Fisheries and Seafood Scheme reopens with around £6 million of investment - GOV.UK  "
        },
        {
            "text": "Do not delay!  FaSS grants are always extremely popular, and we urge potential applicants to move fast to stand the best chance of being successful. "
        },
        {
            "text": "Keep an eye on the blog for future posts with more opportunities and support available. "
        }
    ]
}