{
    "url": "https://mhclgmedia.blog.gov.uk/2025/06/19/landmark-ruling-reinforces-that-those-responsible-must-pay-for-building-defects/",
    "title": "Landmark ruling reinforces that those responsible must pay for building defects ",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Building safety"
    ],
    "pub_date": "2025-06-19T17:01:41+01:00",
    "content": [
        {
            "text": "A landmark ruling from the UK’s highest court has made clear that those responsible for unsafe buildings should be held account. "
        },
        {
            "text": "On 21 May, Supreme Court judges unanimously ruled that the developer BDW could seek to recover the costs of fixing major structural issues from consultants in its supply chain. The ruling gives effect to the government’s unwavering stance: all those who profited from unsafe buildings must take responsibility for putting them right.  "
        },
        {
            "text": "This decision ensures that developers can take proactive steps to remediate their buildings, safe in the knowledge that they are supported by a legal framework that prioritises fairness and accountability – empowering developers to undertake proactive voluntary remediation, without unfairly transferring costs onto leaseholders. "
        },
        {
            "text": "The Deputy Prime Minister, who has been clear that the pace of remediation has been too slow, intervened in this particular case, providing a written submission to assist the court in interpreting the Building Safety Act 2022 and emphasising that those responsible for building safety defects should pay to fix them.  "
        },
        {
            "text": "The court drew heavily on the submissions and highlights the policy justifications for the Building Safety Act in the judgment.  "
        },
        {
            "text": "This ruling reinforces the government’s long-standing position: leaseholders must be protected from the cost of fixing buildings that they did not build and that those responsible must pay to put things right. "
        },
        {
            "text": "Media coverage summary "
        },
        {
            "text": "Coverage in The Times reinforced the implications of the ruling and highlighted the Deputy Prime Minister’s intervention. The piece quoted a department spokesperson who welcomed the decision to hold those responsible to account and made clear that “developers can secure contributions from those in the supply chain who are also at fault for creating unsafe buildings. From designers to contractors and developers, safety must be everyone’s responsibility and priority”. "
        },
        {
            "text": "The judgment has attracted several legal insight pieces which highlight the Government’s intervention. Pinsent Masonsreflected that the outcome appeared to be “heavily policy driven”, whileFenwick ElliottandCrown Office Chambersdescribe the Deputy Prime Minister’s written submissions as a key influence on the outcome of this case. "
        },
        {
            "text": "Housing trade media outlets also covered the ruling, highlighting the clarity it brings. Inside Housing highlights the Court’s strong support for developers taking a proactive approach to fixing safety issues, noting that “remedial costs can now be recovered from those most responsible”. "
        }
    ]
}