{
    "url": "https://marinedevelopments.blog.gov.uk/2025/06/19/protecting-our-marine-environment-mpa-consultation/",
    "title": "Protecting our marine environment - MPA consultation",
    "authors": [
        "Dan Cutler, Communications & Engagement Manager"
    ],
    "categories": [
        "fisheries",
        "marine conservation",
        "Marine Science"
    ],
    "pub_date": "2025-06-19T14:33:28+01:00",
    "content": [
        {
            "text": "On 9 June 2025, we launched our consultation on proposed fisheries management measures for Stage 3 marine protected areas (MPAs)."
        },
        {
            "text": "In England, we're fortunate to have a diverse array of marine habitats in our seas. These habitats serve as refuges and nursery grounds for many commercially valuable fish species. But the way some fishing practices impact the most sensitive habitats in our waters threatens the rich diversity and future productivity of our seas. "
        },
        {
            "text": "To help protect our precious marine environment, we are proposing measures to manage fishing in 42 marine protected areas (Stage 3 MPAs) across England."
        },
        {
            "text": "Each site has been classified as an MPA to protect important habitat features like reefs and sandbanks or key species like pink sea-fan. Conservation objectives have been set for each site based on the current condition of the features within those sites where available, or on a vulnerability assessment of the features. We are required to manage fishing activities so that these conservation objectives can be achieved."
        },
        {
            "text": "How fishing may damage the marine environment "
        },
        {
            "text": "Some fishing gears can alter the structure or function of a designated habitat or remove designated species living in those habitats. For example, abrasion from contact of the gear with the seabed, causes channels in the sediment, uprooting species that live there. During Stage 3 we have looked at the impacts of bottom towed gear, traps and bottom set nets and lines on the features of the sites, as these gears all contact the seabed. MMO is required to prevent fishing activities where evidence shows that the negative impacts risk the achievement of the conservation objectives of a site. Management is commonly introduced in the form of a byelaw that prohibits fishing in specified areas. "
        },
        {
            "text": "Why management is necessary "
        },
        {
            "text": "Allowing the continued damage of designated features reduces the amount of suitable habitats available for species to live in or on, or damage to designated species themselves. These species are often prey for other animals, damage therefore reduces food availability, including for those species that are commercially valuable. Damage to habitats and species also reduces the biodiversity of areas, impacting the overall health of these environments. By removing damaging fishing practices, habitats can recover, become more complex, and associated species can increase in abundance and diversity.  "
        },
        {
            "text": "MPA recovery success in Lyme Bay "
        },
        {
            "text": "Lyme Bay in the southwest UK is a great example of where fishing management, through a ban on bottom towed gear has allowed the marine habitat to recover, providing both environmental and socio-economic benefits: "
        },
        {
            "text": "As we’ve seen in Lyme Bay, restricting fishing activities within an MPA allows key habitats to recover and flourish, increasing the abundance of many different species. The subsequent increases in fish populations spillover into the surrounding areas, where fishing is still allowed, and supports a more sustainable fishing industry. "
        },
        {
            "text": "Future MPA management proposals"
        },
        {
            "text": "As part of Stage 3 we're now asking for views that will help shape our draft management measures. Marine stakeholders are invited to complete an online survey and have their say before 1  September 2025."
        },
        {
            "text": "Learn more about, have your say and take part in our Stage 3 MPA consultation. "
        },
        {
            "text": "Find out more about MPAs."
        }
    ]
}