{
    "url": "https://environmentagency.blog.gov.uk/2025/06/19/regulating-the-water-industry-legal-powers-and-duties/",
    "title": "Regulating the water industry: legal powers and duties ",
    "authors": [
        "defrablogs"
    ],
    "categories": [
        "Regulated industry",
        "Water"
    ],
    "pub_date": "2025-06-19T15:18:44+00:00",
    "content": [
        {
            "text": "The water industry is fundamental to the health of our country - supporting people, wildlife, economic growth and the environment. That’s why it’s critical that water companies deliver on their environmental commitments, that they are fully funded to comply with, and it’s our role to ensure they do.  "
        },
        {
            "text": "As the environmental regulator, our job is to ensure water companies meet their statutory obligations and that their activities comply with environmental standards while minimising harm to the environment. We want a sector that meets its basic legal responsibilities without relying on lengthy, costly enforcement action and prosecutions.  "
        },
        {
            "text": "The role of the regulator "
        },
        {
            "text": "For wastewater, the Environment Agency regulates the water industry under the Environmental Permitting Regulations 2016 and other legislation. The legislation empowers the Environment Agency to set permissions to discharge through permits, monitor, inspect, investigate, and take enforcement action where water companies fail to comply with their environmental obligations. "
        },
        {
            "text": "This regulatory framework gives the Environment Agency both authority and responsibility: authority to act when there is harm or risk to the environment, and a responsibility to do so fairly, proportionately, and transparently. "
        },
        {
            "text": "How regulation happens in practice "
        },
        {
            "text": "Water companies must comply with environmental permits when releasing wastewater into rivers and streams, lakes, or the sea. These permits, issued by the Environment Agency, set clear conditions that the wastewater must meet before it can be safely released. These conditions are derived from standards set in environmental legislation such as the Water Framework Regulations and Habitats Regulation. To achieve these standards may require the water company to upgrade or build new infrastructure as well as a consideration of how they manage and operate that infrastructure. It is for the water company to ensure this work is delivered to meet and maintain compliance with their permit requirements.  "
        },
        {
            "text": "Having specified the legal requirements in permits as permit conditions our job is to also check compliance with and where appropriate enforce against those permits — through inspections, audits, data analysis, incident response and investigations. When companies fall short, we use a range of enforcement tools: from advice and guidance, warning letters, civil sanctions to criminal prosecutions. The decision on what enforcement action is taken is guided by the Environment Agency’s Enforcement and Sanctions Policy, which sets out our approach to holding polluters to account. It is vital that we always act within our legal boundaries following due process and applying standards consistently across the water industry. Our decisions must stand up to legal scrutiny, whether challenged in court or assessed through public inquiry. "
        },
        {
            "text": "The Environment Agency has been clear that water companies are not doing enough, and their performance in recent years has seen trust in the water industry deteriorate. The Environment Agency has taken tough action against those companies which are breaking the rules. Since 2015, we have concluded 67 prosecutions against water and sewerage companies securing fines of over £152 million.  "
        },
        {
            "text": "In recent years, water company inspections have increased significantly to uncover the true scale of non-compliance and provide intelligence on the root causes of problems. What is found during inspections can lead to proportionate enforcement action.  "
        },
        {
            "text": "Of the 4,626 inspections carried out in 2024/25, we found that 25% of sites had breaches, with 100 classified as significant non-compliance.  The serious ones are being considered for enforcement, and most of the minor breaches will be rectified through local operational action. "
        },
        {
            "text": "Key to driving better performance is to not only focus on the symptoms, but also to provide intelligence on root causes so water companies can find solutions and prevent problems before they happen. Ensuring a fully compliant wastewater system today and into the future. "
        },
        {
            "text": "The future: faster, firmer regulation "
        },
        {
            "text": "As we look to the future, we will strengthen our legal powers through the Water Special Measures Act. The Act will bring significant changes in how we will regulate the water industry. It will help us take faster, firmer action against poor performance. "
        },
        {
            "text": "The Act will allow us to speed up civil penalties for less serious offences, helping to close the justice gap, while focusing prosecutions on the most serious offending and enabling us to recover enforcement costs. The Act also strengthens penalties for obstructing investigations, including the sanction of imprisonment of water company executives and directors, and increases transparency through faster monitoring rollouts and real-time Emergency Overflow data. Water companies will also be required to publish annual Pollution Incident Reduction Plans. Ofwat is empowered to ban bonuses for company leaders where performance has fallen short.  "
        },
        {
            "text": "With stronger legal powers coming, a robust enforcement and sanctions policy, and more water quality data and resources than ever before we will continue to regulate the water industry fairly, firmly and transparently - ensuring the law is enforced to protect the environment and hold water companies to account.  "
        }
    ]
}