{
    "url": "https://gdsgeospatial.blog.gov.uk/2025/06/19/what-royal-assent-means-for-the-national-underground-asset-register/",
    "title": "What Royal Assent Means for the National Underground Asset Register ",
    "authors": [
        "David Hodkin, NUAR policy lead"
    ],
    "categories": [
        "Data",
        "Technology"
    ],
    "pub_date": "2025-06-19T17:09:33+01:00",
    "content": [
        {
            "text": "We are thrilled to announce that the Data (Use and Access) Bill (“the Act”) has received Royal Assent, marking a significant milestone for the National Underground Asset Register (NUAR). This legislation is a testament to the importance of NUAR in transforming the way we manage and interact with underground apparatus. "
        },
        {
            "heading": 2,
            "text": "What’s next for NUAR "
        },
        {
            "text": "Although the Bill is now an Act of Parliament, there remains further work before its measures can take effect. The framework set out in the Act will be implemented through secondary legislation (for more information about the legislative process please see our previous blog). We look forward to working with stakeholders during the next phase of NUAR’s implementation through secondary legislation. "
        },
        {
            "text": "The secondary legislation will allow NUAR to operate as a statutory register and deliver a more streamlined, efficient, and safer approach to managing information about the UK's vast network of buried pipes and cables. "
        },
        {
            "heading": 2,
            "text": "Key Benefits of the Legislation "
        },
        {
            "heading": 2,
            "text": "Looking Ahead "
        },
        {
            "text": "NUAR’s progress, from the initial pilots in 2019-20, to the launch of the minimum viable product in 2023 and going live in Northern Ireland in 2024, has reached a new major milestone with the passing of the Act. We are now poised to deliver NUAR as a statutory register while continuing to enhance NUAR further. Our next steps include: "
        },
        {
            "heading": 2,
            "text": "Conclusion"
        },
        {
            "text": "The Royal Assent of the Data (Use and Access) Bill, now the Data (Use and Access) Act 2025, is a landmark for NUAR and for the UK's approach to managing underground apparatus. We are excited about the opportunities this new statutory footing brings and are committed to delivering a safer, more efficient, and innovative service for all its users. "
        },
        {
            "text": "Thank you for your continued support and collaboration as we embark on this next chapter for NUAR. "
        },
        {
            "text": "You can sign up to get an email notification every time we publish a new blog post. For more information on our work see our  website, or follow us on  LinkedIn "
        }
    ]
}