{
    "url": "https://ukhsa.blog.gov.uk/2025/06/19/what-the-evidence-says-about-interventions-to-reduce-pollution-and-improve-lives/",
    "title": "What the evidence says about interventions to reduce pollution and improve lives",
    "authors": [
        "Karen Exley"
    ],
    "categories": [
        "Protecting the country's health",
        "UKHSA science"
    ],
    "pub_date": "2025-06-19T10:08:10+01:00",
    "content": [
        {
            "text": "Breathing in polluted air affects our health, reduces our life expectancy, and costs our society billions of pounds each year. It is estimated that 2 million healthy life years are lost in Europe due to the impacts of poor air quality, making the need to improve air we breathe in and reduce the pollution we produce a clear priority."
        },
        {
            "text": "Despite improvements in air quality over previous decades, air pollution remains a significant environmental risk factor, which is why the UK Health Security Agency (UKHSA) recognises the need for action in order to reduce people’s exposure, therefore tackling existing health inequalities, and improving outcomes for all."
        },
        {
            "heading": 2,
            "text": "Increasing the evidence base"
        },
        {
            "text": "Increasing the evidence base is key to tackling air pollution, and UKHSA does this by publishing journals, reports and policy briefs on a range of topics, while reviewing the effectiveness of interventions. Health Protection Research Units (HPRUs) are central to the research we carry out. These are existing partnerships between academia and UKHSA, funded by the National Institute of Health Research (NIHR)."
        },
        {
            "text": "To mark Clean Air Day, a review of recent evidence on the health impacts and benefits of transport interventions around schools has been published by the agency today. This work has been conducted within the frame of the NIHR and HPRU in Environmental Change and Health to deliver on air quality improvements and benefits of climate change."
        },
        {
            "text": "The review focused on studies carried out both in the UK and internationally and categorised the transport interventions in those related to vehicle technology and driving behaviour; traffic management; active travel and behavioural change, and urban planning and school location. It found that actions related to closing streets around schools temporarily (traffic management) can lead to reductions in traffic-pollutant concentrations during certain hours of the day, such as the school drop-off times when children are likely to be exposed to traffic pollution.  "
        },
        {
            "text": "While these actions only offer low-to-medium air quality improvements in the wider area, the review identified co-benefits related to the increased use of active travel modes and physical exercise (active travel and behavioural change), improved road safety and sustainable travel, enhanced socialising and reduced traffic congestion."
        },
        {
            "text": "Previously, Public Health England published an evidence review of interventions that aim to improve outdoor air quality and public health and made recommendations by introducing the hierarchy of interventions model."
        },
        {
            "text": "This model prioritises prevention of emissions as the most effective type of intervention, followed by mitigation of pollution concentrations, with both of these being preferable to requiring individuals to avoid exposure by adapting their behaviour."
        },
        {
            "text": "UKHSA is proposing the continuation of interventions that can have an impact on climate, air quality and children’s health following this hierarchy model."
        },
        {
            "heading": 2,
            "text": "Collaborating with partners and stakeholders"
        },
        {
            "text": "Today also marks the publication of a new report titled ‘A breath of fresh air: responding to the health challenges of modern air pollution’ from the Royal College of Physicians (RCP). This report is an update to their 2016 report ‘Every breath we take’, which played a significant role in shaping conversation around the harms of air pollution and the actions that need to be taken. The report focuses on the new evidence of the health harms of air pollution that occur even at low air pollution concentrations, linking exposure to air pollution in earlier stages of life to poorer health throughout life."
        },
        {
            "text": "I have contributed to this RCP report, detailing advances in air pollution epidemiology in recent years. These improvements have advanced our understanding of  the concentrations at which effects occur and the latency periods between exposure and health effects."
        },
        {
            "text": "Since RCP’s last report in 2016, studies have been published that show how exposure from decades ago influence morbidity and mortality throughout life. We also know that short-term elevations in air pollution, known as episodes, can also increase morbidity, particularly from respiratory and cardiovascular effects, increasing hospital admissions and mortality within hours or days of the exposures."
        },
        {
            "text": "Research from The Committee on the Medical Effects of Air Pollutants (COMEAP), which provides independent advice to government departments and agencies on how air pollution impacts on health, has found evidence that symptoms and adverse health effects including respiratory and cardiovascular effects can occur several days after short-term exposure to air pollutants."
        },
        {
            "text": "UKHSA’s Air Quality representatives work with partners to improve our understanding of the issue of air pollution, and in 2022 The London Air Quality and Health Programme Office (AQHPO), - a collaboration with the Office for Health Improvements and Disparities (OHID), the Greater London Authority (GLA) and NHS England - was established."
        },
        {
            "text": "In February 2024, the London AQHPO launched the UK's first air quality alerts for healthcare professionals, aimed at General Practices and Emergency Departments across the city. It provides messages on the importance of good baseline management of any long-term conditions, and also gives advice on physical activity, modes of transport and suitable routes that help avoid exposure. "
        },
        {
            "text": "The team is now mapping and curating education and training resources for health and care professionals on air quality and health."
        },
        {
            "heading": 2,
            "text": "Improving awareness and understanding"
        },
        {
            "text": "Earlier this year, we supported the Department for Environment Food and Rural Affairs (Defra) in the publication of the Air Quality Information System (AQIS) review final report and recommendations. This report, led by an external multi-disciplinary steering group, was commissioned in 2021 as part of the government’s commitment to improve the provision of air quality information to the public following the inquest into the death of Ella Adoo-Kissi-Debrah."
        },
        {
            "text": "The report detailed that the UK has significant technical capabilities for providing air quality information to the public, but these capabilities are not always being utilised to their fullest potential. Building on existing systems will improve public awareness of the major sources of air pollution and their harmful effects, helping to inform actions to reduce personal contribution and exposure. The UKHSA is committed to continuing to work with partners such as Defra and other stakeholders to act on the recommendations set out in this report, ensuring a healthier future for all."
        }
    ]
}