{
    "url": "https://nda.blog.gov.uk/decommissioning-the-pile-fuel-cladding-silo-progress-so-far/",
    "title": "Decommissioning the Pile Fuel Cladding Silo – progress so far",
    "authors": [
        "Emma Law - Head of Corporate Communications at Sellafield Ltd"
    ],
    "categories": [
        "Mission delivery"
    ],
    "pub_date": "2025-04-28T12:58:00+01:00",
    "content": [
        {
            "text": "The Pile Fuel Cladding Silo at Sellafield, one of the oldest and most hazardous waste stores on the site, has been a focal point for decommissioning efforts. Built in the 1950s to store cladding from nuclear fuel used by the Windscale Piles, the silo has long posed significant challenges due to its design and the hazardous materials it contains."
        },
        {
            "heading": 2,
            "text": "Why was the Pile Fuel Cladding Silo built?"
        },
        {
            "text": "The Pile Fuel Cladding Silo was built in the early 1950s to store cladding from nuclear fuel that had been used in the Windscale Piles, the first reactors at Sellafield."
        },
        {
            "text": "Commissioned in 1952, the silo was designed to safely contain radioactive cladding, which is the outer casing of nuclear fuel rods, ensuring it was safely contained and shielded from the environment."
        },
        {
            "heading": 2,
            "text": "Why is the Pile Fuel Cladding Silo so challenging to decommission?"
        },
        {
            "text": "The Pile Fuel Cladding Silo was constructed without any means of retrieving the waste inside, effectively making it a 'locked vault' that has stored over 3,200 cubic meters of intermediate-level waste (ILW) for more than 70 years."
        },
        {
            "heading": 2,
            "text": "Progress so far"
        },
        {
            "text": "In 2023, we successfully retrieved the first batch of waste from the silo. It was a significant step forward in the decommissioning process. In 2024/25, we met our target of filling 18 boxes of waste retrieved from the silo."
        },
        {
            "text": "Although it may sound simple the scale of the challenge was immense and followed decades of planning and preparation, including:"
        },
        {
            "heading": 3,
            "text": "Retrievals building"
        },
        {
            "text": "We built a superstructure opposite the silo that would ultimately be home to the equipment needed to retrieve waste from the legacy store."
        },
        {
            "heading": 3,
            "text": "Gaining access"
        },
        {
            "text": "Large shield doors were attached to the side of the silo, and holes were cut in the top of each compartment to allow access to the waste."
        },
        {
            "heading": 3,
            "text": "Waste-grabbing crane"
        },
        {
            "text": "We installed an industrial crane inside a sealed unit on the retrievals building so it could extend into the silo, lower its grab and pick up the waste. The crane would take the waste and load it into specially designed stainless-steel boxes."
        },
        {
            "heading": 3,
            "text": "Robots"
        },
        {
            "text": "Two industrial robotic arms were adapted to ensure they could operate safely and efficiently within a complex radioactive environment. Once installed within the retrievals superstructure, one of manipulator arms would be used in the main containment unit to do jobs such as levelling the waste within the box, vacuuming radioactive dust from the box lid, wiping swabs around the lid to keep it clean. The other would be used to remove and replace the lids of the stainless-steel waste storage boxes before being sent to a safe and secure storage."
        },
        {
            "heading": 3,
            "text": "Practicing"
        },
        {
            "text": "We built a replica of the retrievals equipment off the Sellafield site, at Rosyth, so that the silo teams could practice using the equipment and design the processes that would be used on the silo itself."
        },
        {
            "heading": 3,
            "text": "Box manufacturing"
        },
        {
            "text": "A new stainless-steel storage box had to be designed and manufactured on a huge scale, providing us with a means to keep the waste retrieved from the silo safe and secure."
        },
        {
            "heading": 3,
            "text": "Modern storage "
        },
        {
            "text": "New stores have been built on the Sellafield site so that we can keep the retrieved waste safe and secure until the can be disposed of in a Geological Disposal Facility."
        },
        {
            "heading": 3,
            "text": "First retrievals"
        },
        {
            "text": "In August 2023, we made the first retrieval from the Pile Fuel Cladding Silo."
        },
        {
            "heading": 3,
            "text": "Routinely retrieving waste"
        },
        {
            "text": "We started to routinely retrieve waste from the silo in 2024/25. We met our retrievals target for 2024/25 by retrieving enough waste to fill 18 3m3 storage boxes. "
        },
        {
            "heading": 2,
            "text": "What next?"
        },
        {
            "text": "Now that we’ve retrieved  the first 18 boxes worth of waste from PFCS, our focus now is to safely accelerate the pace of retrievals, with the end goal of emptying the facility."
        },
        {
            "text": "We’ll face many challenges along the way. Our teams are up for the challenge and will continue to find innovative solutions to ensure we achieve our mission of high hazard risk reduction on the Sellafield site."
        }
    ]
}