{
    "url": "https://aphascience.blog.gov.uk/2025/04/28/how-can-microscopy-enhance-understanding-of-vector-borne-diseases/",
    "title": "How can microscopy enhance understanding of vector borne diseases?",
    "authors": [
        "Luis Hernandez-Triana"
    ],
    "categories": [
        "Viral diseases"
    ],
    "pub_date": "2025-04-28T10:24:59+01:00",
    "content": [
        {
            "text": "Dr. Luis M. Hernández-Triana, Biodiversity Research Team Lead and APHA Vector-Borne Diseases Discipline Lead, tells us more about APHA’s growing work in vector borne diseases (VBDs)."
        },
        {
            "text": "Research within APHA can play a key role in documenting vector’s biodiversity in the United Kingdom (UK). APHA is working in collaboration with other institutions on VBDs, which are providing an insight regarding vector populations of selected species, mainly from mosquitoes and ticks."
        },
        {
            "heading": 2,
            "text": "Understanding vector-borne diseases"
        },
        {
            "text": "A vector-borne disease results from an infection transmitted to humans and other animals by blood-feeding arthropods animals by blood-feeding arthropods (known as ‘vectors’), including mosquitoes, ticks and fleas, amongst others. Some examples include West Nile fever, Tick-Borne Encephalitis fever and Rift Valley fever."
        },
        {
            "text": "To better understand the transmission and control of vector borne diseases, it is important that we are able to correctly identify the vector species (known as taxonomy) and draw on sound ecological knowledge. Understanding the species that is critical for pathogen transmission can help us better understand the distribution of disease and apply the appropriate control methods against the target vector species."
        },
        {
            "text": "However, one in five insect species are species complexes. These species are difficult to identify using the arthropod structure alone. We therefore rely on the use of genetic methods of identification. Integrating these methods has been a key task for the Biodiversity Research Team, led by Dr Hernández-Triana within the Vector-Borne Diseases Research Group at APHA."
        },
        {
            "text": "The use of microscopes to observe morphological characters for species identification is paramount in day-to-day activities of a researcher. Therefore, a microscopy suite has recently been established within the Virology Department at APHA’s headquarters near Weybridge, with funding from the APHA’s capital equipment budget, and the UK International Biosecurity Programme-Vector Borne Diseases."
        },
        {
            "text": "The new facility houses three digital stereo microscopes and two laptops, together with a compound microscope, all with the ability to capture high-resolution digital images of specimens and the key morphological traits required for species identification. We have used the equipment so far for the identification of tsetse flies and ticks from West Africa (Ghana) and ticks and mosquitoes from the UK."
        },
        {
            "text": "With the aid of the microscopes and morphological keys, combined with DNA sequences, we have been able to distinguish three species of tsetse flies present in Ghana (Glossina palpalis, G. tachinoides and G. morsitans). In addition, this approach has been applied to separate tick species (for example Ixodes canisuga, Ix. hexagonus and Ix. ricinu) found from a range of hosts such as foxes and birds."
        },
        {
            "text": "The addition of this facility benefits APHA through:"
        },
        {
            "heading": 2,
            "text": "Find out more"
        },
        {
            "text": "You may be interested in reading some of our other related blogs and research papers:"
        }
    ]
}