{
    "url": "https://competitionandmarkets.blog.gov.uk/2022/02/24/cma-secures-final-privacy-sandbox-commitments-from-google/",
    "title": "CMA secures final Privacy Sandbox commitments from Google",
    "authors": [
        "Will Hayter"
    ],
    "categories": [
        "Competition law compliance",
        "Consumer protection"
    ],
    "pub_date": "2022-02-24T11:00:13+00:00",
    "content": [
        {
            "text": "We recently published our final decision to accept Google’s commitments on its proposals to:"
        },
        {
            "text": "The commitments mean that we now have the important job of overseeing Google’s design, development and ultimate implementation of its Privacy Sandbox proposals. In future, such work could fall under the remit of the Digital Markets Unit (DMU)."
        },
        {
            "text": "Additionally, on 16 February 2022, Google announced its intention to roll out a similar set of privacy-related changes in relation to app advertising within the Android ecosystem, which it is referring to collectively as its Android Privacy Sandbox. Google informed us of its intentions in this area ahead of its announcement. Google has indicated that it intends to apply – on a voluntary basis – the principles of the commitments mentioned above to its proposed Android Privacy Sandbox.  As we have previously said we will monitor this closely and continue to engage with Google and other market participants on the nature and detail of the proposals."
        },
        {
            "text": "Our involvement in supervising the development and implementation of Google’s Privacy Sandbox and other concurrent developments is an ideal opportunity to test the way that we want the DMU to run. We are keen to adopt a collaborative and inclusive approach, engaging with tech firms as well as consumers on an ongoing basis. Below we set out some concrete ways that we are proposing to do this."
        },
        {
            "heading": 2,
            "text": "Engagement with Google "
        },
        {
            "text": "Google has established a public stakeholder engagement process to make it easier for you to influence the design, development and implementation of the Privacy Sandbox proposals."
        },
        {
            "text": "This is an opportunity for advertisers, publishers, ad tech providers and consumer groups to engage in this development and implementation process."
        },
        {
            "heading": 2,
            "text": "We want to hear from you"
        },
        {
            "text": "We see engagement with, and input from, other market players as an important part of informing our approach to:"
        },
        {
            "text": "Are there specific parts of the Privacy Sandbox proposals that you think you will be affected by, or that you have identified concerns about? If so, we’d also like to hear your thoughts."
        },
        {
            "text": "Please get in touch at privacysandbox@cma.gov.uk about Google’s Chrome or Android Privacy Sandbox."
        },
        {
            "text": "You can also keep up to date on our Google’s ‘Privacy Sandbox’ browser case page."
        }
    ]
}