{
    "url": "https://ukhsa.blog.gov.uk/2022/02/24/covid-19-simple-and-effective-ways-to-protect-yourself-and-others/",
    "title": "COVID-19: Simple and effective ways to protect yourself and others",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Coronavirus (COVID-19)"
    ],
    "pub_date": "2022-02-24T11:00:25+01:00",
    "content": [
        {
            "heading": 5,
            "text": "This blog was updated on 4 April 2022"
        },
        {
            "text": "In line with the Government’s Living with COVID-19 plan, changes to testing from 1st April mean that free testing will now be focused on certain groups including those at high risk of serious outcomes from COVID-19."
        },
        {
            "text": "We have reached this stage because of the success of the COVID-19 vaccination and booster rollout as well as the development of effective treatments which has reduced the impact of COVID and the risk of severe illness or hospitalisation."
        },
        {
            "text": "But we know the pandemic is not over, and with high rates of COVID-19 in the community, this is no time for complacency. It’s important we all continue to take simple actions that will protect our families and communities, particularly those at the greatest risk of severe illness."
        },
        {
            "text": "Understanding how COVID-19 spreads can help us assess the risks in our own daily lives."
        },
        {
            "text": "When someone with COVID-19 breathes, speaks, coughs or sneezes, they release small particles (droplets and aerosols) that contain the virus that causes COVID-19."
        },
        {
            "text": "These particles can come into contact with the eyes, nose or mouth or can be breathed in by another person. The particles can also land on surfaces and be passed from person to person via touch."
        },
        {
            "text": "The risk of catching or passing on COVID-19 can be higher in certain places and when doing certain activities such as singing or vigorous exercise. In general, the risk of catching or passing on COVID-19 is highest when you are physically close to someone who is infected."
        },
        {
            "text": "But it is possible to be infected even by someone you do not have close contact with, especially if you are in a crowded, enclosed or poorly ventilated space. This is because the infectious particles can stay suspended in the air for some time."
        },
        {
            "text": "The following five actions will help you protect yourself and others around you:"
        },
        {
            "heading": 2,
            "text": "1 - Get a COVID-19 vaccine"
        },
        {
            "text": "Vaccines are the best defence we have against COVID-19 and provide excellent protection against hospitalisation and death and also reduce the risk of long-term symptoms."
        },
        {
            "text": "If you are eligible and have not yet received 2 doses of a COVID-19 vaccine, you should get vaccinated as soon as possible. Evidence indicates that 2 doses of a COVID-19 vaccine continues to provide protection against severe disease, including against the Omicron variant, but this protection declines slowly over time. Boosters provide a high level of protection against the Omicron variant. You should get a booster vaccine for COVID-19 as soon as you are offered one."
        },
        {
            "text": "The Spring booster programme is now underway, and as recommended by the Joint Committee on Vaccination and Immunisation (JCVI) adults aged 75 years and over, residents in care homes for older adults and individuals aged 12 years and over who are immunosuppressed (as defined in the COVID-19 healthcare guidance Green Book) can now boost their protection."
        },
        {
            "heading": 2,
            "text": "2 - Avoid other people if you have symptoms of respiratory infection including COVID-19 or positive COVID-19 test"
        },
        {
            "text": "The symptoms of COVID-19, flu and common respiratory infections include:"
        },
        {
            "text": "If you have any of these symptoms or a positive COVID-19 test result, you should stay at home and avoid contact with other people. For instance, we advise that you work from home if you can and do not invite visitors to your home."
        },
        {
            "text": "You should particularly avoid meeting people at higher risk of becoming seriously unwell from COVID-19, especially those with a severely weakened immune system."
        },
        {
            "text": "If you have symptoms of a respiratory infection such as COVID-19 or you have tested positive for COVID-19, please read this important new guidance which explains what you need to do, including how long you should stay at home and avoid contact with other people."
        },
        {
            "heading": 2,
            "text": "3 - Let fresh air in"
        },
        {
            "text": "In poorly ventilated areas the amount of virus in the air can build up. This increases the risk of spreading COVID-19, especially if there are lots of infected people present. The virus can remain in the air after an infected person has left the area."
        },
        {
            "text": "Bringing fresh air into a room or space and removing older stale air that contains virus particles reduces the chance of spreading infections like COVID-19. The more fresh air that is brought inside, the quicker any virus will be removed from the room."
        },
        {
            "text": "Don’t forget, if you are meeting others, meeting them outdoors is safer."
        },
        {
            "text": "Find out more in this ventilation guidance."
        },
        {
            "heading": 2,
            "text": "4 - Wear a face covering"
        },
        {
            "text": "When someone with a respiratory infection such as COVID-19 breathes, speaks, coughs or sneezes, they release small particles (droplets and aerosols) that contain the virus.  Wearing a face covering can reduce the spread of virus particles."
        },
        {
            "text": "There is also some evidence that face coverings can protect the person wearing the face covering from becoming infected."
        },
        {
            "text": "While rates of COVID-19 infection are still high, consider wearing a face covering in crowded or enclosed spaces."
        },
        {
            "text": "You may also wish to wear a face covering if you are visiting or caring for someone who is at higher risk from COVID-19. This is even more important if you have any respiratory symptoms."
        },
        {
            "text": "Face coverings should be made with two or more layers of breathable fabric and fit snugly around the mouth and nose."
        },
        {
            "heading": 2,
            "text": "5 -Remember hand washing and the basics of good hygiene"
        },
        {
            "text": "Protect yourself and others by covering your nose and mouth when you cough and sneeze, washing your hands frequently and cleaning surfaces that are touched frequently such as door handles, light switches and TV remote controls."
        },
        {
            "text": "We’re grateful to the millions of people who have followed this advice to keep themselves and others safe during each phase of the pandemic. This advice remains just as crucial in this next phase, for reducing the risks of COVID as well as other common illnesses."
        },
        {
            "text": "For more information on how to protect yourself and your community read the government’s guidance Living safely with respiratory infections, including COVID-19 "
        },
        {
            "heading": 2,
            "text": "6 - Public health principles for the workplace"
        },
        {
            "text": "Whilst there is no longer a requirement for employers to carry out a COVID-19 specific risk assessment, it is important that businesses or employers understand public health principles and the symptoms of COVID-19, flu and common respiratory infections as listed here. Published principles include the importance of supporting and enabling staff to be vaccinated, maintaining a clear workplace and ventilation."
        },
        {
            "text": "There is specific guidance for people whose immune system means that they are at higher risk, because they have a reduced ability to fight infections, such as COVID-19. Employers, in accordance with their existing legal obligations, may wish to  discuss with their employee what arrangements can be made to reduce risk."
        },
        {
            "text": "The Health and Safety Executive has guidance on how to keep people safe and healthy at work."
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}