{
    "url": "https://dragonsden.blog.gov.uk/2022/02/24/dragons-den-episode-8-series-19/",
    "title": "Dragons' Den, Episode 8, Series 19",
    "authors": [
        "Jenny Manders"
    ],
    "categories": [
        "Business",
        "Confidentiality",
        "IP",
        "Patents",
        "Trade marks",
        "Trade secrets"
    ],
    "pub_date": "2022-02-24T21:03:52+00:00",
    "content": [
        {
            "text": "Mason jars - the mention of them on this week’s Dragons’ Den took me right back to childhood games of hide and seek. I recall gazing up at rows of the chunky fruit-filled jars on the shelves of granny’s larder, anticipating the footsteps of the ‘seeker’. "
        },
        {
            "text": "I’ve noticed Mason jars being repurposed as drinking glasses recently, but I’d never seen one with a ready-made drinking spout in its industrial-looking lid.  "
        },
        {
            "text": "Nor had Peter Jones, as he mentioned while admiring the O’Donnell Moonshine liqueur pitched by entrepreneur Max Ruether. "
        },
        {
            "heading": 3,
            "text": "A spirited pitch "
        },
        {
            "text": "Along with his colleagues in the successful German-based branch of the business, Max was asking for £200k for 5% to develop the boozy brand in the UK market. The retro-packaged alcohol is designed to conjure up the ‘spirit’ of American prohibition with a modern twist. They certainly have a cool vibe, as Sara Davies agreed.  "
        },
        {
            "text": "I remembered the cautionary saying, “many’s the slip betwixt cup and lip”, as I wondered if the O’Donnell Moonshine team had put trade secret protection in place around their range.  "
        },
        {
            "text": "The commercial value of a trade secret relating to a recipe, for example, relies on its unique qualities remaining secret. Reasonable steps must have been taken to protect it. A confidentiality agreement signed by staff and suppliers would be one precaution. Read our trade secrets blog about the importance of keeping secrets, secret.  "
        },
        {
            "text": "Back to Max now, whose spirits didn’t seem dampened when he left the Den with his glass empty. The Dragons called time on his bid, fearing lack of control if they invested in the less well-developed arm of this successful Europe-based business.  "
        },
        {
            "heading": 3,
            "text": "And now time for some plant-based products "
        },
        {
            "text": "My retail radar perked up when Laura Way arrived in the Den with a passionate pitch for a stake in her business. Trading as Votch, her innovative vegan watch straps (and bags) are made from pineapple and are 100% ethically sourced. Yes, pineapple!  "
        },
        {
            "text": "The straps spoke of quality to me, with their matt finish and subtle rage of colours. Marketing mogul Steven Bartlett admired their refined look, discussing with Deborah Meaden how a plant-based product didn’t need to mean a plastic appearance. Peter Jones, with impeccable comic timing, declared it one to ‘Votch’. "
        },
        {
            "text": "I would definitely class myself as a potential buyer, and I love the simplicity of the clever brand name. A search on the IPO trade mark search tool revealed that Laura had registered the name Votch as a trade mark in 2017.  "
        },
        {
            "text": "By registering her trade mark, Laura could take legal action against anyone using her brand without her permission, including counterfeiters. She could also add commercial value by selling or licensing her brand. "
        },
        {
            "text": "Laura was looking for £100k for 10% of the business. After reviewing how the business has ticked over in its initial years, the Dragons were encouraging about the brand, but felt there was not enough growth potential to merit their investment.  "
        },
        {
            "heading": 3,
            "text": "Probiotic pitch gets the Den in a sweat "
        },
        {
            "text": "Next came entrepreneurs Eddie Fisher and Matt Kennedy, co-founders of ‘Fussy’, with their sustainable deodorant subscription business.  They certainly know how to make an entrance. The pitch, asking for a £50k investment for a 1.5% stake, saw Matt bursting out of a bin to highlight the horrifying waste we see from throwaway plastic. Every year, 3.2 billion deodorant containers are discarded. "
        },
        {
            "text": "Keen to protect the planet for our descendants, the planet-loving pair has come up with a probiotic deodorant solution that literally eats sweat. The packaging, presented in sleek-looking refillable containers, had what looked like a wonderfully touchy-feely finish. I loved it!"
        },
        {
            "text": "  "
        },
        {
            "text": "I wondered if Fussy’s probiotic solution process was so unique, so novel, that it could be patented.  A patent protects your invention and lets you take legal action against anyone who makes, uses, sells or imports it without your permission. "
        },
        {
            "text": "Queen of Green, Deborah, was immediately wowed by the fact that the packaging material, glue and printing was 100% sustainable. Peter loved it, while Steven thought the concept was “brilliant”. Sara seemed equally impressed but together with Touker and Steven, declared “out”. They expressed concern over the financial path forward for this subscription-based business.  "
        },
        {
            "text": "After a spell of negotiation during which Matt and Eddie ‘talked to the wall’, a visibly excited Peter and Deborah had no sweat in cleaning up. Peter and Deborah felt they could add immeasurable shareholder value for the deodorising duo, agreeing to share 5% between them for a £50k investment.  "
        }
    ]
}