{
    "url": "https://civilservice.blog.gov.uk/2022/02/24/finding-policies-that-work/",
    "title": "Finding policies that work",
    "authors": [
        "Emily Power"
    ],
    "categories": [
        "An Ambitious Civil Service",
        "An Innovative Civil Service",
        "Better policymaking"
    ],
    "pub_date": "2022-02-24T09:10:23+00:00",
    "content": [
        {
            "heading": 3,
            "text": "The Evaluation Task Force has launched a £15 million fund to accelerate evaluation activity across government to improve our understanding of what works and inform better decisions."
        },
        {
            "text": "There is growing enthusiasm for improving evaluation practice across government. In a 2019, a review found that only 8% of £432 billion of Government Major Projects had a plan for robust impact evaluation in place. "
        },
        {
            "heading": 4,
            "text": "Policy barriers"
        },
        {
            "text": "Barriers are wide-ranging and include poor understanding of evaluation within the Civil Service, limited capacity, resource and skills to manage and deliver quality evaluation, and weak accountability structures and transparency around evaluation plans and results."
        },
        {
            "text": "Chancellor of the Exchequer Rishi Sunak announced the £15 million Evaluation Accelerator Fund (EAF) at Budget to help tackle some of these challenges. The fund aims to create actionable evidence, tackle key evidence gaps, and provide robust evidence of financial or efficiency savings. "
        },
        {
            "text": "The fund is a key tool for the Evaluation Task Force (ETF) to help achieve its core mission of ensuring that evidence sits at the heart of spending and operational decisions."
        },
        {
            "text": "The fund will support evaluations that can help meet the government’s key goals; levelling up, net zero, education, jobs and skills, health and crime and justice."
        },
        {
            "heading": 4,
            "text": "Evaluation Projects "
        },
        {
            "text": "What kinds of evaluation projects will be considered? Well, the focus is on boosting the amount of high quality evidence in priority areas, and will prioritise evaluations that use experimental or quasi-experimental (QE) methods which give us the best possible understanding of what works. "
        },
        {
            "text": "Check out the Top Evaluations section on the ETF website for some examples of what’s possible. For instance, the award winning Supporting Families Programme evaluation is a great example of what can be achieved by unlocking government administrative datasets, linking data across departments, and applying robust methods and analyses to understanding the impact of a programme. This work fed into a successful 2020 Spending Review bid, securing programme funding for a further three years to trial variations of the programme and find interventions that produce the best outcomes for families."
        },
        {
            "heading": 4,
            "text": "Ambitious projects"
        },
        {
            "text": "The ETF is keen to encourage ambitious projects that could have a transformative effect on how we understand particular policy areas. "
        },
        {
            "text": "We particularly welcome ideas that: test multiple approaches to tackling the same priority issue and allow comparisons of the impacts and costs to business as usual; test variations of a project or programme, e.g. different types of support or variations in intensity or frequency of support; and measure shared outcomes across multiple government departments."
        },
        {
            "heading": 4,
            "text": "Accelerating evaluation"
        },
        {
            "text": "We’re also keen to encourage smaller bids - particularly in the first year of the fund - which will accelerate or unlock robust evaluations in future years, or which make use of existing data to undertake retrospective quasi-experimental analyses. We are strongly supportive of work that uses data held in the ONS Secure Research Service (SRS)."
        },
        {
            "text": "The fund will support shorter term projects reporting in 2023, and longer, multi-year projects reporting in March 2025."
        },
        {
            "text": "One-year projects could include rapid Randomised Controlled Trials (RCTs); retrospective quasi-experimental analyses of evaluations using pre-existing data; foundational research, analysis or data linkage that will enable delivery of robust evaluations in the future; or pilot or proof of concept work that will enable delivery of robust evaluations in the future."
        },
        {
            "text": "Multi-year projects could include RCTs, QE evaluations, or process evaluations that are part of RCT or QE evaluations."
        },
        {
            "heading": 4,
            "text": "Who can bid?"
        },
        {
            "text": "Bids are open to government departments, non-departmental public bodies, arm’s length bodies, and What Works Centres - independent Centres committed to increasing the supply and demand for evidence across a range of policy areas. What Works Centres will need to demonstrate appropriate support from a relevant government department or HM Treasury."
        },
        {
            "heading": 4,
            "text": "Find out more?"
        },
        {
            "text": "More information including the guidance and bid templates are available on our website."
        },
        {
            "text": "We will be running an information session about the fund on Wednesday 2 March 12-12:45. If you’re interested in applying for funding and you meet the criteria outlined in our guidance, you can also book on to a 1-2-1 surgery session to discuss potential projects on Wednesdays throughout March. You can book onto either of these sessions through this link."
        },
        {
            "text": "Finally, if you’re interested in putting in a bid using linked data and want to find out more, you can book a place at a linked data session through this link."
        },
        {
            "text": "◼︎Completed applications should be sent to eaf@cabinetoffice.gov.uk by 6pm on Friday 1 April."
        }
    ]
}