{
    "url": "https://educationhub.blog.gov.uk/2022/02/get-the-facts-about-student-loan-reform/",
    "title": "Get the facts about student loan reform",
    "authors": [
        "Media Officer"
    ],
    "categories": [
        "Higher Education",
        "Universities"
    ],
    "pub_date": "2022-02-24T16:26:32+00:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "We have announced a radical shake up of the higher education system. Under our proposed new measures, our world-leading higher education sector will aim to deliver the highest quality education for all students while providing even better employment prospects. At the same time, our reforms will lessen the burden of student loans on the taxpayer, and we will reduce interest rates for new students starting from 2023, so that under these terms future graduates do not pay back any more than they originally borrowed in real terms."
        },
        {
            "text": "We are aware of some claims being made in the press that don’t provide a full picture of how our reforms will work. Here we explore some of them."
        },
        {
            "heading": 3,
            "text": "CLAIM: Students will end up paying back far more than they borrowed under our proposals."
        },
        {
            "text": "THE FACTS: We are aware of some figures quoted in national newspapers that suggest students will be paying back more than they borrowed. It is important to be clear that these figures do not take inflation into account. When inflation is taken into account – so in real terms – under these terms no graduate will pay back more than they borrowed. It is also important to be clear that student loans are not like commercial loans – repayments will be paused if you find yourself unemployed or if you salary drops below the threshold."
        },
        {
            "text": "For those starting university in September 2023 and onwards, we will be reducing their student loan interest rates in line with inflation as measured by the retail price index (RPI). What this means in practice is that, under these terms, graduates will not have to repay more than they borrow, adjusted for inflation. In combination with an extended tuition fee freeze to 2025, this will reduce the loan debt for a typical student starting a 3-year degree in September 2023 by up to £6,500 at the point they start repaying. When the total seven-year fee freeze from 2018 is taken into account, this totals up to £11,500 less debt at the same point."
        },
        {
            "text": "In addition to this, the earnings threshold for new borrowers starting courses from September 2023 will be set at £25,000 until 2026-27, and the length of the loan will be increased to 40 years. Graduates will not need to make repayments if they earn below this amount. Under these terms future graduates do not pay back any more than they originally borrowed in real terms."
        },
        {
            "heading": 3,
            "text": "CLAIM: Students will pay back tens of thousands of pounds more under our proposals than they would without our proposed reforms "
        },
        {
            "text": "THE FACTS: New borrowers starting in the 23/24 academic year are expected to borrow an average of £39,300, in 21-22 prices. Under our proposals we forecast that the average borrower will repay £25,300 in 2021-22 prices over the course of their loan. This compares to £19,500 under the current system, without any intervention."
        },
        {
            "heading": 3,
            "text": "CLAIM: These reforms will affect lower earners more than higher earners"
        },
        {
            "text": "THE FACTS: We are still protecting the lowest earners. Anyone earning under £25k won’t repay anything. Higher earners – those on £33,390 or more - will pay back a maximum of £58 per month more per month in the financial year 27/28 than they would have paid under the current system without intervention. Someone earning £26k will only repay £2 per month more in the same year."
        },
        {
            "heading": 3,
            "text": "CLAIM: These reforms mean higher education is not going to be a good investment"
        },
        {
            "text": "THE FACTS: For most going to university is a good investment. In 2020, young graduates typically earned £6,500 more per year than their non-graduate counterparts."
        },
        {
            "text": "But there are still too many graduates who do not see the full benefit of going to university and in many cases this is because their degrees do not necessarily lead to well-paid employment. For example, at 25 universities and other education providers, less than half of students who begin a degree can expect to finish that degree and find professional employment or further study within 15 months of graduation."
        },
        {
            "text": "We are already working with the Office for Students to make sure that courses are of a high quality and to help prospective students understand the prospects courses can offer."
        },
        {
            "text": "In response to the recommendations made by the Augar panel, we are going to be seeking views on exploring the use of targeted student number controls as a possible option to stem the growth of low quality courses."
        },
        {
            "text": "It is also right that we have the conversation about low level minimum eligibility requirements, which could be a return to the old requirement of 2 ‘E’ grades at A Level or equivalent, or a grade 4 requirement at GCSE in English and maths or equivalent, with exemptions of course including for mature students."
        },
        {
            "text": " "
        }
    ]
}