{
    "url": "https://lifeathmrc.blog.gov.uk/2022/02/24/managing-together-discover-what-its-like-to-be-one-of-hmrcs-13000-managers/",
    "title": "Managing Together – discover what it’s like to be one of HMRC’s 13,000+ managers",
    "authors": [
        "Kyle Hopkins"
    ],
    "categories": [
        "General",
        "Management"
    ],
    "pub_date": "2022-02-24T17:01:58+00:00",
    "content": [
        {
            "text": "Within our organisation, people managers have a critical role, from helping to deliver essential services, to enhancing the employee experience of their teams. To support our managers in doing their roles effectively, we have developed the ‘5 Core Functions of a manager’, these are:"
        },
        {
            "text": "Learn more about what this means in our 5-part series, where we’ll focus on each of the Core Functions separately."
        },
        {
            "text": "To kick off the series, meet Kyle Hopkins, a manager in Customer Services and how he ‘own and initiate change’ in his role."
        },
        {
            "text": "How I use Own and Initiate Change in my everyday job"
        },
        {
            "text": "I work in Debt Management and lead a number of teams who are responsible for a range of different tasks relating to enforcement and insolvency. Our enforcement team look to settle tax debts via contact with taxpayers either by direct payments or time to pay arrangements. The team will also process winding up proceedings via our solicitor’s office and the courts where necessary. Our insolvency team deal with a whole range of insolvency practices from administrations to electronic banking."
        },
        {
            "text": "As a team leader, my work involves managing performance, quality outcomes, attendance/resource management and all aspects of personnel management and leadership."
        },
        {
            "text": "It’s important I support my team through numerous times of change and uncertainty. We have recently had some big changes, such as the pay, contract and reform, so there continues to be a lot of detailed information that my team have had to digest. I regularly support the team by embracing the changes in a positive way and listening to any frustrations people may have."
        },
        {
            "text": "Understanding my team’s individual communication style and preference has taken time. I make sure to recognise everyone has their own perspective and the impact of change is different for everyone. While I don’t always agree with an individual’s viewpoint, I continually build trust by having some honest conversations about how change impacts individual team members."
        },
        {
            "text": "Having team meetings that encourage my team to share their diverse opinions, has meant we have a rich conversation with ideas and innovations which can positively impact the areas we need to build on within a dynamic environment. Sharing the little successes and talking about these and how they fit into HMRC’s strategic plan has helped in moving forward with change in the team and beyond. For example, effective communication has recently helped the modernisation of the software we are now using to efficiently do our roles. Direct feedback via forums and test/learn phases has helped shape the development of the software with the end users in mind. It’s encouraging to see how my team can positively influence change."
        }
    ]
}