{
    "url": "https://mhrainspectorate.blog.gov.uk/2022/02/24/mhra-good-practice-symposia-week-7-to-11-march-2022/",
    "title": "MHRA Good Practice Symposia Week (7 to 11 March 2022)",
    "authors": [
        "Rachel Mead",
        "Sophie Radicke",
        "Emma Whale"
    ],
    "categories": [
        "Events and symposia",
        "Good clinical practice"
    ],
    "pub_date": "2022-02-24T17:10:59+00:00",
    "content": [
        {
            "text": "From Monday 7 to Friday 11 March 2022, the MHRA will be hosting a week-long series of events as part of the Good Practice Symposia Week.  The week will include individual events from GCP, GLP and GPvP Inspectorates.  Due to the ongoing worldwide COVID-19 pandemic, the symposium will be delivered as a livestreamed, online-only event.  Content will be made available to all registered delegates as recordings after the symposium, allowing access at the most convenient time for you.  This may be of particular interest where time zones make it difficult to watch the event in real time."
        },
        {
            "text": "Depending on your area of expertise, you can choose to attend the event most relevant for your needs or take advantage of discounted combined tickets.  Find out more about each event below or visit https://mhra-good-practice-symposia.co.uk/home."
        },
        {
            "text": "GCP Symposium (07 to 09 March 2022) "
        },
        {
            "text": "This virtual workshop follows previous joint events between the United Kingdom’s Medicines and Healthcare products Regulatory Agency (MHRA) and the US Food and Drug Administration’s (FDA) Centre for Drug Evaluation and Research (CDER) including Workshops in October 2018: ‘Data Integrity in Global Clinical Trials - Are We There Yet?’ and February 2020: ‘Data Integrity in Global Clinical Trials Tackling Challenging Topics’.  At the March 2022 event, the MHRA and FDA welcome Health Canada (HC) to the collaboration."
        },
        {
            "text": "This event will provide regulatory perspectives on how maximising our understanding and use of risk-based approaches can build resilience into clinical trials, allowing flexibility in protocols and clinical trial conduct, while still ensuring participant safety and reliable results.  We will discuss continuing developments in decentralised trials, use of real-world data and real-world evidence in regulatory decision making and the importance of sponsor oversight."
        },
        {
            "text": "As always, you will have the chance to put your questions directly to a panel of inspectors from all three agencies including the opportunity to submit questions prior to the event."
        },
        {
            "text": "Bioequivalence Symposium (09 March 2022)"
        },
        {
            "text": " "
        },
        {
            "text": "The GCP event, in partnership with the US Food and Drug Administration (FDA) and Health Canada (HC), will also include sessions dedicated to the conduct of bioequivalence (BE) trials.  Regulators will provide their perspectives on common issues and challenges in the conduct of both the clinical and bioanalytical components of BE trials and provide important updates on guidance and inspection activities."
        },
        {
            "text": "GPVP Symposium (10 and 11 March 2022)"
        },
        {
            "text": "The 2022 GPvP Symposium will deliver insightful presentations and discussions on the key topics and compliance trends in pharmacovigilance observed by MHRA GPvP inspectors since the 2020 Symposium."
        },
        {
            "text": "The symposium will take place on two consecutive afternoons during which we will discuss current challenges in pharmacovigilance faced by industry, including lessons learnt following the end of the EU Exit Transition period and adaptations to inspection processes implemented by the MHRA and the FDA in response to the COVID-19 pandemic. We will present the latest MHRA inspection metrics, put the spotlight on specific inspection findings in case studies, and keep you informed of regulatory updates and changes. The programme of presentations will be interspersed with short pop-up sessions covering the latest news and developments in pharmacovigilance at the MHRA."
        },
        {
            "text": "Colleagues from the U.S. FDA will be joining us for a global view on pharmacovigilance and inspections."
        },
        {
            "text": "This two-day event is relevant to anyone working in pharmacovigilance, medical information and regulatory affairs, including UK QPPVs and service providers."
        },
        {
            "text": "Symposium speakers will be responding to submitted delegate questions in the panel sessions on both days."
        }
    ]
}