{
    "url": "https://ruralpayments.blog.gov.uk/2022/02/24/rural-payments-agency-launches-a-new-podcast/",
    "title": "Rural Payments Agency Launches a New Podcast",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Basic Payment Scheme",
        "Countryside Stewardship",
        "Environmental Stewardship",
        "RPA podcast"
    ],
    "pub_date": "2022-02-24T15:20:21+00:00",
    "content": [
        {
            "text": "The Rural Payments Agency has launched its first ever podcast! We will be publishing a series of podcasts throughout 2022 to help farmers, landowners, and rural communities keep up-to-date with the latest news and announcements from RPA."
        },
        {
            "text": "The RPA Podcast will offer guidance to our customers and support with navigating agricultural transition."
        },
        {
            "text": "In our first episode, Customer Director Sandy Kapila reflects on 2021. Sandy discusses the role RPA played in developing and delivering the Government’s objectives that have been set out in the Agricultural Transition Plan and the progress made with the roll out of the environmental land management schemes."
        },
        {
            "text": "Later in the podcast, we look forward to what’s coming up in 2022 with Katie Yon, Senior Stakeholder Manager and Shows and Events Lead here at RPA."
        },
        {
            "text": "Katie discusses some of the updates to RPA schemes that our customers will see throughout the year such as the environmental land management schemes and the Farming Investment Fund."
        },
        {
            "text": "We also have a special feature on wellbeing in rural communities with External Affairs Manager Carrie Smith. Carrie discusses what we are doing to enhance our communication and engagement with our customers."
        },
        {
            "text": "In this section of the podcast, you will hear more about the wellbeing support available to farmers and farming communities from organisations such as The Farming Community Network and The Royal Agricultural Benevolence Institution."
        },
        {
            "text": "The RPA Podcast is an opportunity to engage with our customers in a new way, and we encourage you to reach out to us with suggestions of particular topics that you’d like us to cover with our subject experts. You can e-mail us at External.Affairs@rpa.gov.uk."
        },
        {
            "text": "You can listen to The RPA Podcast on Apple and Spotify or through Buzzsprout."
        },
        {
            "text": "Please follow us on social media to see our updates about new episodes and get the latest information on the following accounts:"
        },
        {
            "text": " "
        },
        {
            "text": "You can read the transcript of the podcast on our blog."
        },
        {
            "text": " "
        }
    ]
}