{
    "url": "https://publicguardian.blog.gov.uk/2022/02/24/tackling-our-terminology/",
    "title": "Tackling our terminology",
    "authors": [
        "Laura Crouch"
    ],
    "categories": [
        "Attorneys",
        "Carers",
        "Deputies",
        "deputy",
        "EPA",
        "FAQs",
        "Future planning",
        "Guidance",
        "lasting power of attorney",
        "LPA",
        "Mental Capacity Act"
    ],
    "pub_date": "2022-02-24T15:08:50+00:00",
    "content": [
        {
            "text": "We know when filling out a document, whether that’s a lasting power of attorney document, or filling forms in as a deputy, there are words, phrases and general terminology we use which can be confusing."
        },
        {
            "text": "We’ve put together a list of the words you might come across and what they mean."
        },
        {
            "heading": 3,
            "text": "1. Lasting power of attorney (LPA)"
        },
        {
            "text": "It’s a legal document which is used to appoint someone to make decisions on your behalf if you are unable to."
        },
        {
            "text": "There are two types of LPA:"
        },
        {
            "text": "A health and welfare LPA allows the person creating the document to be clear about their medical choices, such as day-to-day care or life sustaining treatment."
        },
        {
            "text": "A property and financial affairs LPA allows someone you trust to manage your money and property. Your trusted person can act on your behalf before you lose the ability to make decisions with your permission."
        },
        {
            "text": "Both types of LPA must be registered with OPG before they can be used."
        },
        {
            "heading": 3,
            "text": "2. Enduring power of attorney (EPA)"
        },
        {
            "text": "EPAs signed and dated before 1 October 2007 are still valid and can be registered with OPG when the donor starts to lose, or has lost, mental capacity."
        },
        {
            "text": "An EPA is only for finance and property and were replaced by LPAs on 1 October 2007."
        },
        {
            "heading": 3,
            "text": "3. Mental capacity"
        },
        {
            "text": "Many people will reach a point where they can no longer make some decisions for themselves. This is known as lacking ‘mental capacity’. When this happens, someone else – often a carer or family member – will need to make decisions on behalf of the person. You can find a legal definition of mental capacity in section 2 of the Mental Capacity Act 2005."
        },
        {
            "heading": 3,
            "text": "4. Mental Capacity Act"
        },
        {
            "text": "The Mental Capacity Act 2005 is an Act of Parliament applying to England and Wales. Its purpose is to supply a legal framework for acting and making decisions on behalf of adults who can no longer make decisions for themselves."
        },
        {
            "heading": 3,
            "text": "5. Donor"
        },
        {
            "text": "Someone who has created either an enduring or lasting power of attorney. They are referred to as ‘donors’ because they have donated certain decision-making powers to someone else. Not to be confused with the medical term."
        },
        {
            "text": "Like an LPA, it is a legal document used to appoint someone you trust to make decisions on your behalf should you lose the ability to make your own decisions."
        },
        {
            "heading": 3,
            "text": "6. Attorney"
        },
        {
            "text": "The person chosen to act for someone else on an enduring power of attorney (EPA) or lasting power of attorney (LPA). The donor will appoint an attorney to help them make decisions when they’re no longer able to do so. Not to be confused with the American term for lawyer or solicitor."
        },
        {
            "heading": 3,
            "text": "7. Deputy"
        },
        {
            "text": "A person appointed by the Court of Protection to support someone who lacks the mental capacity to make decisions themselves. A deputy is appointed if someone loses mental capacity and does not have a lasting power of attorney in place."
        },
        {
            "heading": 3,
            "text": "8. Guardian"
        },
        {
            "text": "A person appointed to act on behalf of a missing person. Guardians are appointed for up to four years and must act in the best interests of the missing person."
        },
        {
            "heading": 3,
            "text": "9. Court of protection"
        },
        {
            "text": "A specialist court that makes decisions on financial or welfare matters for people who can't make decisions for themselves because they lack mental capacity. Some of their responsibilities include:"
        },
        {
            "heading": 3,
            "text": "10. Client"
        },
        {
            "text": "The person a deputy has been appointed to act on behalf of."
        },
        {
            "heading": 3,
            "text": "11. Best interests"
        },
        {
            "text": "Any decisions made, or actions taken, on behalf of someone who has lost mental capacity must be in their best interests. There is no specific answer as to what is in a person’s best interest, as every decision is unique to the person and circumstances involved, however there are standard steps to follow when deciding on someone’s best interests. These are set out in Section 2 of the Mental Capacity Act (MCA) code of practice."
        },
        {
            "heading": 3,
            "text": "12. Least restrictive action"
        },
        {
            "text": "If a decision is made on behalf of a peron who does not have mental capacity, it should ideally be the least restrictive option of the persons basic rights and freedoms."
        },
        {
            "heading": 3,
            "text": "13.User"
        },
        {
            "text": "Anyone who makes use of OPG services. This could be LPA or EPA donors, attorneys, deputies, clients, partners or intermediaries. It also covers staff using OPG systems."
        },
        {
            "heading": 3,
            "text": "14. P"
        },
        {
            "text": "It's a legal term, referring to people who have made arrangements for decisions about their personal welfare or property and affairs to be made by others"
        },
        {
            "heading": 3,
            "text": "15. Remissions"
        },
        {
            "text": "If the person making the LPA earns less than £12,000 per year, they can apply for a 50% discount off the application fee."
        },
        {
            "heading": 3,
            "text": "16. Exemption"
        },
        {
            "text": "If the person making the LPA receives means-tested benefits, they can apply to have the application for free."
        },
        {
            "text": "These are the main words and phrases you will come across when using our services. If you find any more which you think would be a good addition to this blog post please do let us know in the comments."
        },
        {
            "text": "You can find more information on LPAs and deputyships at www.gov.uk/opg"
        },
        {
            "text": " "
        }
    ]
}