{
    "url": "https://ruralpayments.blog.gov.uk/2022/02/24/the-rpa-podcast-episode-1-transcript/",
    "title": "The RPA Podcast: Episode 1 Transcript",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Basic Payment Scheme",
        "Countryside Stewardship",
        "Environmental Stewardship",
        "RPA podcast"
    ],
    "pub_date": "2022-02-24T15:19:17+00:00",
    "content": [
        {
            "text": "James: Hello and welcome to the Rural Payments Agency’s first ever podcast. I’m James Ryan and during 2022 we’ll be bringing you a series of short podcasts to help farmers, landowners and rural communities keep up-to-date on developments at the RPA, offer support and guidance, and navigate agricultural transition. In today’s episode, we’ll reflect on 2021 and look forward to what’s coming up in 2022. Later in the programme, we’ll also have a special feature on wellbeing in rural communities, offering advice on where you can access help and support during these challenging times."
        },
        {
            "text": "So, our first guest today is Sandy Kapila, Customer Director at the Rural Payments Agency. Sandy, it’s great to have you with us."
        },
        {
            "text": "Sandy: Thanks James, it’s really great to be here."
        },
        {
            "text": "James: Sandy, 2021 was another challenging, but ground-breaking, year for RPA. What are your reflections?"
        },
        {
            "text": "Sandy: I’m really proud of what we achieved across 2021. We as an agency continued to play a really important role in developing and delivering the Government’s objectives set out in the Agricultural Transition Plan. We made a lot of progress across 2020, and what was really great to see across 2021 is how closely we were working with Defra to support the delivery of the environmental land management schemes, which includes the launch of the Sustainable Farming Incentive pilot. What was lovely to see was that we had more than 2,500 expressions of interest and around 900 applicants."
        },
        {
            "text": "James: And it’s fair to say the Sustainable Farming Incentive scheme was just one example of the RPA’s work?"
        },
        {
            "text": "Sandy: Yes, absolutely. It’s a new scheme but we’ve got a whole range of services and schemes we currently operate to the farming community. For example, we opened up the application window for 2022 Countryside Stewardship Agreements to allow farmers to apply for funding to improve their local environment, which is restoring wildlife habitats, creating woodlands and managing flood risk. We’ve been really working closely with farmers and land managers to see how we can improve the scheme since we took it on in 2018 and it’s been really good to see, certainly last year, the increase in the uptake of applications that we received for the scheme."
        },
        {
            "text": "James: And can you update our listeners on the progress of the grants schemes delivered by RPA in 2021?"
        },
        {
            "text": "Sandy: Yes, grants schemes are a really important source of funding for rural businesses across the country and what we saw in 2021 was a really improved interest, certainly for new capital grant schemes that we opened, with over 3,000 applications received focused on improving Air Quality, Water Quality, Boundary Trees and Orchards or a mixture of these options. Another popular scheme we ran was the Countryside Productivity Small Grants Scheme which provides investment towards specific items of equipment focused on improving productivity and efficiency for farmers and horticultural businesses which is a really important element as and when we move across to the agricultural transition period. We released around £16m of payments on around 2,800 eligible claims."
        },
        {
            "text": "James: Thanks Sandy. I’d like to talk more about the performance of the schemes a little later, but December was a crucial time for RPA with a number of announcements."
        },
        {
            "text": "Sandy: Yes, December is the culmination of a lot of work for the RPA and is really important for farming communities. We launched the Farming Investment Fund, including the Farming Equipment and Technology Fund and the Water Management theme of the Farming Transformation Fund. I can’t stress the importance of productivity and how we as Government can support farmers to improve their productivity in these challenging times. It was really fantastic to see farmers will benefit from investment to boost that productivity through a whole range of equipment that we’ve made available. We also opened up the sixth round of the popular Countryside Stewardship Facilitation Fund in December. There is nothing more important for us than farmers working together in a collaborative way, sharing their knowledge in their communities to protect and enhance their local environment, and that’s in line with their local Countryside Stewardship priorities. But it’s not all about the land. We recognise, in particular at the end of the year, the challenges that the pig industry were facing. We announced a package of measures to support the pig industry, which focused on reducing the animal welfare implications of pigs backing up on farms. This saw the launch of the Slaughter Incentive Payment Scheme which focused on increasing the throughput of pigs by contributing towards the extra costs of operating additional slaughter shifts at abattoirs, but that was just one element of it. We also opened up a Private Storage Aid scheme which provided some funding to cover the costs of cold storage for the products."
        },
        {
            "text": "James: The RPA has a huge remit in terms of delivery but ultimately it will be judged on its performance. Can you give us some headline performance figures?"
        },
        {
            "text": "Sandy: When I speak to farmers across the country, and we’ve done a whole series of engagements which we’ll touch on in a moment, what’s always surprising for people that I speak to is the breadth of services that we do. A lot of the focus tends to be on the land schemes that we pay out in December. To give some context on our land schemes, in December we paid just under 101,300 claims, which is essentially investing £1.8bn into the farming community, and that’s within the first month of the payment window which runs between December and June. That investment isn’t just a direct investment, we’ve seen at first hand how that payment then trickles down throughout the supply chain. To set it into context, that represents just over 98% of eligible claims for the Basic Payment Scheme, around 62% of Countryside Stewardship revenue claims and around 64% of Environmental Stewardship claims for 2021."
        },
        {
            "text": "But in addition, one of the key things we also fund is capital works under the Countryside Stewardship Capital Grants scheme and across 2021 we reimbursed £66.75m for the establishment and maintenance of woodland and hedges. That’s around 5,700 projects and since we took on the scheme in 2018 we’ve reduced the amount of time where we’ve paid those particular claims and it was really pleasing to see that most of them were paid within an average of 30 working days."
        },
        {
            "text": "James: That’s a strong top-line performance Sandy. Many farmers, landowners and rural communities rely on these payments but there can be a delay in payment. Why is this?"
        },
        {
            "text": "Sandy: We know the importance of cash flow to the rural economy. While the payment window runs between December and June every year, we always aim to pay as promptly as we can. Essentially, if the claim is ready, we pay it."
        },
        {
            "text": "James: But why does it take longer to pay some claims?"
        },
        {
            "text": "Sandy: It can take longer to complete our checks for some claims and there are a number of reasons for this additional time. For example, the allocation of common land can be quite a complex process. What we do with common land is we allocate the available area to those claiming on the common. Sometimes the outcome of inspections can take a little time for us to consider and establish the impact on the claim or agreement. In some cases, we can’t progress claims as they are reliant on the completion of legal work, such as probate, and some just take time because of their size."
        },
        {
            "text": "James: Thanks Sandy. I’m keen to explore the Countryside Stewardship scheme further. Can you remind us of its purpose and how it’s evolved over the last twelve months?"
        },
        {
            "text": "Sandy: Of course. Countryside Stewardship, as I said earlier, farmers can apply for funding to improve their local environment – that’s restoring wildlife habitats, creating woodlands, managing flood risk and really focus on that environmental ambition. We recognise that we as an organisation want to listen, learn and do better, so we’ve been closely working with the industry, and changes have been made to the scheme this year to broaden out the options available and make it easier to apply."
        },
        {
            "text": "James: And how did the changes reflect in the numbers?"
        },
        {
            "text": "Sandy: It was really great to see that we received a 40% increase in the number of applications in comparison to 2020. There are now 40,000 farmers in England participating in an agri-environment scheme."
        },
        {
            "text": "James: Thanks Sandy. So, what are your final reflections on 2021 and what are your hopes for 2022?"
        },
        {
            "text": "Sandy: We’ve continued to improve our services focused on helping farmers deliver the best outcomes they can, and we’ve worked hard to get payments made as quickly as possible in recognition of the importance of cash flow for farming businesses – and we’ll continue to do so. As I mentioned earlier, we are constantly looking to learn, listen and do better and in 2021, a good example of that listening is we attended a record number of shows and events across the country. That two-way engagement with our farmers is incredibly important and I’ll give you a good example. We did an MP roundtable in Cumbria at the beginning of November, and we had a new member of staff that had just joined. It was literally his fourth week within the business and it was really great to hear from him last week and he said, “Sandy, I was so pleased to be able to come along to an event like that and hear farmers talk about their experiences, and what that’s meant for me in particular, now that I’m working on something, I realise there is a farmer at the end of the work that I do.” I think that’s incredibly important, so that level of connection that we need to build with farming communities focused on our need to build different relationships with farmers will be incredibly important. 2022 and beyond is going to be a really challenging time for farmers and our role as the RPA is to help farmers through this transition period and provide them with the best information to help them secure their future. We have great people in the RPA who are really, genuinely committed to what they do, most of them live in the areas they serve, many of them have farming in their background – they’re either married to farmers, their children are farming - and that passion is really great to see across all of the services that we operate. So, we’re all geared up and focused on delivering better outcomes for farmers but working in partnership with farmers across 2022."
        },
        {
            "text": "James: That’s great to hear Sandy and thank you for joining us today. Next, we’ll be looking forward to the year ahead."
        },
        {
            "text": " "
        },
        {
            "text": "****Music – leading to next segment ****"
        },
        {
            "text": " "
        },
        {
            "text": "James: Thanks again to Sandy for his reflections on 2021. And as Sandy highlighted, 2022 is shaping up to be another crucial year for farming communities, so I’m delighted to say I’m now joined by Katie Yon, Senior Stakeholder Manager & Shows and Events Lead at the RPA, to discuss exactly what this year holds. Katie, thank you for joining us today."
        },
        {
            "text": "Katie: Thank you for having me James."
        },
        {
            "text": "James: Katie, what can farmers and rural communities expect to see delivered in 2022?"
        },
        {
            "text": "Katie: 2022 will be an important and pivotal year, both for farming communities and the RPA. As well as the Basic Payment Scheme, Countryside Stewardship and Environmental Stewardship schemes, there will be further updates relating to the environmental land management schemes and the Farming Investment Fund."
        },
        {
            "text": "James: There were announcements at the end of last year and beginning of this year focused on the environmental land management schemes, so could you summarise the updates for our listeners please?"
        },
        {
            "text": "Katie: Yes, of course. In January this year, the Secretary of State unveiled the next stages of the plan to reward farmers and landowners for actions which benefit the environment and support sustainable food production, alongside vital nature recovery and work towards net zero. The Secretary of State unveiled details of two of the environmental land management schemes, Local Nature Recovery and  Landscape Recovery following the Sustainable Farming Incentive scheme which was announced in December."
        },
        {
            "text": "James: And what will these three schemes deliver?"
        },
        {
            "text": "Katie: Well, the Sustainable Farming Incentive focuses on making agricultural activities more sustainable. It will pay for actions that all farmers can choose to take. This scheme will pay for actions that can be taken at scale across the whole farmed landscape to have the most impact. This includes reducing inorganic fertiliser and pesticide use, taking care of our soils and improving farmland biodiversity, water quality, air quality and carbon capture."
        },
        {
            "text": "The Local Nature Recovery scheme is the more ambitious successor to Countryside Stewardship and is planned to be rolled out by the end of 2024. It will pay for the right things in the right places and supporting local collaboration to make space for nature in the farmed landscape. This scheme will particularly contribute to our targets for trees, peatland restoration, habitat creation and restoration and natural flood management."
        },
        {
            "text": "Finally, Landscape Recovery is a hugely exciting opportunity for farmers and land managers who want to take a more radical and large-scale approach to producing environmental and climate outcomes through land use change and habitat and ecosystem restoration. The first round of Landscape Recovery pilot projects is now open and it closes on Tuesday, 24th May this year. The first round focuses on two themes: first of all, Recovering and restoring England’s threatened native species and Restoring England’s streams and rivers. And there is more information on the Gov.uk website."
        },
        {
            "text": "James: Thanks Katie. You mentioned that Local Nature Recovery is the successor to Countryside Stewardship; what does this mean for farmers?"
        },
        {
            "text": "Katie: While the new schemes are rolling out, existing schemes will continue to be available for some time, with the last applications for new Countryside Stewardship agreements in 2023, to start in 2024. Then, from 2025, it will only be possible to enter into new agreements through the new environmental land management schemes."
        },
        {
            "text": "James: So what does this look like and when will we know more?"
        },
        {
            "text": "Katie: Local Nature Recovery will provide a range of options - much like Countryside Stewardship - so that farmers can choose the right combination for their setting and preferences. Defra will publish more details on the full list of options later this year, alongside more details on scheme rules and proposed payment rates. But Countryside Stewardship is a solid option for now and farmers really should regard the Countryside Stewardship scheme as a bridge to Local Nature Recovery. As Sandy mentioned earlier, last year we saw a 40% increase in demand and applications for Countryside Stewardship which for us is very encouraging."
        },
        {
            "text": "James: That sounds very positive, and the 2022 timescales for Countryside Stewardship, are they in line with previous years?"
        },
        {
            "text": "Katie: They are James, yes - applications for Countryside Stewardship opened at the beginning of February. The Basic Payment Scheme application window and the Countryside Stewardship and Environmental Stewardship claim window will be opening in March."
        },
        {
            "text": "James: And finally, I’d just like to touch on the Farming Investment Fund. Our listeners received updates on some schemes during 2021, but what’s the latest and what can we expect in 2022?"
        },
        {
            "text": "Katie: Your listeners may recall the RPA launched the Farming Investment Fund in December. This is made up of 2 separate funds, the Farming Equipment and Technology Fund and the Farming Transformation Fund. In January, we opened applications for the ‘improving farm productivity’ theme. The minimum grant a farmer can claim is £35,000. The maximum grant available under the theme is £500,000 per applicant. So these grants are paid in arrears, and at least 60% of the project costs need to be paid for through private sources like savings or a bank loan."
        },
        {
            "text": "James: And what can the grants be used for?"
        },
        {
            "text": "Katie: Well, the grants awarded through improving farm productivity will pay for capital items to improve farm and horticulture productivity through the use of robotic or autonomous equipment and systems to aid crop and livestock production, and the installation of slurry acidification equipment to improve nutrient management and reduce ammonia emissions."
        },
        {
            "text": "James: There’s certainly a lot happening in 2022 and we’ll keep you updated on developments here on the RPA Podcast. Katie, thanks for your time today and we’ll look forward to hearing further updates during the year ahead."
        },
        {
            "text": " "
        },
        {
            "text": "****Music – leading to next segment ****"
        },
        {
            "text": " "
        },
        {
            "text": "James: The last two years have been incredibly difficult for everyone but farming communities consistently face a unique set of challenges, and discussing the importance of resilience, and the support available within the sector, has never been more important. I’m now joined by Carrie Smith, External Affairs Manager at the RPA, to discuss the support available to farmers and farming communities. Carrie, thanks for joining us today."
        },
        {
            "text": "Carrie: Thanks James, it’s a pleasure to be here."
        },
        {
            "text": "James: So, we often talk about resilience but why is it so important to have this discussion in the context of farming and farming communities?"
        },
        {
            "text": "Carrie: Well, rural mental health is a really important topic. We know stress is a real concern in the industry and that there are many factors which contribute to this, some of which are linked to agricultural transition and uncertainty over the future of farming. At the RPA we are taking this seriously and looking at what we can do to support farmers. Some of this is practical and some is about how we communicate."
        },
        {
            "text": "James: It’s fantastic to hear this is a focus for RPA. So, what are RPA doing to help their customers?"
        },
        {
            "text": "Carrie: In practical terms the changes to how we approach inspections for domestic agreements will make our interactions more open. The chance for farmers to respond to findings earlier and getting rid of penalties should reduce some of the anxieties around regulation and compliance. We know the Covid-19 pandemic had a huge impact on farmers and the knock-on effects continue to be a cause of stress. So we’re continuing to review our processes ahead of the opening of the BPS application and Countryside Stewardship and Environmental Stewardship claim window, to make sure we have support in place so that no one is disadvantaged."
        },
        {
            "text": "James: And you mentioned this isn’t just about what you’re doing, but also how you communicate?"
        },
        {
            "text": "Carrie: Yes, we’re always looking at our communication, so expect to see more videos, podcasts and direct customer contact, all with a view to setting out options as clearly as we can and encouraging farmers to plan for the future."
        },
        {
            "text": "James: I’m sure that will be welcomed by our listeners. And you also work with a number of organisations who offer wellbeing services. Can you give us some examples and outline how our listeners can contact them?"
        },
        {
            "text": "Carrie: Of course. We work with some great organisations who support farmers. Through the Royal Agricultural Benevolence Institution – or RABI – members of farming communities across England and Wales can access a new, completely free counselling service. You can access that through a free 24/7 confidential helpline and they will put you in touch with a counsellor within 24 hours, without the need for any kind of clinical referral. They know that talking to someone who understands the challenges and pressures of farming can really help, and this support is available over the phone, via video or in person."
        },
        {
            "text": "James: That sounds like an incredibly helpful service. What’s the helpline telephone number?"
        },
        {
            "text": "Carrie: It’s 0800 188 4444. You can also e-mail them at help@rabi.org.uk"
        },
        {
            "text": "James: Thanks Carrie. I believe the Farming Community Network also have an established helpline. Please can you tell us more about it?"
        },
        {
            "text": "Carrie: Yes, they do. Farming Community Network – FCN – run a confidential, national helpline and e-helpline which is open every day of the year from 7am to 11pm. Volunteers there provide free, confidential, pastoral and practical support to anyone that seeks help, including those experiencing stress, depression or isolation. Again, speaking to someone who understands can make a real difference, so we would encourage anyone who needs to, to reach out either to us or to one of these organisations."
        },
        {
            "text": "James: And what’s The Farming Community Network’s helpline number?"
        },
        {
            "text": "Carrie: It is 03000 111 999."
        },
        {
            "text": "James: Great, thank you Carrie. That was incredibly helpful and I’m sure we’ll revisit this important subject in future podcasts."
        },
        {
            "text": " "
        },
        {
            "text": "****Music – leading to next segment ****"
        },
        {
            "text": " "
        },
        {
            "text": "So, that brings us to the end of today’s podcast. I’d like to say a big thank you to Sandy, Katie and Carrie for their insights today, and thank you for listening. If you would like us to cover a particular topic with our subject experts, please do get in touch. You can e-mail us at External.Affairs@rpa.gov.uk, or you can follow us on Twitter - @Ruralpay - or follow the Rural Payments Agency on Facebook. We’ll be back soon with a brand-new podcast as we keep you updated on developments at the RPA and support you through the agricultural transition process. Goodbye."
        }
    ]
}