{
    "url": "https://skillsengland.blog.gov.uk/2026/02/12/building-skills-for-opportunity-how-skills-england-is-paving-a-pathway-to-success-for-young-people-by-tessa-griffiths-and-sarah-maclean/",
    "title": "Building skills for opportunity: how Skills England is paving a pathway to success for young people, by Tessa Griffiths and Sarah Maclean",
    "authors": [
        "Skills England Communications"
    ],
    "categories": [
        "Apprenticeship assessment",
        "data",
        "Insight",
        "national apprenticeship week",
        "News and announcements",
        "Strategy"
    ],
    "pub_date": "2026-02-12T16:31:23+00:00",
    "content": [
        {
            "text": "Every young person deserves the chance to build a rewarding career, regardless of their background. That's the ambition at the heart of the government's opportunity mission, and the UK Youth Guarantee initiative, and it's an ambition that Skills England is working hard to deliver. "
        },
        {
            "text": "This National Apprenticeship Week, we’ve been talking to apprentices - hearing about their experiences, about what works and what doesn’t, and what they want to see from the skills system.  It’s been an opportunity to reflect on the progress we’ve made and consider what more we need to do to build a system that supports opportunity for all. "
        },
        {
            "heading": 2,
            "text": "The challenge"
        },
        {
            "text": "For too long, skills shortages have held back both individuals and the economy. Our report, Occupations in demand: 2025 found that almost 1 in 6 roles across the UK, over 5 million positions, are in critical demand. Nearly 98% of these positions require training or education. "
        },
        {
            "text": "Meanwhile, employer investment in training has fallen to its lowest level since records began, with investment per employee down nearly a fifth between 2011 to 2024. "
        },
        {
            "text": "This isn't just an economic problem. It's an opportunity problem. Young people who can’t access training or employment are missing out on life chances - the opportunity to progress and develop the skills they need to for success in life and work. "
        },
        {
            "heading": 2,
            "text": "Government commitment"
        },
        {
            "text": "The government has set an ambitious target: two-thirds of young people participating in higher level learning, whether academic, technical, or through an apprenticeship, by the age of 25. This is central to the Plan for Change and the mission to break down barriers to opportunity. "
        },
        {
            "heading": 2,
            "text": "Action taken by Skills England"
        },
        {
            "text": "To address this challenge, our work is centred on three priorities."
        },
        {
            "heading": 3,
            "text": "1. Understanding our nation's skills needs and improving our skills offer"
        },
        {
            "text": "Our extensive skills needs analysis and forecasts set out where we have the greatest skills gaps and requirements, demonstrating that health and social care, education, manufacturing, and science and technology face the highest demand for skilled workers. The intelligence we continue to collect is shaping policy and funding decisions and helping direct our efforts where we can have the most impact. "
        },
        {
            "text": "Our Standard Skills Classification and UK Skills Explorer tool has been developed to assist employers in assessing career paths, core skills, and take a joined-up approach in skills language. And to support local skills planning, we've published new guidance for Local Skills Improvement Plans and a relaunched local skills dashboard, supporting local leaders, employers, colleges and universities to work together on local solutions to skills training. "
        },
        {
            "heading": 3,
            "text": "2. Simplifying access to skills to boost economic growth"
        },
        {
            "text": "Our work on apprenticeship reform aims to make assessment robust and clear, to avoid duplication between training products, and to make apprenticeships more flexible and effective."
        },
        {
            "text": "Most recently, Skills England and the Department for Work and Pensions announced a new accelerated approach to approval, with changes to apprenticeships and short courses developed within three months where they are linked to major infrastructure projects critical for economic growth.  "
        },
        {
            "heading": 3,
            "text": "3. Mobilising employers and partners to co-create solutions to national, regional and local skills needs"
        },
        {
            "text": "Employers continue to be at the heart of our skills system and we continue to work intensively with business to ensure technical training delivers what they need. "
        },
        {
            "text": "We are also driving forward a service to support major investors and help them navigate the skills system. This sits alongside our focus on large infrastructure projects, where we are helping business to join up with key stakeholders at the local level and build the skilled workforce they need. "
        },
        {
            "text": "This, with our new fast-track approval approach, will support employers to get training for jobs off the ground as quickly as possible and support young people in their careers."
        },
        {
            "heading": 2,
            "text": "A major investment in young people"
        },
        {
            "text": "At the end of 2025, the government announced a £725 million package with the aim to deliver 50,000 more apprenticeships for young people and help match skills training with local job opportunities. This includes: "
        },
        {
            "text": "This joined-up approach will help connect national priorities with local delivery, ensuring businesses of all sizes can take on young talent. "
        },
        {
            "heading": 2,
            "text": "Measures of success"
        },
        {
            "text": "As we noted above, we’ve had the pleasure of hearing from apprentices across multiple sectors this week, and what better way to showcase the success of apprenticeships. "
        },
        {
            "text": "Thomas, a carpentry and joinery apprentice with Right Look Carpentry and Joinery shared his experience so far: "
        },
        {
            "text": "Anisha, an engineering technician who recently passed her apprenticeship with Williams Jet Tenders, shared her experience as an adult learner: "
        },
        {
            "text": "Sophie, a Level 3 Lab Technician apprentice at TWI, also shared her experience with us: "
        },
        {
            "heading": 2,
            "text": "Future planning"
        },
        {
            "text": "Phil Smith, Skills England Chair, in a recent Take Five, the new 5% Club podcast shared his optimism for the future of the skills landscape and the importance of skills: "
        },
        {
            "text": "As industries evolve in the coming years, so must the training that prepares people to work in them. Whether it's new safety standards on building sites or the skills needed to construct and operate the latest offshore wind turbines, apprenticeships need to keep pace.  "
        },
        {
            "text": "We’re confident that by bringing together employers, training providers, and local leaders, we can build a skills system that is fit for the future; one that gives every young person the chance to succeed, regardless of where they start."
        },
        {
            "text": "Tessa Griffiths and Sarah Maclean"
        },
        {
            "text": "Co-CEOs, Skills England"
        }
    ]
}