{
    "url": "https://mhclgmedia.blog.gov.uk/2026/02/12/coverage-of-the-representation-of-the-people-bill/",
    "title": "Tougher measures on political finance through the Representation of the People Bill",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Elections"
    ],
    "pub_date": "2026-02-12T14:03:07+00:00",
    "content": [
        {
            "text": "There has been widespread coverage on the introduction of the Representation of the People Bill introduced today."
        },
        {
            "text": "The Bill will mean foreign actors will no longer be able to use their money to interfere in the UK’s elections, as part of the biggest expansion of democratic participation in a generation."
        },
        {
            "text": "Coverage in the Times has reported that under the Bill, donations from companies will be capped at two years of revenue. "
        },
        {
            "text": "The Bill means companies will need to have shown sufficient revenue made over the previous 3 years (allowing in most cases two financial years of revenue) to justify their donation."
        },
        {
            "text": "The measures will help to prevent companies that have no genuine business activity or UK footprint from making donations. "
        },
        {
            "text": "The Guardian have reported that bill will also stop foreign companies offering high-value gifts to MPs, who will not be able to accept them unless they are below £2,230."
        },
        {
            "text": "These new rules will apply to all monetary donations, as well as all in-kind donations above £2,230. Existing rules will continue to apply to in-kind donations below £2,230 to ensure legitimate hospitality, for example a MP visiting a local business, can continue. "
        },
        {
            "text": "Steve Reed, Secretary of State for Housing, Communities and Local Government, said:  "
        },
        {
            "text": "“The Representation of the People Bill will protect our democracy against foreign interference and give young people the right to vote. "
        },
        {
            "text": "“Growing threats from abroad mean we must make changes to keep our elections secure.    "
        },
        {
            "text": "“We won’t let hostile foreign states use dirty money to buy our elections. We are keeping British democracy safe for British people.”"
        },
        {
            "text": "My Life My Say, said:  "
        },
        {
            "text": "“Today’s Bill and the extension of the franchise to all 16 and 17-year-olds is a monumental update to our democracy that will allow millions of young people to have their voices heard at the next general election.  "
        },
        {
            "text": "Having created the v.16 campaign alongside young people, our work with the Ministry of Housing, Communities & Local Government has focused on ensuring that young people were included in today's Bill. We are delighted to see the government follow through on its commitment to young people, and our attention now turns towards ensuring that a new generation of voters are properly welcomed into our democracy.” "
        },
        {
            "text": "Harriet Andrews, Director of the award-winning democratic education organisation The Politics Project, said:  “We welcome the move by the government to extend the vote to 16 and 17-year-olds. There’s a perception that this age group doesn’t care about politics, but after more than ten years supporting young people to engage in democracy, we know they care deeply about the issues that shape their futures.  \"As young people prepare to go to the polls, it's vital that they're supported by high-quality democratic education. We're ready to help the next generation of voters build the skills and confidence to cast their first votes.\" "
        },
        {
            "text": "Laura Lock, deputy chief executive of the Association of Electoral Administrators, said:  "
        },
        {
            "text": "“The big change of votes at 16 will bring welcome harmonisation to the age of attainment for all elections across the UK, but seemingly smaller changes will also make a huge difference year-round. This is especially true for the postal voting system which, as we saw in 2024, doesn’t always meet electors’ expectations.  "
        },
        {
            "text": "“While we regret it is necessary at all, including electoral staff in measures to combat abuse and harassment is an important step. Intimidation of any kind around elections is unacceptable and threatens our democracy.” "
        }
    ]
}