{
    "url": "https://dragonsden.blog.gov.uk/2026/02/12/dragons-den-ip-blog-series-23-episode-3/",
    "title": "Dragons Den IP Blog - Series 23 Episode 3",
    "authors": [
        "Christina Watts"
    ],
    "categories": [
        "Business",
        "International",
        "IP Attaché network",
        "Patents",
        "Trade marks"
    ],
    "pub_date": "2026-02-12T21:00:00+00:00",
    "content": [
        {
            "text": "Tonight’s episode of Dragons’ Den was bursting with innovative businesses and inventions. Dragon Deborah Meaden even asked entrepreneurs, not once but twice, the very question this writer was eager to hear answered.“Let’s talk about the IP. Do you have any protection?”Co-founders Richard Peter and Erica Pugh were first up to answer the question."
        },
        {
            "heading": 3,
            "text": "“Everybody poops”"
        },
        {
            "text": "The business duo entered the Den keen to impress the Dragons with their business Compo Closet, a solution for making off-grid toilets more convenient. As Erica put it:"
        },
        {
            "text": "In 2020 Richard created the ‘cuddy’ - a self-contained, portable composting toilet specifically designed for campervans.A composting toilet is a waterless toilet that separates urine and solids to reduce moisture and odour. It uses carbon-rich material like sawdust to help waste break down through aerobic composting. Over time, the waste dries and decomposes into a soil-like material that can be safely removed."
        },
        {
            "text": "Concluding their opening pitch, the pair invite the Dragons to invest £100,000 for a 3% stake in their business, before moving straight into their product demonstration."
        },
        {
            "heading": 3,
            "text": "Keep your trousers on Peter"
        },
        {
            "text": "After a hilarious demo of the comfortability of the cuddy from Peter Jones, the Dragons get down to business and we finally hear the answer to Deborah’s burning IP question.Richard tells Deborah how they have patents pending in the UK and internationally."
        },
        {
            "text": "Back to the Den. Peter offers Richard and Erica all the money they asked for, in exchange for 20% of their business. The Compo Closet co-founders reject his offer and leave the Den empty handed, stating that they wanted a Dragon but not at that price."
        },
        {
            "heading": 3,
            "text": "Tech for cats"
        },
        {
            "text": "Brothers Martin and Tomas Rosinski are next to face Deborah’s all important IP question as they pitch their business, OnlyCat. The duo were asking for a £200k investment in return for a 4% stake.The brothers invented a smart, AI powered cat flap, designed to stop your cats bringing home prey. The flap features a built in AI powered camera that screens your cat upon entry to see if it has any prey. If prey is detected, the door remains locked and a video alert is sent straight to your phone showing your cats foiled attempt."
        },
        {
            "text": "They tell Deborah that they have protected their IP by filing patent GB2618551 for their ‘cat flap with camera and prey detection programming’."
        },
        {
            "text": "\n\nAre you thinking of applying for a patent?   Before you do, you must make sure that your invention is: important IP question as they pitch their business, \n\nnew - it must not have been made publicly available anywhere in the world, for example it must not be described in a publication  \n\n\ninventive - something that can be made and used, a technical process, or a method of doing something \n\n\n"
        },
        {
            "heading": 3,
            "text": "Will the cat get the cream?"
        },
        {
            "text": "The cat loving duo wrap up their pitch with three offers from Deborah, Touker Suleyman and Steven Bartlett. They tell the Den that they need a Dragon who can help with their marketing and social media strategies. While they’re keen to work with Steven, they will only accept £200,000 for 10% of the business, 2.5% less than what he offered.They hit the jackpot when social media expert Steven agrees to their counteroffer. "
        },
        {
            "text": "If tonight’s episode left you curious about the intellectual property behind each Dragons’ Den pitch, don’t forget to subscribe to our blog. From patents to trade secrets, we’ll be digging into how these entrepreneurs safeguard their IP assets and strengthen the value of their innovations. "
        },
        {
            "heading": 4,
            "text": "Disclaimer:"
        },
        {
            "text": "The purpose of the IPO's Dragons' Den IP blog is to help identify the IP in entrepreneurs’ pitches and highlight how IP works, or could work, in the real-life examples featured. IPO’s authorship of this blog does not constitute its endorsement or sponsorship of any products, individuals or businesses referenced within "
        }
    ]
}