{
    "url": "https://charitycommission.blog.gov.uk/2026/02/12/elusennau-ac-ymgyrchu-myfyrdodau-cyn-yr-etholiad-ir-senedd-ac-etholiadau-lleol/",
    "title": "Elusennau ac ymgyrchu: myfyrdodau cyn yr etholiad i’r Senedd ac etholiadau lleol",
    "authors": [
        "David Holdsworth, Chief Executive Officer"
    ],
    "categories": [
        "Campaigning",
        "election",
        "Uncategorized"
    ],
    "pub_date": "2026-02-12T11:10:27+00:00",
    "content": [
        {
            "text": "Mae’r cynnwys hwn hefyd ar gael yn Saesneg / English."
        },
        {
            "text": "Bydd pobl ledled Cymru a Lloegr yn mynd i'r polau unwaith eto ym mis Mai gan fod yr etholiad i’r Senedd ac etholiadau lleol ar y gorwel."
        },
        {
            "text": "Bydd llawer o elusennau yn paratoi ar gyfer cyfnod o ymgyrchu a gweithgarwch gwleidyddol cynyddol yn y misoedd nesaf, ac felly mae'n gyfle amserol i atgoffa arweinwyr ac ymddiriedolwyr elusennau o'u cyfrifoldebau ac o'r canllawiau a gyhoeddwn i helpu i arwain eich penderfyniadau."
        },
        {
            "text": "Mae elusennau'n chwarae rhan hanfodol yn ein democratiaeth, gan roi llais i'w buddiolwyr ac amlygu'r achosion y maent yn eu gwasanaethu. Fel y nodwyd yn eang, fodd bynnag, mae naws y ddadl gyhoeddus a gwleidyddol yn arbennig o dan bwysau ar hyn o bryd, gyda llawer o'r rhai sy'n ymwneud ag elusennau yn wynebu gelyniaeth gynyddol."
        },
        {
            "text": "Yn y cyd-destun hwn hoffwn eich sicrhau y bydd y Comisiwn yn parhau i sefyll wrth hawl elusennau i ymgyrchu er hyrwyddo eu dibenion a lle mae hyn er eu lles gorau."
        },
        {
            "text": "Fodd bynnag, er mwyn cynnal hyder y cyhoedd yn eich ymgyrchu, ac ymddiriedaeth mewn elusennau yn ehangach, mae'n hanfodol eich bod yn ymgyrchu mewn ffordd sy'n gyson â'r fframwaith cyfreithiol."
        },
        {
            "text": "Eich rôl fel arweinydd elusen"
        },
        {
            "text": "Mae gan elusennau le arbennig yn ein cymdeithas, fel sefydliadau dibynadwy sy'n gwneud gwahaniaeth yn y cymunedau maen nhw'n eu gwasanaethu. Mae bod yn elusen yn fraint, sy'n dod â'r cyfrifoldeb i ddangos bod popeth a wnewch, a phob penderfyniad a wnewch, yn helpu i gyflawni pwrpas yr elusen ac yn cynnal y statws arbennig sydd gan elusennau."
        },
        {
            "text": "Rhan o'r rheswm pam mae elusennau mor ddibynadwy yw oherwydd bod y cyhoedd, yn ogystal â'r gyfraith, yn disgwyl iddynt fod yn annibynnol ar wleidyddiaeth plaid wrth ymgysylltu â'r ddadl genedlaethol."
        },
        {
            "text": "Felly, er y gall elusennau roi cefnogaeth i bolisïau penodol a hyrwyddir gan bleidiau gwleidyddol neu godi pryderon amdanynt, ni ddylent byth hyrwyddo na beirniadu, na chael eu gweld yn hyrwyddo neu'n beirniadu, plaid wleidyddol neu ymgeisydd unigol."
        },
        {
            "text": "Nid yw hyn yn golygu osgoi beirniadaeth o bolisïau pleidiau gwleidyddol, ac nid yw'n golygu bod yn rhaid i chi osgoi negeseuon angerddol, emosiynol neu uniongyrchol, ond dylech barhau i ganolbwyntio ar y materion sy'n berthnasol i'ch elusen ac osgoi ymosodiadau ar gymeriad."
        },
        {
            "text": "Yr hyn y gallwch ei ddisgwyl gan y Comisiwn"
        },
        {
            "text": "Ein haddewid i'r cyhoedd yw ein bod yn asesu pob pryder sy'n dod atom. Ni fydd unrhyw gŵyn yn cael ei gwrthod ar unwaith ac ni fydd unrhyw bryder yn cael ei anwybyddu."
        },
        {
            "text": "Ond rydym yn gwrthod cael ein llusgo i mewn i gwynion sy'n ceisio arfogi gwaith cyfreithlon elusennau. Ein gwaith ni yw cynnal cyfraith elusennau, sef y deddfau y mae Senedd etholedig yn ddemocrataidd wedi'u pasio."
        },
        {
            "text": "Gellir dod o hyd i'r Fframwaith Rheoleiddio a Risg y byddwn yn asesu pob cwyn drwyddo yn ein canllawiau ar sut i godi pryder gyda'r Comisiwn."
        },
        {
            "text": "Wrth i ni agosáu at etholiad y Senedd a’r etholiadau lleol, bydd y Comisiwn yn parhau i gyhoeddi deunyddiau sy'n cefnogi elusennau i wneud pethau'n iawn wrth ystyried gweithgarwch gwleidyddol ac ymgyrchu yn y cyd-destun hwn. Cadwch lygad ar ein sianeli digidol am y diweddaraf."
        },
        {
            "text": "Darllenwch ein canllawiau"
        },
        {
            "text": "Yn y cyfamser, manteisiwch ar y cyfle i adolygu ein canllawiau, gan eu bod yn nodi egwyddorion cyfraith elusennau a'r fframwaith y disgwylir i elusennau weithredu ynddo."
        },
        {
            "text": "Am gyflwyniad i ymgyrchu elusennol a gweithgaredd gwleidyddol gallwch ddarllen ein canllaw 5 munud ar y pwnc."
        },
        {
            "text": "Am ddeunydd mwy manwl i'ch helpu i wneud penderfyniadau, gweler ein canllawiau manwl ar ymgyrchu a gweithgarwch gwleidyddol ar gyfer elusennau. Mae gennym hefyd ganllawiau atodol ar ymgyrchu a gweithgarwch gwleidyddol yn ystod cyfnod etholiad."
        },
        {
            "text": "Yn aml, mae defnyddio cyfryngau cymdeithasol yn ffordd effeithiol o ymgyrchu, ond gall fod risgiau penodol hefyd. Darllenwch ein canllawiau cyfryngau cymdeithasol am ragor o wybodaeth."
        },
        {
            "text": "Efallai y byddwch hefyd yn ei chael hi'n ddefnyddiol darllen ein crynodeb gwaith achos o Etholiad Cyffredinol 2024 am rai gwersi a ddysgwyd sy'n berthnasol i'ch ymgyrchu."
        }
    ]
}