{
    "url": "https://defraenvironment.blog.gov.uk/2026/02/12/from-commitment-to-action-bbnj-act-receives-royal-assent/",
    "title": "From commitment to action: BBNJ Act receives Royal Assent",
    "authors": [
        "Environment blog team"
    ],
    "categories": [
        "Marine",
        "Nature",
        "Wildlife"
    ],
    "pub_date": "2026-02-12T12:32:07+00:00",
    "content": [
        {
            "text": "Two-thirds of the ocean lies beyond any nation's jurisdiction. These vast waters contain extraordinary biodiversity and ecosystems that are vital to the health of our planet, and are home to sharks, whales, sea turtles and countless other species.  "
        },
        {
            "text": "Yet these species are facing increasing threats and pressures.  "
        },
        {
            "text": "Many shark populations have been pushed to the brink of extinction, and sea turtles are face mounting threats from pollution, habitat loss and climate change. Without the protection of national laws, these vulnerable waters have been left open to exploitation and degradation. "
        },
        {
            "text": "That's going to change with the Biodiversity Beyond National Jurisdiction (BBNJ) Agreement which entered into force on 17 January. Today the BBNJ Bill received Royal Assent, and is now an Act, which brings us another step closer towards the UK ratifying the Agreement. "
        },
        {
            "text": "What is the BBNJ Agreement? "
        },
        {
            "text": "The BBNJ Agreement—sometimes called the High Seas Treaty—is a landmark international agreement that will, for the first time, create a legal mechanism to establish protected zones in these waters. "
        },
        {
            "text": "Until now, such protections have only been possible within a country’s own waters – but that is no longer the case. "
        },
        {
            "text": "The BBNJ Agreement adopted after more than a decade of international negotiations will: "
        },
        {
            "text": "For marine life, this means stronger protections in areas that have previously been vulnerable to exploitation. There are benefits for people too, as a healthy marine ecosystem underpins important global fisheries and climate regulation critical for communities around the world. "
        },
        {
            "text": "The UK's commitment "
        },
        {
            "text": "The UK played a leading role in shaping this treaty and was among the first countries to sign it in 2023.  "
        },
        {
            "text": "Following an announcement by Minister Hardy at the UN Ocean Conference in June 2025 that the UK would introduce legislation by the end of the year, we introduced the BBNJ Bill in Parliament in September to turn that commitment into action.  "
        },
        {
            "text": "We're pleased that the Bill has received Royal Assent, making it an Act and marking a significant milestone in our journey towards ratification. "
        },
        {
            "text": "What happens next? "
        },
        {
            "text": "Passing of the Act is an essential step, but it's not the final one. To ratify the BBNJ Agreement, we need to put in place secondary legislation that will ensure the UK can meet some of its obligations under the treaty. This includes amending the current marine licensing regime to ensure compliance with BBNJ Environmental Impact Assessment obligations. "
        },
        {
            "text": "This process takes time, but we're committed to getting it right. By building a robust legal foundation, we're ensuring the UK can play a meaningful role in protecting the high seas for generations to come.  "
        },
        {
            "text": "The first meeting of the Conference of the Parties must take place before 16 January 2027, and the UK intends to play a leading role at this and subsequent meetings. "
        },
        {
            "text": "Why this matters "
        },
        {
            "text": "The ocean is under pressure from exploitation, climate change and pollution. Marine biodiversity is declining, and with it the ecosystem that billions of people rely upon. "
        },
        {
            "text": "The BBNJ Agreement is a crucial tool in reversing this decline. It will help the UK and the international community meet the target, set out in the Kunming-Montreal Global Biodiversity Framework, to protect 30% of the ocean by 2030. "
        },
        {
            "text": "By progressing this legislation, the UK is demonstrating its commitment to leading on international climate and nature action.  "
        },
        {
            "text": "A healthier ocean benefits both nature and people—and we're determined to play our part in making that a reality. "
        }
    ]
}