{
    "url": "https://educationinspection.blog.gov.uk/2026/02/12/initial-teacher-education-inspections-frequently-asked-questions/",
    "title": "Initial teacher education inspections: frequently asked questions",
    "authors": [
        "Lee Owston, National Director, Education"
    ],
    "categories": [
        "initial teacher education"
    ],
    "pub_date": "2026-02-12T10:00:05+00:00",
    "content": [
        {
            "text": "Since we published the renewed inspection framework on 9 September 2025, we’ve put on lots of online and face-to-face engagement with initial teacher education (ITE) providers to answer your questions. We’re publishing the most frequently asked questions below, so you can see all the answers in one place."
        },
        {
            "text": "We’ll regularly update this as we continue to inspect with our renewed approach, so do bookmark it and check back in future."
        },
        {
            "text": "If you want to watch any of our webinars, you can find them on our YouTube playlist."
        },
        {
            "heading": 2,
            "text": "1. When will my ITE provision be inspected?"
        },
        {
            "text": "When your provision will be inspected depends on a number of factors, including our risk assessment process and the information that you send us annually."
        },
        {
            "text": "We’ve published a video on inspection timings for ITE providers to explain when your provision will be inspected:"
        },
        {
            "text": "ITE inspections restarted in January 2026 and run on a 4-year cycle. As an ITE provider, you should expect to receive an inspection during this 4-year period. We use our risk assessment process to determine the timing of inspections."
        },
        {
            "text": "If you’re a newly accredited provider of ITE for qualified teacher status (QTS), you should normally expect your first inspection in the second year of offering ITE to trainees. At this point, we normally inspect all the ITE programmes that you offer, including any new phases that you may have introduced in your second year of operation."
        },
        {
            "text": "If you’re newly in scope for inspections of ITE for further education (FE) and skills, you could receive your first ITE inspection at any point during the 4-year inspection cycle."
        },
        {
            "heading": 2,
            "text": "2. Who can take on the role of nominee and what do they do? "
        },
        {
            "text": "The nominee is a new role on all ITE inspections. We explain the role of the nominee in our inspection guidance."
        },
        {
            "text": "If you have multiple phases in your ITE provision, you may decide to have a nominee for each phase as well as your overall nominee."
        },
        {
            "text": "When you’ve decided who might be the nominee(s) for your provision, you can watch our nominee training video:"
        },
        {
            "heading": 2,
            "text": "3. What happens on the initial planning call?"
        },
        {
            "text": "The initial planning call is important to help the lead inspector understand the structure, organisation and context of your ITE provision, as well as its strengths, successes and priorities."
        },
        {
            "text": "It’s helpful if you have key leaders and nominee(s) present for the planning call. To ensure we build professional working relationships from the very start of an inspection, we always offer to do the planning call as a video call. This worked particularly well on our pilot inspections."
        },
        {
            "text": "Our inspection information for ITE explains how we notify you of an inspection and what information we’ll need for the planning call. See the sections:"
        },
        {
            "text": "Our ITE inspection operating guide for inspectors sets out what inspectors need to do when it comes to the planning call."
        },
        {
            "heading": 2,
            "text": "4. What data will we need?"
        },
        {
            "text": "The  inspection information for ITE sets out what information the inspector may ask for. You don’t need to prepare your data and information in any specific format. Inspectors will look at it in whatever format you already use."
        },
        {
            "text": "They’ll use data linked to the award of QTS or examination boards to identify the proportion of trainees who achieve their qualification and professional status over time. We don’t expect you to show how your data compares to other providers’."
        },
        {
            "text": "Inspectors will include questions on attendance during their inspection activities and will consider how your leaders and staff ensure that trainees are able to gain the necessary knowledge and skills to teach their phase and subject(s). This will include the teaching practice that trainees complete."
        },
        {
            "text": "Inspectors will talk to your relevant leaders and staff about how they use achievement and attendance data and the support they offer to trainees. "
        },
        {
            "heading": 2,
            "text": "5. How do you inspect apprenticeships on ITE inspections?"
        },
        {
            "text": "Our inspections cover the level 6 teacher apprenticeship standard and the level 5 learning and skills apprenticeship standard only. Inspectors will look at your apprenticeship provision as part of the phase the apprentices are preparing to teach in. For example, if you have an apprentice studying the level 6 teacher standard and working in a primary school, we consider that to be part of the primary phase.As these particular apprenticeships are routes into teaching, the inspection activities will be the same as for any other ITE provision.Compliance, including safeguarding, includes an assessment of whether the provision meets the principles and requirements of an apprenticeship."
        },
        {
            "text": "If you introduce apprenticeship provision to your existing ITE provision, we will not treat it as new provision."
        },
        {
            "heading": 2,
            "text": "6. Which providers and programmes do you inspect?"
        },
        {
            "text": "We inspect ITE provision in a range of provider types, including:"
        },
        {
            "text": "The programmes we inspect vary by phase of ITE."
        },
        {
            "text": "In early years, primary and secondary phase inspections we inspect all teacher training that leads to the award of early years teacher status (EYTS) or QTS. Typical routes and qualifications include:"
        },
        {
            "text": "In FE and skills phase inspections, we inspect any of the following programmes in which the training is publicly funded:"
        },
        {
            "text": "When ITE for FE and skills provision is delivered in a partnership, the nature of the partnership determines which partner we inspect:"
        },
        {
            "heading": 2,
            "text": "7. How do changes in partnership arrangements (such as a training partner being re-accredited) affect inspection?"
        },
        {
            "text": "In the primary and secondary phases of ITE, we inspect the accredited provider. As part of that inspection, inspectors will visit at least some of its training partners."
        },
        {
            "text": "Only the provision and trainees that the accredited provider is accountable for are in scope. Any programmes that the training partners were previously accountable for in their own right are not in scope."
        },
        {
            "text": "When a training partner (or lead partner) is re-accredited, its provision and trainees will be in scope for the inspection of whichever provider is accountable for them."
        },
        {
            "heading": 2,
            "text": "8. How are you looking at inclusion?"
        },
        {
            "text": "There are 2 aspects to inclusion within the ITE toolkit."
        },
        {
            "text": "When evaluating the ‘curriculum, teaching and training’ evaluation area, inspectors will want to know how well prepared your trainees are to meet the needs of all pupils and learners, including those who are disadvantaged, those with special educational needs and/or disabilities (SEND), those who are known (or previously known) to children’s social care, and those who may face other barriers to their learning and/or wellbeing. This is a fundamental part of any ITE curriculum and is therefore an ‘expected standard’. Adaptive teaching is also a key aspect of one of the grading standards."
        },
        {
            "text": "Inspectors will also want to find out about the support you provide for trainees to reduce any barriers they may face to their own learning and/or wellbeing. This is the focus of the ‘inclusion’ evaluation area for ITE. Inspectors will consider how your leaders and staff:"
        },
        {
            "heading": 2,
            "text": "9. How do you look at what providers are doing to reduce barriers to learning?"
        },
        {
            "text": "In the ‘inclusion’ evaluation area and throughout the ITE toolkit, we refer to trainees with identified SEND and those who may face other barriers to their learning and/or wellbeing. Inspectors will ask questions about how leaders and provider staff create a culture in which trainees feel able to disclose their needs and/or barriers. They will also use case sampling as a way of gathering evidence."
        },
        {
            "text": "Inspectors will consider the context of your provision when they ask questions about these trainees. For example, in a small SCITT, one individual may hold and manage all the information about trainees, whereas in a large HEI different teams or departments may be responsible for supporting trainees."
        },
        {
            "text": "There is no legal obligation for trainees to disclose any needs they might have, or to share any barriers to their learning and/or wellbeing. Therefore, we don’t specify how you should gather or record that information."
        }
    ]
}