{
    "url": "https://educationhub.blog.gov.uk/2026/02/national-apprenticeship-week-2026-exploring-t-levels/",
    "title": "National Apprenticeship Week 2026 – Exploring T Levels",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Apprenticeships",
        "T Levels"
    ],
    "pub_date": "2026-02-12T00:01:00+00:00",
    "content": [
        {
            "text": "National Apprenticeship Week 2026 is in full swing and today is T Level Thursday – a chance to explore what T Levels can offer you."
        },
        {
            "text": "T Levels have been designed in partnership with leading businesses to offer recognised qualifications providing an excellent route into employment, apprenticeships and further study."
        },
        {
            "text": "They provide rewarding opportunities to help support career aspirations with many T Level students staying with their employer after completing their course."
        },
        {
            "heading": 2,
            "text": "Meet Ryan Skitt - T Level Student of the Year 2025"
        },
        {
            "text": "Ryan Skitt, 17, who studied a T Level in Design, Surveying and Planning at Thomas Telford University Technical College, won The Gatsby T Level Student of the Year Award recently at the National Apprenticeship and Skills Awards. He is now working at Baily Garner LLP after his successful industry placement at the architect firm."
        },
        {
            "text": "Ryan said:"
        },
        {
            "text": "\"Winning T Level Student of the Year is an incredible honour. The T Level has given me so many opportunities that I never imagined possible, such as introducing new technology at, Baily Garner. The T Level suited me perfectly; I'm now working alongside experienced architects and technicians."
        },
        {
            "text": "“I highly recommend T Levels to other young people – they offer a real pathway into your chosen industry with hands-on experience that builds genuine skills. If my journey can inspire other students to explore T Levels and see what they can achieve, then that means everything to me.\""
        },
        {
            "heading": 3,
            "text": "What are T Levels?"
        },
        {
            "text": "T Levels are a fantastic opportunity to help young people develop technical and practical skills for the workplace."
        },
        {
            "text": "They are two-year technical courses for 16 to 19 year olds, equivalent to three A Levels, and combine classroom learning with a substantial industry placement. They have been designed with leading businesses and employers to give students the knowledge and skills they need."
        },
        {
            "text": "While apprenticeships are jobs with training, T Levels are primarily education-based with a work placement element. "
        },
        {
            "heading": 2,
            "text": "Why choose a T Level?"
        },
        {
            "text": "T Levels combine learning and on-the-job training, providing excellent preparation for higher or degree apprenticeships, or for direct entry into skilled employment. They give young people a strong foundation of technical knowledge and practical workplace experience. "
        },
        {
            "text": "Students will spend 80% of their time in the classroom, gaining the knowledge and skills that employers need. The remaining 20% is spent on a 45-day industry placement with an employer to develop and put their skills into action."
        },
        {
            "text": "What T Level courses are available?"
        },
        {
            "text": "There are now 21 T Level subjects to choose from. A new marketing T Level was launched in September 2025 alongside other subjects, ranging from agriculture to craft and design, and engineering to science."
        },
        {
            "heading": 2,
            "text": "How can I find out more?"
        },
        {
            "text": "Find out more information on the T Levels website if you are a student, parent or carer."
        },
        {
            "text": "Visit the Skills for Careers website to find out more details about apprenticeships and other skills programmes."
        },
        {
            "text": "Stay up to date"
        },
        {
            "text": "Follow #NAW2026 on social media throughout National Apprenticeship Week, and follow T Levels LinkedIn and Apprenticeships and Skills LinkedIn to stay up to date."
        }
    ]
}