{
    "url": "https://nda.blog.gov.uk/our-investment-in-future-talent-how-apprenticeships-create-opportunity-capability-and-resilience-for-our-sector-and-communities/",
    "title": "Our investment in future talent: how apprenticeships create opportunity, capability, and resilience for our sector and communities",
    "authors": [
        "Nic Westcott"
    ],
    "categories": [
        "Early careers",
        "Recruitment",
        "Skills"
    ],
    "pub_date": "2026-02-12T12:30:00+00:00",
    "content": [
        {
            "text": "National Apprenticeship Week is always a highlight in our calendar. It gives us a moment to pause, take stock, and celebrate something we’re incredibly proud of: the generations of young people who choose to start their careers with us."
        },
        {
            "text": "As the UK’s nuclear sector continues to grow, developing a future skills pipeline has never been more important."
        },
        {
            "text": "At Sellafield and across the Nuclear Decommissioning Authority (NDA) group, we see this as both a responsibility and a privilege. Investing in early careers helps us meet our workforce needs. But it’s so much more than that. It’s also a national investment, building capability and opportunity for the entire industry, and for the communities we’re part of."
        },
        {
            "text": "Last year alone, almost 200 apprentices joined us. These are all individuals bringing fresh ideas, new perspectives, and real energy into our mission."
        },
        {
            "text": "Our new apprentices are already helping shape the future of Sellafield. You’ll find them in design engineering, health physics, nuclear operations, business administration, and electrical and mechanical roles, to name a few."
        },
        {
            "text": "They join hundreds of existing apprentices and work in teams with colleagues who came through these programmes before them. Sellafield apprentices, past and present, make a significant impact across our organisation every day."
        },
        {
            "text": "While we’re often seen as a highly technical, engineering‑focused site - which we are - the opportunities go far wider. We’re home to project managers, cyber specialists, commercial professionals, environmental scientists, data experts, designers, and many others. If someone has a passion and a curiosity to learn, there’s almost certainly a place for them at Sellafield."
        },
        {
            "text": "Our approach to skills is deliberately broad and inclusive. We start supporting young people long before they consider applying to us, engaging with them at every stage of their education through our outreach work. Over the last financial year:"
        },
        {
            "text": "But our support isn’t only about programmes – it’s about long‑term investment in the region. Over the years, we’ve helped fund and develop facilities and initiatives that are now central to raising aspirations in West Cumbria. These include:"
        },
        {
            "text": "Some might call this outreach. I’d say it’s bigger than that. It’s infrastructure. It’s a shared commitment to building capability, diversity, and resilience into our future workforce and into our communities."
        },
        {
            "text": "The number and type of roles we need changes, depending on what our mission requires, but our commitment to developing skills never changes. We’re not just filling jobs. We’re helping shape lives, strengthen our region, and secure the long‑term success of both Sellafield, the NDA group, and the nuclear sector."
        },
        {
            "text": "And for us, that’s something genuinely worth celebrating - this week, and every week."
        }
    ]
}