{
    "url": "https://publicguardian.blog.gov.uk/2026/02/12/power-of-attorney-stories-sreeparna/",
    "title": "Power of Attorney Stories: Sreeparna",
    "authors": [
        "dquill"
    ],
    "categories": [
        "Attorneys",
        "Future planning",
        "lasting power of attorney",
        "LPA",
        "YourVoiceYourDecision"
    ],
    "pub_date": "2026-02-12T15:49:33+00:00",
    "content": [
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "text": "A lasting power of attorney, also known as an LPA, is a legal document. It allows you to nominate someone you trust to step in and make decisions about your health and welfare and property and finance if you lack mental capacity to do so. "
        },
        {
            "text": "Sree from Surrey is passionate about community outreach and development in her local area. She has worked across the charity sector, local government and now works in the NHS helping people access vital services. She cares for her mother who has dementia and life-limiting illnesses and is her attorney. Through both her professional experience and her personal journey as a carer, Sree has become a passionate advocate for LPAs. "
        },
        {
            "text": "Here, she shares why having an LPA in place has given her irreplaceable peace of mind."
        },
        {
            "text": "I first came across LPAs years ago when I was working as a dementia service manager. The Citizens Advice Bureau would send advisers to give talks to our team, and I picked up some basic training about powers of attorney and how it helps families. Now, in my current role in community development and engagement, I actively encourage community groups to consider making LPAs because I've seen first-hand just how much difference they make. "
        },
        {
            "text": "When my mother's dementia started getting worse, everything I'd learned about LPAs suddenly became very personal. I knew we needed to act quickly, whilst she could still understand what we were doing and be part of the decision. That window of time is so precious and so easily missed. "
        },
        {
            "text": "Now my mother lives with me and my husband. She's wheelchair-bound and receiving palliative care, and I'm her primary carer. Being her attorney means I can make decisions I know are right for her, without barriers or delays. It's given me the ability to truly care for her in the way she deserves. "
        },
        {
            "text": "Despite everything, I try to create moments of peace for her. I love gardening, and I've set up a garden window feature in the kitchen so she can enjoy the view. Small things, but they matter. "
        },
        {
            "text": "In my outreach work, I meet many people who've moved to the UK later in life and aren't familiar with these systems. Sometimes there's wariness or reluctance. But I can't stress enough that the peace of mind an LPA provides far outweighs any hesitation. Without one, the processes you'd have to go through to legally make decisions for someone are lengthy, stressful and expensive. "
        },
        {
            "text": "I know so many people who are in far worse positions because they didn't plan ahead. Watching families struggle through more complicated routes when it's already such a difficult time, it's heartbreaking and completely avoidable. "
        },
        {
            "text": "I've encouraged many friends to make LPAs, and I'm now in the process of making one myself, with my husband as my attorney. Because you just never know what's around the corner. "
        },
        {
            "text": "If you're thinking about an LPA but feel unsure, start by reading the guidance on GOV.UK, it explains everything clearly and is easy to navigate. When I helped my mother make her LPA, the Office of the Public Guardian were genuinely helpful throughout. "
        },
        {
            "text": "Don't wait. Make an LPA whilst you can, whilst conversations can still happen, whilst everyone understands what's being agreed. It's one of the most important things you can do for the people you love and for yourself.” "
        },
        {
            "text": "Sree and her mother are one of the many families across England and Wales that have made an LPA. "
        },
        {
            "text": "It's never too early to talk about lasting powers of attorney with someone you trust. Start a conversation today. "
        },
        {
            "text": "Find out more at  https://powerofattorney.campaign.gov.uk "
        },
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "heading": 1,
            "text": "Straeon Atwrneiaeth: Sreeparna"
        },
        {
            "text": "Dogfen gyfreithiol yw Atwrneiaeth Arhosol (sydd hefyd yn cael ei galw’n LPA). Mae’n eich galluogi i enwebu rhywun rydych chi’n ymddiried ynddo i gamu i mewn a gwneud penderfyniadau am eich iechyd a’ch lles, eich eiddo a’ch materion ariannol, os nad oes gennych chi’r galluedd meddyliol i wneud hynny. "
        },
        {
            "text": "Mae Sree o Surrey yn frwd dros ddatblygiad ac allgymorth cymunedol yn ei hardal leol. Mae hi wedi gweithio ar draws y sector elusennol a llywodraeth leol ac mae hi bellach yn gweithio yn y GIG yn helpu pobl i gael gafael ar wasanaethau hanfodol. Mae hi’n gofalu am ei mam sydd â dementia ac afiechydon sy’n cyfyngu ar fywyd, a hi yw atwrnai ei mam. Drwy ei phrofiad proffesiynol a’i thaith bersonol fel gofalwr, mae Sree wedi dod yn eiriolwr brwd dros LPAs. "
        },
        {
            "text": "Yma, mae hi’n rhannu pam bod cael LPA mewn grym wedi rhoi tawelwch meddwl amhrisiadwy iddi. "
        },
        {
            "text": "Fe ddes i ar draws LPAs am y tro cyntaf flynyddoedd yn ôl pan oeddwn i’n gweithio fel rheolwr gwasanaeth dementia. Byddai Cyngor ar Bopeth yn anfon cynghorwyr i sgwrsio â’n tîm ni, ac fe gefais i rywfaint o hyfforddiant sylfaenol ar atwrneiaeth a sut mae’n helpu teuluoedd. Nawr, yn fy swydd bresennol ym maes datblygu cymunedol ac ymgysylltu, rydw i’n annog grwpiau cymunedol i ystyried gwneud LPA oherwydd fy mod i wedi gweld yn uniongyrchol faint o wahaniaeth maen nhw’n ei wneud. "
        },
        {
            "text": "Pan ddechreuodd dementia fy mam waethygu, daeth popeth roeddwn i wedi’i ddysgu am LPAs yn berthnasol iawn i mi mwyaf sydyn. Roeddwn i’n gwybod bod angen i ni weithredu’n gyflym, tra oedd hi’n dal i allu deall beth roedden ni’n ei wneud a bod yn rhan o’r penderfyniad. Mae’r cyfnod hwnnw mor werthfawr ac mor hawdd ei golli. "
        },
        {
            "text": "Mae fy mam yn byw gyda fi a fy ngŵr erbyn hyn. Mae hi mewn cadair olwyn ac yn cael gofal lliniarol, a fi yw ei phrif ofalwr. Oherwydd mai fi yw atwrnai fy mam, rydw i’n gallu gwneud penderfyniadau sy’n iawn iddi hi, heb rwystrau nac oedi. Mae wedi fy ngalluogi i ofalu amdani’n iawn, yn y ffordd mae hi’n ei haeddu. "
        },
        {
            "text": "Er gwaethaf popeth, rydw i’n ceisio creu cyfnodau o heddwch iddi. Rydw i wrth fy modd yn garddio, ac rydw i wedi creu ffenestr arddio yn y gegin er mwyn iddi allu mwynhau’r olygfa. Pethau bach ydyn nhw, ond maen nhw’n bwysig. "
        },
        {
            "text": "Yn fy ngwaith allgymorth, rydw i’n cwrdd â llawer o bobl sydd wedi symud i’r Deyrnas Unedig yn nes ymlaen yn eu bywydau, ac sydd ddim yn gyfarwydd â’r systemau hyn. Mae pobl weithiau’n gyndyn neu’n amheus ohonynt. Ond mae’r tawelwch meddwl y mae LPA yn ei roi i chi yn drech nag unrhyw ansicrwydd – alla i ddim pwysleisio hynny ddigon. Heb un, mae’r prosesau y byddai’n rhaid i chi eu dilyn i wneud penderfyniadau cyfreithiol ar ran rhywun yn hir, yn straen ac yn ddrud. "
        },
        {
            "text": "Rydw i’n adnabod cymaint o bobl sydd mewn sefyllfaoedd llawer gwaeth am na wnaethon nhw gynllunio ymlaen llaw. Mae’n dorcalonnus gwylio teuluoedd yn stryffaglu drwy lwybrau mwy cymhleth mewn cyfnod sydd eisoes mor anodd, pan bo modd ei osgoi’n llwyr. "
        },
        {
            "text": "Rydw i wedi annog llawer o fy ffrindiau i wneud LPA, ac rydw i bellach yn y broses o wneud un fy hun, gyda fy ngŵr yn atwrnai i mi. Oherwydd dydych chi byth yn gwybod beth sydd ar y gorwel. "
        },
        {
            "text": " Os ydych chi’n ystyried gwneud atwrneiaeth arhosol ond yn teimlo’n ansicr, dechreuwch drwy ddarllen y canllawiau ar GOV.UK, maen nhw’n egluro popeth yn glir ac maen nhw’n hawdd eu defnyddio. Pan oeddwn i’n helpu fy mam i wneud ei LPA, roedd Swyddfa'r Gwarcheidwad Cyhoeddus yn gymwynasgar iawn drwyddi draw. "
        },
        {
            "text": "Peidiwch ag oedi. Gwnewch atwrneiaeth arhosol tra gallwch chi, tra bo’r sgyrsiau’n dal yn gallu digwydd, tra bo pawb yn deall yr hyn rydych chi’n cytuno arno. Mae’n un o’r pethau pwysicaf y gallwch chi ei wneud i’r bobl rydych chi’n eu caru ac i chi eich hun.” "
        },
        {
            "text": "Mae Sree a’i mam yn un o’r llu o deuluoedd ledled Cymru a Lloegr sydd wedi gwneud atwrneiaeth arhosol. "
        },
        {
            "text": "Dydy hi byth yn rhy gynnar i siarad am atwrneiaeth arhosol gyda rhywun rydych chi’n ymddiried ynddo. Dechreuwch sgwrs heddiw. "
        },
        {
            "text": "Mae rhagor o wybodaeth ar gael yn  https://powerofattorney.campaign.gov.uky/home-page/"
        }
    ]
}