{
    "url": "https://ipo.blog.gov.uk/2026/02/12/what-happens-when-your-product-goes-viral-lessons-from-my-salah-mat/",
    "title": "What happens when your product goes viral? Lessons from My Salah Mat",
    "authors": [
        "Kelsey Jones"
    ],
    "categories": [
        "Business",
        "Copyright",
        "Design",
        "Enforcement",
        "Innovation",
        "Patents",
        "Trade marks"
    ],
    "pub_date": "2026-02-12T10:15:27+00:00",
    "content": [
        {
            "text": "Going viral is every entrepreneur’s dream… until it isn’t."
        },
        {
            "text": "Just ask Newport‑based product designer Kamal Ali, founder of My Salah Mat, the world’s first interactive prayer mat for children. His product took off so quickly online that it attracted not only global customers, but also counterfeiters eager to ride on the back of his innovation."
        },
        {
            "text": "Kamal’s story shows why building intellectual property (IP) into your business strategy early is essential."
        },
        {
            "heading": 3,
            "text": "From a spark of inspiration to a global hit"
        },
        {
            "text": "The idea for My Salah Mat began in 2017, when Kamal noticed his young son struggling to follow the different stages of prayer. As a product design graduate and former Design Technology teacher, he saw an opportunity to build something new. My Salah Mat is an interactive mat designed to help children learn to pray in an engaging, accessible way. And from day one, he protected it."
        },
        {
            "text": "Kamal registered a patent, trade mark and design rights to safeguard his idea, ensuring his business was built on a secure foundation."
        },
        {
            "heading": 3,
            "text": "When viral success attracts counterfeits"
        },
        {
            "text": "In 2019, everything changed. A few viral social media posts, particularly in the Middle East, sent My Salah Mat’s sales soaring. But where there’s visibility, counterfeits often follow. Soon, parents were contacting Kamal with worrying reports that their mats weren’t working correctly."
        },
        {
            "text": "The problem? They weren’t his mats at all - they were fakes."
        },
        {
            "text": "Determined to protect both his customers and his reputation, Kamal replaced every counterfeit product free of charge. As he put it:"
        },
        {
            "text": "For a small business, this kind of customer‑centric approach is admirable but it’s also costly. This is where having IP protection already in place becomes invaluable."
        },
        {
            "heading": 3,
            "text": "Fighting back: How IP enabled Kamal to stay in control"
        },
        {
            "text": "Armed with his registered rights, Kamal began actively fighting infringement. He:"
        },
        {
            "text": "His work gained momentum. A video he produced about counterfeits led to an interview on the Islam Channel, reaching thousands and placing IP protection at the centre of the conversation."
        },
        {
            "heading": 3,
            "text": "Representing himself… and winning!"
        },
        {
            "text": "Earlier this year, Kamal took one of his biggest steps yet: he represented himself in a copyright infringement case and won."
        },
        {
            "text": "This saved his business thousands of pounds in legal fees and demonstrated the power of understanding your own IP rights."
        },
        {
            "text": "Not every entrepreneur will go to court alone (nor should they) but Kamal’s story shows that being IP‑savvy offers control at critical moments."
        },
        {
            "heading": 3,
            "text": "The reality of going viral: opportunity and risk"
        },
        {
            "text": "When products spread quickly online, the opportunities are huge - global reach, new audiences and major commercial uplift. But the risks rise just as quickly:"
        },
        {
            "text": "My Salah Mat survived because its founder invested in IP protection long before he needed to rely on it."
        },
        {
            "text": "And when counterfeiters struck, Kamal didn’t just react - he used his IP rights to take action."
        },
        {
            "heading": 3,
            "text": "Why IP needs to scale up with your success"
        },
        {
            "text": "Kamal’s story is more than a case study, it’s a reminder of what future‑proofing can do."
        }
    ]
}