{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2022/01/04/break-in-the-new-year-with-a-brilliant-b-sen-speaker-series-talk/",
    "title": "Break in the New Year with a brilliant B-SEN Speaker Series talk!",
    "authors": [
        "Selina Khan"
    ],
    "categories": [
        "GSE Opportunities",
        "Guest Blog"
    ],
    "pub_date": "2022-01-04T15:12:43+00:00",
    "content": [
        {
            "text": "‘Horizon Europe - the benefits to UK science and research one year on from EU Exit’ - Louise Mothersole "
        },
        {
            "text": "To break in the new year with style and to mark one year on from EU Exit (cue cheers or boos depending on your proclivities), the Speaker Series is bringing us another humdinger. Join us in warmly welcoming Louise Mothersole, and tune in to learn all about our association to Horizon Europe, and the state of UK science and research one year after transitioning out of the EU. The talk will be held on MS Teams on Thursday the 13th of January, and will run from 2pm to 3pm."
        },
        {
            "text": "Louise Mothersole is the Horizon Europe UK National Contact Point for Mobility and Global Innovation Lead for Transport at Innovate UK. Horizon Europe is a research and innovation framework programme and has an, EU allocated budget, of €95.5m which is used to fund projects decided by open competition. The UK has decided to associate to Horizon Europe. Association means that UK will contribute additional funding to the Horizon Europe budget and, in return UK researchers and innovators can access the programme on almost the same conditions as those from EU member states. The benefits of participation go far deeper than just accessing funding for projects and this presentation will demonstrate through some practical examples the added value of this truly international, collaborative programme."
        },
        {
            "text": "As before, we are hosting the series virtually via MS Teams, and we urge you to indicate your attendance early for this talk, via the calendar invite. This promises to be a cracker, so come one and all! (Perhaps it’s too late for another Christmas pun, but hey ho, ho, ho...)"
        },
        {
            "text": "Hope to see you there!"
        },
        {
            "text": "BEIS Science & Engineering Network Team"
        },
        {
            "text": "MS Teams sign-up link: https://bit.ly/3dKjiWB (alternatively, email Oscar at oscar.williams@beis.gov.uk to get a calendar link)"
        }
    ]
}