{
    "url": "https://insidedio.blog.gov.uk/2022/01/04/extreme-e-an-electrifying-race-weekend-at-bovington-training-area/",
    "title": "Extreme E: An electrifying race weekend at Bovington Training Area",
    "authors": [
        "Lt Col (Retd) Richard James"
    ],
    "categories": [
        "British Army",
        "Defence Training Estate (DTE)",
        "Sustainability"
    ],
    "pub_date": "2022-01-04T15:58:14+00:00",
    "content": [
        {
            "text": "Over the weekend of 18-19 December 2021, we had the exciting task of hosting the final race of the inaugural season of Extreme E at Bovington Training Area (BTA) in Dorset."
        },
        {
            "text": "Extreme E is an international off-road, electric racing series that is governed by the FIA and features specialised electric SUVs, aiming to highlight climate change issues and promote sustainable energy alternatives. Some of the biggest names in motorsport are involved: teams owned by Sir Lewis Hamilton and Nico Rosberg are represented, as well as former Formula One World Champion Jenson Button MBE, who both owns and drives with his JBXE team."
        },
        {
            "text": "The race season saw the drivers compete in locations as diverse as Saudi Arabia, Senegal and Greenland before descending on Bovington Training Area, on Dorset’s Jurassic Coast, for the ‘Jurrassic X-Prix’ season finale."
        },
        {
            "text": "Bovington has been used for armoured vehicle training since the first tanks were developed during World War One [Copyright: The Tank Museum]BTA is best known as the home of the British Army’s Armour Centre, and has been used for training soldiers to drive armoured vehicles since the first tanks were developed during the First World War. A fitting location, then, for testing the limits of Extreme E’s electric racing SUVs!"
        },
        {
            "heading": 2,
            "text": "How we supported the event"
        },
        {
            "text": "Following discussions with Extreme E, it became clear that some alterations to the tank course at Bovington would be needed to transform it into an ideal racetrack."
        },
        {
            "text": "Not only were the deep ruts created by tanks too deep for the racing cars, there was also the high bank that we call the ‘knife edge’, which tanks have to climb up and then go down very steeply. This needed reducing in height by about two metres, with an extension to the landing area so that the Extreme E vehicles would be able to perform impressive jumps without being destroyed!"
        },
        {
            "text": "A pair of Extreme E SUVs take on the Bovington race course [Copyright Tim Jalland]We also had to create a large area of flat land, which required extensive groundwork. This was carried out by a local contractor, Andrews, with assistance from the Royal Engineers as part of a training exercise. The work will leave a legacy of improved training facilities for future military users of BTA, including significant track repairs and a location for additional bridging and low loader training."
        },
        {
            "text": "A close working relationship was achieved between DIO Defence Training Estate staff and Extreme E event organisers, which was central to the event’s success. A wide range of support was provided, from advice over routes to meetings with the Ministry of Defence Police, local police, Dorset Highways and Armour Centre staff to ensure that preparations for the race weekend didn’t impact on military training."
        },
        {
            "heading": 2,
            "text": "Conservation and biodiversity at BTA"
        },
        {
            "text": "A key reason why Bovington was chosen by Extreme E was that it’s an ideal location for highlighting biodiversity issues in the UK."
        },
        {
            "text": "BTA includes 345 hectares of land classified as a Site of Special Scientific Interest (SSSI) and is one of the best examples of how military training can create a legacy that benefits wildlife for many decades. It’s home to a variety of rare wildlife including the woodlark, Dartford warbler, smooth snake, and sand lizard – which thrive in the areas of loose sand dug up by heavy-tracked vehicles."
        },
        {
            "text": "To protect these vital species and maintain the ecology of BTA, we work closely with the Amphibian and Reptile Conservation Trust, which leases part of the site and organises conservation grazing and other land management activities such as scrub clearance across those areas."
        },
        {
            "text": "DIO Defence Training Estate personnel played a vital role in helping to set up and safely run the event [Copyright Tim Jalland]The Extreme E event had a huge emphasis on sustainability. The cars were transported to Dorset by boat, and to reduce the environmental footprint of the event there were no spectators; instead, the race weekend could be streamed or watched live on TV. What’s more, as part of its Legacy programme, Extreme E is actively supporting an ongoing National Trust project to reintroduce beavers to nearby Studland."
        },
        {
            "text": "A big thank you to all involved in the making of what was a thrilling weekend, which provided an important platform to highlight the focus shared by DIO, the British Army and Extreme E on sustainability and working towards a lower carbon future."
        }
    ]
}