{
    "url": "https://cddo.blog.gov.uk/2024/09/18/how-were-continuously-improving-the-digital-and-data-capability-framework/",
    "title": "How we’re continuously improving the Digital and Data Capability Framework",
    "authors": [
        "Jodie Keens, Product Manager, CDDO",
        "Olivia Helliwell, Senior Content Designer, CDDO"
    ],
    "categories": [
        "CDDO",
        "Digital transformation",
        "Government Digital and Data",
        "Uncategorized"
    ],
    "pub_date": "2024-09-18T14:13:13+01:00",
    "content": [
        {
            "text": "One year ago, the Government Digital and Data Profession Capability Framework returned to public beta with a new design, structure and functionality to better meet the needs of its users. Since then, we have taken a continuous improvement at pace approach to ensure the framework gives users a clear and accurate understanding of digital and data roles and skills in government. This is critical to support colleagues exploring and assessing their career development, departments needing to recruit, and members of the public wanting to apply for roles in government."
        },
        {
            "heading": 3,
            "text": "Making changes to the framework"
        },
        {
            "text": "The Capability Framework publishes changes every 3 months. These changes are made to:"
        },
        {
            "text": "The latest update was in August where we made changes affecting the content of 17 roles and 20 skills, including:"
        },
        {
            "text": "These changes have been extensively reviewed and, where applicable and possible, tested with users and subject matter experts."
        },
        {
            "text": "In total, since October 2023, we have made changes affecting the content of 33 roles, including 5 new roles. You can find details of all updates on the Capability Framework homepage."
        },
        {
            "heading": 3,
            "text": "How we make change happen"
        },
        {
            "text": "Over the past year, we have experimented with more efficient ways of developing the framework to ensure that we:"
        },
        {
            "text": "Alongside supporting digital and data subject matter experts who have proposed changes to the framework, we are developing cross-government working communities. These communities help us proactively iterate content, instead of waiting for a problem or challenge to spark the need for change."
        },
        {
            "text": "Simultaneously, through critical reviews by content designers, we are making content changes to skills and roles to make the framework more accessible, inclusive and user-focussed. This includes changes to:"
        },
        {
            "text": "Using this blended approach helps us ensure the framework better meets the needs of all users. "
        },
        {
            "text": "An in-person cross-government working group meeting to the Government Digital and Data Profession Capability Framework."
        },
        {
            "heading": 3,
            "text": "Our tailored approach"
        },
        {
            "text": "As outlined above, we’ve extensively collaborated with experts from across government to create 2 new roles, analytics engineer and machine learning engineer."
        },
        {
            "heading": 4,
            "text": "Developing the analytics engineer role"
        },
        {
            "text": "The need for an analytics engineer role was identified by the Ministry of Justice (MoJ). They established a distinction between analytics engineers and data engineers, and were already using and recruiting both roles."
        },
        {
            "text": "They recognised that by developing an analytics engineer role on the framework, it would:"
        },
        {
            "text": "Following a successful proposal by MoJ at the Capability Framework Design Council (CFDC), we formed a working group of subject matter experts from different departments. The group was supported through the role drafting process by a content designer from the Capability Framework team. "
        },
        {
            "text": "Together, the group determined the skills, skill levels and role levels required, with a focus on ensuring clarity between the analytics engineer role and the data engineer role. Following the Capability Framework style guide, the group made conscious design decisions that ensured the new role definition was accurate, clear and easily understood."
        },
        {
            "text": "Anis Khan, the interim Deputy Director of Data Science, AI, Data and Analytics Engineering in the Data Directorate at the MoJ, worked with us to develop the role. He said, “analytics engineers perform an important role in the data value chain. Having this role represented within the framework recognises the value of having a joined-up approach between digital, data and analytical functions across government. Promoting this approach is an important step in improving operational effectiveness and providing a better service for all users of data.\""
        },
        {
            "heading": 4,
            "text": "Developing the machine learning engineer role"
        },
        {
            "text": "The machine learning engineer role had a different starting point. As an emergent area experiencing a lot of attention, we wanted to explore which, if any, skills or roles related to artificial intelligence (AI) might need to be added to the framework."
        },
        {
            "text": "We worked with CDDO's Head of AI Skills for Public Sector to understand which AI roles and skills were emerging in government and in the private sector. Following a detailed industry analysis, we interviewed 27 Government Digital and Data professionals working on AI and machine learning services. In total, we worked with 15 departments and organisations. This determined the recommendation to add the role of machine learning engineer to the framework. "
        },
        {
            "text": "The CFDC approved the proposal to add the role, and a working group of machine learning subject matter experts from 6 departments collaborated to draft the role, role levels and choose appropriate skills. To validate the content with a broader audience, we developed a survey and shared a private beta version of the role more widely with other subject matter experts."
        },
        {
            "heading": 3,
            "text": "Continuous improvement needs you"
        },
        {
            "text": "Alongside making continuous improvements to the framework’s content, we are keen to ensure we develop and share the framework in ways that work for our users. We are engaging with cross-government subject matter experts and digital and data capability leads to:"
        },
        {
            "text": "As we look ahead to the next 3 months, we are keen to keep momentum with a proactive approach to making iterative improvement - no matter how small. As a ‘living product’, we encourage colleagues to propose a change to the framework and provide feedback on using the framework to help us evolve."
        }
    ]
}