{
    "url": "https://socialcareinspection.blog.gov.uk/2024/09/18/inspections-of-supported-accommodation-information-for-supported-lodgings-hosts/",
    "title": "Inspections of supported accommodation: information for supported lodgings hosts",
    "authors": [
        "Matthew Brazier"
    ],
    "categories": [
        "inspectors",
        "social care regulation",
        "supported accommodation"
    ],
    "pub_date": "2024-09-18T10:12:34+01:00",
    "content": [
        {
            "text": "From September 2024, Ofsted will inspect registered services that provide supported accommodation for looked after children and care leavers aged 16 or 17."
        },
        {
            "text": "We want to make sure that services are helping young people and keeping them safe. And we want to confirm that the accommodation itself is of the right quality."
        },
        {
            "text": "One of the options for supported accommodation is from private individuals who offer lodgings for young people in their family home. This is known as ‘supported lodgings’ and is typically coordinated by a registered provider that recruits and supports a network of ‘hosts’."
        },
        {
            "text": "In this blog, we’ll explain how we will inspect these services and how this will work for hosts. We’ll also answer some other common questions."
        },
        {
            "text": "You can find out more about supported accommodation and the different categories in the Guide to the Supported Accommodation Regulations."
        },
        {
            "heading": 2,
            "text": "Inspecting providers, not hosts"
        },
        {
            "text": "We will be inspecting the registered providers of supported lodgings schemes, not the individual hosts."
        },
        {
            "text": "But we will be very keen to speak to hosts, and visit a representative sample of hosts and young people where they live. Hearing about your experiences, and understanding the difference you make to children’s lives, will be an important part of our inspections."
        },
        {
            "heading": 2,
            "text": "Speaking to hosts and young people"
        },
        {
            "text": "When we announce an inspection, we will work with the provider to plan a suitable programme of inspection activities."
        },
        {
            "text": "We may arrange, with your agreement, to visit you at home, or we may arrange a phone or video call."
        },
        {
            "text": "We are unlikely to speak to every host, but we will do our best to speak to any host who asks to speak to an inspector."
        },
        {
            "text": "Inspectors always try to meet the young people being supported. As with hosts, this may be in their home, or by phone or video call. Providers should involve you if they are arranging for us to visit young people at your home."
        },
        {
            "text": "We know that you and the young people you support will have busy lives and previous commitments. We will be as flexible as possible about the timing of any visits or calls."
        },
        {
            "heading": 2,
            "text": "Our judgements"
        },
        {
            "text": "We will be making judgements about the provider’s services and the difference they make for children. We will not be making judgements on individual hosts. And we will make sure you will not be identifiable in published reports."
        },
        {
            "text": "Inspections will lead to 1 of 3 outcomes:"
        },
        {
            "heading": 2,
            "text": "How often we will inspect"
        },
        {
            "text": "We will inspect providers at least once in every 3-year window, but (as the 3-outcome model sets out above) we will return to weaker providers more quickly for their next inspection."
        },
        {
            "heading": 2,
            "text": "Informing hosts of inspections"
        },
        {
            "text": "When we announce our inspection (2 working days before we arrive ‘on site’), we will ask the provider to share the lead inspector’s contact details with hosts in case you want to speak to us."
        },
        {
            "text": "At the same time, we ask the providers to share a survey for young people. Please encourage the young people that you support to complete this survey. Please also support them to contact an inspector if they wish to speak to us directly."
        },
        {
            "heading": 2,
            "text": "Understanding the unique nature of supported lodgings"
        },
        {
            "text": "All of our inspectors will be suitably trained and experienced. They will be sensitive to the unique nature of supported lodgings, and to the different types of supported accommodation. We will not expect to see a standard, ‘one-size-fits-all’ approach to meeting the standards. Every young person is different, and we know that the way they are supported to meet their individual needs will be different too."
        },
        {
            "text": "For example, we would not expect supported lodgings providers or hosts to meet any health and safety requirements that go beyond what would be typical in a private home. We would not want supported lodgings – or any supported accommodation, for that matter – to be unnecessarily institutional."
        },
        {
            "text": "Similarly, each inspection will be different, depending on the size and scope of the provider and our lines of enquiry. We will tailor our programme to the provider, and do all we can to make it simple and convenient for hosts and young people."
        },
        {
            "heading": 2,
            "text": "More information"
        },
        {
            "text": "If you have any more questions, please speak to your provider, or email us at EYRegulatoryandSocialCare@ofsted.gov.uk"
        },
        {
            "text": "For more detailed information on our inspections of supported accommodation, please see:"
        }
    ]
}