{
    "url": "https://marinescience.blog.gov.uk/2024/09/18/opportunities-and-challenges-for-the-seaweed-industry-in-the-uk-and-europe/",
    "title": "Emerging from the ‘innovation valley of death’: Opportunities and challenges for the seaweed industry in the UK and Europe.",
    "authors": [
        "Elisa Capuzzo"
    ],
    "categories": [
        "Aquaculture",
        "biodiversity",
        "Climate Change",
        "Education",
        "Field Research",
        "International",
        "Monitoring",
        "Science",
        "Seaweed"
    ],
    "pub_date": "2024-09-18T12:05:00+01:00",
    "content": [
        {
            "text": "Every new industry or technology requires funding to survive, initially for research and development (R&D), developing processes and products, and then to scaling up to a viable business. A lot of the initial research is supported by public funding, which is subsequently replaced by private investments when the technology/product has been established and proven viable and scalable. However, in between these two extremes, there is a phase (known as the ‘innovation valley of death’; Figure 1) when public funds start to reduce (as solutions are being tested and problems identified) and private investments are low (due to uncertainties around the scaling up potential of the industry). When transitioning through this stage, progress slows down and some technologies/industries never come out of this ‘valley’."
        },
        {
            "text": "Figure 1 – The “innovation valley of death” (https://www.ideatovalue.com/inno/nickskillicorn/2021/05/the-innovation-valley-of-death/)"
        },
        {
            "text": "The seaweed aquaculture industry in the UK and Europe is novel but has been growing in the last decade. This is demonstrated by the increase in the number of existing commercial seaweed farms, businesses and available seaweed-based products on the market and growing political support (https://marinescience.blog.gov.uk/2022/05/05/the-developing-uk-seaweed-industry/; Araújo et al. (2021) https://doi.org/10.3389/fmars.2020.626389). To unlock and harness the full potential of the industry, cultivation and production need to be upscaled and relevant markets for food and non-food applications need to be developed (https://oceans-and-fisheries.ec.europa.eu/publications/communication-commission-towards-strong-and-sustainable-eu-algae-sector_en)."
        },
        {
            "text": "However, upscaling is hindered by multiple issues; some of them targeted by recent/current projects in the UK (e.g. Seaweed in East Anglia https://hethelinnovation.com/seaweed-in-east-anglia/; WWF UK’s Seaweed Solutions Programme; Project Madog https://projectmadoc.cymru/home/). Particularly, difficulties remain in obtaining licences for seaweed aquaculture and funding availability for prospective seaweed farmers. Furthermore, lack of standards on farming and products, technological barriers, and the need for social licence to operate and spatial planning are still important issues, common to the UK and Europe."
        },
        {
            "text": "You may be wondering then, can the seaweed industry in the UK/Europe emerge from the ‘innovation valley of death’?"
        },
        {
            "text": "Back in June, I had the pleasure of attending the 13th Seagriculture Conference (https://seagriculture.eu/conference-program-2024/), in Tórshavn, Faroe Islands (Figure 2), with two days of presentations, highlighting the main progress and challenges for the industry in the UK and Europe."
        },
        {
            "text": "Figure 2. Landing in the Faroe Islands; seaweeds in Tórshavn port."
        },
        {
            "text": "The ‘reality check’"
        },
        {
            "text": "Some of the issues and challenges in growing seaweed businesses to scale, highlighted by the presentations, included:"
        },
        {
            "text": "Figure 3. Range of interesting bioactives offered by seaweed, and potential uses versus their economic value (from Torres et al. 2019, https://link.springer.com/article/10.1007/s11157-019-09496-y)"
        },
        {
            "text": "It is not all doom and gloom!"
        },
        {
            "text": "There were also very encouraging highlights:"
        },
        {
            "text": "Returning to my initial question, I think the seaweed industry in the UK/EU is getting better and better equipped to emerge successfully from the “innovation valley of death”."
        },
        {
            "text": "To support this journey Cefas’ work aims to provide the evidence to identify the appropriate siting of farms, to determine the impact of pollution and climate change on seaweed aquaculture, the effects of interactions between farms and the surrounding environment, and the potential role for the seaweed industry to support socio-economic needs while minimizing its environmental footprint."
        }
    ]
}