{
    "url": "https://mhclgmedia.blog.gov.uk/2024/09/18/oxford-street-regeneration/",
    "title": "Oxford Street regeneration",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Planning"
    ],
    "pub_date": "2024-09-18T14:46:59+01:00",
    "content": [
        {
            "text": "The Deputy Prime Minister and Mayor of London announced plans this week to transform Oxford Street."
        },
        {
            "text": "The Mayor believes his proposals would turn Oxford Street into a more attractive and thriving modern retail and leisure destination attracting more tourists, increasing footfall and spending."
        },
        {
            "text": "Offering the Government’s support, the Deputy Prime Minister attended a launch event at John Lewis & Partners on Oxford Street, alongside the Mayor."
        },
        {
            "text": "The announcement and the launch event attracted widespread national and London media coverage, including; The Guardian, Times, Sun, FT, City AM, Evening Standard and BBC."
        },
        {
            "text": "Angela Rayner, Deputy Prime Minister said:"
        },
        {
            "text": " “Oxford Street is a world-renowned shopping destination and we want it to stay that way. By working with the Mayor and local leaders, we can ensure it gets the boost it needs.\""
        },
        {
            "text": "“This plan to revitalise Oxford Street will drive growth by creating new jobs, generating economic activity, and giving a much-needed boost to London’s night-time economy.”"
        },
        {
            "text": "The Mayor has confirmed that he intends to designate a Mayoral Development Area to bring forward the regeneration of Oxford Street."
        },
        {
            "text": "As part of this, the Mayor is proposing that a Mayoral Development Corporation is established, which will have planning powers to provide the framework for delivery of the scheme."
        },
        {
            "text": "The Deputy Prime Minister must make an order establishing a Mayoral Development Corporation on request from the Mayor. This request can only be made following a statutory period of consultation and consideration by the London Assembly."
        }
    ]
}