{
    "url": "https://dwpdigital.blog.gov.uk/2024/09/18/reverse-pitch-calling-out-for-collaboration/",
    "title": "Reverse Pitch: Calling out for collaboration",
    "authors": [
        "DWP Digital"
    ],
    "categories": [
        "Collaboration",
        "Cross Government",
        "Digital With Purpose"
    ],
    "pub_date": "2024-09-18T13:34:54+01:00",
    "content": [
        {
            "text": "The Department for Work and Pensions (DWP) and Ministry of Justice (MoJ) have opened applications for their Reverse Pitch events, a unique collaboration between government and start-ups to co-create innovative solutions to tackle some of the most complex challenges facing citizens today.  "
        },
        {
            "text": "The Reverse Pitch events are an opportunity for start-ups to showcase their ideas and collaborate with government teams to address three key problems facing the two departments. Working alongside DWP and MoJ the successful applicants will be contributing to the government's commitment to driving digital change and improving the citizen experience. "
        },
        {
            "heading": 2,
            "text": "Rising to the challenge "
        },
        {
            "text": "DWP and MOJ have identified three key problems they’d like to work with start-ups on.  "
        },
        {
            "text": "To start the conversation a series of in person events will be held across our digital hubs where start-ups will be invited to come and discuss solutions to the problem statements and meet the DWP and MoJ teams. "
        },
        {
            "text": "Dates for these events are: "
        },
        {
            "text": "Once selected, these organisations will have the opportunity to work with the DWP's Innovation Studios in Leeds, London, or Manchester over a three-month period, refining their solution and building and testing it with input from stakeholders. "
        },
        {
            "text": "During their time working with the departments, start-ups will be encouraged to:  "
        },
        {
            "heading": 2,
            "text": "  Together we achieve "
        },
        {
            "text": "Andrew Western, Minister for Transformation, Richard Corbridge, CDIO, DWP Digital, and Megan Lee Devlin, Director General, MoJ, have been instrumental in creating this opportunity not only for cross government collaboration, but across industry collaboration.  "
        },
        {
            "text": "If you're passionate about innovation and making a real-life difference to those that need it most, we encourage you to apply for the Reverse Pitch events. To apply, please visit the Reverse Pitch webpage for more information and to submit your application.   "
        }
    ]
}