{
    "url": "https://mhclgdigital.blog.gov.uk/2024/09/18/taking-a-bold-innovative-approach-to-tackle-the-digital-and-data-recruitment-challenge/",
    "title": "Taking a bold, innovative approach to tackle the digital and data recruitment challenge ",
    "authors": [
        "Anisha Ahuja, Digital Operations Officer"
    ],
    "categories": [
        "Careers",
        "Innovation",
        "Ways of working"
    ],
    "pub_date": "2024-09-18T09:18:07+01:00",
    "content": [
        {
            "text": "Digital and data roles are known to be difficult to fill, not only in government but in the wider sector, due to a shortage of skills and high demand. For MHCLG Digital, we found that longer and more traditional recruitment methods were not attracting the people we needed at the pace we required. "
        },
        {
            "text": "In this blog post, we share how our department applied digital thinking, and took bold, innovative steps to overcome the challenges associated with digital and data resourcing, and improve the quality, diversity and speed of hiring specialists into our team. And how this has supported our departmental goals and the government objectives to build digital skills at scale. "
        },
        {
            "heading": 2,
            "text": "Adopting a digital, user-centred approach to recruitment "
        },
        {
            "text": "An initial discovery exercise helped our digital and data recruitment team identify pain points and areas for improvement across the attraction and recruitment process, spanning speed of hiring, the quality and quantity of applicants, and candidate experience. "
        },
        {
            "text": "These insights laid the foundation to develop user-centred solutions in order to: "
        },
        {
            "heading": 2,
            "text": "What we did "
        },
        {
            "text": "We designed, tested and iterated a range of solutions, using best practice and working in collaboration with our HR colleagues. From in-house digital recruitment panel training which upskilled over 100 digital and data colleagues, supporting them in their role as hiring managers and making hiring simpler and faster as well as the candidate experience better, to the ongoing development of an accessible library of online job descriptions aligned with the Government Digital and Data Profession Capability Framework, acting as consistent templates for recruitment and supporting workforce data and career progression. "
        },
        {
            "heading": 2,
            "text": "A new type of recruitment events: Digital Recruitment Days  "
        },
        {
            "text": "Our most significant initiative was to design a new type of innovative face-to-face recruitment and assessment events called Digital Recruitment Days. We held the pilot in Wolverhampton in late 2023, which was followed by events in Leeds, Darlington and Manchester in 2024, expanding our reach outside London. We also piloted a virtual format in spring 2024. "
        },
        {
            "heading": 2,
            "text": "Meet us, connect, get hired "
        },
        {
            "text": "The unique conference-style format gave the opportunity for talent to meet and connect with colleagues working in their specialist field, hear from and ask questions to our digital leaders, including our Chief Digital Officer and Chief Technology Officer, learn more about MHCLG and gather employment information from our HR colleagues.  "
        },
        {
            "text": "Participants also went through a compressed interview and assessment process with subject matter experts from our teams. Job offers were made in the days immediately following the event, followed by improved and speedy onboarding. "
        },
        {
            "text": "The events were supported by a targeted advertising campaign reaching out to under-represented groups, distinctive employer brand and varied engagement on the day to ensure attendees were able to get an authentic feel of the work environment and culture. "
        },
        {
            "text": "We moved away from a behaviour-based approach to test technical skills, experience and ability. Some technical skills were tested using a bespoke practical coding exercise to allow candidates to demonstrate their skills. "
        },
        {
            "text": "We had to ensure the department was ready to deploy the new approach, from adapted interview techniques to objective setting and enhanced probation reviews. We did this through a range of learning interventions. It was crucial for teams to conduct collective post-event retrospectives to help iterate and improve the next one.  "
        },
        {
            "heading": 2,
            "text": "Outcomes: what we achieved "
        },
        {
            "text": "Across 6 events, we were able to: "
        },
        {
            "text": "We had a high turnout of experienced professionals from diverse backgrounds and geographies reflecting the broad appeal of the opportunities presented, which also contributed to hiring successfully for our regional offices. The format was particularly attractive to private sector professionals, who were able to get an immediate feel and ask questions about working in the Civil Service.  "
        },
        {
            "heading": 2,
            "text": "What participants have said "
        },
        {
            "heading": 2,
            "text": "Find out more "
        },
        {
            "text": "This experience has taught us a lot. It has enhanced collaboration between teams and empowered us to innovate in order to generate positive outcomes for the department and make a difference for the communities we serve. "
        },
        {
            "text": "If you have questions or would like to discuss how our experience could be useful to your department, please contact me or my team at digitaldatajobs@communities.gov.uk. "
        }
    ]
}