{
    "url": "https://mhclgmedia.blog.gov.uk/2024/09/18/the-new-towns-taskforce/",
    "title": "The New Towns Taskforce",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2024-09-18T12:07:25+01:00",
    "content": [
        {
            "text": "The New Towns Taskforce held its first meeting this week in the post-war new town of Milton Keynes."
        },
        {
            "text": "At the meeting, it was confirmed eight industry experts now have a seat at the table alongside Chair, Sir Michael Lyons, and Deputy Chair, Dame Kate Barker. They include key players across planning, infrastructure delivery, architecture and urban regeneration.  "
        },
        {
            "text": "Sir Michael spoke to BBC Look East after the meeting, and said Milton Keynes offers the taskforce “all sorts of lessons” given it’s “a new town that's gone on growing and managed to keep up that momentum”. This is an example he hopes future new towns can replicate."
        },
        {
            "text": "There has also been coverage of the taskforce's meeting in the Milton Keynes Citizen, Insider Media, and Local Government Chronicle."
        },
        {
            "text": "Deputy Prime Minister Angela Rayner, who alongside the Housing Minister joined the meeting remotely, called the taskforce's first meeting \"a momentous step in our journey to deliver the next generation of new towns\". She also said:"
        },
        {
            "text": "\"We want to see new communities with real character –providing genuinely affordable, safe and secure homes, much-needed infrastructure and well-paying jobs. With a strong team of experts standing by his side, I have every confidence in Sir Michael’s leadership and his Taskforce is working at pace to make sure our long-term ambition becomes a reality.\""
        },
        {
            "text": "The taskforce will now push ahead with the vision for new towns  and will report back on potential locations to ministers next year. This will help drive the creation of the largescale communities that could deliver hundreds of thousands of high-quality homes to tackle the national housing crisis and drive economic growth across the country.  "
        }
    ]
}