{
    "url": "https://educationhub.blog.gov.uk/2024/09/what-is-pisa-data-and-how-does-it-measure-students-success-at-school/",
    "title": "What is PISA data and how does it measure students’ success at school?",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Education Standards",
        "Schools"
    ],
    "pub_date": "2024-09-18T16:40:23+01:00",
    "content": [
        {
            "text": "The Programme for International Student Assessment (PISA) measures how pupils are performing in certain subjects at school in countries around the world. It’s run by the Organisation for Economic Co-operation and Development (OECD) and assesses the knowledge and skills in mathematics, reading and science of 15-year-olds internationally."
        },
        {
            "text": "But what exactly is PISA and how does it measure success? Here we explain everything you need to know."
        },
        {
            "heading": 3,
            "text": "What is PISA data?"
        },
        {
            "text": "PISA is a global assessment conducted every three years, targeting 15-year-olds. It evaluates how well students perform in maths, reading and science.Since 2000, PISA has involved more than 100 countries and economies and around 3,700,000 students worldwide. The latest study was published in 2023 and relates to the performance of students in 2022."
        },
        {
            "text": "The OECD produces an international report which covers UK findings, and DfE publishes a report specifically on England’s results, including more detail on devolved nations. "
        },
        {
            "heading": 3,
            "text": "What is the difference between rankings and scores?"
        },
        {
            "text": "While rankings look at the relative position between the different countries taking part, scores provide an absolute measure of performance in a country and are comparable over time."
        },
        {
            "text": "The Office for Statistics Regulation (OSR) warns users should exercise caution in interpreting the data and look at the relevant scores to provide the fullest picture."
        },
        {
            "text": "Rankings need to be treated with caution and can be difficult to compare over time. This is because an increase or fall in rankings may be due to an increase in the number of participating countries."
        },
        {
            "heading": 3,
            "text": "How should we interpret PISA data?"
        },
        {
            "text": "To make sure the study is robust and comparable from country to country, the OECD instructs that each country meets a target for responses from schools and pupils taking part. If this agreed response rate is not met, the country has to investigate whether low participation could be biasing the results of the study."
        },
        {
            "text": "Between 2006 and 2015 England met all OECD sample requirements. However, the most recent PISA results in England, which examined the performance of students in 2022, did not meet the requirements as outlined by the OECD due to small sample sizes. The covid pandemic impacted schools’ and pupil’s ability to take part."
        },
        {
            "text": "In particular, our published analysis shows that higher performing pupils may be over-represented and pupils eligible for free school meals may be under-represented, some of the 2022 PISA results may subsequently be somewhat higher than they might otherwise be."
        },
        {
            "text": "Caution should therefore be taken when interpreting the findings for England, as the bias may have had a positive impact on both the scores and rankings."
        },
        {
            "heading": 3,
            "text": "What does the latest data show?"
        },
        {
            "text": "The table below shows the average PISA scores and their equivalent rank in 2018 and 2022:"
        },
        {
            "text": "Across the OECD on average, performance declined by a similar amount for both the highest- and lowest-achieving pupils in reading and maths, and more for lower-achieving pupils in science; in England however, the falls were greater for lower-achieving students in all three subjects."
        },
        {
            "heading": 3,
            "text": "Future commitment to PISA"
        },
        {
            "text": "PISA enables us to track changes over time and identify areas where we can improve our education system or apply strategies that are working well in schools in other countries."
        },
        {
            "text": "The government remains committed to participating in future studies, as part of our work to drive high and rising standards across England’s schools."
        }
    ]
}