{
    "url": "https://actuaries.blog.gov.uk/2024/09/18/whats-the-value-of-a-pension/",
    "title": "What's the value of a pension?",
    "authors": [
        "Brian Allan - Actuary"
    ],
    "categories": [
        "Analysis",
        "Pensions"
    ],
    "pub_date": "2024-09-18T12:38:35+01:00",
    "content": [
        {
            "heading": 2,
            "text": "The public employer value proposition pension challenge"
        },
        {
            "text": "There are approximately 6 million active members in the main public service workforces pension schemes. Following the implementation of the 2020 round of valuations employers will be contributing more than £50 billion annually to support their retirement beneﬁts. "
        },
        {
            "text": "On average this represents 27% addition above a combined 2024 to 2025 payroll of close to £200 billion. This begins to illustrate the very signiﬁcant role which pensions occupy in the overall remuneration of UK public servants."
        },
        {
            "text": "However, increasingly we hear from employers and sponsoring departments that public servants are unaware of, or unengaged by their public service pension provision. This suggests that a signiﬁcant element of public service employers’ value proposition to their staﬀ is underappreciated or simply not understood. Addressing this could mean employers’ pension contributions deliver better value for public money, and potentially help aid recruitment and boost current staff retention."
        },
        {
            "heading": 2,
            "text": "Options and challenges"
        },
        {
            "text": "While many schemes engage proactively with members, developing member communications further is an obvious potential remedy. Public servants often receive separate annual statements about pay from their employer and their pension from their public service scheme. Combining information on both in a total reward statement would give public servants a single picture of their total pay and pension package. This may be easier for them to engage with."
        },
        {
            "text": "A total reward statement also provides an opportunity to communicate other elements of employers’ value proposition such as leave, training, and other non-cash benefits. "
        },
        {
            "text": "There are some hurdles to be overcome to implement this: combining pay received in the present and pension beneﬁts which are paid from retirement is not straightforward. A meaningful today value for the pension earned in each year is needed. This is an area GAD can help with."
        },
        {
            "text": "While employer contribution amounts demonstrate that scheme membership is a valuable benefit, they have limitations as a today value, as they aren’t focused on the value to members. "
        },
        {
            "text": "In public service schemes the employers bear many of the risks of delivering the retirement income, and benefits from the pooling of many of the risks across the large numbers of members. "
        },
        {
            "text": "In the deﬁned contribution arrangements that are the norm outside of the public sector, the scheme members individually bear many of these risks without being able to access the advantages of pooling of risk. This suggests the value to a member of public service scheme might be greater than the employer contributions."
        },
        {
            "heading": 2,
            "text": "Member value"
        },
        {
            "text": "One way to capture this additional value would be to use the level of private pension contributions needed to establish a similar level of retirement income provision on the ‘open market’. GAD has experience in supporting public service schemes in this area: we provide regularly updated tables of hypothetical annuity cost factors for the NHS pension scheme."
        },
        {
            "text": "This approach provides a today value ﬁgure that is more comparable in return and risk terms with wider UK employment market oﬀers. It also makes it easy to show how far the additional value of the scheme to an individual member lies above the required minimum auto-enrolment level and general private sector levels such as the Pensions and Lifetime Saving Association's (PLSA) Pension Quality Mark standard. The chart below is an illustration of how this might potentially compare for a typical public service scheme."
        },
        {
            "heading": 2,
            "text": "What is the right level of saving?"
        },
        {
            "text": "The member value approach clearly has advantages in terms of comparability within overall remuneration oﬀer, with other employer oﬀers and UK statutory minimum provision. However, individual members may still struggle to compare a today ﬁgure to what they will actually need in retirement. "
        },
        {
            "text": "An understanding of what is a low, adequate, or good level of pension saving may be just as much of a blocker to engagement and understanding. While a single annual ﬁgure is succinct, it has a limited ability to communicate the implied retirement lifestyle which may be a context members can more easily engage with. "
        },
        {
            "text": "The Retirement Living Standards developed by the PLSA are one example of how pension savings can be linked to lifestyle implications. These are one set of estimates of the annual expenditure required to achieve different retirement lifestyles in the UK:"
        },
        {
            "text": "Bandings can also be assembled in other ways: for example, looking at the required replacement rate proportion of working income. "
        },
        {
            "text": "In general, a more direct link to lifestyle may provide an alternative route to help members engage with and value their scheme benefits. For most public servants, their state pension entitlement will also be an important part of this picture, as illustrated below. "
        },
        {
            "text": "Again, GAD can help with planning and assembling these kinds of member communications whether delivered via a printable statement or an online member tool approach."
        },
        {
            "heading": 2,
            "text": "Conclusion"
        },
        {
            "text": "There is lots of potential for employers to boost public servants’ engagement with their pension through innovating around communications. Above we have just looked at 2 potential options: "
        },
        {
            "text": "GAD can help schemes and employers interested in exploring these options. We can also help with: "
        },
        {
            "text": "Disclaimer"
        },
        {
            "text": "The opinions in this blog post are not intended to provide specific advice. For our full disclaimer, please see the About this blog page."
        }
    ]
}