{
    "url": "https://environmentagency.blog.gov.uk/2023/07/07/enforcement-days-of-action-what-they-are-and-why-they-are-important/",
    "title": "Enforcement Days of Action – what they are and why they are important",
    "authors": [
        "defrablogs"
    ],
    "categories": [
        "Environment Agency"
    ],
    "pub_date": "2023-07-07T15:35:05+00:00",
    "content": [
        {
            "text": "By Peter Stark"
        },
        {
            "text": "The main purpose of my role as an Enforcement Team Leader for the Environment Agency’s Lincolnshire and Northamptonshire Area is making a difference to legitimate businesses. I’ve done the role for four years and I enjoy helping to ensure the environment is protected by working to combat illegal waste activities with my knowledgeable team."
        },
        {
            "text": "As well as harming the environment, illegal activity affects others in their homes or workplaces. We have legal powers to seize vehicles, issue notices, stop activities and prosecute people – they can then be fined or sent to prison by the courts. We always start by providing advice and guidance in the first instance, so people have the opportunity to comply."
        },
        {
            "text": "Enforcement Days of Action allow us to visit many sites in a defined geographical area to check and inspect sites for compliance with our environment regulations. Days of Action enable us to work safely together with a large number of officers, be visible to the public and demonstrate to our customers the role we play in protecting the environment and communities."
        },
        {
            "text": "We work with internal and external partners such as the Joint Unit for Waste Crime, Police, Fire Service, HMRC and Local Authorities. This partnership approach brings relationship-building opportunities, boosts Learning and Development for new or less experienced staff members and has the benefit of working with other peoples’ insight and intel, as well as providing safety in numbers. We’ve found these days are very successful for covering lots of sites across a large area, working safely, building the skills and knowledge of our officers, effective team-working working and sharing best practice with partners."
        },
        {
            "text": "The recent Northamptonshire Days of Action took place over two days and covered the whole county of Northamptonshire. We inspected 55 sites."
        },
        {
            "text": "We identified four sites to formally investigate, helped newer officers by budding them up with experienced officers, and prioritised health and safety by trying out our new body armour and body-worn video cameras."
        },
        {
            "text": "These cameras are great as they help to protect our officers’ health, safety and wellbeing, preventing hostility, aggression and inappropriate behaviour as well as assisting our regulatory work. Situations can become challenging on Days of Action and through any aspect of our regulatory role. Officers are fully trained to deal with hostile situations and we also make it clear that we won’t tolerate disrespectful behaviour. The cameras were not needed on this occasion but wearing them can prevent hostility from starting in the first place."
        },
        {
            "text": "We received positive feedback from legitimate business – they were pleased to see us and welcomed our presence – as well as from the public, partners and internal team members."
        },
        {
            "text": "I’m grateful to everyone who took part. These events take great planning and preparation, but it’s always worth it and helps us achieve positive outcomes, including identifying business that need intervention or investigation, providing advice and guidance, increasing the visibility of our pollution prevention and regulatory work, and building our relationships with legitimate businesses. Ultimately we’re here to protect the environment and people which these Days of Actions help us do."
        },
        {
            "text": "I’m extremely proud of my team and those we partner with in this important, challenging and rewarding work. It’s great to hear positive feedback and see the difference we make. We’re planning further days of action, targeting other areas of Northamptonshire and Lincolnshire."
        },
        {
            "text": "People can help us by being vigilant and reporting environmental concerns to us on our free, 24/7 incident hotline number, 0800 807060. If you suspect a business is causing environmental damage, please report it on that number so we can investigate."
        },
        {
            "text": " "
        }
    ]
}