{
    "url": "https://educationhub.blog.gov.uk/2023/07/07/free-childcare-how-we-tackling-the-cost-of-childcare/",
    "title": "Free childcare: How we are tackling the cost of childcare",
    "authors": [
        "media officer"
    ],
    "categories": [
        "Childcare",
        "childminders",
        "early years",
        "Funding"
    ],
    "pub_date": "2023-07-07T13:52:34+01:00",
    "content": [
        {
            "text": "England has some of the highest quality childcare provision in the world, with 96% of early years settings rated by Ofsted as good or outstanding. But we recognise that childcare is also one of the biggest costs facing working families today. "
        },
        {
            "text": "That’s why we’re making the biggest investment by a UK government into childcare in history, doubling the amount we expect to spend over the next few years from around £4 billion to around £8 billion each year. "
        },
        {
            "text": "By September 2025, working parents will be able to claim 30 hours of free childcare a week, over 38 weeks of the year, all the way through from nine months up to their child starting school. "
        },
        {
            "heading": 3,
            "text": "When does the 30 hours free childcare start? "
        },
        {
            "text": "Eligible working parents of three- and four-year-olds already get 30 hours a week of free childcare. "
        },
        {
            "text": "The increased offer will be rolled out in stages to allow childcare providers time to be able to implement the changes, making sure the places that are needed are available across the country when the offers are introduced. "
        },
        {
            "text": "From April 2024, working parents of two-year-olds will be able to access 15 hours of free childcare. "
        },
        {
            "text": "From September 2024, 15 hours of free childcare will be extended down to the age of nine months. "
        },
        {
            "text": "From September 2025, working parents of children aged nine months and upwards will be entitled to 30 hours free childcare per week right up to their child starting school. "
        },
        {
            "text": "Like the existing offer, depending on your provider, these hours can be used over 38 weeks of the year (during school term time), or up to 52 weeks if you use fewer than your total hours per week. "
        },
        {
            "heading": 3,
            "text": "Why won’t this be available until 2025? "
        },
        {
            "text": "This is a massive expansion in the offer and will take some time to implement and rollout. "
        },
        {
            "text": "The staggered approach will give childminders and nurseries time to prepare for the changes, ensuring there are enough places ready to meet demand. "
        },
        {
            "text": "The government is supporting with this, with plans to run a recruitment campaign for staff, offer new ways to train, for example with apprenticeships, and reviewing the rules about how nurseries use their staff to make sure they are as flexible as possible without compromising quality or safety. "
        },
        {
            "heading": 3,
            "text": "How else is the government supporting nurseries and childminders?  "
        },
        {
            "text": "Nurseries are set to receive a £204 million cash boost as part of the Government’s promise to deliver the largest ever investment in childcare."
        },
        {
            "text": "Every area across the country is getting a share of the Government funding which childcare providers can use to ease cost pressures such as staffing costs, training and bills."
        },
        {
            "text": "Funding rates per child paid from September will increase from an average of £5.29 to £5.62 for three and four-year-olds, and from an average of £6.00 to £7.95 for two-year-olds."
        },
        {
            "text": "All local authorities will start to receive their share of £289 million in funding from January 2024 to support their delivery of the programme, with parents expected to see an expansion in the availability of wraparound care from September 2024."
        },
        {
            "heading": 3,
            "text": "How will this make childcare cheaper? "
        },
        {
            "text": "Nurseries are not allowed to charge top-up fees when providing the free hours offers, and that won’t change as these are expanded. "
        },
        {
            "text": "By making sure the government is properly covering the cost of providing the free places, there will be no need for nurseries to charge inflated fees for additional hours parents want to pay for. "
        },
        {
            "text": "And of course, parents will be paying for far fewer hours in the future.  "
        },
        {
            "heading": 3,
            "text": "What do you mean when you say free childcare is for ‘working’ parents? "
        },
        {
            "text": "Working parents who individually earn more than £8,670 (from April 2023) but less than £100,000 per year are eligible. "
        },
        {
            "text": "If you’re in a couple, the rules apply to both of you, so you must both earn at least £8,670 and neither one of you can earn more than £100,000. "
        },
        {
            "text": "There’s more information available on the exact criteria on the Childcare Choices website, for example if you work irregular hours. "
        },
        {
            "heading": 3,
            "text": "Who is eligible for free childcare now? "
        },
        {
            "text": "Currently, all three- and four-year-olds are entitled to 15 hours per week of free childcare or early education, rising to 30 hours for working families, and 15 hours for disadvantaged two-year-olds, over 38 weeks of the year. "
        },
        {
            "heading": 3,
            "text": "What childcare support is available for people on Universal Credit?  "
        },
        {
            "text": "Parents on Universal Credit are set to get further support too.   "
        },
        {
            "text": "From June 2023, the amount parents will be able to claim from Universal Credit to cover childcare costs will rise from £646 a month to £951 for one child, and from £1,108 to £1,630 for two children.   "
        },
        {
            "text": "Parents will also be able to receive DWP support to cover their costs upfront, making it easier for them to get a job or increase their hours. This eases parents into the childcare costs payment cycle. "
        },
        {
            "heading": 3,
            "text": "What other Government childcare support is there? "
        },
        {
            "text": "Local authorities and schools will be given more funding for what’s known as “wraparound care”, so that parents of school-age children can access childcare in their local area from 8am – 6pm.  "
        },
        {
            "text": "This could include provision of activities that fall outside of school hours, via things like breakfast clubs and after-school clubs.  "
        },
        {
            "text": "The funding worth up to £289million will enable schools to test different ways to increase their wraparound options, including working with local private providers or partnering with other schools.  "
        },
        {
            "text": "This will be rolled out in September 2024, and we expect that by September 2026, all parents will be able to access wraparound care, either from their school or other provider.  "
        },
        {
            "text": "Parents can also get up to £500 every three months (up to £2,000 a year) for each child to help with the cost of childcare, or up to £1,000 every three months (up to £4,000 a year) if a child is disabled, with Tax-Free Childcare. You can find out more about the scheme on Gov.uk. "
        }
    ]
}