{
    "url": "https://openpolicy.blog.gov.uk/2023/07/07/making-co-design-more-inclusive-by-overcoming-language-barriers/",
    "title": "Making co-design more inclusive by overcoming language barriers",
    "authors": [
        "Chloe Wybrant",
        "alexmathers",
        "Kate Langham"
    ],
    "categories": [
        "Policy Lab"
    ],
    "pub_date": "2023-07-07T09:27:23+01:00",
    "content": [
        {
            "text": "Policy Lab recently worked on a project that explored how resettled refugees can participate in language learning that supports their integration into society. To explore this area, we combined film ethnography and co-design to learn from and create solutions with refugees. We created a co-design toolkit, to be used during our research visits, that supported refugees with limited English language skills to meaningfully share their experiences and ideas. This blog explains how we developed and used the toolkit."
        },
        {
            "heading": 3,
            "text": "Developing the co-design toolkit"
        },
        {
            "text": "We began by conducting initial research with a range of experts, such as volunteers, language teachers and policymakers, to explore the challenges faced by refugees in accessing and navigating English language learning opportunities. This broadened our understanding of the refugee context and informed the co-design activity, helping us to develop engaging, visual and accessible tools. "
        },
        {
            "text": "We were particularly interested in Reflect for ESOL: a set of materials intended for anyone teaching or working with refugees, developed by Action Aid. Underpinning the Reflect for ESOL approach is the use of visualisation tools such as rivers, trees and maps. These enable participants to communicate their knowledge, experience and feelings without being restricted by literacy and language barriers. "
        },
        {
            "text": "We expanded on this tried-and-tested design process for our work, focusing on maps as a shared visual language. A refugee’s location and transport options were identified as major factors impacting their ability to access English language learning. We therefore designed and developed an interactive mapping toolkit that enabled our participants to model how they and their families navigated their local area, as part of their daily routine."
        },
        {
            "text": "We used prototyping to develop the toolkit. The prototype allowed us to play with and define the elements needed to map an imaginary refugee's typical day when they are attending ESOL provision within their local area. It also allowed us to discover the best way to discuss with them the challenging journeys and interactions."
        },
        {
            "text": "The elements we had identified in the prototype were then designed to form the toolkit. We created A4 printed abstract maps to represent rural and urban landscapes. The A4 maps could be mixed and matched to form a theoretical space according to a participant’s impression of their local area. Wooden discs represented people; they could be marked up and moved around the map to represent members of a participant's family. Laser etched wooden blocks represented landmarks and locations, providing points of reference such as the home, English classes, childcare and shops. How a refugee travelled around their local area was marked with different modes of 3D printed transport such as a bike, car, or train."
        },
        {
            "text": "Before we took the toolkit into the field, we tested it with former refugees to ensure the content was accessible for our research participants. The feedback from the test phase led to us to include a ‘thank you’ booklet in the kit, which provided participants with information to contextualise the co-design activity in a format that supported their reading skills."
        },
        {
            "heading": 3,
            "text": "Using the toolkit"
        },
        {
            "text": "For the fieldwork, we visited refugee participants across England. This gave us the opportunity to explore the way different rural and urban contexts can impact a refugee’s experience of learning English and settling into life in the UK. A Policy Lab researcher, a film ethnographer and (in most cases) an interpreter were present for each research visit: spending a day with the participant in their homes and surrounding areas. Rather than asking a predetermined list of questions, we allowed the participant to show and tell us what was most important to them. At an appropriate point during the day, we brought out the toolkit and used it to further the conversation. A volunteer who works with one of our refugee participants, reflecting on how the co-design toolkit was used:"
        },
        {
            "text": "By mixing and matching the toolkit elements, participants constructed their local area as they experienced it and shared their typical routines. The facilitator asked them to indicate how challenging they found particular journeys or locations using red, orange and green dot stickers. Star-shaped stickers were used where participants had ideas for how their experience could be improved."
        },
        {
            "text": "The ideas were taken forward alongside the research insights into the design phase of the project, where Policy Lab explored what an improved refugee experience would look like."
        },
        {
            "text": "Policy Lab has been at the forefront of bringing the lived experience of people, particularly those who are less likely to engage with traditional government mechanisms, into the policy development process. If you are interested in finding out more about how we work or would like to commission us, you can read our Prospectus and get in touch at team@policylab.gov.uk."
        }
    ]
}