{
    "url": "https://space.blog.gov.uk/2023/07/07/milky-way-and-meteors-the-night-sky-in-july/",
    "title": "Milky way and meteors: the night sky in July",
    "authors": [
        "Derek Smale"
    ],
    "categories": [
        "Astronomy"
    ],
    "pub_date": "2023-07-07T11:36:07+01:00",
    "content": [
        {
            "text": "July is a great month for a night of stargazing, with clear nights bringing the core of our Milky Way galaxy into focus, a conjunction of the rocky inner planets of our Solar System, two meteor showers and the possibility of noctilucent clouds."
        },
        {
            "heading": 2,
            "text": "The Moon and planets"
        },
        {
            "text": "Venus continues to shine brightly in the evening skies for the next couple of weeks, appearing to sit close to Mars on the edge of the constellation of Leo."
        },
        {
            "text": "Both Venus and Mars are setting earlier in the evening now though, and by the end of the month our neighbouring planets will be lost in the glare of sunset."
        },
        {
            "text": "The evenings of 19 and 20 July bring a fascinating conjunction of the rocky planets of our Solar System."
        },
        {
            "text": "Mercury, Venus, and Mars, as well as a 5-10% illuminated crescent Moon can all be spotted together in the west shortly after the Sun sets."
        },
        {
            "text": "Meanwhile the gas giants dominate the morning skies with Saturn rising in the south-east around 11:00 pm and Jupiter following a couple of hours later."
        },
        {
            "text": "These two make great targets for those with telescopes as even smaller scopes will be able to show the four brightest moons of Jupiter (known as the Galilean Moons) and the rings of Saturn."
        },
        {
            "heading": 2,
            "text": "Meteor showers"
        },
        {
            "text": "Two meteor showers, the Delta Aquarids and the Alpha Capricornids, build towards a peak at the end of the month."
        },
        {
            "text": "These overlap with the start of next month’s Perseids shower, so it’s a great time to see if you can spot any meteors streaking across the night sky."
        },
        {
            "text": "The meteors we see are fragments of rock, dust and ice that trail behind the comets of our Solar System, falling into our atmosphere at great speeds and burning up and creating glowing streaks across the night sky."
        },
        {
            "text": "Join us next month for more information about August’s Perseid meteor shower, one of the highlights of the astronomy calendar!"
        },
        {
            "heading": 2,
            "text": "Other night sky sights"
        },
        {
            "text": "The summer months bring the chance of seeing the beautiful silver-blue glow of Noctilucent clouds."
        },
        {
            "text": "There have been a number of sightings across the UK in the last few weeks, so check out last month’s blog for more information on how to spot these beautiful ‘night-shining’ clouds."
        },
        {
            "text": "July is a great month to try and spot the brightest band of our Milky Way galaxy. This is the collective light of the phenomenal numbers of stars clustered around the centre of our galaxy, combined with the darker streaks made up of enormous clouds of interstellar dust."
        },
        {
            "text": "The core of our galaxy lies in the direction of the constellation of Sagittarius, which lies low in the south after dark."
        },
        {
            "text": "Find a clear southern horizon and get as far away from the lights of our towns and cities as you can to enjoy this spectacular sight."
        },
        {
            "text": "If you look high overhead as darkness falls this month, you’ll see the bright star Vega (constellation Lyra).  This is one of the ‘summer triangle’ of stars that sit overhead during the warmer months – we’ll have more on that next month!"
        },
        {
            "text": "Look towards the north-west to see the constellation of Ursa Major (the Great Bear) with its nose pointing towards the northern horizon."
        },
        {
            "text": "The distinctive stars of the Plough (also known as the Sickle, or Big Dipper) that make up the Great Bear’s back and tail point up into the western sky, towards the bright, orange-hued star Arcturus, which lies in the constellation of Bootes."
        },
        {
            "text": "Did you know?"
        },
        {
            "text": "You can see the International Space Station as it orbits Earth 400km (250 miles) up, travelling at a speed of 28,000kph (17,500 mph). You can enter your location and find timings of the passes of the ISS here."
        },
        {
            "heading": 2,
            "text": "Space Exploration"
        },
        {
            "text": "The European and Japanese Space Agencies have collaborated on a mission to get a spacecraft into orbit around the innermost planet in our solar system, Mercury."
        },
        {
            "text": "BepiColombo had its third flyby of Mercury last month, as it seeks to enter orbit around the planet in 2025.  You can find out more about the mission, and find a video taken by the spacecraft during its recent flyby here."
        },
        {
            "text": "The European Space Agency’s ‘Euclid’ mission launched successfully last month, seeking to understand some of the most complex phenomena in our Universe."
        },
        {
            "text": "Remarkably, only around 5% of our Universe takes the form of visible ‘matter’, while the rest - so called ‘dark matter’ and ‘dark energy’ - is invisible to our eyes and currently impossible for our instruments to detect."
        },
        {
            "text": "To tackle some of the many questions around this, Euclid aims to study the evolution of the universe, to understand why the expansion of the universe appears to be accelerating and try to shed some light on ‘dark matter’."
        },
        {
            "text": "Find out more about this mission here."
        }
    ]
}