{
    "url": "https://ipa.blog.gov.uk/2023/07/07/net-zero-week-it-starts-with-us/",
    "title": "Net Zero Week: It starts with us",
    "authors": [
        "Project Futures Team"
    ],
    "categories": [
        "Construction",
        "Infrastructure",
        "Transforming Infrastructure Performance"
    ],
    "pub_date": "2023-07-07T10:08:49+01:00",
    "content": [
        {
            "text": "In this blog you will hear from some of the Project Futures Team at the Infrastructure and Projects Authority (IPA), as they reflect on Net Zero Week, and how Transforming Infrastructure Performance (TIP) will help us reach our net zero commitments. "
        },
        {
            "text": "About the Project Futures Team"
        },
        {
            "text": "Our team’s collective mission is to be a catalyst for change, transforming project delivery for people and our planet. Net Zero Week is a reminder of the collective responsibility we all hold in achieving our commitments to tackle the climate and nature emergency. One way government and industry can play our part is through the implementation of Transforming Infrastructure Performance (TIP): Roadmap to 2030. To emphasise our pace for change, we have a vision for the core TIP principles to be business as usual (BAU) by 2025, meaning value-led and data-driven decision making is core to all project delivery."
        },
        {
            "text": "Along with a collective drive to decrease waste, increase productivity and reduce costs, putting the UK on the path to net zero emission by 2050 is a major ambition of the TIP principles. We are determined to make the biggest difference in this drive for change. Read on to hear the perspectives of some members of our team. "
        },
        {
            "text": "Dr Jo Jolly - Deputy Director and Head of the Project Futures Team "
        },
        {
            "text": "Over the years, I have come to understand what a life well-lived will look like. For me, it is that I will have done my best to make the best difference I can for the planet through the work I do. My daily reminder of the definition of 'doing my best' comes from Sir David King and the engineers at the Centre for Climate Repair in Cambridge, who are working on technologies to refreeze the Arctic. Because no matter what we achieve with our net zero goals, the Arctic has gone beyond a tipping point, where more ice now melts in the summer than can refreeze in the winter. This is terrifying news for all life forms that depend on the earth systems as we know them today, and that of course, includes us. So the efforts of Sir David King and his team, is what I believe it looks like when people choose to do their best. "
        },
        {
            "text": "The link between project delivery and tackling the climate emergency is actually far greater than it initially might appear. The climate emergency is a systemic problem, so it requires a systemic solution, and I can't think of anything more systemic than project delivery. Imagine if we galvanise the global project delivery community, to make better and more sustainable choices every day when delivering projects (and I refer you to my earlier definition of 'doing our best'), to make the best differences possible for the economy, the environment and society as a whole. Then we are living by the core principles of TIP - and that's what we are driving at, with all our courage and compassion."
        },
        {
            "text": "And setting out our north star, our Director of Strategy, Performance & Assurance, Helen Campbell, gave us this wonderfully refreshing and motivating leadership direction. She said:  "
        },
        {
            "text": "“We've got enough plans and roadmaps - this is about action. This is about making a difference on the ground, at scale. TIP should be business as usual by 2025.”"
        },
        {
            "text": "I wholeheartedly agree, and we are doing our best to make this happen."
        },
        {
            "text": "Dr Jennifer Charlson - Modern Methods of Construction Programme Manager"
        },
        {
            "text": "The Climate Change Act 2008 contains a legally binding target committing the UK to net zero greenhouse gas (GHG) emissions by 2050. Aimed at meeting its longer term climate targets, the UK has set a series of five-year legally binding carbon budgets. In line with the level advised by the Committee on Climate Change (CCC), the government has set the sixth carbon budget (2033-2037). This represents one of the many routes towards decarbonisation, and while the race to net zero is underway, there is plenty more to be done. "
        },
        {
            "text": "The CCC’s purpose is to advise the UK and devolved governments on emissions targets and to report to Parliament on progress made in reducing GHG emissions and preparing for and adapting to the impacts of climate change. Lord Deben, Chairman of the CCC, wrote to the Prime Minister about the 2023 Progress Report to Parliament on reducing emissions. As Lord Deben points out, ‘delay is not an option’. "
        },
        {
            "text": "The TIP theme of environment and sustainability contributes to achieving the UK’s legally binding commitment to net zero greenhouse gas emissions. By 2025, sustainability must be embedded in project delivery processes, where project success is rooted in delivery of benefits and outcomes for society and the environment. To find out more about TIP focus area 4 from the Roadmap to 2030, on retrofitting existing buildings to achieve net zero, you can watch our video here. "
        },
        {
            "text": "Lizzy Duncan - TIP Communications and Engagement Lead "
        },
        {
            "text": "When I was young I believed solving climate change was the responsibility of scientists. I assumed they would have a clever solution and everybody would simply follow their lead. Growing up I thought our world leaders would be our superheroes, and stop global warming in its tracks. As I got older, I hoped climate activists might change the hearts and minds of people, and finally incite action."
        },
        {
            "text": "Now I know that it is not any one group’s responsibility - it is all of ours. "
        },
        {
            "text": "As the Communications and Engagement Lead for the Project Futures Team, I know it will take buy-in from every one of our stakeholders to achieve net zero. While we may not have one clever solution to solve it all, I have been given hope by the TIP programme and its objectives. In April 2023, I attended TIP Live where I listened to inspirational leaders across the sector who instilled messages of collaboration, innovation, and heroic determination. I strongly urge you to attend the next TIP Live event, scheduled for November 2023 at the ICE (Institution of Civil Engineers) in London, to hear how you can play your part in building a better future through transforming the way we deliver infrastructure projects for good.  "
        },
        {
            "text": "There’s no better time than now to engage, act, and make change. We are all responsible for making these next few years count. "
        },
        {
            "text": "Rea Robey - Head of Major Infrastructure Intelligence "
        },
        {
            "text": "UK Net Zero Week is a perfect time for us all to re-focus on the challenges that face us, but also to recognise the opportunities that government and the wider construction industry must seize. "
        },
        {
            "text": "We know that construction of infrastructure has an impact on our environment. It is a major user of raw materials, produces large amounts of waste and has a carbon footprint bigger than most other sectors in the UK. Yet change can be slow, perhaps partly because starting on this journey feels complex and can require investment of time and money. But perhaps it's also because we don’t talk enough about the opportunities and wider benefits that change can bring. We need to keep making the case and convincing delivery partners inside and outside government that it’s in everyone’s interest to take action. "
        },
        {
            "text": "The Project Futures Team is addressing that head on through TIP, for instance through our work on:"
        },
        {
            "text": "Promotion: Actively encouraging use of modern methods of construction (MMC) across all public projects. "
        },
        {
            "text": "MMC such as offsite manufacturing can reduce waste by up to 90%, meaning up to 70% less on-site labour and projects can be sped up by up to 60% (as well as significantly reduce emissions)."
        },
        {
            "text": "Foresight: Publishing data on future planned investments in major infrastructure, and quantifying the projects that expect to use MMC. "
        },
        {
            "text": "Industry then has the foresight and confidence to invest in technologies and processes that are far more productive, efficient and sustainable for our environment. The National Infrastructure and Construction Pipeline 2021, showed that £79 billion worth of projects were set to use significant elements of MMC between 2022 and 2025 - that is set to increase, and sends a powerful message to the market. "
        },
        {
            "text": "Upskilling: Embedding and mainstreaming the use of project data analytics, to enable much more precision in tracking progress and performance in major projects. "
        },
        {
            "text": "TIP is helping project managers to develop the capabilities to understand how they are performing on resource use, carbon, social value and cost, which will ensure projects deliver better outcomes for people, the planet and the bottom line."
        },
        {
            "text": "There’s more we can do in this space, and now is the time to do it - join us in implementing TIP and realise those opportunities."
        },
        {
            "text": "Kay Tor - Sustainability Lead "
        },
        {
            "text": "“Let’s become an engineer and invent something. Something to remove the greenhouse gases warming the planet, or something to refreeze the shrinking polar ice caps that are exacerbating the warming.” This was my thought when I was 12 and with little knowledge. The existing damage to the planet’s ecosystem that all lives depend on was undeniable and that was enough for me to act, achievable or not, I would do my best to make a difference."
        },
        {
            "text": "As an engineer, I quickly realised we can’t address the climate crisis with just innovative technologies alone, because this only tackles the symptoms and not the cause. We need to drastically change ‘the how’ and the basis from which we engineer and deliver. Project delivery is entwined in almost everything from buildings and infrastructure to cars and planes. By influencing and challenging the how and why projects are delivered, we can ensure that every single decision being made is ethical and centres on delivering better outcomes. "
        },
        {
            "text": "We can address the climate emergency through project delivery and the vast community of project professionals, by ensuring outcomes-led delivery for the benefit of society and the planet. And through TIP BAU 2025, we can step up the pace of change."
        },
        {
            "text": "We are part of a system and there is a significance in every action and choice we make, and the basis from which we make them. We need to have consideration and compassion for those around us, as only through working together can we tackle the challenges ahead and drive the cultural and behavioural changes that are needed to TIP the scale in our favour."
        },
        {
            "text": "Decades ago I wondered if I’d be too late, now that is a question I cannot fathom. The time to consider action has passed, now is our chance to make pace."
        },
        {
            "text": "If you would like to get in touch with the Project Futures Team, or find out more on how to pioneer and embed the TIP principles in your work, please contact us at projectfutures@ipa.gov.uk."
        },
        {
            "text": "Read the TIP policy document here. "
        }
    ]
}