{
    "url": "https://naturalengland.blog.gov.uk/2023/07/07/wendling-beck-nature-recovery-on-a-landscape-scale/",
    "title": "Wendling Beck: Nature Recovery on a Landscape Scale",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Biodiversity",
        "Environment Act",
        "Farming",
        "Landscapes",
        "Landscapes and access",
        "Natural England",
        "Nature Recovery Network",
        "Site of Special Scientific Interest",
        "Species recovery",
        "Wildlife",
        "wildlife and farming"
    ],
    "pub_date": "2023-07-07T10:19:51+01:00",
    "content": [
        {
            "text": "In the heart of Norfolk farming country, Natural England has been partnering with an ambitious project to transform a large area of agricultural land into a haven for wildlife. The scheme aims to demonstrate that growing food is fully compatible with thriving nature and habitats - and underlines the value of healthy, connected natural landscapes for managing flood risk, absorbing CO2, creating accessible green space, and a host of other benefits."
        },
        {
            "text": "Named after the river running through it, the project is centred on the Dillington Hall Estate and three adjacent farms. With his business only viable from subsidies that were due to be phased out, Glenn Anderson, the Dillington Hall landowner decided on a radical change of direction. During the lockdown of 2020 he started working on a plan and teamed up with neighbours: Rosie Begg, Tom Cross and the Bullard family. The landowners have partnered with Norfolk County Council, Anglian Water, environmental NGOs, and Natural England which has provided significant technical and financial support."
        },
        {
            "text": "In Natural England’s Norfolk and Suffolk Area Team we’ve been advising not only on habitat creation, but also supporting the project as it connects with new government policies and funding opportunities."
        },
        {
            "text": "The core project area sits within the wider Upper Wensum catchment, covering up to 10,000 hectares of river, floodplain, wetlands, woods and farmland. The ambition is to work with the landowner group in this area to restore and create new habitats on an even greater landscape scale, and share the learning and good practice from Wendling."
        },
        {
            "text": "As a Nature Recovery Network Senior Adviser I’ve had the pleasure of providing advice and guidance to the project. I’ve found it to be a really exciting example of a partnership coming together around an ambitious vision. It’s going to help build the Nature Recovery Network in this part of mid Norfolk. The partners are creating a model for the future that is sustainable, wildlife-rich and climate resilient."
        },
        {
            "text": "Since its inception in 2020 the project has made rapid progress. So far the team have restored or created a range of habitats including: 65 acres of heathland; 15 acres of parkland; 80 acres of species-rich lowland meadow; six acres of lowland fen; two acres of wet woodland and 600 metres of rare chalk stream. Grazing livestock are key to managing some of the habitats but need to be excluded from others, so a priority has been fencing and water barriers. One of the project’s key aims is creating natural corridors that allow wildlife to move between three Sites of Special Scientific Interest (SSSI) within its boundary. Wendling Beck is a landscape-scale Nature Recovery Project and part of the Nature Recovery Network, which aims to improve and join up existing wildlife-rich sites, and connect them with newly restored land to create thriving and resilient ecosystems. Six of these landscape scale projects are currently underway across England, Wendling Beck being one of five NRPs launched in May 2022, with another six projects due to be launched this year."
        },
        {
            "text": "Wendling Beck aims to provide more chances for people to experience a wilder landscape and get closer to nature. A cycle track and walking trails will join the site to Dereham. Norfolk County Council has plans to open an environment hub in the nearby Gressenhall Museum of Rural Life – a chance for school groups to come and experience nature first hand."
        },
        {
            "text": "It's a hugely ambitious initiative, with scope beyond geography and ecology and is innovating ways of working with environmental finance schemes. It is one of the projects pioneering Biodiversity Net Gain (BNG). This new statutory scheme for developers and land managers, aims to ensure that any new development will have a positive impact on wildlife habitat, leaving it in a better state. Wendling Beck has been invaluable in shaping the BNG Statutory Credits scheme and the hope is that Wendling Beck will be among the earliest investment locations once the scheme goes live."
        },
        {
            "text": "My colleague Ezra Lucas, Adviser for the River Wensum catchment, has been a key contact with the project and sees that it has great value as a case study for future work."
        },
        {
            "text": "“It’s brilliant to be able to work with a team as dynamic and forward thinking as the Wendling Beck Environment Project. The land-use change benefits wildlife at a local level, but the learning from this project is invaluable for developing the Nature Recovery Network across the country” he says."
        },
        {
            "text": "Food production will continue, but as just one part of the mosaic of Wendling Beck’s habitats, and in a very different form from the intensive farming of recent decades. Small numbers of grass-fed cattle and sheep will be used to manage distinctive grassland, heathland and wood pasture, and the existing blackcurrant plantations will continue to produce high quality fruit crops."
        },
        {
            "text": "Ultimately the project’s greatest value could be as a testbed for new ideas and ways of working in landscape scale nature restoration. Its aim is to encourage others to follow a similar journey. From farmers to financiers the project is already attracting attention from many directions, and it seems that by that measure alone, the Wendling Beck Environment Project is succeeding."
        },
        {
            "text": "Find out more about the Nature Recovery Network and how you can get involved:  Nature Recovery Network - GOV.UK (www.gov.uk)"
        },
        {
            "text": "By Andy Millar, Nature Recovery Senior Adviser"
        }
    ]
}