{
    "url": "https://environmentagency.blog.gov.uk/2023/02/07/cleaning-up-rivers-polluted-by-abandoned-metal-mines/",
    "title": "Cleaning up rivers polluted by abandoned metal mines",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Environment Agency"
    ],
    "pub_date": "2023-02-07T16:49:30+00:00",
    "content": [
        {
            "text": "The problems facing water are complex, with multiple sources of pollution affecting water quality. One of the lesser-known areas of the Environment Agency’s work is cleaning up pollution from abandoned metal mines.  "
        },
        {
            "text": "Mining played a major part in Britain’s rich industrial history, but this also left thousands of abandoned mines scattered across our landscape. Almost all these mines had closed by the early 1900s but they are still releasing harmful metals including lead, cadmium and copper.  This is one of the top 10 issues for water quality in England as it harms fish and river insects. Abandoned mines are the largest source of metals to British rivers and seas (click here for more information). Pollution is localised to about 1,500km of rivers - mainly in the North East, Cumbria, Yorkshire & Cornwall.   "
        },
        {
            "text": "The worst river pollution by metals is caused by water flowing out of tunnels dug by miners. Rainfall also washes metals out of the millions of tonnes of highly contaminated wastes the miners left at the surface. Climate change will worsen the environmental impacts because drier summers mean there will be less dilution of polluting mine water but conversely, more intense rainfall will wash even more metals into rivers from wastes. "
        },
        {
            "text": "Usually, the polluted rivers look clear because metals like lead and cadmium aren’t visible. However, more alarmingly, rivers can turn orange when the mine waters contain lots of iron. To check for pollution, we collect water samples, measure the metal concentrations in a laboratory and compare the results with environmental standards set to protect wildlife. "
        },
        {
            "text": "Because these mines all closed before 2000, the law says the former mine owners or operators do not have to deal with the water pollution they created. This pollution will continue for hundreds more years unless action is taken.  "
        },
        {
            "text": "In January 2023, Parliament approved a new legally-binding target to halve the length of rivers polluted by abandoned metal mines by 2038. This target, explained in the Environmental Improvement Plan, will be achieved through the Water and Abandoned Metal Mines (WAMM) Programme, a partnership between the Environment Agency, the Coal Authority and Defra. You can find out more about the programme in our YouTube video, Cleaning up rivers polluted by historical metal mining. "
        },
        {
            "text": "Nature-based treatment solutions can remove metals from mine water  "
        },
        {
            "text": "We estimate that up to 40 new mine water treatment schemes are needed to achieve this new target, and a similar number of measures to control pollution from mine wastes. The main way to clean up this pollution is to capture the metals in mine water treatment schemes before they can enter rivers. Where possible, we try to use nature-based solutions as they have lower whole-life cycle costs and a much smaller carbon impact.  "
        },
        {
            "text": "Since 2014, the Force Crag treatment scheme has been using natural chemical and biological reactions to capture metals as the mine water passes through ponds containing compost and woodchips. Developed for the WAMM Programme by Newcastle University, together with the landowner, the National Trust, this was the first mine water scheme of its kind in Europe.  "
        },
        {
            "text": "Two other projects are currently being built – in the North Pennines where the Nent Haggs project will improve 60km of rivers, and Cornwall where the Coombe project is trialling a new treatment technology. You can read more in our stakeholder newsletter.  "
        },
        {
            "text": "Wheal Jane and the Carnon River "
        },
        {
            "text": "Tin, arsenic, copper, silver and zinc were dug out of the Wheal Jane mine from the mid 18th century until it finally closed in 1991 when the mine water pumps were switched off. The mine workings gradually filled up with rain water with devastating effect - in January 1992, 50 million litres of extremely acidic water was released in a single day, turning the Carnon River and the Fal Estuary orange but also polluting them with invisible harmful metals. The Government built a system to treat the mine water which is now managed by the Coal Authority as part of the Defra-funded WAMM Programme.  "
        },
        {
            "text": "The Wheal Jane system works by pumping mine water from underground before it can pollute the river, and adding chemicals to capture the metals in reaction tanks. In a typical year, 5.6 billion litres of mine water are treated – equivalent to 6 Olympic swimming pools each day – preventing 800 tonnes of harmful metals from polluting the environment.  "
        },
        {
            "text": "For their 5 February episode, BBC Countryfile interviewed the Environment Agency and the Coal Authority at the Great County Adit – a huge mine water drainage tunnel that is not yet being treated – and the Wheal Jane scheme. You can watch this at BBC One - Countryfile, Underground Britain. "
        },
        {
            "text": "To read more about the WAMM partnership work, please visit Metal mine water treatment (gov.uk). "
        }
    ]
}