{
    "url": "https://ruralpayments.blog.gov.uk/2023/02/07/countryside-stewardship-higher-tier-now-open-for-applications/",
    "title": "Countryside Stewardship Higher Tier now open for applications",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Countryside Stewardship"
    ],
    "pub_date": "2023-02-07T14:45:12+00:00",
    "content": [
        {
            "text": "Today we have opened the application window for Countryside Stewardship (CS) Higher Tier (HT) revenue agreements which will begin 1 January 2024, and we wanted to share some information about the scheme for this year."
        },
        {
            "text": "HT is open to all eligible farmers and land managers, including those new to CS and those with existing CS and Environmental Stewardship (ES) agreements.  HT agreements are 5, 10 and sometimes 20-year agreements which support farmers and land managers to maintain some of our most environmentally important sites, including Sites of Special Scientific Interest, commons and woodlands. These are usually in places that need complex management, such as creating or restoring habitats, and improving woodland."
        },
        {
            "text": "We want to encourage applications for agri-environment options from all farmers and land managers, not just those who have already been approached by a Natural England adviser. In particular, applications are welcome from those who want to protect, restore, enhance or create habitats, such as flower rich hay meadows, heathland, moorland, and wood pasture, as well as managing other aspects of their land."
        },
        {
            "text": "For woodland management, farmers and land managers should look at developing a woodland management plan with the Forestry Commission which is needed to enter the woodland improvement option."
        },
        {
            "text": "If farmers and land managers would like more information then they can contact us, or speak to a Natural England or Forestry Commission adviser to discuss and agree the best mix of options, which will help to deliver the most for the environment based on the CS priorities in their local area."
        },
        {
            "text": "To give more flexibility, those applying for HT in 2023 will now be able to apply to add new items into the same parcel of land as an existing CS or Higher Level Stewardship (HLS) agreement as long as there is sufficient space in the parcel for both to exist side by side, the same items are not being funded twice and the actions required in the existing agreement and new application are compatible."
        },
        {
            "text": "In January, Farming Minister Mark Spencer announced an average increase of 10% for Countryside Stewardship revenue payment rates and we previously shared details of Capital Grant improvements, including increases to the duration of agreements and the introduction of new specialist HT capital items, which are also now available."
        },
        {
            "text": "CS schemes such as HT help to support the preservation of the countryside for future generations and CS remains a key part of the Government’s Agricultural Transition Plan. Along with the other environmental land management schemes CS will offer a viable, long-term source of income for providing environmental benefits as the Basic Payment Scheme (BPS) payments are reduced."
        },
        {
            "text": "The government recently announced, in their environmental land management update that in addition to enhancing Countryside Stewardship  – Countryside Stewardship Plus – will be introduced. CS Plus will deliver the same high environmental ambition previously planned for Local Nature Recovery, including managing floodplain meadows to reduce flood risk and improve biodiversity, restoring and maintaining peatland for carbon capture and storage, and enhancing and managing woodland to mitigate against drought and enhance its resilience to climate change."
        },
        {
            "text": "You can read our Countryside Stewardship guidance on GOV.UK and see the key dates for our schemes. Additionally, guidance for every scheme and grant on offer can be found on the Funding for farmers and land managers page on GOV.UK."
        },
        {
            "text": "Applications for CS HT agreements to start 1 January 2024 will close on 28 April 2023. Mid Tier and Wildlife Offer applications will be invited from later in March and more information will be shared nearer the time."
        }
    ]
}