{
    "url": "https://environmentagency.blog.gov.uk/2023/02/07/helping-to-keep-rivers-flowing-but-not-flooding/",
    "title": "Helping to keep rivers flowing but not flooding",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Environment Agency"
    ],
    "pub_date": "2023-02-07T15:04:51+00:00",
    "content": [
        {
            "text": "My team cover a large area around the River Stour catchment. Imagine the shape of a quarter of a round cheese with Reculver in the north, Ashford in the south, Dover in the east and around the coast to north Kent."
        },
        {
            "text": "My team’s main priority is to keep rivers clear and prevent flooding and this changes with the seasons. We cut weeds and desilt river channels to keep them clear and to prevent flooding. When flood risk is greater, we prepare by making sure that flood assets, trash screens and culverts are clear of obstructions."
        },
        {
            "text": "The work we cover is as diverse as the four seasons."
        },
        {
            "text": "Winter"
        },
        {
            "text": "From December to March, we clear fallen trees and brush wood that has collected in the rivers and streams over the winter."
        },
        {
            "text": "Part of our winter work is desilting which involves scraping a layer of sediment off the bottom of a watercourse to improve the flow of water."
        },
        {
            "text": "When desilting we always leave a 100-metre gap between sections. The gaps help maintain the existing wildlife habitat and encourage biodiversity but have little or no effect on overall flood risk in this river catchment."
        },
        {
            "text": "We frequently come across eels, a protected species, during weed-clearing and desilting. We always return them to the river or stream where they came from."
        },
        {
            "text": "The largest eel we’ve ever seen was about two feet foot long, just over half a metre!"
        },
        {
            "text": "Spring"
        },
        {
            "text": "When the threat of winter flooding is reduced, we carry out mowing, strimming and general maintenance. This includes cutting grass banks and clearing unwanted shrubbery to make sure that the banks remain in a stable condition."
        },
        {
            "text": "Along with regular grass cutting programmes, we try and keep wild areas uncut in May as part of ‘No Mow May’. Keeping these areas uncut gives a chance for nature to thrive so while we keep the access points to flood assets safe, we’ll cut only the minimum area required."
        },
        {
            "text": "Summer and Autumn"
        },
        {
            "text": "In hot and dry weather, we often help with fish rescues. Water levels are lower, due to higher heat levels, which results in less oxygen in the water and fish can suffer. We help by testing oxygen levels and use aerators to pump more oxygen into the water. In extreme situations we sometimes have to relocate fish into other watercourses. This is done very carefully by specialist fisheries officers who have expert knowledge on where fish can be moved safely, to avoid the risk of transferring invasive or non-native species to pristine watercourses."
        },
        {
            "text": "At the end of the bird nesting season after July until October, we are out removing in-channel weed by foot or on boats, and at the water’s edge weed cutting. This might go on until November in some places as the effects of climate change can keep things growing longer than they used to."
        },
        {
            "text": "Weed-cutting not only improves the flow and helps prevent flooding, but it also benefits wildlife and helps improve water quality."
        },
        {
            "text": "We also remove non-native invasive plants such as floating pennywort. If you see us out with large machinery, we may well be removing large green river carpets made up of weeds."
        },
        {
            "text": "All year round"
        },
        {
            "text": "Throughout the year, the team will work on repairs and maintenance of flood defence assets."
        },
        {
            "text": "These flood assets, as we refer to them, need to be inspected to make sure they are working as they should, and that they are safe to be worked on when needed. We check and maintain pumps and pipes and outfalls among other parts of the defence systems."
        },
        {
            "text": "We come across all types of wildlife in our work. We often see beavers, otters, seals, and water-living creatures such as eels. We are always careful not to disturb their habitats."
        },
        {
            "text": "Believe it or not, there is a growing population of beavers in the area. As they are a protected species, we must be careful not to disturb their lodges and dams, especially in the spring and summer when they are raising their young, known as kits."
        },
        {
            "text": "Call to action"
        },
        {
            "text": "But we can’t be everywhere at once and we need help from the public. Blockages to streams and rivers can happen very quickly and members of the public can report any obstructions such as fallen trees that could cause a blockage and increase food risk. If anyone suspects pollution or sees fish in distress, they should contact the Environment Agency incident hotline."
        },
        {
            "text": "To report incidents or concerns about the environment, or obstructions to rivers or streams, phone the free 24-hour incident hotline on 0800 80 70 60."
        },
        {
            "text": "You can keep up-to-date with Debbie’s work on Twitter at: https://twitter.com/DeTom48"
        }
    ]
}