{
    "url": "https://despatch.blog.gov.uk/2023/02/07/how-weve-improved-the-ready-to-pass-website/",
    "title": "How we’ve improved the 'Ready to Pass?' website",
    "authors": [
        "John Ploughman"
    ],
    "categories": [
        "Driving instructors",
        "Driving test",
        "Learning to drive",
        "Ready to Pass?",
        "Resources for instructors"
    ],
    "pub_date": "2023-02-07T12:22:17+00:00",
    "content": [
        {
            "text": "We launched the 'Ready to Pass?' campaign and the website on 18 July 2022. Hopefully you've had chance to visit."
        },
        {
            "text": "It's a one-page site that includes important information about the learning to drive process, mock tests, driving test nerves and how the test works."
        },
        {
            "text": "Since it launched we've had lots of visitors to the website. Lots of learners have taken driving tests and filled in a survey about their experience. And we've had lots of feedback from driving instructors too."
        },
        {
            "text": "The last 6 months have helped us learn a lot about how the website is working."
        },
        {
            "text": "So today (Tuesday 7 February 2023), we've launched an improved and expanded website. It’s still at www.gov.uk/ready-to-pass. I want to take you behind the scenes to explain what we’ve learned and what we’ve changed."
        },
        {
            "heading": 2,
            "text": "What we've learned"
        },
        {
            "text": "From the website, we've been able to see that:"
        },
        {
            "heading": 3,
            "text": "What the post-driving test survey shows"
        },
        {
            "text": "When we email the driving test result to your pupils at the end of their test, it includes a link to a survey to tell us about their experience. We've been asking questions about how they prepared for their test, and this has helped us to learn a lot."
        },
        {
            "text": "We've seen that:"
        },
        {
            "text": "We've also seen lots of comments from the survey about how nerves and anxiety have affected learners."
        },
        {
            "heading": 3,
            "text": "How different preparation affects the pass rate"
        },
        {
            "text": "Analysing the survey data further shows us some interesting things about the pass rate (we know from the survey if the learner passed or failed)."
        },
        {
            "text": "The analysis shows the average pass rate is:"
        },
        {
            "text": "It also shows the average pass rate is:"
        },
        {
            "heading": 3,
            "text": "Rate of mental disorders among 17 to 19 year olds increased in 2022"
        },
        {
            "text": "Recent research published by NHS Digital has shown how there has been an increase in the number of young people who probably have a mental health disorder."
        },
        {
            "text": "In people aged 17 to 19 years, rates of probable mental disorder have been rising for some time. The rates were:"
        },
        {
            "text": "The latest data shows it increased again to 1 in 4 in 2022."
        },
        {
            "text": "It's one of the reasons techniques such as mindfulness are becoming more and more common."
        },
        {
            "heading": 2,
            "text": "Turning these insights into changes"
        },
        {
            "text": "On the improved and expanded website, we’ve added, improved and refined a number of things."
        },
        {
            "heading": 3,
            "text": "New content"
        },
        {
            "text": "We have added:"
        },
        {
            "heading": 3,
            "text": "More detail"
        },
        {
            "text": "We’ve given more detail. This includes:"
        },
        {
            "text": "San Harper, an approved driving instructor and accredited mindfulness teacher, blogged about how mindfulness can help you and your pupils last year. I'd encourage you to take a look at this if you'd like to learn more."
        },
        {
            "heading": 3,
            "text": "Improved wording"
        },
        {
            "text": "We’ve also improved wording throughout the website in response to feedback. This includes the main ‘Ready to Pass?’ checklist, so do make sure you download the latest version if you’re giving printed versions to your pupils."
        },
        {
            "heading": 2,
            "text": "How you can continue to support the campaign"
        },
        {
            "text": "We’ve been really grateful for all the support we’ve had so far from driving instructors."
        },
        {
            "text": "There are 3 things you can do now to continue your support, and continue to help us develop the campaign. So please do:"
        },
        {
            "text": "I hope you and your pupils find the improved website useful."
        }
    ]
}