{
    "url": "https://educationhub.blog.gov.uk/2023/02/07/how-were-helping-look-after-the-mental-health-of-children-and-young-people/",
    "title": "How we’re helping look after the mental health of children and young people",
    "authors": [
        "media officer"
    ],
    "categories": [
        "Mental Health"
    ],
    "pub_date": "2023-02-07T12:47:57+00:00",
    "content": [
        {
            "text": "Schools and colleges play an important role in promoting and supporting the positive mental health and wellbeing of pupils and students."
        },
        {
            "text": "That’s why we have published our fourth annual State of the Nation report, which focuses on trends in mental health and wellbeing in academic year 2021/22, as well as children and young people’s views about society and the future."
        },
        {
            "text": " It’s designed to help the people working with children understand the bigger picture when it comes to children’s wellbeing."
        },
        {
            "text": "Here we explain more."
        },
        {
            "heading": 3,
            "text": "What does the report say about children’s wellbeing and mental health?"
        },
        {
            "text": "The report presents a mixed picture regarding the current state of children and young people’s wellbeing and related experiences, including mental health."
        },
        {
            "text": "Some measures indicate recovery to pre-pandemic levels. These include happiness, life satisfaction, feeling life is worthwhile, and participation in extra-curricular activities and physical activities."
        },
        {
            "text": "However, some measures, such as levels of likely mental disorder for school age children, have remained elevated but stable, while other measures, including anxiousness for older young people, have worsened."
        },
        {
            "heading": 3,
            "text": "What is being done to help schools and colleges to promote and support the mental health of children and young people? "
        },
        {
            "text": "We are supporting schools and colleges to provide learning environments that promote mental wellbeing, explore individuals’ needs and offer appropriate targeted support to children and young people."
        },
        {
            "text": "Over 10,000 schools and colleges have now claimed a grant to train a senior mental health lead, helping them to develop their approach to mental health and wellbeing, backed by £10 million in 2022/23. Schools and colleges are encouraged to claim a grant now and book training this academic year."
        },
        {
            "text": "We are also developing an online hub hosting a wide range of practical and evidence-informed resources for mental health leads, and a toolkit to help schools and colleges to identify options and develop their targeted pastoral support offer for pupils and students with Social, Emotional and Mental Health (SEMH) needs. These will be available later this year."
        },
        {
            "text": "To expand access to early mental health support in schools and colleges, we are also increasing the number of Mental Health Support Teams (MHSTs)."
        },
        {
            "text": "MHSTs offer support in schools and colleges, including for common mental wellbeing issues such as anxiety and low mood. They also support a setting to develop their approach to mental health and wellbeing, and to liaise with specialist services in the community where needed."
        },
        {
            "text": "As of Spring 2022, there were 287 MHSTs in over 4,700 schools and colleges. More teams are on the way, and we are anticipating 500 MHSTs will be up and running by 2024."
        },
        {
            "heading": 3,
            "text": "What about teaching about mental health in school?"
        },
        {
            "text": "We want to support all children and young people to be happy, healthy and safe. This is why, as of September 2020, our Relationships, Sex and Health Education (RSHE) curriculum has a strong focus on mental health and wellbeing."
        },
        {
            "text": "Pupils are taught how to recognise the early signs of mental wellbeing concerns, including common types of mental ill health (e.g., anxiety and depression), in themselves and others."
        },
        {
            "text": "They are also taught where and how to seek support, including who they can speak to in school if they are worried about their own or someone else’s mental wellbeing or ability to control their emotions (including issues arising online)."
        },
        {
            "text": "These mental health resources have been put together so that children and young people, parents, carers, and school and college staff can get the advice and help they need."
        },
        {
            "heading": 3,
            "text": "What are you doing to help children with mental health issues continue to attend school?"
        },
        {
            "text": "We know that some pupils, such as some of those with social, emotional or mental health needs, may face greater barriers to attendance than others."
        },
        {
            "text": "In addition to the existing advice on the holistic approach to promoting wellbeing, funding for training and the roll out of mental health support teams, we have published attendance guidance titled ‘working together to improve school attendance’.  "
        },
        {
            "text": "This aims to ensure all pupils receive the support they need to remove these barriers, including those with mental health and wellbeing related challenges,"
        },
        {
            "text": "This makes clear the expectations on schools where a child experiences a mental health issue that is affecting attendance, including that they work with parents and carers at an early stage so that children receive the individual support that they need to keep them coming to school."
        },
        {
            "heading": 3,
            "text": "What about older students – like those at university? Is there any additional support available for them too?"
        },
        {
            "text": "Yes. The mental health and wellbeing of students, including suicide prevention, is extremely important to us, which is why we have asked the Office for Students to allocate £15m towards student mental health and asked the Office for National Statistics to provide a more regular analysis of student suicide data."
        },
        {
            "text": "We support the University Mental Health Charter led by Student Minds, and developed in collaboration with students, staff, and partner organisations."
        },
        {
            "text": "To make sure that all students have access to dedicated mental health support no matter where they study, the Office for Students (OfS) and HE Funding Council Wales (HEFCW) funded Student Space with up to £3.6m."
        },
        {
            "text": "Launched in August 2020, Student Space is an online mental health platform available to all higher education students across England and Wales."
        },
        {
            "text": "Led by student mental health charity Student Minds, the platform was developed collaboratively with services, higher education professionals, researchers and students to complement the existing mental health and wellbeing services available to students."
        },
        {
            "text": "Student Space offers higher education students a range of mental health and wellbeing services, such one-to-one support through a mix of counselling, email and phone helpline support in addition to key information and advice."
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}