{
    "url": "https://insidedvla.blog.gov.uk/2023/02/07/in-conversation-with-our-digital-apprentices-donna-and-tom/",
    "title": "In conversation with our digital apprentices, Donna and Tom",
    "authors": [
        "Donna Wright",
        "Tom Pritchard"
    ],
    "categories": [
        "Features"
    ],
    "pub_date": "2023-02-07T12:05:25+00:00",
    "content": [
        {
            "text": "This week is National Apprenticeship Week – an annual celebration of apprentices around the country. To mark the occasion, Donna and Tom share their experience of completing a digital degree whilst working at DVLA."
        },
        {
            "heading": 2,
            "text": "Who are you and how long have you worked at DVLA?"
        },
        {
            "text": "Donna: My name is Donna and I’m a Lead Security Operations Centre (SOC) Specialist at DVLA. I’ve worked at the agency since I was 17, joining as a Contact Centre Advisor and progressing into cyber security in 2017."
        },
        {
            "text": "Tom: My name is Tom and I’m a Senior SOC Specialist at DVLA. I’ve worked at DVLA for 7 years, with 5 of those on my current team within cyber security."
        },
        {
            "heading": 2,
            "text": "How did you begin your digital degree whilst working at DVLA?"
        },
        {
            "text": "Donna: When I found out that the University of Wales Trinity Saint David (UWTSD) was launching computing degrees in partnership with the Welsh Government, I was keen to learn more. The Computer Networks and Cyber Security degree perfectly complimented my role at DVLA."
        },
        {
            "text": "As I had previously completed an apprenticeship, I understood that this would be a big commitment and would take a lot of work on my part."
        },
        {
            "text": "We were the first cohort so it was a completely new experience. The apprenticeship required us to attend university one day a week, and we had access to training resources such as Udemy which allowed us to complete additional learning."
        },
        {
            "text": "Tom: During my first year on the Cyber Security team, I became aware of an opportunity to join the Digital Degree Apprenticeship Scheme with UWTSD. I put in an expression of interest to my managers and was successful in gaining a place. I began my digital degree in September 2018, and it took me 4 years to complete."
        },
        {
            "text": "I found it challenging to study alongside work, however DVLA allowed me one day a week to attend university lectures, which was a big help."
        },
        {
            "heading": 2,
            "text": "What have you learned throughout your degree?"
        },
        {
            "text": "Donna: The degree was a great opportunity to build on my existing knowledge and learn new disciplines. Whilst I had existing knowledge of cyber security, the course also included a number of computer networks modules which I thoroughly enjoyed."
        },
        {
            "text": "A lot of work in the final year focused on device configuration. Due to restrictions, we were tasked with using simulated labs rather than real-life hardware. I embraced the change and really enjoyed the challenge of using simulated labs. This experience enabled me to learn even more skills, and the university provided us with additional resources to support us."
        },
        {
            "text": "Tom: The flexibility of the degree allowed me to explore modules that I had a keen interest in. With the support of my managers, I was able to pursue areas that allowed me to build a strong skillset beneficial to myself and my team, whilst making my experience on the degree enjoyable."
        },
        {
            "text": "Not only did I expand my knowledge in the field of cyber security, but I also enhanced my soft skills. I remained focused by keeping my eye on the final goal and made sure to plan my days efficiently, whilst still making time for my personal life. This is a technique I now use in my day-to-day life to self-motivate whenever faced with challenges."
        },
        {
            "heading": 2,
            "text": "How has the degree assisted your career progression?"
        },
        {
            "text": "Donna: The knowledge I’ve gained throughout the degree has assisted my overall understanding of the agency’s network and has improved the advice and guidance I give. I’m able to identify training opportunities for team members to further enhance ways of working and strengthen our team capability."
        },
        {
            "text": "Tom: Throughout the degree, I’ve been fortunate to achieve 2 promotions. The ability to discuss topics I’ve worked on throughout my course has given me an extra skillset that I’m able to bring forward in applications and interviews."
        },
        {
            "text": "Due to the variety of topics covered, I’ve been able to explore many related areas of study alongside my main role and bring new ideas into my work."
        },
        {
            "heading": 2,
            "text": "What have you enjoyed most about your experience?"
        },
        {
            "text": "Donna: I enjoyed meeting new people from other companies with varying levels of experience in the topics we covered. It was great to share ideas and support each other throughout the 4 years."
        },
        {
            "text": "Tom: I’ve enjoyed learning new skills that apply directly to my work as it has built my confidence and strengthened my abilities. On a personal level, overcoming competing demands in my life whilst still being able to succeed has given me a great sense of achievement."
        },
        {
            "heading": 2,
            "text": "What advice would you give to someone thinking of starting a digital degree?"
        },
        {
            "text": "Donna: Unlike traditional learning, a digital degree apprenticeship lets you use your skills in the real world as you’re learning. You can develop at a faster pace and it gives you real context to what you’ve learned. The best advice I could give to anyone starting a digital degree apprenticeship is to make sure you manage your time between work, home life, and university."
        },
        {
            "text": "Tom: I think a digital degree apprenticeship is a great option for those looking for a less traditional approach to study. By completing the course alongside work, you’re able to support yourself whilst working towards your development and growing the abilities of your team with your new skillset."
        },
        {
            "heading": 2,
            "text": "Take a look at our apprenticeships"
        },
        {
            "text": "Apprenticeships are a great way to develop and nurture new talent. Our Centre of Digital Excellence development programmes are based on this principle and combine learning opportunities alongside ‘real world’ work experience."
        },
        {
            "text": "Explore what DVLA’s development programmes have to offer and sign up to Civil Service Jobs for future opportunities."
        }
    ]
}