{
    "url": "https://nda.blog.gov.uk/tackling-inequality-is-everyones-business-uzy-michael-programme-manager-nda/",
    "title": "Tackling Inequality is Everyone's Business - Uzy Michael, Programme Manager, NDA",
    "authors": [
        "samfrench"
    ],
    "categories": [
        "diversity",
        "Safety and Wellbeing"
    ],
    "pub_date": "2023-02-07T08:10:45+00:00",
    "content": [
        {
            "text": "This Race Equality Week I am reflecting on my own experiences and reflections on the barriers to race inequality."
        },
        {
            "text": "I have recently celebrated my one-year work anniversary at the NDA, and I am happy to be working for an organisation that shares similar values to myself. I am happy to be working for an organisation that is actively and progressively taking steps to make the work environment more diverse and inclusive, recognising the value we all bring – irrespective of race, gender, sex, age, religious beliefs, or any other differences."
        },
        {
            "text": "Born and raised in Nigeria, at the tender age of 16; I travelled over 3,200 miles to what would become my new home – the UK – to further my studies at A-Levels."
        },
        {
            "text": "I went to school in a very British little market town called Oswestry, living as a boarder with hundreds of others who looked, spoke, and thought differently from me. I was one of the only two black African students in the school when I joined."
        },
        {
            "text": "Moving to school in the UK was my first experience of the need to enable a more diverse and inclusive environment for all to thrive, both individually and collectively. With the support of the school, teachers, and friends I was able to settle in  and perform well as I felt included."
        },
        {
            "text": "I was empowered through my four years at university by the diversity in the city of Manchester. There were many others like myself who spoke with an accent like mine, looked physically like me – black (and I was not bald at the time!) and had lived through similar experiences coming from Africa. I could grab a plate of jollof rice (a lovely West African dish I recommend you try – thank me later!) with some foreign export Nigerian Guinness easily. I attended clubs and parties with an afrobeat theme as I was used to back at home in Nigeria. These were some of the best times in the UK for me."
        },
        {
            "text": "I secured a job with EDF Energy on the Science & Engineering graduate scheme. I had six rotations across the country which meant that over 16 months I lived in 6 different parts of the UK. I quickly realised I had to work on my ability to integrate better amongst the different cultures as well as be willing to share my story with others and integrate them into my culture."
        },
        {
            "text": "Working in the corporate environment, with a desire to grow into leadership I began to attend some sessions held by the Young Professionals Network (YPN) where senior leaders within the business would attend and give their experiences and even offer to mentor us."
        },
        {
            "text": "Fast forward to when I moved to the Hinkley Point C project as a project manager, I noticed that there was no such network supporting young professionals specifically. I offered my time and efforts to set up the Nuclear New Build Young Professionals Network becoming the Deputy Chair of the EDF Young Professionals Network covering Hinkley C, Sizewell C and Bradwell B."
        },
        {
            "text": "Since then, I have been an advocate for diversity and inclusion. When I worked in business development and investments at EDF Renewables; I contributed significantly in running sessions on unconscious bias and allyship most especially at the height of the Black Lives Matter movement following the death of George Floyd."
        },
        {
            "text": "I encourage everyone to take some time to reflect on their experiences and how it differs from others’. An ally is not necessarily a member of a marginalised group but someone who wants to support and take action to help others in that group. Is there someone who is of a different race, gender, or age and as such feels unable to contribute as much as others in team discussions? Could you be the ally the person needs to encourage them? Have you noticed any signs of discrimination based on differences? Could you step up and speak up?"
        },
        {
            "text": "There are some steps to take in becoming a better ally – educate yourself, own your privilege, accept feedback, become a confidant, bring diversity to the table, amongst so many others. This Harvard Business Review article gives some good ways to practice active allyship.  You can also find good resources on the official Race Equality Matters website: Race Equality Week - Race Equality Matters"
        },
        {
            "text": "Also, I encourage you to reflect on any unconscious bias you may have. Are your beliefs and views about other people right and truly reasonable – or are they just a product of your lived experiences? It is important to really keep an open mind when reflecting on this because these biases are outside our conscious awareness and control. Unconscious bias affects everyone. There are several types of unconscious bias that could be experienced at work. This Bulletin article gives some good examples of unconscious biases and how to avoid them in the workplace."
        },
        {
            "text": "Moving from West Africa to Europe at a young age engrained my beliefs on the importance of allyship and breaking the chains of unconscious bias in tackling one of the biggest potential disruptors to really optimising value in the world as a global community where people are treated with respect, equity, and fairness and as a result; we bring out the best in people further bettering humanity."
        },
        {
            "text": "Allyship is the key to unlocking the power of diversity and any unconscious bias need to be broken to really embody the right behaviours required."
        },
        {
            "text": "Find out more about the NDA group’s diversity and inclusion priorities here: The NDA group inclusion strategy 2021 to 2025 - GOV.UK (www.gov.uk)"
        }
    ]
}