{
    "url": "https://ukhsa.blog.gov.uk/2023/02/07/the-triple-burden-of-flu-rsv-and-covid-19/",
    "title": "The triple burden of flu, RSV and COVID-19",
    "authors": [
        "Victoria Hall",
        "Anna Howells"
    ],
    "categories": [
        "Coronavirus (COVID-19)",
        "flu"
    ],
    "pub_date": "2023-02-07T17:18:17+01:00",
    "content": [
        {
            "text": "In November 2022 the SARS-CoV2 Immunity and Reinfection Evaluation study, or SIREN for short, expanded to study flu and Respiratory Syncytial Virus (RSV)."
        },
        {
            "text": "The COVID-19 pandemic provided a masterclass in how to rapidly build understanding of a virus – with new studies rolled out, unprecedented levels of data collected, and scores of dedicated researchers tasked with translating this data into answers about the virus."
        },
        {
            "heading": 2,
            "text": "What is SIREN?"
        },
        {
            "text": "SIREN is a nationwide study involving over 44,000 healthcare workers at 135 NHS organisations. The SIREN study was established early in the COVID-19 pandemic, and we have been following participants for over two years now – collecting regular PCR swabs and blood samples from an incredibly dedicated cohort of NHS workers who volunteer their time."
        },
        {
            "text": "Flu, or influenza, is a highly infectious respiratory virus. In the UK the flu season runs from around October to March, with most cases occurring between December and February."
        },
        {
            "text": "Each year flu is a major area of focus for healthcare workers and researchers aiming to protect the UK population. This includes the development and rollout of a vaccine, providing a seasonal information campaign on the virus, and treating those who become really unwell."
        },
        {
            "text": "We saw reduced flu transmission resulting in lower flu levels during the COVID-19 pandemic, thanks to social distancing measures and widespread use of face coverings. The relaxing of these measures means that flu is circulating at higher levels, increasing the burden on healthcare settings."
        },
        {
            "text": "SIREN will also investigate the impact of RSV infection on healthcare workers as part of this expansion. Like the flu, RSV is a highly infectious respiratory virus, and accounts for over half a million GP appointments and over 40,000 hospitalisations a year, largely affecting young children and the elderly."
        },
        {
            "heading": 2,
            "text": "Gaps in our knowledge"
        },
        {
            "text": "This has been a difficult winter for the NHS and we know that flu puts a strain on the system each year. Learning more about the burden of flu and other respiratory viruses on both the NHS and wider population is important. We do not currently have accurate estimates of the levels of flu circulating among healthcare workers."
        },
        {
            "text": "One reason for this is that we do not know how many people have flu without experiencing symptoms. In addition, we do not yet understand how flu interacts with COVID-19 and what impact this may have.  This is particularly important now that we have moved into a phase in the pandemic where protection measures have reduced, and flu and COVID-19 are circulating at the same time."
        },
        {
            "text": "Knowing more about flu, along with RSV and COVID-19, could help hospitals and policy makers plan effectively for future winters. It is crucial to understand the extent of the burden respiratory viruses place on healthcare workers so that employers can look after the health and wellbeing of staff, which is important in its own right and the foundation of high-quality patient care."
        },
        {
            "heading": 2,
            "text": "How is the SIREN study looking to fill these knowledge gaps"
        },
        {
            "text": "Analysis of SIREN samples has helped the UK to evaluate the immune response to COVID-19, provided insight into COVID-19 reinfections and has helped us to build an understanding of the level of protection offered by vaccines. SIREN has helped answer some of the most pressing questions about COVID-19, enabling decision-makers – both national and locally – to control the spread of the disease."
        },
        {
            "text": "SIREN is now turning its attentions to flu and RSV as well as COVID-19. SIREN is uniquely placed to study the impact of additional respiratory viruses – making the most of the samples provided by our fantastic cohort, the data systems we have built and the research collaborations across the UK we have forged, to help answer the most pressing questions."
        },
        {
            "text": "Some of the key questions we hope to answer are:"
        },
        {
            "text": "We would like to thank the NHS organisations, research teams and lab staff across the UK who have made the SIREN Flu and Winter Pressures sub-study possible, in addition to each and every NHS staff member participating – we could not do this without you."
        },
        {
            "text": "The SIREN Flu and Winter Pressures sub-study is funded by UKHSA with support from Public Health Scotland, Public Health Wales and the Public Health Agency Northern Ireland. We are pleased to share that the sub-study has also recently been awarded grant funding by Health Data Research UK (HDR UK). SIREN is one of 16 research studies chosen to examine how winter pressures faced by the NHS can be eased."
        },
        {
            "text": "You can find more information about the SIREN study here."
        }
    ]
}