{
    "url": "https://defrafarming.blog.gov.uk/2023/02/07/the-annual-health-and-welfare-review-rolling-out-yearly-vet-visits/",
    "title": "The Annual Health and Welfare Review: rolling out yearly vet visits",
    "authors": [
        "Stewart Houston CBE"
    ],
    "categories": [
        "Guest post",
        "Payments to improve animal health and welfare"
    ],
    "pub_date": "2023-02-07T12:00:22+00:00",
    "content": [
        {
            "text": "At around this time last year, I wrote a post introducing the Animal Health and Welfare Pathway. "
        },
        {
            "text": "The Animal Health and Welfare Pathway supports continued improvements in farm animal health and welfare in England. It is very much a partnership, designed by farmers, vets and colleagues in Defra. "
        },
        {
            "text": "I’m pleased to tell you that the first step on the Pathway, the SFI Annual Health and Welfare Review, is now ready to be rolled out.  "
        },
        {
            "heading": 2,
            "text": "The Annual Health and Welfare Review: a recap  "
        },
        {
            "text": "The Annual Health and Welfare Review is a funded annual visit from your chosen vet or team of vets.  "
        },
        {
            "text": "It can be undertaken whenever it works for you. It will allow you and your vet to concentrate on your animals’ specific health and welfare priorities. "
        },
        {
            "text": "During the visit, your vet will provide you with bespoke advice. They’ll also carry out some diagnostic testing around endemic diseases — these were agreed by the farmers and vets who helped to design the Pathway. "
        },
        {
            "text": "Since last September, we’ve been testing these vet visits with volunteer vets and farmers.  "
        },
        {
            "text": "We’re very grateful for their input and we’re ready for a gentle start as we learn quickly, add new features and bring in more users to the new IT system set up for the sole use of the Pathway. "
        },
        {
            "text": "The feedback we’ve had from those who’ve taken part in the testing is really encouraging. They commented on how straightforward it was to sign up, the effectiveness of the visit and the promptness of the payments.  "
        },
        {
            "text": "We really encourage you to consider the offer. It’s an opportunity to boost your profitability and prevent you from losing money through endemic disease and conditions such as lameness. "
        },
        {
            "heading": 2,
            "text": "Signing up "
        },
        {
            "text": "The first step is to register your interest on GOV.UK.  "
        },
        {
            "text": "Initially, only BPS (Basic Payment Scheme) eligible farmers will be able to register.  "
        },
        {
            "text": "You’ll only be able to register for one review. We are working to expand this to allow multiple reviews, including for multiple species in the future.  "
        },
        {
            "text": "Registering your interest is simple. It will take about 5 minutes. "
        },
        {
            "text": "You must register your interest before you can apply for a review. This is so we can manage the process and make sure you get a good service. "
        },
        {
            "text": "When we’ve checked that you’re eligible you’ll receive an email inviting you to apply. This includes a link to the guidance. "
        },
        {
            "text": "The official guidance on eligibility can be found on GOV.UK. Do take a look before you register. "
        },
        {
            "text": "If you are a vet and want to know more about your role in the review, we’ve published guidance for vets on GOV.UK.  "
        },
        {
            "text": "Watch our guide on how to apply for an Annual Health and Welfare Review of your livestock."
        },
        {
            "heading": 2,
            "text": "Payment rates "
        },
        {
            "text": "The payment rates, which will include the cost of the vet’s time and the diagnostic testing have been agreed at: "
        },
        {
            "text": "The difference in the species rates is down to the cost of the diagnostic tests, not because pigs are in any way favourites! "
        },
        {
            "heading": 2,
            "text": "Future steps  "
        },
        {
            "text": "As soon as we have tested the service and it is ready to be made available to more farmers, we will gradually, step by step, open the program up to non-BPS registered farmers, large and small."
        },
        {
            "text": " This will allow you to include other farm livestock in your care and make a direct application instead of registering your interest first. "
        },
        {
            "text": "We’ll learn lessons from the initial roll out and reflect what we learn in improvements to the service as we go. "
        },
        {
            "text": "This really is a great opportunity to make a difference to the health and welfare of the animals in your care, and I’m going to keep blogging until you are all signed up! "
        }
    ]
}