{
    "url": "https://defrafarming.blog.gov.uk/2023/02/07/tree-health-pilot-our-improvements-and-progress/",
    "title": "Tree Health Pilot: our improvements and progress",
    "authors": [
        "Joe Harrison"
    ],
    "categories": [
        "Payments to improve tree health"
    ],
    "pub_date": "2023-02-07T10:00:14+00:00",
    "content": [
        {
            "text": "The Tree Health Pilot is a 3-year scheme which tests different ways of slowing the spread of tree pests and diseases as well as building the resilience of trees across England.  "
        },
        {
            "text": "The pilot, which began in August 2021, will run until 2024. What we learn from the pilot will inform the design of the future Tree Health Scheme. This will be rolled out through our environmental land management schemes when the pilot ends. "
        },
        {
            "text": "Using what we’ve learned so far from testing and feedback, we’ve made a number of improvements to better support land managers to deal with tree pests and diseases.  "
        },
        {
            "text": "In this post, I’d like to share a short summary of the pilot and the improvements we’ve made to the scheme. "
        },
        {
            "text": "It’s not too late for you to take part, so I’ll also include details of how you can get involved.  "
        },
        {
            "heading": 2,
            "text": "Recap "
        },
        {
            "text": "Funding from the pilot can go towards a range of measures including: "
        },
        {
            "text": "The Tree Health Pilot guidance on GOV.UK sets out the aims of the pilot in detail."
        },
        {
            "heading": 2,
            "text": "Our improvements "
        },
        {
            "text": "Through our monitoring and evaluation work, we've gathered feedback from pilot participants over the past year. "
        },
        {
            "text": "We conducted workshops, interviews and surveys with farmers, land managers and stakeholders, as well as our delivery teams, to examine the offer in depth. Their experiences shaped our support."
        },
        {
            "text": "The insight we gained directly feeds into our improvements, which I'll go into below.    "
        },
        {
            "heading": 3,
            "text": "The payments process "
        },
        {
            "text": "We removed the need for land managers to acquire multiple quotes for felling operations during the application stage.  "
        },
        {
            "text": "Instead, grant holders will be able to claim for costs incurred, up to a maximum cap using market rates and based on the overall net cost of the work carried out."
        },
        {
            "text": "We recognised gathering multiple quotes proved difficult. This improvement will mean land managers are paid quicker and, crucially, swift action can be taken to reduce the spread of tree pests and diseases across the country. "
        },
        {
            "heading": 3,
            "text": "New advice package "
        },
        {
            "text": "Recognising that some farmers and land managers may not be used to dealing with tree health issues, we have bolstered our support. "
        },
        {
            "text": "The pilot now offers a new advice package which is available to land managers issued with Statutory Plant Health Notices within the pilot’s target areas. "
        },
        {
            "text": "It aims to build land managers knowledge and awareness of tree health issues, biosecurity and woodland management. "
        },
        {
            "text": "By contributing to the costs of agent advice and training, this advice package will improve land managers ability to identify and deal with tree health issues, including responding to Statutory Plant Health Notices. "
        },
        {
            "text": "In full, the package includes funding for a forestry/land agent consultation to assist land managers in creating a biosecurity management plan, and funding for a personal biosecurity kit, signage and training.  "
        },
        {
            "heading": 3,
            "text": "Improved guidance "
        },
        {
            "text": "A new scheme manual has been published with improved guidance. You can find this on GOV.UK."
        },
        {
            "text": "The application form and processes have been simplified to reduce the administrative demand on applicants.  "
        },
        {
            "heading": 3,
            "text": "Increase in standard capital cost items "
        },
        {
            "text": "Standard capital cost items have increased, in line with new rate changes to the Countryside Stewardship and the England Woodland Creation Offer schemes.  "
        },
        {
            "text": "This includes higher rates for deer fencing and tree shelters. Maintenance rates to help ensure that newly planted trees grow successfully, have increased from £300 to £350 per hectare, per year.  "
        },
        {
            "text": "The fee paid to the lead facilitators of group applications is also increasing to £24 per hour to help cover coordination costs. "
        },
        {
            "text": "For more information on the updated scheme, including how the new payments process works and the maximum cap is calculated take a look at the Tree Health Pilot guidance."
        },
        {
            "heading": 2,
            "text": "Taking part"
        },
        {
            "text": "The pilot is still open for applications, so do consider taking part. "
        },
        {
            "text": "The Tree Health Pilot guidance covers: "
        },
        {
            "text": " If you think you might be eligible, we’d love to hear from you. "
        }
    ]
}