{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2024/10/17/black-history-month-uk-2024/",
    "title": "Black History Month UK 2024",
    "authors": [
        "gseprofession"
    ],
    "categories": [
        "Diversity & Inclusion",
        "Guest Blog"
    ],
    "pub_date": "2024-10-17T16:31:30+01:00",
    "content": [
        {
            "text": "As we move through October 2024, we once again celebrate Black History Month as a time dedicated to honouring the rich and diverse history, culture, and contributions of black individuals and communities. This month serves as a powerful reminder of the resilience, creativity, and strength that have shaped the black experience throughout history and continue to inspire us today."
        },
        {
            "text": "Black History Month UK 2024 is not just a reflection on the past, but a call to action for the present and future. It encourages us to recognise and address the ongoing challenges faced by black communities, while also celebrating the achievements and progress that has been made. From the arts and sciences to politics and social justice, black individuals have made lasting remarks on society."
        },
        {
            "text": "This year’s theme is ‘Reclaiming Narratives’ and is about revisiting history and taking ownership of the stories about culture, contributions and identity that define people from the black community. We will kick off our feature with a scientist and two notable engineers, who have made a great impact to our everyday lives."
        },
        {
            "text": "Dr Donald Palmer, is an immunologist known for his significant contributions to the field of immunology."
        },
        {
            "text": "Dr Palmer’s research focuses on understanding how the immune system changes with age and identifying markers on the surfaces of cells. His work has implications for understanding diseases such as cancer and infections. He has conducted post-doctoral work at Cancer Research UK and Imperial College London, contributing to advancements in cancer research and is currently an Associate Professor in Immunology at Royal Veterinary College, University of London. Dr Palmer is also co-founder of Reach Society, an award-winning social enterprise that aims at inspiring young black people, especially boys and young men, to realise their potential in various fields, including science. His work has had a lasting impact on the field of immunology and continues to inspire future generations of scientists. Hear about his story in his own words on this short You Tube clip."
        },
        {
            "text": "Elijah McCoy, (1844 – 1929) was an inventor and engineer known for his significant contributions to the field of lubrication technology. "
        },
        {
            "text": "McCoy is best known for inventing an automatic lubricator for steam engines. This device allowed trains and other machinery to be lubricated while in operation, significantly improving efficiency and reducing the need for maintenance stops. Over his lifetime, McCoy was awarded 57 U.S. patents, many of which were related to lubrication systems. His inventions were so effective that the familiar term, “the real McCoy” became synonymous with authenticity and high quality. His work had a profound impact on the railroad industry and other sectors that relied on heavy machinery. His innovations helped pave the way for more efficient industrial operations and set a high standard for engineering excellence."
        },
        {
            "text": "Dr George R. Carruthers, (1939 – 2020) was an astrophysicist and inventor. "
        },
        {
            "text": "Although he was born in the United States, Dr Carruthers’ contributions had a significant impact globally, including in the UK. He is best known for inventing the ultraviolet camera/spectrograph, which was used during the Apollo 16 mission in 1972. This device captured images of Earth’s outer atmosphere and deep space objects in ultraviolet light, providing valuable data for space research. Dr Carruthers’ invention was pivotal in advancing our understanding of space and the Earth’s atmosphere. His work has been recognised with numerous awards, and his contributions continue to inspire scientists and engineers worldwide. Find out more about him at the National Air and Sace Museum website."
        },
        {
            "text": "If you would like to contribute to this blog feature by sharing some words about a black scientist or engineer who is inspirational, please let us know at gse@go-science.gov.uk"
        }
    ]
}