{
    "url": "https://defraenvironment.blog.gov.uk/2024/10/17/connecting-climate-science-to-local-action-introducing-the-new-local-authority-climate-service/",
    "title": "Connecting climate science to local action: introducing the new Local Authority Climate Service ",
    "authors": [
        "Victoria Ramsey"
    ],
    "categories": [
        "Climate change",
        "Research and data analysis"
    ],
    "pub_date": "2024-10-17T13:12:08+01:00",
    "content": [
        {
            "text": "Climate change is presenting local authorities across the UK with a range of challenges, from increased flooding risks to soaring temperature. Each authority must consider how resilient they are to our changing climate and they are increasingly required to report on their actions to adapt to it. "
        },
        {
            "text": "Last week, the Met Office launched a new service to help them do this: the Local Authority Climate Service (LACS). "
        },
        {
            "text": "The LACS will provide local authorities with data about climate change in their area, to support decision-making and climate adaptation planning. "
        },
        {
            "text": "This new service fulfils a government commitment made in The Third National Adaptation Programme. It also builds on previous Met Office-led work, including the ‘city packs’ developed through the UK Climate Resilience Programme.  "
        },
        {
            "text": "I’m Victoria Ramsey. I’m part of the Met Office team that has been working closely with local authorities and other partners to develop the LACS. "
        },
        {
            "text": "The LACS generates tailored information for each local authority "
        },
        {
            "text": "The LACS is an interactive tool, which allows anyone to explore climate projections for their local area. "
        },
        {
            "text": "Users can generate a report that includes information on national and local climate changes. The report provides insights into the weather and climate hazards that may affect your area. "
        },
        {
            "text": "Feedback so far has been overwhelmingly positive "
        },
        {
            "text": "We have tested the service with local authorities and partners throughout the development process. They told us it “looks really helpful and something we have been very keen to have developed and be able to use when communicating the issues with all stakeholders.” "
        },
        {
            "text": "And, on the climate report that you can generate, another local authority told us it “is really easy to understand and would also work well as a comms piece with our members as it emphasises the importance of our work and the Council’s ambition. We liked the use of infographics, images and maps as we felt they were clear and gave a good overview. The information provided at a local level is also really helpful and goes into the right amount of detail.” "
        },
        {
            "text": "Anyone can use the service "
        },
        {
            "text": "While the service has been designed with local authorities in mind, anyone can use it. "
        },
        {
            "text": "You can access the service for free now on the Met Office Climate Data Portal.  "
        },
        {
            "text": "If you’d like to learn more, you can also watch a webinar recording in which we talk in more detail about what this new service offers, with a demonstration. "
        },
        {
            "text": "We welcome your feedback "
        },
        {
            "text": "The LACS is fully available right now. However, we expect to make upgrades to it from early 2025, with a larger one in around a year, as we gather more feedback from its users. "
        },
        {
            "text": "If you would like to get in touch, please use the feedback form or contact the team directly via email. "
        }
    ]
}