{
    "url": "https://ace.blog.gov.uk/2024/10/17/evolving-ace-sharing-the-latest-news-and-pipeline-updates-with-our-community/",
    "title": "Evolving ACE – sharing the latest news and pipeline updates with our community",
    "authors": [
        "Emma Firth"
    ],
    "categories": [
        "Academia",
        "People and skills"
    ],
    "pub_date": "2024-10-17T16:36:02+01:00",
    "content": [
        {
            "text": "Our second community event of the year was held in London this week, drawing in almost 200 people in person and online."
        },
        {
            "text": "Iain Wallace, head of market engagement, kicked off proceedings by explaining these community update and social events have now become so popular that ACE will be ‘mixing and matching’ by holding regional events in Cheltenham on November 7th and Manchester on November 15th, so even more community members will be able to attend."
        },
        {
            "text": "Since our last gathering, the Home Office has taken over the day-to-day running of ACE, and new Head of ACE Annette Southgate followed by introducing herself, expressing her enjoyment at getting out to meet customers and community members and noting that it was “brilliant to meet people who are incredibly passionate about the work we do”."
        },
        {
            "text": "Praising a “phenomenal role and a phenomenal team”, she stressed her desire for ACE to continue working on commissions that have a genuine impact as well as helping open opportunities that weren’t available before as part of changes taking place in government."
        },
        {
            "text": "She also explained how her background, especially her last three roles, had given her insights into different ways of working, and how academics could help support government."
        },
        {
            "text": "Euan Neill, ACE’s new head of innovation, told the room he feels “lucky” his role gives him a chance to be involved with ACE in a variety of ways, and said a key focus was how to continue to keep ACE growing, making it better and better."
        },
        {
            "text": "He said “The way ACE works, looks and feels from the inside is very impressive and very different to what you’d experience in government as a civil servant.”"
        },
        {
            "text": "He explained that many of the new government’s key missions are in areas where ACE has deep experience and expertise, and that much of the work being undertaken or explored across departments is underpinned by technology, which he called “a great opportunity”."
        },
        {
            "text": "Simon Christoforato, the CEO of Vivace, praised the great start from the Home Office team and said he “couldn’t have been happier to see Annette, Euan and Jess (the new head of strategic engagement) join, because they really get what ACE is about”."
        },
        {
            "text": "He said ambitious delivery targets set for the year were still possible, with “all to play for”."
        },
        {
            "text": "He then handed over to ACE’s team of engagement leads, who gave updates on pipeline and potential upcoming opportunities for the community in areas including public safety and law enforcement, security, defence, health and wider government departments."
        },
        {
            "text": "This was followed by a community Q&A and then a social – one of the most important and valued aspects of the event. "
        },
        {
            "text": "Suppliers and ACE core team members mingled and chatted about possible collaborations while sampling delicious Indian street food and cocktails supplied by community members Principle One, smart/tasking and Adappt."
        },
        {
            "text": "The sun even shone as the day closed on another successful ACE community networking event."
        }
    ]
}