{
    "url": "https://hmlandregistry.blog.gov.uk/2024/10/17/how-are-we-reducing-the-number-of-requisitions-we-send/",
    "title": "How are we reducing the number of requisitions we send?",
    "authors": [
        "Ilia Bowles, Head of Directorate Planning, HM Land Registry Service Delivery"
    ],
    "categories": [
        "Law and practice"
    ],
    "pub_date": "2024-10-17T11:43:31+01:00",
    "content": [
        {
            "text": "While our overriding focus is on reducing the age of our oldest applications, your feedback tells us that, if there’s one other thing we should focus on improving, it would be reducing the number of requisitions we send – along with greater consistency in raising them.  "
        },
        {
            "text": "We wholeheartedly agree: we don’t want to send requisitions any more than you want to receive them. "
        },
        {
            "text": "Therefore, we are changing our processes to improve our consistency with requisitions, looking at how can we make them clearer, and at how can we work with you to lessen the amount you receive. "
        },
        {
            "heading": 2,
            "text": "A shared goal "
        },
        {
            "text": "At HM Land Registry, we raise a requisition when something is missing from or wrong with an application. In each case, we take account of our practice requirements, the contents of the register, individual knowledge and experience, and the application as a whole. Spelling errors, missing deeds or blank panels erode confidence in the application, increasing the likelihood of a requisition.  "
        },
        {
            "text": "The bulk of requisitions we send relate to what you might consider to be minor issues, such as a typo in a name in the AP1 identity panels or a signature that, you might think, anyone should be able to work out.  "
        },
        {
            "text": "We do this because we are striving to accurately record the ownership of property and the loans raised against it, so it is vital we give all applications our absolute due diligence. We must work on the basis that it’s better to be safe than sorry, not only to compile a complete and correct register, but also to ensure our data is in optimal condition, prevent issues arising in transactions that have yet to take place and to safeguard against fraud. "
        },
        {
            "text": "Of course, we do sometimes make errors ourselves. A regular issue raised by customers is that our caseworkers are inconsistent with requisitions. After a thorough audit, we found an issue with approximately one in ten requisitions sent out.  "
        },
        {
            "text": "Our plan focuses on three main areas as part of a multifaceted approach: "
        },
        {
            "text": "It is crucial we do this. No matter the whos, whys and wherefores, requisitions take up your time and ours, clog up our respective systems and lead to delays in processing applications. Ultimately, they negatively affect our service to you and your service to your clients. "
        },
        {
            "text": "So we are very keen to reduce the number of requisitions we send. Last year, for example, we received more than 4.4 million applications, of which more than 947,000 (22%) required a requisition, each containing an average of two points, but many with more. "
        },
        {
            "heading": 2,
            "text": "Rising to the challenges "
        },
        {
            "text": "In recent years, we have focussed on training and recruitment to overcome the concurrent challenges of meeting increasing demand alongside developing quicker, more digital services. "
        },
        {
            "text": "We have unpicked our own training and internal guidance to help new caseworkers apply it effectively, reducing their need to send requisitions, while continuing to avoid risk.  "
        },
        {
            "text": "Now that more than 90% of registration applications are lodged digitally, we can start to use our channels to help eradicate errors at source. We are working on providing more data validation via portal and Business Gateway channels: for example, replacing lengthy manual post-submission checks with a system that instantly compares application details against the register before submission. "
        },
        {
            "text": "But investing in our own capacity can only ever be part of the story, so we’ve also been investing in providing more support to you in the process. "
        },
        {
            "heading": 2,
            "text": "Supporting you "
        },
        {
            "text": "We have developed a range of materials and solutions to assist you in making complete and correct applications that can sail through our systems with no hiccups. "
        },
        {
            "text": "We continue to add to a large range of tips, training resources and guidance, in various formats, to help you avoid requisitions. Last year, we gathered all our resources into one Training hub and introduced our ‘Essentials’ training package, designed to simplify our processes for new starters in conveyancing. Recently, we updated our Contact page on GOV.UK to ensure you can find what you need quickly and easily. "
        },
        {
            "text": "Our Specialist Support Services hub is available on portal and GOV.UK, offering direct access to assistance before lodging large-scale and complex commercial applications, or new residential estates. You can read about one of the services, Ask for Guidance, in our recent blog. And earlier this year we launched a social media campaign, demonstrating 10 simple tips to help you avoid more than 20 of the most frequent requisition points.  "
        },
        {
            "text": "Most recently, we have introduced live online workshops on avoiding requisitions, which include a Q&A with land registration experts. These have proven so popular we are adding extra dates in November: watch out for more details coming soon on email or LinkedIn. "
        },
        {
            "text": "We are always open to your suggestions, so if there’s an aspect of land registration that perplexes you, let us know: email training@landregistry.gov.uk "
        },
        {
            "heading": 2,
            "text": "A shared goal – let’s do this! "
        },
        {
            "text": "Together, we can tackle avoidable requisitions to deliver lasting, mutually beneficial changes. We’re here to help – let’s help each other. "
        },
        {
            "text": "In Part 2 of this blog, we’ll look at the scale of the challenge, how many requisitions we send in relation to 10 simple groupings and just how much these cost you, our customers. "
        }
    ]
}