{
    "url": "https://ipo.blog.gov.uk/2024/10/17/i-dare-you-to-say-ip-a-third-time/",
    "title": "I dare you to say IP a third time",
    "authors": [
        "Christina Watts"
    ],
    "categories": [
        "Business",
        "International",
        "Licensing",
        "Trade marks",
        "Uncategorized"
    ],
    "pub_date": "2024-10-17T12:21:05+01:00",
    "content": [
        {
            "text": "Spooky season is finally here and I for one cannot wait to see the streets filled with creative and spooky costumes. With the recent release of the sequel to the American 1988 classic movie ‘Beetlejuice’, I’m sure that I will bump into many people dressed head-to-toe in Spook-tacular, Beetlejuice-inspired costumes.  "
        },
        {
            "text": "While spending my time waiting for Halloween, I decided to distract myself by delving into the “Neitherworld” (the spooky ghost-filled domain from Beetlejuice) to learn about the role intellectual property (IP) has played in expanding the Beetlejuice universe. "
        },
        {
            "heading": 3,
            "text": "Don’t say their name? "
        },
        {
            "text": "Dare I say the name of the IP owners for the iconic franchise? Of course, I dare, I’m not scared! ‘Warner Bros Entertainment’ own the IP rights for the Beetlejuice brand.  "
        },
        {
            "text": "This quirky franchise developed from the 1988 horror-comedy. The movie stars Michael Keaton as Betelgeuse, a mischievous spirit summoned by saying his name three times and Winona Ryder as Lydia Deetz, my favourite goth girl who is always by his side—sometimes as an enemy and other times as a bestie. Since its release, the franchise has grown with an animated series, a stage musical, video games, and now the 2024 sequel ‘Beetlejuice Beetlejuice: The Afterlife’. "
        },
        {
            "heading": 3,
            "text": "Trade mark or treat?"
        },
        {
            "text": "When creating the Beetlejuice Universe, Warner Bros knew how to keep their brand name and logos protected. They have filed for trade marks for the Beetlejuice name in countries across the world, including filing at the United States Patent and Trademark Office (USPTO) and with us at the Intellectual Property Office (IPO) in the UK. Warner Bros own an impressive portfolio of UK trade marks that can be viewed by this link: Warner Bros trade marks "
        },
        {
            "heading": 3,
            "text": "The licensor. The licensee. Can they co-exist?"
        },
        {
            "text": "The strange and unusual is everywhere: there is no escape from Beetlejuice-branded products. Warner Bros have over 400 global licensees for the spine-chilling Beetlejuice brand. These licensing deals grant licensees the rights to use the Beetlejuice brand to develop new products and services. "
        },
        {
            "text": "From make-up, Lego sets, backpacks, to sweet treats, Warner Bros extensive marketing strategy for the spine-chilling brand has truly made its mark. Beetlejuice branded products can even be found in fridges everywhere among the huge variety of colourful beverages, thanks to Warner Bros partnership with Fanta, which included a limited-edition Beetlejuice flavour.  "
        },
        {
            "text": "I could go on all day talking about the quirky Beetlejuice franchise, but then I wouldn’t have time to plan my costume for the most bewitching day of the year.  "
        },
        {
            "heading": 5,
            "text": "Happy haunting!"
        }
    ]
}