{
    "url": "https://educationhub.blog.gov.uk/2024/10/nurseries-in-schools-everything-you-need-to-know/",
    "title": "Nurseries in schools: everything you need to know",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Childcare",
        "childminders",
        "early years",
        "Schools"
    ],
    "pub_date": "2024-10-17T01:01:00+01:00",
    "content": [
        {
            "text": "We want to make life easier for working parents, and boost life chances for children.  "
        },
        {
            "text": "Parents need quality, affordable childcare in their local area. As part of our plan to create 3000 new school-based nurseries, we are inviting schools across England to apply for funding to open new nurseries or expand existing ones.  "
        },
        {
            "text": "Primary schools can now apply for the first phase of funding, with up to £150,000 of £15 million available to support up to 300 new or expanded nurseries to be open from September 2025. "
        },
        {
            "text": "But what are school-based nurseries and who will benefit? Here’s everything you need to know. "
        },
        {
            "heading": 2,
            "text": "What is a school-based nursery? "
        },
        {
            "text": "A school-based nursery is nursery provision which operates out of an existing primary school.  "
        },
        {
            "text": "The nursery setting may operate independently from the school or could be run by the school.  "
        },
        {
            "text": "Some will offer childcare for ages three and four, whereas others will cater for younger children. This will depend on the individual setting as there are different regulations for schools to follow depending on the age group.  "
        },
        {
            "heading": 2,
            "text": "Why are nurseries in schools popular with parents? "
        },
        {
            "text": "Quality school-based nursery provision is popular with parents, especially families with multiple children. It can mean a single point of contact, easier drop-offs and pick-ups and continuity of care from the beginning of a child’s education. "
        },
        {
            "text": "It can also provide parents with flexibility around pick up times if parents have multiple children at one school. "
        },
        {
            "heading": 2,
            "text": "What are the other benefits of school-based nurseries? "
        },
        {
            "text": "The entire childcare sector provides valuable care, but schools are at the heart of our communities. School-based nursery settings see lower staff turnover, which provides consistency for children. On average, school-based nurseries also tend to look after more children with SEND and offer a higher number of places in some of the most deprived areas in the country.  "
        },
        {
            "text": "Teachers have told us the benefits of nurseries on site, saying it helps them build strong relationships between nursery and school staff, leading to smoother transitions into school for children. "
        },
        {
            "heading": 2,
            "text": "How can schools apply for this funding? "
        },
        {
            "text": "The government has committed an initial £15 million pounds of funding to help schools make spaces on their sites that are suitable for nursery provision.   "
        },
        {
            "text": "This could include changes to access requirements, improving or expanding toilet or changing facilities or creating play spaces.  "
        },
        {
            "text": "To make sure the programme is delivered in a way that continues to support our most vulnerable children and builds on childcare offers that already exist, this funding will be available to projects that are run by schools, or those delivered by private and voluntary providers or childminders using school premises. Schools should work closely with local authorities to ensure proposals respond to local needs. "
        },
        {
            "text": "More information on the grant, its criteria and how schools apply is available in the School-Based Nursery Capital Grant guidance. To support this, the DfE has also produced general guidance on Establishing school-based nursery provision. "
        }
    ]
}