{
    "url": "https://environmentagency.blog.gov.uk/2024/10/17/stepping-up-maintenance-to-prepare-for-winter-in-essex/",
    "title": "Stepping up maintenance to prepare for winter in Essex",
    "authors": [
        "defrablogs",
        "Environment Agency"
    ],
    "categories": [
        "Flood",
        "Flood Maintenance",
        "Flood Planning"
    ],
    "pub_date": "2024-10-17T14:06:26+00:00",
    "content": [
        {
            "text": "David Simpson, from an Essex Field Team explains how Environment Agency preparations for winter begins well ahead of the long nights drawing in. "
        },
        {
            "text": "As the summer was winding down, the Environment Agency was already undertaking important winter readiness actions. It may have seemed a bit early but thinking big and acting early are key parts of the Environment Agency’s ethos."
        },
        {
            "text": "In Essex, cutting and clearing vegetation from our assets and strategically important watercourses, is an important part of this winter preparation. If left unchecked, this vegetation could restrict river channels during times of high flow. "
        },
        {
            "text": "This cutting regime is known as ‘the frequent maintenance program’, with locations cut on a one-, three- or five-year cycle. It is carried out using a mix of in-house field teams and contractors. The Environment Agency bids for public funding every year to carry out this maintenance and the decisions where to deploy the resource are based on flood modelling and historic data."
        },
        {
            "text": "Vegetation clearance is delivered using various methods, dependent on the size and access to the channel. All our cutting regimes and blockage removal programmes adhere to the Water Framework Directive and other legislation which protect the wildlife in our rivers and streams."
        },
        {
            "text": "Grass cutting on tidal defences"
        },
        {
            "text": "The Environment Agency maintains thousands of kilometres of naturalised flood embankments. "
        },
        {
            "text": "Field teams use specialist grass cutting equipment designed to operate on slopes.  The embankments are cut before winter so defects can be identified. Shorter grass also improves asset performance, erosion resistance and ensures the asset operates to a high standard in the event of strong tides."
        },
        {
            "text": "Weed boating"
        },
        {
            "text": "Specialist boats with cutter and raker heads are used in the wider channels.  They cut the rivers through the towns and downstream, allowing water to get away quicker from the settlements. Whilst this equipment is on site, our teams take the opportunity to collect up items deposited in the river, such as shopping trollies, bikes and other dumped items."
        },
        {
            "text": "Weed cutting with an excavator"
        },
        {
            "text": "This is used to cut main rivers that the EA maintains that are too narrow to fit weed boats into.  An excavator with a specialist weed cutting bucket works parallel to the watercourse, depositing cut weed on the bank, allowing for any aquatic insects (invertebrates and eels) to safely return back to the river. "
        },
        {
            "text": "Water temperature and dissolved oxygen levels are measured before, during and after we cut weed, to ensure that we do not put wildlife at risk. If conditions deteriorate, we will stop work until it is safe to continue."
        },
        {
            "text": "Hand brushing"
        },
        {
            "text": "The smaller watercourses that machines can’t access are cleared by hand.  This is time sensitive work and ‘cut and clear’ gangs work their way through whilst the channels are still shallow just after summer, clearing blockages before the wet weather arrives."
        },
        {
            "text": "With more frequent unprecedented weather events impacting our infrastructure and demand on it increasing, field teams are working towards becoming a resilient workforce of asset maintainers, committed to undertaking efficient, targeted and risk-based approach to flood and coastal erosion risk management."
        },
        {
            "text": "Make sure you are signed up for flood warnings visit www.gov.uk/sign-up-for-flood-warnings for more information."
        }
    ]
}