{
    "url": "https://openpolicy.blog.gov.uk/2023/07/25/a-mixed-methods-approach-to-co-designing-seabass-regulations/",
    "title": "A mixed-methods approach to co-designing Seabass regulations",
    "authors": [
        "Dr Solène Heinzl",
        "Kate Langham",
        "alexmathers",
        "Sanjan Sabherwal",
        "Dr Pina Sadar",
        "Chloe Wybrant",
        "elizacollin"
    ],
    "categories": [
        "Policy Lab"
    ],
    "pub_date": "2023-07-25T11:59:37+01:00",
    "content": [
        {
            "text": "The Department for Environment Food and Rural Affairs (Defra) and the Welsh Government have just launched a public consultation ahead of a new Fisheries Management Plan for Seabass. Policy Lab partnered with them in the lead up to a formal consultation process to facilitate a nationwide co-design process to develop ideas for the new regulation. All four of our reports are included here (p163 onwards)."
        },
        {
            "text": "Our expertise in innovative methods, including ethnography, collective intelligence and scenario testing, enabled us to bring together diverse and often conflicting views from individuals and interest groups to address some of the knotty regulatory challenges relating to fisheries management. We had feedback that our approach inspired trust, dialogue and consensus across fragmented stakeholder landscapes - something critical to maintaining sustainable management of natural resources, such as our seas. "
        },
        {
            "heading": 3,
            "text": "Lived experience research: the power of listening and understanding"
        },
        {
            "text": "Listening to and acknowledging what people have to say about their lives and understanding the challenges they face at the receiving end of government policies is at the heart of effective policymaking. In Policy Lab, we often do this through ethnography. Put simply, an ethnographic approach is about spending time with people to understand their lived experiences, in our case with fishing for Seabass. "
        },
        {
            "text": "We immersed ourselves in the lives of fishers, enforcement officers and fishmongers to understand Seabass fisheries from their perspective. Joining a fishing trip with recreational fishers, spending a day in a commercial port, attending an angling competition and visiting fish markets helped us gain rich perspectives on the importance of Seabass fishing for people who build their lives or livelihoods around it."
        },
        {
            "text": "We spoke to more than 90 individuals across seven different locations in England and Wales, with our interactions ranging from full-day immersions to shorter interviews at pop-up events in fishing cafes and other locations frequented by recreational and commercial fishers. Regardless of the length and nature of our engagement, the effect was equally powerful - we started to unpick some of the common, as well as more specific, issues, barriers and opportunities experienced by different individuals and interest groups. You can see our lived experience report here (p. 260)  and watch our summary film below."
        },
        {
            "heading": 3,
            "text": "Collective intelligence: harnessing collective ideas for improving the system"
        },
        {
            "text": "Having in-depth insights into barriers and opportunities from our field research helped us determine key emerging themes, but it is important to sense-check these with a wider stakeholder group and start identifying areas of high importance and agreement for the subsequent co-design process. In order to do that, we launched a week-long online ‘collective intelligence’ debate using Pol.is -  a tool which Policy Lab has been experimenting with since 2021."
        },
        {
            "text": "Each day, participants logged onto a website where they were presented with a series of statements on Seabass topics, identified in the initial ethnographic research. For each statement, participants could vote to agree, disagree or pass. They could also submit their own opinions or ideas for the new Fisheries Management Plan (FMP), which were moderated before being incorporated into the debate for other participants to vote on."
        },
        {
            "text": "The debate presented a unique opportunity for an unprecedented number of people with an interest in Seabass to come together at once and have a “conversation” about the future of the fishery. Across the debate week over 270 participants from a wide variety of stakeholder types, gear types and regions of England and Wales cast almost 140,000 votes and contributed over 670 statements. The conversation evolved and moved through over 100 Seabass topics ranging from bycatch to Seabass nursery areas."
        },
        {
            "text": "In our analysis we focused on identifying areas of possible consensus and possible divergence between commercial and recreational fishers, as well as the spread of opinion between different regions of England and Wales. You can see our full collective intelligence report here (p. 309)."
        },
        {
            "heading": 3,
            "text": "Co-design: using scenario testing for building a constructive dialogue"
        },
        {
            "text": "The collective intelligence debate yielded a high volume of thought-provoking ideas. It was then important to prioritise, test and refine them with different stakeholder groups in order to identify the most consensual and effective solutions. "
        },
        {
            "text": "We invited representatives of different fishing sectors, science, environmental agencies and enforcement bodies to face-to-face and remote co-design workshops. We ran nine sessions overall, keeping the groups small but diverse and helped encourage constructive discussions in a respectful and safe environment. We further promoted an inclusive dialogue through an innovative engagement tool to reveal preferred options drawing inspiration from our  11 new experimental methods. "
        },
        {
            "text": "Partnering with a playable systems expert Matteo Menapace, co-creator of the board game Daybreak, we designed a practical scenario and idea testing method. This approach enabled us to identify areas of agreement and disagreement between stakeholders, as well as additional ideas for improving potential solutions. Participants were presented with different scenarios and asked to vote on their favourite solutions. They then engaged in a discussion, after which they had a chance to change their votes. "
        },
        {
            "text": "In order to reach a wider group of key stakeholders, we replicated the same scenarios in a survey which attracted over 470 participants. Rich discussions from workshops, married with a high volume of responses via the survey, gave us a great sense of what solutions would work (or not work) in practice. To make sure that we got it right, we further tested our findings in an expert workshop as well as a wider co-refine survey.  You can see the full co-design report here (p. 397)."
        },
        {
            "heading": 3,
            "text": "Bringing it all together"
        },
        {
            "text": "The aim of the project was to work collaboratively across the Seabass system to design a set of potential solutions for managing Sea bass within the Fisheries Management Plan. The driver was to ensure this valuable natural resource can benefit a diverse range of commercial, personal and political interests whilst ensuring stocks remain sustainable and in the process foster empathy and trust between those involved."
        },
        {
            "text": "Throughout the project we used a number of methodologies to engage stakeholders and invite participation. Adopting a mixed methods approach meant that each phase of the project informed the next phase in an iterative and collaborative co-design process, and that qualitative and quantitative insights complemented each other towards the production of a solid evidence base. "
        },
        {
            "text": "The inclusive nature of the process, based on bringing stakeholders together, invited negotiation and collaboration and provided participants with the opportunity to engage with and shape the bigger picture - something which will hopefully underpin the final Seabass FMP when it is published later this year."
        },
        {
            "text": "The consultation on the proposed Seabass FMP is now live. "
        },
        {
            "text": "According to Defra’s consultation site, “this FMP now sets out a roadmap for future domestic management of Seabass in English and Welsh waters to ensure Seabass stocks are maintained at sustainable levels and the benefits of Seabass fishing can be realised by the communities that depend on them.”  "
        },
        {
            "text": "The consultation closes on the 1st of October 2023."
        }
    ]
}