{
    "url": "https://giaa.blog.gov.uk/2023/07/25/celebrating-our-giaa-insights-engine/",
    "title": "Celebrating our GIAA Insights engine",
    "authors": [
        "Dr Lauren Petrie"
    ],
    "categories": [
        "Innovation",
        "Internal Audit",
        "People",
        "Quality"
    ],
    "pub_date": "2023-07-25T13:00:37+01:00",
    "content": [
        {
            "text": "We're all rather excited in GIAA this week as we're celebrating the first anniversary of launching our Insights Engine! \"What is an insights engine?\" you may well ask. Let us explain ..."
        },
        {
            "text": "Have you ever had a pile of documents to read and no idea where to start? Maybe you were looking for something specific or you needed to understand the common themes between the documents, but the idea of reading each one in turn and making notes was too daunting? How helpful would it have been to be able to use advanced analytics and artificial intelligence methods to search and filter for specific terms, or look at the common words and phrases?"
        },
        {
            "text": "Well, we’ve equipped our auditors with a tool to do just that and we called it our GIAA Insights Engine. We launched our insights engine on 26 July 2022, and since then we’ve been using it regularly in GIAA to enable our auditors and investigators to find insights across hundreds of reports quickly and efficiently. The insights engine empowers our colleagues to analyse volumes of documents previously thought unimaginable. Since we set up our Data Analytics specialism in August 2021, we developed the Insights Engine from a simple, locally-hosted R Shiny app to become a sophisticated web-based tool that's been used by nearly 50 teams both in and outside GIAA."
        },
        {
            "text": "The concept is simple: take a large volume of text from documents - such as audit reports but also board minutes, survey responses and consultation feedback - and make that information easily accessible and searchable in a user-friendly tool. our insights engine has been used for our external customers in consultancy pieces, in audit fieldwork, in our responsive insights and in counter fraud investigations. We have also used it internally for analysing our civil service people survey responses, feedback from our customers, and in our quality assurance and improvements processes."
        },
        {
            "text": "We're sharing this blog to celebrate the official \"first birthday\" of the insights engine, since it was made widely accessible to colleagues across the agency. We’re also proud to say that it's been used by four external teams across government, with more in the pipeline. We've had fantastic feedback from users, with internal teams telling us:"
        },
        {
            "text": "Feedback from external users has also been positive, with users saying:"
        },
        {
            "text": "If you work in a government organisation and think that the GIAA Insights Engine might be useful for your work, please contact us to explore how we can help you."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}