{
    "url": "https://educationhub.blog.gov.uk/2023/07/defibrillators-all-state-schools-now-have-lifesaving-equipment/",
    "title": "Defibrillators: All state schools now have lifesaving equipment",
    "authors": [
        "media officer"
    ],
    "categories": [
        "Schools"
    ],
    "pub_date": "2023-07-25T00:01:50+01:00",
    "content": [
        {
            "text": "Having access to defibrillators in schools drastically increases the chance of pupils, teachers and visitors surviving a cardiac arrest."
        },
        {
            "text": "Teachers and pupils across the country can be reassured they will have access to this life saving equipment, as all state schools now have a defibrillator on school grounds."
        },
        {
            "text": "Here’s what you need to know about this crucial roll out."
        },
        {
            "heading": 3,
            "text": "Does this mean all schools have defibrillators? "
        },
        {
            "text": "Following the Government’s £19 million roll out, over 20,000 defibrillators have successfully been delivered to almost 18,000 schools since January."
        },
        {
            "text": "In June, we oversaw the successful completion of deliveries of defibrillators to secondary schools."
        },
        {
            "text": "Now, all eligible primary, special and alternative provision schools who did not already have a defibrillator have received one."
        },
        {
            "heading": 3,
            "text": "Why is this happening now?"
        },
        {
            "text": "In July 2022, the Government committed to delivering these devices before the end of the 2022/23 academic year to ensure that all state funded schools in England had access to a defibrillator, following a campaign from Mark King of the Oliver King Foundation."
        },
        {
            "text": "Mark tragically lost his son, Oliver, after he suffered sudden cardiac arrest at school during a swimming lesson when he was 12-years old."
        },
        {
            "heading": 3,
            "text": "Will larger schools have access to more than one defibrillator?"
        },
        {
            "text": "Large schools have been provided with two or more defibrillators so they can be strategically placed in areas of the schools where a cardiac arrest is more likely, such as sports halls."
        },
        {
            "heading": 3,
            "text": "Which schools were eligible for a defibrillator? "
        },
        {
            "text": "State-funded primary, secondary, and special schools in England, that do not have existing provision in place, are eligible for the Department for Education defibrillator programme."
        },
        {
            "heading": 3,
            "text": "My child’s school hasn’t received their defibrillator yet, when can they expect to receive it?"
        },
        {
            "text": "A small number of schools have not yet received their defibrillators due to attempted deliveries not being able to complete because the schools were closed at the end of term. We would ask these schools to contact us as soon as possible so we can arrange for our supplier to redeliver the defibrillator at a suitable time over the summer holidays or during the first week of term."
        },
        {
            "text": "If a school thinks they are eligible for this programme and haven't received a defibrillator, they should contact the department at AED.Operations@education.gov.uk."
        },
        {
            "heading": 3,
            "text": "Why are defibrillators in schools important?"
        },
        {
            "text": "Research shows that when an defibrillator is accessed within 3-5 minutes of a cardiac event, this can increase the chance of survival to hospital discharge from 9% to 50%."
        },
        {
            "text": "It’s particularly important they are available close to sports halls and playing fields that children, young people, and the wider community use daily."
        },
        {
            "heading": 3,
            "text": "What else are you doing regarding first aid in schools? "
        },
        {
            "text": "The rollout will build on existing requirements for schools to teach first aid as part of the curriculum, with secondary school pupils being taught life-saving methods such as CPR and the purpose of defibrillators."
        }
    ]
}