{
    "url": "https://vets.blog.gov.uk/2023/07/25/dr-collin-willson-member-of-royal-college-veterinary-surgeons-mrcvs-wins-rcvs-impact-award/",
    "title": "Dr Collin Willson (Member of Royal College Veterinary Surgeons – MRCVS) wins RCVS Impact Award.",
    "authors": [
        "kenmeger"
    ],
    "categories": [
        "Government Veterinary Services",
        "Jobs and Experiences",
        "Policy Work"
    ],
    "pub_date": "2023-07-25T12:18:38+01:00",
    "content": [
        {
            "text": "The Food Standards Agency (FSA) has long been proud of all of its vets and the vital work they do. The challenge has been that this work protecting public health, animal health & welfare and underpinning international trade often goes unnoticed by the public and frequently by the wider veterinary profession. Our colleagues in the clinical veterinary world hold the public imagination much more and yet, without undermining clinical practice, the profession also offers many other interesting opportunities and career paths."
        },
        {
            "text": "Imagine then, our delight when Collin, who is the FSA Animal Welfare Veterinary Lead, not only won the RCVS Impact Award, but was nominated by BVA President Malcolm Morley. Collin has a lifetime of achievements which deserve nominations in their own right but the ‘catapult’ for this particular award is his vital work on welfare at slaughter, especially his work with the Halal meat industry. The ongoing impact of his work will positively affect millions of animals and knowing Collin, he will just shrug and continue making a difference in his own humble way."
        },
        {
            "text": "Collin writes:"
        },
        {
            "text": "‘On the 24th April I received an Email from the Royal College of Veterinary Surgeons (RCVS) and as many Vets would wondered what it was about. It was a letter from the RCVS President Melissa Donald saying: "
        },
        {
            "text": "I am delighted to inform you that you were recently nominated for the RCVS Impact Award, and that the Council of the RCVS, at its meeting on Thursday, 16 March 2023, unanimously agreed to bestow this award upon you."
        },
        {
            "text": "At this time it was embargoed so apologies to the many people that I met between then and 28th April when the press release told all: https://www.rcvs.org.uk/news-and-views/news/rcvs-announces-its-2023-honours-and-awards-recipients/"
        },
        {
            "text": "The press release stated that:"
        },
        {
            "text": "His nominator was current BVA President Malcolm Morley MRCVS, who said: “As Chair of BVA's Welfare at Slaughter Working Group, Collin led the development of our position on welfare at slaughter and has been instrumental in developing relationships with Halal certification body representatives to further our mutual aims of good welfare from farm to fork."
        },
        {
            "text": "“In collaboration with Dr Awal Fuseini, Collin has transformed the way in which the veterinary profession engages with key stakeholders in the Halal sector to create a better understanding of the requirements of Halal meat production, and has enabled the sharing and recognition of the evidence-base relating to welfare at slaughter. Through his careful negotiation and management of relationships he has been instrumental in fostering a mutual respect and trust between the profession and community leaders.”"
        },
        {
            "text": "I still find it an honour three months later and remain humbled that my Professional colleagues considered my work was worthy of an award and am proud to join the many previous recipients of this prestigious award."
        },
        {
            "text": "I am very pleased that animal welfare at slaughter has been recognised in the award of this recognition."
        },
        {
            "text": "The highlight of the award is the annual RCVS awards ceremony, this year was held on 7th July at 1 Great George St, London. I was fortunate that my wife and two daughters were able to join me for the day and we enjoyed a day in London at a fantastic venue to receive the award. I am not sure if my wife and daughters found the RCVS awards more exciting, or the fact that they saw the trooping of the colour whilst the AGM was being held."
        },
        {
            "text": "We travelled back home to S Wales with lots of photos and videos and memories of a fantastic day out that will stay with us for ever.’"
        },
        {
            "text": "I had the pleasure of joining Collin’s family at RCVS Day to watch Collin receive his award in person and representing those of us who have chosen a different veterinary career pathway and have no hesitation in pushing Collin into the limelight to let him know how proud we all are of him."
        }
    ]
}