{
    "url": "https://insidedvla.blog.gov.uk/2023/07/25/drones-festivals-and-coding-competitions-an-update-on-dvlas-stem-programme/",
    "title": "Drones, festivals, and coding competitions – an update on DVLA’s STEM programme",
    "authors": [
        "Karen Pitt"
    ],
    "categories": [
        "Features"
    ],
    "pub_date": "2023-07-25T10:04:50+01:00",
    "content": [
        {
            "text": "Through our science, technology, engineering, and mathematics (STEM) volunteer programme, DVLA supports the next generation by encouraging interest in IT and STEM subjects in communities and schools across Wales."
        },
        {
            "heading": 2,
            "text": "STEM events"
        },
        {
            "text": "We’ve had a busy few years! Since the launch of our STEM programme, we’ve represented DVLA at many events, including Swansea Science Festival and the National Eisteddfod, and promoted STEM learning to children across Wales through our annual Code Challenge."
        },
        {
            "text": "Last year, our Code Challenge event was a huge success with more than 300 students and teachers attending our live final, and even more joining through a live stream. It was also the first time we opened the challenge to colleges and sixth forms, and I’m pleased to say, we’re doing it all again in December! But more on that later…"
        },
        {
            "text": "First, let’s take a look at what we’ve been up to recently, including an update on our Digital Inclusion Scheme, and the events we’re looking forward to in the coming months."
        },
        {
            "heading": 2,
            "text": "Donating laptops with our Digital Inclusion Scheme "
        },
        {
            "text": "Our Digital Inclusion scheme donates refurbished IT equipment to primary and secondary school students across Wales, providing important digital resources to the community and reducing IT waste."
        },
        {
            "text": "So far, I’m proud to announce we’ve donated over 500 laptops to multiple schools in Swansea. We have another 900 laptops and 3,000 desktops ready to go to E-Cycle, who refurbish the equipment before it’s donated."
        },
        {
            "text": "We work closely with E-Cycle to fulfil the targets of our Greening Government Commitments and Greening Government ICT and Digital Services Strategy, aiming to reduce the amount of IT waste going to landfill to 0% and to achieve a yearly increase in the amount of IT that is reused and recycled."
        },
        {
            "text": "On 2 June, we donated 20 laptops to Race Council Cymru (RCC), who promote race equality, integration and justice in Wales. RCC distributed the laptops to families who did not have access to IT for school or learning opportunities. It’s so rewarding to see young people benefit from the resources they need, and I’m proud that DVLA will continue to support our communities in this way."
        },
        {
            "heading": 2,
            "text": "Coding at Wales’ biggest music festival"
        },
        {
            "text": "In May, I teamed up with our STEM ambassadors at the In It Together Festival, where we put on coding competitions for the children attending the festival."
        },
        {
            "text": "It was brilliant to see the children having so much fun! We ran daily coding competitions where they had the chance to use SCRATCH software to code their own festival themed game, with the winners receiving some cool prizes, including a drone and some T-shirts!"
        },
        {
            "text": "We want to introduce young people to coding and spark an interest in the world of STEM, showing them the possibilities of a career in digital. We’ll also be running coding competitions at the upcoming Eisteddfod in August, where our STEM ambassadors will be promoting this year’s Code Challenge and encouraging students to take part. Make sure to come and check us out and you could win some tech gadgets!"
        },
        {
            "text": "Speaking of Code Challenge…"
        },
        {
            "heading": 2,
            "text": "Save the date – it’s 5 December 2023!"
        },
        {
            "text": "I’m excited to announce that one of our favourite STEM events, the Code Challenge, is back in December, and the good news is, entries are open now!"
        },
        {
            "text": "So, if you know of any students that have an interest in coding and enjoy being challenged, then this is the competition for them! We’ve got a category for each age group, giving students  across Wales a chance to show off their STEM talents and win some incredible tech prizes along the way."
        },
        {
            "text": "Primary and secondary school students can show off their skills by coding a game that follows a theme set by our partners and sponsors, such as climate change, road safety, or healthcare heroes. The winners will win some amazing IT equipment for their school!"
        },
        {
            "text": "We’ll also be running the Commerce in Code challenge for 16 to 18 year olds. Students will get the chance to redesign our STEM website, putting their IT and business skills to the test. The winners will see their design on the official DVLA STEM website and they’ll also will win some fantastic IT equipment for their school or college."
        },
        {
            "text": "There will be lots of other opportunities to win prizes at the event through a prize draw, including our highly anticipated annual game of 'Beachball Bingo'! So enter today and join us at the Richard Ley Development Centre on Tuesday 5 December, where we’ll be streaming the event to schools across Wales and announcing all the winners."
        },
        {
            "text": "The closing date for entries is 6 October 2023, so don’t miss out!"
        },
        {
            "text": "All information on DVLA’s STEM programme, including our Code Challenge, can be found on our STEM website. Don’t forget to follow our social media accounts for all the latest updates."
        },
        {
            "text": " "
        }
    ]
}