{
    "url": "https://space.blog.gov.uk/2023/07/25/global-space-agencies-return-to-london-for-nasa-s-moon-to-mars-architecture-workshop/",
    "title": "Global space agencies return to London for NASA 's Moon to Mars Architecture Workshop",
    "authors": [
        "Emma Felber"
    ],
    "categories": [
        "International"
    ],
    "pub_date": "2023-07-25T14:02:34+01:00",
    "content": [
        {
            "text": "NASA recently partnered with the UK Space Agency to host a workshop exploring Moon to Mars Architecture at the Royal Institution in London. "
        },
        {
            "text": "Technical experts from 16 countries attended the workshop, giving input into NASA's architecture concept review products. "
        },
        {
            "text": "These conversations drive forward the Artemis programme, an international effort to return humanity to the Moon, and link it to future capabilities needed for missions to Mars.   "
        },
        {
            "text": "Artemis I, an uncrewed flight around the Moon, was launched on 16 November 2022 and returned safely to Earth on 11 December 2022 after 25 days in space. "
        },
        {
            "text": "Follow up mission Artemis II, which will carry a crew of astronauts around the Moon, is tentatively scheduled for November 2024, and Artemis III will see humans landing on the Moon for the first time since the Apollo missions. The Artemis astronauts will include the first person of colour to travel to the Moon, and the first woman.  "
        },
        {
            "text": "The Moon to Mars Architecture Workshop provided an opportunity for international partners to give feedback to NASA on their white papers and concept reviews which cover topics such as human lunar return, science driving architecture and technology and infrastructure.   "
        },
        {
            "text": "The conversations and input from international partners will be used to improve NASA architecture not only for lunar exploration but for that of Mars. "
        },
        {
            "text": "The workshop process allows international space agencies to be active participants in the development of NASA’s long-term plans. Through white papers, presentations and group discussions, NASA have given the global space community visibility of their processes and invited a wider community to shape and test their ambitions.  "
        },
        {
            "text": "The latest workshop, which took place in June, built on a similar workshop hosted by the UK Space Agency in 2022. "
        },
        {
            "text": "While the previous workshop focused on NASA’s overall objectives for lunar exploration as a part of a longer-term plan to explore Mars, this workshop was firmly focused on refining the mission architecture to bring these ambitions to life. Both workshops were hosted at the Royal Institution in London. "
        },
        {
            "text": "In recognition of the important role played by the Royal Institution in facilitating these discussions, NASA Deputy Administrator, Pam Melroy and Associate Administrator for the Exploration Systems Development Mission Directorate, Jim Free presented the Chair of the Board of Trustees of the Royal Institution, Sir Richard Catlow with a space-flown mission patch from the Artemis I mission. "
        },
        {
            "text": "Sir Richard said: "
        },
        {
            "text": "NASA Deputy Administrator Pam Melroy said:"
        },
        {
            "text": "CEO of the UK Space Agency, Dr Paul Bate provided the opening and closing remarks for the event. He reflected:"
        }
    ]
}