{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2023/07/25/government-science-and-engineering-profession-recognition-week-2023/",
    "title": "Government Science and Engineering Profession Recognition Week 2023",
    "authors": [
        "gseprofession"
    ],
    "categories": [
        "GSE Offer",
        "Reward & Recognition"
    ],
    "pub_date": "2023-07-25T14:29:21+01:00",
    "content": [
        {
            "heading": 3,
            "text": "Professional Recognition Offer re-launch "
        },
        {
            "text": "The Government Science and Engineering (GSE) Profession is excited to relaunch our GSE Professional Recognition Offer, with Professional Recognition Week taking place 25 to 29 September 2023.  "
        },
        {
            "text": "The Professional Recognition offer provides GSE members with bespoke support to become professionally registered with an institution that best aligns with their professional expertise. The offer provides access to partner professional institutions and bodies, support with the application process, and advice on getting departmental funding where possible. "
        },
        {
            "text": "The offer will help GSE members gain all the benefits of being professionally registered. Such benefits include career progression, external recognition of your professional skills and access to external opportunities such as professional networks, events and training workshops. "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": "GSE Professional Recognition Week Events - 25 to 29 September 2023 "
        },
        {
            "text": "To start the week of events, we would like to invite all members to our GSE Professional Recognition introduction webinar on Monday 25 September at 10:00 – 10:30. In this virtual session, you will learn more about this exciting new offering and hear more about how we can support you.  Throughout the week, there will be a range of events with our partner institutions. We encourage you to attend the partner institution events that most appeal to you to hear first-hand what they can offer you.  "
        },
        {
            "text": "Please note that attendance to these webinars is not a requirement to begin your recognition journey. You can find out more today by exploring our GSE Professional Recognition Offer blog or you can complete our GSE Recognition Offer form to receive our support pack and keep up to date with resources and events. "
        },
        {
            "text": "These are the events taking place over the week and how you can sign up: "
        },
        {
            "text": "Monday 25 September, 10.00-10.30\nThe GSE Profession is hosting an online introductory webinar on the process and benefits of becoming registered with a professional body or institution.\nSign up using Eventbrite"
        },
        {
            "text": "Monday 25 September, 11.00-11.30\nThe British Computer Society (BCS): The Chartered Institute for IT \nSign up using Eventbrite\n"
        },
        {
            "text": "Tuesday 26 September, 10.30-11.00\nThe Institute of Civil Engineers (ICE): Professional Qualifications with the Institution of Civil Engineers \nSign up using Eventbrite "
        },
        {
            "text": "Tuesday 26 September, 14.00 - 14:30\nThe Institution of Chemical Engineers (IChemE): Get Chartered with IChemE\nSign up using Eventbrite  "
        },
        {
            "text": "Wednesday 27 September, 10:30-11:00\nThe Institute of Engineering and Technology (IET): IET Membership and Professional Registration.\nSign up using Eventbrite"
        },
        {
            "text": "Wednesday 27 September, 14.00-14.30\nThe Science Council: Introduction to Professional Registration with the Science Council\nSign up using Eventbrite "
        },
        {
            "text": "Thursday 28 September, 10.30-11.00\nThe Royal Society of Biology (RSB): Royal Society of Biology & Professional Registration\nSign up using Eventbrite "
        },
        {
            "text": "Thursday 28 September, 14.00-14.30\nThe Institute of Mechanical Engineers (IMechE): Routes to Professional Registration\nSign up using Eventbrite"
        },
        {
            "text": "Date TBC \nThe Institute of Physics (IoP) will present what professional recognition opportunities they offer and the benefits of completing professional recognition with them.\nSign up to the webinar by emailing the GSE Profession with the title GSE Professional Recognition IoP"
        },
        {
            "text": "Date TBC \nThe Royal Society of Chemistry (RSC) will present what professional recognition opportunities they offer and the benefits of completing professional recognition with them.\nSign up to the webinar by emailing the GSE Profession with the title GSE Professional Recognition RSC "
        },
        {
            "text": "The GSE Profession plans to expand this offer in the future to include other professional bodies aligned with a wider range of our members. If we currently do not have speakers from a professional body you are interested in aligning with, the GSE Profession can still off you support. "
        },
        {
            "text": "If you have close links to an institution and think we should be partnered with them – email gse@go-science.gov.uk to let us know. Not already part of the Government Science and Engineering (GSE) Profession? Use the GSE Sign Up form to learn more.  "
        }
    ]
}