{
    "url": "https://socialcare.blog.gov.uk/2023/07/25/honour-stories-embracing-social-cares-power-of-change/",
    "title": "Honour stories: social care's power of change",
    "authors": [
        "Clenton Farquharson CBE"
    ],
    "categories": [
        "Care and support",
        "Recognition"
    ],
    "pub_date": "2023-07-25T09:09:22+00:00",
    "content": [
        {
            "heading": 2,
            "text": "My journey in social care"
        },
        {
            "text": "The course of my life changed on 15 February 1995, when I experienced a life-altering event. The NHS saved my life and social care transformed my life. While my journey into social care started with personal struggles, I soon realised many people faced similar challenges and within me grew a determination to use my experiences to foster meaningful change in health and social care."
        },
        {
            "text": "This honour serves as a reminder of the immeasurable value and impact of lived experiences, both for those who have navigated the system and those who dedicate themselves to this vital work. Within this, it is essential to acknowledge the experiences and perspectives of the Global Majority, as they often face unique challenges and disparities that require targeted attention and support."
        },
        {
            "heading": 2,
            "text": "Why recognition for people with lived experience matters"
        },
        {
            "text": "Marginalised groups such as the Global Majority, LGBTQ+ communities, and older people face similar challenges within social care. It is essential to highlight these experiences and shed light on intersectionality - the understanding that our identities are interconnected and fluid."
        },
        {
            "text": "By acknowledging these experiences, we take significant strides towards dismantling systemic inequalities and promoting equitable access to social care. Honouring individuals involved in social care who have firsthand knowledge of the barriers and needs within the system is a crucial step in the right direction."
        },
        {
            "heading": 2,
            "text": "Celebrating social care colleagues"
        },
        {
            "text": "In addition to people with lived experience and the Global Majority, this recognition extends to the people who work tirelessly in social care; social care staff, social workers, occupational therapists, and everyone else involved - they are the unsung heroes who, like me, have been transformed by the power of social care."
        },
        {
            "text": "This honour recognises their dedication, expertise, and the tremendous impact they have on the lives of the people they support. Acknowledging the contributions of people who work in social care from diverse backgrounds is vital in creating an inclusive and culturally responsive social care."
        },
        {
            "heading": 2,
            "text": "Collaboration and nurturing potential"
        },
        {
            "text": "In embracing diverse perspectives and fostering collaboration, we can create a comprehensive support network that leaves no one behind. This recognition serves as a reminder of the importance of nurturing the potential of individuals from the Global Majority, both in terms of their lived experiences and their professional expertise, to create a more inclusive and equitable social care landscape"
        },
        {
            "text": "Receiving a CBE is an incredible milestone in my journey, but it is not just my achievement. It is a result of the collective support, mentorship, and friendship from all the individuals who make up Think Local Act Personal (TLAP), past and present."
        },
        {
            "text": "Honouring me with a CBE is a statement to the crucial role that lived experience plays in shaping policies and practices within social care, a recognition of the dedication and expertise of the professionals who work tirelessly to improve the lives of others, and an acknowledgement of the experiences of the Global Majority."
        },
        {
            "text": "Together, we can create a ripple effect of positivity and kindness that extends far beyond our imagination. Let us embrace the power of change, celebrate our achievements, and continue our collective journey towards a future of equity, justice, and progress in health and social care."
        }
    ]
}