{
    "url": "https://cddo.blog.gov.uk/2023/07/25/transforming-for-a-digital-future-one-year-update/",
    "title": "Transforming for a Digital Future - one year update",
    "authors": [
        "Sam Lawler, Deputy Director Strategy, Analysis and Reform, CDDO"
    ],
    "categories": [
        "CDDO",
        "Cross-government strategy"
    ],
    "pub_date": "2023-07-25T13:58:36+01:00",
    "content": [
        {
            "text": "Whether it’s applying for a driving licence, claiming your state pension or applying for child benefit, people interact with government services at some of the most significant times in their lives - and for everyday tasks, too. Effective digital services can make the difference between a positive experience and a negative one. "
        },
        {
            "text": "Delivering these services is only possible if we make effective use of data and technology on a national scale, so that we’re providing the best experience and helping deliver value for taxpayers whilst doing so. This means overhauling outdated structures and empowering civil servants with the right tools and training to create the conditions for a truly digital future that will benefit us all. "
        },
        {
            "text": "This is why in Transforming for a digital future, government's 2022 to 2025 roadmap for digital and data, we set out a vision that by 2025, the UK government will be a transformed, more efficient digital government that provides better outcomes for everyone."
        },
        {
            "text": "One year on, I’m reflecting on the great strides taken in delivering that vision."
        },
        {
            "heading": 3,
            "text": "In a challenging operating environment, collaboration is driving success "
        },
        {
            "text": "The strategy was developed with digital experts and government’s most senior leaders. It sets a new focus on collaboration to achieve digital transformation at scale and modernise the day-to-day operation of government. "
        },
        {
            "text": "When we launched the strategy, we knew we’d set an ambitious task. The environment we’re operating in has added to that challenge, as colleagues across government have worked hard to deliver priorities in the face of unexpected pressures. "
        },
        {
            "text": "In that context, the commitments in the strategy could have fallen down the priority list. I’m delighted to say, however, that we’re continuing to see progress that is hugely encouraging. I’ve been particularly pleased to see colleagues embracing the culture of collaboration across boundaries, and I’m excited to see this continue into year two."
        },
        {
            "heading": 3,
            "text": "Building firm foundations and delivering significant achievements"
        },
        {
            "text": "Looking back over all we’ve achieved together, it's impossible to set out in one blog all the progress made over the last twelve months. Here is a snapshot of a few highlights: "
        },
        {
            "text": "Transforming government services\nWe’ve assessed the top 75 services across government and are working to transform at least 50 of them to a ‘great’ standard by 2025, so that they are easier to use, quicker and more efficient. I’m really pleased to share that some key services have reached ‘great’ already, like HMRC’s pay your self assessment tax bill, the Department for Levelling Up, Housing and Communities’ register to vote and the Driver and Vehicle Standards Agency’s (DVSA) record MOT test results."
        },
        {
            "text": "Developing and rolling out GOV.UK One Login\nGOV.UK One Login provides a single way for citizens to sign in and prove their identity when accessing government services online, replacing siloed and duplicative legacy systems. Over 2 million people have already used GOV.UK One Login to prove who they are, and its identity checking app has been downloaded more than 2.7 million times. 10 services are now live, from organisations including the Disclosure and Barring Service, DVSA and HM Land Registry.\n"
        },
        {
            "text": "Improving how government uses and shares data to power better decision making\nData leaders have come together to agree how to improve access to the most important data assets across government. This includes developing the first version of the Data Marketplace which will provide a front door to discover, access and share government data in a legal, ethical and trusted way. "
        },
        {
            "text": "Modernising our technology so that it’s efficient, secure and sustainable\nTen departments have adopted a collaborative agreement for using Microsoft 365, making it easier for tens of thousands of civil servants to work together. Cyber experts have created a Secure by Design framework to help departments create services that keep citizen and government data safe. We’ve also helped departments measure the risk and effort of running outdated legacy technology, and to accelerate their path to using cloud services. And we’re responding to one of the biggest emerging technology opportunities and challenges in the world today by publishing guidance on the use of generative artificial intelligence (AI), and creating a team to help civil servants use this technology responsibly, confidently and effectively."
        },
        {
            "text": "Building a digitally capable civil service through digital skills at scale\nThe strength of the digital, data and technology profession continues to grow, increasing by more than 9,000 colleagues since October 2021. The vital work of these professionals is being supported by further adoption of the Pay Framework, now across 32 organisations, helping to reduce reliance on contractors and save taxpayer money. Meanwhile, more than 600 senior civil servants have been upskilled in digital and data essentials, helping build a cadre of leaders with cutting edge skills to get the most out of digital in every department."
        },
        {
            "text": "Reforming the system of government so it unlocks digital transformation\nOverhauling established processes and ways of working is hard, but we’re making major inroads. We have published a new version of the digital functional standard to guide senior leaders on how to manage digital, data and technology in government. We’ve also developed a framework for good product-centric ways of working, helping teams work together to deliver the high quality digital products and services that citizens need. And we continue to offer guidance, support and assurance to help teams maximise productivity and maintain high standards of delivery."
        }
    ]
}