{
    "url": "https://ukhsa.blog.gov.uk/2023/07/25/ukhsa-strategic-plan-addressing-health-threats-saving-lives-protecting-livelihoods/",
    "title": "UKHSA strategic plan: Addressing health threats, saving lives, protecting livelihoods",
    "authors": [
        "Jenny Harries"
    ],
    "categories": [
        "Health security"
    ],
    "pub_date": "2023-07-25T09:13:09+01:00",
    "content": [
        {
            "text": "Wherever we look - locally, nationally, internationally - hazards to our health are all around us."
        },
        {
            "text": "Health threats have shaped human history, but the world has always fought back, whether that’s through the discovery of early vaccines and antibiotics which saved countless lives to the way the COVID-19 pandemic revolutionised many aspects of modern health security."
        },
        {
            "text": "Looking forward, we’re entering an era where our changing climate is increasingly the context in which we plan for the impact of infectious disease and environmental hazards."
        },
        {
            "text": "And we’re grappling with worrying issues from declining rates of childhood vaccination and antimicrobial resistance through to the public health impacts of poor air quality."
        },
        {
            "text": "But we can be inspired by these challenges. Exciting developments in fields like data analysis and surveillance, genomics and vaccine development will shape our response."
        },
        {
            "text": "UKHSA was established to meet these challenges head on, preparing for health threats, preventing them if we can and responding effectively in order to save lives and protect livelihoods."
        },
        {
            "text": "You’ll find us on the ground working with local partners to tackle incidents and outbreaks and in labs and scientific sites developing the technology, vaccines, diagnostics and therapeutics of the future."
        },
        {
            "text": "Today I’m pleased to introduce our work in more detail through UKHSA’s first 3-year strategic plan, an important staging-post in our development and a chance to reflect on the challenges and opportunities ahead of us."
        },
        {
            "text": "And as a new agency in our second year of operation, our strategic plan is also an opportunity to tell a more in-depth story about who we are and what we do. It’s a story I’m very proud to tell."
        },
        {
            "text": "Some of UKHSA’s work is visible and high profile so needs little introduction. Since we were formed in autumn 2021, we’ve tackled many infectious disease threats from discovering and then responding to mpox and poliovirus in wastewater through to investigating unexplained cases of hepatitis in children."
        },
        {
            "text": "Environmental hazards have also come to the fore, such as the response to the most intense heatwave in our nation’s history last summer."
        },
        {
            "text": "But whilst threats like these unsurprisingly hit the headlines, our strategic plan also talks about the breadth of work that goes on behind the scenes here at UKHSA as we combine expertise in clinical and public health, science, data and health protection operations."
        },
        {
            "text": "Our vision is to use this scientific and operational expertise to protect every person, community, business and public service from infectious diseases and environmental hazards, helping to create a safe and prosperous society."
        },
        {
            "heading": 2,
            "text": "Preparing, responding, building"
        },
        {
            "text": "Our strategic plan explains how we’ll work to achieve three goals setting out how we will prepare, respond and build."
        },
        {
            "text": "We prepare so our country is ready for any future health threats, preventing them if possible. Threats could range from a new pandemic through to a chemical, biological, radiological, nuclear or environmental hazard or a disaster event."
        },
        {
            "text": "Our strategic plan introduces the work we’re doing at local, national and international level to prepare, including our support for initiatives such as the 100 Days Mission and our work on vaccines, which spans from vaccine discovery and development through to roll-out to the population and real-world studies of vaccine effectiveness."
        },
        {
            "text": "Health threats are always around us no matter how well we prepare so we must also respond effectively. Our strategic plan details our work to respond to pressing threats from antimicrobial resistance and infectious diseases like hepatitis, HIV and TB as well as environmental hazards such as air pollution and adverse weather."
        },
        {
            "text": "To be at our best, now and in the future, we must also build, investing in the scientific, public health and operational capabilities needed to protect the country’s health. As well as working with our partners to enhance health security system capabilities our strategic plan also talks about what UKHSA will do to be the most effective and efficient organisation we can be."
        },
        {
            "text": "And as we strive to achieve these goals, we understand and acknowledge that health threats impact our communities in different ways. We’ll be relentless in protecting every community because we know that it’s often the most vulnerable people who have the worse health outcomes. These health inequalities are unfair for those directly impacted but also come at a great cost to wider society, so our plan talks about the action we will take with our partners to achieve more equitable outcomes for all."
        },
        {
            "heading": 2,
            "text": "Working together"
        },
        {
            "text": "Health security is a true team effort. Everything we achieve is a result of the talented people here at UKHSA and the strength of relationships with partners from local and national government, health and care, voluntary sector, academia and more. We prepare, respond and build as a broad community of experts all equally passionate about keeping people safe."
        },
        {
            "text": "And we are more committed than ever to forging partnerships with industry and international bodies, innovating, bringing new investment to the UK and developing the UK as a science and health protection superpower."
        },
        {
            "text": "Please take a moment to read our 3-year strategic plan on GOV.UK. In the coming days we’ll also be publishing our business plan which looks at deliverables for 2023/4 and we will receive our remit letter which outlines the Government’s expectations for UKHSA this year."
        },
        {
            "text": "We face many challenges ahead but there is no more inspiring mission than preparing, preventing and responding to health threats so we can save lives and protect livelihoods."
        },
        {
            "text": "It has never been clearer that protecting health benefits all of our communities, keeping society moving and reducing pressure on vital public services."
        },
        {
            "text": "Whether you are one of my committed UKHSA colleagues or a valued partner, I look forward to working with you on this agenda."
        }
    ]
}