{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2024/03/22/gse-leadership-values-masterclass-review/",
    "title": "GSE Leadership Values: Masterclass review",
    "authors": [
        "gseprofession"
    ],
    "categories": [
        "Capability & Skills",
        "Collaborating & Networking",
        "Talent & Leadership"
    ],
    "pub_date": "2024-03-22T10:00:20+00:00",
    "content": [
        {
            "text": "The GSE Profession delivered its first Masterclass on GSE Leadership Values in London on 12 February 2024."
        },
        {
            "text": "Professor Andrew Curran (HSE) facilitated the event alongside four key SCS speakers: Robert Bradburne (Defra), Natasha Grant (CO), Damitha Adikaari (DESNZ), and Mary De Silva (DHSC), expertly covering the GSE Leadership Values of Inclusive, Decisive, Integrity, and Collaboration. "
        },
        {
            "text": "From left to right; Damitha Adikaari (DESNZ,), Robert Bradbourne (Defra), Mary De Silva (DHSC), Natasha Grant (CO) and Professor Andrew Curran (HSE) "
        },
        {
            "text": "This in-person event was attended by 59 science and engineering professionals across government, including SCS and Fast Streamers. Participants and speakers really appreciated the face-to-face setting and having time to network and make connections. "
        },
        {
            "text": "The session was designed to cover definitions and set standards for each leadership value, speakers' personal points of view, the importance for science and engineering professionals, and share knowledge, insights, and reflections from diverse professional experiences. "
        },
        {
            "text": "Participants were divided into nine groups to debate different discussion statements based on leadership challenges related to each value, then shared their thoughts and possible solutions to the challenges. This activity was one of the most popular items, and people appreciated the range of discussion statements."
        },
        {
            "text": "This session achieved our aims of meeting profession's members in a face-to-face setting and discussing insights on what leadership challenges and barriers they face, L&D opportunities, and how the profession supports their career development journey. Participants thoroughly enjoyed the networking opportunity and wanted to have a full-day session. "
        },
        {
            "text": "This event received a very high satisfaction rate and 100% of participants responded that they are likely to apply lessons learned from this session."
        },
        {
            "text": "For more information, visit the GSE Leadership Values, GSE Leadership Values Toolkit, watch the GSE Leadership Values videos, and visit the  blogs for wider GSE learning and development offers."
        }
    ]
}