{
    "url": "https://greatbritishnuclear.blog.gov.uk/2024/03/22/three-months-into-the-year-and-three-big-steps-forward/",
    "title": "Three months into the year, and three big steps forward",
    "authors": [
        "Lucky Nwosu"
    ],
    "categories": [
        "Nuclear"
    ],
    "pub_date": "2024-03-22T10:11:38+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Step 1: The government’s Civil Nuclear Roadmap"
        },
        {
            "text": "In January 2024, the government published their Civil Nuclear Roadmap. This set out plans to boost the UK’s energy security and achieve net zero carbon emissions, with up to a quarter of Britain’s energy produced from nuclear power by 2050. Access to nuclear sites is a critical factor in achieving these nuclear ambitions, which included deploying SMRs and exploring a further large-scale reactor project after Hinkley Point C and Sizewell C."
        },
        {
            "text": "In addition to a world-leading competition to generate secure, low carbon power from SMRs, the publication of the roadmap starts providing the industry with a framework to work to in the future. It outlines how the country will boost generation of clean and reliable energy to up to 24 gigawatts (GW) by 2050."
        },
        {
            "text": "This would be enough to provide a quarter of the UK’s electricity needs, through securing 3-7 GW worth of investment decisions every five years from 2030-2044 on new nuclear projects. The roadmap provides a timeline for when the next steps for exploring a large-scale power plant as big as Sizewell in Suffolk or Hinkley in Somerset will be communicated."
        },
        {
            "text": "And what does the roadmap say about GBN?"
        },
        {
            "heading": 3,
            "text": "Great British Nuclear in the nuclear roadmap"
        },
        {
            "text": "The document says that:"
        },
        {
            "text": "\"GBN has rapidly established itself as the government’s delivery body for new nuclear. It has started this vital mission with delivery of the SMR competition, to help deliver Net Zero and promote energy security.\""
        },
        {
            "text": "The roadmap set out our role. As well as the SMR technical selection, we will also:"
        },
        {
            "text": "• Deliver other parts of the government civil nuclear programme.\n• Advise government on a broad range of industry and sectoral barriers to investment."
        },
        {
            "text": "The Civil Nuclear Roadmap provides a framework for us to help deliver more safe, clean, and affordable UK nuclear power to UK consumers. Together with industry, we will enthusiastically take up the role the government has set out for us in delivering and advising across the UK’s nuclear programme. We are actively building our capability to take on the challenge ahead."
        },
        {
            "heading": 3,
            "text": "Step 2: Nuclear sites"
        },
        {
            "text": "In a historic move for the nuclear sector, we recently announced that we are purchasing land for new nuclear development from Hitachi, at Wylfa in Ynys Môn/Anglesey and Oldbury-on-Severn in Gloucestershire."
        },
        {
            "text": "The purchase was announced by the Chancellor of the Exchequer at the Budget in March 2024, with the purchase due to close in June 2024. We are purchasing these sites to support the government’s nuclear ambitions. Decisions to come on the projects to be deployed at sites will be made as site characterisation work develops, and technology choices are made."
        },
        {
            "text": "Wylfa and Oldbury have tremendous potential and present a significant opportunity for Britain and for local communities. Each location has a long history of hosting the UK nuclear industry, and has experienced the enormous benefits that nuclear power can bring to their local and regional economies. Hitachi’s development of these sites and their work to date was one of the reasons why they were so attractive."
        },
        {
            "text": "We are setting out to work closely with the local communities at these sites to consider how future new nuclear projects will benefit their communities. Engagement has started already with local stakeholders, and we look forward to talking to local communities. There will be further updates over the coming months as the ongoing Small Modular Reactor (SMR) technology selection process and the government’s broader nuclear programme develop."
        },
        {
            "heading": 3,
            "text": "Step 3: SMR technology selection"
        },
        {
            "text": "We have also announced that the six companies in our Small Modular Reactor (SMR) Technology Selection Process can now access tender documentation, allowing them to bid for potentially multi-billion-pound technology development contracts. The technology vendors in the process are EDF Energy, GE-Hitachi Nuclear Energy International LLC, Holtec Britain Limited, NuScale Power, Rolls-Royce SMR and Westinghouse Electric Company UK Limited. These vendors will now have until June 2024 to submit their tender responses. We will then assess these responses, aiming to announce the successful bidders later in 2024. Successful bidders’ technologies will be allocated to sites and incorporated into projects, and bidders will receive funding to develop their technology."
        },
        {
            "text": "The timeline we are on is hugely ambitious, and it is the fastest that has been done in the market to date globally. It is aimed not just at speed, but to deliver a robust and successful procurement process that delivers value for the taxpayer."
        },
        {
            "heading": 3,
            "text": "What else is coming up for Great British Nuclear?"
        },
        {
            "text": "To stay up to date with our future announcements, follow us on LinkedIn and Twitter (X)."
        }
    ]
}