{
    "url": "https://naturalengland.blog.gov.uk/2024/03/22/tools-and-information-to-support-the-delivery-of-nutrient-mitigation-published/",
    "title": "Tools and information to support the delivery of nutrient mitigation published",
    "authors": [
        "Mike Burke"
    ],
    "categories": [
        "Nature-based solutions",
        "Nutrient Neutrality"
    ],
    "pub_date": "2024-03-22T17:14:35+00:00",
    "content": [
        {
            "text": "We are pleased to share a couple of products published to support the delivery of nutrient mitigation schemes across the country. These include our improved Nutrient Neutrality Budget Calculators and a page of technical Information on Nature-Based Solutions as Nutrient Mitigation. These turn the latest evidence and data available into the practical products our stakeholders have asked for."
        },
        {
            "heading": 3,
            "text": "Nutrient Neutrality Budget Calculators"
        },
        {
            "text": "Our Nutrient Neutrality Budget Calculators are all available online for the first time, and we have added new supporting guidance. The calculators work out the amount of nutrient pollution a development will generate. This informs both the developer and local planning authority about how many credits or how much mitigation is then needed to negative impact on our valuable rivers and estuaries. We will continue to work with the Department for Environment, Farming and Rural Affairs to maintain the calculators."
        },
        {
            "heading": 3,
            "text": "Nutrient Mitigation guidance"
        },
        {
            "text": "Our page of technical Information on Nature-Based Solutions as Nutrient Mitigation is now available on our Access to Evidence portal. The contents of this page aim to help Local Planning Authorities, developers and other stakeholders explore agroforestry, riparian buffer strips, river channel re-naturalisation and engineered logjams as possible nature-based solutions to nutrient pollution."
        },
        {
            "text": "The information has been written with Local Planning Authority staff in mind. To deliver these solutions developers will likely need to appoint an expert technical consultant to design the intervention and calculate its credit yield."
        },
        {
            "text": "The page includes:"
        },
        {
            "text": "These reports can help Local Planning Authorities to understand and assess how robust these nutrient mitigation solutions are within a planning application. For developers, these reports and Nutrient Mitigation tool can help inform decision on how to deliver robust mitigation. The report on riparian buffer strips is especially helpful as it shows you can work out the nutrient reduction of the option without an initial monitoring period."
        },
        {
            "text": "Although technical in nature we are excited to share this work with you, to demonstrate the growing knowledge and understanding around nutrient mitigation solutions. We will keep you informed of any new publications and please let us know what you think so that we can work together to improve them."
        },
        {
            "heading": 3,
            "text": "Definitions"
        },
        {
            "text": "Agroforestry: A farming system where trees are planted within the areas used for arable food or livestock production."
        },
        {
            "text": "Riparian buffer strip: A section of vegetation that runs adjacent to a watercourse."
        },
        {
            "text": "River channel re-naturalisation: A process to change the shape of a river back to something more natural."
        },
        {
            "text": "Engineered logjam: A build up of logs at a point in a watercourse, is that is purposefully created."
        }
    ]
}