{
    "url": "https://stratcommand.blog.gov.uk/2024/03/22/we-are-strategic-command-with-toby-andrews/",
    "title": "We Are Strategic Command with Toby Andrews",
    "authors": [
        "HeatherS"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2024-03-22T15:05:41+00:00",
    "content": [
        {
            "text": "Flying Officer Toby Andrews, Innovation Scout in the jHub, talks about the impacts of his career in innovation."
        },
        {
            "text": " "
        },
        {
            "text": "Interviewer: Can you introduce yourself and tell us about your role?"
        },
        {
            "text": "Toby: I’m Flying Officer Toby Andrews, and I am an Innovation Scout in jHub."
        },
        {
            "text": "My role involves identifying problems facing personnel in Defence and engaging with personnel, experts and industry to find a solution."
        },
        {
            "text": "Solutions can vary from software, such as language models to support working, to hardware capabilities like Unmanned Aerial Systems (UAS) that will be deployed in the field and have been developed with integration in mind."
        },
        {
            "text": " "
        },
        {
            "text": "Interviewer: What brought you to the role?"
        },
        {
            "text": "Toby: I am a Weapon Systems Officer in the RAF by trade. A friend of mine told me about the innovative work of the jHub and when I heard that they were looking for some people to join the team it seemed like the perfect opportunity."
        },
        {
            "text": " "
        },
        {
            "text": "Interviewer: What is the best part about your role in jHub?"
        },
        {
            "text": "Toby: You get to see projects from start to finish. It’s really satisfying completing a project and getting to see it in action. I also really enjoy working with my colleagues. There are people here who do such incredible work and the mix of civil servants and military provides a real opportunity to learn from their experiences and expertise."
        },
        {
            "text": "I have had so many great experiences, seeing how a project can be born, then people hear about it, buy-in, get excited and it grows."
        },
        {
            "text": "I know I will leave this role with a greater knowledge and appreciation of innovation."
        },
        {
            "text": " "
        },
        {
            "text": "Interview: Why do you think innovation is so important in Defence?"
        },
        {
            "text": "Toby: Innovation is important because if you want to be at the cutting edge, be the best and get the best results, then you need to keep innovating and learning."
        },
        {
            "text": "You can't be stagnant; we need to arm our people with the right tools, at the right time."
        }
    ]
}