{
    "url": "https://educationhub.blog.gov.uk/2024/03/22/what-to-do-if-you-think-your-child-has-measles-and-when-to-keep-them-off-school/",
    "title": "What to do if you think your child has measles and when to keep them off school",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Further education",
        "Higher Education",
        "Schools",
        "Universities"
    ],
    "pub_date": "2024-03-22T16:15:14+00:00",
    "content": [
        {
            "text": "Cases of measles are rising across England, including among children. It’s an infection that spreads very easily and for some people can cause serious problems."
        },
        {
            "text": "There’s no specific medical treatment for measles, so it’s important to get vaccinated as it’s the best protection against becoming seriously unwell."
        },
        {
            "text": "The measles, mumps and rubella (MMR) vaccine is one of the routine childhood vaccinations, so most children are already vaccinated against measles. If your child has received both doses of the vaccine, they are unlikely to have the virus."
        },
        {
            "text": "Here, we explain everything you need to know about the rise in measles cases, from getting your child vaccinated to when to keep them off school."
        },
        {
            "heading": 3,
            "text": "What are the symptoms of measles?"
        },
        {
            "text": "Measles usually starts with cold-like symptoms (cough, runny nose), a high temperature, and red, sore, watery eyes (conjunctivitis), followed by a rash a few days later. The rash looks brown or red on white skin. It may be harder to see on brown and black skin."
        },
        {
            "text": "The rash typically starts on the face and behind the ears before spreading to the rest of the body. Some people may also get small white spots (Koplik spots) in their mouth."
        },
        {
            "text": "Find out more on the NHS website."
        },
        {
            "heading": 3,
            "text": "What should you do if you think your child has measles? "
        },
        {
            "text": "If a child has been vaccinated, it is highly unlikely they have measles."
        },
        {
            "text": "You should ask for an urgent GP appointment or get help from NHS 111 if you think you or your child may have measles."
        },
        {
            "text": "Don’t go to the GP or any other healthcare setting without calling ahead first to prevent the further spread of measles."
        },
        {
            "text": "If your child has been diagnosed with measles by a doctor, they should stay off nursery or school for at least 4 full days from when the rash first appears."
        },
        {
            "text": "They should also avoid close contact with babies and anyone who is pregnant or has a weakened immune system."
        },
        {
            "heading": 3,
            "text": "What is the best way to protect against measles?"
        },
        {
            "text": "The best protection against measles for children and adults is to get both doses of the MMR vaccine."
        },
        {
            "text": "Children are offered a vaccine free on the NHS at 12-months-old and then a second dose when they turn 3-years-and-4-months-old."
        },
        {
            "text": "But you can catch up at any age – if you or your child haven’t yet been vaccinated, you should contact your GP practice to book a free appointment."
        },
        {
            "text": "Two doses of the MMR vaccine offer lifelong protection against measles."
        },
        {
            "text": "In the UK, we have 2 MMR vaccines which work very well. One of them contains porcine gelatine and the other one doesn’t. If anyone would prefer to have the vaccine that does not contain gelatine, they can talk to their practice nurse or GP."
        },
        {
            "heading": 3,
            "text": "Cold-like symptoms can be an early sign of measles. Should you still send your child to school? "
        },
        {
            "text": "If your child has been vaccinated, it’s very unlikely that they have measles."
        },
        {
            "text": "School attendance is vitally important to your child’s learning and health."
        },
        {
            "text": "According to the NHS, it’s fine to send your child to school with a minor cough or common cold, provided they don’t have a temperature."
        },
        {
            "heading": 3,
            "text": "When should you keep your child off school or nursery and how long for?"
        },
        {
            "text": "If your child has measles, they should stay off nursery or school for the entire infectious period (4 days before the rash first appears and for at least 4 full days from when the rash first appears where the date the rash appears is day 0). They should avoid close contact with babies and anyone who is pregnant or has a weakened immune system."
        },
        {
            "text": "Your child can go back to their education or childcare setting once they feel well and following the completion of the 4 day period after the rash first appears."
        },
        {
            "text": "If your child is unvaccinated against measles and is a close contact of a measles case (for instance a sibling), the health protection team may advise that your child should remain off school or nursery for a number of days to reduce the spread of meases. The number of days will vary on the circumstances. The best way to protect your child from measles and ensure they can continue to attend school is to ensure they have both doses of the MMR vaccine."
        },
        {
            "text": "If you’re not sure whether your child is due a vaccination or has missed a vaccination, you can check their Red Book or contact your GP practice."
        },
        {
            "text": "If your child has missed their first or second dose of MMR vaccine, you should contact your GP practice to book an appointment."
        },
        {
            "heading": 3,
            "text": "Should you keep your child off school if another pupil has been diagnosed with measles?"
        },
        {
            "text": "Your child should continue to attend school if another pupil has been diagnosed with measles as long as they have no symptoms and have not been advised otherwise by the Health Protection Team or GP."
        },
        {
            "text": "Most children will be protected against measles  if they have had both their MMR vaccinations."
        },
        {
            "text": "The local Health Protection Team will work with the school or setting to advise on further action."
        },
        {
            "heading": 3,
            "text": "What should I do if I can’t get a GP appointment and I suspect measles?"
        },
        {
            "text": "If a child has been vaccinated, it is highly unlikely they have measles."
        },
        {
            "text": "Ask for an urgent GP appointment or get help from NHS 111, let them know you suspect measles."
        },
        {
            "text": "Measles can spread to others easily. Call your GP surgery before you go in. They may suggest talking over the phone."
        },
        {
            "text": "You can also call 111 or get help from 111 online."
        },
        {
            "text": "The child or staff member should not attend the education or childcare setting until they have received advice."
        },
        {
            "heading": 3,
            "text": "Can I still get my child vaccinated even if they’re older? "
        },
        {
            "text": "Yes. Anyone who has not had 2 doses of the MMR vaccine should ask their GP surgery for a vaccination appointment."
        },
        {
            "text": "It’s best to have vaccines on time, but you can still catch up on most vaccines if you miss them. Two doses of the vaccine are needed to ensure full protection."
        },
        {
            "heading": 3,
            "text": "For schools, nurseries and other education settings"
        },
        {
            "heading": 3,
            "text": "What should education settings do if they have a suspected or confirmed measles case?"
        },
        {
            "text": "If an education setting is told that a child or staff member has seen their doctor in person and been diagnosed with measles, the setting should contact the UKHSA Health Protection Team so that they can investigate and support as required. If measles is suspected by the GP or healthcare professional, they will also notify the UKHSA Health Protection Team, who may then reach out if there is a setting associated with the case."
        },
        {
            "text": "Education and childcare settings are not expected to diagnose cases, and parents or carers do not need to contact the health protection team. If parents, carers, or staff are concerned that they or a child have symptoms, they should contact their doctor or NHS111. They should alert the surgery or other healthcare setting of symptoms before attending any appointment to prevent the further spread of measles."
        },
        {
            "heading": 3,
            "text": "How should schools code measles absences?"
        },
        {
            "text": "For confirmed cases, schools should continue to use usual register codes for absence due to illness."
        },
        {
            "text": "If a child needs to isolate following public health advice, the most appropriate code is likely to be an absence authorised by the school (code C)."
        },
        {
            "text": "As part of its planned changes to the attendance system, the Government is establishing a new register code to cover absences due to public health guidance."
        },
        {
            "text": "The new code is planned to take effect from September 2024."
        },
        {
            "heading": 3,
            "text": "Will the Department for Education and Ofsted take measles absences into account when reviewing the attendance statistics for schools?"
        },
        {
            "text": "Schools play a vital role in improving attendance, but not all factors influencing attendance are in their control."
        },
        {
            "text": "Ofsted will take these factors into account. Schools should demonstrate that they’re doing all they can to achieve the highest possible attendance, even if their attendance numbers are lower than previously."
        },
        {
            "heading": 3,
            "text": "What advice should special schools follow? Is there any additional advice for pupils who may be more vulnerable to exposure to measles?"
        },
        {
            "text": "Special schools and settings should also follow the UKHSA guidance."
        },
        {
            "text": "The Health Protection Team will carry out a risk assessment of the situation based on the information provided."
        },
        {
            "text": "They will ask the education setting to share information to help them understand the size and nature of the outbreak and the vaccination status of pupils, and advise on any recommended actions."
        },
        {
            "text": "The MMR vaccine is the safest and most effective way to protect yourself against measles, mumps, and rubella."
        },
        {
            "heading": 3,
            "text": "What advice is there for staff who might be more vulnerable, for example if they’re pregnant or unvaccinated?"
        },
        {
            "text": "Measles is a viral infection that spreads very easily and can cause severe illness, especially in certain groups including babies, small children, pregnant women, and people with weak immunity."
        },
        {
            "text": "The best protection against measles for children and adults is to get both doses of the MMR vaccine."
        },
        {
            "text": "For adults, it is never too late to catch up on any missed MMR vaccinations. People should contact their GP practice to book an appointment."
        },
        {
            "text": "Anyone considering getting pregnant should make sure that they are protected by having two doses of the MMR vaccine before they become pregnant.  Unvaccinated pregnant people should make sure they are vaccinated soon after the baby is born, to protect them during future pregnancies. As a precaution, the MMR vaccine is not recommended for pregnant women. This is because it is a live vaccine."
        },
        {
            "text": "If you’re pregnant and you have been in close contact with someone who has measles, you should ask for an urgent GP appointment or get help from NHS 111."
        },
        {
            "heading": 3,
            "text": "A staff member isn’t sure if they’ve had the MMR vaccine and their GP doesn’t have their vaccine records. Can they have another dose? "
        },
        {
            "text": "Anyone with an unknown vaccination history should ask their GP for a vaccine appointment. If your vaccine records are not available or do not exist it will not harm you to have the MMR vaccine again. Two doses of the MMR vaccine is the best protection against measles, mumps and rubella."
        },
        {
            "heading": 3,
            "text": "Are babies who are too young to be vaccinated protected?"
        },
        {
            "text": "Babies who are too young to be vaccinated are not protected from measles. It is still safe for children and babies who are too young to be vaccinated to attend nursery and early years setting, unless they have been advised otherwise by a health protection team or GP."
        },
        {
            "text": "The best way to protect children under 1, who are more vulnerable, is by ensuring other children and members of the household are fully vaccinated with two doses of MMR. This significantly reduces the risk of them passing the virus onto the young child. Early education settings can help by promoting the importance of the MMR vaccine."
        },
        {
            "heading": 3,
            "text": "Are staff who aren’t vaccinated and have to stay off work on public health advice entitled to pay for this period?"
        },
        {
            "text": "Unvaccinated staff who have been in contact with measles cases may be asked to stay away from school or childcare settings for a number of days, based on a risk assessment by the Health Protection Team."
        },
        {
            "text": "The Department for Education has no remit over sick pay, which is at the discretion of the school."
        },
        {
            "heading": 3,
            "text": "Some useful links to guidance and resources:"
        },
        {
            "text": "The Department for Education hosted a national webinar on the increase in measles cases, with speakers from UK Health Security Agency, the NHS, and school leaders with recent experience of dealing with a measles outbreak. The webinar covered information on measles, current epidemiology, the importance of the MMR vaccine and how to get it, and how to manage cases and outbreaks in educational settings. View this here."
        },
        {
            "text": "Measles - NHS (www.nhs.uk)"
        },
        {
            "text": "MMR (measles, mumps and rubella) vaccine - NHS (www.nhs.uk)"
        },
        {
            "text": "Supporting immunisation programmes - GOV.UK (www.gov.uk)"
        },
        {
            "text": "Managing outbreaks and incidents - GOV.UK (www.gov.uk)"
        },
        {
            "text": "UKHSA resources for settings:"
        },
        {
            "text": "Copies of printed publications and the full range of digital resources to support the immunisation programmes can be ordered through the health publications platform."
        }
    ]
}