{
    "url": "https://companieshouse.blog.gov.uk/2024/01/03/a-new-year-and-a-new-challenge-for-companies-house/",
    "title": "A new year and a new challenge for Companies House  ",
    "authors": [
        "Louise Smyth - Chief Executive and Registrar of Companies"
    ],
    "categories": [
        "Changes to UK company law",
        "Companies House transformation"
    ],
    "pub_date": "2024-01-03T11:16:27+00:00",
    "content": [
        {
            "text": "2023 was a turning point in the history of Companies House with the introduction of the Economic Crime and Corporate Transparency Act."
        },
        {
            "text": "As we start the new year, I want to reflect on our successes in 2023 and share more information about what’s happening over the coming months."
        },
        {
            "heading": 2,
            "text": "My top 3 highlights of 2023"
        },
        {
            "text": "We’re coming to the end of the fourth year of our corporate strategy for 2020 to 2025, and we continue to transform at pace to achieve our vision to be the most innovative, open and trusted registry in the world."
        },
        {
            "text": "2023 was a busy year with lots of highlights, but I’ve focused on my top 3."
        },
        {
            "text": "The Register of Overseas Entities has been a great success so far since its launch in August 2022. We acted incredibly quickly to build this register which forms a key part of the government’s strategy to tackle global economic crime. We saw the end of the transition period in January 2023, and there are now more than 30,000 entities on the register. More than 9,000 update statements have been filed so far, and we’ve started issuing penalties to those who have not complied with the legislation. We won an Innovation (Excellence) Award from the Corporate Registers Forum (CRF) for our work on implementing the new register, and this international recognition was a particularly proud moment for me after such a busy year."
        },
        {
            "text": "In September 2023, I’m so proud that we retained our Investors in People (IiP) platinum status. It’s testament to the brilliant people and leaders in Companies House that we retained our status during a period of significant change. It’s our people that make our culture, and our culture makes Companies House a great place to work."
        },
        {
            "text": "Thirdly, in October 2023, the Economic Crime and Corporate Transparency Bill gained royal assent and became an act. This marked a pivotal moment for Companies House, and all the hard work from colleagues right across government made this happen. We’re grateful to all our stakeholders for their constructive challenges and the support provided during the parliamentary process."
        },
        {
            "heading": 2,
            "text": "Looking ahead to 2024"
        },
        {
            "text": "This landmark legislation introduces a series of positive changes that will not only strengthen our powers, but also contribute to a fairer and more transparent business environment. It will mean real improvements for the UK economy, for businesses, and for individuals."
        },
        {
            "text": "As part of the act, the company registrars for England and Wales, Scotland and Northern Ireland will have new objectives and new and enhanced powers. The new objectives give us a clear sense of our priorities, and the powers in the act give us the tools to deliver our future activities against these objectives."
        },
        {
            "text": "Some changes will be introduced from March 2024. These include:"
        },
        {
            "text": "These early changes will not necessarily stop fraudulent information being accepted and published on the register. We know there’s more to do. We’re working towards additional changes, such as identity verification, which will come in later.  We’re also already acting behind the scenes to disrupt crime through our intelligence functions and will soon be able to help victims of fraud in new ways."
        },
        {
            "text": "Look out for a blog post over the next few weeks with more information about these early changes and what you’ll need to do differently."
        },
        {
            "heading": 2,
            "text": "Embracing the challenge"
        },
        {
            "text": "Our job is to make it easy for law-abiding companies to do business and to register their information with Companies House. We want this ease of doing business to continue throughout the implementation of these changes."
        },
        {
            "text": "We’re working really hard to facilitate a smooth transition. This will continue over the coming months and years as we implement further changes such as identity verification, streamlining accounts filing options for small and micro entity companies, and transitioning towards filing accounts by software only. We’ll let you know when all these changes will come into effect as soon as we can."
        },
        {
            "text": "Keep up to date on all the latest updates on our new website, and by signing up for our email newsletters."
        },
        {
            "text": "I’m looking forward to embracing the opportunities that lie ahead in 2024 with my Companies House and cross-government colleagues. Happy new year!"
        }
    ]
}