{
    "url": "https://ukhsa.blog.gov.uk/2024/01/03/a-parents-guide-to-keeping-kids-healthy-this-school-year/",
    "title": "A parent’s guide to keeping kids healthy this school term",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Children and Young people"
    ],
    "pub_date": "2024-01-03T10:05:38+01:00",
    "content": [
        {
            "text": "\nWith winter now in full swing, the New Year is a prime opportunity for parents to familiarise themselves with some of the common illnesses that could disrupt children's studies or even cause more serious illness in coming weeks."
        },
        {
            "text": "This blog post covers some of the seasonal illnesses that tend to peak during winter, as well as steps you can take now and throughout the coming term to help protect your family. We’ll explore available vaccinations, how to recognise symptoms of common illnesses, and how to make informed decisions on whether a sick student is well enough to attend school or college."
        },
        {
            "heading": 2,
            "text": "Teach good hygiene habits"
        },
        {
            "text": "Good hygiene stops infections from spreading, which means less disrupted learning time."
        },
        {
            "text": "Teach your child to wash hands properly for 20 seconds, use tissues for coughs and sneezes, and stay away from others when sick. Letting in fresh air can also reduce the spread of airborne viruses. Our e-bug resources for all ages can help you to explain and discuss hygiene habits – and why they are important - to your child or teenager."
        },
        {
            "heading": 2,
            "text": "Know when to keep your child at home"
        },
        {
            "text": "The start of a new term is a good time to familiarise yourself with the symptoms of common illnesses:"
        },
        {
            "text": "The NHS has a useful guide to help parents decide whether a child is well enough to go to school, based on their symptoms."
        },
        {
            "heading": 2,
            "text": "Know how to spot the signs"
        },
        {
            "text": "There are other types of illnesses to watch out for at this time of year, including bacterial infections such as scarlet fever. Although we see cases throughout the year, cases usually peak in the late winter and early spring."
        },
        {
            "text": "The most common symptoms of scarlet fever include sore throat, fever, swollen neck glands, a bumpy rash on the chest and tummy with a sandpaper-like feel, flushed cheeks and “strawberry tongue”. If you suspect your child has scarlet fever, contact your local GP. Stay away from nursery or school for 24 hours after the first dose of antibiotics."
        },
        {
            "text": "We are currently seeing the number of cases of measles and mumps increasing in all parts of the country. Measles in particular can be a very serious disease for some children and tragically it can even cause fatalities. The initial symptoms of measles are similar to those for a cold (runny nose; a cough; sneezing; a high temperature; and red, sore, watery eyes) this is followed by white spots in the mouth a few days later, and by a rash on the face and body a few days after that. It's very unlikely to be measles if your child has had both doses of the MMR vaccine or they’ve had measles before. Viral infections such as chickenpox can also spread in schools at any time of year and are highly contagious. An itchy, spotty rash is the main symptom of chickenpox. It can be anywhere on the body."
        },
        {
            "heading": 2,
            "text": "Ensure your child is up to date with vaccinations"
        },
        {
            "text": "Vaccines provide the best protection against many common but potentially serious illnesses. Over the past decade, fewer children are getting routine vaccines, putting them at risk of serious disease. This leaves schools vulnerable to outbreaks and increases pressure on the NHS."
        },
        {
            "text": "If your child is up to date with their NHS vaccination schedule, they will already be protected against diseases like whooping cough, measles, mumps and rubella throughout their school career, as most provide lifelong immunity."
        },
        {
            "text": "Unvaccinated children are at higher risk of contracting these illnesses and having more severe symptoms than vaccinated classmates. They can also spread diseases to others. Check your child’s red book or contact your GP surgery to ensure they are up to date on all vaccines."
        },
        {
            "text": "School-age children and young people are offered the following vaccinations:"
        },
        {
            "text": "Through these preventative measures, and by recognising illnesses promptly, you can help your child stay healthy and keep school absences to a minimum this term."
        }
    ]
}