{
    "url": "https://educationhub.blog.gov.uk/2024/01/improving-school-attendance/",
    "title": "How to improve your child’s school attendance and where to get support  ",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Attendance",
        "Schools"
    ],
    "pub_date": "2024-01-03T19:16:23+00:00",
    "content": [
        {
            "text": "This article has been updated on 29 February 2024 to reflect the latest information."
        },
        {
            "text": "For most pupils, the best place to be  is in school, surrounded by the support of their friends and teachers."
        },
        {
            "text": "This is important not just for your child’s learning, but also for their overall wellbeing, wider development and their mental health. The Chief Medical Officer has written a letter to schools explaining why regular attendance is vital to the life chances of children and young people."
        },
        {
            "text": "As a parent, it can be difficult to know when to send your child into school if they are feeling unwell or mildly anxious, but finding solutions is a team effort between schools, parents and children, and there is support and information available to help you make the best decision for your child."
        },
        {
            "text": "We're introducing new guidance to help schools remove the barriers to attendance that some pupils face, which will be made statutory across the country from August 2024.  We explain more on this below."
        },
        {
            "text": "It’s also important to acknowledge that children with long-term medical or more serious mental health conditions, and those with special educational needs and disabilities may face additional barriers."
        },
        {
            "text": "For children who face complex barriers to attendance, schools should have sensitive conversations with children and families and work with them to put support in place for their individual needs."
        },
        {
            "heading": 3,
            "text": "What if my child is too ill to go to school?  "
        },
        {
            "text": "It’s usually safe for parents and carers to send their children to school with mild illnesses, like a minor cough, runny nose or sore throat."
        },
        {
            "text": "However, children should stay at home if they have a high temperature of 38C or above."
        },
        {
            "text": "The NHS has published guidance to help parents and carers decide whether their child is well enough to attend school, including information on a range of common childhood illnesses and conditions, such as coughs, colds, chickenpox, measles and headlice."
        },
        {
            "heading": 3,
            "text": "What if my child is too anxious to go to school?  "
        },
        {
            "text": "Children can sometimes feel a little bit worried about going to school. Mostly, this is a very normal emotion."
        },
        {
            "text": "It’s important to recognise that going into school can help children to feel less worried than letting them stay at home."
        },
        {
            "text": "If your child is anxious over several weeks, talk to their school about how they can support you."
        },
        {
            "text": "We have put together some useful links  on the Education Hub on mental health support which you may find helpful."
        },
        {
            "heading": 3,
            "text": "What does it mean if a child is persistently or severely absent?  "
        },
        {
            "text": "Children who are registered at a school but regularly fail to turn up are officially referred to as being ‘persistently’ or ‘severely’ absent."
        },
        {
            "text": "The school day is split into two sessions – one session counts as a morning or afternoon spent in school."
        },
        {
            "text": "Pupils who have missed more than 10 per cent of school sessions are considered persistently absent, while children who have missed more than 50 per cent of school sessions are referred to as severely absent."
        },
        {
            "heading": 3,
            "text": "What about children with SEND?  "
        },
        {
            "text": "Of course, some children face greater barriers to attendance, such as pupils with long term medical conditions or special educational needs and disabilities."
        },
        {
            "text": "For children who face complex barriers to attendance, schools should have sensitive conversations with children and families and work with them to put support in place. This is explained in our 'Working together to improve school attendance' guidance.  "
        },
        {
            "text": "Support may include reasonable adjustments for pupils with disabilities or help for pupils where  mental health issues are affecting their attendance."
        },
        {
            "text": "The new guidance also introduces new attendance codes that track children who are on part-time timetables, or absent because transport hasn’t been provided, to help better understand patterns and barriers to attendance ."
        },
        {
            "heading": 3,
            "text": "When can my child be absent from school? "
        },
        {
            "text": "When you register your child at school, you have a legal duty to ensure your child attends that school regularly."
        },
        {
            "text": "This means that your child must attend every day that the school is open, unless:"
        },
        {
            "text": "You are a gypsy/traveller family with no fixed abode, and you are required to travel for work that day meaning your child cannot attend their usual school.  In most circumstances, however, your child is required to attend another school temporarily during such absences."
        },
        {
            "text": "These are the only circumstances where schools can permit your child to be absent."
        },
        {
            "text": "Parents who take their child out of school without permission may face paying a fine."
        },
        {
            "heading": 3,
            "text": "What should I do if my child needs to be absent from school? "
        },
        {
            "text": "You should contact their school as early as possible to explain why your child needs to be absent, for instance if they are too ill to attend school."
        },
        {
            "text": "If not, your child’s school will contact you on the first morning of their absence to find out why."
        },
        {
            "text": "All parents can request a ‘leave of absence’ for their child which gives them permission to be absent from school."
        },
        {
            "text": "These must be agreed with the school in advance and will only be granted in exceptional circumstances."
        },
        {
            "text": "Your child’s headteacher has the final say over whether to approve the request and how long your child can be absent."
        },
        {
            "heading": 3,
            "text": "What else is being done to improve school attendance?  "
        },
        {
            "text": "We’re supporting schools to boost attendance through a range of initiatives and have published guidance on how we, parents, schools, Trusts, governing bodies and local authorities can work together to make sure pupils go to school."
        },
        {
            "text": "This will be made statutory from August 2024, meaning it will be a legal requirement for schools to follow the guidance."
        },
        {
            "text": "We’ve put together a short guide which helps parents understand the guidance. It explains how you can work with your school and local authority to support your children to attend."
        },
        {
            "text": "Other initiatives include:"
        },
        {
            "text": "Together, these measures aim to improve attendance, leading to better attainment and mental wellbeing amongst school children."
        },
        {
            "heading": 3,
            "text": "Where can parents get support and advice?  "
        },
        {
            "text": "Children may struggle to attend school for a wide range of reasons."
        },
        {
            "text": "If your child is struggling to attend school, both their school and your local authority also have responsibilities to help you to support your child’s attendance."
        },
        {
            "text": "In most cases, if your child’s attendance level is falling, their school will contact you to explore the reasons and discuss what help can be put in place to help you overcome the barriers they are facing."
        },
        {
            "text": "If your child is struggling to attend school, you can expect the school to meet with you, and your child if they are old enough."
        },
        {
            "text": "The school will want to understand the reasons for their absence and what support you or they need to overcome the barriers to attendance they are experiencing."
        },
        {
            "heading": 3,
            "text": "Reasons that relate to being in school "
        },
        {
            "text": "If the barriers to your child’s attendance are in school – such as they are having friendship problems – the school is responsible for working with you to help overcome the issues."
        },
        {
            "text": "Information on who in school you can contact for help, including the school’s senior leader responsible for attendance, can be found in the school’s attendance policy on its website or available in hard copy from the school itself."
        }
    ]
}