{
    "url": "https://mhclgmedia.blog.gov.uk/2024/07/12/driving-local-growth-through-a-new-era-of-devolution-no-10-mayoral-roundtable/",
    "title": "Driving local growth through a “new era” of devolution: No 10 mayoral roundtable",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Devolution"
    ],
    "pub_date": "2024-07-12T17:13:25+01:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "The first-ever cross-party mayoral meeting bringing together England’s metro mayors was held in Downing Street this week (9 July 2024). Word of the meeting first hit The Guardian's Monday front page, highlighting the new Government’s plans to power up Britain by spreading power around the country and rolling out new Local Growth Plans."
        },
        {
            "text": "The meeting saw widespread national and regional coverage, and Prime Minister Keir Starmer and Deputy Prime Minister Angela Rayner kicked off their manifesto plans to devolve more power out of Westminster and into the hands of local leaders. Adding to this media interest, new MHCLG Minister Jim McMahon spoke on national TV and radio breakfast shows (BBC, Sky, Times Radio and LBC), highlighting the Government’s plans to empower mayors with new powers and freedoms."
        },
        {
            "text": "At the meeting, the Deputy Prime Minister kickstarted the process of drawing up Local Growth Plans, to work alongside a national industrial strategy, and recommitted to giving mayors new powers over planning, skills, employment support and transport."
        },
        {
            "text": "The Government made clear that its ambitions for integrated funding for Mayoral Combined Authorities applied to those who can show exemplary management of public money, and that the flexibilities were not reserved for Greater Manchester and the West Midlands alone."
        },
        {
            "text": "The Guardian, Independent, BBC online and Financial Times were among many national outlets that covered positive outcomes from the meeting, branding it as the start of a “new era” of devolution. The Northen Agenda said Northern mayors are “still basking in the glow” of the “very, very positive” talks, with other regional titles also hailing the meeting’s success – from The Liverpool Echo to The Northern Echo, CambsNews, MNR Journal, Express and Star, York Press and more."
        },
        {
            "text": "Deputy Prime Minister Angela Rayner said:  "
        },
        {
            "text": "“We want to relight the fire of our regions to drive growth in every part of this country, and to do this properly we need people who know their areas best to have their say.  "
        },
        {
            "text": "“That’s why it’s so important we work hand-in-hand with our Mayors to harness the potential of our towns and cities, tackle regional inequalities and to make a difference to people’s lives. "
        },
        {
            "text": "“But I want to take devolution even further and expand our offer to other areas – and I invite local leaders from parts of England without a mayor to come forward and speak to us about how we can work with you to transform your regions.” "
        }
    ]
}