{
    "url": "https://mhclgmedia.blog.gov.uk/2024/07/12/planning-reform-and-housing/",
    "title": "Planning reform and housing",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Housing",
        "Planning"
    ],
    "pub_date": "2024-07-12T17:37:53+01:00",
    "content": [
        {
            "text": "The Government has this week announced first steps in reforming the planning system to get Britain building and bring about the biggest increase in social housing and affordable housebuilding in a generation."
        },
        {
            "text": "In a speech on Monday, the Chancellor Rachel Reeves outlined how the Government is taking action to fix the planning system and build more homes to deliver growth. The Government will restore mandatory housing targets and make changes to the National Planning Policy Framework, consulting on a new growth-focused approach to the planning system before the end of the month."
        },
        {
            "text": "It will create a new taskforce to accelerate stalled housing sites in our country, with plans announced by the Chancellor on Monday to unlock more than 14,000 homes in Liverpool Central Docks, Worcester Parkway, Northstowe and Langley Sutton Coldfield."
        },
        {
            "text": "The Deputy Prime Minister Angela Rayner is writing to partners in local government to set out how they will help to get Britain building. Local authorities will ensure universal coverage of local plans and review their Green Belt boundaries where necessary to meet housing need, and the Government will support them with 300 new planning officers across the country."
        },
        {
            "text": "Minister of State Matthew Pennycook spoke about the plans this week across broadcast programmes including BBC, Sky and Bauer and reaffirmed the Government’s commitment to reform the planning system."
        },
        {
            "text": "Minister of State Matthew Pennycook said:"
        },
        {
            "text": "“We feel it’s incredibly important to fight this battle. We’ve got to get it right, but we do have to take planning reform on because it’s a major constraint on growth, and the only way that we are going to improve the prosperity of the country, improve living standards, is by a focus on sustained growth.”"
        }
    ]
}