{
    "url": "https://stratcommand.blog.gov.uk/2024/03/19/8-facts-to-level-up-your-knowledge-on-wargames/",
    "title": "8 facts to level up your knowledge on Wargames",
    "authors": [
        "HeatherS"
    ],
    "categories": [
        "Training"
    ],
    "pub_date": "2024-03-19T15:06:30+00:00",
    "content": [
        {
            "text": "From digital networks to medical services, Strategic Command is responsible for a lot of different functions within Defence."
        },
        {
            "text": "This means there are probably parts you haven’t heard of, and even if you have you might not know how their work supports our Armed Forces. One of these areas is the Defence Experimentation and Wargaming Hub."
        },
        {
            "text": "Based at MOD Southwick Park, most famously known as the planning location of D-Day, the Defence Experimentation and Wargaming Hub is looking to change the future of warfare. But what is wargaming and why is it so important?"
        },
        {
            "text": " "
        },
        {
            "text": "Here are 8 facts to help you understand this game-changing area:"
        },
        {
            "text": " "
        },
        {
            "text": "Wargames are scenario-based warfare models, where outcomes and events affect, and are affected by, the decisions made by players."
        },
        {
            "text": " "
        },
        {
            "text": "Wargames can simulate armed conflicts of different sizes, be it a battle, a campaign, or an entire war. These simulations train players to evaluate situations and make decisions faster."
        },
        {
            "text": " "
        },
        {
            "text": "Wargaming provides cost-effective opportunities to explore options and test strategies without risking lives."
        },
        {
            "text": " "
        },
        {
            "text": "The Defence Experimentation and Wargaming Hub was developed in partnership with the Defence Science and Technology Laboratory (Dstl)."
        },
        {
            "text": " "
        },
        {
            "text": "Personnel from the Royal Navy, British Army, Royal Air Force and Civil Service work together to share their experience and insights at the Hub."
        },
        {
            "text": " "
        },
        {
            "text": "Blending digital and traditional wargaming, the Hub will be able to model battle scenarios through simulation and conduct wargames with hundreds of people across the world."
        },
        {
            "text": " "
        },
        {
            "text": "By studying the potential nature of future conflicts, the Defence Experimentation and Wargaming Hub will help develop the strategic thinking of our serving personnel and civil servants."
        },
        {
            "text": " "
        },
        {
            "text": "Just like Southwick Park, Wargaming is engrained in military history. Young female WRENs (Women’s Royal Navy Service) were the backbone of the Western Approaches Tactical Unit (WATU) where wargaming tactics were developed to counter the threat of German U-boats in World War II."
        },
        {
            "text": " "
        },
        {
            "text": "To learn more about wargaming and further guidance, read the MOD Wargaming Handbook."
        }
    ]
}