{
    "url": "https://hmlandregistry.blog.gov.uk/2024/03/19/recognising-the-vital-work-of-conveyancers/",
    "title": "Recognising the vital work of conveyancers",
    "authors": [
        "Terry Robertson, Deputy Director, Strategy, and Eddie Davies, Deputy Director of Digital Services, HM Land Registry"
    ],
    "categories": [
        "Law and practice"
    ],
    "pub_date": "2024-03-19T11:02:36+00:00",
    "content": [
        {
            "text": "Reflecting on last week’s second National Conveyancing Week (NCW), we want to take this valuable opportunity to catch up with and pay tribute to conveyancers."
        },
        {
            "text": "Considerable challenges persist within the property sector. We recognise the increased demands and pressures on the valuable service you provide and we fully support the critical role you continue to play in every property transaction."
        },
        {
            "text": "The conveyancing profession underpins the property market and we are exploring new ways to assist you in the vital work you do. While reducing the backlog remains our number one priority, we are introducing new services and support to make life a little easier for our customers. "
        },
        {
            "text": "Although there is still much to do, we’ve made numerous strides in the past year. Here is a flavour of our current and recent activities."
        },
        {
            "heading": 2,
            "text": "Recruitment and internal training reflect the sector’s needs"
        },
        {
            "text": "Acknowledging our need for more caseworkers to tackle our on-going challenges, we’re continuing to build up our team of experts."
        },
        {
            "heading": 2,
            "text": "Digital by Default and portal enhancements well received "
        },
        {
            "heading": 2,
            "text": "Customer training and guidance – working with the sector to improve expertise "
        },
        {
            "text": "Thanks to constructive feedback, and our own experience, new training and initiatives to help the sector stay on top of its game include:"
        },
        {
            "text": "While our overriding focus remains firmly on the challenges facing us all today, we know we need to prepare for the future."
        },
        {
            "text": "Our Deputy Chief Executive and Director of Customer and Strategy, Mike Harlow, linked up with Bold Legal Group’s Chief Executive, Rob Hailstone, during National Conveyancing Week to discuss topics affecting day-to-day conveyancing, as well as HM Land Registry’s current direction of travel. "
        },
        {
            "text": "Stressing that speed of service remains our primary focus, Mike confirmed that HM Land Registry’s significant investment in its core capacity and capability is bearing fruit, with output at a record high and the age of all case types decreasing. "
        },
        {
            "text": "It is vital that the sector work together, however, and so we are pleased to be part of the Digital Property Market Steering Group (DPMSG). The group is currently seeking views from everyone involved in buying and selling property on how it can improve the uptake of digital processes and action upfront information. The survey is live until midnight 1 April 2024."
        },
        {
            "text": "We hope you will take the chance to have your say. "
        },
        {
            "text": "A final word from Mike:"
        },
        {
            "text": "“As somebody who used to [be a conveyancer] myself I do know how tough it is at times, I know the pressures, you can’t always manage your work, the expectations on what you should do as the professional who’s making it all happen. It’s a pretty tough job and a pretty tough career, but it’s immensely important.” "
        }
    ]
}