{
    "url": "https://earlyyears.blog.gov.uk/2024/03/19/the-holiday-activities-and-food-programme-when-you-need-to-register-with-ofsted/",
    "title": "The Holiday Activities and Food programme – when you need to register with Ofsted",
    "authors": [
        "Jayne Coward, Deputy Director for Early Years Regulatory Policy and Practice"
    ],
    "categories": [
        "Early years"
    ],
    "pub_date": "2024-03-19T11:59:30+00:00",
    "content": [
        {
            "text": "The Holiday Activities and Food (HAF) programme is funded by the Department for Education (DfE). The aim of the programme is to help families with enrichment activities and food for children throughout the holiday periods. The programme is for children who receive free school meals, although providers are encouraged to make it open to all."
        },
        {
            "text": "HAF providers are encouraged to check if they are required to register with Ofsted."
        },
        {
            "text": "Ofsted is responsible for registering, regulating and inspecting childcare provision that is required to register with us."
        },
        {
            "text": "Do you need to register with Ofsted?"
        },
        {
            "text": "We continue to receive queries from HAF providers about whether they need to register. We have updated our childcare exemptions guidance with information about HAF provision to clarify this. You can find the section on HAF providers and other specific types of provision here."
        },
        {
            "text": "If you are a childcare provider interested in offering the HAF programme, the DfE sets out certain requirements to receive grant funding. These are separate to the legal requirements of Ofsted childcare registration."
        },
        {
            "text": "If you are a HAF provider, it is your responsibility to understand whether your provision is required to be registered with Ofsted. You must continue to review your status if the provision you are offering changes."
        },
        {
            "text": "The requirement to register with Ofsted depends on:"
        },
        {
            "text": "Even if you are not required to register with us, you may be eligible to register on the voluntary part of the Childcare Register if you meet the requirements. This is necessary if you want parents to be able to use their Tax-Free Childcare entitlements."
        },
        {
            "text": "If you are considering setting up HAF provision, you should work with your local authority to determine whether you need to register with Ofsted."
        },
        {
            "text": "The key things to consider for whether you need to register are the type of provision, the age of the children and the hours offered."
        },
        {
            "text": "The type of provision you offer"
        },
        {
            "text": "If you provide activity-based sessions, you can only legally offer 1 or 2 types of activities from the list below, otherwise you will not be exempt from compulsory registration:"
        },
        {
            "text": "Remember that we do not necessarily expect everyone working there to be a specialist coach, but they should have relevant skills to help children improve."
        },
        {
            "text": "The age of the children attending and the hours offered"
        },
        {
            "text": "You must register if you provide care for children aged under 8 for more than 2 hours a day."
        },
        {
            "text": "However, there are exceptions in the activity-based exemption that mean you can care for children aged under 5 for up to 4 hours, and for longer than 4 hours if children are over 4. Or, for example, children of any age for only 2 weeks per year, if you let Ofsted know in writing beforehand."
        },
        {
            "text": "Why register with Ofsted?"
        },
        {
            "text": "It may allow parents to gain financial assistance with their childcare costs."
        },
        {
            "text": "Parents can redeem employer-supported vouchers against childcare costs."
        },
        {
            "text": "And families may be eligible for Tax-Free Childcare, or the childcare costs element of Universal Credit (UC). Through UC, families may be able to claim back up to 85% of their childcare costs if they are attending and paying for extra childcare at Ofsted-registered settings."
        },
        {
            "text": "We recently took part in a HAF bitesize session on Ofsted registration benefits and considerations. The session aims to provide you with details on:"
        },
        {
            "text": "Conclusion"
        },
        {
            "text": "This blog provides some pointers, but please make sure you read the childcare registration exemptions guidance to determine whether the type of provision you are offering requires registration with Ofsted or if you can rely on a registration exemption. It is your responsibility to get this right. It is an offence to provide childcare that requires registration without being registered with Ofsted."
        },
        {
            "text": "We want to support you and the DfE in making this programme a success."
        }
    ]
}