{
    "url": "https://socialworkwithadults.blog.gov.uk/2024/03/19/world-social-work-day-lived-experience-informs-the-very-best-social-work/",
    "title": "World Social Work Day: lived experience informs the very best social work",
    "authors": [
        "Jak Savage MBE",
        "Jason Brandon"
    ],
    "categories": [
        "Care and support",
        "Co-production",
        "Knowledge and skills",
        "Our profession",
        "Society",
        "Viewpoint"
    ],
    "pub_date": "2024-03-19T09:46:42+00:00",
    "content": [
        {
            "heading": 2,
            "text": "The value of lived experience"
        },
        {
            "text": "Jak Savage: Collaborating with the Chief Social Worker for Adults Office and the Principal Social Worker Network to co-produce the guidance for the profession on proportionate assessment approaches was a particular highlight for me this past year."
        },
        {
            "text": "Alongside the webinars on assessments and presenting to the PSW network, I have the ongoing privilege of using my combined lived and worked experience to develop and deliver workshops for the social care workforce. I'm working to celebrate the power of transformational social work and the long-lasting effects great practice has on the lives of those drawing on care and support."
        },
        {
            "text": "Behind the scenes my day starts early. I'm supported to sit up in bed before one of my four PA’s assists me to bathe, dress, take medication and have meals. Day to day, the care I receive has been finely tuned and personalised to maximise the way I wish to live my life. Investing in my PA’s has been an ongoing priority. If I invest in the care and support of my team, it means I directly reap the benefits through the quality of their care provision."
        },
        {
            "text": "If I take you back nine years, I was without the health and disability challenges I face today. I was independent, leaving home at 7am in the morning and delivering care and support in people’s homes as part of a local authority reablement team. Before that I was in a short-stay MDT setting for assessments and reablement for adults following hospital discharge or community referral and other varied roles in the sector."
        },
        {
            "text": "Having this 360-degree perspective has given me wisdom beyond any professional experience I could have picked up in my career. My 30 years working in the sector have made me a well-equipped employer of PA’s."
        },
        {
            "heading": 2,
            "text": "Transformational care"
        },
        {
            "text": "Daily life is carefully carved around care and support routines which enable a work/life balance within a busy family home. It took me a few years before I had the capacity to work again and get my health under control."
        },
        {
            "text": "Determination, resilience, and the excellent social work I received have been essential motivators for recognising my potential again. Aspirations that were once extinguished have been reignited through the power of transformational social work practice."
        },
        {
            "text": "With every new deflating scenario thwarting progression came an enthusiastic social worker with supersized bellows to fan the flames of inspiration. Innovative thinking, being solutions focussed and empowerment won over in the end, as they responded to the ebbs and flows of my ever-changing circumstances."
        },
        {
            "text": "In the care and support planning for adults drawing upon support having that fluid and dynamic approach that responds to barriers with innovative thinking to overcome them.  Enabling strengths based support planning in my life has had an overwhelming impact upon my wellbeing and health."
        },
        {
            "heading": 2,
            "text": "Person-centred support"
        },
        {
            "text": "I say my support plan is 90% me and 10% my social worker reigning me in and that is something I celebrate when going to share good practice with other social work teams around the country."
        },
        {
            "text": "It has not always been just an adult social care journey for me of course. For those local authority colleagues who attend my workshops, I share a journey that started for me in a children’s home."
        },
        {
            "text": "The influence of social workers' residential practice inspired me to train in social care; to believe in myself, achieve and aspire to go to college and rise beyond my expectations of a life to me that felt broken."
        },
        {
            "text": "Never has my life’s journey felt more useful in social work practice than it does now. This year's theme, ‘Buen Vivir: Shared Future for Transformative Change’ feels especially poignant."
        },
        {
            "text": "I celebrate great practice for its ability to construct a future of hope, making lasting change through shared wisdom. I look forward to the coming year to continue using my expertise to improve social work practice development, social care delivery, and the lives of others drawing upon support."
        }
    ]
}