{
    "url": "https://forestrycommission.blog.gov.uk/2025/08/25/woods-and-water-for-climate-change/",
    "title": "Woods and water for climate change",
    "authors": [
        "Chris Waterfield"
    ],
    "categories": [
        "Tree planting",
        "Woodland management"
    ],
    "pub_date": "2025-08-25T09:00:00+01:00",
    "content": [
        {
            "text": "Water is the most vital natural resource – it’s essential to life. As climate change brings more extreme weather across the UK, from devastating floods to prolonged droughts, protecting our water sources has never been more urgent."
        },
        {
            "heading": 2,
            "text": "Why woodlands matter for water"
        },
        {
            "text": "For years, we’ve been removing woodland – our land’s natural protective blanket. We’re now beginning to feel the consequences. However, there is good news. Planting new woodland and managing existing woodland can help us fight back against climate change. "
        },
        {
            "text": "Our forests and woodlands have a close relationship with water quality, flood risk management and water supply. Understanding where woodland creation can deliver the biggest benefits for water is key to building climate resilience."
        },
        {
            "heading": 2,
            "text": "Cleaner water through trees"
        },
        {
            "text": "Sustainable planning and management is essential to improve our waterways. Trees act as a good and effective buffer to our rivers, streams, lakes and reservoirs, as they act as natural filters removing pollutants from water."
        },
        {
            "text": "The way you plant and manage trees can support their ability to protect water. For capturing dissolved pollutants like nitrate and phosphate, you typically plant trees closer together, which encourages them to draw up more nutrients and promote soil infiltration (where water on the surface enters the ground) and thereby soil retention. To trap sediment and particles in run-off you can create more open tree canopy and thicker ground vegetation, like those typically found on woodland edges."
        },
        {
            "text": "Therefore, managing your riverside woodland should focus on encouraging natural processes that restore, protect and maintain riparian (trees situated close to water courses) and aquatic habitats. Well-managed woods can also achieve a better woodland structure and protect retained open water habitats like ponds and wetlands, in which wildlife and biodiversity depend on."
        },
        {
            "heading": 2,
            "text": "Natural flood defence"
        },
        {
            "text": "Did you know that trees can evaporate more water than any other type of vegetation? Intercepting rainfall before it hits the ground results in drier soils that can soak up and store more of this water below-ground."
        },
        {
            "text": "Woodland soils are typically better structured than in other land uses, allowing more rainfall to enter and pass through, rather than running off and contributing to flooding. Trees, shrubs and deadwood on the surface also slow the flow of floodwater and delay its passage to watercourses."
        },
        {
            "text": "There are intervention opportunities to enhance these benefits: creating informal flood storage features such as ponds and scrapes can increase floodwater storage. Less intensive restocking can improve soil health and water infiltration. Blocking in-field drains when you’re creating a new woodland, can help towards restoring its natural hydrology and contribute to flood management."
        },
        {
            "text": "Natural defences like these are becoming more important as climate change brings more extreme summer downpours. Trees protect soil from erosion, preventing silt from clogging up river channels – which keeps rivers flowing freely when floods hit."
        },
        {
            "text": "Installing man-made leaky woody structures can slow water flow – in nature these are features of a woodland stream sustained by fallen trees or woody debris from riparian woodland. Forest roads, embankments, culverts and other planned forest structures can hold back flood flows in existing woods and forests if they are working well."
        },
        {
            "text": "Woody material in waterways needs careful management, especially near bridges and culverts that could get blocked and lead to local flooding. While man-made leaky woody structures work well in flash flood catchments, you should always get permission from your lead flood authority before installing them."
        },
        {
            "heading": 2,
            "text": "Drought protection"
        },
        {
            "text": "As summers become hotter and drier, woodlands can help conserve precious water supplies. Strategic planting around field edges or along waterways create windbreaks and shade to reduce evaporation from soil and crops."
        },
        {
            "text": "Trees also intercept rainfall, resulting in rainfall being absorbed by the soil to further replenish groundwater reserves to help during periods of drought."
        },
        {
            "heading": 2,
            "text": "Take action for water"
        },
        {
            "text": "Whether you own a woodland or are thinking about planting a new one, consider how you can design and manage your woodland to help preserve our most precious natural resource."
        }
    ]
}