{
    "url": "https://ukhsa.blog.gov.uk/2023/07/18/antibiotic-resistant-gonorrhoea-staying-well-while-travelling/",
    "title": "Antibiotic-resistant gonorrhoea: staying well while travelling",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Health and Wellbeing"
    ],
    "pub_date": "2023-07-18T16:49:33+01:00",
    "content": [
        {
            "text": "Lots of people engage in casual sex when travelling. While this is nothing new, it is more important than ever that while enjoying holidays and trips overseas, we are wary about catching STIs and doing what we can to prevent that happening.  "
        },
        {
            "text": "Engaging in condomless sex on holiday you run the risk of returning to the UK with an infection. In this blog, we take a look at one STI that is circulating in popular holiday destinations and why it’s so important to use protection wherever you’re travelling to. "
        },
        {
            "text": "Travellers having casual sex abroad should be mindful of the risks and use condoms with any new or casual partners while abroad. In the same way that we get travel insurance or apply sunscreen, we should be thinking about safer sex.  "
        },
        {
            "text": "The message isn’t about avoiding having sex, it’s about being aware of the risk of infection and using condoms consistently and correctly with all new or casual partners. "
        },
        {
            "heading": 2,
            "text": "Which STIs are on the rise and what are the risks for travellers?  "
        },
        {
            "text": "There is an increasing risk of antibiotic-resistant Neisseria gonorrhoeae (N. gonorrhoeae) which is on the rise in popular tourist destinations in the Asia-Pacific region – including countries such as China, Thailand, Cambodia and the Philippines. This type of gonorrhoea is not easy to treat.  "
        },
        {
            "heading": 2,
            "text": "Why is gonorrhoea becoming harder to treat? "
        },
        {
            "text": "N.gonorrhoeae, the bacteria that causes gonorrhoea, has developed some level of resistance to all classes of antibiotics recommended for treatment including ceftriaxone, which is regarded as the ‘last-line’ therapy. This means we don’t have another treatment option when this doesn’t work. "
        },
        {
            "text": "Ceftriaxone resistance is common in the Asia-Pacific region and is rarely found in the UK. However, we have recently seen a rise in cases – this rise can usually be traced to holiday goers to the region or students journeying to the UK. "
        },
        {
            "text": "Between December 2015 and September 2021, nine cases of ceftriaxone-resistant N. gonorrhoeae were detected in the UK, all of which were associated with international travel. However, a further 10 cases were reported over the 6-month period between December 2021 and June 2022. These travel-associated cases serve as a cautionary reminder of the ease with which resistant strains of STIs can be caught while abroad, and indeed not everything that happens on holiday stays on holiday. "
        },
        {
            "heading": 2,
            "text": "Gonorrhoea cases in England "
        },
        {
            "text": "At home, high rates of gonorrhoea remain an issue after a 50% increase in diagnoses between 2021 and 2022 – there were 82,592 gonorrhoea diagnoses in 2022, the largest number on record since STI surveillance began in 1918.  "
        },
        {
            "text": "If you have engaged in condomless sex it remains important to be aware of any recently developed STI-related symptoms such as a thick green or yellow discharge from the vagina or penis, pain when urinating, pain and discomfort in the rectum and, in women and other people with a uterus or ovaries, lower abdominal pain and bleeding between periods.  "
        },
        {
            "text": "If you notice any such symptoms, it is important to avoid sexual contact and get a sexual health screen – even where symptoms are not present it is now advisable for those who have had condomless sex whilst abroad to get a sexual health screen on returning to the UK, as people with gonorrhoea will often have no symptoms especially for infections in the throat, vagina or rectum. "
        },
        {
            "heading": 2,
            "text": "Getting tested "
        },
        {
            "text": "Depending on where you live you could get an STI self-sampling kit sent to your home, speak to your local pharmacist or simply attend your local sexual health clinic to request an STI test. "
        },
        {
            "text": "Testing and treatment for gonorrhoea as soon as possible is very important as if left unchecked it can lead to serious long-term health problems. Gonorrhoea can spread to the reproductive organs and cause pelvic inflammatory disease (PID), ectopic pregnancy and infertility. Gonorrhoea can also result in pain in the testicles and, in some cases, reduced fertility. "
        },
        {
            "text": "Although new antibiotic treatments for gonorrhoea are being developed, they are not expected to be available soon, so it’s important to take steps to protect ourselves from all STIs when at home or away and use condoms when having sex with new and casual partners.  "
        },
        {
            "text": "Returning from of our adventures abroad with good memories is preferable to bringing back an infection, practice safer sex so that you’re not passing through customs with an undeclared antibiotic resistant gonorrhoea infection.  "
        }
    ]
}