{
    "url": "https://deframedia.blog.gov.uk/2023/07/18/coverage-of-the-third-national-adaptation-programme-launch/",
    "title": "Coverage of the third National Adaptation Programme launch",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Nature"
    ],
    "pub_date": "2023-07-18T15:37:33+01:00",
    "content": [
        {
            "text": "There has been coverage in the Guardian, Telegraph, Independent and the Times following the publication of the government’s third National Adaptation Programme (NAP3) yesterday (17 July 2023)."
        },
        {
            "text": "The NAP3 sets out a strategic five-year plan to boost resilience and protect people, homes, businesses and our cultural heritage against climate change risks such as flooding, drought and heatwaves – all of which are becoming increasingly evident in the UK and abroad."
        },
        {
            "text": "This publication marks a step-change in the UK government’s approach to climate adaptation, setting out in one place the ambitious programme the government is undertaking to address the key climate risks facing the country."
        },
        {
            "text": "The plan includes a new £15 million programme to invest in research and skills to improve our response further, as well as a dedicated Local Authority Climate Service pilot which will help local authorities plan adaptation by informing them about hazards such as increased heavy rainfall patterns and extreme heat."
        },
        {
            "text": "Environment Secretary Thérèse Coffey said:"
        },
        {
            "text": "Environment Agency Chief Executive Philip Duffy said:"
        },
        {
            "text": "From helping homes, schools and hospitals prevent overheating to safeguarding our food and energy supply chains from disruption, the plan includes measures to address the impact of a changing climate on all sections of society."
        },
        {
            "text": "The government is already investing billions on adaptation measures, including through £5.2 billion in flood and coastal schemes in England, over £750 million for the Nature for Climate Fund, which supports nature-based solutions for climate resilience, and £80 million for the Green Recovery Challenge Fund which creates jobs in nature recovery and conservation - all of which play a crucial role in enhancing the UK's resilience to climate change."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}