{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2023/07/18/nominations-are-open-for-the-civil-service-awards-2023/",
    "title": "Nominations are open for the Civil Service Awards 2023",
    "authors": [
        "gseprofession"
    ],
    "categories": [
        "Blog Series"
    ],
    "pub_date": "2023-07-18T10:27:05+01:00",
    "content": [
        {
            "heading": 2,
            "text": "Best Use of Data, Science, and Technology Award"
        },
        {
            "text": "Calling all those who work with science, data, technology, or in multidisciplinary teams! There is still time to submit nominations for the Best Use of Data, Science, and Technology Award which is being co-championed by Dame Angela McLean, Government Chief Scientific Adviser and Head of the GSE Profession, and Megan Lee Devlin, Chief Executive, Central Digital and Data Office at the Cabinet Office."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": "This award recognises excellence in the application of data, science or digital technology to solve problems or improve things and/or celebrate people whose commitment to technological improvements creates measurable outcomes."
        },
        {
            "heading": 3,
            "text": "Why get involved? "
        },
        {
            "text": "In June 2021, the government launched their vision for A Modern Civil Service that is more skilled, ambitious and innovative. This is reflected in each of the award categories, offering civil servants an opportunity to recognise the work of colleagues that reflect this vision."
        },
        {
            "text": "Has your team used the application of data, science or technology to help achieve positive outcomes for citizens? Have you demonstrated new, creative approaches to the use of data, science and technology? Or do you have examples of how data, science and technology has supported innovation?"
        },
        {
            "text": "If so, we would encourage you to submit a nomination in this category to celebrate the very best of the Civil Service, enabling the sharing of best practice right across government departments."
        },
        {
            "heading": 3,
            "text": "Submit your nominations"
        },
        {
            "text": "Nominations close on Friday 21 July at 5pm. For more information on how to nominate for this award and the Civil Service Awards in general, please visit the website. For all categories you will be asked to submit an overview of the nomination (100 words) and an outline of the measurable benefits achieved by the team or individual, and the impact this had. The shortlist will be announced in October 2023. Good luck to all who nominate!"
        }
    ]
}