{
    "url": "https://buyingforschools.blog.gov.uk/2023/07/18/one-year-on-from-the-refreshed-school-resource-management-srm-strategy/",
    "title": "One year on from the refreshed School Resource Management (SRM) strategy",
    "authors": [
        "Cherise Heavey, Communications and User-Engagement Lead from the Schools Resource Management Team"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2023-07-18T14:13:18+01:00",
    "content": [
        {
            "text": "Cherise Heavey, Communications and User-Engagement Lead from the School Resource Management (SRM) team, explains what the SRM offer is and what's coming up in 2023."
        },
        {
            "heading": 2,
            "text": "What is the School Resource Management (SRM) offer?"
        },
        {
            "text": "The SRM offer is a collection of free tools, guidance and support, available to all schools and academy trusts in England, to help build their resource management capability to achieve best value from all of their resources, and therefore maximise the impact on pupil outcomes."
        },
        {
            "text": "You can access the full collection of free tools, guidance and support on the SRM collection page."
        },
        {
            "text": "If you would like to hear some first-hand experiences of using the tools and services you can watch this video - and many more - on the SRM YouTube playlist."
        },
        {
            "heading": 2,
            "text": "What's new in the SRM offer?"
        },
        {
            "text": "In June 2022 we published the new School Resource Management: building a stronger system strategy which was developed in partnership with the sector and informed by sector needs. The SRM offer is not static, it is continuously evolving based on sector insights to address new challenges."
        },
        {
            "text": "As part of this strategy, we have 3 key aims:"
        },
        {
            "text": "The new strategy puts the professional at the heart of it. We are committed to ensuring that we are equipping you with the tools and support which you have identified that you need, to help you maximise your resources, ensuring they can then be reinvested back into front line activity and maximise the impact on pupil outcomes."
        },
        {
            "text": "To support you in building that resource management capability and expertise we have some new announcements, including:"
        },
        {
            "heading": 2,
            "text": "School Resource Management Summit 2023"
        },
        {
            "text": "In June we held the School Resource Management Summit 2023, a full day event covering all aspects of SRM. Over 300 school business professionals attended and provided great feedback, with over 97% advising they would attend a similar event in future."
        },
        {
            "text": "You can watch recordings from the event, including a keynote speech from Baroness Barran (Minister for the School System), David Withey (CEO of the ESFA) as well as sessions delivered by many other senior officials and sector representatives on:"
        },
        {
            "text": "To access the full suite of SRM Summit recordings email your full name, job title and the name of school or organisation to: school.resourcemanagement@education.gov.uk."
        }
    ]
}