{
    "url": "https://socialcare.blog.gov.uk/2023/07/18/supporting-adult-carers-our-role-as-care-professionals/",
    "title": "Supporting adult carers: our role as care professionals",
    "authors": [
        "Deborah Sturdy"
    ],
    "categories": [
        "Care and support",
        "Carers",
        "Guidance",
        "Information sharing",
        "Workforce"
    ],
    "pub_date": "2023-07-18T09:50:54+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Shared endeavour"
        },
        {
            "text": "Care and support in this country is undoubtedly a team effort (as anyone who has lived and worked through the last three years in particular will testify). As care and NHS professionals, we recognise the value of person-centred wrap around services for individuals, families and communities in need."
        },
        {
            "text": "These services extend, not just to individuals with physical and psychological conditions, but to the people around them. I’m talking about the vast ranks of unpaid carers (mothers, fathers, sons, daughters, brothers, and sisters) who strive to care for their loved ones, whilst juggling school, work and other family or life commitments."
        },
        {
            "text": "Caring responsibilities can happen overnight or be a gradual process, but either way, many people in this situation don’t recognise themselves as carers. They just feel they’re doing the right thing, unconsciously absorbing the support they provide into their daily lives. As caring professionals, they deserve our support too."
        },
        {
            "text": "That’s why NICE (the National Institute for Health and Care Excellence) published their guidance on supporting adult carers in 2020. It aims to improve carers' lives by helping health and care practitioners identify them and provide the information and resources they need to live and care well."
        },
        {
            "heading": 2,
            "text": "Comprehensive signposting"
        },
        {
            "text": "The guidance covers carers’ assessments, practical, emotional and social support and training, including support for carers providing end of life care. It also provides advice on identifying carers, assessing their needs and helping them stay in, enter or return to work, education or training. As one in seven carers in the UK are juggling work and care, and an average of 600 people a day leave work to care, this last point is crucial."
        },
        {
            "text": "NICE has also created a ‘Quick Guide’ on supporting people who provide unpaid care, based on the guidance. This guide was developed with the Social Care Institute for Excellence (SCIE). It can be used for staff training, supporting people who use care services, and facilitating conversations."
        },
        {
            "text": "As care professionals, it’s part of our role to be alert to the needs of those supporting their loved ones. With the right care plans in place, coupled with our skills, experience and intuition, we can help share the burden, provide respite services and prevent carers needing significant care or treatment."
        },
        {
            "text": "When you consider 60% of carers report having a long-term physical or mental health condition, compared to 50% of those who aren’t carers, you can see why we have a collective duty to support these amazing people."
        },
        {
            "text": "Caring for those in need also means caring for the carers – it’s a partnership of mutual support which, when it works well, keeps people safe, well and happy for as long as possible. These NICE guidelines embody this ethos and I urge all care colleagues to read and absorb. Caring is sharing!"
        }
    ]
}