{
    "url": "https://gds.blog.gov.uk/2023/07/18/what-do-first-time-users-think-of-the-gov-uk-prototype-kit/",
    "title": "What do first-time users think of the GOV.UK Prototype Kit?",
    "authors": [
        "Alina Graham - User researcher, GDS"
    ],
    "categories": [
        "User research"
    ],
    "pub_date": "2023-07-18T11:22:27+01:00",
    "content": [
        {
            "text": "When we launched Version 13 of the Prototype Kit we said that the updates made creating and updating prototypes easier for all users, particularly those getting started with the Kit. "
        },
        {
            "text": "Now that Version 13 is live we wanted to understand more about the people who are not currently using the Kit or are very new to the Kit and what impact the changes in Version 13 have had on new and existing users. "
        },
        {
            "text": "As a team we are focusing on improving the Kit in line with user needs. In this blog, we will explain how user research has helped us understand what impact the changes in Version 13 had on both new and existing users.   "
        },
        {
            "text": "User research is an essential part of creating and improving digital services. It helps our teams in government to understand the needs, behaviours and preferences of our users, so that we can inform design decisions and effectively improve our services.  "
        },
        {
            "heading": 2,
            "text": "First-time user experience"
        },
        {
            "text": "Our first step was to map out the user journey, looking at what we knew already and where we needed more information."
        },
        {
            "text": "To expand our knowledge of the ‘first-time user’ user group we set up research to capture their first interactions with the GOV.UK Prototype Kit, with no preconceived ideas. "
        },
        {
            "text": "This round of research focused on people who had never used the Prototype Kit before and had very limited coding experience or knowledge. This also included users who were self-declared novices, and had not used Version 13 before but may have used previous versions of the Prototype Kit.  "
        },
        {
            "text": "In the research session, we asked the users to install the Kit and follow the tutorials on their own and to create a prototype.  "
        },
        {
            "text": "Our aims were to:"
        },
        {
            "heading": 2,
            "text": "Version 13 is much more accessible "
        },
        {
            "text": "Our user research participants  really liked Version 13 of the Kit because: "
        },
        {
            "text": "This positive feedback came from the ability for the users to quickly learn how to use the Kit, and to get to the point of a working prototype. The users felt like they had accomplished something and demonstrated high feelings of satisfaction. "
        },
        {
            "text": "The results also showed that Version 13 of the Prototype Kit increased engagement with the product through gamification, with one user stating that Version 13 “feels more like a game, whereas before it felt like a school lesson.” "
        },
        {
            "text": "Users also noted that Version 13 was more visual which makes it easier to understand cause and effect, as when you make changes on the new user interface, you can see the changes happen live on your prototype. "
        },
        {
            "heading": 2,
            "text": "You don’t need to know how to code"
        },
        {
            "text": "Our research demonstrated that users do not need to know how to code to use the Kit. Once the users had moved past the installation phase, the research showed that users could competently create a simple prototype, and have it up and running fairly quickly. New users built up confidence quickly during the creation stage of the prototype, due to the step by step instructions they received in the tutorials.   "
        },
        {
            "text": "Although users initially found the installation process “confusing”, “overwhelming” and “difficult”, once using the Kit the positivity increased dramatically. The users soon followed by saying they were “making some progress” and that their “feelings of engagement and comfortableness are improving”.  One user talked about enjoying using the Kit in the browser and that it was “doing the whole magical thing in the background.” Later in the journey, users highlighted pain points when identifying and fixing errors, mainly due to not being as comfortable with the coding language used."
        },
        {
            "text": "Having some coding experience is still an aid, particularly when working on more complex prototypes, but this should not be a barrier to use. Actually, users felt that the Kit could be used to help designers to learn more about coding. "
        },
        {
            "heading": 2,
            "text": "Changing the Kit to meet the user needs"
        },
        {
            "text": "Our research has informed several recommendations for the continuous improvements to the Prototype Kit. Our list of improvements so far include:"
        },
        {
            "heading": 2,
            "text": "What’s next "
        },
        {
            "text": "This research showed us that the improvements we have made so far with Version 13 have been beneficial, and have produced a much better user experience. By implementing our recommendations we believe that the GOV.UK Prototype Kit will continue to improve, particularly for new users and for those with no or little coding experience.  "
        }
    ]
}