{
    "url": "https://prisonjobs.blog.gov.uk/2023/03/17/as-a-mother-im-really-proud-to-work-in-the-prison-service/",
    "title": "“As a mother, I’m really proud to work in the Prison Service”",
    "authors": [
        "Ministry of Justice"
    ],
    "categories": [
        "Career progression",
        "Personal stories",
        "Prison officer"
    ],
    "pub_date": "2023-03-17T07:21:05+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Officer Phillips has enjoyed a rewarding career in the Prison Service over the past 25 years. She shares her story with us and tells us why she loves her job."
        },
        {
            "text": "Early in my career, I worked in a nursery. And when my own children started school, I was ready to get back to work and looking for a new challenge. Despite having no experience, and not knowing what to expect, I applied for a job accompanying prisoners to and from courts or police stations."
        },
        {
            "text": "On my first day working in a men’s prison, I remember feeling nervous and overwhelmed by the noise of prisoners shouting and doors locking and unlocking. It was a big adjustment, but with the support of my new colleagues I soon found my feet and got more and more enjoyment from my work every day. And it turned out to be the beginning of a whole new adventure."
        },
        {
            "text": "“I’ve never looked back”"
        },
        {
            "text": "From there, I went on to work in an operational support grade role which involved a wide range of tasks such as carrying out security checks and being the first point of contact for visitors to the prison. Two years later, I started training to be a prison officer. And I’ve never looked back."
        },
        {
            "text": "I really took to the role of prison officer and realised early on it’s about so much more than just unlocking and locking doors. Prisons are full of people who have made bad life choices and need support to break the cycle of reoffending. As a prison officer, you’re a key worker and problem solver who plays a vital role in supporting people in prison and protecting the public."
        },
        {
            "text": "Like any other job, you experience good days and tough days. And I had to develop resilience to deal with sometimes challenging situations and prisoners. But I was able to draw on the skills of managing difficult behaviours and conflict that I’d learnt years ago when working in the nursery."
        },
        {
            "text": "Not just a job, but a whole new career"
        },
        {
            "text": "When you become a prison officer, you don’t just start a job, you start a whole new career. And you can go on to do what you want with it. For me, I quickly found my area of expertise, working with prisoners who were at risk of self-harm or suicide. It’s really rewarding work and I’ve had many notes of thanks from prisoners over the years. Several promotions later, I’m now Head of Performance Assurance and Care Team Lead at HMP Isle of Wight."
        },
        {
            "text": "I’m really proud to work in the Prison Service. As a mother, my work has provided me with career progression and financial stability to support my family throughout my life. My son has even followed in my footsteps and now works as a prison officer at a different prison, having seen the career opportunities the Prison Service has given me."
        },
        {
            "text": "You don’t need to have certain experience or specific qualifications to be a prison officer. If you are empathetic, reliable and can connect with a wide range of people, it could be the right role for you. And as a female member of staff, I would encourage more women to consider applying to be prison officers."
        }
    ]
}