{
    "url": "https://educationhub.blog.gov.uk/2023/03/17/budget-2023-what-are-returnerships-and-who-are-they-for/",
    "title": "Budget 2023: What are ‘returnerships’ and who are they for?",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Adult learning",
        "Apprenticeships",
        "Skills"
    ],
    "pub_date": "2023-03-17T15:21:11+00:00",
    "content": [
        {
            "text": "We believe learning should be a lifelong process and that age should not be a barrier to upskilling, or retraining and getting the job you want."
        },
        {
            "text": "That's why we we’ve launched our ‘returnerships’ initiative to encourage adults over the age of 50 to get back into work and embark on exciting new career ventures."
        },
        {
            "text": "Here's what you need to know about 'returnerships'."
        },
        {
            "heading": 3,
            "text": "What are ‘returnerships’?"
        },
        {
            "text": "A ‘returnership’ is a new offer which brings together three programmes to help get older workers back to work. These include Apprenticeships, Skills Bootcamps and Sector-Based Work Academy Programmes (SWAPs). ‘Returnerships’ will raise awareness of these pathways, providing a clear route back into work and encouraging employers to hire older workers."
        },
        {
            "text": "Skills Bootcamps are free and designed in partnership with local employers to help fill job vacancies in your area. These flexible courses last up to 16 weeks and allow you to gain the in-demand skills employers are looking for, with the offer of a job interview on completion. From courses in digital and green industries, to those in technical sectors such as construction or engineering, there are hundreds of bootcamps on offer."
        },
        {
            "text": "An apprenticeship is a job with training that can be used by learners of all ages and all career stages to gain valuable skills, retrain or reskill."
        },
        {
            "text": "Sector-based work academy programmes (SWAPs) are an opportunity to learn new skills and get experience of working in a particular industry, for example care, construction or warehouse work. The programme is designed to help jobseekers, who are claiming either Universal Credit, Jobseeker’s Allowance (JSA) or Employment and Support Allowance (ESA), to build confidence, improve job prospects and enhance CVs."
        },
        {
            "heading": 3,
            "text": "Who are ‘returnerships’ for?"
        },
        {
            "text": "‘Returnerships’ are targeted at adults over the age of 50 who are returning to work or seeking a career change. Apprenticeships and most Skills Bootcamps are open to everyone, but SWAPs are specifically for jobseekers who are claiming either Universal Credit, Jobseeker’s Allowance (JSA) or Employment and Support Allowance (ESA)."
        },
        {
            "heading": 3,
            "text": "What have you announced about ‘returnerships’?"
        },
        {
            "text": "We’ve announced additional funding of £63.2 million to increase the availability of Skills Bootcamps and SWAPs."
        },
        {
            "text": "This includes £34 million of additional funding for Skills Bootcamps, helping up to 8,000 more people to benefit from this transformational scheme, with an aim of delivering 64,000 training places from next year."
        },
        {
            "text": "We’re also expanding the Sector-Based Work Academy Programme (SWAPs) scheme to increase the number of places available and make the programme more accessible. This will create around 40,000 new SWAPs starts."
        },
        {
            "text": "To further build on our adult learning offer, we also recently announced the Lifelong Learning Entitlement. From 2025, people will be able to access loans worth up to £37,000 to upskill or retrain no matter where they are in life."
        },
        {
            "heading": 3,
            "text": "How can I get started?"
        },
        {
            "text": "Visit this page to find out if a Skills Bootcamp could fast-track you to a better job."
        },
        {
            "text": "Visit this page to find out more about SWAPs."
        },
        {
            "text": "Visit this page to find out about apprenticeships."
        },
        {
            "text": "If you would like personalised help choosing a course or advice on your job options, get in touch via webchat at or by phone on 0800 100 900."
        }
    ]
}