{
    "url": "https://nationalscreening.blog.gov.uk/2023/03/17/exciting-opportunities-to-join-one-of-the-uk-nscs-expert-groups/",
    "title": "Exciting opportunities to join one of the UK NSC’s expert groups",
    "authors": [
        "Mike Harris"
    ],
    "categories": [
        "General"
    ],
    "pub_date": "2023-03-17T08:24:46+00:00",
    "content": [
        {
            "text": "The UK National Screening Committee (UK NSC) advises ministers and the NHS in the 4 UK countries about all aspects of screening and supports implementation of screening programmes."
        },
        {
            "text": "The independent scientific committee weighs up evidence about the potential benefits and harms of screening before making its formal recommendations."
        },
        {
            "text": "We currently have a total of 12 exciting vacancies to fill in 2 of the committee’s expert groups: the fetal, maternal and child health (FMCH) group and the adult reference group (ARG)."
        },
        {
            "text": "These expert groups have a crucial role in scrutinising evidence and providing input from their relevant areas of expertise. They help ensure the UK NSC makes high quality recommendations that are based on the best evidence and thinking. The FMCH and ARG are also increasingly involved in advising on innovation, research proposals, horizon scanning and stakeholder engagement."
        },
        {
            "text": "Members of the UK NSC and its expert groups are all appointed as independent members to behave with impartiality, integrity and objectivity."
        },
        {
            "text": "The current vacancies in the ARG are for a:"
        },
        {
            "text": "The current vacancies in the FMCH are for a:"
        },
        {
            "text": "Anyone interested in any of these roles should have relevant knowledge, skills and experience that would contribute to the provision of high quality and well considered advice to the UK NSC."
        },
        {
            "text": "Appointed individuals will be responsible for providing, from their specific perspective, advice, insight and constructive challenge."
        },
        {
            "text": "The expert groups meet 3 times per year. There is no remuneration for the posts but expenses are paid at a centrally set rate."
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK National Screening Committee. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, email screeninginformation@dhsc.gov.uk."
        }
    ]
}