{
    "url": "https://educationhub.blog.gov.uk/2023/03/17/how-we-are-growing-our-30-hours-free-childcare-offer/",
    "title": "How we are growing our 30 hours free childcare offer",
    "authors": [
        "media officer"
    ],
    "categories": [
        "Childcare",
        "childminders",
        "early years",
        "Funding"
    ],
    "pub_date": "2023-03-17T14:28:34+00:00",
    "content": [
        {
            "text": "England has some of the highest quality childcare provision in the world, with 96% of early years settings rated by Ofsted as good or outstanding. But we recognise that childcare is also one of the biggest costs facing working families today."
        },
        {
            "text": "That’s why, as part of our package in the Spring Budget, we have announced new 30 free hours entitlement for eligible working parents of children aged between nine and 36 months."
        },
        {
            "text": "Here’s what you need to know."
        },
        {
            "heading": 3,
            "text": "What has been announced? "
        },
        {
            "text": "We are expanding our offer of 30 hours of free childcare per week for eligible working parents with children aged nine months to three years."
        },
        {
            "text": "This means working parents will be able to claim free childcare all the way through, from nine months up to their child starting school."
        },
        {
            "text": "The offer will apply to 38 weeks per year. Some providers may ask for charges in addition to the free childcare."
        },
        {
            "text": "Visit childcarechoices.gov.uk for further information."
        },
        {
            "heading": 3,
            "text": " When does the 30 hours free childcare start? "
        },
        {
            "text": "The offer will be rolled out in stages, with eligible working parents of two-year-olds able to access 15 hours from April 2024, all eligible working parents of nine months to three-year-olds able to access 15 hours by September 2024, and the offer increased to the full 30 hours for these parents by September 2025."
        },
        {
            "heading": 3,
            "text": "Why won’t this be available until 2025? "
        },
        {
            "text": "This is a massive expansion in the offer and will take some time to implement and rollout."
        },
        {
            "text": "The staggered approach will give childminders and nurseries time to prepare for the changes, ensuring there are enough places ready to meet demand."
        },
        {
            "text": "We want to make sure that taxpayers’ money is used efficiently, and the new offer is delivered in the best way."
        },
        {
            "heading": 3,
            "text": "What is the existing offer for free childcare? "
        },
        {
            "text": "Currently, we offer 15 hours per week of free childcare or early education for all three and four-year-olds, rising to 30 hours for working families, and 15 hours for disadvantaged two-year-olds."
        },
        {
            "text": "We have already spent more than £20 billion over the past five years to support families with the cost of childcare."
        },
        {
            "heading": 3,
            "text": "Am I eligible for free childcare? "
        },
        {
            "text": "Working parents who individually earn more than £8,670 (from April) but less than £100,000 adjusted net income per year are eligible."
        },
        {
            "text": "You can find out more info on support available on the Childcare Choices website."
        },
        {
            "text": "You can read more about childcare from the Spring budget here."
        }
    ]
}