{
    "url": "https://educationhub.blog.gov.uk/2023/03/17/norovirus-information-for-parents-schools-and-early-years-providers-if-a-child-is-sick/",
    "title": "Norovirus: Information for parents, schools, and early years providers if a child is sick",
    "authors": [
        "media officer"
    ],
    "categories": [
        "childminders",
        "nurseries"
    ],
    "pub_date": "2023-03-17T14:42:38+00:00",
    "content": [
        {
            "text": "Cases of norovirus are on the rise, with outbreaks in nurseries and other early year settings returning to near pre-pandemic levels in February."
        },
        {
            "text": "For most people, it’s an unpleasant and short-lived illness, but if your child is showing symptoms of the vomiting bug then it’s important to keep them at home to curb the spread of the virus. Here’s everything you need to know."
        },
        {
            "heading": 3,
            "text": "What is norovirus? "
        },
        {
            "text": "Norovirus, commonly known as the winter vomiting bug, is a stomach bug that causes sickness and diarrhoea."
        },
        {
            "text": "Norovirus can spread easily through communities and so outbreaks are common in settings where people have close contact, such as schools and nurseries."
        },
        {
            "text": "For most, this is an unpleasant, short-lived illness with a full recovery within two to three days without needing any medicine. However, children should not attend school or nursery until 48 hours after the symptoms have stopped."
        },
        {
            "text": "It’s worth noting that some groups, including young children and babies, are at risk of suffering more serious and prolonged symptoms, which may require medical treatment."
        },
        {
            "heading": 3,
            "text": "How can we help stop norovirus spreading? "
        },
        {
            "text": "Good hand hygiene is important to stop norovirus spreading."
        },
        {
            "text": "To avoid catching norovirus or passing it on to others, children should wash their hands frequently and thoroughly with soap and warm water."
        },
        {
            "text": "Norovirus is easily transmitted through contact with people with the infection and any surfaces or objects which have been contaminated with the virus."
        },
        {
            "heading": 3,
            "text": "How long is norovirus contagious?"
        },
        {
            "text": "The incubation period of norovirus is 12 to 48 hours, which is the time between catching the virus and developing symptoms."
        },
        {
            "text": "Children are most infectious when symptomatic, but it is possible to pass on norovirus both before developing symptoms and after symptoms have stopped. This is why children should not attend school or nursery until 48 hours after the symptoms have stopped."
        },
        {
            "text": "Alcohol-based hand sanitisers are not effective against norovirus."
        },
        {
            "heading": 3,
            "text": "My child has sickness and/or diarrhoea and may have norovirus – what should I do?"
        },
        {
            "text": "Do not send child to school or nursery until 48 hours after the symptoms have stopped and avoid visiting your GP or hospital while symptomatic unless advised otherwise."
        },
        {
            "text": "Those with symptoms should avoid cooking and helping prepare meals for others until 48 hours after symptoms have stopped, as norovirus can be spread through contaminated food when it is handled by people with the illness."
        },
        {
            "text": "Vomiting and diarrhoea causes your child’s body to lose water and salts, which can lead to dehydration, so it is important that they drink plenty of fluids to prevent this."
        },
        {
            "text": "If you are concerned about your child, talk to your GP by phone, contact NHS 111 or visit the NHS UK norovirus webpage."
        },
        {
            "text": "You can get more information on norovirus here."
        }
    ]
}