{
    "url": "https://space.blog.gov.uk/2023/03/17/uk-space-agencys-first-space-investment-forum/",
    "title": "UK Space Agency’s first Space Investment Forum",
    "authors": [
        "Daniel Jones"
    ],
    "categories": [
        "Events"
    ],
    "pub_date": "2023-03-17T11:11:49+00:00",
    "content": [
        {
            "text": "The UK Space Agency’s principal metric for success is the level of total investment and contract revenue we can bring to the UK space economy. "
        },
        {
            "text": "To that end I’m delighted to announce I’ll be chairing the Agency’s first Space Investment Forum on Tuesday 16th May at the Institute of Directors in London, run by Timo Karakashev and his excellent Cosmonauts team. "
        },
        {
            "text": "Last month I attended TechUK’s space investment panel and pitch event, at which Minister of State at the Department of Science, Innovation and Technology, George Freeman, once again outlined the excellence of the UK space sector, and the need to effectively attract, direct, and catalyse investment into our country’s space ecosystem. "
        },
        {
            "text": "We are now seeing a performance from the UK’s portfolio of space tech startups and SMEs that can rival the broader deep tech sector, and investors should consider the two side by side. "
        },
        {
            "text": "We in the UK have a huge potential advantage in the form of the City of London. To be serious about growing the UK as an economy and a science superpower, we should leverage the heft and expertise of the City as much as possible. Seraphim stated last month that serious investments have been made into UK companies, only for the unicorn success story businesses to float on the United States stock exchange. "
        },
        {
            "text": "The Space Investment Forum will bring together a diverse range of SMEs and startups from the UK’s burgeoning space economy, and an equally diverse range of investors. Venture capital firms, business angels, national and international space agencies, and investment banks should all be tuned in to the potential of the space economy and its increasing market size in the air and on ground. "
        },
        {
            "text": "Space represents both the manufacturing and service economies, and when all is working well, one complements the other."
        },
        {
            "text": "This event will bring together UK companies who are building satellites and payloads, developing new materials and systems technologies, and other companies who are exploiting the data that these physical systems can glean from the skies above us. "
        },
        {
            "text": "By helping these two aspects we can create a robust, growing, and sustainable space economy and stimulate some serious growth. "
        },
        {
            "text": "If you’re an investor looking for the best the UK space scene has to offer, come to the Space Investment Forum on 16th May. "
        },
        {
            "text": "And if you’re one of our fantastic UK space SMEs looking for some face time with investors, we’ll see you there. "
        },
        {
            "text": "Learn more about the event and how you can get involved here."
        }
    ]
}