{
    "url": "https://movingon.blog.gov.uk/2023/03/17/why-you-should-never-get-tired-of-hearing-about-good-tyre-management/",
    "title": "Why you should never get tired of hearing about good tyre management",
    "authors": [
        "Steve Cope"
    ],
    "categories": [
        "Features",
        "Guides and reports",
        "Maintenance workshop",
        "Vehicle testing"
    ],
    "pub_date": "2023-03-17T15:25:44+00:00",
    "content": [
        {
            "text": "In the last few years, there’s been a lot of focus on tyres fitted to heavy vehicles."
        },
        {
            "text": "The biggest story was the ban on 10 year old tyres, which the government introduced in 2021."
        },
        {
            "text": "But more recently, we’ve shared advice on buying part worn tyres and told you about the upcoming changes for free rolling tyres at annual test."
        },
        {
            "text": "From 1 April 2023, free rolling tyres fitted to front steering axles will be treated as a major failure at annual test."
        },
        {
            "text": "So with just a few weeks to go before this happens, it’s a good time to revisit our tyre management guidance – and share with you some of the worst examples we’ve seen during the annual test."
        },
        {
            "heading": 2,
            "text": "Getting it right"
        },
        {
            "text": "Making sure your tyres are properly fitted and legal is essential to ensuring both that your vehicles are safe, and you don’t fall foul of the rules."
        },
        {
            "text": "Our guide to maintaining roadworthiness offers more detail on what a good tyre management system looks like. It’s a vital read for every operator, transport manager, maintenance provider and driver."
        },
        {
            "text": "Some of the key checks that form part of the system are tyre:"
        },
        {
            "text": "It’s important to ensure staff dealing with tyre management are properly trained and have the authority to make decisions."
        },
        {
            "text": "Technicians should also be properly trained and qualified and drivers should be properly trained and equipped to recognise and report tyre issues."
        },
        {
            "heading": 2,
            "text": "Where it goes wrong"
        },
        {
            "text": "Tyre issues remain way too high on the list of most common vehicle defects picked up at the annual test. Poor tyre management can also lead to prohibitions at the roadside. You can read our guidance on tyre defects and tyre damage."
        },
        {
            "text": "During the MOT, our testers check the tread and the condition of a vehicle’s tyres."
        },
        {
            "text": "But they also make sure that in-service tyres are appropriate for the vehicle and positions which they are fitted to."
        },
        {
            "text": "We wanted to share a few examples of what happens when the tyre management system fails – or in some cases, clearly doesn’t exist at all!"
        },
        {
            "text": "The picture above shows a tyre on a vehicle which was brought in for its annual test earlier this year. A central tread block has come off, exposing the cords which are now broken."
        },
        {
            "text": "Shockingly, this is another tyre we found at annual test. It’s clear evidence of the vehicle not being prepared for its MOT and a maintenance regime which has failed to keep the vehicle roadworthy. You could almost fit your lunchbox in that sidewall hole!"
        },
        {
            "text": "For our last example, we’ve got a tyre which was recut to extend its use. However, the vehicle standards assessor noticed they had gone too far and exposed the cords. By doing this, the tyre was rendered completely useless."
        },
        {
            "text": "A good tyre management system would have prevented all of these from being out on the road with tyre defects. Tyre inspections and defect recording would have identified that the tyres were wholly unsuitable and needed to be replaced before any further use."
        },
        {
            "heading": 2,
            "text": "Free-rolling tyres at annual test"
        },
        {
            "text": "A tyre marked with ‘FRT’ on the side wall is a Free Rolling Tyre."
        },
        {
            "text": "This means the tyre is designed for use on axles of a motor vehicle and trailer axles. They are not designed for use on front steering and drive axles."
        },
        {
            "text": "From 1 April 2023, FRTs fitted to front steering axles will be categorised as a major defect at annual test, which means a failure."
        },
        {
            "text": "We will publish updated HGV and PSV inspection manuals to reflect this change."
        },
        {
            "text": "If you have any questions, please let us know using the comments box below."
        }
    ]
}