{
    "url": "https://phescreening.blog.gov.uk/2021/06/29/annb-research-advisory-committee/",
    "title": "Lay members wanted for antenatal and newborn screening programmes research advisory committee",
    "authors": [
        "Jess Tarrant"
    ],
    "categories": [
        "NHS Fetal Anomaly Screening Programme",
        "NHS Infectious Diseases in Pregnancy Screening Programme",
        "NHS Newborn and Infant Physical Examination",
        "NHS Newborn Blood Spot Screening Programme",
        "NHS Newborn Hearing Screening Programme",
        "NHS Sickle Cell and Thalassaemia Screening Programme"
    ],
    "pub_date": "2021-06-29T10:00:59+01:00",
    "content": [
        {
            "text": "We are looking for people to represent the public and patient voice on the NHS antenatal and newborn (ANNB) screening programmes research advisory committee (RAC)."
        },
        {
            "text": "The committee reviews applications to carry out research involving NHS screening programme participants, or requiring access to screening data or samples. It considers the risks and benefits of each research proposal for the screening programme and participants, as well as the public interest in carrying out the study. Based on this assessment, the RAC decides whether to support the research."
        },
        {
            "text": "To make sure any research in the NHS screening programmes benefits patients and the public, it is important for them to be involved and represented in these decisions. Lay committee members give their opinion on whether the research would be acceptable to screening programme participants, and if the information provided to them is easy to understand."
        },
        {
            "text": "Lay member applicants must live in England. The ideal person would have:"
        },
        {
            "text": "An understanding of health research and ethics, and experience of reading scientific papers, would also be useful. Do not worry if you do not have experience of all these things, though, as we’ll provide support to help new lay members undertake their role."
        },
        {
            "text": "Meetings take place 4 times per year and are currently held using Microsoft Teams."
        },
        {
            "text": "In the future, there may be face-to-face meetings and any travel costs and expenses would be reimbursed."
        },
        {
            "text": "Please contact screening.research@phe.gov.uk if you have any questions."
        },
        {
            "heading": 2,
            "text": "PHE Screening blog"
        },
        {
            "text": "The PHE Screening blog provides up to date news from all NHS screening programmes. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new blogs. If you have any questions about this blog article, or about population screening in England, please contact the PHE screening helpdesk."
        }
    ]
}