{
    "url": "https://ipo.blog.gov.uk/2021/06/29/british-ip-day-spotlight-on-innovation-and-ip/",
    "title": "British IP Day: spotlight on innovation and IP",
    "authors": [
        "Daniel Guthrie"
    ],
    "categories": [
        "Copyright",
        "Design",
        "Innovation",
        "Patents",
        "Trade marks"
    ],
    "pub_date": "2021-06-29T12:44:23+01:00",
    "content": [
        {
            "text": "The Alliance for Intellectual Property (AIP) is a coalition of organisations representing creators and intellectual property (IP) rich businesses. AIP organises an annual British IP Day. Dan Guthrie, Director General of the AIP, tells us more about how the organisation plans to mark its special day."
        },
        {
            "text": "Each year, we at the Alliance for IP, organise British IP Day. Our aim is to demystify what can often be seen as a complex area of law and help policymakers, MPs, and others across the political community understand the positive impact that intellectual property has on our social, cultural and economic lives."
        },
        {
            "heading": 3,
            "text": "This years' contributors"
        },
        {
            "text": "This year, we are going to hear from a diverse range of creators and businesses, including Anthony Horowitz, screenwriter for Foyles War and Midsummer murders.  He is perhaps best known, however, for the Alex Rider series of books. They have sold over 22 million copies in 33 different countries and helped bring books to a whole new generation of young people. The books have generated their own series on Amazon Prime, supporting jobs across the TV and Film sectors, from script writers to carpenters."
        },
        {
            "text": "We will also hear from Jagex, the Cambridge based company behind RuneScape which, celebrating its 20th birthday this year, has become of the world’s longest-running online games. Played all over the world, RuneScape has been played non-stop for 7,306 consecutive days, welcoming almost 300 million player accounts. It is now still as popular as ever due to its continuing innovation."
        },
        {
            "text": "move.ai, a UK based technology company will explain how it is seeking to democratise content creation by enabling lower cost filming of virtual reality scenes using artificial intelligence. It lowers the cost of this type of filming for existing major film and TV production companies whilst also making it accessible for smaller film companies and even student film makers."
        },
        {
            "heading": 3,
            "text": "IP: the running thread in creativity"
        },
        {
            "text": "All of these businesses and creators rely on their creativity and innovation for their success.  Of course they didn’t start on their creative journeys by waking up one day thinking about our IP laws and deciding, I’m going to write a book today, or I’m going to design a new funky lamp or create a new brand of crisps."
        },
        {
            "text": "What they did find, however, is that once they’d come up with their idea, they needed to make sure they could earn a living from that idea, protect how it is used and find investment for their ideas. To do that they needed patents, design rights, trade marks and copyright to help them."
        },
        {
            "text": "The interesting thing about the creators and businesses we will hear from is how diverse they all are.  What connects a book for young people with new virtual reality software or visual artists and painters with a computer game?  How do they all fit with new medicines and vaccines that are helping us manage and escape the pandemic?  Ultimately, they all rely on IP to protect their creativity and ideas."
        },
        {
            "heading": 3,
            "text": "IP at the centre of the UK's Innovation Strategy"
        },
        {
            "text": "The Government is currently developing a new innovation strategy which will sit at the core of its plans to grow the economy as we finally emerge from the pandemic. In past strategies, IP has often been  seen as a rarified topic that is unfathomable to the majority and not deserving of a more prominent place.  We hope this time things will be different."
        },
        {
            "text": "As we can see from the diverse range of sectors we will hear from on British IP Day, IP as a theme deserves to flow across all elements of the strategy. Its role stretches from enabling investment to providing incentives for businesses to work with universities to exploit their innovation promoting scale-up of medium-sized businesses, or finding opportunities for international co-operation."
        },
        {
            "text": "For the first time in many years, it seems the Government machine, across departments, is waking up to the importance of IP. We look forward to the publication of the Innovation Strategy and will do all we can to make sure it has the positive impact the country needs."
        }
    ]
}