{
    "url": "https://socialcare.blog.gov.uk/2021/06/29/friendships-matter/",
    "title": "Friendships matter",
    "authors": [
        "Andrew Reece"
    ],
    "categories": [
        "Care and support",
        "learning disabilities",
        "social work"
    ],
    "pub_date": "2021-06-29T15:43:18+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Re-framing how we judge success in adult social care"
        },
        {
            "text": "I’ve always struggled with how we measure ‘what good looks like’ in social care. The trend since the 1990s, driven by a school of thought often characterised as ‘new public management’, has been to require local authorities to report on simple ‘metrics’ or measures that allow easy comparison across teams, across time and across councils."
        },
        {
            "text": "Initially many of these ‘metrics’ simply counted processes (how many assessments, how many reviews). Later, attempts to measure ‘outcomes’ were added to this list, as were attempts to understand if social care was making a difference to people’s lives."
        },
        {
            "text": "It seems to me what these measures have in common is an intention to help judge a system, rather than assess if we have helped improve the lives of an individual with learning disabilities or their families."
        },
        {
            "text": "Even in a ‘well performing’ system, individuals could remain unhappy. We need person centred measures which speak to the real experiences of people with learning disabilities."
        },
        {
            "heading": 2,
            "text": "The true value of friendship"
        },
        {
            "text": "In talking to people with learning disabilities and their families during the COVID-19 pandemic, a common theme has been the value people place on friendships. When their day service had to close in March 2020, people told us that what they missed most was contact with their friends."
        },
        {
            "text": "When the Synergy group of self-advocates were asked to talk to about what was most important to them when being supported to access activities, maintaining and developing friendships was central to their ‘manifesto’."
        },
        {
            "text": "At the next Planning Together meeting, they told us how difficult they find it to meet up with friends, to maintain friendships or don’t know how to make new friends."
        },
        {
            "text": "This tells me we need to re-frame how we measure success. In particular, we need to recognise, as a health and social care system, that friendships matter to people with learning disabilities. I believe creating, sustaining and measuring friendship needs to be at the centre of our work."
        },
        {
            "text": "Research evidence about the importance of real friendships to the wellbeing of people with learning disabilities suggests to me we need to invert our thinking about the focus of social care interventions."
        },
        {
            "text": "This requires us to invert the pyramid of needs: in other words, by focusing on the higher level need of friendship, the basic level needs will look after themselves."
        },
        {
            "heading": 2,
            "text": "A shared endeavour"
        },
        {
            "text": "Creating and sustaining friendships should be at the centre of our work with people with learning disabilities. We need to think differently about the whole health and social care system and how to influence system-wide change."
        },
        {
            "text": "For most people friendships are created and sustained within their local communities and networks. Creating and sustaining friendships needs to be understood as a shared endeavour in which we will need to enlist the support of all sectors of civil society, here in Camden and beyond."
        },
        {
            "text": "We must explicitly engage with our vibrant business, education and voluntary and community sectors, to make sure people with learning disabilities can grasp all opportunities to make and sustain friendships."
        },
        {
            "text": "The existing ways of measuring performance bear little resemblance to the lived experience of people with learning disabilities. That’s why we must work closely with them, their families and our providers, to co-produce an easy to use performance system which can show us if we are doing the right things."
        }
    ]
}