{
    "url": "https://defrafarming.blog.gov.uk/2021/06/29/how-farmers-are-helping-us-to-design-the-first-of-our-environmental-land-management-schemes/",
    "title": "How farmers are helping us to design the first of our environmental land management schemes",
    "authors": [
        "Bailey Hemphill"
    ],
    "categories": [
        "environmental land management schemes",
        "Things we're doing",
        "Things we've learned",
        "Ways to get involved"
    ],
    "pub_date": "2021-06-29T12:43:29+01:00",
    "content": [
        {
            "text": "The Sustainable Farming Incentive is one of 3 new environmental land management schemes that use public money to reward farmers and land managers for delivering environmentally sustainable actions."
        },
        {
            "text": "The other 2 schemes are the Local Nature Recovery scheme and the Landscape Recovery scheme."
        },
        {
            "text": "The Local Nature Recovery scheme will pay for actions that support local nature recovery and deliver local environmental priorities whilst encouraging collaboration between farmers."
        },
        {
            "text": "The Landscape Recovery scheme will support the delivery of landscape and ecosystem recovery through long-term, land use change projects such as large-scale tree planting or peatland and salt marsh restoration projects."
        },
        {
            "text": "The 6 public goods that the new schemes will contribute to are: clean air; clean and plentiful water; thriving plants and wildlife; reduction in and protection from environmental hazards; mitigation of and adaptation to climate change; enhanced beauty, heritage and engagement with the natural environment."
        },
        {
            "text": "Public goods are things that are good for the public that aren’t accounted for in the market price of the goods."
        },
        {
            "text": "In this blog post, I’ll share how we have worked with the farming community to develop the standards for the Sustainable Farming Incentive from 2021."
        },
        {
            "heading": 3,
            "text": "Planning the transition to the new schemes"
        },
        {
            "text": "As I mentioned, piloting of the Sustainable Farming Incentive will begin this year. It will continue until 2024. We will also be introducing core elements of the scheme from 2022 and will be publishing details very soon about the standards and payment rates for that."
        },
        {
            "text": "The scheme will pay farmers for actions they take to manage their land in an environmentally sustainable way, above regulatory requirements."
        },
        {
            "text": "These actions will be grouped into simple packages called “standards”. The standards are asset-based, which means they are based on specific features a farmer may have such as grassland, soil or hedgerows."
        },
        {
            "text": "This structure is intended to make it as easy as possible for farmers to identify the actions that are best suited to them."
        },
        {
            "text": "Initially we will pilot 8 standards. They are:"
        },
        {
            "text": "The full list can be found on GOV.UK . We'll add standards as the pilot progresses."
        },
        {
            "text": "We will include a sub-set of these standards in the early rollout of the Sustainable Farming Incentive in 2022, and then gradually increase the range of standards on offer between 2022 and 2024."
        },
        {
            "text": "By 2024 we expect to have the full Sustainable Farming Incentive rolled out and available to all."
        },
        {
            "heading": 3,
            "text": "Developing the standards with farmers"
        },
        {
            "text": "Defra and colleagues from the Environment Agency, Forestry Commission and Natural England worked regularly with farmers and other experts to develop the standards."
        },
        {
            "heading": 4,
            "text": "Open consultation"
        },
        {
            "text": "We published our proposals for the design principles of the three schemes in the Policy Discussion Document of February 2020 and opened a public consultation on it."
        },
        {
            "text": "During the consultation period, we received feedback from over 1000 interest parties, including land managers, scientists, and environmental groups. This feedback was analysed and taken on board by the policy development teams."
        },
        {
            "text": "Since then, we have worked on the detail of the standards with our Environmental Land Management Engagement Group, Countryside Stewardship Facilitation Fund and Tests and Trials participants. We consulted with these stakeholders on the actions for each standard, and the levels of ambition that would be appropriate."
        },
        {
            "text": "It was very important to develop the details of the standards with a range of users from diverse backgrounds, farm types and geographies so that we could make sure the standards worked for a wide range of farmers."
        },
        {
            "heading": 4,
            "text": "Environmental Land Management Engagement Group"
        },
        {
            "text": "Every month, we met with the Environmental Land Management Engagement Group. This is a group of around 30 people from environmental and agricultural backgrounds. We presented our proposals to the group and invited comments. We'll be sharing more about this group in the coming weeks."
        },
        {
            "heading": 4,
            "text": "Co-design workshops with members of the Countryside Stewardship Facilitation Fund and Tests and Trials participants"
        },
        {
            "text": "We held workshops with:"
        },
        {
            "heading": 4,
            "text": "User Research"
        },
        {
            "text": "We’re also in the process of testing our draft standards with a range of farmers, including those without previous agri-environment experience who would be new to this kind of scheme."
        },
        {
            "text": "In the most recent phase of user testing we looked at whether standards and payments were suitable for their farms and explored options for the timing of applications and agreement lengths."
        },
        {
            "text": "We discovered that most farmers thought there was a standard suitable for their farm, but some needed more detail to know if actions were suitable and would work for their circumstances. We’re continuing our research to understand what’s needed so we get the level of detail right, in the standards, actions and guidance we provide as part of the scheme. Farmers liked the idea of opening applications to any time and the opportunity for a rolling agreement so we’ll be exploring how we can include that in the scheme."
        },
        {
            "text": "We’ll be doing more of this testing over the summer before finalising the standards in the autumn, ready for the early roll out of the scheme in the Spring of 2022. We’ll also be doing further co-design of the scheme with farmers and other stakeholders."
        },
        {
            "heading": 3,
            "text": "What we discovered from users"
        },
        {
            "text": "Working with farmers and other experts has allowed us to improve the standards to make sure they’re clear, relevant and workable. For example, the Environmental Land Management Engagement Group said they were concerned the dates we provided within the Arable and Horticultural Soils Standard for establishing green cover were too prescriptive. We amended the dates to provide more flexibility, whilst ensuring environmental benefits would be delivered."
        },
        {
            "text": "Additionally, the co-design workshops with members from the Countryside Stewardship Facilitation Fund and Tests and Trials groups indicated that a whole farm approach would be difficult to achieve due to regional and in-farm differences. As a result, initial piloting of the Sustainable Farming Incentive will use a parcel approach."
        },
        {
            "text": "Those who responded to the public consultation indicated widespread support for the design principles and highlighted which areas should be more ambitious or more flexible."
        },
        {
            "heading": 3,
            "text": "Our next steps"
        },
        {
            "text": "We opened for expressions of interest in March 2021 and will be inviting people to make applications for pilot agreements from this month, with the first agreements planned to go live from October this year. However, this is not the end of our work to develop the scheme with users."
        },
        {
            "text": "The pilot will gather feedback from pilot participants to refine the 8 standards further and a new phase of co-design is starting with external stakeholders to design additional standards for later years of the piloting period."
        },
        {
            "text": "We will be confirming the standards and payment rates shortly for early rollout of the Sustainable Farming Incentive. The early rollout of the scheme in 2022 will be a further opportunity to learn with a wider group of farmers."
        }
    ]
}