{
    "url": "https://civilservice.blog.gov.uk/2021/06/29/new-grid-data-tool-to-build-a-more-inclusive-civil-service/",
    "title": "New ‘GRID’ data tool to build a more inclusive Civil Service",
    "authors": [
        "Brian Stanislas MBE",
        "Peter Cunningham",
        "Jack Richardson"
    ],
    "categories": [
        "A great place to work",
        "A Modern Civil Service",
        "Civil Service Leaders"
    ],
    "pub_date": "2021-06-29T13:42:11+00:00",
    "content": [
        {
            "text": "This month, Cabinet Secretary, Simon Case and Chief Operating Officer, Alex Chisholm launched A Modern Civil Service. In our series to celebrate the vision, Government Business Services showcases a data analyser to improve recruitment and find the cream of candidates."
        },
        {
            "text": "The Civil Service is one of the UK’s biggest employers, and in 2020, the organisation hired 67,000 new recruits. "
        },
        {
            "text": "Now to help put digital data at the heart of decision-making, the Government Recruitment Service has unleashed its latest recruitment platform, the Government Recruitment Information Database - aka GRID. "
        },
        {
            "text": "Its purpose? GRID will capture valuable non-personalised data from the Civil Service recruitment cycle. For example, it will help track; numbers of applicants from ethnic minorities, female staff, disabled, LGBT+ people or older workers to give us better representation from all backgrounds, different voices and from regions across the UK.  "
        },
        {
            "text": "Flag up trends"
        },
        {
            "text": "In a nutshell, GRID will shape data to flag up trends, and perhaps more significantly, any gaps in recruitment. help to create a fairer recruitment process, improve social mobility and make the Government Recruitment Service become more accountable. Crucially, it has won the support of Senior Civil Servants."
        },
        {
            "text": "At Civil Service Live 2021 Matthew Rycroft (Home Office Permanent Secretary and Civil Service Race, Faith & Belief Champion) praised GRID during the Race, Representation, Recruitment and Retention’ session. "
        },
        {
            "text": "Matthew said: “GRID is such a powerful tool because we have data from Civil Service recruitment, and the power of that data then gives you the platform that you need to make the changes that the government reform proposals are crying out for.”"
        },
        {
            "text": "Ultimately GRID allows the Civil Service to deliver on its people priorities. "
        },
        {
            "text": "Jack Richardson, Deputy Director of the Government Recruitment Service (GRS)"
        },
        {
            "text": "In 2020 I co-published a blog, Presenting the 'Golden Thread'!, with Peter Cunningham and Brian Stanislas. This blog introduced our vision of the future, highlighting the ‘Golden Thread’, a new GRS initiative to develop a recruitment evaluation and analysis service.\n\nSince then we have forged strong links with Cabinet Office Diversity & Inclusion Strategy teams, completed the GRID Alpha project, and supported by wider Government Business Services (GBS), have begun to launch our GRID services to transform the Civil Service recruitment landscape.\n\nAfter three years of preparatory work, we’re proud to share the details of our new GRID platform along with our wider vision."
        },
        {
            "text": "Peter Cunningham - GRID Service Owner, Government Business Services"
        },
        {
            "text": "Since October  2020, we’ve worked hard in collaboration with both the government digital profession and analysis function, to turn our ideas into reality. They include;"
        },
        {
            "text": "The initiatives were powered by our ‘Golden Thread’ approach, and we have now completed the Alpha build of our new recruitment analysis platform, GRID."
        },
        {
            "text": "Inspired by transformation strategies such as the Civil Service Modernisation & Reform Agenda; we’re now working as part of the GBS Shared Service Strategy so that central Civil Service data can be used to proactively inform users in making better recruitment decisions. "
        },
        {
            "text": "Predicting problem areas"
        },
        {
            "text": "To achieve this, we’re working with wider Civil Service, including behavioural insight specialists, to develop self-service dashboards. Where historic dashboards would show simple reporting, our new platform will utilise analysis modelling techniques to predict problem areas and present recommendations. "
        },
        {
            "text": "For example, you might advertise a job in Glasgow for a digital professional, however, after a week, the campaign has drawn few job applicants. GRID would detect poor performance and would issue a notification to the hiring manager making them aware that action is needed. GRID would also look for comparable historic recruitment to suggest corrective actions which could be taken."
        },
        {
            "text": "As our dashboards notify users when action is required, they’re free to focus on other priority areas. This avoids information overload for colleagues and ensures that action is focused on resolving known recruitment challenges.\n"
        },
        {
            "text": "Brian Stanislas - Product Manager, Government Business Services\n\nOver the summer, the second generation GRID platform will undergo its final development and begin as a Beta service later in the year."
        },
        {
            "text": "We are collaborating with the Cabinet Office Digital colleagues to build the platform, with internal design decisions steered by the Civil Service instead of buying an off the shelf product. As a result, we have delivered our digital system at a saving to the taxpayer with no compromise to our service offer.\n\nThe new platform will introduce advanced digital data sharing. This can be used to integrate with partner suppliers to add new capability to our platform. For example, we integrate with providers of online assessments enabling access to data to better monitor their impact. "
        },
        {
            "text": "We will also share data with wider government systems. We already send job advert data to the Civil Service Careers Website Job Opportunities Location Map to provide a better service for job seekers."
        },
        {
            "text": "As part of our ongoing development strategy, we are working with wider Civil Service partners to trial different recruitment approaches. Areas of active exploration include:"
        },
        {
            "text": "A Modern Civil Service is skilled, innovative and ambitious. Working with our partners, we are proud to pioneer innovative recruitment approaches, on a par with leading private sector companies. Our mission? To seize the full potential of data and technology’ and make a truly Innovative Civil Service."
        },
        {
            "text": "You may also be interested in:"
        }
    ]
}