{
    "url": "https://giaa.blog.gov.uk/2021/06/29/proud-to-be-an-ally/",
    "title": "Proud to be an ally",
    "authors": [
        "Sandeepka Pensom - Auditor"
    ],
    "categories": [
        "People"
    ],
    "pub_date": "2021-06-29T12:11:38+01:00",
    "content": [
        {
            "text": "Hi, I’m Sandeepka and I'm committed to playing my part in creating an inclusive workplace where everyone can be themselves. This includes my colleagues from the wider lesbian, gay, bisexual transgender and queer (LGBTQ+) community. Inclusion doesn’t just happen by accident, it takes courage, resilience and action. That is why I joined the Government Internal Audit Agency (GIAA) LGBTQ+ network as an ally. Our network is called GLEAM, which stands for: GIAA LGBTQ+ Equality, Allies and Members."
        },
        {
            "text": "As a British Asian woman whose family originated in India, my passion for Equality, Diversity and Inclusion was first ignited when I attended the United Nations as part of a Non-Government Organisation (NGO) representing Indian victims of caste–based discrimination. During those visits to Geneva I was privileged to hear the stories of other people from around the globe who have suffered discrimination. It gave me an insight into the importance of representation and how becoming an ally can make a real difference."
        },
        {
            "text": "In the GIAA our People Networks empower us all to have a voice, to be represented and to belong. Each of our networks is supported by a sponsor from our senior leadership team. We also have an overall Champion and a dedicated Diversity and Inclusion (D&I) Lead who ensure that the work of our networks are integral to the success of our D&I action plan and People Strategy."
        },
        {
            "text": "Becoming a member of different networks and collaborating with others has helped me to learn about intersectionality, and how some issues can impact unequally on those identifying with multiple characteristics such as race, gender and sexual orientation. Examining barriers and experiences through multiple lenses can only be a good idea – many of us wear more than one ‘hat’ and none of us should be defined by them. As a cisgender – straight ally I don't always feel confident that I am using the right terminology in the right way. I also quite often worry that, by discussing the latest film I've seen or article I've read, I’m in danger of giving off a 'saviour' vibe. But, on balance, I won't let the fear of saying the wrong thing stop me from helping make my workplace a kind, safe and inclusive space. I’m more than happy to be educated and corrected!"
        },
        {
            "text": "I also try to educate myself about LGBTQ+ history and to understand the ongoing struggles facing the community. For example, whilst watching the European Football, I asked my husband if he knew of any openly gay footballers in the English Premier League; after some thought and a quick internet search, the answer was no. I find that statistic really upsetting. As a mother with two young children, I never want them to feel that they have to be anything other than themselves, wherever they are."
        },
        {
            "text": "I believe that an effective ally is consistent, so I try to role model and demonstrate inclusive behaviours in all my interactions. I take great pride in wearing a rainbow ribbon on my lanyard as a visible sign of my support to colleagues throughout GIAA and the wider civil service that we serve."
        },
        {
            "text": "Last summer, as protests sparked by the killing of George Floyd brought to light issues of racial injustice, I witnessed the true power of Allyship. I loved seeing my GLEAM colleagues using their platform during Pride month to show solidarity and amplify the voices of queer people of colour, especially Black people."
        },
        {
            "text": "This year, GLEAM has run a successful awareness and fundraising campaign throughout June to promote “Pride with purpose” and to collect money that will help a charity supporting young, homeless LGBTQ+ people. I am immensely proud of the work our GLEAM network does and I am very grateful for their patience and for making me feel so included."
        }
    ]
}