{
    "url": "https://rpc.blog.gov.uk/2021/06/29/the-case-for-independent-scrutiny-of-impact-assessments-earlier-in-the-decision-making-process/",
    "title": "The case for independent scrutiny of impact assessments earlier in the decision-making process",
    "authors": [
        "Stephen Gibson"
    ],
    "categories": [
        "Independent scrutiny"
    ],
    "pub_date": "2021-06-29T15:11:57+01:00",
    "content": [
        {
            "heading": 2,
            "text": "What are impact assessments?"
        },
        {
            "text": "Impact assessments (IAs) are an important part of the government decision-making process: they set out the objectives of policy proposals and the costs, benefits and risks of different ways (non-regulatory as well as regulatory) of achieving those objectives. IAs help ministers and Parliament decide on the appropriate (regulatory or non-regulatory) approach when faced with a policy question."
        },
        {
            "heading": 2,
            "text": "The role of the RPC in independent scrutiny of IAs"
        },
        {
            "text": "In order to give ministers and Parliament confidence that the evidence and analysis in IAs is fit for purpose, the Regulatory Policy Committee (RPC) independently reviews all qualifying IAs."
        },
        {
            "text": "In its review, the RPC considers whether the analysis and evidence is robust, whether all relevant factors have been considered and properly assessed (including the direct and wider impacts of the proposed measure) and whether there is a plan to monitor its effectiveness."
        },
        {
            "text": "The RPC also validates the estimate of the direct costs to business of the measure and whether the impacts on small and micro businesses have been assessed properly and, where possible, mitigated."
        },
        {
            "heading": 2,
            "text": "Earlier independent scrutiny in the policy-making process"
        },
        {
            "text": "Since 2018 it has been optional for departments to submit IAs at pre-consultation stage (while the policy is being developed). Currently, only around 40 per cent of IAs are submitted for RPC review at this point, compared to those submitted at the final stage where RPC scrutiny is mandatory."
        },
        {
            "text": "While scrutiny of final stage IAs still allows the RPC to question the estimated impact of proposed measures on businesses, it does not inform the decision-making process - since the decision has already been made. Earlier scrutiny - before consultation - also allows gaps in the evidence and analysis to be addressed as part of the consultation to better inform the final policy decision. Put simply, earlier scrutiny helps policy-makers and ministers to make better and more effective regulation."
        },
        {
            "text": "By independently challenging and correcting the impacts and their calculations, early scrutiny can also help those impacted by proposed regulations who can have greater trust in the IA and either be reassured or better informed to respond to consultation. This is the point at which the RPC can add the greatest value to IAs for ministers, departments and stakeholders alike, a point supported by business groups, think tanks, academics and other stakeholders."
        },
        {
            "heading": 2,
            "text": "Why are we raising this now?"
        },
        {
            "text": "The government are about to launch a review of the Better Regulation framework. This provides an opportunity to make changes to the way the independent scrutiny process works and to ensure that it is as effective as possible in delivering better policy-making and better policy. We therefore encourage government to mandate earlier independent scrutiny at pre-consultation stage as part of the policy-making process and we ask stakeholders to support this approach in their response to the government’s consultation."
        },
        {
            "text": "Stay up-to-date by signing up for email alerts from this blog."
        }
    ]
}