{
    "url": "https://food.blog.gov.uk/2021/06/29/weighing-the-evidence-a-new-framework-for-assessing-external-evidence/",
    "title": "Weighing the evidence – a new framework for assessing external evidence",
    "authors": [
        "Professor Peter Gregory, Science Council member"
    ],
    "categories": [
        "Science"
    ],
    "pub_date": "2021-06-29T15:36:43+01:00",
    "content": [
        {
            "text": "As a member of the Food Standards Agency’s independent Science Council, I help to provide expert strategic insight and advice to the FSA on their use of science to deliver their objectives."
        },
        {
            "text": "The FSA is an agency that bases its decisions of the best science and evidence, commissioning reports and performing risk assessments to better understand and make risk management decisions on various food and feed issues. Sometimes, independent evidence is sent to them outside of their standard research and consultation processes. This uncommissioned third-party evidence might be submitted with a range of motivations and aims, such as filling a perceived gap in knowledge or suggesting a change relevant to a policy or legislation."
        },
        {
            "text": "The Science Council was asked by the FSA Chair to look at how to consistently evaluate this type of third party evidence and make clear the standard expected to those who wanted to submit. In response, we developed and published a framework for the critical appraisal of this type of evidence."
        },
        {
            "text": "I’m pleased to say the FSA has adopted the Science Council’s guidance and will use it to help them assess evidence and in their engagement with others. In line with the FSA’s commitment to openness and transparency, it’s publicly available on the FSA’s website to those who want to submit evidence for consideration."
        },
        {
            "heading": 2,
            "text": "The purpose of the guidance"
        },
        {
            "text": "The guidelines outline the expectations concerning the standard of evidence that the FSA receives and provides guidance on how its strengths and weaknesses will be assessed according to core principles of quality, trust and robustness."
        },
        {
            "text": "Consideration of how evidence performs against these principles and guidance will help those preparing a useful contribution to the relevant body of evidence."
        },
        {
            "text": "When new advice on food safety is required, our risk analysis process will be used to assess the risk, consider the measures that could be taken, and communicate the risk and necessary actions with others."
        },
        {
            "text": "When we receive evidence, we will:"
        },
        {
            "heading": 2,
            "text": "What we mean by the principles of quality, trust and robustness"
        },
        {
            "text": "The Science Council’s guidance explains their interpretation of these principles in more detail but briefly:"
        },
        {
            "heading": 2,
            "text": "Other guidance available on submitting evidence to the FSA"
        },
        {
            "text": "The Science Council's framework is intended to help the FSA’s engagement with others who have or may submit uncommissioned evidence. The framework is intended to complement our risk analysis process. However, evidence required to place a regulated product on the market is separate, and subject to specific guidance."
        },
        {
            "heading": 1,
            "text": "Tafoli’r dystiolaeth – fframwaith newydd ar gyfer asesu tystiolaeth allanol"
        },
        {
            "text": "Fel aelod o Gyngor Gwyddoniaeth annibynnol yr ASB, rwy’n helpu i roi mewnwelediad strategol a chyngor i’r ASB ynghylch ei defnydd ar wyddoniaeth i gyflawni ei hamcanion."
        },
        {
            "text": "Mae’r ASB yn asiantaeth sy’n seilio ei phenderfyniadau ar y dystiolaeth wyddonol orau, gan gomisiynu adroddiadau a chynnal asesiadau risg i ddeall amrywiol faterion bwyd a bwyd anifeiliaid yn well a gwneud penderfyniadau rheoli risg yn eu cylch. Weithiau, anfonir tystiolaeth annibynnol atynt y tu allan i’w prosesau ymchwilio ac ymgynghori arferol. Gallai’r dystiolaeth hon gan drydydd parti sydd heb ei chomisiynu gael ei chyflwyno gydag ystod o gymhellion a bwriadau, megis llenwi bwlch ymddangosiadol mewn gwybodaeth, neu awgrymu newid sy’n berthnasol i bolisi neu ddeddfwriaeth."
        },
        {
            "text": "Gofynnodd Cadeirydd yr ASB i’r Cyngor Gwyddoniaeth edrych ar sut mae gwerthuso’r math hwn o dystiolaeth gan drydydd parti mewn modd cyson, a gwneud y safon ddisgwyledig yn glir i’r rheiny sydd am gyflwyno tystiolaeth. Mewn ymateb i hyn, fe wnaethom ddatblygu a chyhoeddi fframwaith ar gyfer tafoli’r math hwn o dystiolaeth yn feirniadol."
        },
        {
            "text": "Rwy’n falch o ddweud bod yr ASB wedi mabwysiadu canllawiau’r Cyngor Gwyddoniaeth, a byddant yn eu defnyddio i asesu tystiolaeth, ac wrth ymgysylltu ag eraill. Yn unol ag ymrwymiad yr ASB i fod yn agored ac yn dryloyw, maent ar gael yn gyhoeddus ar wefan yr ASB i'r rheiny sydd am gyflwyno tystiolaeth i'w hystyried."
        },
        {
            "heading": 2,
            "text": "Diben y canllawiau"
        },
        {
            "text": "Mae'r canllawiau'n amlinellu'r disgwyliadau o ran safon y dystiolaeth sy’n dod i law’r ASB, ac yn cynnig arweiniad o ran sut bydd ei gryfderau a’i gwendidau yn cael eu hasesu yn unol â’r egwyddorion craidd, sef ansawdd, ymddiriedaeth, a chadernid."
        },
        {
            "text": "Bydd ystyried sut mae tystiolaeth yn perfformio yn erbyn yr egwyddorion hyn yn helpu’r rheiny sy’n paratoi cyfraniad defnyddiol i’r corff tystiolaeth perthnasol."
        },
        {
            "text": "Pan fydd angen cyngor newydd ar ddiogelwch bwyd, bydd ein proses dadansoddi risg yn cael ei defnyddio i asesu'r risg, ystyried y mesurau y gellid eu cymhwyso, a chyfathrebu'r risg a'r camau angenrheidiol gydag eraill."
        },
        {
            "text": "Pan fydd tystiolaeth yn dod i law, byddwn yn:"
        },
        {
            "heading": 2,
            "text": "Yr hyn a olygwn wrth egwyddorion ansawdd, ymddiriedaeth a chadernid"
        },
        {
            "text": "Mae canllawiau'r Cyngor Gwyddoniaeth yn egluro eu dehongliad o'r egwyddorion hyn fanylach ond yn gryno:"
        },
        {
            "heading": 2,
            "text": "Canllawiau eraill ar gyflwyno tystiolaeth i’r ASB "
        },
        {
            "text": "Bwriad fframwaith y Cyngor Gwyddoniaeth yw helpu ymgysylltiad yr ASB ag eraill sydd wedi, neu a allai, gyflwyno tystiolaeth heb ei chomisiynu. Bwriad y fframwaith yw ategu ein proses dadansoddi risg. Fodd bynnag, ar wahân y mae’r dystiolaeth sydd ei hangen i roi cynnyrch a reoleiddir ar y farchnad, ac mae’n ddarostyngedig i ganllawiau penodol."
        }
    ]
}