{
    "url": "https://educationhub.blog.gov.uk/2021/06/what-you-need-to-know-about-behaviour-and-discipline-in-schools/",
    "title": "What you need to know about behaviour and discipline in schools",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Behaviour",
        "Schools"
    ],
    "pub_date": "2021-06-29T11:10:36+01:00",
    "content": [
        {
            "text": "We’re asking teachers, parents and other school staff for their views and ideas on managing good behaviour in schools and colleges."
        },
        {
            "text": "The six-week call for evidence seeks views on how schools maintain calm classrooms, the use of removal rooms and creating mobile phone-free school days, among other measures."
        },
        {
            "heading": 3,
            "text": "Why is behaviour in schools important?"
        },
        {
            "text": "We recognise the challenges schools and pupils have faced during the pandemic. But we must continue to focus on excellence in education and be able to have a thoughtful debate about the best ways to allow pupils to thrive and teachers to excel."
        },
        {
            "text": "Every classroom and playground should be a calm environment where every child can develop and learn."
        },
        {
            "text": "Good behaviour and discipline in schools is crucial if children are to learn and reach their full potential, and our best schools share a tireless focus on supporting that."
        },
        {
            "text": "Poor behaviour in a classroom can result in lost learning time for children. That’s why we think it’s so important to tackle poor behaviour; so teachers are able to provide high quality teaching to all."
        },
        {
            "heading": 3,
            "text": "Why are you doing this now?"
        },
        {
            "text": "Behaviour in schools has improved in many respects over the last decade but there are continually new challenges for teachers and school staff and it is important that we help them meet those challenges."
        },
        {
            "text": "Our very best schools all share a focus on good behaviour and we know it’s so important in creating the best possible environment for children to develop in."
        },
        {
            "text": "This is about creating guidance that allows school leaders to develop their own behaviour policies in the knowledge that they are following the best practice from schools like theirs."
        },
        {
            "heading": 3,
            "text": "What are you looking to do to improve behaviour in schools?"
        },
        {
            "text": "We are committed to improving behaviour and discipline in schools because we know the effect misbehaviour can have on lost learning time and harm the life chances of young people."
        },
        {
            "text": "The programme involves exploring ideas on how schools maintain calm classrooms for all by sharing ideas and best practice in the knowledge that there is no one-size-fits-all solution and different approaches will suit different schools."
        },
        {
            "heading": 3,
            "text": "Are children allowed mobile phones in schools?"
        },
        {
            "text": "It’s up to individual schools but we know that the vast majority of schools have some kind of limitation on pupils’ access to their mobile phones during school time."
        },
        {
            "text": "There is evidence that banning mobile phones from the school day has a positive effect on attainment. There are also clear links between screen time, social media and poor mental health."
        },
        {
            "text": "We support headteachers who already ban phones from the school day and are consulting on how to make this the norm when we revise our behaviour and discipline guidance and the suspension and permanent exclusion guidance."
        },
        {
            "heading": 3,
            "text": "So how is this call for evidence going to help?"
        },
        {
            "text": "The six-week call for evidence will inform our review, planned later this year, of guidance on behaviour, discipline, suspensions and permanent exclusions which will include a public consultation."
        },
        {
            "text": "This is the next step in our work to ensure all pupils can benefit from calm classrooms, and follows our £10 million behaviour hubs programme which partners heads and leaders from the highest performing multi-academy trusts with schools struggling with poor behaviour and discipline."
        },
        {
            "heading": 3,
            "text": "I’m a parent, can I get involved and give my views?"
        },
        {
            "text": "Yes. We encourage parents and carers to respond to the call for evidence and we will be gathering the views of children and young people as well throughout the process of revising the behaviour guidance."
        }
    ]
}