{
    "url": "https://companieshouse.blog.gov.uk/2021/06/29/working-for-companies-house-rebeccas-story/",
    "title": "Working for Companies House: Rebecca's story",
    "authors": [
        "Rebecca Strange - Senior Recruitment Manager",
        "Spencer Vignes - Campaigns Manager"
    ],
    "categories": [
        "People and culture",
        "Working at Companies House"
    ],
    "pub_date": "2021-06-29T13:15:35+01:00",
    "content": [
        {
            "text": "At Companies House, we like to think of ourselves as an inclusive, innovative and welcoming employer, one that supports people and encourages them to ‘find their passion’ by developing their skills and careers. But don’t just take our word for it. Here, our series of features in which employees reflect on what makes Companies House so special continues with Senior Recruitment Manager Rebecca Strange."
        },
        {
            "text": "Two years ago, Rebecca Strange had reached a crossroads in her life. On one hand, she had a good job working as an in-house recruiter for a high-end fashion company. On the other, she felt as if her career was stuck in a rut."
        },
        {
            "text": "Rebecca believed there had to be something else."
        },
        {
            "text": "That something else turned out to be the Civil Service or, more specifically, Companies House."
        },
        {
            "text": "“I’d been with this particular fashion company for about 9 years,” says Rebecca, an English Literature graduate from Swansea University. “I loved it when I started. I was living in London, got promoted within a year, spent time in the New York office and experienced many fantastic opportunities."
        },
        {
            "text": "“However, the company’s culture changed a lot over that time, becoming much more corporate. I’d also had 2 children but separated from my long-term partner."
        },
        {
            "text": "“I ended up moving to Cardiff, where my family are from, working remotely from home for a couple of years – before everybody else in the world started working remotely, that is! It was a bit of a miserable experience, to be honest, because I was the only person in the team working that way. The team was also changing around me with new people coming in who didn’t know me. I felt forgotten."
        },
        {
            "text": "“I remember having conversations with friends. There was one in particular that sticks in the mind which took place with a friend while our respective eldest girls were in a ballet lesson. We were sat in this park and I was saying ‘I’m stuck, this is my career, I hate it, I haven’t got a partner so I can’t retrain and do something else because it’s all on me’."
        },
        {
            "text": "“That was a real low point. I felt trapped and, being completely honest, I became quite emotional. I’d got to this place where I felt that until I found a partner or a person, I couldn’t do it myself. That, as strange as it sounds, is where the Civil Service came in.”"
        },
        {
            "text": "“This sounds like such a cheesy line but the Civil Service kind of became my partner, enabling me to move on with my life and my career,” adds Rebecca."
        },
        {
            "text": "“Since then, I haven’t looked back. I’m still in recruitment. My career path is the same. What’s changed is what’s available to me. I’m valued. I’m trained. I’m learning. I’m stretched. I’m given opportunities. I feel like a key part of the team."
        },
        {
            "text": "“I’m full-time at Companies House but I’m able to manage the kids just fine. The compassion and empathy that I get from my line manager means my life can exist around my career. That’s the ‘bring your whole and brilliant self to work’ thing which we have at Companies House. It’s not just ‘Come in, shut up, do your job’."
        },
        {
            "text": "“I’m now a senior manager, doing my Chartered Institute of Professional Development (CIPD), and I’ve never felt more engaged or passionate about a job."
        },
        {
            "text": "“I’m also part of the women’s network and the working families network, 2 of the many social and support networks that we have for employees at Companies House. I’m on the steering group of the women’s network which is something I absolutely love. It’s such an added element to my role and my work."
        },
        {
            "text": "“Yes, I could have gone down the private sector route in terms of finding a new employer, but I doubt I would now be feeling the same way. There’s a flexibility here built around the recognition that we’re all people, that stuff outside does impact you and your work... but that is OK. You do not find that kind of honesty just anywhere in the workplace.”"
        }
    ]
}