{
    "url": "https://marinedevelopments.blog.gov.uk/2024/08/25/internal-marine-plan-user-training-programme/",
    "title": "Internal Marine Plan User Training Programme",
    "authors": [
        "David Patrick, Digital Communications Manager"
    ],
    "categories": [
        "marine planning"
    ],
    "pub_date": "2024-08-25T10:41:33+01:00",
    "content": [
        {
            "text": "In June and July, the marine planning team at the Marine Management Organisation (MMO) delivered a comprehensive training programme to enhance the understanding and use of marine plans in the organisation. This initiative aligns with the MMO's Corporate Plan and ensured compliance with the Marine and Coastal Access Act (MCAA)."
        },
        {
            "text": "Photo: The marine planning team holding an MSP challenge game session in our London office with other MMO teams. "
        },
        {
            "text": "The training programme aimed to educate MMO members on marine planning and the specific obligations within the Marine and Coastal Access Act. The training programme included an updated ‘Introduction to Marine Planning’ module for all MMO members, along with tailored training webinars and resources for teams involved in decision-making processes and broader activities. These teams included the Marine Conservation team, Fisheries Management team, Fisheries Management Plan team, Marine Licensing, Grants, and Compliance and Control Coastal Operations teams. Collaborating with liaisons from each of these teams, marine planning experts delivered engaging tailored webinar sessions that focused on the use of marine plans in their respective processes."
        },
        {
            "text": "These sessions highlighted the complex nature of marine planning and helped facilitate cross-team collaboration, interactive learning and teamwork."
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}