{
    "url": "https://cddo.blog.gov.uk/2022/09/29/a-new-direction-for-digital-looking-back-on-the-first-year-of-cddo/",
    "title": "A new direction for digital: looking back on the first year of CDDO",
    "authors": [
        "Megan Lee, Chief Strategy and Transformation Officer, CDDO"
    ],
    "categories": [
        "CDDO",
        "DDaT",
        "Digital strategy"
    ],
    "pub_date": "2022-09-29T16:07:20+01:00",
    "content": [
        {
            "text": "The Central Digital and Data Office (CDDO) was created in early 2021 to put the conditions in place for the digitally enabled transformation of Government through leadership of the Digital, Data and Technology (DDaT) function."
        },
        {
            "heading": 2,
            "text": "Laying the groundwork"
        },
        {
            "text": "Over the last year, under the impressive leadership of Joanna Davinson and more recently our newly appointed Government Chief Digital Officer, Mike Potter, CDDO has worked to revitalise digital and data communities across government and secured funding and business leadership for programmes that will revolutionise the way we do business. We have also launched a cross-government strategy, which we are now delivering against. All in all, it’s been a busy year. "
        },
        {
            "text": "Firstly, CDDO revitalised a number of cross government leadership communities - including Chief Information Officer, Chief Technology Officer and Chief Data Officer forums - to lead on shared objectives and architecture and to solve common cross-government problems faced by the 23k+ DDaT professionals across government."
        },
        {
            "text": "Secondly, CDDO partnered with HM Treasury to ensure digital and data programmes were backed by sufficient funding and resources to achieve transformation, resulting in the government investing an additional £8 billion in the 2021 Spending Review to drive digital, data and technology transformation by 2025. "
        },
        {
            "text": "Thirdly, CDDO ensured that funding was directed towards a consistent set of priorities, through the development of a cross-government roadmap, with specific, measurable commitments, agreed to by Chief Digital and Information Officers, Permanent Secretaries and Ministers."
        },
        {
            "heading": 2,
            "text": "Great expectations"
        },
        {
            "text": "People rightly expect government services to be as good as the best online experiences they have with the private sector. As we face new and emerging challenges: from climate change to war in Europe, the provision of services to those in need, such as in the pandemic or energy crisis –  digital and data is the key to government responding quickly and more effectively."
        },
        {
            "text": "In CDDO we recognise the importance of data-driven insight into performance. As we looked at the cross-government landscape, we realised that the UK had lost ground compared to other international comparators and failed to keep pace with people’s rising expectations. We set a new vision - to be a more efficient digital government that provides better outcomes for everyone by 2025. In practice this means:"
        },
        {
            "text": " This will be achieved through our six missions: "
        },
        {
            "text": "The animation below explains these six cross-government missions and how we will deliver a digital government fit for the digital age and beyond."
        },
        {
            "heading": 2,
            "text": "What’s different about this strategy?"
        },
        {
            "text": "These missions may not seem new. In fact, the National Audit Office in 2021 wrote a report saying exactly that - that these were problems government digital strategies had tried - and failed - to make progress on in the past. So what’s different this time?  "
        },
        {
            "text": "Firstly, the digital agenda is being driven by government’s business leaders, Permanent Secretaries - through sponsorship and governance, to ensure that digital is fully prioritised by departments."
        },
        {
            "text": "Secondly, the strategy was not written by the centre. Signalling a new era of cross-government collaboration, it was co-written by the digital leaders of departments, Chief Digital and Information Officers, and their teams, Chief Technology Officers, Chief People Officers, Chief Data Officers and many others. Through being a distinct leadership body in the Cabinet Office, CDDO was uniquely positioned to ensure that its strategy was achievable yet stretching."
        },
        {
            "text": "Thirdly, the strategy is not just a signal of intent, but a set of concrete commitments such as our commitment to upskill 90% of senior civil servants in digital and data, to optimise our government services for mobile and to launch a cross government Data Marketplace so that sharing and using data across government is simpler and easier. These commitments are underpinned by a set of process, management information and governance levers to ensure we can hold ourselves to account, such as quarterly business reviews, transparent reporting and a digital dashboard, through which Permanent Secretaries will oversee delivery every six months. "
        },
        {
            "text": "We in CDDO, alongside our colleagues in departments, have the opportunity, the plan and the resolve to drive real change between now and 2025 and to become a transformed, more efficient digital government that provides better outcomes for everyone. Read more about what’s next for CDDO."
        },
        {
            "text": " "
        }
    ]
}