{
    "url": "https://cddo.blog.gov.uk/2022/09/29/an-autumn-of-digital-learning-brings-development-opportunities-for-civil-servants/",
    "title": "An autumn of digital learning brings development opportunities for civil servants",
    "authors": [
        "Barbra Webber, Head of Digital learning and frameworks, CDDO"
    ],
    "categories": [
        "CDDO",
        "DDaT events",
        "Digital learning and development"
    ],
    "pub_date": "2022-09-29T16:06:55+01:00",
    "content": [
        {
            "text": "Our senior civil servants (SCS) do an amazing job of leading teams who are vital to the delivery of government services and priorities in a variety of challenging situations. Evermore crucial to that delivery is digital. "
        },
        {
            "text": "Of course those SCS who work within the digital, data and technology (DDaT) field are vitally important, however, it is also key that we at the Central Digital and Data Office (CDDO)  support and empower those SCS who are non DDaT focused to operate in an increasingly digital world. "
        },
        {
            "heading": 3,
            "text": "Embracing digital transformation"
        },
        {
            "text": "To do so we are excited to be hosting an Autumn of Digital Learning, which is a programme of events designed specifically for the digital learning and development of SCS and their teams to achieve their digital goals as part of the roadmap for digital and data transformation led by the CDDO"
        },
        {
            "text": "This directly links to our commitment set out in my blog to provide appropriate learning opportunities to meet the DDaT Essentials which we published in late May 2022."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "The events’ schedule "
        },
        {
            "text": "Something is happening every week to help the government's transformation and upskilling within the DDaT and Innovation space. See the programme of events below and follow CDDO on EventBrite for updates. "
        },
        {
            "text": "These events are only open to public sector employees, please use a gov.uk email address when registering."
        },
        {
            "heading": 2,
            "text": "Other opportunities"
        },
        {
            "text": "Senior Civil Servants and those working in grade 6 and 7 roles who already completed the Innovation Masterclass Programme are invited to take up the Data Masterclass - please reach out to Data.Masterclass@ons.gov.uk"
        },
        {
            "text": "Other courses we feel may be of interest to anyone who would like to know more about DDaT and Innovation: "
        },
        {
            "text": " "
        }
    ]
}