{
    "url": "https://educationhub.blog.gov.uk/2022/09/29/exams-in-2023-everything-you-need-to-know/",
    "title": "Exams in 2023 – everything you need to know",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Exams and qualifications"
    ],
    "pub_date": "2022-09-29T14:45:51+01:00",
    "content": [
        {
            "text": "GCSE, AS, A level and VTQ exams and formal assessments in England will return to near normal arrangements next summer as the country continues to move on from the pandemic."
        },
        {
            "text": "Fairness remains at the heart of our approach to exams which is why there is a transition back to pre-pandemic exam arrangements."
        },
        {
            "text": "Here’s everything you need to know about Exams in 2023."
        },
        {
            "heading": 3,
            "text": "What is the latest on Exam arrangements for 2023? "
        },
        {
            "text": "This week, Ofqual confirmed a return to pre-pandemic grading in 2023, in line with their plans announced last September."
        },
        {
            "text": "The Department has confirmed that students will not be provided with advance information on the focus of exams next summer. However, students will continue to be provided with support in GCSE mathematics, physics and combined science in the form of formulae and equation sheets."
        },
        {
            "text": "This follows our announcement, with Ofqual, earlier this year that there would be a return to pre-pandemic arrangements for non-exam assessment, fieldwork and practical sciences and that schools and colleges this year will be teaching the full content of qualifications to students taking exams in 2023."
        },
        {
            "text": "Ofqual has also confirmed that it does not expect adaptations previously used to respond to the pandemic to be used in VTQs. Awarding organisations are required, for VTQs used for similar purposes, to take account of the approach, including in relation to grading, used in general qualifications so that students taking VTQs are not advantaged or disadvantaged in comparison."
        },
        {
            "heading": 3,
            "text": "Will there still be some support available for students taking exams next year? "
        },
        {
            "text": "Yes. To acknowledge students may still have experienced a level of disruption, there will be some support for pupils taking GCSE exams in 2023 as there were – in the form of formulae and equation sheets for GCSE mathematics, physics and combined science."
        },
        {
            "text": "We are investing nearly £5 billion to support students’ recovery from the impact of the pandemic, including £1.5 billion for tutoring programmes and nearly £2bn in direct funding to schools."
        },
        {
            "text": "We’ve seen more than 2million course starts through the National Tutoring Programme since 2020, with over 1.7m starts this academic year in around 80% of schools."
        },
        {
            "text": "Over the next two years we will ensure that students continue to have access to high-quality tutoring, through the National Tutoring Programme and 16-19 Tuition Fund."
        },
        {
            "heading": 3,
            "text": "When are exams in 2023 happening? "
        },
        {
            "text": "The Joint Council for Qualifications l(JCQ) are consulting on the exam timetable for next summer, which seeks to maintain some of the space built into the exam timetable last year between the first and last exams in the same subject. This spacing was well received by schools and colleges in 2022 and reduces the chance of students missing all exams in a subject due to circumstances such as illness."
        },
        {
            "text": "Results days will be on 17 August 2023 for AS and A levels and 24 August 2023 for GCSEs."
        },
        {
            "heading": 3,
            "text": "What else has been announced this week?"
        },
        {
            "text": "The Department and Ofqual are jointly consulting on guidance to schools and colleges about gathering assessment evidence to support resilience in the general qualifications system. The guidance proposes schools and colleges gather evidence in a way that aligns with their normal arrangements for preparing students for exams, helping ensure preparedness should a scenario ever again arise where it would be unsafe or unfair for students to sit exams."
        },
        {
            "text": "The Department and Ofqual are both consulting on plans to remove the expectation that students engage with unfamiliar and abstract material, such as unfamiliar vocabulary, within modern foreign language (MFL) GCSE assessments from 2023 onwards. The Department’s consultation covers the curriculum, while Ofqual’s covers how it is assessed."
        }
    ]
}