{
    "url": "https://educationhub.blog.gov.uk/2022/09/how-were-making-teacher-training-better-and-more-accessible/",
    "title": "How we’re making teacher training better and more accessible",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Teacher Training"
    ],
    "pub_date": "2022-09-29T13:14:58+01:00",
    "content": [
        {
            "text": "Children learn best with brilliant teachers at the front of the classroom. That’s why teacher training is so important."
        },
        {
            "text": "We’re creating an excellent teacher development system and transforming the support teachers receive at every stage of their career – all the way from Initial teacher training (ITT) and early career support to specialisations and school leadership."
        },
        {
            "text": "There is clear evidence that high-quality professional development can lead to improved children’s attainment, which is why we are determined to give every teacher world-class, evidence-based training and support at each stage of their career."
        },
        {
            "text": "Here’s what you need to know."
        },
        {
            "heading": 3,
            "text": "What is ITT and why is it so important?"
        },
        {
            "text": "ITT is the first step that people who want to be teachers take on the journey to the classroom. ITT gives all trainees the confidence and skills to enter the classroom and be the best teacher they can be."
        },
        {
            "text": "There is clear evidence of good practice in the current ITT system but there is also a need for improvement to ensure that our teachers are as best prepared as they can be for their life in the classroom."
        },
        {
            "text": "We intend for all new teachers to receive three years of structured training and support, which combines ITT and Early Career Framework (ECF), so they have the expertise to build a successful career."
        },
        {
            "heading": 3,
            "text": "What has changed and why?"
        },
        {
            "text": "Our review of ITT found that there is too much variation in quality among providers and that we need to prioritise ensuring high-quality teacher training provision is available in all areas of the country."
        },
        {
            "text": "So, we asked all organisations that wish to deliver ITT from September 2024 to apply to be accredited and demonstrate that they would be able to deliver our new quality standards."
        },
        {
            "text": "The process was split in two parts. Stage 1 was the accreditation process, where applicants needed to complete an application form for assessment. Those who have passed this stage and received accreditation will move to Stage 2 where their curriculum will be checked to ensure that they are ready to deliver from September 2024."
        },
        {
            "text": "This change will help improve the quality and consistency of ITT across England, with ITT courses that are centred on an evidence-based trainee curriculum. It will also make sure every trainee is well prepared to enter the teaching profession and for the next stage in their professional development."
        },
        {
            "heading": 3,
            "text": "So, how many training providers have been accredited?"
        },
        {
            "text": "We have accredited 179 providers to deliver ITT provision from September 2024."
        },
        {
            "text": "Of the 179, 16 are new entrants to the market, 59 are existing Higher Education Institutions (HEIs) and 104 are existing School Centred Initial Teacher Training providers (SCITTs). "
        },
        {
            "heading": 3,
            "text": "What happens next?"
        },
        {
            "text": "Those applicants who were successful will enter stage 2. The process will look at providers’ curricula and their readiness to deliver in key new areas of the ITT criteria 2024/25 (mentoring, partnerships and intensive training & practice)."
        },
        {
            "text": "All unsuccessful providers will be contacted over the next few days to discuss their next steps with the Department. Following these conversations, the Department will work with accredited providers and unsuccessful applicants to support providers that want to remain in the market beyond August 2024."
        },
        {
            "text": "We will encourage those who have not received accreditation to consider joining a partnership with an accredited provider, to build strong partnerships of providers ready for delivery in 2024/25."
        },
        {
            "text": "This will strengthen the quality of training and ensure we have sufficient provision in all regions, and allow the system to retain the invaluable local connections, experience and expertise that experienced, but now unaccredited providers, bring to the ITT sector."
        },
        {
            "text": "We will continue to monitor the market and work with accredited providers to ensure sufficient capacity and placements are ready for delivery from September 2024."
        }
    ]
}