{
    "url": "https://environmentagency.blog.gov.uk/2022/09/29/how-crimestoppers-works-with-the-environment-agency-to-fight-waste-crime/",
    "title": "How Crimestoppers works with the Environment Agency to fight waste crime",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Waste"
    ],
    "pub_date": "2022-09-29T09:56:07+00:00",
    "content": [
        {
            "text": "Crimestoppers is an independent charity that gives people the power to speak up to stop crime, 100% anonymously. Anyone can contact us 24/7, 365 days a year, online and by phone."
        },
        {
            "text": "Did you know that nearly a fifth of the public have known about a crime, but chose not to talk to the police? Common reasons for this are:"
        },
        {
            "text": "These are also the reasons why the Environment Agency approached us to help them in their mission to stop waste criminals. They recognise how difficult people can find it to report people who pose as legal waste operators because they can often be threatening and dangerous."
        },
        {
            "text": "We first started working with the Environment Agency in 2013. Since then, our service has become even more vital as waste criminals have become even more prevalent, but we’ve noticed the levels of reporting have not increased accordingly. It is vital to all of us that waste crime is tackled to stop damage to our communities and precious environment."
        },
        {
            "text": "Waste crime also impacts all of us financially, as huge sums of public money (our taxes) are used to catch the individuals and gangs concerned, and to clear up after them. Often unsuspecting land and property owners find themselves facing crippling bills to clear up after criminals who have broken into their premises, dumped illegally collected waste and then disappeared."
        },
        {
            "text": "It’s time we worked together to stop these waste criminals. "
        },
        {
            "text": "As a charity, we guarantee that no one calling us, or submitting information via our online reporting form, is ever identified. We will never ask who you are. We cannot identify your phone number or computer’s IP address, and we will only pass on what you know."
        },
        {
            "text": "After receiving your call, or a completed anonymous online form, we create a report that brings together all the information you gave us, making sure it doesn't contain any information that could possibly identify you."
        },
        {
            "text": "Your report is sent to the Environment Agency to add to their investigations. The more evidence the Environment Agency gathers from all sources to build a case against criminals, the quicker they can stop them and bring them to justice. The Environment Agency, like the charity Crimestoppers, works closely with law enforcement bodies, including the police, UK Border Force, and HM Revenue & Customs to stop waste criminals through whichever route is most effective."
        },
        {
            "text": "Crimestoppers also handles information on behalf of those organisations. Our teams are highly trained to deal with all kinds of information that helps protect us from harm and protect the personal details of everyone who trusts us with their crime information."
        },
        {
            "text": "If you have information about those involved in waste crime and don’t wish to give your details, I hope you feel reassured and empowered to get in touch with Crimestoppers. Every bit of information helps. Give information | Crimestoppers (crimestoppers-uk.org) or call: 0800 555 111. 100% anonymous. Always."
        }
    ]
}