{
    "url": "https://dfedigital.blog.gov.uk/2022/09/29/supply-teachers/",
    "title": "Making it easier for schools to choose supply teachers",
    "authors": [
        "Courtney Brightwell, head of insight and service design"
    ],
    "categories": [
        "design",
        "Schools"
    ],
    "pub_date": "2022-09-29T11:22:28+01:00",
    "content": [
        {
            "text": "In DfE, we help schools get good value for money when they buy the goods and services they need. This could be anything that helps them operate day to day – from whiteboards to cleaning services. Even supply teachers!"
        },
        {
            "text": "Staff absence has been a challenge for schools since March 2020. Staff across the country caught covid and were unable to go into work. Schools were becoming increasingly reliant on supply teachers and the agencies providing them."
        },
        {
            "text": "We recommend a way of buying using an approved procurement framework but we know that many schools find using frameworks a confusing process. So we arranged a design sprint to explore how we can help schools get better value for the money they spend on supply teaching."
        },
        {
            "heading": 2,
            "text": "What our early research told us"
        },
        {
            "text": "A while ago we did some user research – a mix of interviews and surveys. This was to better understand what schools need from the process of getting supply teachers."
        },
        {
            "text": "We interviewed 23 people in 18 schools across the country, and 6 people in different supply-teacher agencies. And we surveyed 130 people in schools."
        },
        {
            "text": "The research told us that we should not underestimate the size of the challenge to get school staff to stop using one process and switch to another."
        },
        {
            "text": "As users, the biggest motivator for them to change what they do, is if it saves them time."
        },
        {
            "text": "We consulted with the DfE’s Behavioural insight unit who validated our research so we felt comfortable sharing it with everyone who took part in our design sprint."
        },
        {
            "heading": 2,
            "text": "Our design sprint soon drew attention"
        },
        {
            "text": "Ben Fraser explains design sprints best in his Department for Work and Pensions blog post, ‘A Design Sprint is a 5-day co-designed workshop, aimed at rapidly generating solutions to a business problem’."
        },
        {
            "text": "During the heatwave, our policy and commercial professionals spent a week with our research and design experts in a room in Manchester. They spent hours prototyping a better way to meet schools’ supply teacher needs."
        },
        {
            "text": "We sketched out solutions, critiqued each other’s ideas and built a storyboard to show the user journey."
        },
        {
            "text": "Our Permanent Secretary, Susan Acland-Hood, even got involved. Susan was doing a floor walk in the Manchester office, so we invited her down to the sprint room. We spent some time talking her through our different design artefacts posted on the walls."
        },
        {
            "text": "She liked the idea of getting teams together to work in an agile way, as well as our storyboard. The board shows the journey of a user encountering a problem and then using our service to remedy it."
        },
        {
            "heading": 2,
            "text": "Designing a prototype to meet schools’ needs"
        },
        {
            "text": "When a school needs a supply teacher, they usually look for an agency first. They enter into a commercial agreement and then when the need arises, they request a supply teacher."
        },
        {
            "text": "This process does the job, but it doesn’t meet the schools’ needs. They have a list of things they’d like to know before bringing the teacher in. So rather than look for an agency, our prototype would let schools look at all supply teachers available, and then make an informed decision themselves."
        },
        {
            "text": "It would show supply teachers’:"
        },
        {
            "heading": 2,
            "text": "Feedback from users in schools"
        },
        {
            "text": "We built the prototype of the ‘Find a Supply Teacher’ service and tested it with 4 school business managers who gave us this feedback."
        },
        {
            "heading": 2,
            "text": "Next steps"
        },
        {
            "text": "By the end of the week, not only had we designed a prototype that could help save schools time and money, but we had also bridged the language gap between the different groups of professionals who took part. We'll publish a short post about how we did this very soon."
        },
        {
            "text": "Looking ahead, we hope to use a service design approach to explore the supply teachers market in more depth with our policy colleagues. We'll let you know how that goes."
        },
        {
            "text": "Comment below if you want to try a design sprint and need advice. Or if you have any tips for us to try."
        },
        {
            "text": "You can check out The Design Sprint for some great resources to help plan your sprint."
        },
        {
            "text": "Also, we’d love to know if you’ve done a similar design sprint and how it went."
        }
    ]
}