{
    "url": "https://nationalscreening.blog.gov.uk/2022/09/29/uk-nsc-recommends-introduction-of-targeted-lung-cancer-screening/",
    "title": "UK NSC recommends introduction of targeted lung cancer screening",
    "authors": [
        "Mike Harris"
    ],
    "categories": [
        "General"
    ],
    "pub_date": "2022-09-29T10:18:07+01:00",
    "content": [
        {
            "text": "Image by kalhh (Pixabay)"
        },
        {
            "heading": 2,
            "text": "First recommendation under committee’s expanded remit"
        },
        {
            "text": "The UK National Screening Committee (UK NSC) has given a positive recommendation for the introduction of the country’s first targeted national cancer screening programme."
        },
        {
            "text": "At its first meeting following the approval of its expanded remit, the committee recommended that the 4 UK nations should move towards implementing a targeted national lung cancer screening programme, integrated with smoking cessation services, for people at high risk."
        },
        {
            "text": "Targeted lung cancer screening would aim to find people with the disease early when they may not have any symptoms. People are more likely to be cured of lung cancer if the disease is found early before it has spread to other parts of the body. A national programme would have the potential to save thousands of lives."
        },
        {
            "text": "Targeted screening aims to identify people with a higher risk of a condition beyond demographics such as age or sex. The committee recommended that targeted screening should be offered to the high risk group of people aged 55 to 74 years with a history of smoking. See the full lung cancer screening recommendation."
        },
        {
            "text": "The Targeted Lung Health Checks (TLHC) programme provides a practical starting point for implementation of a targeted lung cancer screening programme in England. The committee noted that, to help implement a UK-wide programme, more modelling work is needed to help:"
        },
        {
            "heading": 2,
            "text": "More work needed to evaluate tyrosinaemia screening proposal"
        },
        {
            "text": "At the same June 2022 meeting, the UK NSC raised the prospect of tyrosinaemia being added to the list of conditions that newborn blood spot screening looks for."
        },
        {
            "text": "Tyrosinaemia type 1, or TYR1, is a very rare genetic condition that prevents the body from breaking down a substance called tyrosine found in food. If left untreated, TYR1 can damage the liver, kidneys and the nervous system."
        },
        {
            "text": "A modelling exercise commissioned by the UK NSC found that tyrosinaemia screening looks very promising. Screening would increase the number of affected babies detected before symptoms develop and reduce the risk of them needing a liver transplant."
        },
        {
            "text": "The committee was encouraged by the new evidence. However, members decided urgent work was needed to further evaluate the cost effectiveness and feasibility of screening before they could make a final recommendation."
        },
        {
            "heading": 2,
            "text": "No change to primary hypertension recommendation"
        },
        {
            "text": "The committee upheld its previous decision not to recommend screening for primary hypertension in children and young people."
        },
        {
            "text": "An evidence map commissioned this year found a lack of evidence on the effectiveness and benefits of a population screening programme in this population."
        },
        {
            "text": "The UK NSC will consider this topic again at its next scheduled regular review."
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK National Screening Committee. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, email screeninginformation@dhsc.gov.uk."
        }
    ]
}