{
    "url": "https://cddo.blog.gov.uk/2022/09/29/whats-next-for-the-central-digital-and-data-office/",
    "title": "What’s next for the Central Digital and Data Office?",
    "authors": [
        "Mike Potter, Chief Digital Officer, CDDO"
    ],
    "categories": [
        "CDDO",
        "Cross-government strategy",
        "DDaT",
        "DDaT community",
        "Digital transformation"
    ],
    "pub_date": "2022-09-29T16:06:31+01:00",
    "content": [
        {
            "heading": 2,
            "text": "Solid foundations"
        },
        {
            "text": "I firstly want to use this opportunity to thank Joanna Davinson for her impressive leadership of CDDO since its inception, and her leadership of the DDaT function. We have strong foundations on which to continue delivering on the government's agenda. "
        },
        {
            "text": "This winter will be challenging for all of us and it'll be more important than ever that we at CDDO and the DDaT community work closely as digital leaders and pioneers, supporting each other and continuing to build a strong, resilient and empowering community. "
        },
        {
            "heading": 2,
            "text": "Seizing unprecedented opportunities "
        },
        {
            "text": "I am immensely proud to be returning back to public service to lead CDDO, especially given such a pivotal time in government. What stands before us, and the DDaT function is an unprecedented opportunity to truly make a difference as never before. Digital, we know, is the currency not just of the present, but the future. It is this amazing profession, and the inspirational people that work within it, that hold in their hands the opportunity to unlock that future for the public. To drive better outcomes for us all. "
        },
        {
            "text": "In June 2022 CDDO launched the government’s roadmap for digital and data Transforming for a Digital Future which formed, and built upon, collaboration and Permanent Secretary leadership for the digital and data agenda on a scale never before seen. This collaborative approach and cross government working means that truly, never has the time been more ripe to deliver digital public services that not only deliver better outcomes for everyone, but to do so efficiently. "
        },
        {
            "heading": 2,
            "text": "The importance of community "
        },
        {
            "text": "Digital government services have come a long way in the past decade. There are now thousands of digital, data and technology professionals working in highly effective teams across government. Our national response to the pandemic was significantly enabled by digital, data and technology teams, an amazing example of what the DDaT in government profession can, and does, contribute to the wellbeing of the UK and its people. "
        },
        {
            "text": "We delivered some ground-breaking work during this unprecedented time, things that helped to protect and support people at the worst of times. Work like the vulnerable people service where the Government Digital Service had a leading role in identifying those in need and targeting assistance, HMRC's furlough scheme and DWP's extension of universal credit that helped protect jobs and incomes. "
        },
        {
            "text": "In many areas, however, the UK government still lags behind other sectors. We’re committed to addressing these problems. Outdated and inefficient legacy systems need to be replaced in order to deliver better services and greater value for taxpayers. Leveraging the power of digital and data will make government more efficient and sustainable, with less duplication and waste. Processes and systems will run more efficiently and policy and programmes will be delivered with greater precision and impact."
        },
        {
            "text": "For the British public this means they can access public services far quicker and far more simply. Millions of people interact with the government every week, be it to set up a business, renew their driving licence, or to access a benefit they’re entitled to, such as Universal Credit. The DDaT community is integral to every single one of those services: to empower those millions of people with access, knowledge and opportunity. "
        },
        {
            "heading": 2,
            "text": "Looking to the future "
        },
        {
            "text": "The next few years will be hugely exciting for CDDO, the DDaT profession and beyond, as we set about working to enable the Civil Service to work smarter, faster and deliver on our ambitions for the transformation of digital public services."
        },
        {
            "text": "Our focus now is partnering with departments to deliver the 21 commitments in the 2025 Roadmap. To keep up to date with both our, and the innovative digital, data and technology work that goes on within government, make sure you follow this blog, where we’ll be sharing our progress on the roadmap to a digitally empowered future. "
        },
        {
            "text": "If you’re interested in finding out more about joining the DDaT profession who work across government, visit the Civil Service careers site. "
        },
        {
            "text": " "
        },
        {
            "text": "Mike Potter replaced Joanna Davinson as Executive Director in September 2022."
        },
        {
            "text": " "
        }
    ]
}