{
    "url": "https://beisdigital.blog.gov.uk/2022/09/29/what-ive-learned-as-a-user-researcher-in-beis/",
    "title": "What I’ve learned as a user researcher in BEIS",
    "authors": [
        "Isabella Bubola"
    ],
    "categories": [
        "Service design",
        "Services and products",
        "User research",
        "User-centred design"
    ],
    "pub_date": "2022-09-29T10:34:22+00:00",
    "content": [
        {
            "text": "‘’That’s a lot of people’’, I thought the first day when I joined the BEIS Digital team as a user researcher. My first meeting was a daily stand-up with more than 20 people on the call. Not only that, but I made the mistake of being the only person with my camera on – a classic newbie move."
        },
        {
            "text": "Even though everything was overwhelming that first week, as time went on, I found my way around, met other team members and understood who was responsible for what."
        },
        {
            "text": "As this was both my first Civil Service and purely user research role, I wanted to find out ways to develop my skills and my network, especially with user researchers and product designers from other teams."
        },
        {
            "text": "If you're new to user research in government, these are some of the things that have helped me along the way, and they might be helpful for you."
        },
        {
            "heading": 2,
            "text": "1. Understand what agile means for your team"
        },
        {
            "text": "If on your first day you noticed a lot of ‘stand ups’, ‘washups’ and ‘huddles’ in your calendar - welcome to the world of agile delivery."
        },
        {
            "text": "It’s a widely used term, but everyone has their own interpretation. Different projects use different part of agile, but if you know the fundamentals you can hit the ground running."
        },
        {
            "text": "Agile just means that researching, designing, and building happen at the same time. You’re not building the entire service in one go and finding things wrong with it when it launches."
        },
        {
            "text": "Instead, you’re continuously speaking to users to find out their needs and to see if what you’re building works for them."
        },
        {
            "heading": 2,
            "text": "2. Know what else affects user research"
        },
        {
            "text": "Sometimes you need to adapt to changing timetables. There can be blockers such as not being able to talk to the people you need to. You should think about the people you’re trying to talk to and their workloads. Especially if it’s summer – don’t plan big user research projects when lots of your users will be on leave!"
        },
        {
            "text": "You can still do meaningful research even if it’s a smaller sample than you originally expected, or you can’t get direct access to the users you need to."
        },
        {
            "text": "Think about  using proxy users, or get insights from research that has been done before."
        },
        {
            "heading": 2,
            "text": "3. Know how to improve your user research skills"
        },
        {
            "text": "Which parts of user research are you most interested in? Everyone has their own style, so it’s important to find out what’s being done in your department and across government."
        },
        {
            "text": "Start with an ‘Understanding users and their needs’ course from GDS. This course is it a great introduction to the government’s focus on users and how user research works in government."
        },
        {
            "text": "Demand is as high as tickets for Glastonbury (almost), so keep your eyes peeled for new date announcements!"
        },
        {
            "text": "However, there are lots of ways to do user research. By learning from other user researchers in government, you can find out what is out there and what suits you."
        },
        {
            "text": "Which leads onto my next point..."
        },
        {
            "heading": 2,
            "text": "4. Learn from others"
        },
        {
            "text": "If you don’t know something, chances are someone else has also tried to find about it and has written about it on the user research blog, the GDS blog or other departmental blogs!"
        },
        {
            "text": "You will also find new user research methodologies that you can apply in your own work."
        },
        {
            "text": "To get started, give these posts a read:"
        },
        {
            "text": "Get someone in your team to invite you to the cross-government digital Slack channel, and check out some of the channels useful to user research like:"
        },
        {
            "heading": 2,
            "text": "5. Include the whole UCD team"
        },
        {
            "text": "You can’t do user research in isolation. Use your team to help you decide what research you do to test the right hypotheses, and what you do with the results to make decisions about the next steps."
        },
        {
            "text": "In BEIS, I’ve been lucky enough to work closely with service designers, content designers, software developers, business analysts, delivery managers and product owners."
        },
        {
            "text": "You might be helping out with technical reviews, collaborating on discussion guides, and getting everyone involved in note-taking and analysis."
        },
        {
            "text": "User research is at the heart of how we build digital services in government."
        },
        {
            "text": "You can stay up-to-date with the latest developments by signing up for email alerts or by following us on Twitter."
        }
    ]
}