{
    "url": "https://naturalengland.blog.gov.uk/2022/07/25/celebrating-the-children-and-nature-programme-how-learning-in-nature-supports-childrens-mental-and-physical-health-social-skills-and-attainment/",
    "title": "Celebrating the Children and Nature Programme – how learning in nature supports children’s mental and physical health, social skills and attainment",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Education",
        "Mental health and wellbeing",
        "Natural England"
    ],
    "pub_date": "2022-07-25T09:52:47+01:00",
    "content": [
        {
            "heading": 3,
            "text": "“Who wouldn’t enjoy witnessing the children having a forward roll race on the grass outside?”"
        },
        {
            "text": "Natural England was delighted to be joined recently by representatives from government, the education and environment sectors at Liverpool John Moores University to celebrate the learning and successes of the Children and Nature programme."
        },
        {
            "text": "We decided early on that instead of ‘telling’ people how important connecting children with nature was, we needed to show them. Having 30 primary school children present did cause some extra complications, but hearing children giggle while holding woodlice, seeing their delight as they used trigonometry in real-life to work out how tall trees were, and yes, roll down a slope, brought a lot to the day with many people reminiscing about how important outside spaces were in their own childhood for both learning and play."
        },
        {
            "text": "There is a wealth of evidence showing that children who spend time outside connecting with nature experience better mental and physical health and improved wellbeing. The 25 Year environment plan recognised this and included a policy commitment encouraging children to be close to nature, in and out of school; providing the framework for the Children and Nature Programme that Natural England has been leading on behalf of Defra and Department for Education (DfE). It was developed as three projects: Nature Friendly Schools, Community Forest and Woodland Outreach Project and Growing Care Farming."
        },
        {
            "text": "The event held at Liverpool John Moores University, celebrated the successes of the Children and Nature programme and was launched by Natural England’s Marian Spain, She thanked the delivery partners, including The Royal Society of Wildlife Trusts, The Conservation Volunteers (TVC), Mersey Forest Trust, National Forest Company, Trees for Cities, Get out More CIC (Community Interest Company) and Social Farms and Gardens."
        },
        {
            "text": "Marian reflected; “We’ve known for over a decade how important it is that children learn about - and in - nature, for their health, happiness and their success at school. That’s why I’m so delighted that Natural England and its partners have championed and delivered the Children and Nature Programme.\""
        },
        {
            "text": "The school-focused projects enabled 53,000 children from 277 schools in disadvantaged areas to benefit, through improvements to school grounds, visits to community forests and residential trips. Care farms, which offer people with defined health, social or educational needs the chance to participate in a variety of farming activities for therapeutic benefit, have increased the number of places each year to over 675,000 (a 54 per cent increase). This scale of delivery despite the challenges of Covid has proved transformational for the participating schools, teachers and students. One teacher reported delightedly that “Children’s eyes lit up and giggles of excitement filled the air as pupils watched nature in their own school grounds.”"
        },
        {
            "text": "Four key insights that came from the programme, which will inform the success of future projects:"
        },
        {
            "text": "A panel session with representatives from Defra, DfE, Dom Higgins from the Wildlife Trusts, Paul Nolan from Mersey Forest Trust, Jan Rowe from Liverpool John Moores University and Amanda Craig People and Nature Director, Natural England, discussed hot topics from the audience including how to;"
        },
        {
            "text": "The Children and Nature team, within NE, continues to work strategically to support colleagues across government to ensure the learning from the programme informs future policy including the DfE Climate Change and Sustainability Strategy and the 25 Year Environment Plan review."
        },
        {
            "text": "For more information please contact Kate Whitehead (Catherine.whitehead@naturalengland.org.uk) or Martin Gilchrist (martin.gilchrist@naturalengland.org.uk)"
        }
    ]
}