{
    "url": "https://environmentagency.blog.gov.uk/2022/07/25/checking-what-is-in-this-box/",
    "title": "Checking what is in this box",
    "authors": [
        "louiscollis"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2022-07-25T14:43:17+00:00",
    "content": [
        {
            "text": "This article was first published in Circular Online"
        },
        {
            "text": "Let me introduce myself. I’m Andy and I’m new to the Environment Agency. I’ve joined the Illegal Waste Exports Team as a Ports Officer for Felixstowe."
        },
        {
            "text": "I’m really excited to be part of the Environment Agency team, as I have always loved the great outdoors. Previously I worked in the East of England Ambulance Service and spent 30 years as a Police Officer."
        },
        {
            "text": "So, what is my new day job? I’m part of an agile, multi-skilled team of Intelligence Research Officers, Technical Officers and Field Intelligence Officers. Our combined skills mean we use intelligence to direct our site visits to root out companies we identify who are likely to be breaking the rules and exporting waste abroad that they shouldn’t be."
        },
        {
            "text": "I’m the boots on the ground at Port. I identify the containers that I want to inspect from a targeting sheet my intelligence colleagues have developed. Then I place a ‘hold’ on the containers that prevents them from being loaded onto a ship to give me time to check what’s inside."
        },
        {
            "text": "The type of waste that I inspect includes paper/cardboard, plastic (many different types), waste electrical and electronic equipment and tyres. There are many other types of waste but so far, these are the main ones I see. The majority of these waste types are shipped under Green list waste controls also known as Article 18 waste controls, which are simplified controls for non-hazardous materials."
        },
        {
            "text": "These are allowed for export, but not in mixed loads. Issues arise when the bales and bags are contaminated with other waste types, for example plastic waste mixed with non-plastic. The requirement is that the bales should be “almost free from” other waste materials. This means they can be recycled and re-used, but if they’re contaminated, the load is useless to the receiving country and presents them with an environmental and human health problem they don’t need."
        },
        {
            "text": "To decide if the container that I’ve held back is fit for export, I have to get my hands dirty and have a good root around each bale at the front end of the container to check for contamination. If it’s showing signs of contamination, I inform my office colleagues who then issue a stop notice that prevents it from being exported."
        },
        {
            "text": "The containers are so tightly packed, it’s hard to know what might be concealed further back. Some companies lie about what’s in their containers. But we have a way to check, so there is no hiding. Working with Border Force, I can get containers x-rayed, which reveals what’s really inside. Often, I find other waste types concealed inside, like rubber, wood and nappies. Sometimes we find hidden cars! These illegal loads aren’t going anywhere except to a correctly permitted site or our evidencing facility on port for further investigation."
        },
        {
            "text": "All the evidence I gather from my inspections goes back to my office colleagues, who build up our ever-growing knowledge base of criminals operating illegally in the waste sector, evidence we can use to stop them."
        },
        {
            "text": "These criminals have no care for our environment either here or abroad. I’m proud to play my part in stopping them from illegally exporting waste."
        },
        {
            "text": "Did you know, you can help to? If you think you know about an illegal waste export, or any other type of waste crime, you can give information anonymously to Crimestoppers. That’s really helpful to the Environment Agency in building up its evidence base against criminals who are often committing multiple waste crimes.  Give information | Crimestoppers (crimestoppers-uk.org)"
        }
    ]
}