{
    "url": "https://forestrycommission.blog.gov.uk/2022/07/25/tigers-and-hawks-in-our-forests/",
    "title": "Tigers and hawks in our forests",
    "authors": [
        "Kate Tobin"
    ],
    "categories": [
        "Ancient Woodland",
        "nature",
        "Tree Planting",
        "Woodland creation",
        "Woodland management"
    ],
    "pub_date": "2022-07-25T08:49:16+01:00",
    "content": [
        {
            "text": "Often overlooked but worth getting to know better, moths have a reputation for being drab – even ugly, according to some – and occasionally unnerving when encountered on night time visits to the bathroom. However when you look more closely, they are beautiful, diverse and fascinating in their colours, patterns, sizes and behaviour. The Jersey Tiger (pictured above) is a great example, common enough to be a familiar sight, but still startlingly bright. The Hawk-moths are not seen quite as often, but are stunning when spotted – the vibrant pink of the Elephant, and the green of the Lime (below), or even the spectacular green screaming deathmask of that rare visitor, the Oleander Hawkmoth."
        },
        {
            "text": "They may have evolved such a kaleidoscope variety of different species to protect themselves from a dauntingly wide range of predators. They are famously food for bats, but not so well known as a tasty snack for hedgehogs, lizards and spiders. And of course, their caterpillars are an essential part of the diet of many birds, amphibians, mammals and invertebrates."
        },
        {
            "text": "There are around 2,500 species of moths in the British Isles. Many of these are fully or partly dependent on trees and woodland, with their names often harking back to the forest – Alder Kitten, Oak Hook-tip, Scalloped Hazel. Oak trees alone support around 220 moth species."
        },
        {
            "text": "However two thirds of our moth species are in decline, with woodland species particularly suffering, and even more so, those species that depend on the open areas in woodland – rides, glades, edges, small harvested or coppiced areas. This evidence highlights the importance of managing woodland sustainably, but recent research is also indicating other potential reasons for the decline."
        },
        {
            "text": "A recent study by Rothamsted Research found that moth numbers have declined more in broadleaved woodlands over the last 50 years than in the other habitats they studied. This is surprising and worrying, especially since the causes aren’t clear. Although the area of broadleaved woodland has expanded during the last half century, a lack of management can lead to loss of wildlife. Our woodlands are seriously over-grazed by deer, whose populations are rising to levels we haven’t seen in the last 1000 years, stripping out much of the shrub layer in a woodland that might support insects such as moths. However the scientists at Rothamsted didn’t find a clear link between these factors and moth declines that they had expected. They did find some evidence of better results in the north than the south of their test sites which could suggest that climate change might be a factor."
        },
        {
            "text": "Not only are the declines a worry for moths, but also for those species that depend on them, such as our seventeen UK bat species and birds such as Nightjars and Hobbies."
        },
        {
            "text": "All bats will prey on moths but some have carved out a particularly fascinating ecological niche. In 2010 Bristol University researchers demonstrated that Barbastelle bats feed almost exclusively on moth species with ears and they have learnt how to sneak up on them by “whispering” – emitting echolocation calls 10 to 100 times lower in amplitude than other bat species, which allows them to get up to four times closer than the competition."
        },
        {
            "text": "The plot thickened in 2020 when new research produced evidence that some moth species may be responding to the risk of being in the path of an echo-locating bat by the evolution of thoracic scales similar to sound insulation – a bit like stealth fighter planes, which have radar-absorbing paint or panels to limit detection."
        },
        {
            "text": "Forestry England manages thousands of hectares of the Nation’s Forests as priority areas for Lepidoptera, the group name for butterflies and moths. Foresters manage rides, glades and open areas across their landholding – and particularly in the priority areas - to provide plenty of “ecotones” or transition between wooded and open habitat. This is really helping species such as the broad-bordered bee hawk-moth (above) – a beautiful day-flying moth that mimics bee colours and behaviour and depends on open clearings."
        },
        {
            "text": "Foresters are increasingly aware of the need to protect veteran and ancient trees by sensitively clearing around them – known as halo-thinning. Recently a rare moth returned to Savernake Forest in Wiltshire for the first time in 120 years after sympathetic conservation work was carried out. The Light Crimson Underwing (above) needs plenty of veteran oak trees to breed and feed and is usually found in ancient woodland and wood pasture or parkland. It had been almost confined to the New Forest but has now been found in Dorset and Wiltshire and seems to be increasing slightly in recent years."
        },
        {
            "text": "Not only are moths an important piece in the jigsaw for recovering nature networks, they also contribute to supporting our food supply. According to a University College London study, moths are important pollen transporters in English farmland and might play a role in supporting crop yields, The research, published in Biology Letters, shows that moth pollen transport networks are larger and more complex than networks for daytime pollinators."
        },
        {
            "text": "So what can we all do to help moths, especially the species that are most in decline? A few simple actions include:"
        }
    ]
}