{
    "url": "https://earlyyears.blog.gov.uk/2026/01/23/early-years-inspections-frequently-asked-questions/",
    "title": "Early years inspections: frequently asked questions",
    "authors": [
        "Lee Owston, National Director Education"
    ],
    "categories": [
        "Early years"
    ],
    "pub_date": "2026-01-23T10:16:55+00:00",
    "content": [
        {
            "text": "Since we published the renewed inspection framework on 9 September 2025, we’ve put on lots of online and face-to-face engagement with early years settings to answer your questions. We’re publishing the most frequently asked questions below, so you can see all the answers in one place."
        },
        {
            "text": "We’ll regularly update this as we continue to inspect with our renewed approach, so do bookmark it and check back in future."
        },
        {
            "text": "If you want to watch any of our webinars, you can find them on our YouTube playlist."
        },
        {
            "text": "We update our early years YouTube playlists regularly:"
        },
        {
            "heading": 2,
            "text": "1. When will my setting be inspected?"
        },
        {
            "text": "Currently, we inspect early years settings at least once in a 6-year window. However, from the new financial year (April 2026) we will receive funding to move to a 4-year inspection window. This was announced in the Department for Education’s ‘Giving every child the best start in life’ strategy. As part of this, we’ll move to inspect newly registered settings within 18 months, rather than 30 months. "
        },
        {
            "text": "We’re still working out what this will look like in practice and will update this blog with more information as soon as we can."
        },
        {
            "heading": 2,
            "text": "2. Who can take on the role of nominee and what do they do?"
        },
        {
            "text": "The nominee is a new, optional role in early years inspections. A nominee is someone working within your setting who acts as a link between the setting’s staff and the inspector during an inspection. The nominee needs to be someone who knows the day-to-day running of the setting well. We explain more about the role of the nominee in our inspection guidance."
        },
        {
            "text": "The nominee is not the same as the ‘nominated individual’ for registered early years settings."
        },
        {
            "text": "You don’t have to have a nominee; there is no disadvantage for you and your setting if you choose not to."
        },
        {
            "text": "If you decide you would like a nominee, you can watch our nominee training video, which explains more about the role."
        },
        {
            "heading": 2,
            "text": "3. What happens on the planning call?"
        },
        {
            "text": "The planning call is important to help the inspector to:"
        },
        {
            "text": "The planning call lasts around 30 minutes and happens after your initial notification call, and before the inspector arrives at your setting. Before the call takes place, you’ll have received an email to give you time to look at any guidance you need about inspection and to gather the information we need to help us understand the context of your setting."
        },
        {
            "text": "The planning call will normally take place by video call, unless technology does not allow for this or you would prefer it to be by telephone call."
        },
        {
            "text": "The inspector will explain the inspection process and the toolkit that guides evaluation and grading. They will also tell you where you can access the latest inspection documents. If the inspection is taking place because of a risk assessment, concern or complaint, the inspector will explain this. This, alongside all the other information about the context of your setting, will help to inform areas of inspection focus, which inspectors will agree with you."
        },
        {
            "text": "Our early years inspection information explains how we notify you of an inspection and what information we’ll need for the planning call. Our early years inspection operating guide for inspectors sets out what inspectors need to do when it comes to the planning call."
        },
        {
            "heading": 2,
            "text": "4. How do shared observations work?"
        },
        {
            "text": "We are no longer carrying out learning walks during early years inspections. Instead, inspectors gather most evidence through shared observations with leaders who know the children and setting best. This means that you can be alongside inspectors for as much as you can, or want to be."
        },
        {
            "text": "If you’re a leader working in ratio and you can’t spend much time with the inspector, don’t worry. You won’t be at a disadvantage. Inspectors will be flexible and work around when you’re available."
        },
        {
            "text": "As part of shared observations, inspectors have ongoing discussions with you and your practitioners and will talk to parents. They’ll want to speak with the practitioner designated to take the lead responsibility for safeguarding and talk with the special educational needs coordinator (SENCo), where appropriate. If you’re a childminder, this is just you."
        },
        {
            "text": "During shared observations, inspectors:​"
        },
        {
            "heading": 2,
            "text": "5. How will you evaluate my setting if no early years children are present?"
        },
        {
            "text": "If your setting has no early years children on roll and/or present on the planned day of inspection, we’ll try to reschedule it. Inspectors want to see the impact of the provision on children that attend. ​"
        },
        {
            "text": "​If you don’t know when you’ll have early years children on roll again or if you’re expecting to have children on roll on a specific date that is more than one month after the notification call, we’ll carry out a ‘no children on roll’ inspection. "
        },
        {
            "text": "In these inspections, inspectors only grade the ‘leadership and governance’ evaluation area (you can find this in the early years inspection toolkit). This will determine whether your setting is meeting the requirements of the early years foundation stage (EYFS) and the Childcare Register (if applicable). They’ll only be able to grade it as ‘expected standard’, ‘needs attention’ or ‘urgent improvement’ in this type of inspection. We’ll then follow up with another inspection when children are on roll, and when that happens will depend on the grade. "
        },
        {
            "heading": 2,
            "text": "6. How will you inspect before- and after-school settings and holiday provision?"
        },
        {
            "text": "If you’re registered on the Early Years Register but only provide care exclusively for children at the beginning and end of the school day or in holiday periods, you only need to meet the safeguarding and welfare requirements of the EYFS. Therefore, inspectors do not grade the ‘curriculum and teaching’ or ‘achievement’ evaluation areas during your inspection."
        },
        {
            "text": "This is the same for before- and after-school settings and holiday provision with children younger than Reception age. If you have one of these settings, you must have regard to, but do not have to meet, the learning and development requirements of the EYFS."
        },
        {
            "text": "Inspectors do evaluate your safeguarding and welfare arrangements. They will confirm that your setting meets the requirements of the Early Years Register. If your setting is also on the compulsory or voluntary part of the Childcare Register, inspectors will also check it meets these requirements."
        },
        {
            "text": "Inspectors may want to discuss:"
        },
        {
            "text": "You can find out more in our webinar for out-of-school settings."
        },
        {
            "heading": 2,
            "text": "7. What do you mean by ‘barriers to learning and/or wellbeing’ and how do you define 'disadvantaged'?"
        },
        {
            "text": "Inspectors want to understand your setting’s context, including your children, their needs and the specific families and community you serve."
        },
        {
            "text": "Our inspections focus on the most vulnerable children, such as those who are socio-economically disadvantaged (as defined in our glossary of education inspection terminology), those with SEND and those who are known (or previously known) to children’s social care. Inspectors focus on these children through various inspection activities and also use case sampling to gather first-hand evidence of their experiences. We want to find out how you’re helping children overcome barriers they may face to their learning and/or wellbeing."
        },
        {
            "text": "When we talk about barriers to learning and/or wellbeing, this means any factors that may make it difficult for a child to achieve as well as they should, and develop positive wellbeing."
        },
        {
            "text": "Barriers can be caused by a child’s individual circumstances, such as their health, development or emotional needs, or by external factors, including family, community or wider social conditions. They can include protected characteristics. There may also be barriers that children face that are specific to your setting’s context. These may need tailored approaches to reduce their impact on learning and/or wellbeing."
        },
        {
            "heading": 2,
            "text": "8. How does case sampling of children work?"
        },
        {
            "text": "To help us select children for a case sample, inspectors will ask you to provide a list of children who:"
        },
        {
            "text": "Even if there aren’t currently any children on roll who fall into these categories, you’ll still need to show that you have systems in place to identify and support children who have these needs."
        },
        {
            "text": "Our early years inspection operating guide for inspectors explains more about case sampling."
        },
        {
            "heading": 2,
            "text": "9. How do inspections work for co-childminders and childminders without domestic premises?"
        },
        {
            "text": "If you’re a co-childminder, we’ll normally inspect you together. In some circumstances, we may inspect you separately, especially if you work at different times of the week or from different premises."
        },
        {
            "text": "Inspectors determine which childminder the parents contract with, who claims funding for the children, and which of you is the key person for which children."
        },
        {
            "text": "If you’re only assisting with the care of children who are the responsibility of another childminder, inspectors will consider you as an assistant for the purposes of the inspection."
        },
        {
            "text": "You have a shared responsibility to safeguard children, as set out in the EYFS. If you share policies, procedures and resources with your co-childminder(s), inspectors will explore how each of you reflects on your practice and improves what you do, separately and collectively."
        },
        {
            "text": "It’s not possible to operate as a childminder and a childcare on domestic premises setting on the same premises at the same time. Therefore, if you provide or assist with care for children as a childcare on domestic setting and also hold a childminding registration, we’ll need to inspect both registrations separately. Inspectors will determine when, where and how settings and childminders operate under which registration."
        },
        {
            "heading": 2,
            "text": "10. Is ‘expected standard’ a high standard?"
        },
        {
            "text": "Yes, ‘expected standard’ is a high standard. If your setting gets graded ‘expected standard’, it’s meeting all the requirements of the EYFS for high‑quality provision. This means that children are healthy, safe, learning well and developing the knowledge and skills they need to start school. We’ve colour-coded ‘expected standard’ as green in our toolkit to visually indicate that you’re on track and there are no concerns."
        },
        {
            "text": "It's important to remember that inspectors are looking for a ‘secure fit’, not a ‘best fit’ for each grade. This means that each standard within each grade must be met before it can be given. "
        },
        {
            "text": "So, to get an ‘expected standard’ grade, you’ll need to meet all the standards in that column. You’ll see words such as ‘typically’ and ‘generally’ because the ‘expected standard’ is not about perfection. For example, you might have an area of learning that you’re developing well but it doesn’t yet quite meet the same standards as others consistently. So, if that was the case, the inspector may still grade your setting as having a secure fit with the ‘expected standard’. To get a ‘strong standard’, then all standards for ‘expected’ would need to be met first."
        },
        {
            "heading": 2,
            "text": "11. Is ‘exceptional’ the new ‘outstanding’?"
        },
        {
            "text": "There is no read-across from the previous grading system, so ‘exceptional’ is not the new ‘outstanding’. It is also important to say that the ‘expected standard’ or ‘strong standard’ do not equate to the old ‘good’ grade."
        },
        {
            "text": "‘Exceptional’ will be rare. When considering this grade, inspectors will consider whether your setting’s specific practice could support system-wide improvement. ‘Exceptional’ means practice so unique that it should be showcased: among the very best nationally."
        },
        {
            "heading": 2,
            "text": "12. Is ‘needs attention’ the new ‘requires improvement’?"
        },
        {
            "text": "As with question 11, the ‘needs attention’ grade is not equivalent to ‘requires improvement’."
        },
        {
            "text": "Inspectors are likely to grade an evaluation area as ‘needs attention’ when the ‘expected standard’ of the particular evaluation area is not met because inconsistencies in practice have a negative impact on children in general, or on a particular group."
        },
        {
            "text": "The ‘needs attention’ grade is not a ‘fail’. It’s about early identification and setting clear actions on how to meet the requirements of the EYFS, before they become bigger problems that need ‘urgent improvement’."
        },
        {
            "heading": 2,
            "text": "13. What are you doing to explain the new grade system to parents?"
        },
        {
            "text": "We’ve published a video, ‘New Ofsted report cards and grades: a guide for parents’, which explains the changes for parents."
        }
    ]
}