{
    "url": "https://civilservice.blog.gov.uk/2026/01/23/holocaust-memorial-day-2026-my-familys-story-dalya-wittenberg/",
    "title": "Holocaust Memorial Day 2026 – My Family’s Story - Dalya Wittenberg",
    "authors": [
        "Civil Service"
    ],
    "categories": [
        "UK Civil Service"
    ],
    "pub_date": "2026-01-23T11:27:14+00:00",
    "content": [
        {
            "text": "Dalya Wittenberg shares how tracing her grandparents' escape from Nazi-occupied Poland led her to become a Holocaust educator – and why passing on survivor stories matters more than ever."
        },
        {
            "text": "The first time I disclosed to colleagues that I am a descendant of Holocaust survivors was in 2017 while I was working as a Policy Advisor in the Cabinet Office. I had just returned from a profoundly moving trip to Poland to trace the footsteps of my grandparents' escape from the Nazis."
        },
        {
            "text": "On my return to work, colleagues encouraged me to share my discoveries during a lunchtime session. "
        },
        {
            "text": "The discussion that ensued went beyond educating those without a personal connection to the Holocaust about what happened to Jews in Poland during the Second World War; it sparked a discussion about other colleagues' family backgrounds, encouraging everyone to reflect on their own grandparents' histories – to make a connection with their past."
        },
        {
            "text": "My Grandparents’ Story"
        },
        {
            "text": "My paternal grandparents, Cilla and Yaakov Laifer, who grew up in the Polish town of Sochaczew, near Warsaw, faced unimaginable trauma during the war. As teenage sweethearts, they sought refuge in Warsaw when the war broke out, but soon returned to Sochaczew, joining other young people fleeing towards Russia. Along the way, they married in Bialystok, only to be arrested by Soviet forces and sent to a labour camp in the freezing Siberian city of Magnitogorsk."
        },
        {
            "text": "In the labour camp, my grandparents endured years of hardship, including slave labour, brutal conditions, and the personal tragedy of losing their first child, Batsheva. Despite these challenges, they persevered. Liberation finally came in 1945, however, unable to return to their homes in Poland, they lived as refugees in internment camps in Austria until the State of Israel was established in 1948. You can read more about my family history here."
        },
        {
            "text": "The Meaning of Holocaust Testimony"
        },
        {
            "text": "Reflecting on the experiences of past generations fosters a sense of humility. Indeed, through connecting with the memory of the suffering that my family endured during the Holocaust, I am reminded of my duties – both as a granddaughter and a Civil Servant. My grandparents spoke so little of their story that I am in awe of its fragility; how it could easily have been forgotten and remained untold."
        },
        {
            "text": "I have always been cognisant of the responsibility we hold as Civil Servants to acknowledge the underlying power that comes with working for the government. Our roles serving governments of the day have historically influenced the lives of countless individuals, particularly in times of turmoil and uncertainty. "
        },
        {
            "text": "As civil servants, entrusted to shape and deliver public policies and services, it seems fitting that we honour the legacies not only of those who lost their lives  for the freedoms that we enjoy today, but also those who persevered, whose strength lay in holding on to hope and resilience in the face of unimaginable adversity."
        },
        {
            "text": "Holocaust Memorial Day 2026 – ‘Bridging the Generations’"
        },
        {
            "text": "This year, the theme of Holocaust Memorial Day (HMD) is \"Bridging the Generations,\" reminding those who witness survivor testimonies of the importance of passing these stories on to future generations. It is not only a way to keep the memories alive but also a means to inspire resilience and understanding across time. "
        },
        {
            "text": "It is a theme I strongly identify with, as I feel a strong sense of responsibility to pass on my grandparents’ story to future generations. "
        },
        {
            "text": "Looking back on that Cabinet Office lunchtime session, I realise how transformative it was, setting me on an unforeseen path to undertake further research into my grandparents’ story and become a Holocaust educator. "
        },
        {
            "text": "I now volunteer with Generation2Generation (G2G), a charity that enables the continuation of Holocaust testimony via survivor testimonies carried forward by the children and grandchildren of survivors. With G2G’s support, expertise and training, I spent countless hours compiling the story of my grandparents’ survival, which I now present to schools, workplaces, and community organisations multiple times a year. "
        },
        {
            "text": "Each presentation acts as a bridge between historical facts and the witnessing of one survivor’s story; bringing history to life."
        },
        {
            "text": "I feel confident that my family's story will continue to be told and preserved as part of a wider Holocaust memorial and educational initiative, ensuring that what my grandparents endured, and what it signifies about the persecution of the Jewish people, will never be forgotten. "
        },
        {
            "text": "Holocaust Memorial Day in the Civil Service"
        },
        {
            "text": "Thanks to the tireless work of colleagues from across all government departments who have volunteered their time to organise HMD commemorative events, civil servants have many opportunities to bear witness to the testimonies of Holocaust survivors. "
        },
        {
            "text": "I hope that by instilling the lessons of HMD in our day to day work, civil servants can contribute to bridging the generations: to ensure the legacy of Holocaust survivors endures, and that it inspires and reminds us to stand up to all forms of racism, and promote tolerance and understanding. "
        },
        {
            "text": "Check your departmental intranet for more information on Holocaust Memorial Day events. Holocaust Survivor Annick Lever BEM will be sharing her testimony at the Civil Service event, which will be addressed by the Cabinet Secretary. "
        }
    ]
}