{
    "url": "https://gdsgeospatial.blog.gov.uk/2026/01/23/unlocking-better-outcomes-the-power-of-uprns-in-linking-data/",
    "title": "Unlocking Better Outcomes: The Power of UPRNs in Linking Data ",
    "authors": [
        "Emily Cowsill, Business Analyst, Geospatial, GDS"
    ],
    "categories": [
        "Data",
        "Technology"
    ],
    "pub_date": "2026-01-23T10:21:49+00:00",
    "content": [
        {
            "heading": 2,
            "text": "What are UPRNs?"
        },
        {
            "text": "In an increasingly data-driven world, seamless data integration is essential for effective, efficient public services and business operations. Unique Property Reference Numbers (UPRNs) are unique identifiers of up to 12 digits which are assigned to every addressable location in the UK. These identifiers are assigned by local authorities, and stay with a property permanently, even if the street address or postcode changes."
        },
        {
            "text": "Having properties connected to a single, consistent identifier makes linking up datasets that use addresses far simpler.  "
        },
        {
            "heading": 2,
            "text": "Why use UPRNs rather than addresses to link data? "
        },
        {
            "text": "Addresses are messy because there is no single way to record them. The address for the same property may be written in different ways, contain spelling errors, or have different numbers of lines depending on personal preference or database limitations. For example, a property at ‘Flat 2, 10 High Street’ in one dataset, may appear as ‘10 High St, Apt 2’ in another. This is particularly problematic when addresses are collected as free text rather than a standard format from a drop-down list. "
        },
        {
            "text": "Adding UPRNs into a dataset that contains an address strengthens the data by removing this ambiguity. It connects records despite variations in the way the address has been input. This means that even if an address is entered differently across systems, the UPRN provides a consistent reference point.  "
        },
        {
            "text": "Street addresses are not always unique, and postcodes can change as new developments are built over time. As the UPRN of a property stays with it throughout its life, assigning it to a record future-proofs against address changes. "
        },
        {
            "heading": 2,
            "text": "UPRNs are open to everyone "
        },
        {
            "text": "UPRNs are available through the Ordnance Survey Open UPRNs product, and are free to access under an Open Government Licence (OGL). Anyone can access the UPRN dataset on Ordnance Survey’s website and use it to improve address data."
        },
        {
            "text": "The OS Open UPRN dataset provides UPRNs matched to property coordinates, but it does not include direct links to street addresses or postcodes due to licensing considerations. The public sector has access to Ordnance Survey’s products through the Public Sector Geospatial Agreement, and these and other products are available to licence holders in the private sector. These products provide the UPRN linked to the address, making integration into existing datasets easier.  "
        },
        {
            "text": "Third-party organisations also provide products linking UPRNs to addresses, enabling seamless integration with address-based datasets."
        },
        {
            "heading": 2,
            "text": "The benefits go beyond improved data quality "
        },
        {
            "text": "As well as improving data standards, UPRNs enable organisations to reduce costs by accurately linking records across datasets. This helps eliminate duplication and errors, prevents inefficiencies caused by inaccurate data, streamlines processes, and supports smarter, more targeted services. "
        },
        {
            "text": "UPRNs deliver value across both public and private sectors. In the property sector, they streamline processes such as conveyancing, surveying, and insurance checks. They also support social housing by improving safety, quality, and sustainability. Utilities and telecoms organisations use UPRNs to ensure accurate billing, efficient service delivery, and timely repairs. There is further potential to strengthen safety and compliance through centralised registers for gas, electrical, and low-carbon installations. "
        },
        {
            "text": "UPRNs can also assist local authorities and central government departments in reducing duplication and linking records more effectively. For example, the UPRN can become a shared reference between social care systems in local authorities and school records. "
        },
        {
            "text": "Councils could use UPRNs to identify unlicensed Houses in Multiple Occupation (HMOs) or enhance emergency response for vulnerable residents by linking datasets across departments and accurately and quickly identifying properties in blocks of flats. Better data interoperability supports more empowered decision-making and better policy decisions."
        },
        {
            "heading": 2,
            "text": "UPRN powered data linking in practice "
        },
        {
            "text": "GeoPlace has published over 400 real-world examples highlighting how UPRNs provide a consistent identifier for reliable data linking across systems, improving insight, efficiency and decision-making. These include:  "
        },
        {
            "heading": 2,
            "text": "Need help getting started? "
        },
        {
            "text": "Realising the full potential of UPRNs relies on widespread use. If your organisation has data that relates to a property or place, act now to unlock seamless data integration, reduce errors, and enable smarter services for the future by linking it to the UPRN."
        },
        {
            "text": "Successful adoption of UPRNs may require updates to existing systems and staff training.  "
        },
        {
            "text": "If your organisation is a member of the PSGA, you already have access to UPRN-linked address datasets through AddressBase and the NGD Address Theme. Learn more on the Ordnance Survey website. "
        },
        {
            "text": "If you have questions about UPRNs or how to integrate them, the GeoPlace website is a great place to start. GeoPlace has a wide range of case studies available to share with your organisation.  "
        },
        {
            "text": "GeoPlace, in partnership with Ordnance Survey, maintains and validates the definitive national address and street datasets, and UPRNs. Together, they support local authorities, central government, and other organisations in adopting UPRNs to enable accurate data linking, improve service delivery, and drive more informed decision-making across public services. They do this by providing practical and technical guidance, resources, and tailored information to help you get started. "
        },
        {
            "text": "Please reach out to geospatial@dsit.gov.uk  if you have any comments on this blog or the items it covers. You can also sign up to get an email notification every time we publish a new blog post. "
        },
        {
            "text": "Image:  © Crown copyright and database rights 2026 OS AC0000813034."
        }
    ]
}