{
    "url": "https://ukhsa.blog.gov.uk/2026/01/21/a-parents-guide-to-croup-what-are-the-symptoms-and-when-to-seek-medical-advice/",
    "title": "A parent’s guide to croup: what are the symptoms and when to seek medical advice",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Children and Young people"
    ],
    "pub_date": "2026-01-21T12:56:51+01:00",
    "content": [
        {
            "text": "Croup is a common childhood condition that affects the windpipe, the airways to the lungs, and the voice box. It mainly affects babies and young children, typically those aged between 6 months and 3 years, though most cases occur in 1-year-olds. Boys tend to be affected more than girls, and croup is most common during late autumn and early winter. A child can get croup more than once."
        },
        {
            "heading": 2,
            "text": "What causes croup?"
        },
        {
            "text": "Croup is usually caused by a virus, most commonly parainfluenza viruses. Human parainfluenza viruses (HPIVs) are among the most important causes of upper and lower respiratory tract diseases."
        },
        {
            "text": "Croup can also be caused by flu viruses, the common cold viruses, respiratory syncytial virus (RSV), and others. The viruses that cause croup spread through close contact with infected people, contaminated surfaces, or by breathing in droplets from infected coughs or sneezes. Exactly how long someone is infectious for will depend on the virus that is the underlying cause but generally someone who is infected will be most contagious in the first few days when symptoms like fever and cold-like symptoms appear."
        },
        {
            "text": "Less common causes include breathing in a small object, severe allergic reactions, or breathing in irritants such as chemicals."
        },
        {
            "heading": 2,
            "text": "Can croup be prevented?"
        },
        {
            "text": "There are some simple actions you can take to reduce the spread of respiratory infections "
        },
        {
            "text": "Vaccination can help protect against some of the viruses that cause croup, such as flu and RSV. Groups eligible for the flu vaccine in the current season includes pregnant women, young children, those with certain long-term health conditions, and older adults aged 65 years and over. A list of who is eligible is available here."
        },
        {
            "text": "Pregnant women at week 28 or later and everyone aged 75 to 79, or turned 80 after 1 September 2024 can have a vaccine to protect themselves or their babies against RSV. Find out more about the RSV vaccine here."
        },
        {
            "heading": 2,
            "text": "What are the symptoms?"
        },
        {
            "text": "Signs of croup include:"
        },
        {
            "text": "Your child will usually have cold-like symptoms first, such as a temperature, runny nose and cough. Croup symptoms typically appear after a few days."
        },
        {
            "heading": 2,
            "text": "Why are croup symptoms often worse at night?"
        },
        {
            "text": "Croup is often worse at night due to a combination of factors: natural cycles of the body’s hormones (leading to increased inflammation and increased mucus production), lying flat (allowing mucus to pool and narrow airways, or worsening acid reflux to cause inflammation), and cooler/drier air irritating the throat, all of which exacerbate the inflammation and swelling in the windpipe that causes the characteristic barking cough and stridor (noisy breathing). "
        },
        {
            "heading": 2,
            "text": "What should I do if I think my child has croup?"
        },
        {
            "text": "Call NHS 111 or see your GP if you think your child has croup. Although it's usually mild, your child may need treatment, and your GP may prescribe medicine to help shorten the illness."
        },
        {
            "heading": 2,
            "text": "When should I call 999 or go to A&E?"
        },
        {
            "text": "NHS guidance is to seek emergency help immediately if your child:"
        },
        {
            "heading": 2,
            "text": "How can I care for my child with mild croup at home?"
        },
        {
            "text": "Croup usually gets better on its own within 48 hours. If NHS 111 or your doctor confirms your child has mild croup, you can help by:"
        },
        {
            "heading": 2,
            "text": "What common treatment is no longer recommended?"
        },
        {
            "text": "Do not put your child in a steamy room or get them to inhale steam, as this is no longer recommended. There is no evidence that it helps, and there's a risk of scalding children with hot water or steam."
        },
        {
            "heading": 2,
            "text": "When can my child return to school or nursery?"
        },
        {
            "text": "Your child can generally return once their fever has gone and they feel well enough to take part in normal activities, even if the cough lingers. Keep them at home while they have a fever, seem lethargic, or have breathing difficulties."
        },
        {
            "heading": 2,
            "text": "Can adults catch croup?"
        },
        {
            "text": "Adults can catch the viruses that cause croup, but they are less likely to develop severe croup symptoms like the characteristic ‘barking’ cough because their larger airways aren't as easily obstructed. In adults, these viruses often present as a bad cold, laryngitis, or bronchitis, though severe cases can occur and may need hospitalisation."
        },
        {
            "text": "What is UKHSA’s role in this area?"
        },
        {
            "text": "Parainfluenza is one of the respiratory viruses that UKHSA tracks and publish weekly data on during the winter. See our Data Dashboard for more details. UKHSA surveillance informs NHS planning, enabling a data-driven approach to managing a significant cause of illness, hospitalisation, and death in the UK. "
        }
    ]
}