{
    "url": "https://mhclgdigital.blog.gov.uk/2026/01/21/our-journey-to-delivering-the-fire-and-rescue-data-platform/",
    "title": "Our journey to delivering the Fire and Rescue Data  Platform ",
    "authors": [
        "Amy Smythe, Fire and Rescue Data Platform (FaRDaP) Service Owner"
    ],
    "categories": [
        "Data",
        "Technology"
    ],
    "pub_date": "2026-01-21T09:35:13+00:00",
    "content": [
        {
            "text": "When most people think about Fire and Rescue Services (FRS), they picture appliances rushing to emergencies, firefighters tackling blazes, or lifesaving rescues. What’s less visible – but just as vital – is the technology working behind the scenes to record, share and coordinate the information that helps keep communities safe. "
        },
        {
            "text": "We are the Fire and Rescue Data Platform (FaRDaP) team, and this is how we built and now run one of the most critical digital services underpinning emergency response across England, Scotland and Wales."
        },
        {
            "heading": 2,
            "text": "Who we are "
        },
        {
            "text": "The FaRDaP team is a live operational team, responsible for running a national service that supports 48 Fire and Rescue Services across Great Britain. Our work sits at the core of emergency operations: every time a 999 call is made and a fire service attends an incident, our platform plays a role in ensuring the incident is recorded accurately, consistently and securely. "
        },
        {
            "text": "We aren’t just maintaining a website or managing a database – we're   operating a nationwide, real-time digital backbone that thousands of emergency personnel rely on every single day. "
        },
        {
            "heading": 2,
            "text": "What the FaRDaP does "
        },
        {
            "text": "The FaRDaP is a data collection platform that allows frontline responders to record incident data. Our primary users are firefighters, as well as serving  analysts with the data they need for publications. "
        },
        {
            "text": "Here’s how it works in practice: "
        },
        {
            "text": "These incident records form a national dataset used for operational  intelligence, policy-making and public safety improvements. "
        },
        {
            "heading": 2,
            "text": "The transition from the legacy system to the FaRDaP "
        },
        {
            "text": "One of our biggest achievements was the 8-week transition that brought 48 Fire and Rescue Services onto the FaRDaP from a legacy system. Despite the scale and complexity, along with the impact of the transfer of responsibility for fire and rescue-related policy and operational functions from the Home Office to the Ministry of Housing, Communities and Local Government (MHCLG), the move was smooth and well-coordinated, thanks to careful planning, phased onboarding, and close collaboration with each service. "
        },
        {
            "text": "Feedback from the sector was highly positive. Users praised the platform's  reliability and ease of use, as well as the responsive support they received throughout the process. "
        },
        {
            "text": "By the end of the 8 weeks, every service was live on the FaRDaP – on schedule and with confidence – setting a strong foundation for the platform’s future. "
        },
        {
            "heading": 2,
            "text": "Why we built it "
        },
        {
            "text": "The FaRDaP officially went live on 15 September 2025, but its story started long before that. "
        },
        {
            "text": "For 16 years, Fire and Rescue Services had relied on the previous platform, the Incident Recording System (IRS). While IRS had served the sector well, over time it had become technically outdated, difficult to maintain, and a growing cyber security risk.  "
        },
        {
            "text": "Importantly, the new platform will be the foundation for collecting further Fire and Rescue Datasets regarding other prevention and protection  activities as well as incidents attended. The aim is to deliver a full, standardised data picture of Fire and Rescue activities at a national level. "
        },
        {
            "text": "The fire sector needed a modern, secure, scalable platform built for today’s threats, operational needs, and expectations about performance and reliability. "
        },
        {
            "text": "So, the FaRDaP was built as a safer, smarter, more resilient foundation for the future of fire incident data and future collections. "
        },
        {
            "heading": 2,
            "text": "What we have achieved  "
        },
        {
            "text": "The main outcomes from the project and benefits offered by the new service are: "
        },
        {
            "heading": 3,
            "text": "Service and sector outcomes "
        },
        {
            "heading": 3,
            "text": "Data and insight outcomes "
        },
        {
            "text": "- operational intelligence "
        },
        {
            "text": "- official statistics and publications "
        },
        {
            "text": "- evidence-based policy and decision-making "
        },
        {
            "heading": 3,
            "text": "Technology and security benefits "
        },
        {
            "heading": 2,
            "text": "Looking ahead "
        },
        {
            "text": "Since launch, the FaRDaP has already become an essential platform for frontline services, but our journey is far from over as we continue to iterate the platform. We continue to: "
        },
        {
            "text": "The journey to the FaRDaP has been one of collaboration and purpose. We're  proud to operate a service that helps emergency teams record incident data more easily, keeps communities safer and supports the fire sector in building a stronger digital future."
        },
        {
            "text": "Find out more about the objectives and principles that guide our work in digital."
        }
    ]
}