{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2026/01/21/sciencewise-bringing-the-public-voice-into-science-and-policy-making/",
    "title": "Sciencewise: bringing the public voice into science and policy-making",
    "authors": [
        "gseprofession",
        "Katie Weeks"
    ],
    "categories": [
        "Collaborating & Networking",
        "Learning & Development",
        "Outreach",
        "Science",
        "Uncategorized"
    ],
    "pub_date": "2026-01-21T09:23:11+00:00",
    "content": [
        {
            "text": "Sciencewise is the UK’s internationally respected programme for public dialogue with science and technology, ensuring public opinions and concerns are factored into policy-making. Sciencewise Programme Director Katie Weeks explains more about their work. "
        },
        {
            "text": "From climate change to artificial intelligence, genome editing to data research, science and technology is increasingly embedded within the big societal challenges. But with this exciting opportunity comes a responsibility to make sure that science-driven solutions and policies work for people and are not just done to them.  "
        },
        {
            "text": "Founded in 2004, and funded by DSIT through UK Research and Innovation (UKRI), Sciencewise is the UK’s internationally respected programme for public dialogue, a deliberative two-way conversation the public with science and technology. Its goal is to put public voices at the heart of science-related policy making, ensuring that different opinions are listened to and policies reflect public priorities and concerns.  "
        },
        {
            "text": "Examples of using public dialogue in the science community "
        },
        {
            "text": "A key principle for public dialogues supported by Sciencewise is that they must have an effective route to impact through clear links to policy decision making, along with a clear understanding of who will be listening to the outcomes. "
        },
        {
            "text": "Public dialogue can be particularly useful at the cutting-edge of science and technology research, which is expanding in new directions all the time, often into spaces where there is not yet any governance on ethical and legal boundaries.  "
        },
        {
            "text": "A recent report on future flight technologies looked at how the UK could integrate new aviation technologies to the benefit of different communities at a time when flying taxis still feel like science fiction to most people, whereas our dialogue on Ultra-Processed Foods addresses an issue that is already commonplace in most of our lives, but where there has been little research into the public's view.  "
        },
        {
            "text": "One of the strongest examples of the enduring and long-term impact of public dialogue was evident this summer when UK news outlets reported eight babies had been born free of hereditary mitochondrial disease using genetic material from three parents. The lack of public commentary around the announcement highlights just how much has changed since the technique was first developed in Newcastle, when concern grew over ‘three-parent’ and ‘designer’ babies.  "
        },
        {
            "text": "Part of that change is down to a 2012 Sciencewise large-scale public dialogue  on using this IVF-based technique to prevent the transmission of mitochondrial disease. This dialogue, commissioned by the Human Fertilisation and Embryology Authority, enabled policy makers to listen to the views of more than 1000 members of the public and almost 2000 other stakeholders, and in turn develop policy and regulations around the science. The technique was legally approved in 2015 with little controversy because the dialogue had increased the acceptability of the technique by surfacing the ethical and moral concerns people had and allowing regulations to be developed that addressed them.  "
        },
        {
            "text": "Are you planning a dialogue or want to understand the public’s views on a topic?  "
        },
        {
            "text": "Sciencewise has run many more dialogues, covering topics from smart data and digital identities to net zero and carbon capture. So, whether you have only just heard of public dialogue or you’re already planning one, the team at Sciencewise can support and guide you. Projects supported by Sciencewise have access to up to 50% matched funding as well as a dedicated advisor who specialises in dialogue and engagement methods.  "
        },
        {
            "text": "There’s lots of additional guidance to support you to develop and deliver your dialogue and we welcome early conversations on potential dialogue and policy topics. "
        },
        {
            "text": "Find out more on how dialogue is useful in policy-making by viewing the Sciencewise guiding principles, our FAQs, or by emailing info@sciencewise.org.uk.  "
        }
    ]
}