{
    "url": "https://educationhub.blog.gov.uk/2023/06/02/degree-apprenticeships-how-you-could-get-a-degree-for-free/",
    "title": "Degree apprenticeships: How you could get a degree for free",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Apprenticeships",
        "Further education"
    ],
    "pub_date": "2023-06-02T10:46:40+01:00",
    "content": [
        {
            "text": "If you want to get a degree, but you’re worried about finances or just not sure that a traditional university course is right for you, a degree apprenticeship could be a great option. "
        },
        {
            "text": "A degree apprenticeship allows you to study towards an undergraduate or master’s degree while you work, getting invaluable industry experience and earning a salary. Your off-the-job training takes place in your working hours, and you won’t have to pay for your tuition. "
        },
        {
            "text": "Find out everything you need to know about degree apprenticeships here. "
        },
        {
            "heading": 3,
            "text": "What are degree apprenticeships? "
        },
        {
            "text": "Degree apprenticeships are jobs with training. On completion of the apprenticeship, you’ll achieve an undergraduate or master’s degree – just like someone who has got their degree through a traditional route. "
        },
        {
            "text": "Your training is paid for by apprenticeship funding, so unlike with traditional university courses, you won’t have to pay for your tuition yourself. What’s more, you’ll earn a competitive salary while learning.  "
        },
        {
            "text": "Though you’ll study part-time at a university, around 80% of your time will be spent doing practical work. This allows you to get real-life work experience and still gain a recognised qualification. "
        },
        {
            "text": "Degree apprenticeships are a Level 6 or 7 apprenticeship. "
        },
        {
            "heading": 3,
            "text": "Who can do degree apprenticeships and what are the requirements? "
        },
        {
            "text": "The requirements for each degree apprenticeship are different.  "
        },
        {
            "text": "Some Level 6 apprenticeships will ask for at least five GCSEs at 9-4 (or A*- C on the old grading scale), including English and maths. But you could also progress into a degree apprenticeship from a lower-level apprenticeship, or another qualification like a T Level. "
        },
        {
            "text": "It does mean that you’ll need to be at least 18-years-old to participate in most degree apprenticeship, though there is no upper age limit. "
        },
        {
            "text": "However, as well as considering your grades, employers will be looking for other skills like communication, teamwork and passion. They might also value prior industry experience as much as formal qualifications.   "
        },
        {
            "heading": 3,
            "text": "How much do degree apprentices earn? "
        },
        {
            "text": "The amount you can earn depends on the specific apprenticeship. However, many employers offer apprentices a salary of at least £20,000 a year.  "
        },
        {
            "text": "Apprentices often go on to well-paid jobs on completion of their training. Recent analysis showed that one year after finishing their programmes, the median salary for a former Level 6 apprentice was £34,620. "
        },
        {
            "heading": 3,
            "text": "What kind of degree apprenticeships are available? "
        },
        {
            "text": "Degree apprenticeships are available in a range of industries, from engineering, to science, to law, to marketing and digital. "
        },
        {
            "text": "For example, you could gain a BSc (Bachelor of Science) degree through a civil engineering, nursing or biomedical apprenticeship. Other apprenticeships could lead to a BA (Bachelor of Arts) in digital marketing, or an LLB (Bachelor of Laws).   "
        },
        {
            "text": "The NHS recruitment and training body, Health Education England (HEE), has also confirmed funding for a new Medical Doctor Degree Apprenticeship."
        },
        {
            "text": "There are hundreds of degree apprenticeships on offer throughout the year. "
        },
        {
            "text": "Browsing apprenticeships and filtering them by level and location could be a good way to get inspiration for the kind of degree apprenticeship that excites you. "
        },
        {
            "heading": 3,
            "text": "How to apply for a degree apprenticeship  "
        },
        {
            "text": "You apply to degree apprenticeships direct with the employer. You can now search for degree apprenticeships via the Find an Apprenticeship website or via UCAS. "
        },
        {
            "text": "Applying for a degree apprenticeship is similar to applying for a job. This means that unlike with university courses, you can apply for degree apprenticeships at any time.  "
        },
        {
            "text": "Applications will differ depending on the apprenticeship, but it’s likely that you’ll have to submit a CV and do an interview.  "
        },
        {
            "text": "To get personalised advice on your application, you can talk to a careers adviser for free via the National Career Service. There are lots of ways to get in touch including by phone, webchat or in person. "
        }
    ]
}