{
    "url": "https://deframedia.blog.gov.uk/2023/06/02/media-coverage-on-hedgerows/",
    "title": "Coverage on Hedgerows",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Farming"
    ],
    "pub_date": "2023-06-02T16:49:06+01:00",
    "content": [
        {
            "text": "On 30 May, coverage in The Guardian on post-Brexit farming payments reported that farmers and nature groups are concerned the transition away from the basic payments scheme will cut funding that protects English hedgerows. The piece suggests Defra could drop requirements which ensured the protection of hedges, such as hedgerows not being cut between 1 March and 31 August. It carries comments from nature groups such as the Royal Society for the Protection of Birds (RSPB) and CPRE (The Countryside Charity), with the RSPB calling for Defra to keep the current hedgerow protections in place, or replace them with new policy."
        },
        {
            "text": "Now that we have left the EU we are free from the bureaucratic Common Agricultural Policy. Our new system sees payments made fairly to all farmers in return for their actions, designed in partnership with the industry, and tailored to the specific interests of British farmers. This means we can put in place effective schemes that work better for our farmers, helping them to protect important environmental assets such as hedgerows while producing food sustainably."
        },
        {
            "text": "We recognise hedgerows are vital elements of our landscapes, upholding the distinct character of the countryside, improving local air quality, and serving as crucial wildlife habitats. This is why we will be consulting shortly on how we can best continue to support and enable farmers to conserve hedgerows after phasing out the Common Agricultural Policy."
        },
        {
            "text": "The protection of hedgerows are a key component of our Environmental Land Management Schemes, part of the £2.4 billion per year we are investing in farming for the rest of this Parliament to support farmers to be productive and profitable whilst ensuring sustainable food production and environmental protection go hand-in-hand."
        },
        {
            "text": "Defra is already taking decisive action to protect hedgerows. Through our Countryside Stewardship schemes, we are supporting farmers to maintain and restore over 10,000km of existing hedgerows while planting an additional 4,000km across the nation."
        },
        {
            "text": "As of January 2023, there were around 32,000 Countryside Stewardship agreements, a 94% increase from 2020, and this included payments for 52,800km of hedgerows maintenance and management."
        },
        {
            "text": "We are also introducing a new Sustainable Farming Incentive hedgerow standard this year to pay farmers to assess the condition of hedgerows and manage them in a way that will work for wildlife and improve biodiversity."
        },
        {
            "text": "Most EU cross compliance rules and standards are already part of UK domestic law and will continue to apply to farmers after 2024.  Where there are gaps between cross compliance requirements and our domestic legislation, we will act to maintain strong standards for our countryside, and will look to use the most effective mechanism, whether regulatory or not, to deliver against our environmental goals."
        }
    ]
}