{
    "url": "https://naturalengland.blog.gov.uk/2023/06/02/restoring-britains-pine-martens-a-position-from-natural-england-naturescot-and-natural-resources-wales/",
    "title": "Restoring Britain’s pine martens: a position from Natural England, NatureScot and Natural Resources Wales",
    "authors": [
        "John Holmes"
    ],
    "categories": [
        "Species recovery",
        "Wildlife"
    ],
    "pub_date": "2023-06-02T08:46:17+01:00",
    "content": [
        {
            "text": "John Holmes, Strategy Director, Natural England "
        },
        {
            "text": "I confess I have never seen a pine marten, but I hope to one day. For now though, knowing they are out there, and that they are spreading gives me real hope for nature recovery. Translocations play a part in that and we have been working with NatureScot and Natural Resources Wales to encourage a science-led, strategic approach. This blog post explains our joint advice on how projects can best approach pine marten conservation."
        },
        {
            "text": "Conservation translocation is the deliberate movement and release of organisms where the primary objective is a conservation benefit1. It is an important tool we can use to improve the conservation status of species locally or globally, and to restore ecosystems."
        },
        {
            "text": "We have worked with each other and partners over many years to develop best practice and have supported well planned conservation translocations that have clear conservation benefits and take account of people’s aspirations and concerns. Many such projects have taken place, some of them involving translocations between the different countries of Britain, to help recover nature across our islands. For example, vendace, ospreys, white-tailed eagles and Eurasian beavers have all been translocated from Scotland to England, and pine martens to Wales and England. Vendace have also been translocated to Scotland from England. In all cases we expect practitioners to apply the IUCN Guidelines for reintroduction and other conservation translocations and the associated national codes."
        },
        {
            "text": "The pine marten was once widespread and common across Britain but is now rare and recovering3. Pine martens are generalist omnivores, eating a wide range of different food species. They predominantly prey on small mammals such as field voles, and this usually consists of up to 50% of their diet.  Their diet preference is determined by what is locally most abundant."
        },
        {
            "text": "Predators are a crucial part of a functioning ecosystem. A diverse predator community is expected to naturally limit populations of abundant prey populations. However, pine martens by themselves generally live at low density; a population of one per km2 is considered a high density, and a pair of martens generally need at least 200 ha of suitable woodland4."
        },
        {
            "text": " "
        },
        {
            "text": "Long-term strategic recovery plan for pine martens in Britain and the role of conservation translocations"
        },
        {
            "text": "More recently we have become aware of an increasing number of new pine marten translocation proposals from Scotland to England and Wales. We have a responsibility to conserve pine marten populations and to the local communities who currently host these populations, to balance the aim of improving the conservation status of the species throughout Britain, while ensuring that the Scottish population is not harmed by taking too many, and too quickly."
        },
        {
            "text": "We therefore worked with the Vincent Wildlife Trust to produce a ten year pine marten strategy4 to help inform decision making. This is endorsed by Natural England, NatureScot and Natural Resources Wales and should be followed by projects contributing to the recovery of pine marten in Britain."
        },
        {
            "text": "The strategy emphasizes the importance of conserving the still recovering population in Scotland and provides a road map of optimal regional releases, in priority order, for England and Wales. The restoration of the pine marten to the south-west of England and promoting the natural recolonisation of south Cumbria from southern Scotland are currently regarded as the priority."
        },
        {
            "text": "Additionally, should the need arise for further releases to help build resilience or improve the genetic integrity of existing English and Welsh populations, reinforcement of those populations with Scottish animals will be prioritized."
        },
        {
            "text": "Where a population in an area could be recovering through natural colonisation, this should be supported. Conservation translocation to expedite this process would only be justified if there is clear evidence indicating that natural colonisation is unlikely to occur within a reasonable timescale, as described in the strategy."
        },
        {
            "text": " "
        },
        {
            "text": "Sourcing pine martens for projects"
        },
        {
            "text": "The strategy highlights the vital importance of conserving the genetic integrity of the British pine marten population, so pine martens for release projects must be sourced only from native British populations."
        },
        {
            "text": "The legislation varies between the three countries. However in all countries, pine martens are fully protected, and the capture, possession or transport of wild pine martens requires a licence to be issued by the relevant statutory agency.  For releases in England, pine martens originating from populations outside Britain are judged by Natural England to be sufficiently distinct that they are subject to the controls in section 14 of the Wildlife and Countryside Act 1981. Their release into the wild is therefore unlawful."
        },
        {
            "text": "All conservation translocations of pine martens within Scotland require licences, and NatureScot would not permit the release of animals originating from outside Britain. In Wales, NRW strongly recommends sourcing British animals as set out in the Pine Marten Strategy, and would not issue a licence for pine martens originating outside Britain."
        },
        {
            "text": " "
        },
        {
            "text": "Alignment with the Codes is key"
        },
        {
            "text": "When considering a pine marten translocation project, projects should follow (where available) the associated national codes and guidance for reintroductions and other conservation translocations."
        },
        {
            "text": "For England:"
        },
        {
            "text": "Reintroductions and other conservation translocations: code and guidance for England"
        },
        {
            "text": "Contact speciesrecoveryreintroduction@naturalengland.org.uk or enquiries@naturalengland.org.uk"
        },
        {
            "text": " "
        },
        {
            "text": "For Scotland:"
        },
        {
            "text": "Scottish code for conservation translocations"
        },
        {
            "text": "Contact licensing@nature.scot"
        },
        {
            "text": " "
        },
        {
            "text": "For Wales:"
        },
        {
            "text": "IUCN Guidelines for reintroductions and other conservation translocations"
        },
        {
            "text": "Contact enquiries@naturalresourceswales.gov.uk or specieslicence@naturalresourceswales.gov.uk"
        },
        {
            "text": " "
        },
        {
            "text": "All projects proposing to translocate pine marten are expected to consult with NatureScot for advice on sourcing pine martens and licensing needs and, in addition, the relevant devolved statutory agency where the proposed release would take place; Natural England, Natural Resource Wales or NatureScot."
        },
        {
            "text": " "
        },
        {
            "text": "Project proposers need to work together and liaise with local stakeholders"
        },
        {
            "text": "To prevent the Scottish population of pine marten being harmed, it is essential that any practitioners considering a translocation to England, Wales or elsewhere in Scotland, liaise and coordinate their plans with other projects so that overall requirements are established and potential implications assessed."
        },
        {
            "text": "We will request evidence that such communication has taken place and that projects are not working in isolation. We will also require evidence that the combination of donor sites, timing and number of martens proposed for capture will not, in combination with animals being taken for other projects, have an overall detrimental impact on conservation status."
        },
        {
            "text": "Natural England, NatureScot and Natural Resource Wales will also consult with each other, to ensure we are comfortable that donor populations will not be harmed and that the releases have been planned well. Local communities also value their pine marten populations, and so some stakeholders may have concerns if animals are being removed from their areas. We expect appropriate stakeholder engagement to take place at the donor sites and release sites, as set out in the national codes."
        },
        {
            "text": " "
        },
        {
            "text": "Pine marten recovery throughout Britain"
        },
        {
            "text": "It is our aspiration that pine marten return to all suitable habitats across Britain, so it is great to see so much enthusiasm for recovering one of Britain’s most charismatic predators. The significant efforts in progress to recover nature are expected to improve opportunities for natural recolonisation. Together with targeted translocations, we expect to succeed in achieving this aspiration."
        },
        {
            "text": " "
        },
        {
            "text": "Link to NatureScot publishing of statement - https://www.nature.scot/doc/restoring-britains-pine-martens-position-naturescot-natural-england-and-natural-resources-wales"
        },
        {
            "text": " "
        },
        {
            "text": "Link to Natural Resources Wales publishing of statement"
        },
        {
            "text": " "
        },
        {
            "text": "References"
        },
        {
            "text": "1 IUCN/SSC (2013). Guidelines for Reintroductions and Other Conservation Translocations. Version 1.0. Gland, Switzerland: IUCN Species Survival Commission, viiii + 57 pp."
        },
        {
            "text": "2 Mathews et al. (2018) A Review of the Population and Conservation Status of British Mammals. A report by the Mammal Society under contract to Natural England, Natural Resources Wales and Scottish Natural Heritage. Natural England, Peterborough. ISBN 978-1-78354-494-3."
        },
        {
            "text": "3  Mathews F, and Harrower C. (2020). IUCN – compliant Red List for Britain’s Terrestrial Mammals. Assessment by the Mammal Society under contract to Natural England, Natural Resources Wales and Scottish Natural Heritage. Natural England, Peterborough ISBN 978-1-78354-485-1"
        },
        {
            "text": "4 MacPherson, J. and Wright, P. (2021). Long-term strategic recovery plan for pine martens in Britain. Vincent Wildlife Trust, Ledbury."
        },
        {
            "text": " "
        },
        {
            "text": " This blog post forms part of a series of perspectives from Natural England on species-specific conservation translocation projects, these are intended to be published over the next few months."
        }
    ]
}