{
    "url": "https://ruralpayments.blog.gov.uk/2023/06/02/top-tips-to-avoid-delays-to-countryside-stewardship-capital-claims/",
    "title": "Top tips to avoid delays to Countryside Stewardship Capital Claims",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Countryside Stewardship"
    ],
    "pub_date": "2023-06-02T10:31:59+01:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "When you are submitting a Countryside Stewardship (CS) capital claim, there are a number of things that you need to remember to avoid any delays to receiving your payment.  "
        },
        {
            "text": "We have put together some top tips of things that you need to remember about submitting CS capital claims and evidence.   "
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Submit evidence "
        },
        {
            "text": "You need to submit supporting documents and evidence as part of your Countryside Stewardship Capital claim. These need to be submitted by the ‘Claim by’ date in your agreement document.    "
        },
        {
            "text": "The evidence and supporting documents that you will need to submit may vary, so it is important that you check the relevant scheme manuals and guidance by searching for Countryside Stewardship on GOV.UK. "
        },
        {
            "text": "In order to successfully submit your claim, you may need to submit photographic evidence. You will need to send us photographs from before you start capital works, during the work and after it is completed. "
        },
        {
            "text": "When taking photographs to submit as evidence, it’s important to make sure that the images are clear and without any blurriness.  "
        },
        {
            "text": "For guidance on how to submit photographic evidence of before, during and after completing works for each option, use the CS grant finder on GOV.UK.  "
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Check your evidence is labelled "
        },
        {
            "text": "When submitting your Countryside Stewardship Capital claims, it’s important to check you have correctly labelled your evidence with the right option code and parcel reference number.  "
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Check your permissions "
        },
        {
            "text": "It’s important to check that you have set the correct permissions in the Rural Payments service before you submit a CS Capital claim or send us evidence.  "
        },
        {
            "text": "When you send evidence to us, it’s important to make sure that you submit it from an email address that is associated with somebody with the correct permissions within the Rural Payments service.  "
        },
        {
            "text": "If you don’t have the correct permission set when you submit evidence and claims to us, we will not be able to process them. "
        },
        {
            "text": "For guidance on how to update your permissions, follow the guidance in this video on the RPA YouTube channel. "
        },
        {
            "text": "To find out more information about how to make a capital or revenue claim, read the guidance on GOV.UK. "
        },
        {
            "text": "To stay up to date with the latest information and updates from RPA, sign up to our blog and follow us on social media on the following accounts:  "
        },
        {
            "text": "By following and subscribing to our social channels and blog, you’ll be able to see the latest updates about important information. We also share top tips and announcements. You can also listen to The RPA Podcast which we have launched to help farmers, landowners and rural communities keep up to date with the latest news from RPA.   "
        },
        {
            "text": " "
        }
    ]
}