{
    "url": "https://companieshouse.blog.gov.uk/2023/06/02/working-for-companies-house/",
    "title": "Working for Companies House",
    "authors": [
        "Gary Townley - Senior communications manager"
    ],
    "categories": [
        "People and culture",
        "Working at Companies House"
    ],
    "pub_date": "2023-06-02T11:21:43+01:00",
    "content": [
        {
            "text": "There’s little doubt that most of our working practices have in some way or another been impacted by the coronavirus (COVID-19) pandemic. Whether it’s how we work, where we work or when we work, we have all adapted to a new working environment. Interviewing and onboarding new staff and retaining and training colleagues for new roles, at the same time as maintaining the level of service that we provide to our customers, has been challenging. "
        },
        {
            "text": "Finding and retaining the right people in an extremely competitive employment market can be difficult. Although pay plays a major role, other factors such as work-life balance, job satisfaction and career progression are becoming more significant when considering joining an organisation. "
        },
        {
            "text": "Another factor of increasing importance when people research a potential employer is that of culture and values. Today’s job seekers want to work for organisations that share their values, and many would not consider applying for a position with a company whose culture and principles they disagree with. "
        },
        {
            "text": "At Companies House we’re on a journey to make sure that our culture is people-led, with equality, diversity and inclusion forming an integral part of all that we do. We want to provide equal opportunities, and we’ve already taken positive steps towards creating an inclusive environment at the core of our organisational culture.  "
        },
        {
            "heading": 2,
            "text": "Shared values "
        },
        {
            "text": "When employees feel valued, included, and respected, they’re more likely to be engaged in their work. This can lead to:   "
        },
        {
            "text": " Shared values make sure that an organisation and its staff are working towards the same goals and objectives.    "
        },
        {
            "text": "Having shared values creates a positive culture that encourages collaboration, respect, and open communication, leading to a more enjoyable work environment and better relationships with your colleagues. Employees are more likely to have a sense of purpose and feel like their work is meaningful. This can lead to greater job satisfaction and motivation. "
        },
        {
            "text": "Our values and behaviours are an important part of working at Companies House. They underpin everything that we do and they set out the way we ourselves should behave, and the behaviours we can expect from our colleagues. They also create an environment where differences are celebrated, new ideas embraced, colleagues feel safe to challenge and everyone has a sense of belonging.  "
        },
        {
            "heading": 2,
            "text": "Diversity and inclusion "
        },
        {
            "text": "Diversity and inclusion bring different perspectives, ideas, and experiences to the table. This leads to more creativity and innovation, which can drive the organisation forward and help it stay competitive in a constantly evolving market. "
        },
        {
            "text": "By embracing diversity and inclusion, an organisation can tap into a broader talent pool and attract a wider range of candidates. This can help to build a stronger and more dynamic team with a variety of skills and experiences. "
        },
        {
            "text": "A diverse group of people with different backgrounds and perspectives can lead to better decision-making. This is because diverse teams are more likely to consider a wider range of options and challenges and come up with creative solutions to meet the needs of all our customers. "
        },
        {
            "text": "At Companies House, we’re currently implementing our equality, diversity and inclusion (EDI) strategy. This puts EDI at the heart of our working environment and culture. It starts with attracting diverse candidates and flows through the careers of all our staff. We’ve established an EDI steering group to monitor the development and implementation of the strategy. "
        },
        {
            "text": "We have already made great strides to support, develop, reward and retain our talent through our suite of people-led networks. We use these networks to share and model our inclusive employer brand that allows our people to bring their whole brilliant selves to work.  "
        },
        {
            "heading": 2,
            "text": "A role at Companies House "
        },
        {
            "text": "If, after reading this blog post, you feel inspired to work at Companies House, take a look at our job vacancies by using the Civil Service jobs website. You can type ‘Companies House’ into the “what” box to see our current roles. "
        },
        {
            "text": "It’s an exciting time to be working at Companies House as we deliver digital transformation and legislative reform, and we’d love you to join us. You will not find many other organisations offering the same level of flexibility and work-life balance as Companies House. "
        },
        {
            "text": "As a place to work, you’ll be welcomed, supported and empowered to develop yourself, your skills and your career. You’ll have the chance to learn new skills, take on new challenges, and contribute to a cause that you believe in. "
        },
        {
            "text": "Take a look at what we offer. "
        }
    ]
}