{
    "url": "https://deframedia.blog.gov.uk/2022/12/09/guardian-coverage-of-the-natural-flood-management-programme-report/",
    "title": "Guardian coverage of the Natural Flood Management Programme report",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Weekly stories"
    ],
    "pub_date": "2022-12-09T16:49:46+00:00",
    "content": [
        {
            "text": "There is coverage in the Guardian of a new report published by the Environment Agency which evaluates the impact of our national Natural Flood Management Programme."
        },
        {
            "text": "The programme, which received £15 million of government funding, including benefits to communities and to biodiversity alongside protecting homes and businesses from floods."
        },
        {
            "text": "Across 60 pilot projects the programme created an equivalent of 1.6 million cubic metres of water storage and increased flood resilience to 15,000 homes. In addition, the programme contributed to nature recovery: improving 4,000 hectares of habitat, improving 610 kilometres of river and planting 100 hectares of woodland."
        },
        {
            "text": "Following the publication of the report, EA Chief Executive Sir James Bevan set out how Natural Flood Management must be a core part of the nation’s defence against flooding and climate change."
        },
        {
            "text": "Sir James Bevan said:"
        },
        {
            "text": "Environment Minister Rebecca Pow said:"
        },
        {
            "text": "Natural flood management helps to slow the flow of water across the landscape - including the re-meandering of rivers, the restoration of wetlands and targeted woodland planting."
        },
        {
            "text": "NFM measures include planting trees and hedges to absorb more water, creating leaky barriers to slow water flow in streams and ditches and restoring salt marshes, mudflats, and peat bogs."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}