{
    "url": "https://socialcare.blog.gov.uk/2022/12/09/helping-unpaid-carers-get-vaccinated-helps-us-all/",
    "title": "Helping unpaid carers get vaccinated helps us all",
    "authors": [
        "Emily Holzhausen OBE"
    ],
    "categories": [
        "Care and support",
        "Carers",
        "Communities",
        "coronavirus"
    ],
    "pub_date": "2022-12-09T10:47:09+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Protecting those who care for others"
        },
        {
            "text": "With the winter upon us, it’s more important than ever to protect ourselves and those we care for against COVID-19 and flu and get vaccinated. But how do we increase take-up among unpaid carers, a critical and highly valued group of people, whose care is worth the equivalent to a second NHS, and without whom health and care services would collapse? By protecting unpaid carers we, in turn, help protect our health and care services."
        },
        {
            "text": "Unpaid carers are eligible for a COVID-19 autumn booster if they are caring for someone who is clinically vulnerable. They are also entitled to a free flu jab."
        },
        {
            "text": "Whilst local health systems can use patient record data where carers are identified, the big data pooling that happened during the pandemic is not accessible. Rather than being called, carers who are not identified on their patient record can self-identify and book themselves centrally for a COVID-19 vaccination. This was not available for most of the pandemic. These key differences mean we need to approach identifying carers in different ways."
        },
        {
            "text": "There is learning we can use from the take up of flu jabs, from before the pandemic, to help fine tune messaging and use resources pro-actively to identify unpaid carers."
        },
        {
            "text": "Organisations, including Carers UK, are trying to do two things. The first is to identify unpaid carers who won’t be called for a COVID-19 or flu jab. This essentially means targeting unpaid carers under 50 years old and encouraging them to book their vaccinations. Secondly, we’re trying to encourage the people who have been offered the jab directly to take it up."
        },
        {
            "heading": 2,
            "text": "Vaccination matters to unpaid carers but access is vital"
        },
        {
            "text": "Getting vaccinated means a lot to unpaid carers. Last autumn, according to Carers UK’s survey, the booster round had good take-up, with around 47% being offered because they were unpaid carers and not because of age or an underlying condition. Last year, only 4% said they were not having their COVID-19 vaccinations. Hesitancy was higher among unpaid carers from ethnic minority communities, but only slightly higher."
        },
        {
            "text": "Overall, there were very positive attitudes to vaccination.  When we look at the free flu jab for unpaid carers, it is a very popular measure, but take-up rates pre-pandemic were far lower than older age groups – around 55% for carers who were younger."
        },
        {
            "text": "Where carers were identified by GPs, they were more likely to have the flu jab."
        },
        {
            "text": "This important learning from flu jabs pre-pandemic points towards some really positive public health policy in relation to unpaid carers – offering vaccinations to people over the age of 50 will capture a good cohort since the peak age of caring is between 50 and 64."
        },
        {
            "text": "Getting unpaid carers to take up the offer is sometimes challenging. Unpaid carers can be very time poor, if they are providing substantial care (e.g. 20 hours plus per week), or if they have children and are stretched between two generations and they often say they are worn out. It’s not hard to see how fitting a jab into this busy packed schedule might be more difficult for an unpaid carer. That makes it essential we communicate how accessible, easy and convenient vaccination appointments can be."
        },
        {
            "heading": 2,
            "text": "Our wider obligations"
        },
        {
            "text": "Local authorities, health and care services, and support organisations have vital roles to play in helping carers identify themselves and book their vaccinations."
        },
        {
            "text": "Given the majority of unpaid carers are working age, every employer has a role to play in sharing the vaccination message, especially if they have an unpaid carers’ network."
        },
        {
            "text": "But our ongoing commitment to unpaid carers, whose support is the equivalent to a second NHS, must be to make sure they are identified as such via their GP patient record. They have to ask their local practice to do this.  Identifying unpaid carers in this way makes the whole cycle of public health measures and vaccination so much smoother – and helps all of us to say safe, healthy and happy this winter."
        }
    ]
}