{
    "url": "https://codigital.blog.gov.uk/2022/12/09/how-were-levelling-up-the-accessibility-of-our-digital-services/",
    "title": "How we’re levelling up the accessibility of our digital services",
    "authors": [
        "Tony Iiona"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2022-12-09T15:51:23+00:00",
    "content": [
        {
            "text": "Raising the baseline standard of accessibility of digital services across the board is a difficult job for a government department and for public bodies on the whole. "
        },
        {
            "text": "Many have dispersed digital estates spanning various policy units and arms length bodies. Their online services are various and comprise platforms for, say, registering your pet ferret or registering a boat, (alright not the first government services that spring to mind but certainly robust public-facing, transactional services like any other) and for more specialist staff-facing service types like HR and finance platforms, recruitment tools, informational websites, survey and collaboration tools. These are usually owned and updated by third party providers who exercise tight control over service functionality and have a wider obligation to a cross-sector, often multinational client base with differing goals towards accessibility standards."
        },
        {
            "text": "For UK public bodies, making their various user interfaces accessible to a consistently recognisable standard is a work in progress and the progress is slow without proper resource, desire for change and incentive to think in terms of the whole system. Given how the accessibility regulations will be monitored and enforced, there is, after all, significant risk of sanction and risk to reputation for organisations if just one of its multiple services persistently excludes users or is unresponsive to meeting the obligation towards making reasonable adjustments. "
        },
        {
            "heading": 2,
            "text": "Why does it matter?"
        },
        {
            "text": "A fifth of the UK population (over 14 million) are disabled and, according to the UK Consumer Digital Index, a similar proportion have very low digital skills, therefore for us here at the Cabinet Office, making sure everyone can use a digital public service (Service Standard item 5) means making sure those with access and assistive needs can use any of the services across our organisation to complete the task they need to. This goes for citizen-facing as well as staff-facing services."
        },
        {
            "text": "We recognised that we don’t have near the volume of expertise or equipment in-house to cover comprehensive audits of all our services. We therefore initiated a competitive exercise to find an accessibility auditor to partner with. We found the Digital Accessibility Centre Ltd (DAC), a non-profit social enterprise long accustomed to working with public bodies. DAC are equipped with talented personnel with a range of skills and attributes. They include quality assurance testers all of whom have first hand experience of the barriers an inaccessible website places between them and independence. "
        },
        {
            "heading": 2,
            "text": "What do DAC offer?"
        },
        {
            "text": "Working from their base in South Wales, the DAC team uses a three strand process combining, user testing, automated tools and expert manual review. They audit services for barriers affecting the range of visual, hearing, mobility and cognitive disabilities, they test on different browser formats and screen sizes and they can test the more specialist stuff too; locked down administrative or backend interfaces. All to make sure that services are good enough to receive the DAC accreditation logo. DAC’s Director, Cam Nicholl, says, “it is heartening to see such commitment to digital inclusion and DAC are delighted to have been chosen to work alongside Cabinet Office digital teams to help make sure their services are accessible to everyone.” DAC is a Living Wage Foundation accredited employer and so Cam also sees another plus in their being able to “grow and provide valuable employment opportunities for disabled people”. "
        },
        {
            "text": "Since the Public Bodies Accessibility Regulations became law in 2018, awareness has risen considerably of the duty to make reasonable adjustments towards digital service users, especially those with disabilities. This includes publishing a regularly updated accessibility statement, one which meets the required format, covers the mandatory wording on enforcement, lists known outstanding accessibility barriers and is useful to users in so far as the contact details provided are not bogus (an astonishing 20 per cent of them reportedly are!) ."
        },
        {
            "heading": 2,
            "text": "What’s next? "
        },
        {
            "text": "There's still a way to go though, the regulations ask for a mid-range level of compliance to ensure some measure of inclusivity. This mid-range equates to the European digital accessibility standard EN 301 549 or level AA of the latest version of the international standard, the Web Content Accessibility Guidelines. Yet, as reasonable as this set goal sounds, the national monitoring body in their inaugural report notes that the average number of high level accessibility barriers (WCAG level A or AA rated) encountered per public sector website is 52 per website and 2 per web page. "
        },
        {
            "text": "You might say that any barrier is a welcome one when having to fork out for a parking fine but the frustration and cognitive load of addressing a chore like this online can be significantly eased if a service journey puts as little in your way as possible along the route to receiving your aggravating, but timely, receipt; whether you rely on additional technology to navigate a screen or are viewing on a smartphone, or not."
        },
        {
            "text": "DAC can help us audit our digital services and ease such issues en masse and at pace. This partnership provides a cost effective way of raising service standards across the organisation by taking away the need for individual service teams to procure separate external audits; all from different suppliers of varying quality and pricing. We know that this work will help us to provide digitally inclusive services for all. Working with DAC will allow the Cabinet Office to assure digital accessibility to the highest standards and help us strive towards being the exemplar at the heart of government. "
        },
        {
            "text": "If you work at the Cabinet Office and would like to find out more, please contact Anthony Ilona. "
        }
    ]
}