{
    "url": "https://prisonleaversproject.blog.gov.uk/2022/12/09/hundreds-of-prison-leavers-to-be-offered-new-technologies-as-part-of-the-prison-leavers-innovation-challenge/",
    "title": "Hundreds of prison leavers to be offered new technologies as part of the Prison Leavers Innovation Challenge",
    "authors": [
        "Anoushka Kavanagh"
    ],
    "categories": [
        "Prison Leavers Innovation Challenge"
    ],
    "pub_date": "2022-12-09T12:33:40+00:00",
    "content": [
        {
            "text": "Through the Prison Leavers Innovation Challenge (PLIC), we invited tech companies and small businesses to design and develop digital technologies that could help offenders steer clear of crime after leaving prison. Two pilots have successfully launched in the community this month, with the potential to support hundreds of prison leavers to resettle into life outside of prison."
        },
        {
            "text": "The Ministry of Justice’s first ever Prison Leavers Innovation Challenge was set up in 2021 to draw upon the dynamism and innovation of small tech companies, with the aim of testing new digital products that could reduce reoffending by providing targeted support for offenders post release."
        },
        {
            "text": "We worked with some excellent companies in the first phase of the project–where nine suppliers were awarded up to £25,000 to develop a prototype while receiving a programme of support and mentorship, mirroring the model of start-up ‘accelerators’, from our delivery partner. You can read more about the first phase here."
        },
        {
            "text": "The most promising of these suppliers have now received additional funding to further develop their products. We’re proud to announce that two of these have successfully launched their technologies in the community, introducing innovative solutions that will support hundreds of prison leavers over 12 months."
        },
        {
            "heading": 2,
            "text": "Turning Pages Digital "
        },
        {
            "text": "Developed by Yalla Cooperative in partnership with the Shannon Trust, Turning Pages Digital is a learning tool aimed at prison leavers with low literacy levels and learning disabilities which encourages them to improve their reading skills after release."
        },
        {
            "text": "Over 60% of prisoners’ English assessment results were below GCSE level in 2021/22. Illiteracy is a significant issue amongst the prison population and can be a barrier to navigating life after release. For example, it can impact engagement with education, training and employment–important in reducing reoffending–and make everyday tasks such as finding accommodation or doing grocery shopping more difficult."
        },
        {
            "text": "This app seeks to address this by providing literacy support in the community. It is based on the paper-based ‘Turning Pages’ learning model which has been developed and delivered by the Shannon Trust in prisons since 2015 with demonstrable impact. Digitising this program provides prison leavers with greater flexibility and on the app, learners can set personal goals–such as learning to read a letter from their family or write a CV. Prison leavers will be supported by a dedicated coach for the duration of the program."
        },
        {
            "text": "Turning Pages will be piloted with 300 prison leavers with self-assessed low literacy across the Kent, Surrey and Sussex probation region."
        },
        {
            "heading": 2,
            "text": "My Journey"
        },
        {
            "text": "Developed by Dr Gemma Morgan, an expert criminologist from the University of Swansea, and their technology partner the Legal Innovation Lab Wales, My Journey is a web-platform which aims to introduce goal-setting and behavioural techniques designed to support prison leavers to desist from crime."
        },
        {
            "text": "Building a positive crime-free identity is a key step in keeping prison leavers on the straight and narrow and tracking success can reinforce positive behaviours. However, if prison leavers are not supported to do this, and their needs are not met, they may struggle to pursue constructive non-criminal goals and are more likely to reoffend. Developing tailored responses matched to prison leavers’ needs and progress can therefore reduce reoffending."
        },
        {
            "text": "My Journey enables support services to do this via a journal, needs assessment, and goal-tracking function. The platform allows prison leavers to input their daily needs, such as housing, employment and addiction, and suggests support services to assist with these–while gamification features will help prison leavers hit their goals. Key practitioners from Include UK, part of the consortium who have developed the app, are also able to identify and mitigate patterns in offending behaviour and barriers to desistance using data generated from the platform."
        },
        {
            "text": "My Journey is being trialled with approximately 300 men who have been released from HMP Swansea and HMP Parc and are being resettled in South Wales."
        },
        {
            "heading": 2,
            "text": "Our approach "
        },
        {
            "text": "Both of these technology solutions have been designed to meet the specific needs of prison leavers and this group have been heavily involved in their development via a mixture of co-design groups, panels and user testing sessions."
        },
        {
            "text": "By involving prison leavers throughout the process, we have sought to ensure the platforms are easy to use, accessible and add value to users’ lives. Putting our users at the heart of these products will be key to achieving better outcomes for prison leavers. We will be collecting learnings on these pilots’ impact over the next year."
        },
        {
            "heading": 4,
            "text": "Interested in our work? Get in touch – PLIC@justice.gov.uk"
        }
    ]
}