{
    "url": "https://codigital.blog.gov.uk/2022/12/09/launching-as-cabinet-office-digital/",
    "title": "Launching as Cabinet Office Digital!",
    "authors": [
        "dianag"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2022-12-09T15:50:03+00:00",
    "content": [
        {
            "text": "Our journey started in October 2020 when the organisation formerly known as the Chief Digital and Information Office was established with an aim to enable Cabinet Office to use technology to effectively serve all of its users: colleagues, citizens and government."
        },
        {
            "text": "We got a new Chief Digital & Information Officer  (CDIO) Mike Hill who joined us in June 2022 and in November 2022  we re-launched our organisation as Cabinet Office Digital - a new brand with a new vision of 'Enabling and Transforming' the Cabinet Office'. "
        },
        {
            "text": "Enabling through the provision of exemplary digital, data and technology (DDaT) services and transformative in support of the digital transformation strategy of the organisation. "
        },
        {
            "text": "We celebrated our launch in London and Manchester with all our colleagues and senior leaders from the Cabinet Office and the Central Digital and Data office. During this we shared our brand, our new vision, structure and ways of working. We discussed the importance of digital to the strategic transformation of the department; how data democratisation, automation and convergence will support creating a Better Cabinet Office of the future. "
        },
        {
            "heading": 1,
            "text": "Getting the basics right"
        },
        {
            "text": "Our first year (20/21) was aimed at “getting the basics right” through stabilisation, building resilience and addressing legacy. These foundational elements have enabled us to move forwards at greater pace, providing a more coherent view of priorities."
        },
        {
            "heading": 1,
            "text": "Continuing to deliver"
        },
        {
            "text": "The second year (21/22) was for delivering key outcomes and managing risks for the department in data and information, cyber security and technology, as well as reducing costs and building partnerships with CO business units. "
        },
        {
            "text": "We’ve seen the team become more stable since its inception. We’ve dealt with some of the most challenging changes to ways of working in recent memory, and moved to a full remote way of working during the COVID-19 pandemic. On the other side of the pandemic we’re a very different organisation. We’re no longer London centric. We are embracing cross-site working, and setting up our hubs in Bristol and Manchester."
        },
        {
            "heading": 1,
            "text": "Time for growth & change"
        },
        {
            "text": "Within Cabinet Office Digital we are creating a product-centric model keeping our users at the heart of everything we do. We will do this through acting as both Digital Partner and/or Digital Delivery Partner to the Cabinet Office; advising and assuring business units/Arm Length Bodies in developing their own Digital, Data and Technology (DDaT) capabilities, as well as taking on delivery responsibilities ourselves where relevant. "
        },
        {
            "text": "This new engagement model will also support how together we will transform the provision of DDaT across the Cabinet Office landscape; realising significant synergies, cost savings and reducing risk across the department."
        },
        {
            "text": "Our strategic guide is  the Central Digital and Data Office (CDDO) strategy for all of the government, and our role is to deliver Cabinet Office’s share of this strategic change. The CDDO strategy is based on the premise that a modern government in the 21st century means seamlessly delivering programs and services that, by design, are digitally enabled, user need driven and that address security and privacy concerns. It also addresses how we create a more digitally mature government by creating a system that unlocks digital transformation and promotes digital skills at scale."
        },
        {
            "text": "These are exciting times within the Cabinet Office Digital team as we continue to grow our presence in Bristol and Manchester, improve the user experience for our users by delivering excellent products and services, and supporting the digital transformation of the organisation. So watch this space!"
        },
        {
            "text": "We will continue to share blogs about our work and you can also follow us on Linkedin to hear more from us!"
        }
    ]
}