{
    "url": "https://environmentagency.blog.gov.uk/2022/12/09/resetting-our-rivers-how-taking-them-back-to-stage-zero-could-help-nurture-nature/",
    "title": "Resetting our rivers – how taking them back to ‘stage zero’ could help nurture nature",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2022-12-09T11:02:51+00:00",
    "content": [
        {
            "text": "Matt Parr works in Lincolnshire’s Fisheries, Biodiversity and Geomorphology team and has been with the Environment Agency for 10 years. Here, he explains how he’s working to restore the glory of local rivers by resetting them to their natural state, and how this will support nature recovery as the world discusses biodiversity at COP15."
        },
        {
            "text": "Picture this – it’s a warm summer day and you’re standing on the edge of a valley filled with long, golden grass. Down at the bottom of the valley this grass blends with the wetter landscape’s lush luminous green of wetland vegetation interspersed with sparkling pools of water."
        },
        {
            "text": "Heading down the slope towards the tangled mix of woodland and open pasture, the temperature drops and the sound of cool running water burbles as it cascades over fallen tree limbs and winds its way across a tangled and untidy landscape of open woodland and grassland. The trees’ bark and roots are covered in bright, textured moss and ferns and between them are glades where beavers and deer graze, keeping the vegetation in check and allowing the light to filter through."
        },
        {
            "text": "The air is alive with the sound of wetland birds – snipe, woodcocks and the iconic call of the cuckoo. Beneath your feet, the ground is soft and springy with peat and nutrient-rich soil, peppered with purple marsh orchids and the yellow of irises and marsh marigolds."
        },
        {
            "text": "It’s no wonder this place was once known as the Grant Avon – a name which means ‘divine spring’, from which the town of Grantham likely took its name. In ancient times, it would have been a source of clean water, food, and building material, but also would have served as places where our ancestors communed with nature, believing the river to be inhabited by ancient goddesses."
        },
        {
            "text": "Nowadays, it is better known as the River Witham and it bears little resemblance to its ancestor of some 2,500 years ago. It has been subjected to generations of interventions to drain the land so it’s suitable for arable use, like much of Lincolnshire’s lost wetlands."
        },
        {
            "text": "But now, the Environment Agency is undertaking a pioneering project to restore it to its former glory using a new technique known as ‘stage zero river reset.’"
        },
        {
            "text": "It means we’re helping return it to its natural state, lifting the water back up into the landscape – literally recreating the fragile “wet” land landscape that was lost when rivers were modified and controlled for milling and land drainage."
        },
        {
            "text": "River restoration is nothing new – it helps us improve habitats, increase biodiversity, manage flood risk and protect water quality and quantity during periods of drought. Often it’s done by re-wiggling the rivers, removing bunds, lowering the floodplain to encourage spillage, or creating meanders that more closely resemble the courses they would have naturally taken."
        },
        {
            "text": "But a stage zero reset goes a step further, allowing it to choose its own shape, and be untidy but free. This technique was developed in the Northwest United States and there has been a growing movement to apply it in the UK across specially-selected sites like Holnicote in Devon and other sites in Cumbria, Norfolk and Lincolnshire."
        },
        {
            "text": "On the River Witham, we ‘lifted’ the water up onto the landscape by cutting new channels in the floodplain and filling the old, deeper channel. This raised the water table, reduced drainage (giving the river more water to work with), and allows it to reform through its own natural processes of erosion and deposition. Scattering fallen trees across the floodplain mimics processes that would happen naturally over time as the landscape evolves and the river forms its own riffles, rivulets, pools and bogs without human intervention."
        },
        {
            "text": "This is what we’ve done on the River Witham upstream Grantham in Lincolnshire, and it brings multiple benefits for people and nature. This wet land acts like a sponge, encouraging water to spill out onto the floodplain during wet periods and releasing water back into the river when it’s dry, supporting wildlife and wetland habitat. It also traps nutrients and fine sediment, resulting in cleaner river water downstream. And the project will also absorb 117 tonnes of carbon emissions, meaning that it’s helping tackle both the climate and the nature emergencies."
        },
        {
            "text": "So far, this stage zero reset has already raised groundwater levels across the site by approximately 1.5m, bringing it nearer to its beautiful, wild state of 2,500 years ago during the Bronze Age."
        },
        {
            "text": "Nature has been quick to recolonise the new habitat of pied wagtails, egrets, herons and wildfowl returning just days after the work was complete. And after heavy rain, we can see the water downstream of the site has colour than the water flowing into it, which shows us that the fine silts and sands are dropping out into the wetland as we hoped."
        },
        {
            "text": "It’s more important now than ever before that we look to make a step change in how we manage and improve the environment to halt the decline and support nature recovery. This must include embracing the potential for nature-based solutions delivering for nature and our wider environmental and societal objectives."
        },
        {
            "text": "That’s why the Environment Agency is working with others to enhance habitats and protect and manage land favorably for nature. And as the world prepares for the UN Convention on Biological Diversity this week – COP 15 – this stage zero restoration project is a solid example of how we can restore our rivers to their former glory and achieve multiple outcomes through the process."
        },
        {
            "text": "We and colleagues from the University of Lincoln and UMEÅ University in Sweden will continue to monitor the project to study how the new wetland responds to floods and droughts, and to track the return of wetland-dwelling plants and animals. We’re also looking to work with partners to develop this learning into further stage-zero restoration projects across Lincolnshire and beyond."
        },
        {
            "text": "Rivers used to be revered by ancient peoples and even named after deities for their life-supporting qualities. And through this river reset, we hope that once again this section of the River Witham will resemble the ‘divine spring’ and wild wetland that it once was."
        },
        {
            "text": " "
        }
    ]
}