{
    "url": "https://veteranstoday.blog.gov.uk/2022/12/09/veterans-get-say-in-first-official-uk-survey/",
    "title": "Veterans get say in first official UK survey",
    "authors": [
        "michaelball"
    ],
    "categories": [
        "Armed Forces",
        "Armed Forces Covenant",
        "Veterans",
        "Veterans Advice",
        "Veterans Support",
        "Veterans Today",
        "Veterans Welfare and Support"
    ],
    "pub_date": "2022-12-09T10:44:48+00:00",
    "content": [
        {
            "text": "The very first UK-wide official survey for veterans and their families is now under way.For another six weeks, veterans across the country can have their say and help to shape the future of veteran services."
        },
        {
            "text": "Funded and commissioned by the Office of Veterans’ Affairs, it is the first exercise to collect feedback from the entire veterans community across the UK.The survey, in collaboration with the Office for National Statistics (ONS), asks veterans to describe their experiences of being a veteran and of using government services. The responses will help the Government to adapt services to better meet the needs of veterans and their families.Minister for Veterans’ Affairs Johnny Mercer said: 'Public services need to reflect the people they serve and so it’s really important we hear from veterans on their experiences in accessing support.'No one knows better what it’s like to be a veteran in Britain than ex-military themselves. Your voice can help shape stepped-up services for veterans.'The launch of the survey comes alongside the release of the ONS’s Census 2021 data on the veteran population in England and Wales. Last year was the first time a question about military service was included in the Census.The new ONS figures show there were 1.85 million people in England and Wales who reported that they had served in the armed forces.In England, regions with the highest proportion of veterans were the South West (5.6%) and the North East (5%). The proportion of UK veterans was higher in Wales (4.5%) of the population and in England (3.8%).Sir Ian Diamond, national statistician at the ONS, said: 'Responses to the survey will help us better understand the experiences, needs and wellbeing of our veteran community, and to guide future action. It is important we hear a wide range of views.'We are passionate about investing time and effort to produce high- quality estimates that properly help us all understand how our veterans’ needs can be best met.'The stats from the ONS and the veterans survey deliver on commitments under the Veterans Strategy Action Plan to improve the data and understanding of Britain’s veteran population."
        },
        {
            "text": "The ONS will release further statistical information on the veterans population next year.The survey can be completed online in under 30 minutes, and veterans can access tailored support to complete the survey through the Office for National Statistics’ dedicated helpline."
        },
        {
            "text": "To take part, click here."
        }
    ]
}