{
    "url": "https://dragonsden.blog.gov.uk/2024/02/22/dragons-den-ip-blog-series-21-episode-7-2/",
    "title": "Dragons' Den IP Blog - Series 21 Episode 8",
    "authors": [
        "Clare Saunders"
    ],
    "categories": [
        "Designs",
        "IP",
        "Licensing",
        "Trade marks"
    ],
    "pub_date": "2024-02-22T21:00:37+00:00",
    "content": [
        {
            "text": "Watching this episode on a very wet and grey February day, it was unsurprisingly the gummy sweets with a purpose and the sustainable beachwear brand that really shone out to me from the Den this week."
        },
        {
            "heading": 3,
            "text": "Trying to sweeten the deal"
        },
        {
            "text": "Joe Woolf’s bright and breezy pitch warmed up the Dragons immediately. He was hoping to secure a sweet deal for his confectionary business. More than just a sugary treat though, his flavoured gummy sweets, Tasty Mates, have an important message attached: check in on a friend and see how they’re doing during these hard times and perhaps even indulge in the snack together."
        },
        {
            "text": "For all the energy and enthusiasm that the Dragons had for Joe they couldn’t quite find the same enthusiasm for the brand itself."
        },
        {
            "text": "Deborah Meaden gave Joe some advice to chew over that could help make the Tasty Mates proposition more appetising:"
        },
        {
            "heading": 4,
            "text": "A perfect pair?"
        },
        {
            "text": "In the case of Tasty Mates, one by one the Dragons declared themselves out, all because they didn’t believe in the strength of the brand, until there was only one Dragon left. Although Peter Jones had similar reservations he said he couldn’t stop thinking about the product and offered Joe the full £60,000 investment he was hoping for, but for the much heftier stake of 20% of the business. Joe jumped at the chance. I’m sure they themselves will become ‘tasty mates’ as well as having a lucrative business relationship."
        },
        {
            "heading": 3,
            "text": "Sealing the deal "
        },
        {
            "text": "As a massive lover of a beach holiday, just seeing Dave Weller’s brightly coloured beachwear products even before the man himself had entered the Den, my mind was transported to sunnier climes. If the prospect of a beach product wasn’t enough, imagine my excitement when Dave immediately mentioned the patented functionality of the sealable waterproof pocket within the swimwear!"
        },
        {
            "text": "As Dave explained more about the investment he was after for his company, Randy Cow, it turned out that the patent itself was owned by another company. This use of another company’s IP can be a really useful strategy, especially where saving time is important. A business may get its products or services to market more quickly by acquiring a  licence (link) to use existing IP, instead of re-inventing the wheel."
        },
        {
            "text": "The outlook is sunny"
        },
        {
            "text": "Dave's pitch had obviously got Touker Suleyman thinking:"
        },
        {
            "text": "While licensing IP from others can be a very useful business strategy it’s always worth thinking about how best to protect the IP assets already in the business. Touker’s advice got me thinking about the other types of IP rights Dave could look to protect: designs."
        },
        {
            "text": "It was another investment for Peter, who saw the potential in Randy Cow. He persuaded Touker to join him, bringing his manufacturing and fashion credentials to the business. The Dragons were happy to share the investment of £80,000 for 40% of the business."
        },
        {
            "text": "What a great episode! With its focus on friendship sweets and swimwear, I have high hopes that warmer weather is just around the corner."
        },
        {
            "text": "Did you enjoy this episode? Keep a look out for more upcoming editions as we follow the BBC Dragons' Den series."
        },
        {
            "text": "Disclaimer:"
        },
        {
            "text": "The purpose of the IPO's Dragons' Den IP blog is to help identify the IP in entrepreneurs’ pitches and highlight how IP works, or could work, in the real-life examples featured. IPO’s authorship of this blog does not constitute its endorsement or sponsorship of any products, individuals or businesses referenced within it."
        }
    ]
}