{
    "url": "https://mojdigital.blog.gov.uk/2024/02/22/evolution-of-communication-moj-voice-services/",
    "title": "Evolution of Communication: MoJ Voice Services",
    "authors": [
        "Roger Lockett"
    ],
    "categories": [
        "MoJ Voice Services"
    ],
    "pub_date": "2024-02-22T13:57:10+01:00",
    "content": [
        {
            "text": "A Look Back In Time"
        },
        {
            "text": "Alexander Graham Bell's 1876 telephone call marked a milestone in communication, pioneering the ability to converse over long distances using electricity. Fast forward 122 years to 1998 and my first IT job, and a desk phone with a fixed extension number was still my main means of communication. Since then, our methods of communication at work and at home have exploded. Today we have a suite of options available to choose from and the term ‘Unified Communications’ has been coined to describe the many communications channels used by businesses. Voice, conferencing, mobile phone, video, instant messaging, directory, chat, email, voicemail, fax (yes it still exists). Take your pick."
        },
        {
            "text": "What Is the MoJ Voice Service?"
        },
        {
            "text": "Never mind all those options, this blog is supposed to be about Voice Services at the Ministry of Justice. However, defining where one communication channel ends and another starts can be difficult in today’s landscape. MoJ's Voice Services enable communication between individuals in different locations, utilising telephone numbers for connection to public networks. They offer feature-rich functionalities like auto-attendant and call queues. Comparing Microsoft Teams and Teams Phone illustrates the blurred boundaries; while Teams allows calls within organisations, Teams Phone provides global connectivity via telephone numbers. Telephony remains crucial for MoJ's public facing services and contributes to Justice Digital's strategic aim of delivering swift access to justice. "
        },
        {
            "text": "Who Are the Voice Services Team?"
        },
        {
            "text": "The Voice & Video team has grown significantly over the last couple of years, from about 5 at the start of 2022 to over 50 at the end of 2023. That includes Service Owners, Product Managers, Operations Managers, Infrastructure Engineers, and Delivery Managers, enabling us to take control of all aspects of the products that make up the service. It’s a supportive and committed team with people from all sorts of backgrounds and parts of the country. It’s impressive to see how cohesive the team is having grown so quickly. Building an open and collaborative culture is a key aim for Justice Digital and it certainly feels like we’re doing that."
        },
        {
            "text": "MoJ Voice Services Today"
        },
        {
            "text": "The Voice Service delivers approximately 100,000 fixed telephony connections across around 900 MoJ sites, as well as about 70,000 mobile phone connections. Over the last year, we’ve also deployed about 12,000 Microsoft Teams Phone users. Also, part of Voice Services are PINPhone for prison in cell telephony and Esendex SMS messaging."
        },
        {
            "text": "Achievements So Far"
        },
        {
            "text": "Taking control of such a large, diverse estate has been a challenge for the growing Voice Team but one which they’ve approached with tenacity and skill. There have been real successes already, bringing tangible benefits for MoJ. We've streamlined suppliers from 30 to 7 and identified significant savings by canceling 17,000 unused connections.Teams Phone usage has surged, primarily via laptop deployment, modernising our Voice Products. We’re really focused on driving continuous improvement for all our products, knowing that designing, delivering, and maintaining sustainable core technology services underpins Justice Digital’s goals."
        },
        {
            "text": "What’s Next?"
        },
        {
            "text": "We're embarking on an exciting journey with the Evolve programme, starting with a new Contact Centre solution set to integrate into our Voice Service. This managed service will streamline eight different existing solutions. Additionally, we're revamping fixed telephony with modern tech for future readiness and replacing local telephony systems. In mobile, we're optimising contracts for maximum value and tightening security measures. To enhance efficiency, we're restructuring the team for a more product-focused approach. The team are all looking forward to tackling more challenges over the next few years."
        }
    ]
}