{
    "url": "https://nda.blog.gov.uk/its-never-too-late-for-a-career-in-nuclear/",
    "title": "It’s never too late for a career in nuclear",
    "authors": [
        "Dianne Roberts"
    ],
    "categories": [
        "Recruitment",
        "Recruitment",
        "Skills",
        "Uncategorized"
    ],
    "pub_date": "2024-02-22T10:34:29+00:00",
    "content": [
        {
            "text": "Dianne Roberts is a Safety Case Manager at Sellafield, part of the NDA group. She joined the nuclear industry after 30 successful years in the NHS."
        },
        {
            "text": "I was recently asked to share my experience of joining the nuclear industry as part of a new first-of-a-kind collaboration across all parts of the sector. Destination Nuclear is a campaign that’s bringing together government and private companies to help attract and recruit more people to fill skills gaps."
        },
        {
            "text": "Whether it’s supporting national defence, operating existing power stations, building new ones or delivering the nationally important work of the Nuclear Decommissioning Authority (NDA) group to decommission the UK’s earliest facilities, there’s a significant amount of work to be delivered in the decades ahead and that means more opportunities for a career in nuclear. In fact, it’s estimated that as many as 40,000 new roles will be available in the sector by 2030."
        },
        {
            "text": "If you’re on a train, listening to commercial radio or using social media over the next few weeks, you’ll probably see or hear the new campaign. Destination Nuclear’s message is simple – whatever you do, you can do nuclear."
        },
        {
            "text": "The industry has a proven track record of investing in personal development and thousands of careers have started in nuclear since the 1940s and 1950s. The NDA group alone invests more than £45 million each year in apprentice, graduate and PhD programmes. More than 1,000 people are following early career programmes and this year will see the intake of NDA group graduates double from 2023, with up to 120 new recruits joining us in September."
        },
        {
            "text": "However this new campaign is aimed at a different audience - people like me. Those further into their career, with experience working elsewhere and ready to try something different."
        },
        {
            "text": "I spent 30 successful years in the NHS as an administrator but I needed a new challenge when a safety case advisory role came up at Sellafield. Safety cases exist for all of our projects and facilities to ensure we think though the right way of doing things and maintain high standards of nuclear safety and radioactive waste management. At first, I was anxious about my lack of experience, but the many years I’d spent working in patient care and as a child protection secretary have proved to be advantageous."
        },
        {
            "text": "Sellafield and the wider NDA group is a major employer in West Cumbria and known locally, and potentially further afield, for providing good career opportunities. We have a unique and proud history, from the development of the UK nuclear industry to now employing more than 11,000 people on a 100-year project to transform the site for all generations that follow. We’re setting standards in high-hazard reduction and I’m hugely proud to be part of that."
        },
        {
            "text": "Mastering nuclear safety cases made for a steep learning curve, but being entrusted with such an important job was a wonderful feeling and I’ve since progressed and taken on different roles. Today I have more responsibility and help train the next generation of nuclear industry recruits."
        },
        {
            "text": "While I’ve taken on technical challenges, it’s a common myth that you have to be technically minded to work in the nuclear industry. There are more than 900 different types of role across the NDA group and we have opportunities from nuclear scientists to train drivers and environmental protectors to IT specialists. Some of the most in demand skills are in business areas such as procurement as well as project and programme management."
        },
        {
            "text": "There’s so much opportunity in the nuclear sector that I really hope this new campaign will encourage more people to look at what is available and consider a future in nuclear."
        },
        {
            "text": "Read Dianne’s story: Case Study Dianne Roberts (destinationnuclear.com)"
        },
        {
            "text": "A new website launched by the NDA group also brings together in one place all of the career opportunities available around the group to help sustainably, safely and securely decommission the UK’s nuclear facilities and provide specialist waste and transport capabilities. Find out more: ndagroup.careers"
        }
    ]
}