{
    "url": "https://vets.blog.gov.uk/2024/02/22/job-opportunity-project-lead-at-the-veterinary-medicines-directorate/",
    "title": "Job Opportunity: Project Lead at the Veterinary Medicines Directorate",
    "authors": [
        "Government Vets Blog Team"
    ],
    "categories": [
        "Government Veterinary Services",
        "Jobs and Experiences",
        "Professional development"
    ],
    "pub_date": "2024-02-22T16:00:10+00:00",
    "content": [
        {
            "text": "A new opportunity at the Veterinary Medicines Directorate might be just right for you!"
        },
        {
            "text": "Interested? Find out more below, and apply by Wednesday 6th March 2024"
        },
        {
            "text": "A twelve-month project leadership role engaging with private laboratories."
        },
        {
            "text": "The Veterinary Medicines Directorate (VMD) is part of the cross-government National Biosurveillance Network (NBN): a major initiative to pilot and improve surveillance for biological threats. A key focus of the NBN is facilitating the sharing of privately-held data with government, which we are piloting for data on antimicrobial resistance (AMR) in animals."
        },
        {
            "text": "AMR is a truly One Health issue, with resistant organisms able to transfer between animals and people, and resistance genes being transmissible between commensal and pathogenic bacteria. In the UK, we have well-established programmes of AMR surveillance in healthy food-producing animals at slaughter. However, the majority of testing for AMR in veterinary diagnostic submissions is performed by private veterinary laboratories and does not feed into governmental surveillance. This means our understanding of AMR in animals is limited, which affects our wider ability to assess AMR risks, and detect and respond to emerging threats."
        },
        {
            "text": "What would you be doing in this job?"
        },
        {
            "text": "This exciting new role will assume overall responsibility for successful delivery of this pilot, leading on engagement with private laboratories and the wider veterinary sector. You will ensure collaborative, two-way communication to understand barriers and possible motivations within private laboratories for this kind of data-sharing, while building on existing relationships in other areas of animal health. You will liaise with experts at the VMD and APHA and external partners within the NBN to ensure effective join-up across animal health sectors. You will also interface with the AMR team at APHA, and the Surveillance Intelligence Unit (SIU), to enable collation, verification, and analysis of external AMR data. You will be supported by a project manager."
        },
        {
            "text": "Benefits"
        },
        {
            "text": "Alongside your salary of £57,316, Veterinary Medicines Directorate contributes £15,475 towards you being a member of the Civil Service Defined Benefit Pension scheme."
        },
        {
            "text": "To find out more, please follow the link to the job vacancy on Civil Service Jobs."
        }
    ]
}