{
    "url": "https://defradigital.blog.gov.uk/2024/02/22/my-journey-on-the-civil-service-fast-stream-programme-and-beyond/",
    "title": "My journey on the Civil Service Fast Stream programme and beyond",
    "authors": [
        "Graham Dickinson"
    ],
    "categories": [
        "Defra digital",
        "Strategy"
    ],
    "pub_date": "2024-02-22T14:56:08+00:00",
    "content": [
        {
            "text": "Graham Dickinson reflects on his civil service journey, a journey that began with the Fast Stream in 2008, which then propelled him to a senior leadership role via the Civil Service Senior Leaders development programme."
        },
        {
            "text": "I began my civil service career on the Civil Service Fast Stream programme, in 2008, completing postings in the Ministry of Justice and the Office of the Public Guardian."
        },
        {
            "text": "I joined the Fast Stream because I was motivated by working in public service delivery and the tangible impact it has. The Fast Stream offered me the chance to gather a breadth and depth of experience quickly, doing something that felt really worthwhile."
        },
        {
            "text": "Before becoming a civil servant, I worked in a university research centre, studying how innovation works in the public sector. I worked alongside civil servants who were doing worthwhile and interesting things and concluded I wanted to be one of them too."
        },
        {
            "heading": 2,
            "text": "What I did next"
        },
        {
            "text": "Since completing the Fast Stream programme in 2012 I’ve enjoyed a wide variety of civil service roles and challenges, in different departments focusing on justice and the environment."
        },
        {
            "text": "I have had the chance to design, deliver and then run technology-based operations and digital services, including setting up a new digital operations function from scratch at HM Courts and Tribunals Service, as part of a major transformation programme."
        },
        {
            "text": "I joined Defra Digital Data and Technology, in the role of Chief Information Officer for the Environment Agency, in February 2023. I currently lead a team focused on developing and implementing digital strategy for the agency."
        },
        {
            "text": "A typical day in my current Defra role starts with a catch up with our team, talking through key topics for the week and checking how everyone is. The day could involve boards for our key programmes or services, sessions to plan our transformation approach or to work out how we can deliver a particular service need."
        },
        {
            "text": "I spend as much time as possible out and about with my Environment Agency colleagues in the office or field, to make sure I’m in touch with their perspective and user needs. That ultimately drives everything I do."
        },
        {
            "heading": 2,
            "text": "How civil service development programmes have helped me"
        },
        {
            "text": "The Fast Stream helped get me to this point in my career today by giving me a huge breadth and depth of experience in a relatively short space of time. Being trusted and given the responsibility to make a difference in such a wide variety of roles has made a huge difference too. There was never any holding back from my managers in the opportunities I was given."
        },
        {
            "text": "The Civil Service Senior Leaders programme was different to the Fast Stream and probably the best development programme I’ve ever had the opportunity to take part in. It’s a cross-Government development scheme for high potential deputy directors who have the potential to progress to the most senior roles in the Civil Service."
        },
        {
            "text": "On that programme I grew to be more comfortable in myself as a leader and what I hoped I could offer, I learned practical skills, and had the space and opportunity to get into the latest ideas and try them out with the group. Perhaps best were the many supportive and inspiring conversations we had as a cohort and still do, catching up for breakfast recently, for example."
        },
        {
            "text": "The culture was the best thing about the Senior Leaders programme. The scheme liberates you to develop your own leadership approach, rather than being prescriptive about what that should be. Getting on to the scheme was difficult though – it took me a couple of attempts, but it was absolutely worth it."
        },
        {
            "heading": 2,
            "text": "The most important lessons I have taken from my experiences on Civil Service talent programmes are….."
        },
        {
            "text": "They have been a brilliant development opportunity that I am grateful to have been able to take part in. I have learned that sharing the journey is invaluable, that there is always room to keep exploring, and that developing and sticking to your values is the key."
        },
        {
            "text": "My message to anyone thinking of applying to a Civil Service talent programme is do it! Even if you are not successful at the first attempt, ask your HR team for support, I was fortunate to be offered some interview coaching which really changed the way I saw what I hoped I could offer and laid the foundation for my time on the scheme."
        }
    ]
}