{
    "url": "https://insidehmcts.blog.gov.uk/2024/02/22/rebalancing-our-operational-priorities/",
    "title": "Rebalancing our operational priorities",
    "authors": [
        "Nick Goodwin - Chief Executive, HMCTS"
    ],
    "categories": [
        "Civil",
        "Court and tribunal reform",
        "Crime",
        "Digital services",
        "Family",
        "Tribunals"
    ],
    "pub_date": "2024-02-22T09:33:58+00:00",
    "content": [
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "text": "Working alongside our justice partners, we’ve made significant progress towards the vision for reform we set out in 2016. Our core principles – to be just, proportionate and accessible – have always underpinned our work."
        },
        {
            "text": "We’ve continued to successfully modernise 14 services and have received over 2.4 million digital applications since 2019. Satisfaction scores from those using our services remain high."
        },
        {
            "text": "We’ve installed video technology to the majority of courtrooms, improved the user experience by creating five new service centres and introduced Common Platform to all criminal courts so that case information can be managed and shared more effectively."
        },
        {
            "text": "I’m incredibly proud of what we’ve achieved together and the positive outcomes for our users. Our priority now is to ensure a stable operational environment in which we continue to improve at a steady pace."
        },
        {
            "heading": 2,
            "text": "Priorities and plans for the year ahead\n"
        },
        {
            "text": "We’ll continue to:"
        },
        {
            "text": "We’ve looked at our organisational capacity and pressures on our operations and heard feedback from our staff and partners. We’ve taken account of the challenging operating environment. We’ve considered wider pressures, such as long-lasting impacts of the pandemic, number of outstanding cases and the rising cost of living – all affect us as an organisation."
        },
        {
            "text": "As a result, we now need to adjust our plans, particularly for some aspects of the Reform Programme, which was originally scoped at a time when caseloads were lower. The choices we’re making now will maximise efficiency and functionality of our technology."
        },
        {
            "text": "This will help us to provide a more consistent and reliable service to those seeking access to justice through our courts and tribunals, as well as stabilise the experience for all those who use our systems."
        },
        {
            "heading": 2,
            "text": "Rebalancing our approach "
        },
        {
            "text": "To ease the pressure on the business and to ensure continued success, we are extending the overall programme to March 2025. And to ensure the stability we need, we’ll no longer deliver some parts of it as we had planned. This will allow us to get the current systems and processes to perform to their maximum capacity and ability before adding more."
        },
        {
            "text": "We also need to spend more time making sure that our processes and ways of working align fully with the technological change. We cannot do one without the other and we have seen the consequences of getting this wrong in the past."
        },
        {
            "text": "In revising our plans, we have the support of the Lord Chancellor, the Lady Chief Justice and the Senior President of Tribunals."
        },
        {
            "heading": 2,
            "text": "Revising the remaining scope of Common Platform "
        },
        {
            "text": "We’ve revised our plans for delivering additional functionality in Common Platform, the principal case management system in the criminal courts. The platform has received over 1.3 million cases since going live in 2020."
        },
        {
            "text": "We will focus on fixing and enhancing the existing system, improving stability and the experience of those who use it."
        },
        {
            "text": "We’ll not proceed with all aspects of the two releases known as ‘releases 2 and 3’ but will continue with some standalone elements which have already been built, specifically the introduction of digital cracked and ineffective trial forms and the functionality to allow judges to validate sentences."
        },
        {
            "text": "We’ll retain the Crown Court Digital Case System (known as DCS), identifying ways we can enhance it in future, while making sure it works effectively alongside Common Platform."
        },
        {
            "heading": 2,
            "text": "Extending development in the civil, family and tribunal programme to March 2025"
        },
        {
            "text": "Reforms in Civil and Family Private Law are the largest and most complex in the programme. As a result, we will extend the completion date for all development for the overall programme from March 2024 to March 2025. Implementation activity will continue throughout 2025 for civil reform."
        },
        {
            "text": "Our plans still include digitising warrants of control to enforce County Court Judgments. They’ll be issued using the new Online Civil Money Claims service, similar to the legacy Money Claims On Line service. All other civil enforcement changes will be removed from our plans."
        },
        {
            "text": "These changes will allow us to get the technology right, to integrate systems, and give ourselves and our partners the time needed to adjust to new ways of working."
        },
        {
            "heading": 2,
            "text": "Improving our estate"
        },
        {
            "text": "We’re making progress on a number of significant property developments. A newly refurbished site in Leeds includes new employment tribunal rooms and construction is underway to create Business and Property Court hearing rooms."
        },
        {
            "text": "The construction of the City of London’s state-of-the art courthouse, comprising civil, magistrates’ and Crown courtrooms, is also well underway."
        },
        {
            "text": "Funding of £220 million to enhance our maintenance programme between 2023 and 2025 is enabling us to deliver more than 200 improvement projects across England and Wales. This will make a difference to the resilience, reliability, accessibility, comfort and environmental impact of our court and tribunal buildings."
        },
        {
            "text": "Last week we announced the extension of 20 Nightingale courtrooms to increase capacity in our estate where operationally necessary."
        },
        {
            "text": "While challenges remain, we’re making progress and reducing the risk of site closures while building resilience into the estate."
        },
        {
            "heading": 2,
            "text": "Preparing for the future"
        },
        {
            "text": "For all jurisdictions, we’ll set out more details about plans for the next year in follow-up blogs to be published over the coming week."
        },
        {
            "text": "I’m confident that in making these changes to our operations, we’ve created a solid foundation for the future of the justice system. We’ll continue to work together to change and improve. We’ll not stand still as we strive to complete reform, perform at our best and prepare our services for the next generation."
        },
        {
            "text": "Our dedicated staff and many partners across the justice system all have a role to play in this and I’m grateful for your continued support."
        },
        {
            "text": " "
        },
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "heading": 1,
            "text": "Ail-gydbwyso ein blaenoriaethau gweithredol"
        },
        {
            "text": "Gan weithio ochr yn ochr â'n partneriaid cyfiawnder, rydym wedi gwneud cynnydd sylweddol tuag at y weledigaeth ar gyfer diwygio a nodwyd gennym yn 2016. Mae ein hegwyddorion craidd - i fod yn gyfiawn, yn gymesur ac yn hygyrch – bob amser wedi bod yn sail i'n gwaith."
        },
        {
            "text": "Rydym wedi llwyddo parhau i foderneiddio 14 gwasanaeth ac wedi derbyn dros 2.4 miliwn o gymwysiadau digidol ers 2019.  Mae sgôr boddhad ein defnyddwyr yn parhau i fod yn uchel."
        },
        {
            "text": "Rydym wedi gosod technoleg fideo i'r mwyafrif o ystafelloedd llys, wedi gwella profiad y defnyddiwr trwy greu pum canolfan wasanaeth newydd a chyflwyno’r Platfform Cyffredin i bob llys troseddol fel y gellir rheoli a rhannu gwybodaeth achos yn fwy effeithiol."
        },
        {
            "text": "Rwy'n hynod falch o'r hyn yr ydym wedi'i gyflawni gyda'n gilydd a'r canlyniadau cadarnhaol i'n defnyddwyr. Ein blaenoriaeth nawr yw sicrhau amgylchedd gweithredol sefydlog lle rydym yn parhau i wella ar gyflymder cyson."
        },
        {
            "heading": 2,
            "text": "Blaenoriaethau a chynlluniau ar gyfer y flwyddyn i ddod\n"
        },
        {
            "text": "Byddwn yn parhau i:"
        },
        {
            "text": "Rydym wedi edrych ar ein capasiti a'n pwysau sefydliadol ar ein gweithrediadau ac wedi clywed adborth gan ein staff a'n partneriaid. Rydym wedi ystyried yr amgylchedd gweithredol heriol. Rydym wedi ystyried pwysau ehangach, fel effeithiau hirhoedlog y pandemig, nifer yr achosion sydd heb eu datrys a chostau byw cynyddol - i gyd yn effeithio arnom ni fel sefydliad."
        },
        {
            "text": "O ganlyniad, mae angen i ni nawr addasu ein cynlluniau, yn enwedig ar gyfer rhai agweddau ar y Rhaglen Ddiwygio, a gafodd ei chreu’n wreiddiol ar adeg pan oedd llwythi achosion yn is. Bydd y dewisiadau rydyn ni'n eu gwneud nawr yn sicrhau'r effeithlonrwydd a'r ymarferoldeb mwyaf posibl o'n technoleg."
        },
        {
            "text": "Bydd hyn yn ein helpu i ddarparu gwasanaeth mwy cyson a dibynadwy i'r rhai sy'n ceisio mynediad at gyfiawnder drwy ein llysoedd a'n tribiwnlysoedd, yn ogystal â sefydlogi'r profiad i bawb sy'n defnyddio ein systemau."
        },
        {
            "heading": 2,
            "text": "Ail-gydbwyso ein dull gweithredu "
        },
        {
            "text": "Er mwyn lleddfu'r pwysau ar y busnes ac i sicrhau llwyddiant parhaus, rydym yn ymestyn y rhaglen gyffredinol hyd at fis Mawrth 2025. Ac er mwyn sicrhau'r sefydlogrwydd sydd ei angen arnom, ni fyddwn bellach yn darparu rhai rhannau ohono fel yr oeddem wedi'i fwriadu. Bydd hyn yn ein galluogi i gael y systemau a'r prosesau cyfredol i berfformio i'w capasiti a'u gallu mwyaf posibl cyn ychwanegu mwy."
        },
        {
            "text": "Mae angen i ni hefyd dreulio mwy o amser yn sicrhau bod ein prosesau a'n ffyrdd o weithio'n cyd-fynd yn llawn â'r newid technolegol. Ni allwn wneud un heb y llall ac rydym wedi gweld canlyniadau cael hyn yn anghywir yn y gorffennol."
        },
        {
            "text": "Wrth adolygu ein trefniadau, mae gennym gefnogaeth yr Arglwydd Ganghellor, yr Arglwyddes Brif Ustus ac Uwch Lywydd y Tribiwnlysoedd."
        },
        {
            "heading": 2,
            "text": "Adolygu’r cwmpas sy'n weddill o’r Platfform Cyffredin "
        },
        {
            "text": "Rydym wedi diwygio ein cynlluniau ar gyfer cyflawni swyddogaethau ychwanegol yn y Platfform Cyffredin, y prif system rheoli achosion yn y llysoedd troseddol. Mae'r platfform wedi derbyn dros 1.3 miliwn o achosion ers mynd yn fyw yn 2020."
        },
        {
            "text": "Byddwn yn canolbwyntio ar sefydlogi a gwella'r system bresennol yn ogystal â gwella sefydlogrwydd a phrofiad y rhai sy'n ei defnyddio."
        },
        {
            "text": "Ni fyddwn yn bwrw ymlaen â phob agwedd o'r ddau ddatganiad a elwir yn 'ddatganiadau 2 a 3' ond byddwn yn parhau gyda rhai elfennau annibynnol sydd eisoes wedi'u hadeiladu, yn benodol cyflwyno ffurflenni digidol treialon chwâl ac aneffeithiol ac adnodd i ganiatáu i farnwyr ddilysu dedfrydau."
        },
        {
            "text": "Byddwn yn cadw System Ddigidol Achosion Llys y Goron (a elwir yn DCS), gan nodi ffyrdd y gallwn ei gwella yn y dyfodol, a sicrhau ei bod yn gweithio'n effeithiol ochr yn ochr â’r Platfform Cyffredin."
        },
        {
            "heading": 2,
            "text": "Ymestyn datblygiad yn y rhaglen sifil, teulu a thribiwnlysoedd hyd at fis Mawrth 2025"
        },
        {
            "text": "Diwygiadau mewn Cyfraith Deulu Sifil a Phreifat yw'r diwygiadau mwyaf a’r rhai mwyaf cymhleth yn y rhaglen. O ganlyniad, byddwn yn ymestyn y dyddiad cwblhau ar gyfer pob datblygiad ar gyfer y rhaglen gyffredinol o fis Mawrth 2024 i fis Mawrth 2025. Bydd y gweithgaredd gweithredol ar gyfer diwygio’r maes sifil yn parhau drwy gydol 2025."
        },
        {
            "text": "Mae ein trefniadau yn dal i gynnwys digideiddio gwarantau rheoli i orfodi Dyfarniadau Llys Sirol. Byddant yn cael eu cyhoeddi gan ddefnyddio'r gwasanaeth Hawliadau am Arian Sifil Ar-lein newydd, sy’n debyg i'r gwasanaeth Hawliadau am Arian Etifeddiaeth Ar-lein. Bydd yr holl newidiadau gorfodi sifil eraill yn cael eu dileu o'n cynlluniau."
        },
        {
            "text": "Bydd y newidiadau hyn yn ein galluogi i gael y dechnoleg yn iawn, integreiddio systemau, a rhoi'r amser sydd ei angen arnom i ni a'n partneriaid addasu i ffyrdd newydd o weithio."
        },
        {
            "heading": 2,
            "text": "Gwella ein hystad"
        },
        {
            "text": "Rydym yn gwneud cynnydd ar nifer o ddatblygiadau eiddo sylweddol. Mae safle sydd newydd ei adnewyddu yn Leeds yn cynnwys ystafelloedd tribiwnlys cyflogaeth newydd ac mae gwaith adeiladu ar y gweill i greu ystafelloedd gwrandawiadau i’r Llys Busnes ac Eiddo."
        },
        {
            "text": "Mae'r gwaith o adeiladu llys o'r radd flaenaf yn Ninas Llundain, sy'n cynnwys ystafelloedd ar gyfer y Llys Sifil, Llys Ynadon a Llys y Goron, hefyd yn mynd rhagddo'n dda."
        },
        {
            "text": "Mae cyllid o £220 miliwn i wella ein rhaglen gynnal a chadw rhwng 2023 a 2025 yn ein galluogi i gyflawni mwy na 200 o brosiectau gwella ledled Cymru a Lloegr. Bydd hyn yn gwneud gwahaniaeth i wytnwch, dibynadwyedd, hygyrchedd, cysur ac effaith amgylcheddol ein hadeiladau llys a thribiwnlys."
        },
        {
            "text": "Yr wythnos diwethaf fe wnaethom gyhoeddi y bydd 20 o ystafelloedd llys Nightingale yn cael eu hymestyn i gynyddu capasiti yn ein hystad lle bo angen gweithredol am hynny."
        },
        {
            "text": "Er bod heriau'n parhau, rydym yn gwneud cynnydd ac yn lleihau'r risg o gau safleoedd tra'n meithrin gwytnwch yn yr ystad."
        },
        {
            "heading": 2,
            "text": "Paratoi ar gyfer y dyfodol"
        },
        {
            "text": "Ar gyfer pob awdurdodaeth, byddwn yn nodi mwy o fanylion am gynlluniau ar gyfer y flwyddyn nesaf mewn blogiau dilynol i'w cyhoeddi dros yr wythnos nesaf."
        },
        {
            "text": "Rwy'n hyderus, wrth wneud y newidiadau hyn i'n gweithrediadau, ein bod wedi creu sylfaen gadarn ar gyfer dyfodol y system gyfiawnder. Byddwn yn parhau i weithio gyda'n gilydd i newid a gwella. Ni fyddwn yn sefyll yn llonydd wrth i ni ymdrechu i gwblhau’r rhaglen ddiwygio, perfformio ar ein gorau a pharatoi ein gwasanaethau ar gyfer y genhedlaeth nesaf."
        },
        {
            "text": "Mae gan ein staff ymroddedig a llawer o bartneriaid ar draws y system gyfiawnder i gyd rôl i'w chwarae yn hyn ac rwy'n ddiolchgar am eich cefnogaeth barhaus."
        }
    ]
}