{
    "url": "https://naturalengland.blog.gov.uk/2024/02/22/supporting-farmers-in-sustainable-food-production-while-enhancing-the-natural-environment/",
    "title": "Supporting farmers in sustainable food production while enhancing the natural environment",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Farming"
    ],
    "pub_date": "2024-02-22T16:03:59+00:00",
    "content": [
        {
            "text": "By Geoff Sansome, Head of Agriculture for Natural England"
        },
        {
            "text": "Returning home from this week’s NFU Conference I am reflecting on how it always represents a significant moment for farming in England and Wales."
        },
        {
            "text": "Even more significant this year for two reasons; it marked the end of Minette Batters’ Presidency and strong leadership and secondly, for the first time in many years the Prime Minister spoke."
        },
        {
            "text": "The theme was “British Food, what plan for the future” and it had a strong focus on future policies in support of food production."
        },
        {
            "text": "The Prime Minister committed to enhancing the management payments for the Sustainable Farming Incentive (SFI) and also rolling these across to Countryside Stewardship Mid-Tier agreements, as well as a range of productivity related grants to support food production."
        },
        {
            "text": "It’s clear that many farmers are still finding their way through the transition but there was a clear acceptance of the need to respond to Environmental Land Management (ELM) incentives now on offer and a willingness to do so. As Minette set out in her opening address, “Food production and the environment are two sides of the same coin”."
        },
        {
            "text": "Such a shift in support policy is bound to produce uncertainty and significant changes for what are essentially thousands of family-run farm businesses, like my own in Worcestershire and it was good to hear the mental health challenges of change being acknowledged so openly."
        },
        {
            "text": "It is more important than ever that we look out for each other and NE farm advice staff, many of whom are also from farming families, have been taking part in mental health awareness training delivered by the Farming Community Network for some years now. Likewise, there were concerns addressed around some of the potential unintended consequences of the transition, such as impacts on land tenure, farm profitability and impacts on food production."
        },
        {
            "text": "But there was a real sense of farmers wishing to make the changes work and an emphasis on the fact that farmers can provide the solutions to the demands of both food production and the environment."
        },
        {
            "text": "Finding the balance of that within an individual farming business is key but I was reassured that for farmers in England ELM provides a choice and flexibility, as opposed to more blunt mechanisms that we may have seen in the past."
        },
        {
            "text": "At Natural England we recognise the enormity of this change for farming families but also the opportunities this can bring. Our 500 farm and land management advisers work with over 35,000 farmers on a daily basis helping them consider, manage and develop environmental initiatives on their farms, for the benefit of our natural environment, the wider public and the sustainability of the natural resources and systems that underpin profitable farms."
        },
        {
            "text": "We have this year alone helped 507 farms to enter Higher Tier Countryside Stewardship Schemes and supported 28 Landscape Recovery Schemes. Both of these will bring public payments for work that help meets the Government’s statutory targets for nature but as importantly help farmers enter new environmental markets."
        },
        {
            "text": "Only by working together in this kind of partnership can we benefit from each other's areas of expertise and achieve our shared ambition of thriving farm businesses delivering sustainable food production whilst maintaining and enhancing our natural environment, thereby delivering Environmental Improvement Plan commitments."
        },
        {
            "text": "We remain committed to this ambition and will constantly focus our efforts on making those local and trusted relations work as well as possible."
        }
    ]
}