{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2021/06/23/gse-role-modelling-its-ok-not-to-be-ok/",
    "title": "GSE Role Modelling: It's OK not to be OK",
    "authors": [
        "Kate"
    ],
    "categories": [
        "Blog Series",
        "Diversity & Inclusion",
        "Guest Blog",
        "Our People & Deep Dives",
        "Role Model Series"
    ],
    "pub_date": "2021-06-23T11:21:04+01:00",
    "content": [
        {
            "text": "When you imagine the behaviours and traits of a role model, you may think of someone who is strong, courageous, compassionate and driven; someone who everyone aspires to be.  These are great qualities, and what we might naturally expect to see from someone we deem to be a ‘role model’."
        },
        {
            "text": "But sometimes being a role model is about giving those around you the confidence to deal with the negative.  You may feel that because others view you as a ‘positive’ role model you are unable to speak up, rock the boat or challenge poor or inappropriate behaviours.  But if you don’t, you are showing you tolerate good results but bad behaviour, and what you tolerate becomes the norm."
        },
        {
            "text": "For example, in an experiment on how bystanders react to an incident, the number of other witnesses affected people’s behaviour.  When they thought they were the only witness, 85% of the participants reacted, but when there were five witnesses, only 31% intervened.  Being a role model includes the ability to empower others to speak up or act when things are not right. This isn’t saying you have to be a superhero, but when something is off, you want others to know they have the power to challenge and change it."
        },
        {
            "text": "You can also empower others to have the confidence to speak up when in need of support or help.  Just because you are a role model does not mean you must always show a façade of strength and resilience.  Anything else is not weakness, it is human.  Empowering others to seek support when they need to can make the difference between a niggle becoming a full-blown issue or being able to put reasonable adjustments in place to support all parties involved.  Everyone can have a bad day, be stressed or experience mental health issues, but that doesn’t stop you being a role model.  Recent events and initiatives such as Stress Awareness Month and Mental Health Awareness week illustrate the importance of being honest and open about how we are feeling – whether good or bad, role model or otherwise."
        },
        {
            "text": "If others are able to see you as an authentic and genuine role model, they will recognise it is also OK to be honest with what they are dealing with.  Being a positive role model means working with the good as well as dealing with the bad – it is OK not to be OK."
        },
        {
            "text": "Sign up to the GSE blog to receive an email when a new blog is published and keep up to date with the work of the GSE profession."
        }
    ]
}