{
    "url": "https://hmlandregistry.blog.gov.uk/2021/06/23/increasing-our-pace-from-the-start/",
    "title": "Increasing our pace from the start",
    "authors": [
        "Jamie Winch, Early Engagement Lead, Local Land Charges Programme"
    ],
    "categories": [
        "Local Land Charges"
    ],
    "pub_date": "2021-06-23T11:49:36+01:00",
    "content": [
        {
            "heading": 2,
            "text": "Engaging with local authorities"
        },
        {
            "text": "The Local Land Charges (LLC) Early Engagement Team plays an important role promoting the benefits of the LLC service. As well as talking to local authorities and stakeholders in England and Wales, the team manages all the stages of migration preparation."
        },
        {
            "text": "Work begins from the first virtual handshake with the local authority. The team advises, guides and makes sure local authorities have access to all the tools and resources available. Completing the service assessment is the first stage of the migration process. The next step is the signing of the terms of collaboration agreement. This agreement provides us with the authority to access the authority’s LLC data and demonstrates a commitment to migrate the service to the central LLC Register."
        },
        {
            "text": "With the help of our business analysts and technical experts, we advise the authority if there any data issues. We also discuss the terms and conditions of migration and how we work together, as well as provide details about any partner involvement."
        },
        {
            "text": "Gerard Kamath, Legal and Governance Business Manager for London Borough of Lambeth, said:"
        },
        {
            "text": "Since the migration of Lambeth’s data in 2019, the whole process has become considerably quicker and simpler. We’ve applied lessons learned from each migration to develop best practices and created new tools, such as our Migration Helper, to make the whole process smoother."
        },
        {
            "text": "Managing the data migration pipeline is an important role for us, as it creates confidence that local authorities can successfully migrate their service. Land and property are the nation’s greatest store of wealth and the backbone of our economy. Through the digital LLC Register we are enabling buyers and conveyancers to obtain vital property information instantly."
        },
        {
            "text": "The recent launch of the transition payments scheme offers local authorities additional money to address practical issues, which may hinder timely migration. Its introduction has encouraged many to request earlier migration dates, which is good for pipeline planning. Seventy-five per cent of authorities who are at the early stage of migration have completed their service assessment. This assessment enables our team to calculate the size of an authority’s service and quality of their data."
        },
        {
            "heading": 2,
            "text": "Engagement in a digital world"
        },
        {
            "text": "The way we interact has changed because of the pandemic, and that has required us to adjust the way we work. Our traditional face-to-face meetings with local authorities moved online last year. Building trust and rapport is key."
        },
        {
            "text": "Before 2020 we met with local authorities face-to-face, building relationships and addressing any migration concerns. The shift to a digital approach has meant that while handshakes are off the table, the flexibility of remote meetings has allowed multiple meetings with local authorities each day. This method of engagement has strengthened our working relationships and enabled even greater productivity. Over the last year we moved eight local authority services onto our LLC Register. Five of these were in the last two months."
        },
        {
            "text": "Following the successful introduction of the Local Land Charges (Fees) (Wales) Rules 2021, my team has started working with the Welsh local authorities to begin their migration journey."
        },
        {
            "heading": 2,
            "text": "Giving support all the way"
        },
        {
            "text": "As a team and programme, we are working hard to accelerate the number and pace of local authority migrations. Using insight gathered after each migration we’ve revised how we engage with them. This ensures their team and ours understand the different roles each undertakes, and benefit from best practice learning captured during previous migrations. Find out what this involved on the Migration Hub."
        },
        {
            "heading": 2,
            "text": "A clear roadmap to a timely delivery"
        },
        {
            "text": "Our ambition is to complete all migrations in England and Wales by 2025, through a regional cluster approach. This is allowing local authorities to support each other, share lessons learned and collaborate. Last December we advised all local authorities of their migration date to allow this process to begin."
        },
        {
            "text": "This is an exciting time for the programme as the pace of delivery increases and workloads broaden. With every local authority migration, we come closer to realising the full benefits of a central, digital LLC Register. When fully populated the LLC Register will transform the way property buyers in England and Wales access this information and make it simpler and quicker for everyone."
        }
    ]
}