{
    "url": "https://apprenticeships.blog.gov.uk/2021/06/23/international-women-in-engineering-day-2021/",
    "title": "International Women in Engineering Day 2021",
    "authors": [
        "Ruth Ginever",
        "Megan Foster"
    ],
    "categories": [
        "Apprentice panel",
        "Route Panel"
    ],
    "pub_date": "2021-06-23T05:21:36+01:00",
    "content": [
        {
            "text": "Today is International Women in Engineering Day. It’s a day where we celebrate the amazing work of women within the engineering sector."
        },
        {
            "text": "According to the Engineering UK 2018 report, only 12% of all engineers in the UK are women. We want to see far more women taking STEM apprenticeships. Apprenticeships offer a great pathway into engineering for everyone."
        },
        {
            "text": "We spoke to Ruth Ginever, who is Chief of Industrialisation at Rolls Royce and a member of our engineering and manufacturing route panel. And Megan Foster, who is a level 6 civil engineering apprentice and member of our apprentice panel."
        },
        {
            "heading": 2,
            "text": "Why are you passionate about engineering? "
        },
        {
            "text": "Megan: "
        },
        {
            "text": "For me, the moment I realised I wanted to pursue a career in engineering was when I was about 15 or 16. I had secured an eight-week work placement on a project happening in my town. It was to construct a new road leading from the motorway into the town. I had not realised at the time exactly how much this would make a difference."
        },
        {
            "text": "I spent eight weeks with the engineers, seeing them move and excavate soil, work around utilities and change these complex drawings into something more. I had the opportunity to see how this road was going to positively impact our town, reduce congestion and make it easier for people to travel around. I wanted to be a part of being able to make that change. It was then that I realised engineering was the industry for me."
        },
        {
            "text": "With engineering, no two days are the same. So many things can have an impact on the project you’re working on, and I think that’s what makes it interesting. There is always going to be a new challenge."
        },
        {
            "text": "Ruth:"
        },
        {
            "text": "When I was 14 years old, I visited a drinks manufacturing factory as part of a French exchange trip. I found the environment and the automation fascinating. I went on to arrange work experience at several manufacturing companies, including Boots and a small automation company."
        },
        {
            "text": "I found all these experiences very interesting. To be honest, I didn’t relate the experiences I had were a form of ‘engineering’ until I was invited to a WISE course, which aimed to introduce girls studying physics and maths A levels to engineering. Without this insight, I would have probably studied chemistry at university as it was my strongest A level subject."
        },
        {
            "text": "Engineering, with its strong practical, real-world problem-solving skills, instantly appealed to me. I think I was very lucky to have the support of my parents in developing what I wanted to do with my career."
        },
        {
            "heading": 2,
            "text": "How do apprenticeships help you and your sector? "
        },
        {
            "text": "Ruth:"
        },
        {
            "text": "I have been involved with apprentices and graduate programmes for several years and it has been a very rewarding experience. You get to see young people grow from their interview to getting their first permanent roles in the company and take career moves after that."
        },
        {
            "text": "Apprenticeships are a great way of getting started in engineering and manufacturing careers and they can help attract more women if we can get the publicity and marketing right."
        },
        {
            "text": "The ‘profile’ of apprenticeships is really improving, particularly the degree level opportunities, where apprentices study at university and complete work placements in parallel. People who have completed these degree apprenticeships are extremely good members of the team as they have effectively done four years on-the-job training and have great career growth opportunities. They are invaluable to the business."
        },
        {
            "text": "Megan:"
        },
        {
            "text": "I come from a background where higher education is not common due to grades or many other factors. I have seen the benefits on how apprenticeships can help you go from a level 2 or 3, all the way to a level 6 or 7."
        },
        {
            "text": "As part of my apprenticeship, I have been fortunate enough to give several talks and presentations. From women in engineering, school talks and speaking at the WorldSkills show. It has helped me with presenting and having the confidence to speak in front of large groups. I think this is something I never considered when joining my apprenticeship but that I have enjoyed the most. It’s given me a chance to push me out of my comfort zone and influence others."
        },
        {
            "text": "I have also won a Kier star award. These are given once every quarter. While this may not have seemed a big deal to many, it really stood out for me! I have constantly doubted whether I am good enough for this industry. I’ve constantly questioned if I deserved my place on the apprenticeship. Winning the award gave me a great sense of achievement and made me realise I can do this! But most of all I do deserve it!"
        },
        {
            "heading": 2,
            "text": "The theme for this year’s Women in Engineering Day is ‘engineering heroes’; who is your engineering hero? "
        },
        {
            "text": "Ruth:"
        },
        {
            "text": "I’m a very proud manufacturing engineer."
        },
        {
            "text": "The heroes in manufacturing engineering are the women and men who work extremely hard and creatively to turn product designs into reality, into real products which you can touch! Products which function safely as designed, that can be made repeatedly, at the right cost, to the right rate and are delivered on time to our customers! My career has been inspired by meeting many, many dedicated people who work tireless to make all of this happen."
        },
        {
            "text": "Megan:"
        },
        {
            "text": "My engineering hero is a young female engineer called Hannah Grainger. I was fortunate enough to work with Hannah as my mentor when I first joined my current apprenticeship. She has worked on some of the biggest projects in this country."
        },
        {
            "text": "Hannah mentored me for a few months and always offered me the help I needed to get the most out of my apprenticeship. She always tried to give me the best advice. If she did not know the answer, she knew someone who did! She just wanted to help and be the best influence she could be. I felt very lucky to have a role model like her when entering my apprenticeship."
        }
    ]
}