{
    "url": "https://gott.blog.gov.uk/2021/06/23/knowledge-assets-launch-event/",
    "title": "Knowledge Assets Launch Event",
    "authors": [
        "Hayley Goldsbrough"
    ],
    "categories": [
        "Department for Business Energy and Industrial Strategy"
    ],
    "pub_date": "2021-06-23T15:45:08+01:00",
    "content": [
        {
            "text": "The Knowledge Assets team recently held a digital launch event to introduce their ambitious programme of work to a cross-Whitehall audience. We welcomed a host of expert speakers, including:"
        },
        {
            "text": "This was an opportunity to welcome this work to the Department for Business, Energy and Industrial Strategy (BEIS), share our priorities and plans for the future of the programme, and showcase some interesting case studies from the public sector."
        },
        {
            "text": "The host of expert speakers can be seen above as well as the agenda for the session "
        },
        {
            "text": "We were delighted that Minister Solloway was able to join us to launch the work. She shared her vision for the future: that there is great potential for the UK as the government starts to step up its approach to knowledge asset management. She detailed the launch of a new public sector tech-transfer unit as well as a new fund to support this work. This unit will become a centre of excellence for knowledge asset management, bringing together different public sector champions and supporting the work across the board."
        },
        {
            "text": "We also heard from Dr Penny Owen who described a range of the National Physical Laboratory’s (NPL) cutting-edge technologies, the challenges in taking them forward and how a strategy can help address those barriers. These technologies include a graphene-based sensor that can detect COVID-19, an ion-trap based quantum processor that can produce atomic clocks and quantum computers, and a thermal imaging device which could revolutionise the identification and prevention of diabetic foot ulcers."
        },
        {
            "text": "Dr Owen said “Public sector organisations like NPL have a wealth of knowledge-based assets; untapped opportunities that could be applied to solving challenges like preventable amputations or enabling the UK to lead in quantum computing. We need to do more than manage these, we need to develop and exploit them fully.” This directly aligns with the three principles to knowledge asset management in our draft guidance: identify, protect, exploit."
        },
        {
            "text": "Dr Mackintosh shared his motivation for the project; he had seen how powerful the broader innovation ecosystems around universities have become over the past 20 years, how companies deal with ‘non-strategic’ opportunities and how much capability and expertise there is within government departments. As the Mackintosh report details, there is estimated to be over £100bn in government knowledge assets, so even a modest increase in the return would generate huge benefits for the UK."
        },
        {
            "text": "Dr Mackintosh spoke of the vision for this initiative being government-wide, where potential can be found everywhere. He shared an example about The National Archives (TNA), which has world-leading expertise in digitizing archival material and has generated valuable revenues for its open-access activities by sharing that expertise with the United Arab Emirates. TNA provided high-level guidance and partnered with a UK SME to deliver the project; thereby also helping UK exports. Dr Mackintosh described this as an exciting shift in attitude: an organization is generating valuable knowledge assets as a by-product of being very good at what they do, and subsequently making broader use of this."
        },
        {
            "text": "This was a fantastic opportunity to look forward at what is to come as well as celebrating some of the brilliant knowledge asset successes that have already happened. An example discussed at the event was about how Transport for London (TfL) has used both commercial and open approaches to generate a range of financial, economic, and social benefits from their knowledge assets. TfL release a significant amount of data, including bus and tube timetables and disruptions into the public domain for free. This gave rise to a host of travel apps - such as Citymapper - which are used by 42% of Londoners and the basic version of them is free to use. Because of their popularity, it was estimated in 2017 that TfL is generating economic benefits of up to £130 million by releasing their data in this format. It has improved access to public service, reduced journey times for passengers, grown London’s economy and the apps provide new data to TfL. A brilliant example of a public sector identifying something it held as having intrinsic value beyond their organisation and realising a range of benefits by exploiting it."
        },
        {
            "text": "With thanks to our guest speakers, this event was a great way to mark the beginning of what looks to be an exciting journey. We look forward to sharing the launch of our new fund and unit in due course. If you have any questions, please email us at KAGuidance@beis.gov.uk"
        },
        {
            "text": " "
        }
    ]
}