{
    "url": "https://forestrycommission.blog.gov.uk/2021/06/23/might-oaks-from-little-acorns-grow/",
    "title": "Might oaks from little acorns grow…?",
    "authors": [
        "Bella Murfin and Naomi Matthiessen"
    ],
    "categories": [
        "Woodland creation"
    ],
    "pub_date": "2021-06-23T14:43:38+01:00",
    "content": [
        {
            "text": "We are Bella Murfin and Naomi Matthiessen, job share Directors for the Nature for Climate Fund Tree Programme in Defra."
        },
        {
            "text": "We joined the Defra Trees and Forestry team in April 2020, just after the Chancellor had committed £640m to the Nature for Climate Fund (NCF), intended to boost the role of nature in the journey to Net Zero. The small team had a big goal – to treble woodland creation in England, making the most of trees to sequester carbon along with many other benefits - all against the backdrop of a global pandemic."
        },
        {
            "text": "It was a steep learning curve and things were moving at an incredible pace. We needed to unlock the money through a tough Business Case process, grow the team, build relationships with stakeholders and develop credible plans. And we couldn’t see anyone in real life!"
        },
        {
            "text": "By June, the team had launched the England Tree Strategy consultation and were talking to foresters, farmers, scientists, environmental organisations and members of the public to shape the vision for trees in England."
        },
        {
            "text": "As the season turned from summer to autumn, so the team continued to grow, encompassing our colleagues at Forestry Commission, along with partners like Community Forests and environmental organisations to design the strategy and the programme in parallel with each other, whilst also deploying the NCF to get trees in the ground. We described this as building the plane as we flew it, all the time focussed on Government priorities of delivering natural capital benefits using Nature for Climate funds."
        },
        {
            "text": "Autumn to winter brought with it the traditional tree planting season. Our delivery partners struggled with fewer volunteers and tree planting teams than would normally help plant the trees. Coronavirus was taking its toll on our ability to plant the number of trees in our original plans."
        },
        {
            "text": "However, we’d made good progress with funding opportunities and in National Tree Week we were able to promote new schemes and partnerships."
        },
        {
            "text": "By spring, we’d worked through most of the government approvals needed for such a large programme and we were ready to announce further funding opportunities."
        },
        {
            "text": "Then on the 18 May we launched the England Trees Action Plan. This was a key milestone, both as the culmination of all the team’s hard work over the last year, and as an incredibly important framework, defining how we will continue to create and nurture trees and woods for future generations."
        },
        {
            "text": "It’s been an extraordinary year! Sometimes exhausting, often inspiring, and we’ve been so privileged to be working with a fantastic team across Defra, Forestry Commission and our other delivery partners. That word, ‘partnership’ embodies much of what has been most rewarding and will continue to be vital as we take next steps."
        },
        {
            "text": "And ‘year 2’ is shaping up well, with Forestry Commission launching a flagship new grant in the England Woodland Creation Offer with £15.9 million in its first year."
        },
        {
            "text": "With the right framework in place, and a diverse range of funding opportunities already supporting new tree planting and establishment projects, we’re incredibly excited to be part of what happens next."
        },
        {
            "text": "Making sure that the right trees are in the right place and for the right reasons, our landscapes and treescapes will change for the better and we will contribute to net zero targets and other government priorities."
        }
    ]
}