{
    "url": "https://planninginspectorate.blog.gov.uk/2021/06/23/public-service-a-duty-worth-celebrating/",
    "title": "Public service: A duty worth celebrating",
    "authors": [
        "Menaka Sahai",
        "Heidi Cruickshank",
        "Richard Schofield"
    ],
    "categories": [
        "Appeals",
        "Applications",
        "Examinations",
        "Public service"
    ],
    "pub_date": "2021-06-23T13:00:19+01:00",
    "content": [
        {
            "text": "Today, 23 June, is Public Service Day. To mark this important day, inspectors Menaka Sahai, Heidi Cruickshank and Richard Schofield share their thoughts on why they became an inspector and how the public service that they deliver is important for the nation."
        },
        {
            "text": "Public Service Day was established by the UN in 2003 to celebrate the contribution made by those in the public sector and civil service to our local communities and society as a whole."
        },
        {
            "text": "Public service takes many shapes; doctors, nurses, police officers, teachers, the armed forces, social workers, civil servants, planners, council workers. Committed, hardworking public servants can be found throughout our local communities. Very often it is ordinary people doing extraordinary things every day."
        },
        {
            "text": "The work and decisions of the Planning Inspectorate impact the lives of communities across England and Wales. It gives people a voice in the sometimes intimidating and complex world of planning, and it shapes the spaces and environment we live in."
        },
        {
            "heading": 2,
            "text": "Richard Schofield "
        },
        {
            "heading": 3,
            "text": "Why I became an inspector"
        },
        {
            "text": "I became a planning inspector following stints in the public, private and voluntary sectors. I was attracted to a job that offered very significant intellectual challenges and one that, while requiring considerable resilience and self-confidence, was part of an incredibly professional and supportive organisation. Just as fundamentally, the role is hugely worthwhile. Our decisions can never please everybody but the work that we do, examining development proposals and listening to diverse views about them, has significant impacts for the environment, the economy and, ultimately, peoples’ lives."
        },
        {
            "heading": 3,
            "text": "What inspectors do"
        },
        {
            "text": "Planning Inspectors carry out a huge range of work as quasi-judicial, independent, expert tribunals appointed by the Secretary of State for Housing, Communities & Local Government. At my level, I preside over public inquiries concerning complex land use planning disputes (covering anything from major housing development proposals to on-shore windfarms) and chair examinations into local development plans, scrutinising how and where new development will take place in a given local authority area over a 15 to 20 year period. Ultimately, I make recommendations on these issues for, and to, the Secretary of State."
        },
        {
            "text": "These fora are central to giving a huge range of people, including local residents, interest groups, statutory bodies and developers, the opportunity to have their say on these important and emotive issues."
        },
        {
            "heading": 3,
            "text": "How the public service that inspectors provide is important for the nation"
        },
        {
            "text": "Our work plays a critical part in helping the government to achieve its objective of delivering the homes, employment opportunities and infrastructure that England needs. We contribute to the creation of communities, to the protection and enhancement of the natural and historic environment and to mitigation against climate change. We also provide a professional, expert service to other government departments and agencies on a range of land use planning and environmental assessment issues."
        },
        {
            "heading": 2,
            "text": "Heidi Cruickshank"
        },
        {
            "heading": 3,
            "text": "Why I became an inspector"
        },
        {
            "text": "I first knew about the Planning Inspectorate as a young graduate, appearing nervously at my first inquiry to give expert evidence on environmental matters for a road scheme.  If anyone had told me then that one day, I would be an inspector I would not have believed them."
        },
        {
            "text": "I moved from that job into a County Council role working on public rights of way.   I found this a fascinating area to work in, balancing public interest and the effects on landowners and occupiers within the legal framework.  I was again appearing before inspectors, giving a different type of evidence, and starting to think that maybe this was a role I could do too.  When the opportunity came to apply I did so, and I have not regretted that decision."
        },
        {
            "heading": 3,
            "text": "What inspectors do"
        },
        {
            "text": "I enjoy hearing from people across the country, who have different interests in the matter at hand, whether on commons, rights of way or other casework areas.  Inquiries are something I’m used to now, but I always try to think about how I felt when I was on ‘the other side’, particularly the feeling of my first Inquiry.  It’s important to remember that some people may only ever get involved in one inquiry and it could be this one."
        },
        {
            "heading": 3,
            "text": "How the public service that inspectors provide is important for the nation"
        },
        {
            "text": "I consider it important that the public have access to the countryside for fresh air and recreation.  However, it has to be recognised that the majority of the countryside is a working landscape, where people need to earn a living.  Sometimes the law helps with that balance and sometimes it doesn’t…"
        },
        {
            "text": "Whilst there will always be disappointed parties, who did not get the outcome they argued for, I hope that they can see that their evidence was fairly heard and considered.  The legal framework and precedent needs to be appropriately balanced – it would be fair to say there’s always something to keep me thinking when I’m writing decisions."
        },
        {
            "heading": 2,
            "text": "Menaka Sahai"
        },
        {
            "heading": 3,
            "text": "Why I became an inspector"
        },
        {
            "text": "My ambition to become an inspector really started with my interest in major infrastructure design and its wide-ranging impact on how places function, change and grow."
        },
        {
            "text": "While working at CABE, I was providing design advice to nationally significant infrastructure projects (NSIPs) and working with partners to set out the added value of good design to the quality of outcomes, in terms of environmental, social and economic benefits. This was a steep learning curve in the Planning Act 2008 and the work of what was the Infrastructure Planning Commission at the time. And since then my interest in NSIPs and the work of the Inspectorate has grown rapidly."
        },
        {
            "text": "I went on to work as a consultant for High Speed Two (HS2), embedding requirements for good design into policy documents for landscape design, station design and structures. This gave me foundational understanding of engineering and environmental aspects of major infrastructure."
        },
        {
            "text": "With understanding of the planning and policy side of NSIPs from experience at CABE, and the engineering and environmental aspects from experience at HS2, I felt confident to enter this world. I was appointed in 2016 and I am on my third case now. Job satisfaction, motivation and professional development are very high and will keep me going in this role for several years!"
        },
        {
            "heading": 3,
            "text": "What inspectors do"
        },
        {
            "text": "I am an examining inspector for NSIPs and get assigned to an application for development consent based on the expertise required on the case. I work on the case for a period of 12 months, covering pre-examination, examination and reporting. In my current role, I am lead member of the Examining Authority (ExA) or panel with two other panel members assigned to the case."
        },
        {
            "text": "During pre-examination, we are reading through the application material, submissions and visiting the site to get familiar with the case. Alongside, we are preparing a strategy for examination, which includes preparing an examination time-table, identifying the principle issues, and writing questions for parties about the scheme and its effects."
        },
        {
            "text": "During examination, we will go through a few stages of receiving written submissions and holding in-person (or virtual) hearings. This is an inquisitorial process and my aim here is to ensure that the ExA has evidence from all parties to be able to consider the matters fully."
        },
        {
            "text": "I find it can be tricky comparing and balancing technical evidence against sometimes rather emotive submissions. For me it is crucial to get this step right to ensure fairness for all parties. On the case management side, it is my job to take a wide angle lens to identify all major deadlines and intervening mini-deadlines, catch bottlenecks before we get caught in one, and basically orchestrate the process as smoothly as possible."
        },
        {
            "text": "Ultimately, we write an evidence-based recommendation report to the Secretary of State on our examination of the application, and the points of views of all parties involved in and affected by the scheme. We conclude on the policy requirements set out in the national policy statement, and make a recommendation to grant or withhold consent."
        },
        {
            "text": "Here the ExA’s conclusions must be reasoned to hell and back! The phrase ‘because … because … because …’ is widely used to drive home the importance of robustly reasoned conclusions. As panel lead, I will play an important role through the reporting period leading the planning balance exercise and the process of arriving at our recommendation with other panel members."
        },
        {
            "text": "I have thoroughly enjoyed my first two cases and learned a great deal from both. But I am enjoying my panel lead role in my current case a lot more as it plays to my strengths."
        },
        {
            "heading": 3,
            "text": "How the public service that inspectors provide is important for the nation"
        },
        {
            "text": "I, as part of national infrastructure, play an important role in the UK government responsible for enabling fair, robust and efficient decision-making on NSIPs, including nuclear power stations, large offshore wind farms, roads, railways and airports. This role will only become more important to keep a moving pipeline of projects, as we expect significant investment in infrastructure across England."
        },
        {
            "text": "Like other examining inspectors, I bring considerable expertise in specialist technical fields; my areas of expertise are good design and planning policy. As a whole we are an extensive knowledge pool and can contribute to the government’s work in many other ways, such as inputting into policy making and updating, setting a high bar for good quality outcomes, and knowledge sharing with other statutory bodies and local authorities to uphold good planning and development practices across the country."
        },
        {
            "text": "Finally, I think we have led the way in establishing a technologically advanced way of working that is becoming norm in government and across sectors. I have only played a small role here, in contributing to the ways of holding virtual hearings process in the new operating model, but I am pleased to be part of a modern, agile workforce that has stayed resilient through the most challenging time in our recent history."
        },
        {
            "heading": 2,
            "text": "Subscribe for more insights from the Planning Inspectorate"
        },
        {
            "text": "Subscribe to keep updated about all of our blog posts."
        }
    ]
}