{
    "url": "https://insidedio.blog.gov.uk/2021/06/23/the-road-to-royal-air-force-reserves/",
    "title": "The road to Royal Air Force Reserves",
    "authors": [
        "Annabel Hartley"
    ],
    "categories": [
        "Armed Forces",
        "RAF",
        "Reserve Forces",
        "Royal Air Force",
        "Working at DIO"
    ],
    "pub_date": "2021-06-23T09:48:36+00:00",
    "content": [
        {
            "text": "Annabel supporting Op Rescript filming in Manchester [Crown Copyright/MOD2021]When I was 23, I walked into a military camp for the first time in my life to be interviewed for a job as an admin assistant at the Headquarters of the Surgeon General. I was met by a large, tattooed Scottish Army Major who shook my hand and welcomed me at the start of my career ‘behind the wire’."
        },
        {
            "text": "Had I known then that 10 years later I would be passing out of RAF Cranwell as an Officer in the Royal Air Force (RAF) Reserves I’m not sure I would have believed it. With no family in the military and an academic background in Ancient History, Defence was a new world to me, but one that soon became very familiar."
        },
        {
            "text": "After a while, I decided I wanted to find out what life in uniform was all about, so I put in my application to join the RAF Media Reserves. What followed was three years’ of applications, interviews, physical and mental tests. My colleagues at the Defence Infrastructure Organisation (DIO) lived every press-up with me and listened to my tales of crawling through the snow on basic training and sleeping in the woods during my officer training."
        },
        {
            "text": "Annabel with her father on her graduation day at RAF Cranwell. [Crown Copyright/MOD2019]I couldn’t have got through it without the support of my friends and colleagues helping me balance my life as a single parent, Civil Servant and trainee Reserve. The sense of achievement I felt on graduation day was incredible. I had earned my place on that parade square and I definitely felt part of an organisation of great people."
        },
        {
            "text": "Fitness isn’t the only thing I’ve developed since joining, I’ve also learned a lot of new skills and a lot about myself. From handling a rifle to learning how to navigate, the RAF has given me a range of practical skills. I also know how much I can push myself and still keep going."
        },
        {
            "text": "Fast forward to today and the life as a Reserve during Covid is not quite as physical but still as challenging. Team building sessions have switched to Zoom video calls but the military have kept on working, supporting the fight against Covid from the start of the outbreak. I spent some time earlier this year documenting the work that the RAF were doing to support Covid testing centres, a task that gave me the welcome opportunity to put my uniform back on after almost a year out of it. Speaking to several of the Reserves volunteering for this task it was clear why they were doing it; the opportunity to support their local community and be a part of the fight against the disease was something they were keen to do and brought with it a great sense of pride."
        },
        {
            "text": "As well as being a member of the Reserves, I’m also DIO’s Reserve Advocate, promoting the work of the Reserves in the Civil Service and helping those who want to apply. If you’re interested in joining the Reserves and want to find out about what roles are available and the benefits, visit the Armed Forces Reserves GOV.UK website. You can also speak to your Department Advocate if you work in the Civil Service or go to your local Armed Forces Careers Office."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}