{
    "url": "https://teaching.blog.gov.uk/2021/06/23/trainee-teachers-have-really-gone-above-and-beyond-this-year/",
    "title": "Trainee teachers have really gone above and beyond this year",
    "authors": [
        "Emma Sikora",
        "Kim Renshaw",
        "Matthew Turner",
        "Kirsty Butler",
        "Sophie Olley",
        "Kirsty Pretsel",
        "Bailey Wilson"
    ],
    "categories": [
        "COVID-19 support",
        "Inspiring teachers",
        "Support for ECTs",
        "Teachers' reflections"
    ],
    "pub_date": "2021-06-23T15:01:30+01:00",
    "content": [
        {
            "text": " Despite the disruption caused by the pandemic, this year’s trainee teachers have developed an impressive skillset. From supporting the teaching of classes or bubbles to delivering remote education - they’ve shown creativity, versatility and resilience."
        },
        {
            "text": " We asked trainees from Teach North/Outwood Institute of Education to tell us about some of their standout moments from the last year."
        },
        {
            "text": " "
        },
        {
            "text": "One of the highlights for me was getting back to face-to-face lessons in the school’s COVID-secure drama studio, which for me is the beating heart of the school’s creative department. I’ve received exceptional support from my ITT provider, school-based mentors, and my academic mentor at Sheffield Hallam University to help me prepare to become a newly qualified teacher (NQT)."
        },
        {
            "text": "Bailey Wilson is training to become a secondary drama teacher."
        },
        {
            "text": "Kirsty says: ‘The placement got off to a great start and, after just one week back in the classroom, I was already excited for what week 2 would bring!’ Sophie agrees: ‘I really valued the ‘blended learning’ I supported during my placement at Outwood Academy Portland in the autumn term. They gave me experience of traditional classroom teaching alongside online learning environments.’"
        },
        {
            "text": "Kirsty Pretsel and Sophie Olley are both secondary English ITT trainees."
        },
        {
            "text": "I taught a live remote lesson and it was a brilliant example of how technology can be used effectively to learn. Some students were able to take their webcams outside and others positioned them indoors, so we were able to observe their findings and I could also assist with their critical thinking. For us trainees, this style of teaching is part of our new ‘norm’ and current teachers have found inventive ways to adapt. It’s an exciting journey to be on!"
        },
        {
            "text": "Kirsty Butler is a secondary art trainee."
        },
        {
            "text": "Throughout my first placement, I saw first hand how teachers and schools adapted to the ever-changing situation COVID-19 has created. I taught live lessons remotely. Students could be given tasks to complete during the pre-recorded lesson, which they then handed in via the online classroom. For classes attending school in person but with a small number of children isolating, our online classroom has been a great tool in keeping these children up to date with work they have missed in class, allowing for a smoother transition back into the classroom. This is something that I am sure will continue post-pandemic."
        },
        {
            "text": "Matthew Turner is a secondary modern languages trainee."
        },
        {
            "text": "What a year to train to teach! We're confident that this year's trainee teachers are well-placed to approach anything and everything as they take their next steps in the teaching profession. With their positive outlook, high levels of resilience and an ability to respond to feedback with commitment and drive will ensure that this year's trainee teachers will be successful in their Early Career Teacher years (and beyond!). We would like to say a big thank you to all the mentors, host teachers, leaders and support colleagues who have been involved in their school experiences this year as their consistent generosity and guidance has been invaluable."
        },
        {
            "text": "Emma Sikora is the Director of Early Career Development and Programme Lead for Teach North."
        },
        {
            "text": "It has been a pleasure to host all of our trainee teachers this year for their placements at Outwood Academy Valley in Worksop. This year has been a year like no other for education, and our trainee teachers have been fantastic. They have been resilient, hard-working and versatile. Every day, they have placed our students first, helping them to reach their full potential. The trainee teachers have all been an integral part of the team, and they will definitely be missed. Trainees - good luck for your next steps!"
        },
        {
            "text": "Kim Renshaw is the Associate Assistant Principal and ITT Coordinator at Outwood Academy Valley."
        },
        {
            "text": " "
        },
        {
            "text": "This Thank a Teacher Day, we would like to say a huge thank you to all ITT trainees for their hard work and commitment as they trained to teach during this exceptional year. We would also like to thank all the host schools and ITT providers who are doing so much to train our future teachers."
        },
        {
            "text": "Find out about hosting ITT trainees"
        },
        {
            "text": "To learn more about hosting ITT trainees, contact ITT providers in your area. You can find providers offering ITT courses near you by searching the find postgraduate teacher training website. "
        },
        {
            "text": "Want to receive blog posts in your inbox?"
        },
        {
            "text": "Sign up to receive blog updates."
        }
    ]
}