{
    "url": "https://civilservice.blog.gov.uk/2021/06/23/why-im-proud-to-be-a-reservist/",
    "title": "Why I’m Proud to be a Reservist",
    "authors": [
        "James Waller, Head of People & Physical Security, Cabinet Office"
    ],
    "categories": [
        "A great place to work",
        "A Modern Civil Service"
    ],
    "pub_date": "2021-06-23T08:07:58+00:00",
    "content": [
        {
            "text": "23 June is Reserves Day - a chance to recognise the remarkable contribution of civilians who give up their spare time to serve in the armed forces. Civil Servant James Waller shares his pride to be a Naval Reservist.  "
        },
        {
            "text": "There are more than 30,000 reservists in the UK, including many who work as Civil Servants – plus me."
        },
        {
            "text": "For all of us, membership brings a variety of benefits and rewards, but there are just as many reasons why we choose to serve.  "
        },
        {
            "text": "I joined the Royal Navy Reserve (RNR) in the late Nineties because I knew that I wanted to both be in the armed forces and work as a civil servant. I studied International Relations at Keele, and my goal was to become a civil servant specialising in defence and security policy in Whitehall. However I was also keen on serving in the military. By becoming a reservist, I was fortunate to combine the best of both worlds. "
        },
        {
            "text": "World renowned "
        },
        {
            "text": "When you become a reservist, you join a world-renowned organisation that’s about giving something back to our country. We have a fantastic tradition of volunteering here in the UK, with millions of people devoting their spare time in all manner of ways to help make it a better place."
        },
        {
            "text": "As a reservist, you can help make things better by providing help and support to those who need it most. I am deeply proud that I served six months in Afghanistan, helping to improve security in the country. It not only helped make a significant difference in improving the lives of locals, but helped strengthen security back in the UK. "
        },
        {
            "text": "Disaster relief"
        },
        {
            "text": "My friends include reservists who delivered humanitarian aid in theatres including the West Indies following natural disasters or in support of disaster relief operations. Others have mobilised here in the UK, when they effectively became a full time member of the armed forces for a set period, in support of the military response to the initial COVID outbreak. "
        },
        {
            "text": "The common thread is that we’ve all played a small part in making the world a better and safer place. It’s highly satisfying to know we have trained and prepared in order to be ready to help others and make a real difference. "
        },
        {
            "text": "The Reserve are a supportive environment for personal development and adventure. I’ve travelled all over the world with the reserves from America to the Falkland Islands and all the way to Singapore. I’ve been lucky enough to see a great deal of the world and share some great experiences with the Reserves. "
        },
        {
            "text": "From a professional perspective, being a reservist is satisfying. Early in my career the excellent leadership and management training in the military, really helped me when I applied for promotion into senior civil service grades. "
        },
        {
            "text": "I also discovered that being a reservist gave me contact with many people from across the UK who you’d never otherwise meet, expanding my perspectives on life. This is really invaluable as a policy maker, when I want to think about the impact that my work potentially has on others. It’s also a great way to meet people outside the ‘Westminster bubble.’ "
        },
        {
            "text": "Learning new skills"
        },
        {
            "text": "It’s an added bonus to acquire wider skills that I can use in my day job. As a reservist, I work as a media officer, helping to support journalists and enabling them to tell the story of the Royal Navy and Defence. I’ve gained access to great training in how to be a professional media communicator, and I’ve found myself using my new skills regularly which benefit my own team."
        },
        {
            "text": " I would definitely recommend to anyone thinking about joining to give it a go. Being a reservist is enormous fun and it definitely gives you the edge in the office on a Monday morning when people ask, ‘How was your weekend?’ "
        },
        {
            "text": "Weekends on a warship"
        },
        {
            "text": "Over the years, my weekends have included serving at sea aboard a warship, learning firefighting or even training with NATO allies in Gibraltar."
        },
        {
            "text": "Most importantly, I have been able to give something back to society, and I passionately feel that being able to contribute and serve in small way really matters. I am incredibly proud to say that I am a Reservist in the Royal Navy."
        }
    ]
}