{
    "url": "https://forestrycommission.blog.gov.uk/2025/11/27/a-coordinated-effort-how-were-tackling-the-dual-threat-of-deer-and-grey-squirrels/",
    "title": "A coordinated effort: how we’re tackling the dual threat of deer and grey squirrels",
    "authors": [
        "Dr Anna Brown",
        "Alan Law"
    ],
    "categories": [
        "Deer",
        "Woodland management"
    ],
    "pub_date": "2025-11-27T12:00:00+00:00",
    "content": [
        {
            "text": "England’s woodlands are a vital natural asset. They provide habitat for native wildlife, support the timber industry, offer spaces for recreation and capture carbon. However, these ecosystems face significant threats from deer and the non-native grey squirrel. "
        },
        {
            "text": "Both organisations are working to manage the impacts through financial support, scientific innovation, increased culling effort and landscape-scale collaboration to protect woodlands."
        },
        {
            "heading": 2,
            "text": "Understanding the problem"
        },
        {
            "heading": 3,
            "text": "The impact of deer"
        },
        {
            "text": "Heavy deer browsing prevents woodland creation by damaging newly planted trees and preventing, or slowing, natural colonisation. In established woodlands, it can destroy the understorey which degrades habitat for wildlife, stops regeneration and reduces resilience in the long term.  "
        },
        {
            "text": "Heavily browsed woodlands grow more slowly, store less carbon and support fewer plant, invertebrate and bird species. This has clear environmental and economic consequences."
        },
        {
            "heading": 3,
            "text": "The threat of grey squirrels"
        },
        {
            "text": "Grey squirrels threaten our native red squirrel population though competition and disease transmission. They can also strip bark from trees, undoing years of careful woodland management."
        },
        {
            "text": "Bark stripping slows growth, weakens branches and allows fungal diseases into the heartwood. In extreme cases, when trees are stripped all the way round the main stem, it kills them. This limits future timber use and can change woodland composition."
        },
        {
            "text": "These problems are acknowledged across the sector and beyond."
        },
        {
            "text": "Andy Leitch, Deputy Chief Executive of the Confederation of Forest Industries (Confor), says:"
        },
        {
            "heading": 2,
            "text": "Our response"
        },
        {
            "text": "The impacts of grey squirrels and deer on woodlands are well documented. We know that a balanced, long-term approach is essential for the health and resilience of England’s trees and woodland biodiversity. Here is just some of the work happening across the sector:"
        },
        {
            "heading": 3,
            "text": "Financial support for woodland owners"
        },
        {
            "text": "We introduced deer and squirrel management supplements into Countryside Stewardship in 2022 to help woodland owners and foresters offset the cost of managing the impact of deer and squirrels."
        },
        {
            "text": "The grants offer flexibility: from applicants funding professional wildlife managers for lethal control to capital investment in infrastructure and equipment such as high seats and humane squirrel traps."
        },
        {
            "text": "Since launch, over 900 grant agreements have been signed, increasing resources to reduce deer impacts on 65,000 hectares of woodland and grey squirrels impacts on 55,000 hectares. We encourage all woodland owners to consider these grants where eligible (now under PA7, CWS1 and CWS3)."
        },
        {
            "text": "Christopher Williams, CEO of the Royal Forestry Society (RFS), says:"
        },
        {
            "heading": 3,
            "text": "Landscape-scale deer management"
        },
        {
            "text": "Wild deer, particularly herding species such as fallow, red and sika, can cross several properties in a single day, making collaboration between landowners essential for effective management."
        },
        {
            "text": "Projects like the Sussex Woods Pilot, managed by Natural England, bring together many landowners to understand deer numbers and impacts, coordinate culling, provide training and develop initiatives such as venison marketing schemes to provide healthy locally sourced meat."
        },
        {
            "text": "Steve Walker, Project Coordinator of the Sussex Woods Protected Site Strategies Pilot, says:"
        },
        {
            "heading": 3,
            "text": "Knowledge sharing and building capacity"
        },
        {
            "text": "Forestry Commission Deer Officers reach thousands of people each year through large events such as the National Deer Conference (attended by over 300 people in 2024) to local workshops and one-to-one advice for woodland owners, agents and managers."
        },
        {
            "text": "Sharing successes and failures is essential to improving deer and squirrel management nationally. Deer management is often solitary work, so bringing professionals and recreational stalkers together is an effective way of enabling knowledge exchange."
        },
        {
            "heading": 3,
            "text": "Supporting the Squirrel Accord"
        },
        {
            "text": "The Forestry Commission and Natural England, along with 43 other organisations, are signatories to the Accord, which aims to protect red squirrels and broadleaf trees from grey squirrel impacts."
        },
        {
            "text": "Through dedicated Squirrel Officers, the Accord increases grey squirrel management across woodland areas. Officers work with landowners and volunteers in Yorkshire, Lancashire and County Durham, close to England’s few remaining red squirrel strongholds."
        },
        {
            "text": "Kay Haw, Director of the UK Squirrel Accord (UKSA), says:"
        },
        {
            "heading": 3,
            "text": "Embracing technology and innovation"
        },
        {
            "text": "Advances in night vision and thermal imagery have enabled more accurate population surveys. Drones with thermal cameras are increasingly used across estates and in landscape-scale projects to reduce deer and squirrel impacts, whilst night vision helps deer managers increase their effectiveness within current legislation."
        },
        {
            "text": "Research into grey squirrel fertility control, conducted by the Animal and Plant Health Agency and facilitated by the UKSA, could provide a longer-term alternative to lethal control."
        },
        {
            "heading": 3,
            "text": "Developing the venison supply chain"
        },
        {
            "text": "Culling of wild deer not only improves our woodland resilience, but it also provides a nutritious and healthy source of protein, and the only climate positive red meat in the form of wild venison."
        },
        {
            "text": "We have been working with Grown in Britain, Approved Game Handling Establishments and others to build confidence in the venison supply chain. The resulting British Quality Wild Venison (BQWV) standard provides the assurance that the venison produced under this scheme has come from humanely culled deer, carefully inspected and prepared for the food chain immediately after shooting, then stored and transported in climate-controlled facilities."
        },
        {
            "text": "Dougal Driver, CEO of Grown in Britain, says:"
        },
        {
            "text": "Increasing demand for wild venison helps offset deer management costs whilst providing a sustainable and healthy source of free-range meat. Various organisations, including hospitals and universities, are using venison more frequently and feedback has been positive."
        },
        {
            "text": "The Royal Society for the Protection of Birds (RSPB) supports maintaining deer populations at levels that enable healthy, functioning ecosystems and sees a growing wild venison market as key to achieve this balance."
        },
        {
            "text": "Andrew Weatherall, Principal Policy Officer (Woodlands and Forestry) for the RSPB, says:"
        },
        {
            "heading": 2,
            "text": "Managing the nation’s forests – Forestry England’s vision for the future"
        },
        {
            "heading": 3,
            "text": "Deer licensing reform"
        },
        {
            "text": "Shooting deer at night is normally unlawful but night shooting can increase culling efficiency, particularly for herding species that move into fields after dark."
        },
        {
            "text": "Currently, individuals must apply for night shooting licences for specific land areas and demonstrate that daytime shooting cannot resolve the damage. Natural England has reviewed how these licences are issued and is introducing a lighter-touch licensing regime to support wider use of night shooting."
        },
        {
            "text": "People will be able to register for a night shooting class licence if they meet training and experience requirements. The new approach is currently being tested with Forestry England rangers, with plans to offer it to all deer managers in early 2026. "
        },
        {
            "heading": 2,
            "text": "Working together for England's woodlands"
        },
        {
            "text": "The challenges posed by deer and grey squirrels require action at every level, from policy and innovation to practical management on the ground. Ultimately, success or failure to reduce deer and grey squirrel impacts nationally rests with woodland owners making decisions to work with their neighbours, increase cull efforts and use government support to help achieve this. Without collective effort, these species will continue to undermine efforts to improve farming and forestry economics, restore nature and mitigate climate change."
        },
        {
            "text": "We celebrate everyone contributing to this effort: landowners and managers,  Squirrel Accord and Deer Initiative Partnership members, professional and recreational deer managers, game keepers, game dealers and consumers choosing British Quality Wild Venison. Your work directly supports the health of England's woodlands and the benefits they provide to us all, and we encourage you to both continue and expand your efforts."
        }
    ]
}