{
    "url": "https://ipo.blog.gov.uk/2025/11/27/copyright-carols-for-choirs/",
    "title": "Copyright carols for choirs",
    "authors": [
        "Meg Davies"
    ],
    "categories": [
        "Copyright"
    ],
    "pub_date": "2025-11-27T12:00:00+00:00",
    "content": [
        {
            "text": "Attending a carol concert can be one of the highlights of Christmas. If, like me, you're in a choir, then the festive season is bound to start early. Rehearsals from September onwards are met with a mixture of excitement and cries of 'it's too soon!' as the year's selection of carols gets handed around.  "
        },
        {
            "text": "But, do you know the role that copyright plays in the music performed? Following on from a previous blog on copyright in choir music, here are some of our top tips for making sure that your performances remain as lawful as they are tuneful.  "
        },
        {
            "text": "Oh Come All Ye Faithful... to copyright law "
        },
        {
            "text": "Copyright is the automatic protection that covers written, dramatic, musical and artistic work. The automatic protection over musical work covers a variety of areas: the music itself by the composer and/or arranger, the lyrics by the writer, and how it looks on the page, also known as the typographical arrangement.  "
        },
        {
            "text": "Choir leaders should consider this when choosing and distributing music for a new season – and luckily, we have guidance to help you adhere to the rules.  "
        },
        {
            "text": "Public domain: the gift that keeps on giving "
        },
        {
            "text": "Copyright protection in the UK covers music for 70 years after the author's death. This means that favourites like The Twelve Days of Christmas, We Wish You a Merry Christmas and Hark! The Herald Angels Sing are all in the public domain – but this doesn't mean that every version of them is free to use. Only the original carol compositions or very old arrangements are available to use as you please.  "
        },
        {
            "text": "Modern arrangements of the classics are covered by their own copyright, and so you should obtain the correct permissions before using them. For example, the upbeat versions of classic songs by prolific composer/arranger Mac Huff (that my choir favours) remain protected, even though the original carol may have long been in the public domain. "
        },
        {
            "text": "It’s also crucial that you remember that if the composer is still alive or has passed away in the last 70 years, their music is still covered by copyright. So modern favourites like John Rutter's Angel Carol and Christmas pop songs such as All I Want for Christmas is You are protected by copyright and should be purchased from official vendors. "
        },
        {
            "text": "Even well-loved carols might differ in their copyright protection. The lyrics of In the Bleak Midwinter by Christina Rosetti are long expired, and the version by Gustav Holst is no longer protected by copyright. However, the version by Harold Darke is still protected, as he died in 1976 (within the 70 year period). "
        },
        {
            "text": "Copying music: it's beginning to look a lot like infringement "
        },
        {
            "text": "It may seem tempting; you’ve bought one copy of a carol, and decide to make photocopies to avoid buying a copy for each choir member. Yet while this might seem harmless, it's usually not allowed without permission. Copyright law treats photocopying as making a copy, which is a restricted act. This protection is vital – it ensures that composers and arrangers can continue to create the beautiful music that soundtracks our festive seasons. Without it, creating music would be a hobby, not a livelihood. "
        },
        {
            "text": "So, what are the options? If your choir learns by ear (without music), but you need an accessible copy for certain members, you may be able to rely on a copyright exception. For everyone else, you can either buy extra copies for your choir or secure an appropriate licence to allow you to distribute copies. Ensure you read the terms and conditions when buying new music to understand how your purchase allows it to be distributed. Organisations like the Music Publishers' Association can help you understand what licences you might need. "
        },
        {
            "text": "Lessons in carols "
        },
        {
            "text": "If in doubt, check the copyright statement on the sheet music or contact the publisher - it's the best way to keep your choir singing legally and ethically this Christmas. Many publishers are happy to help and may offer flexible solutions for choirs. "
        },
        {
            "text": "Remember, copyright isn't there to be a Grinch – it ensures that composers, arrangers and lyricists can continue creating the music that makes our Christmases so special. By respecting copyright, we're all singing from the same hymn sheet when it comes to supporting the arts. "
        },
        {
            "text": "For more detailed information on copyright in printed music, you can read our guidance including the copyright notice on sheet music. "
        }
    ]
}