{
    "url": "https://publicpolicydesign.blog.gov.uk/2025/11/27/from-systems-maps-to-system-stories/",
    "title": "From systems maps to system stories",
    "authors": [
        "Becky Miller",
        "Anne Thurston",
        "William Hallows"
    ],
    "categories": [
        "Case study",
        "PublicPolicyDesign"
    ],
    "pub_date": "2025-11-27T12:00:00+00:00",
    "content": [
        {
            "text": "Inspired by the award-winning work of designers in the Ministry of Justice, our Policy Design Lab team in the Department for Environment, Food & Rural Affairs were keen to use system mapping to help policy colleagues make sense of their evidence base."
        },
        {
            "text": "But systems maps can be visually overwhelming, often only making sense to those making them. The Foresight Obesity Systems Map is an often-quoted example of this. As a result, they can sometimes feel alienating and ultimately lose their value and impact."
        },
        {
            "text": "We wanted to design a more participatory method of systems mapping that allowed a wider, more diverse group of colleagues to be involved in the sense making process."
        },
        {
            "heading": 2,
            "text": "Innovating how evidence is mapped"
        },
        {
            "text": "In our recent blog post, we described the challenges of evidence-based policy making that we’ve experienced on the Farming and Countryside Programme. In response, we ran a participatory workshop in June 2023 which combined systems mapping and serious games methods."
        },
        {
            "text": "We worked with professional games designer Matteo Menapace to design a participatory ‘evidence mapping’ workshop, that allowed 36 colleagues with little or no prior knowledge of systems mapping to explore the 150 individual insights and build their own evidence maps. An important part of the workshop was printing off our insights as individual ‘nuggets’ or ‘evidence cards’. In the first part of the workshop, we used simple card swapping activities to socialise the evidence base and get colleagues familiar with the breath of insights."
        },
        {
            "text": "One of our participants reflected on how this tactile approach allowed for a more engaging, collaborative experience of evidence review, for an activity which is often done in isolation in front of a computer:"
        },
        {
            "text": "By the end of the day, colleagues had identified both the vicious and virtuous cycles that connect the individual insights:"
        },
        {
            "heading": 2,
            "text": "Visualising system stories"
        },
        {
            "text": "After the workshop we analysed the evidence maps and create an aggregated map identifying the underlying series of factors driving and blocking policy outcomes."
        },
        {
            "text": "Knowing how overwhelming systems maps can be to read, we then broke down the aggregated map into 8 smaller (but still connected) maps or ‘system stories’. Each told an important story in the evidence base that significantly impacts the policy outcomes."
        },
        {
            "text": "We made simple animated visuals of these system stories, allowing colleagues across the programme to appreciate how different insight ‘nuggets’ in the evidence impact each other."
        },
        {
            "text": "The final framing was to introduce the notion of these system stories as ‘opportunity areas of work’ for the programme. This framing allowed us to identify and share new challenge questions (‘how might we...’) with the policy team to stimulate new thinking, ideas and hypotheses to test. "
        },
        {
            "text": "It also allowed us to identify existing work, beyond the scope of our programme’s work. That is already working to flip the system stories, addressing some of its delivery risks. This highlighted an important aspect of systems thinking, which is considering where to usefully draw the boundary to a system, which might involve challenging assumptions and silos."
        },
        {
            "heading": 2,
            "text": "Lessons for participatory mapping"
        },
        {
            "text": "For us there were five key learning areas from this work:"
        },
        {
            "heading": 3,
            "text": "1. Using multidisciplinary working to actively bridge the ‘policy-delivery gap’"
        },
        {
            "text": "Inviting professionals from both the policy and delivery disciplines to contribute to our evidence discovery and take part in the evidence mapping workshop was an effective way to avoid overlooking insights and generate a wider variety of hypotheses and ideas to test. It was also an active way of demonstrating the value of a multidisciplinary team upstream in the policy space."
        },
        {
            "heading": 3,
            "text": "2. Embracing visual and physical ways of learning"
        },
        {
            "text": "We heard feedback during the evidence discovery that the visual images we used to theme the evidence helped people navigate and review the volume of evidence quickly. Similarly, we heard that the physical, tactile quality of printed evidence cards and the card swapping activities helped people digest and explore the insights in a more meaningful way than online workshops. These things reminded us of the value of investing in face-to-face working at points in a project when collective understanding and buy-in are critical to moving work forward."
        },
        {
            "heading": 3,
            "text": "3. Supporting knowledge management"
        },
        {
            "text": "Our insights database will now be added to a new programme-wide insights library, being led by the User Research Community in Defra. Our project went further, showing the potential for an accessible, searchable insights library to form the basis of a whole range of creative, innovative policy making workshops that invite diverse groups of people to review evidence, make meaning and imagine new policy ideas to test."
        },
        {
            "heading": 3,
            "text": "4. Framing the analysis"
        },
        {
            "text": "In our final playback we framed the system stories we’d identified as ‘opportunity areas of work’. However, on reflection, we’re learning that policy colleagues can often be more compelled to action by ‘risks’ and ‘mitigations’. This is an interesting and important learning for us about policymaker motivations, and how to inspire action from research and insights."
        },
        {
            "heading": 3,
            "text": "5. A note on language"
        },
        {
            "text": "We deliberately chose not to use the language of ‘system mapping’ which can sometimes feel overly technical or alienating for those coming new to the method. Instead, we stuck with plain English, describing the logical next step of ‘mapping’ the evidence after our earlier evidence discovery workshop."
        },
        {
            "heading": 2,
            "text": "Share your experience"
        },
        {
            "text": "Those were our key takeaways from this work, but we’re also curious to know what your reflections are on this participatory approach to systems mapping"
        },
        {
            "text": "Let us know your thoughts below or email us: policydesignlab@defra.gov.uk"
        }
    ]
}