{
    "url": "https://food.blog.gov.uk/2025/11/27/future-of-food-regulation-budget-announcement/",
    "title": "Future of food regulation – Budget announcement ",
    "authors": [
        "Katie Pettifer, Chief Executive"
    ],
    "categories": [
        "Our mission"
    ],
    "pub_date": "2025-11-27T09:39:08+00:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "As part of this week’s Budget announcement, the FSA has been asked by the UK Government to develop a new national system of regulation for highly compliant large food businesses in England. "
        },
        {
            "text": "This request from the Government builds on work we have already done. Two years ago, the FSA carried out a year-long trial of ‘National Level Regulation’ with major retailers, looking at whether we could regulate the biggest businesses at a national level, scrutinising their data and systems at national level, combined with some checks on the ground.   "
        },
        {
            "text": "Since then, we’ve worked with local authorities, businesses and other stakeholders on how food regulation could evolve to keep protecting consumers and supporting businesses at both local and national level in the future. We’ve talked about an enhanced registration system, greater use of data and intelligence, more effective local enforcement powers and strong consumer information, building on our trusted food hygiene rating scheme. "
        },
        {
            "text": "A national level approach is an important part of this picture. It could strengthen oversight of the largest businesses, which sell the vast majority of food that households buy. Frequent scrutiny of business data and control systems, together with some checks on the ground, means we can identify and address food safety risks across entire businesses far more quickly, whilst reducing administrative burdens on compliant business.     "
        },
        {
            "text": "Ultimately our job at FSA is to protect public health, and to protect consumers, and that will guide any changes we propose. There must always be independent regulation of food businesses, and as the food sector evolves we can develop new ways to do this well. In any future system environmental health professionals will continue to play a vital role – their insight on the ground is invaluable.  But a national level approach for the largest businesses could give those in local authority food teams more time to focus on those local shops and restaurants that need more hands-on support. "
        },
        {
            "text": "So, what’s next? We will work up ideas for future food regulation, based on discussions with partners across the food system over the past year. Our proposals will be put to the FSA Board at its meeting in March. "
        },
        {
            "text": "Our goal is simple: a food retail sector that’s safe, trusted, and fit for the future. We’ll keep listening to consumers, businesses, and professionals as we go, and we’ll keep you updated as this work progresses. "
        },
        {
            "text": "Katie Pettifer, FSA CEO "
        },
        {
            "heading": 1,
            "text": "Dyfodol rheoleiddio bwyd – Cyhoeddiad cyllideb "
        },
        {
            "text": "Fel rhan o gyhoeddiad Cyllideb yr wythnos hon, mae Llywodraeth y DU wedi gofyn i’r Asiantaeth Safonau Bwyd (ASB) ddatblygu system reoleiddio genedlaethol newydd ar gyfer busnesau bwyd mawr yn Lloegr sy’n cydymffurfio i raddau helaeth. "
        },
        {
            "text": "Mae’r cais hwn gan y llywodraeth yn adeiladu ar waith rydym eisoes wedi’i wneud. Ddwy flynedd yn ôl, cynhaliodd yr ASB brawf blwyddyn o hyd ar ‘Reoleiddio ar Lefel Genedlaethol’ gyda manwerthwyr mawr. Diben y prawf oedd ystyried a fyddai modd rheoleiddio’r busnesau mwyaf ar lefel genedlaethol, gan graffu ar eu data a’u systemau ar lefel genedlaethol, ynghyd â rhai gwiriadau ar lawr gwlad.   "
        },
        {
            "text": "Ers hynny, rydym wedi gweithio gydag awdurdodau lleol, busnesau a rhanddeiliaid eraill ar sut y gallai’r gwaith rheoleiddio bwyd esblygu i barhau i ddiogelu defnyddwyr a chefnogi busnesau ar lefel leol a chenedlaethol yn y dyfodol. Rydym wedi siarad am system gofrestru fanylach, mwy o ddefnydd o ddata a chudd-wybodaeth, pwerau gorfodi lleol mwy effeithiol a threfniadau cadarn o ran darparu gwybodaeth i ddefnyddwyr, gan adeiladu ar ein cynllun sgorio hylendid bwyd dibynadwy. "
        },
        {
            "text": "Mae dull gweithredu ar lefel genedlaethol yn rhan bwysig o’r darlun hwn. Gallai gryfhau’r gwaith o oruchwylio’r busnesau mwyaf, sy’n gwerthu’r mwyafrif helaeth o’r bwyd y mae pobl yn ei brynu ar gyfer y cartref. Drwy graffu ar ddata a systemau rheoli busnesau’n aml, ynghyd â chynnal rhai gwiriadau ar lawr gwlad, gallwn nodi a mynd i’r afael â risgiau diogelwch bwyd ar draws busnesau cyfan yn gynt o lawer, gan leihau’r baich gweinyddol ar fusnesau sy’n cydymffurfio.     "
        },
        {
            "text": "Yn y pen draw, ein gwaith ni yn yr ASB yw diogelu iechyd y cyhoedd, a diogelu defnyddwyr, a dyna fydd yn llywio unrhyw newidiadau a gynigiwn. Rhaid i fusnesau bwyd gael eu rheoleiddio’n annibynnol bob amser, ac wrth i’r sector bwyd esblygu gallwn ddatblygu dulliau newydd o wneud hyn yn dda. Mewn unrhyw system yn y dyfodol, bydd gweithwyr proffesiynol iechyd yr amgylchedd yn parhau i chwarae rhan hanfodol – mae eu mewnwelediad ar lawr gwlad yn amhrisiadwy.  Ond gallai dull gweithredu ar lefel genedlaethol ar gyfer y busnesau mwyaf olygu bod gan weithwyr mewn timau bwyd awdurdodau lleol fwy o amser i ganolbwyntio ar y siopau a’r bwytai lleol hynny sydd angen mwy o gymorth ymarferol. "
        },
        {
            "text": "Felly, beth nesaf? Byddwn yn gweithio ar syniadau ar gyfer rheoleiddio bwyd yn y dyfodol, yn seiliedig ar drafodaethau â phartneriaid ar draws y system fwyd dros y flwyddyn ddiwethaf. Bydd ein cynigion yn cael eu cyflwyno i Fwrdd yr ASB yn ei gyfarfod ym mis Mawrth. "
        },
        {
            "text": "Mae ein nod yn syml: sector manwerthu bwyd sy’n ddiogel, yn ddibynadwy, ac yn addas ar gyfer y dyfodol. Byddwn yn parhau i wrando ar ddefnyddwyr, busnesau a gweithwyr proffesiynol wrth i ni fynd ymlaen, a byddwn yn rhoi’r wybodaeth ddiweddaraf i chi wrth i’r gwaith hwn fynd rhagddo. "
        },
        {
            "text": "Katie Pettifer, Prif Weithredwr yr ASB "
        }
    ]
}