{
    "url": "https://skillsengland.blog.gov.uk/2025/11/27/introducing-the-uk-standard-skills-classification-a-new-way-to-explore-skills-and-occupations-by-frank-bowley/",
    "title": "Introducing the UK Standard Skills Classification: a new way to explore skills and occupations, by Frank Bowley",
    "authors": [
        "Communications Team"
    ],
    "categories": [
        "analysis",
        "data",
        "Insight",
        "services",
        "skills england tools"
    ],
    "pub_date": "2025-11-27T10:07:31+00:00",
    "content": [
        {
            "text": "Skills England, in partnership with the University of Warwick's Institute for Employment Research (IER), has launched a groundbreaking prototype tool to help everyone speak the same language about skills. "
        },
        {
            "text": "Today, we’re excited to introduce the UK Standard Skills Classification (SSC), the first standardised skills framework of its kind in our country. "
        },
        {
            "text": "You can think of the SSC as a comprehensive dictionary that translates the complex world of skills, knowledge and tasks across UK occupations into clear, consistent language that everyone can understand and use. "
        },
        {
            "text": "The resource has been launched along with an accompanying report, the 'UK Standard Skills Classification: interim development report', which describes the classification, its use cases, the development methodology and recommendations for future updates and extensions of the tool. A final version of this report will be published alongside the release of version 1 of the classification in spring 2026. "
        },
        {
            "heading": 2,
            "text": "What is the SSC?"
        },
        {
            "text": "The SSC is a free resource for individuals, careers advisors, employers, and organisations involved in labour market analysis.  "
        },
        {
            "text": "At its heart, it’s a standardised set of lists that breaks down the skills, knowledge and tasks required across UK occupations. But it’s much more than just lists – it’s a common language that bridges the gap between different sectors, industries and career paths. "
        },
        {
            "text": "The SSC provides an essential common language, helping everyone from individual job seekers to major employers to navigate the world of skills with confidence. "
        },
        {
            "heading": 3,
            "text": "Who can benefit from this?"
        },
        {
            "text": "The beauty of the SSC lies in its versatility. Whether you’re an individual planning your next career move, a careers adviser supporting clients, or an employer trying to understand your workforce better, the SSC has something valuable to offer. "
        },
        {
            "text": "For individuals, it opens up new possibilities by helping you discover transferable skills you might not have realised you had, identify exactly what new skills you’d need for a career change, and find relevant training courses to bridge any gaps. "
        },
        {
            "text": "Careers advisers can use it as a powerful tool to support clients in understanding their options and planning realistic career paths based on their existing skills, qualifications and interests. "
        },
        {
            "text": "Employers will find it invaluable for assessing current workforce capabilities, identifying skills gaps before they become problems, planning more effective skills-based recruitment, drafting job vacancy adverts, and making informed strategic decisions about long-term workforce development. "
        },
        {
            "text": "Local authorities, mayoral combined authorities, and organisations involved in labour market analysis can use the SSC to understand local skills needs, forecast future demand, and guide training providers on curriculum priorities and development. "
        },
        {
            "heading": 3,
            "text": "Launching with the UK Skills Explorer "
        },
        {
            "text": "We’re not just releasing the classification on its own – we’re also launching it alongside our new UK Skills Explorer digital tool. This user-friendly platform makes it easy to browse and navigate the classification, turning what could be overwhelming amounts of information into an intuitive, searchable experience. "
        },
        {
            "text": "The UK Skills Explorer takes the comprehensive information in the SSC and presents it in a way that makes sense, whether you’re quickly checking what skills are needed for a particular role or conducting detailed analysis for workforce planning. "
        },
        {
            "heading": 3,
            "text": "This is just the beginning"
        },
        {
            "text": "We are calling this a prototype because your feedback is crucial to making it even better. We want to hear from everyone who uses it – what works well, what could be improved, and what added features would make it more useful for your specific needs. "
        },
        {
            "text": "You can share your thoughts directly through the Skills Explorer platform via the feedback functionality. Your input will directly influence the development of version 1, which we are planning to release in spring 2026. "
        },
        {
            "text": "During this beta testing phase, the SSC is hosted on an external website by our partners at the IER. "
        },
        {
            "heading": 3,
            "text": "Why this matters"
        },
        {
            "text": "In a rapidly changing economy, having a clear, shared understanding of skills has never been more important. The SSC represents a significant step forward in how we think about and discuss skills in the UK. It’s about creating opportunities, reducing barriers, and ensuring that skills development is targeted, effective, and accessible to everyone. "
        },
        {
            "text": "Whether you’re looking to advance your career, support others in theirs, or plan for your organisation’s future, the UK Standard Skills Classification provides the foundation for making informed, strategic decisions about skills. "
        },
        {
            "text": "We’re excited to see how you’ll use it, and we look forward to your feedback as we continue to develop this resource. "
        },
        {
            "heading": 2,
            "text": "How to use the UK Skills Explorer"
        },
        {
            "text": "With the UK Skills Explorer, you can explore skills, occupations, knowledge, core skills and qualifications by navigating the tabs on the top bar of the website or the links on the left-hand side. "
        },
        {
            "heading": 3,
            "text": "Home"
        },
        {
            "text": "Under the 'home' tab, you can use the intelligent search to explore this prototype version of the UK Standard Skills Classification, filtering for: "
        },
        {
            "text": "For example, a search for 'welding' will bring up results for skills such as ‘Perform tungsten inert gas (TIG) welding’ and ‘Perform shielded metal arc welding (SMAW)’; knowledge areas like ‘Spot Welding Machines’; and occupations such as ‘Plate welders’ and ‘Pipe fitters’. "
        },
        {
            "text": "These filters can also be viewed individually, as explained below. "
        },
        {
            "heading": 3,
            "text": "Skills"
        },
        {
            "text": "Under the 'skills' tab you can explore all skills at the most detailed level of the classification; at more aggregated levels like skill groups, areas or domains; or industry sectors. "
        },
        {
            "text": "For example, filtering by the domain ‘Programming & Implementing (Digital Tools & Systems)’ displays the 170 skills within this domain.   "
        },
        {
            "text": "The dynamic filtering allows you to narrow down your search further to the relevant: "
        },
        {
            "text": "Selecting these filters will display the 4 most relevant skills. You can then click on each of the skills to explore them further. "
        },
        {
            "heading": 3,
            "text": "Occupations"
        },
        {
            "text": "Under the 'occupations' tab you can explore all occupations at the most detailed level of the 2020 version of the Standard Occupational Classification by search, or by job groups and Sector Subject Areas (SSAs). "
        },
        {
            "text": "For example, filtering by the job group ‘Caring Personal Service Occupations’ and the SSA ‘Health and social care’ returns 28 occupations such as ‘Home care workers’ and ‘Residential care workers’. "
        },
        {
            "heading": 3,
            "text": "Knowledge"
        },
        {
            "text": "Under the 'knowledge' tab you can explore knowledge by search, or by SSA and concept types.  "
        },
        {
            "text": "For example, filtering by the SSA ‘Engineering’ and concept type of ‘Subject’ returns 96 knowledge subject concepts. Adding the further search term of ‘electrical engineering’ to the search box returns 8 knowledge subject concepts including ‘Electrical Engineering’ and ‘Computer Engineering’. "
        },
        {
            "heading": 3,
            "text": "Core Skills"
        },
        {
            "text": "Under the 'core skills' tab you can explore core skills, which are the essential foundational abilities that underpin various skills and occupations. "
        },
        {
            "text": "The categories are: "
        },
        {
            "heading": 3,
            "text": "Qualifications"
        },
        {
            "text": "Under the 'qualifications' tab you can explore all qualifications (including Higher Education, Ofqual registered qualifications and Skills England apprenticeships) by search, or by SSA, qualification types and Regulated Qualifications Framework (RQF) levels. "
        },
        {
            "text": "For example, filtering by the SSA ‘Science’, qualification type of ‘Apprenticeship’ and RQF level of 6 returns 4 qualifications including the ‘Biomedical scientist’ apprenticeship. "
        },
        {
            "heading": 3,
            "text": "Feedback Functionality "
        },
        {
            "text": "The digital tool allows users to leave their feedback on the classification.  This functionality can be found on the pages relating to particular skills, occupations, knowledge and qualifications. "
        },
        {
            "text": "For example, on the page for 'S.0005 - Adapt leadership style to different situations' you can click on the \"Provide feedback\" icon (see the icon in the image below, top right, circled in red) and give free text feedback on the featured skill's title.  "
        },
        {
            "text": "Alternatively, you can give feedback on each section of the page where you can either enter free text feedback or select feedback from a set of pre-defined options, for example that the ranking of a particular related concept is \"Too High\" "
        },
        {
            "heading": 3,
            "text": "Data Downloads"
        },
        {
            "text": "The digital tool also allows users to create a login and download the data that sits behind the Skills Explorer tool. Access to an API will also be available soon.  "
        },
        {
            "text": "Frank Bowley  "
        },
        {
            "text": "Deputy Director of Analysis and Insight, Skills England "
        }
    ]
}