{
    "url": "https://digitaltrade.blog.gov.uk/2025/11/27/launching-the-export-support-chatbot-empowering-small-businesses-to-go-global/",
    "title": "Launching the Export Support Chatbot: Empowering small businesses to go global",
    "authors": [
        "Kai Hellstrom, Senior Product Manager"
    ],
    "categories": [
        "Products"
    ],
    "pub_date": "2025-11-27T10:30:50+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Kai Hellstrom"
        },
        {
            "text": "Small businesses are a core part of the UK economy. They drive innovation, create jobs, and support communities across the country. Yet when it comes to exporting and scaling up, finding the time to understand the process can be daunting. Small Business Saturday is held on the first Saturday in December, but its impact extends beyond this as a national effort to highlight small businesses' contributions to our communities and economy. This blog discusses how the Department for Business and Trade’s (DBT's) digital team works to help these businesses all year round."
        },
        {
            "text": "DBT offers businesses in the United Kingdom and beyond a range of learning and support services on its Digital Business Growth Service website, business.gov.uk. This digital service brings together valuable sources of information for small businesses to help them understand how to start or grow their business."
        },
        {
            "text": "A key component of our support to business is the information it provides regarding how to export, or how to access the department’s export support services."
        },
        {
            "heading": 2,
            "text": "Understanding the problem"
        },
        {
            "text": "Through extensive user research with small business owners, it is clear that the exporting process is often hindered by several key pain points:"
        },
        {
            "text": "Recognising these obstacles, the team set out to create a solution that would simplify the fractured support landscape and empower small businesses to act with confidence."
        },
        {
            "heading": 2,
            "text": "Testing the solution"
        },
        {
            "text": "The Export Support Chatbot is designed to be a trusted companion for all businesses looking to navigate the complexities of exporting. Powered by artificial intelligence, it provides instant, authoritative answers to a wide range of export-related questions. The chatbot is in the Private-Beta testing stage, meaning that it is currently available by invite only to a small number of randomly selected business.gov.uk account holders."
        },
        {
            "text": "The invited users have been engaging with the chatbot for a 2-month trial period to ask any export focused questions that they have."
        },
        {
            "text": "This approach has allowed the team to learn about how businesses interact with a government chatbot in a controlled environment. We hope to learn about the types of questions asked, how they are phrased, and understand the expectations of responses provided. By analysing the questions and responses, we can refine the chatbot’s performance and enable it to provide even better responses over future iterations."
        },
        {
            "text": "Developing an AI-powered chatbot for government presents unique challenges. While chatbots can be spun up in less than an hour, accuracy and trust are paramount and this requires work. The chatbot draws exclusively from verified government and partner sources with the relevant citation - to ensure that businesses receive accurate and up-to-date information.  These safeguards have helped us maintain trust and transparency in the chatbot. They have also allowed us to better understand the types of questions that the chatbot will respond to, and those that it will not."
        },
        {
            "text": "We recognise that some business users might prefer human interaction, so we’ve also implemented options to easily connect with our team of export advisers for more complex queries."
        },
        {
            "text": "Our approach has been collaborative and iterative, and by starting with a focused set of export topics only, we can learn quickly and expand responsibly. We collaborated closely with our internal subject matter experts and monitoring evaluation teams.  This ensured that the chatbot was providing accurate, relevant, and meaningful responses before we opened it up to select businesses."
        },
        {
            "heading": 2,
            "text": "What we're learning: Real impact for small businesses"
        },
        {
            "text": "Early feedback from users has been encouraging. Businesses appreciate the speed and clarity of the chatbot’s responses, because it often brings multiple sources of information together from various sources. This saves time and avoids the frustration of having to search through multiple sources to find answers."
        },
        {
            "text": "As we continue to iterate and build, the Private Beta will help us to better understand where businesses most need support. This allows us to refine the chatbot’s content and features to be as helpful as possible and determine how we can best expand and scale."
        },
        {
            "heading": 2,
            "text": "Looking ahead: Scaling support for small businesses"
        },
        {
            "text": "The Export Support Chatbot is just one new step on the journey to transform our digital support for small businesses."
        },
        {
            "text": "Our ambition is to expand the offer available to include a wide range of support for all aspects of starting and running a business. These include assistance in understanding finance options and how to access them, help navigating and understanding the regulations that apply to running a business, and support by providing onwards journeys onto network and partner services available to them.  By bringing all this trusted information together for small businesses, we hope that the chatbot can have a real impact in allowing small businesses across the UK to scale up and make the most of global growth opportunities. This is something we should celebrate on Small Business Saturday and all year round."
        },
        {
            "text": "We have an extensive programme of work to improve how we support businesses to start up, grow, run, export and invest. Read about it in these blogs on our first public-facing AI tool that helps businesses find funding opportunities and the launch of Business.gov.uk.  "
        }
    ]
}