{
    "url": "https://marinedevelopments.blog.gov.uk/2025/11/27/marine-planning-engagement-at-rtpi-conference/",
    "title": "Marine Planning Engagement at RTPI Conference",
    "authors": [
        "Mae van Loaf, Coastal Marine Planner (South West)",
        "Ellie Hoad, Coastal Marine Planner (South West)"
    ],
    "categories": [
        "marine planning"
    ],
    "pub_date": "2025-11-27T09:38:21+00:00",
    "content": [
        {
            "text": "The South West Coastal Planners from the Marine Planning team recently attended the Royal Town Planning Institute (RTPI) conference in Exeter, joining sessions on planning conditions, flood risk standing advice from the Environment Agency, and Nature-Based Solutions. These discussions offered valuable insights into integrating sustainable approaches into planning and policy-making, particularly in coastal and marine contexts."
        },
        {
            "text": "Interactive Marine Spatial Planning Workshop – Positive FeedbackFor the workshop, Mae and Ellie, Coastal Planners for the south west marine plan area, delivered an adapted version of our Marine Spatial Planning (MSP) challenge. Delegates stepped into the shoes of different marine stakeholders, such as fishers, offshore wind developers, and tourism operators, to explore the complexities of balancing sector priorities with environmental and social goals. Participants who played the role of Marine Planners used a decision-making framework they created for activities to prioritise or deprioritise, drawing on their own experience and expertise to balance economic, environmental, and social objectives."
        },
        {
            "text": "It was a highlight of the overall event, and feedback was overwhelmingly positive, with praise on the workshop as “a really useful insight into the competing issues involved in marine spatial planning” and other comments said the interactive element of the workshop was both enjoyable and effective in illustrating the challenges and opportunities of strategic marine planning."
        }
    ]
}