{
    "url": "https://teaching.blog.gov.uk/2025/11/27/pupil-premium-profiles-improve-disadvantaged-outcomes/",
    "title": "Using pupil profiles to improve disadvantaged outcomes",
    "authors": [
        "Elkie Bailes"
    ],
    "categories": [
        "Pupil Premium"
    ],
    "pub_date": "2025-11-27T15:49:13+00:00",
    "content": [
        {
            "heading": 2,
            "text": "At a glance"
        },
        {
            "text": "Understanding each child as an individual lies at the heart of The Greetland Academy’s pupil premium strategy. This West Yorkshire primary school - part of the Great Heights Academy Trust – has achieved positive outcomes for disadvantaged pupils, well above the national average. Assistant Principal Elkie Bailes shares the strategies that are helping every child thrive."
        },
        {
            "heading": 2,
            "text": "Our school context and pupil premium cohort"
        },
        {
            "text": "There are currently 383 children between the ages of 4 and 11 attending The Greetland Academy. Approximately, 13.3% of pupils are eligible for pupil premium funding, considerably below the national average for primary schools."
        },
        {
            "text": "At our school, some pupil premium children face lower attendance and underperform in Maths and English compared to their peers, with gaps widening for those with SEND who make up 41% of this group."
        },
        {
            "text": "Disadvantaged pupils often lack rich experiences outside school, limiting vocabulary and contextual knowledge. Post-pandemic, there was a rise in pupils needing social and emotional support, further impacting learning across the curriculum."
        },
        {
            "text": "While these barriers were common, we know that our disadvantaged pupils are not a homogeneous group. As schools we are rich in data, but we recognised the challenge of joining up this data to develop a full picture of the whole child, their family, and community."
        },
        {
            "heading": 2,
            "text": "Our pupil premium strategy: Quality-first teaching and individual profiles"
        },
        {
            "text": "At The Greetland Academy, we are united around a belief that all children should reach great heights and fulfil their potential. Evidence shows that high-quality teaching is the biggest lever that we have to improve outcomes for disadvantaged pupils. We have prioritised professional development to ensure all pupils are immersed in a language-rich environment and we offer a range of oral language interventions as part of our targeted academic support to boost reading and attainment.  "
        },
        {
            "text": "We have also developed individual one-page plans tailored for each of our vulnerable learners. By engaging with teachers, pupils, and wider teams, we developed bespoke plans highlighting each child’s strengths, needs, current provision, and support strategies. When staff at every level understand the varied needs of disadvantaged pupils and believe in their potential, identification of barriers becomes a tool for empowerment rather than deficit-finding."
        },
        {
            "text": "The plans are shared with all adults working in the classroom, ensuring consistency and enabling staff to provide targeted support that helps every child succeed. These plans are living documents, regularly reviewed and updated by teachers to remain current and effective."
        },
        {
            "heading": 2,
            "text": "Pupil premium impact: 2025 outcomes and pupil voice"
        },
        {
            "text": "Early signs of success are evident in the 2025 data. At the end of Key Stage Two, 100% of children eligible for pupil premium funding met the expected standard in Reading, Writing, and Maths, and all Pupil Premium pupils passed the Year 1 Phonics Screening Check. Feedback gathered through pupil voice sessions with school governors revealed that children spoke positively about the opportunities provided by the school and the support they receive in class.  "
        },
        {
            "heading": 2,
            "text": "Next steps for sustainability"
        },
        {
            "text": "We are now focusing on how we can sustain the approach by normalising use of pupil profiles within existing structures. We are also developing the use of the profiles as a transition tool at entry and exit points."
        },
        {
            "text": "When considering barriers to learning for particular children, we challenge ourselves to think about what we can do differently to help them succeed. These adaptations to our curriculum, our teaching, and wider provision can help all children to achieve their full potential."
        },
        {
            "heading": 2,
            "text": "Find out more"
        },
        {
            "text": "Department for Education (DfE) publications  "
        },
        {
            "text": "Education Endowment Foundation resources  "
        },
        {
            "text": "DfE pupil premium webinars  "
        }
    ]
}