{
    "url": "https://naturalengland.blog.gov.uk/2025/11/27/rediscovering-the-value-of-water-meadows/",
    "title": "Rediscovering the value of water meadows",
    "authors": [
        "Edward Parrott"
    ],
    "categories": [
        "Biodiversity",
        "Connecting People with Nature",
        "Landscape",
        "Natural England",
        "Nature"
    ],
    "pub_date": "2025-11-27T14:57:50+00:00",
    "content": [
        {
            "text": "By  Edward Parrott, Senior officer - Agri-Environment Evidence team, Natural England"
        },
        {
            "text": "Earlier this year I had the pleasure of joining contractors LUC and industry experts on a visit to Harnham water meadows - a rare surviving example of a centuries-old farming innovation that once shaped the English countryside.  "
        },
        {
            "text": "The visit was part of a two-year evaluation project, funded through the Natural England Agri-Environment Evidence (AEE) programme and delivered by LUC and CCRI. The project is looking closely at agri-environment scheme options designed to support this habitat and aims to give a clearer picture of what’s working, and ways to improve."
        },
        {
            "text": "The attendees on the day kindly permitted me to do some filming and capture interviews. We arrived early to catch the dramatic light of a low-sun spilling across the undulating water meadows. The weather was perfect and I got a drone up into the air to gain the aerial perspective. From this, I’ve produced a video showcasing the uniqueness of historic water meadows as a habitat, as an agricultural technique, as a community asset and celebrate the incredible dedication of the people who manage them."
        },
        {
            "heading": 4,
            "text": "What are water meadows and how do we manage them?"
        },
        {
            "text": "Water meadows are a historic agricultural practice which emerged in England in the 16th century. Hadrian Cook (Harnham Water Meadows Trust) explains that the meadows at Harnham are thought to be around 400 years old. Located on the western edge of Salisbury, the meadows sit within the River Nadder system and span around 100 acres.  "
        },
        {
            "text": "These meadows use a network of channels, ditches and sluices to ‘float’ or ‘drown’ the land with a shallow layer of flowing water — typically around 25mm deep. This process, known as ‘drowning,’ warms the grass, deposits nutrient-rich silt and provides oxygen to the soil, stimulating early grass growth – a term known as ‘early bite.’ Historically this helped support more livestock through the winter months which otherwise would have had to have been slaughtered. "
        },
        {
            "text": "Harnham is managed under a Higher Tier Countryside Stewardship agreement with advice from Natural England. This agreement supports the water meadow management and specifically the need to drown the meadows in the early part of the year in alternate weeks over a 6–8-week period. Volunteers manage the sluices daily during this period to ensure the water keeps flowing to avoid the water stagnating and negatively impacting grass growth.  "
        },
        {
            "heading": 4,
            "text": "Water meadows in the past"
        },
        {
            "text": "Traditionally livestock would have grazed the early bite and then the water meadow may have been drowned again to stimulate grass for a hay crop. Water meadows like Harnham supported what’s known as a sheep-corn system. The meadows were grazed in the day by sheep which were then taken off around 4pm to fold overnight in nearby barley and corn fields. This was an efficient way of transporting the fertility provided by the flooding, onto the arable land and caused significant increases in crop yield. Good for the water meadow habitat, good for water quality, good for agricultural production. This is regenerative farming at its core. "
        },
        {
            "text": "Of course, the medieval economy and society relied much more heavily on horses and draft animals than it does today. Hay was an essential and valuable commodity to keep these animals alive outside of the growing season, and water meadows were an intensive way of producing hay at times when other grasslands were unsuited to do so."
        },
        {
            "text": "Harnessing the fertility and production potential of the water meadows was labour intensive. Naturally, the cost/benefit of this effort shifted following the industrial revolution at the latter end of the 19th century. Agriculture became more mechanised and horses less essential for day-to-day life. As expected, traditional water meadow management dropped off at this point in history.  "
        },
        {
            "heading": 4,
            "text": "Water meadows today"
        },
        {
            "text": "While hay cropping was historically important, it’s rarely practiced today due to the undulating topography and the damp ground making it unsuitable for modern machinery.   "
        },
        {
            "text": "A flock of sheep graze the Harnham water meadows, but as industry expert Dr Kathy Stearne from KIS Landscape Ecology explains: \"it doesn’t have to be sheep or cattle, it could be llamas or water buffalo – you’re looking for a light animal that doesn’t pull the sward out when it grazes.\""
        },
        {
            "text": "I would personally love to see llamas splashing around these places."
        },
        {
            "text": "Water meadows offer a host of benefits. They can support nature recovery, by providing habitat for plants and animals, they improve health and wellbeing by fostering community engagement with nature, and they deliver security through nature, providing flood storage and cleaning river water. Harnessing these benefits is only possible through working closely in partnership with communities, in this case the Harnham Water Meadows Trust who provide expert local knowledge to operate the meadows and engage their communities. "
        },
        {
            "text": "Walking (splashing) through Harnham’s meadows, it’s easy to see how these landscapes are valuable community assets — rich in wildlife and history. Yet despite their value, many water meadows have fallen out of use. They are labour intensive and require specialised skills to manage."
        },
        {
            "heading": 4,
            "text": "Managing for the future"
        },
        {
            "text": "Historic water meadows have been funded through government schemes for the past 20 years. Through Environmental Land Management (ELM) schemes, land managers are continuing to be incentivised to protect and restore such heritage-rich landscapes. "
        },
        {
            "text": "Today, the challenge is to manage water meadows for biodiversity, heritage, water quality, and community engagement. Objectives vary with some sites focusing on aquatic invertebrates and marginal vegetation (like southern damselfly), others on diverse flora, or overwintering birds and breeding waders. Striking the right balance and unlocking the potential of each water meadow site is not simple and requires expert case-by-case advice. Something we at Natural England aim to support with.  "
        },
        {
            "text": "The agri-environment evidence report will be published online on Defra Science in 2026. The report will summarise insights from literature reviews, field surveys and interviews with agreement holders and industry experts to identify the key barriers to uptake and recommendations for improving delivery of water meadow related options and capital works.  "
        },
        {
            "heading": 4,
            "text": "Sharing the story"
        },
        {
            "text": "I invite you to experience these historic landscapes from above and hear from the people who manage them. Click below to explore Harnham with us. "
        }
    ]
}