{
    "url": "https://ofqual.blog.gov.uk/2025/11/27/understanding-and-improving-access-arrangements/",
    "title": "Understanding and improving access arrangements",
    "authors": [
        "Amanda Swann"
    ],
    "categories": [
        "A levels and GCSEs",
        "Exams"
    ],
    "pub_date": "2025-11-27T09:30:00+00:00",
    "content": [
        {
            "text": "Back in July we withdrew our official statistics on access arrangements for GCSEs, AS and A levels covering 2014 to 2024, after identifying significant issues with how data had been recorded and reported. Today we are pleased to be following that up by publishing revised statistics, alongside new research and a regulatory report that confirms what we expect from exam boards. The report sets out several specific areas where we believe improvements can be made."
        },
        {
            "text": "Here's a summary of:"
        },
        {
            "heading": 2,
            "text": "What the official statistics show"
        },
        {
            "text": "As we explained in July, previous figures did not give an accurate picture of the number of students receiving access arrangements within a specific year’s exam cohort. This was not because arrangements were being granted inappropriately, but rather due to limitations of the data source we used for our reporting. These included counting students who held valid arrangements but didn't sit exams in the given year, and not being able to filter out duplicate applications."
        },
        {
            "text": "The new statistics – for the 2024 to 2025 academic year and going back to 2015 to 2016 – use an improved methodology that focuses only on arrangements granted to students who were actually assessed in each year. They show that 25% extra time was granted for 16.6% to 25.5% of all students being assessed in 2024 to 2025, compared with 14.7% to 20.6% in 2023 to 2024."
        },
        {
            "text": "This means the proportion of exam students with an approval for 25% extra time is lower than the previous data suggested, and broadly in line with the rate of special educational needs (SEN) in the student population (as reported by the Department for Education)."
        },
        {
            "text": "We have given ranges rather than absolute numbers to reflect the complexity of the data. The upper end of the ranges will decrease when these figures are updated next year, as new data becomes available. You can read more about our improved methodology in the regulatory report."
        },
        {
            "heading": 2,
            "text": "What our research found"
        },
        {
            "text": "Like everyone else, we had seen for some time that demand for access arrangements had been rising, and with it pressure on exam boards and schools and colleges to keep on meeting that demand. We wanted to better understand this, and to identify anything that could be done to improve the system."
        },
        {
            "text": "So our research, data and policy experts went to work, analysing the available evidence and data. Our work focused on the granting of 25% extra time in exams, as this is the most common exam-board approved arrangement, as well as the concept of time in assessment."
        },
        {
            "text": "Our research found limited evidence of students experiencing time pressure (also known as “speededness”) in GCSE, AS and A level exams, although this varied across subjects and student groups. While these exams are not designed to assess students' ability to work under time pressure, the interaction between exam tasks, duration and individual students can create unintended speededness for some students."
        },
        {
            "text": "We heard a range of views about the current system, including concerns from schools and colleges about the increasing workload and costs involved in identifying appropriate arrangements, evidencing student need, and administering access arrangements."
        },
        {
            "text": "There was, however, support for the core principle that access arrangements should be based on a student’s individual needs. The system generally meets this purpose, but we have identified some aspects which could be improved."
        },
        {
            "heading": 2,
            "text": "What we expect exam boards to do, and what we will do"
        },
        {
            "text": "Ofqual already has rules in place for what exam boards need to do in relation to access arrangements. They must also comply with equalities law."
        },
        {
            "text": "But as well as this, and as a result of our findings, we have told the exam boards that we expect them to:"
        },
        {
            "text": "We will monitor the exam boards’ progress in these areas as part of our normal regulatory approach."
        },
        {
            "text": "Also, as we respond to the government’s proposals following the Curriculum and Assessment Review, we will consider our requirements around assessment duration for GCSEs, AS and A levels. We will also take this into account in setting our requirements for the proposed new post-16 qualifications, such as V levels. We will confirm our regulatory expectations for exam boards following that work."
        },
        {
            "heading": 2,
            "text": "An access arrangements system we can all be confident in"
        },
        {
            "text": "The research and analysis we have done shows our commitment to ensuring the access arrangements system functions effectively and is reported on accurately. It has taken time, but that’s because it’s complex. It’s also really important."
        },
        {
            "text": "And the improvements we’ve asked exam boards to make will ensure students continue to receive the support they need to demonstrate their knowledge, skills and understanding, while minimising burden on the schools and colleges managing these vital arrangements."
        }
    ]
}