{
    "url": "https://environmentagency.blog.gov.uk/2025/11/27/update-progress-on-managing-the-kidlington-illegal-waste-site/",
    "title": "Update: Progress on managing the Kidlington illegal waste site",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Regulated industry",
        "Uncategorized",
        "Waste"
    ],
    "pub_date": "2025-11-27T16:50:57+00:00",
    "content": [
        {
            "text": "Following our initial blog about the appalling large-scale illegal dumping of waste near Kidlington, we want to update you on the significant progress being made to protect the community and environment. "
        },
        {
            "text": "We’ve continued to work with partner agencies, including Cherwell District Council, Oxfordshire County Council and local emergency services, to take action to mitigate the risks to the local environment and community.   "
        },
        {
            "text": "This week, a 39-year-old man was arrested thanks to cooperation between Environment Agency enforcement officers from the Major Investigation team and the South East Regional Organised Crime Unit. Our National Environmental Crime Unit, staffed by highly skilled waste crime investigators, continues to lead the investigation.  "
        },
        {
            "text": "Residents of the area will rightly be concerned about the potential for contamination of the surrounding land and waterways – which is why works have been ongoing at the location over recent weeks to tackle those challenges, as well as a comprehensive programme of monitoring to understand what materials might pose a risk.   "
        },
        {
            "text": "Here is a summary that builds on the actions to date carried out by the Environment Agency and our partners"
        },
        {
            "text": "   "
        },
        {
            "text": "Protecting the community   We have secured the site with Heras fencing to prevent entry to this active crime scene and employed 24-hour security on site. In addition, colleagues at Oxfordshire County Council have closed all footpaths surrounding the affected area. "
        },
        {
            "text": "We remind the public that this is a crime scene, covered by an active restriction order – it is illegal to enter the site. Visiting hampers our investigation and causes further harm to the environment as waste underfoot gets compacted into the ground or dispersed further. "
        },
        {
            "text": "The waste pile is around ten metres from the River Cherwell at its closest point. However, recognising the potential for heavy rainfall or rising floodwaters to cause waste to enter the river, we have put in place large sandbags to further reduce the risk of pollution entering the watercourse.     "
        },
        {
            "text": "Our specialist teams remain on the ground at the site, conducting rigorous assessments of risks to the River Cherwell, monitoring environmental impact, and taking immediate action where needed. We will continue this intensive monitoring and enforcement work until the site is secured, and any environmental damage is addressed.   "
        },
        {
            "text": "Managing fire risk "
        },
        {
            "text": "Oxfordshire County Council Fire and Rescue Service has been on site to assess any potential fire risk using thermal imaging technology. Firefighters checked the waste pile for any hot spots that could lead to a fire breaking out. They also visited the site to see how they would enter quickly if they needed to respond in an emergency.   "
        },
        {
            "text": "Keeping firefighters and the local community safe is central to our planning as we continue to monitor the risk of this illegal waste site. "
        },
        {
            "text": "Waste clearance   "
        },
        {
            "text": " Work continues with partners to look at options for removal and disposal of the waste. Unlike the offenders, who showed no regard for the environment or impacts on the local community, the Environment Agency and partners will ensure that this is done in a safe and managed way to prevent further damage and minimise risk to the environment.    "
        },
        {
            "text": " While we cannot give a timeline for this work, we ask the public to remain patient whilst the necessary steps are put in place, in the knowledge that all partners are working together to manage the current risks.   "
        },
        {
            "text": "Investigation   "
        },
        {
            "text": "Following the arrest of an individual on Tuesday, the partners continue to work closely to progress the investigation into this incident.    "
        },
        {
            "text": "Any information from the public can be reported to the Environment Agency via its 24-hour incident hotline at 0800 807060 or anonymously via CrimeStoppers.  "
        },
        {
            "text": "Factual corrections"
        },
        {
            "text": "Why are you not calling this fly tipping? It is clear from the waste on site that is has been through a mechanical treatment process and is not waste dumped by opportunists. The way in which it has been dumped suggests it is organised criminality and will be investigated as such by our National Environmental Crime Unit. "
        },
        {
            "text": "Why did you only start investigating when the media got involved?  This is not true. We started our investigation in July before news of the site reached the media in October.  "
        },
        {
            "text": "Why can’t you fine those you believe to be involved immediately?  Civil sanctions are generally not appropriate where the offending is deliberate. Due to the nature of how the waste has been deposited it appears to have been a deliberate act and we are therefore pursuing a criminal investigation.   "
        },
        {
            "text": "Investigations potentially involving a network of offenders can be complex and take time. We have specialist resources assigned to the investigation, both from the EA and partner organisations. We must follow all lines of enquiry to present a strong case to court, who make decisions based on the evidence, to get the best outcome for the taxpayer.  "
        },
        {
            "text": "Why didn’t you act sooner? We were on site within days of the site being reported and immediately confirmed it as a high-risk illegal waste site and went on to take urgent action. While we act immediately, we also rely on information from the public to alert us to illegal waste sites and the quicker we are made aware the quicker we can act. "
        },
        {
            "text": "Read more on the blog about what we're doing to combat waste crime. "
        }
    ]
}