{
    "url": "https://educationhub.blog.gov.uk/2025/11/what-the-budget-means-for-young-people/",
    "title": "What the Budget means for young people ",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Students",
        "Universities"
    ],
    "pub_date": "2025-11-27T07:00:00+00:00",
    "content": [
        {
            "text": "Today the Chancellor announced the Autumn Budget, setting out changes that will affect young people in higher education. "
        },
        {
            "text": "Students from low-income families will get extra money to help with day to day costs at university. This will help support more students from the lowest income households progress into and excel in higher education. "
        },
        {
            "text": "Here's what these changes mean for you in more detail. "
        },
        {
            "heading": 3,
            "text": "Will I get extra money to help with costs at university? "
        },
        {
            "text": "If you're from a low-income family and studying certain subjects full-time at university, you'll be able to get a maintenance grant from 2028/29. This money, which you don’t have to pay back, and comes on top of your student loan, will help break down financial barriers so that more young people, regardless of background, can access the opportunities higher education offers."
        },
        {
            "text": "If you're from a low-income family and studying certain subjects full-time at university, you'll be able to get a maintenance grant from 2028/29. This is money you don't have to pay back, and it comes on top of your student loan. "
        },
        {
            "text": "The money is there to help with everyday costs like food, travel and bills whilst you're studying. You'll get the grant on top of your maintenance loan, which means you'll have more money in your pocket without taking on extra debt."
        },
        {
            "heading": 3,
            "text": "How much money will I get? "
        },
        {
            "text": "If your family's household income is £25,000 a year or less, you’ll get £1,000 extra each year in your first and second years of study. If your family's household income is between £25,000 and £30,000, you'll get between £500 and £1,000. "
        },
        {
            "text": "In your third year onwards, if you remain eligible, you'll get up to £750 if your household income is £25,000 or less, and between £375 and £750 if it's between £25,000 and £30,000. "
        },
        {
            "text": "This means you get the most support in your first two years when you're starting university and settling into student life. All students will also benefit from maintenance loans going up with inflation every year. "
        },
        {
            "heading": 3,
            "text": "When will these maintenance grants be introduced? "
        },
        {
            "text": "The grants are being paid for by a new charge on international student fees. Both the grants and this charge will start from academic year 2028/29. "
        },
        {
            "text": "The good news is that if you're already at university when the grants start, you'll still be able to get them. You don't need to delay going to university to benefit from this support. "
        },
        {
            "heading": 3,
            "text": "Which university courses can I get a grant for? "
        },
        {
            "text": "The grant will be available for courses in subjects that support the skills the country needs for the future. We’ll announce which courses are included before the grants start in 2028/29. "
        },
        {
            "heading": 3,
            "text": " What if my course is longer than three years? "
        },
        {
            "text": "If you're studying a longer course, you can get the grant for every year you're studying, as long as you meet the household income requirements and still qualify for a means-tested maintenance loan.  "
        }
    ]
}