{
    "url": "https://hmlandregistry.blog.gov.uk/2021/11/24/at-the-cutting-edge-our-local-land-charges-programme-wins-coveted-digital-award/",
    "title": "At the cutting edge: our Local Land Charges Programme wins coveted digital award",
    "authors": [
        "Mark Kelso, Local Land Charges Programme Director"
    ],
    "categories": [
        "Local Land Charges"
    ],
    "pub_date": "2021-11-24T10:45:39+00:00",
    "content": [
        {
            "text": "Earlier this month the Local Land Charges Programme won the coveted Geospatial Innovation of the Year category in the Digital Leaders 100 awards 2021. These awards celebrate individuals and organisations from the public, private and non-profit sectors who demonstrate a pioneering and sustainable approach to digital transformation in the UK."
        },
        {
            "text": "We are incredibly proud that industry has recognised the importance and long-term benefits of the programme and the national register. The digitisation and centralisation of local land charges services, delivered by local authorities across England and Wales, is one of the most ambitious geospatial data transformations in UK government history."
        },
        {
            "text": "Our Director of Transformation Karina Singh said: “This is a fantastic accolade to the dedication, innovation and perseverance of the team, many of whom have worked on this for years."
        },
        {
            "text": "“We are creating an ecosystem of tools, services, datasets and capabilities that will bring benefits to the property sector for decades to come.”"
        },
        {
            "text": "More than 23,000 votes were cast for the finalists, with a public poll determining the top 3 in each category. The judges recognised the programme as cutting edge, citing our implementation, innovation and collaboration with stakeholders. While celebrating this achievement, it is useful to explore the story of the Local Land Charges Register, which is our first completely digital register and also our first new register for 90 years."
        },
        {
            "heading": 2,
            "text": "What are local land charges? "
        },
        {
            "text": "These are any restrictions or prohibitions on the use of a property. They are usually revealed when a conveyancer conducts a local search on behalf of a buyer. It is a key piece of information that determines how you can use the property and has an impact on its value. Common examples include conditional planning permissions, tree preservation orders and listed building status."
        },
        {
            "heading": 2,
            "text": "How it all started"
        },
        {
            "text": "In 2010, the programme developed the concept for a central register for all local land charges data held separately by 331 local authorities in England and Wales. The programme argued that because the services offered by local authorities varied in format, cost and speed, it slowed down the conveyancing process. Requests for searches of the register often required a visit to the local authority and could take days or even weeks. Data couldn’t be merged with other datasets or even compared, impeding the decision-making process. The programme proposed a new central register that would offer instant online search results, in a standard digital format for a fixed fee."
        },
        {
            "text": "The foundation of the programme was laid in 2013. Following approval by Parliament,  responsibility for the local authority registers was transferred to HM Land Registry under the Infrastructure Act 2015."
        },
        {
            "heading": 2,
            "text": "Benefits of a national register"
        },
        {
            "text": "The potential of a complete register has not been imagined yet. What we do know, however, is that every migrated local authority is a step closer to their digital ambition and can refocus their local land charges resource on other priorities. Our customers are guaranteed a standardised service that is available 24/7 and offers instant access to their search results. They have a simpler, resilient and reliable service, able to cope with market upheavals such as lockdown restrictions and surges in search numbers following the stamp duty and land tax holiday of July 2020."
        },
        {
            "text": "The standardised local land charges datasets provide opportunities for innovators to develop social and economic solutions that benefit the wider UK economy. Winning this award is a huge boost to the team, but by no means the end of the story. How we make a difference to the conveyancing and property markets is the real win."
        },
        {
            "text": "Watch the video submitted for the award."
        },
        {
            "text": "For more information about the programme visit our Local Land Charges Programme pages."
        }
    ]
}