{
    "url": "https://socialcare.blog.gov.uk/2021/11/24/care-colleagues-please-get-your-flu-jab/",
    "title": "Care colleagues: please get your flu jab!",
    "authors": [
        "Dr. Éamonn O'Moore"
    ],
    "categories": [
        "Care and support",
        "coronavirus",
        "Workforce"
    ],
    "pub_date": "2021-11-24T16:49:16+00:00",
    "content": [
        {
            "heading": 2,
            "text": "COVID-19 is not the only viral risk"
        },
        {
            "text": "The nights are drawing in and autumn is becoming winter. This change in season brings with it increasing risks from seasonal viruses, including flu and respiratory syncytial virus (RSV) and gastro-bugs like norovirus."
        },
        {
            "text": "Many people receiving care, whether in their own homes or in settings like care homes or supported living centres, are particularly vulnerable to complications of seasonal bug infections. Therefore, it is important we do all we can to protect people most at risk by continuing to follow appropriate infection prevention and control (IPC) advice, and making sure we are vaccinated against not only COVID-19, but flu as well."
        },
        {
            "text": "This year we have seen a real focus on increasing uptake of COVID-19 vaccines in those receiving and delivering care, initially making sure everyone eligible receives two doses of their vaccine and that booster doses are provided to those vaccinated more than six months ago."
        },
        {
            "text": "We now need to consider seasonal flu vaccine, both for vulnerable people and for health and social care workers. Flu is often considered to be a relatively trivial infection, but in truth, it can be very serious and even life-threatening. Levels of circulating flu vary from year to year, as does the nature of flu viruses themselves - and this is why we need to have a flu jab every year to mitigate current threats."
        },
        {
            "heading": 2,
            "text": "Fears of a bad flu season"
        },
        {
            "text": "While last year we saw very little flu across the globe, we are concerned we could see a bad winter flu season this time round. This could result in tens of thousands of deaths, especially among people in high risk categories, including those receiving health and social care."
        },
        {
            "text": "Each year we do our best to protect these vulnerable people by offering vaccination to them and by taking up the offer of vaccine ourselves. I had my flu jab towards the end of September, mindful not just of my own health, but also of the risk my being infected could have for those vulnerable people in my personal and professional life."
        },
        {
            "text": "As I write, there are concerns that insufficient numbers of care staff have taken up their chance to be vaccinated for flu, to protect themselves and those they care for."
        },
        {
            "text": "We know that only high levels of coverage are sufficient to protect the people we care for and the sooner we get those rates higher, the sooner we maximise protection. We must remember as well that protection for flu vaccination takes a couple of weeks to develop following the jab."
        },
        {
            "text": "So, now is the time to get your flu jab. Just like Christmas shopping, it is better to get it out of the way sooner rather than later, for everyone’s benefit!"
        }
    ]
}