{
    "url": "https://mojdigital.blog.gov.uk/2021/11/24/content-hub-launches-into-the-first-young-offenders-institution/",
    "title": "Content Hub launches into the first Young Offenders Institution",
    "authors": [
        "Jane Stead"
    ],
    "categories": [
        "Content",
        "Content Hub Team",
        "Our services",
        "Young Offenders Institution"
    ],
    "pub_date": "2021-11-24T17:34:21+01:00",
    "content": [
        {
            "text": "In July 2021 the Content Hub team in Sheffield were thrilled to go LIVE into HMYOI Cookham Wood, a Young Offenders' Institution (YOI) in Rochester, Kent for boys aged 15 to 18."
        },
        {
            "text": "This will be followed by rollout to the rest of the YOIs in England and Wales by the end of the financial year, as well as another 8 adult sites such as HMP Lindholme also received the technology this summer."
        },
        {
            "text": "What is the Content Hub?"
        },
        {
            "text": "It's a restricted and secure intranet created, designed, developed and written solely for the prison estate. "
        },
        {
            "text": "More specifically, the Content Hub is a platform for prison residents to access prison services and information that both supports individual self-improvement and frees up staff time. Residents can listen to, watch and read a range of educational content, including mental health and addiction support, podcasts, TED talks, inspirational videos, spiritual growth, mindfulness programmes, yoga, in-room exercise regimes, local YOI news, comms and updates, their up-to-date personal information (bank account, timetable, visits and privilege info), as well as relaxation and distraction content, such as games, nature documentaries and 24/7 National Prison Radio (NPR). "
        },
        {
            "text": "As part of the government's ambitious programme to reduce reoffending, the Content Hub has been created and designed to encourage, motivate and empower residents to self-serve, learn about themselves, take responsibility for their actions, think about why their freedom has been taken, improve and educate themselves for the future, access services and find new, healthier ways to keep fit and relax, all of which we hope will continue when they get out. "
        },
        {
            "text": "So, at HMYOI Cookham Wood, staff and boys are each given a laptop and a password. They sign in and they're off."
        },
        {
            "text": "The 'Homepage' is where the boys can:"
        },
        {
            "text": "Research to reduce violence and boredom in YOIs"
        },
        {
            "text": "For YOIs, we focused research on how in-cell digital content might help address causes of violence - a government priority for the youth custody sector. "
        },
        {
            "text": "Senior User Researcher, Will Finn, found that existing communication relied heavily on paper notices and word-of-mouth which often resulted in boys not understanding or even knowing the rules, processes, and how the YOI worked. Not knowing what's going on can breed confusion, frustration, mistrust, and ultimately, anger, sometimes ending in violence. "
        },
        {
            "text": "To address this, we wrote a comprehensive digital rulebook -  'Guide to Cookham Wood' - which states the correct rules, expectations, punishments, problems, how to shop in the canteen, what 'privileges' are, how many visits are allowed, how PIN phones work, along with vital charity 24/7 telephone helplines, and educational and distraction content to soothe the children when alone in their rooms. "
        },
        {
            "text": "This information tested well with boys in custody and will be crucial in improving procedural justice as we digitise the prison service. Evidence suggests trust, consistency and transparency can improve mental health, reduce behavioural problems, and ultimately reduce re-offending. "
        },
        {
            "text": "\"I wish I had this when I first come (to prison). They tell you you get punished and stuff and you lose your TV, but you don’t really understand how it works. Then you have a fight and you lose it for 14 days and you’re shocked. It’s a long time. If I saw that, ahhh, no fights for me”."
        },
        {
            "text": "Comments from a young resident as he saw the 'Guide to Cookham Wood' on a laptop for the first time"
        },
        {
            "text": "Our YOI discovery also identified boredom as another key driver of violence, increased further by social restrictions imposed by the Covid pandemic. The impact of distraction content on the Content Hub, such as music and documentaries should not be underestimated. Users often tell us how a simple nature documentary can have a very positive impact on their mood when locked in their rooms. "
        },
        {
            "text": "\"really helpful while I was having a panic attack to learn ways to cope\" YOI resident"
        },
        {
            "text": "\"helps me to get away from my anxiety, and gives me the motivation I need to workout again\" YOI resident"
        },
        {
            "text": "Research-based YOI content "
        },
        {
            "text": "The Content Hub digital team had already analysed what would hold user interest in the pilot rollout into the first 2 adult male prisons. "
        },
        {
            "text": "We called it 'push-pull content', based on the marketing strategy of the same name. Distraction ('pull') content draws residents in (music, workouts, books, chess) while 'push' content (lived experience stories, 24/7 mental health support, videos and podcasts, mindfulness, yoga, education and rehabilitation content) helps to create new pathways in the brain which can support real change."
        },
        {
            "text": "Much of this content had already been created by the stellar work done by Senior Content Designer, Jo Meek, for release into HMP Berwyn and Wayland. "
        },
        {
            "text": "We built on this, using research done in the YOIs, to create and source 'pull and push' content specific to a young person's needs. We needed to push rehabilitative information across while alleviating boredom and raising mood. It's a delicate balance. If the Content Hub was a simple government information tool, or too authoritarian, it might well get discarded. But if it's more like a mobile phone, with things to read, do, apps to help with banking and canteen, photos of family, it becomes more personal and precious to the boys, therefore not something they would want to break in a fit of anger or rage."
        },
        {
            "text": "Accessibility is paramount"
        },
        {
            "text": "Many children in YOIs have limited reading and understanding skills, as well as concentration disorders, alongside trying to deal with individual trauma, addiction, and mental health problems. "
        },
        {
            "text": "This is why we presented chunks of text as graphics, and as audio and video, including video introductions from staff and governors. "
        },
        {
            "text": "Most importantly, all the content, in whatever medium, had to have an 'authentic voice'. The research found that boys trust and respond better to an authentic voice (YOI boys talking to YOI boys) than a more authoritarian one which they often mistrust and feel has persistently let them down. "
        },
        {
            "text": "Pages of words became infographics"
        },
        {
            "text": "Written content was visualised by brilliant Senior Designer, Olivia Todd, who created a series of infographics, accessible to the boys regardless of problems listed above."
        },
        {
            "text": "Pages of words became audio"
        },
        {
            "text": "We asked National Prison Radio (NPR) to re-format the 'Guide to Cookham Wood' into audio. Boys taking the YOI radio production course voiced the rulebook. Now boys were giving each other the correct and consistent information about their own YOI through their own laptops. "
        },
        {
            "text": "How direct feedback feeds the authentic voice"
        },
        {
            "text": "To maintain an 'authentic voice' on the Hub, direct feedback is vital. We re-formatted the feedback mechanism to allow us to gauge what the boys liked and disliked about the Hub, while continually encouraging the boys to use it. When they leave daily comments telling us what they need, we're reminded every day who our users are, and can respond. Not only does this make the Hub better, content-wise, again it gives the boys a sense of agency and that their views matter. That they matter."
        },
        {
            "text": "Feedback examples since the launch into Cookham Wood"
        },
        {
            "text": "'Focus on you' motivation video: listening to this made me realise the meaning of life."
        },
        {
            "text": "Exercise videos: I think that it has been a wonderful experience I would love to see more! keep it coming. "
        },
        {
            "text": "Not as easy as it looks 🙂 very helpful I have been doing this for a week and can see my abs coming out. "
        },
        {
            "text": "Everything you know about addiction is wrong (TED Talk): Like this Ted thing... going to watch this when I'm out"
        },
        {
            "text": "Dealing with panic and anxiety: very good information. "
        },
        {
            "text": " "
        },
        {
            "text": "Next time..."
        },
        {
            "text": "There is so much more to tell... so in our next blog, we'll talk about how our work in Cookham Wood has instigated cross-agency collaboration across the rest of the youth estate and youth sector agencies. "
        },
        {
            "text": "Until then, if you and your team could use the Hub to communicate with people living in the prison estate, please get in touch. Email any questions and ideas you have to hubcontentteam@digital.justice.gov.uk"
        }
    ]
}