{
    "url": "https://planninginspectorate.blog.gov.uk/2021/11/24/cop26-and-our-sustainability-plans/",
    "title": "COP26 and our sustainability plans ",
    "authors": [
        "David Price"
    ],
    "categories": [
        "Environment"
    ],
    "pub_date": "2021-11-24T16:11:10+00:00",
    "content": [
        {
            "text": "David Price, Head of Operations and Lead for the Environmental Group at the Planning Inspectorate, reflects on the outcomes from COP26 and what our Environmental Policy means for our sustainability plans.  "
        },
        {
            "text": "With COP26 event in Glasgow now officially at an end, the work done over the last few weeks will most likely have lasting impact on us all in the time to come. The conclusion of the event is documented in the Glasgow Climate Pact which sets out the agreement reached by the nearly 200 countries involved."
        },
        {
            "text": "The agreement includes commitments to science, adaptation, finance, technology, mitigation, loss and damage, implementation, and collaboration. We’ve been watching the event with interest and following the agreements as they’ve been reached. But it will be some years before all of the details feed through to practice – just as did the Paris agreement. "
        },
        {
            "text": "The activities in the run up to, and beyond, COP26 only serve to highlight the global importance attached to the effective management of our environmental resource. Environmental impacts, of one description or another, often appear prominently in our work. The Planning Inspectorate has an important role in ensuring impacts are fully considered in the planning of new places. The recent enactment of the Environment Act brings the power to set new legally binding standards on air quality and restoring natural habitats among other important changes. Much of the detail will appear in secondary legislation, so we will be keeping our Inspectors and environmental professionals up to date to ensure they can continue to be well-placed to deliver our services effectively according to relevant policy and legislation. "
        },
        {
            "heading": 3,
            "text": "Our Environmental Policy: to leave the environment in a better condition for future generations"
        },
        {
            "text": "Over the last 12 months, I’ve been working with colleagues to deliver our business plan objectives on the environment and to positively influence the activities and behaviours of the whole organisation. The Planning Inspectorate recently produced its Environmental Policy which includes an aim to leave the environment in a better condition for future generations and is an important pillar in our establishing environmental management system.  "
        },
        {
            "text": "Work is underway to reduce our emissions, manage our waste, become a responsible organisation in relation to procurement and to be open with regards to our environmental performance. This is challenging us to look at the way we work and the things we do to positively influence the activities and behaviours of the whole organisation. "
        },
        {
            "heading": 3,
            "text": "IEMA corporate partnership"
        },
        {
            "text": "We are in the process of establishing a corporate partnership with the Institute of Environmental Management and Assessment (IEMA), following the lead of other Government bodies such as the Department for Environment Food and Rural Affairs (DEFRA). We consider maintaining and developing our skills and knowledge of key sustainability principles will act to support the objectives of the organisation as we move forwards and as new challenges arise.  "
        },
        {
            "text": "Corporate partnership manager at IEMA, Alan Darby said: “We are delighted to be welcoming the Planning Inspectorate to our corporate partnership programme at what is a crucial time for organisations. Developing the skills and capability needed to embed sustainability across all parts of the economy will be key to delivering on both the Greening Government strategy, and the UK’s wider transition to net zero.” "
        },
        {
            "text": " “We are thrilled to be supporting the Planning Inspectorate, along with many other central government departments, on this journey. By accessing IEMA’s internationally recognised competency framework and training courses, we are confident that the crucial task of educating and empowering colleagues across the Planning Inspectorate will directly support their fast developing environmental groups and professional networks.” "
        }
    ]
}