{
    "url": "https://despatch.blog.gov.uk/2021/11/24/developing-a-trailer-safety-accreditation-scheme/",
    "title": "Developing a trailer safety accreditation scheme",
    "authors": [
        "Mark Winn"
    ],
    "categories": [
        "Feature"
    ],
    "pub_date": "2021-11-24T10:19:25+00:00",
    "content": [
        {
            "text": "Over the last few months, we’ve been preparing for changes to car and trailer  testing. We’re planning to launch a voluntary trailer safety accreditation scheme which will encourage drivers to get training to help them tow safely and enjoy their towing activity."
        },
        {
            "text": "To make sure we get this right, we’re working with towing and training groups – to look at how to set the scheme up and what it should focus on."
        },
        {
            "text": "Last week, alongside DVSA colleagues, I led some workshops with organisations representing the towing and trailer industry."
        },
        {
            "text": "I’m pleased to say the conversations were positive and engaging – including on what the accreditation scheme could achieve and how it should be delivered. In this blog post, I want to share some of the things we learnt and also what we’re planning to do, going forward."
        },
        {
            "text": "I know the car and trailer test changes have been the subject of much debate recently, which is why we feel it’s really important to engage with towing and training groups on the accreditation scheme."
        },
        {
            "text": "We want motorists to see the accreditation scheme as the right way to find out how to tow a trailer safely, and with confidence."
        },
        {
            "heading": 2,
            "text": "Setting the scene"
        },
        {
            "text": "The workshops were held on 9 November and we asked for feedback on three areas:"
        },
        {
            "text": " The different groups were given some discussion points to help their conversations. For example, those who looked at ‘setting the standard’, considered the duration of training and the environment where it should take place."
        },
        {
            "heading": 2,
            "text": "Reviewing the feedback"
        },
        {
            "text": "For the first topic, on setting the standards of the training, there was a consensus for a modular approach."
        },
        {
            "text": "This would mean providing a basic towing module with additional modules for specific sectors, for example livestock or plant."
        },
        {
            "text": "A number of the groups felt that the driver testing syllabus would be a good starting point for the standard. In other areas, such as the duration of the training, there was a broader range of views."
        },
        {
            "text": "Discussions about the accrediting body or bodies focused on having more than one organisation and including a standard for assessors."
        },
        {
            "text": "Some organisations were also interested in getting more of an understanding about the procurement process DVSA would need to go through to appoint an accrediting body or bodies."
        },
        {
            "text": "On training providers, some of the groups said existing trainers should be able to join and build up their skills, rather than having a new structure for all. They felt that once the scheme had been established, an assessment of new providers could be introduced."
        },
        {
            "text": "There was also a discussion about having a level playing field and whether trainers with good standards/skills could be promoted."
        },
        {
            "heading": 2,
            "text": "Taking this forward"
        },
        {
            "text": "Sadly it’s not possible to share all of the detail from the workshops in a blog post but I hope this has given you a snapshot of the discussions."
        },
        {
            "text": "In this final section, I’d like to tell you about what happens next."
        },
        {
            "text": "We’ll run a follow-up webinar for vocational trainers, to update them on the latest developments and get their thoughts on the accreditation scheme too. We’ll send invitations out for these webinars once they have been arranged."
        },
        {
            "text": "We’re also going to:"
        },
        {
            "text": "We’ll continue to work with the trailer and training industry to share our progress and get feedback."
        },
        {
            "text": "If you have any observations or comments, please post them below."
        }
    ]
}