{
    "url": "https://educationhub.blog.gov.uk/2021/11/24/how-schools-and-parents-can-spot-and-tackle-online-abuse-of-teachers/",
    "title": "How schools and parents can spot and tackle online abuse of teachers",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "School Workforce",
        "Schools"
    ],
    "pub_date": "2021-11-24T08:00:57+00:00",
    "content": [
        {
            "text": "There has been coverage in the media of teachers and other school and college staff receiving abuse on social media platforms including TikTok and Instagram."
        },
        {
            "text": "Here we set out the facts about what online abuse is, what schools can do to tackle it, and what we are doing to support them."
        },
        {
            "heading": 3,
            "text": "What is online abuse?"
        },
        {
            "text": "The government’s draft Online Safety Bill defines online harms as user generated content or behaviour that is illegal or could cause significant physical or psychological harm to a person."
        },
        {
            "text": "Examples of online harms include:"
        },
        {
            "text": "And online abuse isn’t limited to social media – it can happen over text messages or messaging apps, over email, in online chats, online games and on streaming sites."
        },
        {
            "text": "There are different kinds of online abuse and people can be at risk of it from people they know or strangers."
        },
        {
            "heading": 3,
            "text": "We’re aware of stories in the press about teachers and staff being the victims of abuse on TikTok and have worked with the platform to make it easier for videos to be removed."
        },
        {
            "text": "TikTok have confirmed that the best way for parents, schools and colleges to get content removed to is to report content through the Professionals Online Safety Helpline - UK Safer Internet Centre. The Professionals Online Safety Helpline has produced an article and short video on how best to report content."
        },
        {
            "text": "Education Secretary Nadhim Zahawi said:"
        },
        {
            "text": "TikTok has committed to removing content which breaches their community guidelines and people are encouraged to call the helpline on 0344 381 4772 or email helpline@saferinternet.org.uk."
        },
        {
            "heading": 3,
            "text": "It is never acceptable for teachers or anyone to be the subject of any kind of abuse."
        },
        {
            "text": "All schools, colleges and other educational settings should report any online abuse, including videos, to the police."
        },
        {
            "text": "Some incidents can result in a criminal offence being committed and it is important people are aware of the consequences of abuse and the impact it can have on an individual’s mental health."
        },
        {
            "heading": 3,
            "text": "But what about other social media platforms?"
        },
        {
            "text": "We have been clear that social media companies need to take immediate action against harmful content, towards anyone, on their platforms."
        },
        {
            "text": "Other social media platforms have their own guidance on how to report abuse including: Facebook and Instagram, Snapchat and Twitter."
        },
        {
            "text": "Get Safe Online also provides important information and advice on where people can get further help and information such as the National Bullying Helpline."
        },
        {
            "text": "Harmful content can also be reported to ‘Submit a Report of Harmful Content’ (reportharmfulcontent.com)."
        },
        {
            "heading": 3,
            "text": "What are we doing to combat online abuse towards teachers and staff?"
        },
        {
            "text": "We know many settings and institutions are already talking to pupils and students about these issues and we fully support schools and colleges in taking appropriate action against pupils and students who are identified as posting abusive content."
        },
        {
            "text": "Our keeping children safe in education (KCSIE) statutory safeguarding guidance provides all school and college staff with information about different types of abuse and harm, including online abuse. KCSIE was most recently updated on 1 September and among other things now gives online safety the prominence it rightly deserves."
        },
        {
            "text": "The guidance is very clear that:"
        },
        {
            "text": "KCSIE also includes information and tools that schools and colleges can use to help keep children safe online; this includes a dedicated collection of resources to support them in signposting parents and carers to help them keep their children safe from different risks online."
        },
        {
            "text": "Many parents may feel concerned about the activities and content their children are accessing and that’s why we published guidance on “Teaching online safety in schools”. It outlines how schools can ensure their pupils understand how to say safe and behave online."
        },
        {
            "text": "Also, through the introduction of compulsory Relationships, Sex and Health Education (RSHE), pupils are taught about online relationships, the implications of sharing private or personal data (including images) online, harmful content, cyberbullying and where to get help and support."
        },
        {
            "text": "We also continue to work with social media companies, trade unions, the Children’s Commissioner, and interested parties to protect teachers from online abuse."
        },
        {
            "heading": 3,
            "text": "Is there any support for parents?"
        },
        {
            "text": "The following resources provide guidance for parents and carers to keep children safe online. They will, amongst other things, support parents to talk to their children about a range of online safety issues, set up home filtering in a child-friendly way and set up age-appropriate parental controls on digital devices:"
        },
        {
            "text": " "
        }
    ]
}