{
    "url": "https://buyingforschools.blog.gov.uk/2021/11/24/national-network-of-special-schools-nnoss/",
    "title": "National Network of Special Schools (NNoSS)",
    "authors": [
        "Pauline Aitchison, Deputy Director of Schools North East and the Network Lead for the National Network of Special Schools for School Business Professionals"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2021-11-24T13:18:38+00:00",
    "content": [
        {
            "text": "Pauline Aitchison, Deputy Director of Schools North East and the Network Lead for the National Network of Special Schools (NNoSS), talks about the importance of having a peer network for school business professionals who work in special schools and alternative provision."
        },
        {
            "text": "Launch a network for School Business Professionals working in special schools and alternative provision across England. That was the remit presented to me at the beginning of 2020. What a fantastic challenge to be presented with at the start of a new calendar year!"
        },
        {
            "text": "Schools North East is the first and only regional school network in the country, having started in 2007, and I have worked there for the past four years, following almost twenty years as a School Business Manager.  Answering only to our schools, the influence of Schools North East has grown, is growing and is recognised throughout the sector. As Amanda Spielman stated at our 2018 Summit, “The level of engagement and support for schools within the region is clearly very high and it is great to see how Schools North East is acting as a catalyst for change and a forum for constructive discussion.”  On these foundations I would build this network."
        },
        {
            "text": "I have been involved in launching networks in the North East before, but this would be the first national network for us. By applying a model that has proved to be successful over 12 local authority areas this new challenge would see it being tested nationally. The core principles, however, would remain the same: a grassroots, peer-led network for members to connect, upskill and influence through sharing experiences and best practices, while working to drive and deliver change for the benefit of the sector."
        },
        {
            "text": "The scoping work done by the Department for Education prior to launch had shown there was a need and desire for school business professionals (SBPs) working in the special and alternative provision sector to have their own voice and have their unique challenges recognised.  Jo Marchant was one of the SBPs who lobbied the DfE to set up the network playing a key part in the first 12 months and now feels part of a community that didn’t exist before."
        },
        {
            "text": "With all plans in place, launch day in March was fast approaching, but so was a pandemic! The support from the DfE was fantastic but when we heard that Boris Johnson was making a special announcement on 23rd March, we knew it was not going to be the launch of The National Network of Special Schools for School Business Professionals (NNoSS). Instead, the country was plunged into lockdown."
        },
        {
            "text": "The need for school business professional peer support is well known and this only grew during the pandemic. Suddenly schools became the ‘fourth emergency service’ not only ensuring their provision continued but supporting families and communities more than ever.  Much of this fell on SBPs working on the front line and I was, more than once, moved to tears seeing the commitment and dedication they demonstrated to protect colleagues, families and students alike."
        },
        {
            "text": "Schools North East already had a very successful webinar programme and an online community established over the last 3 years. These were always going to play a part in the development of NNoSS, and fortunately, we were in a position to quickly revisit plans to push ahead, ensuring that the required support was there in the virtual world."
        },
        {
            "text": "Despite being launched in a more low-key manner than I anticipated, the response to the network has been phenomenal as hard working, dedicated professionals across special and alternative provision settings reached out for support and to answer the call to collaborate with colleagues across the country."
        },
        {
            "text": "Catheryn Lewis told me that, having only been a member for a few months, it is testament to the power of NNoSS that she feels the network is already an integral part of her role as a school business leader, bringing her confidence, knowledge and empowerment."
        },
        {
            "text": "In its first year, 250 members joined NNoSS from 96 local authority areas across England and 85% have said that their school has benefited from being a part of NNoSS. As well as hosting a summer conference that was opened by Baroness Berridge, we were represented on a range of national platforms from the SAAS, NAHT, and the Department for Education to Schools North East and numerous strategic partners."
        },
        {
            "text": "We also held - and continue to hold - regular virtual meetings to discuss the latest challenges within the sector, as well as bespoke CPD sessions, where members can share, debate and discuss developing their own practice and have insight groups working with the DfE."
        },
        {
            "text": "NNoSS member Peter Collins has a good deal of experience in mainstream schools and he found the move to special schools a steep learning curve. I was fortunate enough to meet Peter for the first time recently and he said that the support and fellowship of NNoSS members has been vital in helping him gain an understanding of the sector to improve his effectiveness."
        },
        {
            "text": "With engagement growing daily, it soon became evident that while the core purpose of the network was to provide a vehicle of collaboration for school business professionals working in the special and alternative sector, it soon became something more."
        },
        {
            "text": "There was a clear and strong desire from its members that NNoSS should be a ‘voice’ of the sector and work to influence and affect change, including around infrastructure, funding and tribunals."
        },
        {
            "text": "Together we were able to successfully lobby for two key issues to help support the sector in the pandemic:"
        },
        {
            "text": "It's pieces of work like this that give the network credibility and I am most grateful for everyone coming together with a desire to be that voice."
        },
        {
            "text": "Speaking with Matthew Smith MBE recently, he told me that it is the ministerial changes that NNoSS encourages that symbolises the network, noting its strong and proactive links with the Department for Education are what the network stands for, as they then go on to provide much needed input and updates to the community in a timely fashion."
        },
        {
            "text": "Matthew is also committed to supporting others in the network and, under the upskilling banner, he recently ran a successful fundraising and bid writing workshop free for members."
        },
        {
            "text": "I recently met up with Conny Brandt at the ISBL conference. Conny believes that it is the support from members that makes the network such a crucial part of her working life. She told me that advice from members had helped to shape the recruitment process for her school’s new Head Teacher, with her proclaiming how great it was to hear from other special schools about what worked well for them, particularly when it is such an important issue to get right."
        },
        {
            "text": "In all honesty, I believe it is change - both on a ministerial level and for our members - that has made the network get off to such a great start and it is these pillars that will ensure its success."
        },
        {
            "text": "I am incredibly proud of the progress we have made in such a short time. Not just for us, as an organisation, but for school business professional working in special schools, alternative provision and hospital schools throughout England and for the sector as a whole."
        },
        {
            "text": "The network is not afraid of tackling the big issues, believing that inclusive education for all children is a right and this should be provided for in well-resourced and run schools.  Background work is happening now to address funding, the challenges of tribunals and to position ourselves to respond to the SEND review, when issued."
        },
        {
            "text": "The success of NNoSS is down to its members. Their passion, strong willingness to collaborate and the ability to make their voices heard all make for a much stronger network which is credible and respected.  They are the true leaders and I simply support them in making that difference."
        },
        {
            "text": "On the horizon, we have workshops on developing interpersonal skills and coaching, as well as more networking events and we are planning our first face to face conference (free to members) at the end of April.  I am confident that - with support from Schools North East and DfE - the network will continue to connect colleagues with each other, provide them with opportunities to develop and grow, and make their voice not just heard by decision makers, but listened to."
        }
    ]
}