{
    "url": "https://educationinspection.blog.gov.uk/2021/11/24/quality-assuring-providers-of-full-time-online-education/",
    "title": "Quality assuring providers of full-time online education",
    "authors": [
        "Christopher Russell"
    ],
    "categories": [
        "online education"
    ],
    "pub_date": "2021-11-24T09:56:08+00:00",
    "content": [
        {
            "text": "Chris Russell, National Director for Education, discusses our consultation on full-time online education."
        },
        {
            "text": "Over the past year and a half, millions of parents and school-age children have experienced remote education due to school closures during the pandemic. In many cases this will have involved some online education, such as lessons or tutorials delivered by their usual teachers through a live online classroom."
        },
        {
            "text": "Every child, and every family, will have experienced this differently. While some may look back on it fondly, most will agree that children made less progress than usual, and that online lessons were neither as effective nor as fun as lessons delivered in person. Many children will have been very glad indeed to return to the classroom, where dedicated teachers can once again help them to progress in their learning and develop valuable personal and social skills."
        },
        {
            "text": "However, for a small number of pupils and parents in England, online education is the norm, not the exception. Instead of attending a school, these children receive all (or nearly all) of their education online from private organisations and companies.  This might be because the child is too ill to attend school or needs a break from school, or because their parents have privately arranged for them to receive education online."
        },
        {
            "text": "It’s a world away from the remote education that schools have offered through the pandemic – both because it is offered on an ongoing basis by providers that are unlikely ever to have met their pupils in person, and because providers are not inspected by Ofsted or registered with the government."
        },
        {
            "heading": 3,
            "text": "An unregulated market"
        },
        {
            "text": "Currently, the full-time online education sector in England is totally unregulated. Anyone – qualified or not – could cobble together an unsafe platform, plan a few lessons, and start to charge fees to unsuspecting parents. That’s bad for children, bad for their parents, and it’s also unfair for good online providers that are proud of their work and welcome independent oversight."
        },
        {
            "text": "We know from our work inspecting unregistered schools that, too often, providers operating under the radar provide a poor standard of education, and that there may well be issues with children’s safety. The lack of oversight also means that there is very little independent information available about the quality of online providers. This means that parents, local authorities and schools are left in the dark, unable to tell the good providers from the bad ones."
        },
        {
            "text": "This is why the Department for Education (DfE) is developing a new accreditation scheme for providers of full-time online education. The purpose of the Online Education Accreditation Scheme is to help parents and those commissioning places for children to make more informed choices. My hope is that it will also raise the standard of online education for children who can’t attend school in person."
        },
        {
            "text": "To my mind, schools are the best place for children to learn, develop and achieve their ambitions, and online education shouldn’t be seen as equivalent to, or a replacement for, school. But for children who can’t attend school, the scheme will give parents and others a measure of confidence that accredited providers will meet a set of minimum standards – and that is surely a big step forward."
        },
        {
            "heading": 3,
            "text": "Ofsted’s role "
        },
        {
            "text": "We will be responsible for quality assuring online providers once the scheme launches in 2022. This includes checking whether proprietors of online providers are suitable, and carrying out visits to find out whether providers meet the DfE’s standards. This will help the DfE to decide whether or not each provider should be accredited."
        },
        {
            "text": "We’ve launched a consultation about how we should fulfil this role. The consultation offers parents an opportunity to comment on our proposals and to let us know what matters to them. For providers, the consultation and the draft handbook published alongside it will give a clearer idea of what the quality assurance process for the scheme is likely to involve. It will allow providers to have their views on the scheme heard, and to prepare to apply for accreditation once the scheme launches in 2022."
        },
        {
            "text": "The consultation will run from 24 November 2021 to 26 January 2022. Please do give us your views!"
        }
    ]
}