{
    "url": "https://insidehmcts.blog.gov.uk/2021/11/24/simpler-tribunal-service-helps-users/",
    "title": "Simpler tribunal service helps users",
    "authors": [
        "Tracy Parker-Priest"
    ],
    "categories": [
        "Court and tribunal reform"
    ],
    "pub_date": "2021-11-24T14:00:44+00:00",
    "content": [
        {
            "text": "Our tribunals hear about a million cases each year. No matter what type of case someone is involved in, the experience can have a huge impact on their life. Many people deal with their own case without legal support, which can add to the stress of the situation. There’s a human story behind every hearing."
        },
        {
            "text": "At HMCTS, we’re reforming our tribunals services to make their process quicker and simpler so that everyone can access and navigate the system easily. We’ve already made some changes and have more improvements planned. In October 2021, Engine, the supplier we worked with to create our online immigration and asylum appeal service, won an industry award from The Service Design Network. The award recognises the detailed work and innovative approach involved in transforming the service."
        },
        {
            "text": "Tribunals decide disputes in a specific area of law. There are many different types – for instance, they may deal with workplace disputes between employers and employees, or rule on appeals against decisions made by Government departments (including on social security benefits, immigration and asylum, and tax credits)."
        },
        {
            "text": "The issues that tribunals cover impact on people’s day-to-day lives, sometimes affecting their finances or where they live. They can be the cause of great worry. In some cases, a tribunal decision can provide resolution when all other attempts to reach agreement have proved impossible. So it’s important that the processes and systems we are responsible for are easy for people to access and use."
        },
        {
            "text": "Benefits of tribunal reforms"
        },
        {
            "text": "In 2016,we began a £1.3bn reform programme, modernising ways of working  and enabling members of the public and legal professionals to access services online. We’re using advances in technology to deliver services that are easy to use, accessible, resilient and convenient – meeting the changing needs of society and supporting access to justice."
        },
        {
            "text": "For many tribunals, reform means quicker and simpler processes. Even before COVID-19, our tribunals services were evolving from paper-based, complicated systems that were not designed around the people using them. Many tribunal areas now operate using accessible digital services that are easy to use and save time and resources. The end result is a better service for all involved."
        },
        {
            "text": "Delivering a simpler, quicker service "
        },
        {
            "text": "Some of the achievements so far include:"
        },
        {
            "text": "Since starting my role, I’ve been so impressed by my tribunal colleagues’ commitment to overcoming the challenges posed by the COVID-19 pandemic, and the willingness of our partners and colleagues across the justice system to provide feedback and support. Maintaining the safety of our tribunal users has been their priority. Everyone has worked so hard, adapting processes and keeping the system operating throughout this worrying time. I am grateful for everyone’s contribution."
        },
        {
            "text": "Next steps"
        },
        {
            "text": "Over the coming year, more users across all tribunals will be able to start their cases online and submit evidence as their case progresses. We’ll also be implementing user-friendly reforms in the employment tribunal where cases will be managed digitally, ensuring best use of resources and reducing waiting times."
        },
        {
            "text": "Work is underway to ensure that the knowledge and experiences of all interested parties are reflected in employment tribunal reforms, with involvement from the judiciary, the Department for Business, Energy and Industrial Strategy (which ‘owns’ the legislative framework for employment matters), ACAS (the Advisory, Conciliation and Arbitration Service), and other stakeholders."
        },
        {
            "text": "We’ll soon see changes to the Mental Health Act come into force and are planning for an increase in tribunal activity for this area. The changes will increase the number of times a patient can apply to the tribunal during the first six months of being detained under the Act. The changes also introduce an increase in the number of automatic referrals that are made to the tribunal for patients who do not make their own applications. This will help ensure that no one is left in long-term care without an independent review of the need to detain them."
        },
        {
            "text": "Learn more about our reform programme by reading our factsheets, and connect with us on social media to follow this work."
        }
    ]
}