{
    "url": "https://defrafarming.blog.gov.uk/2021/11/24/tackling-climate-change-and-extinction-the-farm-thats-showing-the-way/",
    "title": "Tackling climate change and extinction - the farm that’s showing the way",
    "authors": [
        "Merrick Denton-Thompson OBE, FLI"
    ],
    "categories": [
        "environmental land management schemes",
        "Guest post",
        "Things we're doing",
        "Things we've learned"
    ],
    "pub_date": "2021-11-24T16:53:06+00:00",
    "content": [
        {
            "text": "Cholderton is a 1000-hectare estate on the Hampshire/Wiltshire border. It participated in one of Defra's environmental land management test and trials to develop a model land management plan based on the exemplary principles adopted by the estate.  "
        },
        {
            "text": "This plan will assist land managers who are preparing their own management plans for the chalk landscapes of southern England.  "
        },
        {
            "heading": 2,
            "text": "The Cholderton Estate: sustainable food production and carbon capture "
        },
        {
            "text": "The estate is run by Henry Edmunds. What sets Cholderton apart is that it is an excellent example of sustainable food production. Production targets are set by the disciplines required by the natural carrying capacity of the land.  "
        },
        {
            "text": "The estate doesn't apply inorganic nitrogenous fertiliser so there's significantly less nitrate pollution of ground water or greenhouse gas emissions of nitrous oxide a major polluter by the farming industry. This is 300 times more potent than carbon dioxide as a climate change gas."
        },
        {
            "text": "Cholderton doesn't use pesticides, and instead focuses efforts on the microbial health of the soil and plant diversity for its biosecurity. "
        },
        {
            "text": "The farm uses a 10-year rotation cycle with a wide variety of pasture-based herb and grass mixes, fixing airborne nitrogen to improve fertility. The combination of a high content of deep rooting herbs and shallow plough for 4 years in 10 has resulted in exceptional levels of residual organic matter averaging out at 9.8 % which equates to 128 tons of carbon per hectare – a figure achieved over 20 years of this style of management. "
        },
        {
            "text": "This is double the figure achieved by most farms on chalk soils."
        },
        {
            "text": "We have a rich variation in soil types across the country and more research is needed into how these results translate to other soil types. For many soil types the restrictions created by hard chalk subsoil is not present and potentially the Cholderton approach could generate even higher levels of sequestration across the country. "
        },
        {
            "text": "There are many reasons for us to increase soil carbon including increasing the water holding capacity of the land, generating optimum conditions for microbial health, nutrient release, soil creation and natural fertility. There is therefore huge potential, if we were able to replicate the Cholderton approach across the 5.4 million hectares of arable farmland in England, to sequester large quantities of carbon; making a significant contribution towards net zero."
        },
        {
            "text": "The results speak for themselves. The Wildlife Trust and Plantlife declared the farm \"one of the richest farmed estates in the country for biodiversity\"."
        },
        {
            "text": "On top of all this, the farm is resilient, self-sufficient in improving its own fertility and profitable.  "
        },
        {
            "text": "These principles have been decades in the making, shaped by Henry Edmund’s scientific analysis of Cholderton's soil, micro-climate, ecosystems and topography.  "
        },
        {
            "text": "I believe the principles of farming at Cholderton could, and should, be replicated across the country.  "
        },
        {
            "heading": 2,
            "text": "Tests and trials: see for yourself "
        },
        {
            "text": "Defra’s test & trial set out to validate the approach taken by Cholderton by involving Cranfield University on soils, the Wildlife Trust on biodiversity and breaking new ground by valuing the Natural Capital approach.  "
        },
        {
            "text": "One of the highlights of the valuation projected the accounts for the next 60 years. It gave a £5.4 million food value and a public goods value of £125 million, the estate being climate positive over this period. "
        },
        {
            "text": "The test also investigated what advice and guidance was needed to produce these management plans and how the advice should be given, including:"
        },
        {
            "text": "As part of the test and trial, 50 farmers spent half a day visiting the estate, just before the harvest earlier this year. Many of them were impressed by what they saw. "
        },
        {
            "text": "Some struggled to believe that the estate achieves such high-quality crops and animals, without using intensive techniques.  "
        },
        {
            "text": "Some asked about profitability. Henry Edmunds went out of his way to open his farm accounts to third parties, proving that it's a profitable enterprise.  "
        },
        {
            "text": "For those who couldn’t visit, this documentary video provides a good overview and shares the excellent principles adopted at Cholderton with all those who are interested. "
        },
        {
            "text": "Most of those who visited the estate filled in a questionnaire at the end and many entered into correspondence. The results of the survey and correspondence, including which of the three methods to share advice were preferred by participants, are still being analysed. "
        },
        {
            "text": "The Cholderton test and trial, in partnership with Defra, was submitted for consideration to the Climate Challenge Cup as part of the COP26 Climate Change Conference.  "
        },
        {
            "text": "Entrants came from across all industries from the UK and America. Cholderton was 1 of 6 award-winning finalists announced at the 10 November conference."
        },
        {
            "text": "Cholderton provides a template that thousands of other farms in the UK could copy. The result would be profitable farm systems which deliver secure, sustainably produced food in a countryside teeming with wildlife. "
        },
        {
            "text": " "
        }
    ]
}