{
    "url": "https://vets.blog.gov.uk/2021/11/24/world-antimicrobial-awareness-week-2021-reflections-on-the-veterinary-medicines-directorates-amr-work/",
    "title": "World Antimicrobial Awareness Week 2021: Reflections on the Veterinary Medicines Directorate’s AMR work",
    "authors": [
        "Kitty Healey"
    ],
    "categories": [
        "Government Veterinary Services",
        "International Work"
    ],
    "pub_date": "2021-11-24T19:05:05+00:00",
    "content": [
        {
            "text": "Kitty Healey, Head of AMR at the Veterinary Medicines Directorate reflects on AMR activities over the past year."
        },
        {
            "heading": 3,
            "text": "Introduction"
        },
        {
            "text": "As World Antimicrobial Awareness week draws to a close it feels like a good time to pause and reflect on some of the work that the Veterinary Medicines Directorate (VMD) and our partners across the UK and internationally have done to address antimicrobial resistance (AMR) in the past year. AMR poses a serious and global risk to human health, animal health, and economic prosperity and only by taking a co-operative One Health approach across animal, human and environmental sectors and beyond that we can work towards addressing the ‘silent pandemic’ of AMR."
        },
        {
            "heading": 3,
            "text": "Veterinary Antibiotic Resistance and Sales Surveillance (VARSS) report"
        },
        {
            "text": "Data are crucial for understanding the scale of the AMR problem and how well we are doing in our efforts to deal with it. This November, the VMD published the annual UK VARSS report, reporting on antibiotic sales, usage and resistance. It’s rewarding to be the person sending out the news of the published report to a wide range of colleagues, but the kind comments I receive are credit to the VMD AMR team, and the teams in the Animal and Plant Health Agency (APHA), the devolved administrations and our agriculture sector and vet profession colleagues, who pull off this feat annually. It is clear over the course of the VARSS reports since the first one was published in 2014 (presenting data from 2013), that data on antibiotic sales and use are powerful tools for understanding trends and patterns of antibiotic prescribing and on-farm use at every level. Such as providing prescribing pattern insight to the farmer and their vet, to describing sectoral and national trends and galvanising action."
        },
        {
            "text": "This year’s report shows an overall reduction of 52% in veterinary antibiotic sales for farmed animals since 2014, and a fall of 79% since 2014 in sales of veterinary antibiotics most critical for human health (HP-CIAs). We’re no longer seeing the big reductions of four or five years ago, but those reductions have been held, and sector targets for further improvements in stewardship are in place. The UK has seen overall decreasing trends of AMR in internationally recognised indicator bacteria (E. coli) since 2014, including declines in multi-drug resistance and resistance to HP-CIAs. As the agriculture sectors continue their work towards the new targets set last year by the Targets Task Force, we hope to see further correlation between the efforts made towards reduction and responsible use of antibiotics in food producing animals and the levels of AMR found through our ongoing surveillance programmes."
        },
        {
            "heading": 3,
            "text": "A focus on the veterinary profession"
        },
        {
            "text": "In spring 2021, the Farm Vet Champions scheme was launched by Royal College of Veterinary Surgeons (RCVS) Knowledge, inspired by a programme pioneered by the Welsh Government. The scheme provides training and professional development opportunities to enable UK farm animal vets to embed good antimicrobial stewardship within their practices and on the farms they visit, promoting and sustaining a culture of good antimicrobial stewardship with their colleagues and clients. The scheme has been positively received and adopted by many vet schools as part of the curriculum."
        },
        {
            "text": "Over the years we have worked with stakeholders on AMR across all species, but until recently our VMD activities have mainly concentrated on food producing animals. However, addressing AMR in companion animals and horses is just as important and brings a different profile of challenges and AMR risks to get to grips with. It also involves a much, much larger number of vets – vets who treat companion animals make up a sizeable majority of the approximately 27,000 registered practising vets in the UK. Joined up communication and coordinated action is a significant challenge. With this in mind, and on the back of their success in the agriculture sectors, the Responsible Use of Medicines in Agriculture Alliance (RUMA) have convened a companion animal and equine group to explore target setting for reduction in antibiotic use across these sectors, and to assess the different challenges in these animal groups. At present, the group is exploring ways to measure antibiotic use at practice level and identifying specific areas of importance, such as the use of antibiotics most critical for human health. This work is in the early stages, but there is scope for this group to provide similar momentum across these sectors as has been achieved by the Targets Task Force for the livestock sectors. RCVS Knowledge has also just launched an initiative under its VetTeamAMR project, helping small animal and equine vet practices audit their antibiotic use and support them to put measures in place to improve and monitor their prescribing behaviours."
        },
        {
            "heading": 3,
            "text": "Advancing the One Health approach in AMR surveillance"
        },
        {
            "text": "The One Health approach is much talked about in AMR, but it can sometimes seems like a hard concept to pin down. One place where it has tremendous scope to help our understanding of AMR risks and transmission pathways is in AMR surveillance. In 2021, a One Health Integrated Surveillance subgroup of the Department of Environment, Food and Rural Affairs (Defra) Antimicrobial Resistance Coordination Group (DARC) was created. This subgroup was formed to develop a strategy for the integration of AMR surveillance across the different sectors (animals, humans, food, and the environment), and the four UK nations. The group will identify and prioritise opportunities for integrating surveillance to support successful and cost effective concerted interventions, and I am looking forward to seeing the recommendations the group makes for forging ahead on this complex and evolving journey."
        },
        {
            "text": "It’s not just in the DARC subgroup where One Health surveillance and AMR are being prioritised. Many congratulations are due to the Defra and the Food Standard Agency (FSA) for their successful bid for funding to complete the PATH-SAFE project, a cross governmental pilot project that brings together the FSA and Defra alongside Food Standards Scotland, the Department of Health and Social Care, UK Health Security Agency and the Environment Agency to test the application of genomic technologies to provide One Health surveillance of foodborne pathogens and antimicrobial resistant microbes in all four nations of the UK. At the VMD we’re particularly excited about the element which will look at development of an integrated One Health data platform, which will bring together surveillance data from different monitoring programmes. This has significant potential to improve access to, and insight from, data across the One Health spectrum."
        },
        {
            "heading": 3,
            "text": "VMD's international work"
        },
        {
            "text": "The UK has had a high profile on the global stage this year, holding the G7 presidency and hosting the COP26 summit. Three strong commitments to AMR were made under the UK’s G7 presidency: to better understand antibiotic supply chains and improve resiliency, to investigate market incentives and novel valuation strategies for antimicrobials, and adoption of standards for manufacturing of antimicrobials to reduce environmental pollution. As the UK’s presidency comes to an end, I hope the commitments made can lead to continued action in these areas to help contribute to the global burden of AMR."
        },
        {
            "text": "Also on the international side, I had the privilege of heading up the UK’s delegation to the Codex Alimentarius Task Force on AMR, a process which was started back in 2016 and which has, over the intervening years, worked to revise the existing Code of Practice to Minimise and Contain AMR (CoP) and develop new Guidelines on Integrated Monitoring and Surveillance (GLIS). The CoP is notable for securing its principle 12, the most ambitious internationally agreed text on antimicrobial growth promoters to date, while the GLIS is a brand new guideline which will provide a practical reference for countries across the world as we all work to establish or improve our surveillance of veterinary antibiotic use and resistance. Both these documents were adopted at the recent Codex Alimentarius Commission meeting, a meeting which also saw the FSA’s Director of Global Policy elected as the new Chair of the Codex Alimentarius Commission, an important role and a well-deserved result. Very many congratulations, Steve."
        },
        {
            "text": "Moving to international completion of our UK AMR objectives, the VMD, together with APHA and the Centre for Environment, Fisheries and Aquaculture, has played a pivotal and practical role in supporting efforts to curb AMR across the globe using a one health approach, through their joint designation as the UK Food and Agriculture Organisation (FAO) Reference Centre for AMR. You can read about some of our cross-agency engagement in Nigeria in Rod Card’s APHA Science blog."
        },
        {
            "text": "At the VMD our international office is also working to ensure safer food through regulation of veterinary medicine residues in food for human consumption, discouraging the development of antimicrobial resistance as well as protecting consumers. Providing e-learning and live Q&A sessions on veterinary medicine residues surveillance to participants from Ethiopia, Ghana and the Philippines aimed to increase awareness of the interconnecting elements required for a residues surveillance programme and allow effective regulation of residues. The team is currently developing more e-learning materials to continue our work in this area."
        },
        {
            "text": "It has, as usual, been a busy year for work on AMR. I hope that this pace continues and that we bring more and more people with us in this endeavour so that we can keep making headway with our ambition to reduce unnecessary use of antibiotics in animals, and do this in a way which is sustainable and long term, so that we preserve our access to effective antibiotics for animals and for people in the years to come."
        }
    ]
}