{
    "url": "https://mhclgmedia.blog.gov.uk/2025/10/14/coverage-of-pro-growth-package-to-get-britain-building/",
    "title": "Coverage of pro-growth package to get Britain building",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Planning"
    ],
    "pub_date": "2025-10-14T09:55:28+01:00",
    "content": [
        {
            "text": "There has been prominent national print and broadcast coverage about the government unveiling a package of pro-growth amendments to the landmark Planning and Infrastructure Bill, as part of wider efforts to sweep aside blockers standing in the way of growth and dismantle barriers to get Britain building."
        },
        {
            "text": "This is picked up in The Financial Times, The Independent, The Guardian and LBC focusing on how the pro-growth reforms will speed up the construction of new infrastructure including reservoirs and onshore windfarms. This is on top of granting new powers for ministers to prevent applications being rejected by local councils while they consider using ‘call-in’ powers to decide whether they should be approved. There is also further coverage in Housing Today, Construction Enquirer and ENDS Report reporting about the new amendments."
        },
        {
            "text": "The Times has run quotes from the Housing Secretary who has pledged to “bulldoze through the barriers that have strangled growth for decades” and “taking the fight directly to the blockers” to see spades in the ground."
        },
        {
            "text": "The news has been welcomed by several organisations, with comments across the media from groups including the CBI, RenewableUK, Arup and the Home Builders Federation."
        },
        {
            "text": "Amendments tabled this week include:"
        },
        {
            "text": "The Housing Secretary undertook the broadcast round this morning speaking to the reforms on Times Radio, BBC Breakfast, Sky News, ITV’s Good Morning Britain, LBC, and GB News."
        },
        {
            "text": "Housing Secretary, Steve Reed said: “Britain’s potential has been shackled by governments unwilling to overhaul the stubborn planning system that has erected barriers to building at every turn. It is simply not true that nature has to lose for economic growth to succeed. “Sluggish planning has real world consequences. Every new house blocked deprives a family of a home. Every infrastructure project that gets delayed blocks someone from a much-needed job. This will now end.    “The changes we are making today will strengthen the seismic shift already underway through our landmark Bill. We will ‘Build, baby, build’ with 1.5 million new homes and communities that working people desperately want and need.”"
        }
    ]
}