{
    "url": "https://despatch.blog.gov.uk/2025/10/14/four-decades-in-the-passenger-seat-my-journey-as-chief-driving-examiner/",
    "title": "Four decades in the passenger seat: My journey as Chief Driving Examiner",
    "authors": [
        "Mark Winn"
    ],
    "categories": [
        "Driving test",
        "Feature",
        "Learning to drive",
        "Learning to ride"
    ],
    "pub_date": "2025-10-14T11:02:44+01:00",
    "content": [
        {
            "text": "While I prepare to hang up my keys at the end of the month, I’ve been asked to reflect on a career that began in 1986 – the year the M25 officially opened, Casualty first appeared on our screens, and 30 million viewers watched Dirty Den serve divorce papers to Angie in EastEnders. It was quite a year to start my journey with what would become the Driver and Vehicle Standards Agency (DVSA). And I suspect more people are still talking about EastEnders! "
        },
        {
            "text": "So, nearly 4 decades later, as I step down from my role as Chief Driving Examiner – a position I've held since 2018 – I'm struck by how much has changed in road safety and driver training, and how privileged I've been to play a part in that evolution.  "
        },
        {
            "heading": 3,
            "text": "Learners on motorways"
        },
        {
            "text": "One of the things I'm most proud of during my tenure was overseeing the change that allowed learner drivers onto motorways for the first time. When the law changed in June 2018, it marked a major shift in how we prepare new drivers for the realities of modern motoring. "
        },
        {
            "text": "I remember appearing on BBC Breakfast to publicise it, explaining how learners could now gain experience on motorways with qualified approved driving instructors in dual-controlled cars. The difference this has made to road safety can’t be overstated. Previously, a newly qualified driver's first motorway experience could be daunting, even frightening. Now they can develop those crucial high-speed driving skills – joining and leaving carriageways, lane discipline, and safe overtaking – in a controlled environment, with the help and supervision of a professional driving instructor.  "
        },
        {
            "text": "This wasn't just about individual safety; it was about DVSA working collaboratively with road safety organisations to create meaningful change. It showed what can be achieved when we put public safety first and work together towards common goals. "
        },
        {
            "heading": 3,
            "text": "Protecting our most vulnerable road users "
        },
        {
            "text": "Another landmark moment was our work in updating the Highway Code to introduce the hierarchy of road users. This wasn't simply about changing rules; it was about a major shift in attitudes towards road sharing and responsibility. "
        },
        {
            "text": "The hierarchy places those most at risk – pedestrians, cyclists, horse riders, and motorcyclists – at the top, with those operating the largest and most powerful vehicles bearing the greatest responsibility to look out for more vulnerable users. It's a principle that reflects both common sense and compassion, ensuring that we all take greater care of those who need our protection most and ensuring our roads remain amongst the safest in the world.  "
        },
        {
            "heading": 3,
            "text": "Rising to unprecedented challenges "
        },
        {
            "text": "The pandemic tested all of us in ways we never anticipated. During those difficult times, I found myself not just leading policy on vocational training but rolling up my sleeves to conduct more driving tests. Even when being a driving examiner was no longer part of my day-to-day role, I always made a point of carrying out driving tests. The pandemic felt like the right time to do more so that, along with many other examiners, we could ensure there were driving tests available for the key staff that were essential to combatting a disease that cost the lives of many of our fellow citizens.  "
        },
        {
            "text": "I’m particularly proud that we were able to help ensure key workers could get their licences and, crucially, support paramedics and ambulance drivers in their role in the response to the crisis.  "
        },
        {
            "text": "I was also heavily involved in addressing the HGV driver shortage that threatened to disrupt deliveries during the pandemic. It was vital that we had to get it sorted so we could protect the logistics industry and keep goods moving.  The pace of change was remarkable. It showed me first-hand how quickly government and the Civil Service can act when decisive action is needed. The initiatives we implemented significantly increased the number of vocational driving tests – allowing industry to recruit more lorry drivers. This demonstrated the power of focused, collaborative effort. "
        },
        {
            "heading": 3,
            "text": "Making motorcycling safer and more accessible "
        },
        {
            "text": "Motorcyclists hold a special place in my heart – not least because I'm a keen rider myself. So, I'm particularly pleased with our work to make motorcycling safer and more accessible. The relaunch of the enhanced rider scheme was a significant achievement, making post-test training available to many more riders and instructors. "
        },
        {
            "text": "At the other end of the learning spectrum, we developed Ridefree, making online training freely accessible to new riders. Since its launch, over 35,000 people have completed the course, giving them a better understanding right at the beginning of their learning journey.  "
        },
        {
            "text": "These initiatives reflect my belief that learning doesn't stop when you pass your test – whether you're driving a car, bus or lorry or riding a motorcycle, there's always more to learn about staying safe on our roads. "
        },
        {
            "heading": 3,
            "text": "Looking ahead"
        },
        {
            "text": "I don’t plan to slow down when I retire. I'll continue my role as a Scout leader and my work with Orchyd, a disabled children's charity that's close to my heart. I've also got some work lined up with another community charity for a couple of days a week – just to keep me busy and off the streets, as they say. "
        },
        {
            "text": "And, of course, there will be more time for riding motorcycles and having fun. "
        },
        {
            "text": "My colleagues have been wonderfully supportive about my retirement and I have complete confidence in the team and the organisation we've built together. "
        },
        {
            "heading": 3,
            "text": "A lasting legacy"
        },
        {
            "text": "Looking back over these years, I'm struck by how much we've achieved in making our roads safer for everyone. From allowing learners on motorways to protecting vulnerable road users, from responding to national emergencies to continuously improving training standards – it's been a privilege to serve in this role and I’m proud that our roads remain amongst the safest in the world.  "
        },
        {
            "text": "Road safety is never a finished project – it requires constant vigilance, innovation, and collaboration. But I'm confident that the foundations we've laid will continue to protect and serve road users for years to come. "
        },
        {
            "text": "As I ride off into retirement and shamelessly end my clichés, I know that we've made a real difference to road safety in Britain. And that's something worth celebrating. EastEnders (which I don’t watch) will have to carry on without me.  "
        }
    ]
}