{
    "url": "https://space.blog.gov.uk/2025/10/14/icomat-opens-state-of-the-art-space-manufacturing-facility-with-4-8-million-uk-space-agency-investment/",
    "title": "iCOMAT opens state-of-the-art space manufacturing facility with £4.8 million UK Space Agency investment",
    "authors": [
        "UK Space Agency"
    ],
    "categories": [
        "Catalysing Investment"
    ],
    "pub_date": "2025-10-14T09:49:11+01:00",
    "content": [
        {
            "text": "New automated production facility in Gloucestershire set to revolutionise lightweight space structures using cutting-edge composite technology."
        },
        {
            "text": "A groundbreaking new space manufacturing facility that is expected to create 2,000 jobs has officially opened in Hardwicke, Gloucester, marking a significant milestone for the UK's space industry capabilities. "
        },
        {
            "text": "The Advanced Composites Manufacturing Enterprise (ACMA), led by iCOMAT, a spin-out company from the University of Bristol, received £4.8 million funding from the UK Space Agency's Space Clusters Infrastructure Fund (SCIF) to establish this world-class production facility. "
        },
        {
            "text": "The opening event welcomed representatives from the UK Space Agency, European Space Agency, and international space sector leaders, including Orbex, Lockheed Martin, and Thales Alenia Space who were treated to guided tours of the fully automated factory floor and live demonstrations of the revolutionary technology that aims to contribute to lighter weight and more sustainable space vehicles. "
        },
        {
            "text": "Space Minister Liz Lloyd said:  "
        },
        {
            "text": "Dr Evangelos Zympeloudis, CEO and Founder of iCOMAT, said: "
        },
        {
            "heading": 2,
            "text": "Transforming Space Manufacturing"
        },
        {
            "text": "The new 45,000 sq.ft facility represents a leap forward in composite materials manufacturing for space applications. iCOMAT's innovative Rapid Tow Shearing (RTS) technology enables production of structures that are significantly lighter and more cost-effective than traditional manufacturing processes, addressing critical industry demands for weight reduction in spacecraft and satellites. "
        },
        {
            "text": "Antonia Yendell, Head of Space Ecosystem Development at the UK Space Agency, said:  "
        },
        {
            "text": "Work on the facility, which is located in the Western Gateway region to maximise collaboration with key players in the local space ecosystem, started in 2023 and has seen a total investment of £8.2 million, including £4.8 million SCIF funding and £3.3 million match funding. iCOMAT has also received more than £800,000 of funding through the UK Space Agency’s membership of the European Space Agency’s General Support Technology Programme (GSTP).   "
        },
        {
            "heading": 2,
            "text": "Advanced production capabilities"
        },
        {
            "text": "The ACMA cluster features two specialised production lines designed to serve multiple space market segments. The 2D-RTS line focuses on manufacturing flat structures and complex shaped components, including satellite panels and solar array substrates. Meanwhile, the 3D-RTS production line handles geometrically complex components such as satellite and upper stage propellant tanks using advanced fibre steering technology on doubly curved parts. "
        },
        {
            "text": "The facility operates on a manufacturing access basis, allowing end users and customers to benefit from the cutting-edge RTS technology. Users can engage with the technology in various ways, from seeking lightweight improvements to existing vehicles to incorporating RTS capabilities into new design concepts. "
        },
        {
            "heading": 2,
            "text": "Supporting UK growth"
        },
        {
            "text": "While primarily focused on serving the space industry, the facility's capabilities extend to closely adjacent sectors including aerospace and automotive applications, demonstrating the versatility of the RTS technology platform. "
        },
        {
            "text": "The opening of iCOMAT's new facility underscores the UK's commitment to maintaining its leadership in space technology and composite materials, providing domestic capability that will help capture greater market share in the rapidly expanding global space economy. "
        }
    ]
}