{
    "url": "https://naturalengland.blog.gov.uk/2025/10/14/more-than-the-sum-of-our-parts-professionals-and-citizen-scientists-working-together-to-transform-evidence-collection/",
    "title": "More than the sum of our parts: professionals and citizen scientists working together to transform evidence collection",
    "authors": [
        "Oliver Grafton",
        "Amy Pilsbury"
    ],
    "categories": [
        "Climate change",
        "Connecting People with Nature",
        "Education",
        "Evidence",
        "Mapping",
        "Monitoring",
        "Natural England",
        "Nature",
        "Science and evidence",
        "Uncategorized"
    ],
    "pub_date": "2025-10-14T14:30:52+01:00",
    "content": [
        {
            "text": "We’re in the middle of a step change for national-scale environmental evidence in England. In recent years, the Natural Capital and Ecosystem Assessment (NCEA) programme has allowed us to create and upgrade maps and data products like the England Peat Map and Living England habitat map – crucial for giving us the large-scale overview of our landscapes and natural resources that we so urgently need. But the vast majority of the environmental evidence we have available in the UK, and the biggest army of surveyors, comes neither from Natural England employees, nor from universities, nor from ecological consultancies."
        },
        {
            "text": "Over 70% of records used in our nation’s biodiversity reporting have been created by citizen scientists (sometimes referred to as community or participatory scientists, or voluntary recorders). These are volunteers who, in their free time, record and share their observations of wildlife and nature."
        },
        {
            "text": "Their evidence supports everything from local nature recovery to international reporting obligations, as well as many of the regulating and sponsoring operations of Natural England and the wider Defra group."
        },
        {
            "heading": 4,
            "text": "Different but overlapping needs"
        },
        {
            "text": "Understanding how we can balance the priorities of Defra group with citizen scientists’ needs and goals is vital if we want to work together to deliver meaningful change for nature."
        },
        {
            "text": "For Natural England and Defra, it’s important to understand how citizen science and professional surveys can be better coordinated with one another. This will let us plan our work and investments, to fill critical data gaps using the best people and methods, without reduplicating existing work."
        },
        {
            "text": "Meanwhile, citizen science colleagues have told us that their main needs from government are:"
        },
        {
            "text": "Work is being carried out to bridge this gap."
        },
        {
            "heading": 4,
            "text": "A library of best practice tools"
        },
        {
            "text": "We’re assembling a library of resources to help citizen science projects produce robust, useable data. This is expected to launch in the coming year. "
        },
        {
            "text": "Our marine colleagues have already published a best-practice guide for marine citizen science data, and will soon publish handbooks focused on citizen science monitoring for inshore fish and benthic (seafloor) habitats."
        },
        {
            "heading": 4,
            "text": "Frameworks for environmental evidence in eight key habitats"
        },
        {
            "text": "We’re creating frameworks showing evidence availability and needs for 8 key habitats and land-use types. We’ve already published these for marine, freshwater, and urban habitats; still to come are coastal margins, woodlands, enclosed farmland, semi-natural grasslands, and mountains, moorlands and heath."
        },
        {
            "text": "The frameworks will help a wide range of partners understand what data they might need to answer specific questions, who might be best placed to collect that data, and where the main gaps are in our collective evidence base. So far, across 550 indicators identified as monitoring priorities, we’ve identified existing potential of citizen science practice to contribute to over 100."
        },
        {
            "heading": 4,
            "text": "Testing innovative methods and new areas of study with partners"
        },
        {
            "text": "We’re working on a range of partnership projects to investigate citizen science ability to monitor freshwater environments and other habitat types where we lack evidence. We are investigating whether citizen scientists could be making more use of new techniques like eDNA and satellite imagery analysis, and what protocols and data management and storage are needed if they are to use these techniques at a large scale."
        },
        {
            "heading": 4,
            "text": "Coordinating local and national join up"
        },
        {
            "text": "We’ve funded pilot projects to coordinate and convene citizen science organisations in a place-based way. Our three pilots are very different, but they all try to bridge the gap between local and national relevance for data and engagement."
        },
        {
            "heading": 4,
            "text": "Improving access to existing data"
        },
        {
            "text": "The NCEA team is working with key organisations which hold and process large amounts of environmental data, helping them to unclog bottlenecks and get valuable evidence to end users. Examples include:"
        },
        {
            "heading": 4,
            "text": "More people studying more of the environment"
        },
        {
            "text": "For all this talk about better data, an equally important aspect of citizen science is its ability to foster meaningful communities centred around the care and observation of the natural world – something we try to respect and embed across all these initiatives."
        },
        {
            "text": "As we enter a new age for monitoring, in which AI, eDNA, bioacoustics and many other tools look set to transform our understanding of nature, it’s more vital than ever that we empower as many people as possible to study as much of the environment as possible, in ways which enhance and align our collective knowledge."
        },
        {
            "heading": 4,
            "text": "Coming up"
        },
        {
            "text": "Keep an eye out over the next couple of weeks for more articles about the work being done by our partner organisations."
        }
    ]
}