{
    "url": "https://publicguardian.blog.gov.uk/2025/10/14/power-of-attorney-stories-jill/",
    "title": "Power of Attorney Stories: Jill",
    "authors": [
        "harryfortuna"
    ],
    "categories": [
        "Future planning",
        "lasting power of attorney",
        "LPA",
        "YourVoiceYourDecision"
    ],
    "pub_date": "2025-10-14T10:00:00+01:00",
    "content": [
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "text": "A lasting power of attorney (also known as an LPA) is a legal document. It allows you to nominate someone you trust to step in and make decisions about your health and welfare and property and finance if you lack mental capacity to do so."
        },
        {
            "text": "Jill , from Sandhurst, has been an advocate of LPAs for longer than a decade after her late father's diagnosis of Alzheimer’s disease. Since then, she has been a long-time campaigner for research into the disease and really encourages people of any age to create an LPA. Being both an attorney and a donor, she has a great overview of the process."
        },
        {
            "heading": 4,
            "text": "Jill shared how her experiences as a carer and campaigner inspired her to take action and set up her own LPA:"
        },
        {
            "text": "Over the past decade, I’ve seen the importance of lasting powers of attorney (LPAs) from just about every angle as a daughter, a friend, a neighbour, and for myself. It’s a journey that’s been emotional, empowering, and one I hope I can help others to think about to safeguard their own future."
        },
        {
            "text": "I first came across LPAs in 2012 after my wonderful Pa was diagnosed with Alzheimer’s disease. Through contact with carers’ support groups, my family was advised to consider setting them up, to give us the legal right to help him manage his affairs when he could no longer do so himself and to speak to his doctor on his behalf."
        },
        {
            "text": "We ended up doing it on his 91st birthday in 2013. The whole family came together to sign and witness the LPA. Looking back, it was incredibly emotional, and I think about it with a sense of nostalgia. We were united, doing something important to make sure Pa’s wishes would always be respected. That moment really stayed with me."
        },
        {
            "text": "Since then, I have advised many of my friends and neighbours to consider having LPAs."
        },
        {
            "text": "I have helped some with the online application process or acted as a witness to their signatures."
        },
        {
            "text": "From a carer’s point of view, I can’t stress enough how much having an LPA in place helps. When someone you love is losing their mental capacity, it’s heart-breaking. But having that legal foundation gives you something solid to lean on and is one less thing to worry about during the tough times ahead."
        },
        {
            "text": "After helping others, I realised it was time to sort my own affairs. My partner and I are now each other’s attorneys, and we’ve included family members and younger friends as replacement attorneys.  We have been able to share information with banks to allow us to access each other’s accounts using the LPA online codes, but this isn’t something everyone needs to do until they choose to."
        },
        {
            "text": "For me, it’s all about staying in control. An LPA means I still have a say in what happens to me, especially when it comes to my health. I’ve seen what happens when people don’t have anything in place and I knew I didn’t want to leave things to chance."
        },
        {
            "text": "To be honest, I see it a bit like an insurance policy. You hope you’ll never need it, but knowing it’s there brings real peace of mind not just for you, but for the people around you too."
        },
        {
            "text": "I volunteer with Alzheimer’s Research UK in memory of Pa and, last year, I had the honour of speaking to MPs at the Houses of Parliament about why this work matters. I am a fundraiser and I also represent those who have supported someone living with dementia at the charity."
        },
        {
            "text": "My journey has taught me that none of us know what’s around the corner, but we all deserve the chance to plan for it. However old you are, if you haven’t thought about setting up an LPA yet, I’d really encourage you to do so. It might feel like a big step but it’s one that safeguards your future.  In some ways I would say that it is even more important than writing a will!"
        },
        {
            "text": "A lasting power of attorney (also known as an LPA) is a legal document. It allows you to nominate someone you trust to step in and make decisions about your health and welfare and property and finance if you lack mental capacity to do so. "
        },
        {
            "text": "Jill is one of the many people across England and Wales who has made an LPA. It's never too early to talk about lasting powers of attorney with someone you trust."
        },
        {
            "text": "Start a conversation today."
        },
        {
            "text": "Find out more at  https://powerofattorney.campaign.gov.uk/"
        },
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "heading": 1,
            "text": "Straeon Atwrneiaeth: Jill"
        },
        {
            "text": "Dogfen gyfreithiol yw Atwrneiaeth Arhosol (a elwir hefyd yn LPA). Mae'n caniatáu i chi enwebu rhywun rydych chi'n ymddiried ynddo/ynddi i gamu i mewn a gwneud penderfyniadau am eich iechyd a'ch lles a'ch eiddo a'ch cyllid os nad oes gennych chi'r galluedd meddyliol i wneud hynny."
        },
        {
            "text": "Mae Jill , o Sandhurst, wedi bod yn eiriolwr dros atwrneiaethau arhosol ers dros ddegawd ar ôl i’w diweddar dad gael diagnosis o glefyd Alzheimer. Ers hynny, mae wedi bod yn ymgyrchu ers tro dros ymchwil i'r clefyd ac yn annog pobl o unrhyw oedran i greu atwrneiaeth arhosol.  Gan ei bod yn atwrnai ac yn rhoddwr, mae ganddi drosolwg gwych o'r broses."
        },
        {
            "heading": 4,
            "text": "Rhannodd Jill sut mae ei phrofiadau fel gofalwr ac ymgyrchydd wedi ei hysbrydoli i weithredu a sefydlu ei LPA ei hun:"
        },
        {
            "text": "Dros y degawd diwethaf, rydw i wedi gweld pwysigrwydd atwrneiaethau arhosol o bron bob ochr fel merch, ffrind, cymydog, ac i mi fy hun. Mae'n siwrnai sydd wedi bod yn emosiynol, yn grymuso, ac yn un rwy'n gobeithio a all helpu eraill i feddwl am ddiogelu eu dyfodol eu hunain."
        },
        {
            "text": "Des i ar draws atwrneiaethau arhosol gyntaf yn 2012 ar ôl i fy annwyl Pa gael diagnosis o glefyd Alzheimer. Drwy ddod i gysylltiad â grwpiau cymorth i ofalwyr, cynghorwyd fy nheulu i ystyried eu sefydlu, i roi’r hawl gyfreithiol i ni i’w helpu i reoli ei faterion pan na allai wneud hynny ei hun mwyach ac i siarad â’i feddyg ar ei ran."
        },
        {
            "text": "Fe wnaethon ni wneud hynny adeg ei ben-blwydd yn 91 oed yn 2013. Daeth y teulu cyfan at ei gilydd i lofnodi a thystio’r atwrneiaeth arhosol. Wrth edrych yn ôl, roedd yn emosiynol iawn, ac rwy'n meddwl amdano gyda hiraeth. Roedden ni'n unedig, yn gwneud rhywbeth pwysig i sicrhau bod dymuniadau Pa wastad yn cael eu parchu. Arhosodd y foment honno gyda fi."
        },
        {
            "text": "Ers hynny, rydw i wedi cynghori nifer o fy ffrindiau a'm cymdogion i ystyried cael atwrneiaeth arhosol."
        },
        {
            "text": "Rydw i wedi helpu rhai gyda'r broses ymgeisio ar-lein neu wedi gweithredu fel tyst i'w llofnodion."
        },
        {
            "text": "O safbwynt gofalwyr, fedra i ddim pwysleisio digon cymaint mae cael atwrneiaeth arhosol yn ei le yn helpu. Pan fydd rhywun rydych chi'n ei garu yn colli eu galluedd meddyliol, mae’n dorcalonnus. Ond mae cael y sylfaen gyfreithiol honno yn rhoi rhywbeth cadarn i chi bwyso arno ac mae'n un peth yn llai i boeni amdano yn ystod y cyfnod anodd sydd o'ch blaenau."
        },
        {
            "text": "Ar ôl helpu eraill, sylweddolais ei bod hi’n bryd edrych ar fy materion fy hun. Rydw i a fy mhartner yn atwrneiod i'n gilydd erbyn hyn, ac rydyn ni wedi cynnwys aelodau o'r teulu a ffrindiau iau fel atwrneiod  wrth gefn.  Rydyn ni wedi gallu rhannu gwybodaeth gyda banciau i ganiatáu i ni gael mynediad at gyfrifon ein gilydd drwy ddefnyddio codau  ar-lein yr atwrneiaeth arhosol, ond nid yw hyn yn rhywbeth y mae angen i bawb ei wneud nes eu bod yn dewis gwneud hynny."
        },
        {
            "text": "Yn bersonol, mae’n fater o aros mewn rheolaeth. Mae atwrneiaeth arhosol yn golygu bod gen i lais o hyd o ran yr hyn sy'n digwydd i fi, yn enwedig o ran fy iechyd. Rydw i wedi gweld beth sy'n digwydd pan nad oes gan bobl unrhyw beth yn ei le ac roeddwn i'n gwybod nad oeddwn i eisiau gadael pethau i hap."
        },
        {
            "text": "I fod yn onest, rwy’n ei weld braidd fel polisi yswiriant. Rydych chi'n gobeithio na fydd ei angen arnoch chi byth, ond mae gwybod ei fod yno yn dod â thawelwch meddwl go iawn nid yn unig i chi, ond i'r bobl o'ch cwmpas chi hefyd."
        },
        {
            "text": "Rydw i’n gwirfoddoli gydag Alzheimer’s Research UK er cof am Pa, a llynedd, fe ges i’r fraint o siarad ag Aelodau Seneddol yn Nhŷ’r Cyffredin ynglŷn â pham mae'r gwaith hwn yn bwysig. Rwy'n codi arian ac rydw i hefyd yn cynrychioli'r rhai sydd wedi cefnogi rhywun sy'n byw gyda dementia yn yr elusen."
        },
        {
            "text": "Mae fy siwrnai wedi fy nysgu nad oes neb yn gwybod beth sydd rownd y gornel, ond rydyn ni i gyd yn haeddu'r cyfle i gynllunio ar ei gyfer. Waeth pa mor hen rydych chi, os nad ydych chi wedi meddwl am sefydlu atwrneiaeth arhosol hyd yma, byddwn i wir yn eich annog i wneud hynny. Efallai y bydd yn teimlo fel cam mawr ond mae'n un sy'n diogelu eich dyfodol. Mewn rhai ffyrdd, byddwn i'n dweud ei fod hyd yn oed yn bwysicach nag ysgrifennu ewyllys!"
        },
        {
            "text": "Dogfen gyfreithiol yw Atwrneiaeth Arhosol. Mae'n caniatáu i chi enwebu rhywun rydych chi'n ymddiried ynddo i gamu i mewn a gwneud penderfyniadau am eich iechyd a'ch lles a'ch eiddo a'ch cyllid os nad oes gennych chi'r galluedd meddyliol i wneud hynny."
        },
        {
            "text": "Mae Jill yn un o'r nifer o bobl ledled Cymru a Lloegr sydd wedi gwneud atwrneiaeth arhosol. Nid yw byth yn rhy gynnar i siarad am atwrneiaethau arhosol gyda rhywun rydych chi'n ymddiried ynddo."
        },
        {
            "text": "Dechreuwch sgwrs heddiw."
        },
        {
            "text": "Darllenwch fwy yn  https://powerofattorney.campaign.gov.uk/"
        }
    ]
}