{
    "url": "https://mojdigital.blog.gov.uk/2025/10/14/six-months-in-building-the-women-in-engineering-working-group/",
    "title": "Six Months in - Building the Women in Engineering Working Group ",
    "authors": [
        "Rosie Brigham"
    ],
    "categories": [
        "Ada Lovelace Day",
        "Diversity and Inclusion",
        "Women in Digital & Tech",
        "Women in Engineering"
    ],
    "pub_date": "2025-10-14T15:50:43+01:00",
    "content": [
        {
            "text": "In celebration of Ada Lovelace Day, a moment to honour the achievements of women in STEM, we’re sharing a behind-the-scenes look at how a small group within Justice Digital is trying to engineer organisational change. This blog is part of the Women of Justice Digital and Data Storytelling Series, which celebrates the diverse journeys and contributions of women across our digital, tech, and data teams. "
        },
        {
            "text": "I'm Rosie Brigham, Deputy Head of Engineering at Justice Digital. In practice, that means I'm responsible for ensuring our 400+ engineering professionals have everything they need to build brilliant tools that work for the people who use them – whether that's prison staff, legal aid applicants, or probation services.  "
        },
        {
            "text": "When we first gathered around a virtual table six months ago, I was very nervous. I am relatively new to the Civil Service and wasn’t exactly sure what a working group should look like outside of academia. Imposter syndrome was of course rife and the purpose of the group, to get more women into technical engineering roles, is not an insignificant task. We settled on what might seem like a simple goal: increase the number of women and non-binary people in technical roles. We deliberately chose to measure this in actual numbers rather than percentages, because percentages can be misleading when teams are growing and changing. It's easier to track progress when you're saying \"we had 20, now we have 40\" rather than getting tangled up in shifting denominators. "
        },
        {
            "heading": 2,
            "text": "The Foundation Stuff (AKA The Boring but Crucial Bits) "
        },
        {
            "text": "We started small deliberately. We've assembled a fantastic group of people across Justice Digital - women in technical roles, plus folks from capability, recruitment, and leadership positions. "
        },
        {
            "text": "The decision to keep things intimate initially was important, and frankly, necessary. When you're talking about diversity issues, you're inevitably going to touch on some painful experiences. People need to feel safe sharing moments that might have knocked their confidence, or recounting times when they felt overlooked or undervalued. You can't create that environment overnight, especially when many of us had never worked together before. So, we kept the group small and for the moment don't admit new members - adding people would have altered that foundation of trust, and too many voices, introductions and recaps of ground rules could have meant less action in the short timeframes we have. "
        },
        {
            "heading": 2,
            "text": "Scoping Reality (Or Learning What We Can Actually Influence) "
        },
        {
            "text": "Early on, we had to have an honest conversation about scope. The lack of diversity in engineering is a systemic, cultural issue that goes far beyond what one working group can tackle. We're not going to suddenly convince more women to study computer science at university or A-levels, and we're not going to single-handedly shift decades of workplace culture overnight. "
        },
        {
            "text": "But what we can do is create meaningful change within Justice Digital itself. That's our patch, that's where we have influence, and that's where we can make a real difference. "
        },
        {
            "heading": 2,
            "text": "The Data Challenge "
        },
        {
            "text": "Here's where things got a little tricky. Justice Digital is a sprawling organisation with people in all sorts of roles, and role titles that don't always tell you what someone actually does day-to-day. More importantly, you can't just march up to HR and ask for a breakdown of staff by gender and role - there are obvious and important privacy considerations at play. "
        },
        {
            "text": "We're working through the proper data governance processes to ensure we can access the information we need whilst protecting individuals' privacy. It's a necessary step that reinforces something important: if we're serious about improving representation, we need to do it the right way from the start. "
        },
        {
            "text": "The process has been educational and shown us just how complex our organisational structure is, and how important it is to balance transparency about diversity data with individual privacy rights. "
        },
        {
            "heading": 2,
            "text": "What's Next "
        },
        {
            "text": "Now that we've got our foundations sorted, we've identified three main areas where we can make a difference: recruitment, retention, and outreach. "
        },
        {
            "text": "Recruitment is one of the most direct ways we can improve representation. By increasing the number of women and non-binary people joining us in the first place. We're reviewing job descriptions to ensure they’re welcoming and accessible, aligning outreach with interview processes, partnering with organisations like CodeFirst: Girls, and developing a ‘Returnship’ scheme for career returners to complement our apprenticeship programme. We’re committed to ensuring our recruitment is always inclusive and merit-based, so that everyone has a fair opportunity to thrive. "
        },
        {
            "text": "Retention is more complex. The latest Diversity in Tech report shows that women leave technical careers mid-way through and often don't return. We've planned a research programme using both quantitative and qualitative methods to understand what would keep our female and non-binary colleagues happy and not looking for the exit. We're examining everything from imposter syndrome to exit interview data to see what has been missed and what can be improved on. "
        },
        {
            "text": "Outreach is where we get creative. We've got brilliant blue-sky thinking around mentoring and coaching both within and outside Justice Digital, working with schools, and creating something genuinely valuable within the department. Watch this space! "
        },
        {
            "heading": 2,
            "text": "The Extra Work Problem "
        },
        {
            "text": "There's something else worth calling out. In our discussions, it became clear that women in technical teams often end up doing more work - not the glamorous kind, but the essential emotional labour that keeps teams functioning. This might be facilitating meetings, managing difficult conversations, or making space for everyone to contribute. It's exhausting work that requires real skill, but it's often invisible and unrewarded. "
        },
        {
            "text": "There's also the challenge of sharing the workload fairly when it comes to interview panels. Civil service requirements rightly call for diverse panels, but when teams have limited representation, such as few women, the same individuals are often called upon repeatedly. It’s additional work that should be recognised and supported appropriately. Panels should reflect the diversity they aim to promote, without placing a disproportionate burden on a few. "
        },
        {
            "text": "We're looking at ways to address both the recognition piece and finding practical solutions that don't just pile more responsibility onto people already carrying extra load. "
        },
        {
            "text": "Real change doesn't happen in isolation, it starts with open conversations and shared perspectives. The more voices we include, the stronger and more meaningful our progress will be."
        }
    ]
}