{
    "url": "https://nationalscreening.blog.gov.uk/2025/10/14/tyrosinaemia-screening-implemented-in-england/",
    "title": "Tyrosinaemia screening implemented in England",
    "authors": [
        "Jane Hibbert",
        "Miranda Lawton"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2025-10-14T08:24:40+01:00",
    "content": [
        {
            "text": "Newborn screening for hereditary tyrosinaemia type 1 (HT1) is now being offered to all babies in England."
        },
        {
            "text": "HT1 has become the latest condition to be included in the NHS Newborn Blood Spot (NBS) Screening Programme following a recommendation by the UK National Screening Committee (UK NSC)."
        },
        {
            "text": "HT1 is a serious inherited metabolic disease (IMD) that prevents the body from breaking down a substance called tyrosine found in food. It affects about 7 babies per year in the UK and leads to the build-up of toxic substances that damage the liver, kidneys, and nervous system."
        },
        {
            "text": "Evidence reviewed by the UK NSC found that screening will help detect these babies in time for them to be offered drug treatment and a special diet before becoming ill. These are life-changing benefits that significantly reduce the risk of long-term complications and symptoms such as poor weight gain, jaundice, an enlarged liver, bleeding, and bruising, which can lead to liver and kidney damage. "
        },
        {
            "text": "The roll-out of HT1 screening is the culmination of almost 2 years’ detailed implementation planning by NHS England (NHSE). A UK NSC oversight group and expert clinical and laboratory sub-groups helped lay the groundwork with collaboration between NBS screening laboratories, maternity services, specialist doctors and dieticians. It has also required a change in the testing methodology for IMD screening."
        },
        {
            "text": "The HT1 screening project team would like to thank everyone who has helped make this all possible. The focus will now switch to monitoring the implementation of screening as the 13 NBS laboratories become familiar with using the new testing methodology."
        },
        {
            "text": "NHSE has updated the NBS page on NHS.UK and the Screening tests for you and your baby leaflet to include the addition of HT1 to the screening programme. It has also published new information for parents of babies who screen positive for the condition."
        },
        {
            "text": "Elsewhere in the UK, Scotland hopes to implement HT1 screening early in 2026."
        },
        {
            "text": "Wales is working on developments to infrastructure, systems and clinical pathways so HT1 screening can be introduced as soon as possible and the UK NSC’s recommendation is also being considered within Northern Ireland."
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK NSC. You can register to receive updates direct to your inbox, so there is no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, please email uknsc@dhsc.gov.uk."
        }
    ]
}