{
    "url": "https://space.blog.gov.uk/2025/10/14/understanding-satellite-re-entry-uk-space-agency-leads-global-research-on-atmospheric-ablation/",
    "title": "Understanding satellite re-entry: UK Space Agency leads global research on atmospheric ablation",
    "authors": [
        "UK Space Agency"
    ],
    "categories": [
        "Space sustainability"
    ],
    "pub_date": "2025-10-14T11:42:58+01:00",
    "content": [
        {
            "text": "As satellite activity in Low Earth Orbit (LEO) increases, so does the need to understand its environmental footprint, especially during the re-entry phase."
        },
        {
            "text": "When satellites burn up upon re-entering Earth’s atmosphere, they release particles and gases, including metals like aluminium, which may affect atmospheric chemistry. This process, known as atmospheric ablation, is still poorly understood, but early evidence suggests metal content in the atmosphere is rising."
        },
        {
            "text": "To address these uncertainties, the UK Space Agency commissioned three targeted studies to investigate the potential impacts of satellite re-entry. These projects, led by Durham University, University of Southampton, and Belstead Ltd, have begun to fill critical knowledge gaps and reinforce the UK’s leadership in space sustainability. A fourth study, co-funded by the European Space Agency and led by the University of Leeds, will complete later this year.  "
        },
        {
            "text": "Durham University conducted a comprehensive literature review and gap analysis, highlighting major uncertainties, particularly around ozone-depleting polar stratospheric clouds. Their findings stressed the need for improved observational technologies and multidisciplinary collaboration to inform future UK policy.  "
        },
        {
            "text": "Southampton University proposed a hybrid approach to managing re-entry, combining material selection, design-for-demise strategies, and trajectory optimisation. Their recommendations support investment in UK research infrastructure to advance sustainable space operations. Read the report here."
        },
        {
            "text": "Belstead Ltd carried out a technical assessment of aluminium vaporisation and evaluated UK facilities for experimental validation. They found that ablation depends on factors like particle size and surface properties and recommended targeted testing to better assess environmental risks. Read the report here."
        },
        {
            "text": "A Global Network on Sustainability in Space (GNOSIS) report, also commissioned by the UK Space Agency, highlights critical gaps in how the environmental impacts of space activities are measured and understood. Unlike terrestrial environmental indicators, such as those for emissions or biodiversity, space lacks globally agreed metrics. The report calls for improved tracking of satellite and debris populations, better modelling of space weather effects, and more systematic assessment of re-entry impacts. It underscores the urgency of building consensus around sustainable space practices. "
        },
        {
            "text": "These studies have already had international impact. In May 2025, the UK Space Agency was invited to a UN-led workshop on the environmental effects of space activities, co-chaired by UNOOSA and UNEP. The UK was the most represented nation, with experts from Belstead, UCL, Birkbeck, and the Earth & Space Sustainability Initiative (ESSI) contributing. "
        },
        {
            "text": "Building on these findings, the UK Space Agency will jointly host a dedicated workshop with Secure World Foundation on atmospheric ablation on 21 October, ahead of the Summit for Space Sustainability in Paris. The workshop will bring together international experts to refine research priorities and shape policy recommendations, ensuring that insights from the UK-funded studies directly inform global discussions on responsible space stewardship. "
        }
    ]
}