{
    "url": "https://ipo.blog.gov.uk/2025/10/14/whats-changing-managing-your-patents/",
    "title": "What’s changing – managing your patents ",
    "authors": [
        "Simeon Bowen"
    ],
    "categories": [
        "Innovation",
        "IPO",
        "Patents",
        "Transformation",
        "Uncategorized"
    ],
    "pub_date": "2025-10-14T14:55:48+01:00",
    "content": [
        {
            "text": "Our One IPO Patent Service is set to launch in spring 2026. This new platform will change how you apply for and manage patents, delivering a modern approach to intellectual property management. "
        },
        {
            "text": "We are publishing a weekly blog series to provide you with comprehensive guidance on each aspect of the upcoming changes. Our goal is to ensure you're fully prepared and confident for a seamless move to our new digital service. "
        },
        {
            "text": "So far, the most popular transactions in the new service are all around managing your patents. Things like changing who the representative is, transferring ownership of patents and updating the names and addresses associated with the patent. In today’s blog, we explore how managing your patents is changing in the One IPO service. "
        },
        {
            "heading": 3,
            "text": "What to expect "
        },
        {
            "text": "The new service offers significant improvements to how you manage patents.   "
        },
        {
            "text": "Today, if you want to make changes to patents it’s a very manual process. You complete a paper form or PDF, email it to the IPO and wait 10 days for the IPO to make the change for you. "
        },
        {
            "text": "The One IPO service will make all of this more digital, automated and efficient for customers and the IPO. You will be able to login to your account and make changes to your patents at any time. Most of these will happen automatically within 24 hours, and you will see those changes reflected in your IPO account. "
        },
        {
            "text": "It’s a much simpler process, which is reflected in the number of our pilot customers that have used it. "
        },
        {
            "heading": 3,
            "text": "Benefits for you "
        },
        {
            "text": "There’s lots of great features that offer an improvement from the old system, including: "
        },
        {
            "heading": 3,
            "text": "Changes you can make in your IPO account "
        },
        {
            "text": "You can make or request any changes that you can today via your IPO account. The most common requests are fully digital. That includes: "
        },
        {
            "text": "Some of the less common requests still require you to upload a form at the moment. That includes: "
        },
        {
            "text": "These services don’t get the fully digital treatment yet because we get a very small number of these requests a year. However, there are still big improvements:  "
        },
        {
            "heading": 3,
            "text": "When evidence is required "
        },
        {
            "text": "When transferring ownership of patents, we typically require evidence. In the new service if you meet certain criteria, like being the existing representative, you won’t have to provide evidence, and the transaction will be fully automated. This will mean the transfer is processed within 24 hours, making it much quicker and easier. "
        },
        {
            "text": "If you aren’t currently a representative for the patent you want to transfer you will need to provide evidence. You will still be able to submit these requests via your IPO account, but there will be an extra step in the process while IPO staff manually check your evidence. Once the check is completed, your transfer will be processed. "
        },
        {
            "heading": 3,
            "text": "Improved correspondence"
        },
        {
            "text": "We will send you an email confirmation at each step of the process. You will receive an email when your change request has been submitted and when it has been completed. We send correspondence to the person who submitted the transaction and are also offering the ability to send a copy to a central mailbox in your firm. "
        },
        {
            "text": "When transferring ownership of patents or changing representation, we will also email the previous representatives to inform them of the change. This adds an additional layer of security, because the previous representatives can inform us if any change requests are made in error or maliciously. "
        },
        {
            "heading": 3,
            "text": "Review and collaboration "
        },
        {
            "text": "At the end of each transaction, you will be presented with a ‘check your answers’ page before you submit. This can be shared with colleagues for review and sign off via a screenshot like the one below."
        },
        {
            "text": "Currently there is no ‘save draft’ functionality for these transactions, because they are very short and easy to complete in one sitting. Drafts are saved when applying for a patent or responding to an exam report."
        },
        {
            "heading": 3,
            "text": "How we’re supporting you "
        },
        {
            "text": "We understand that moving to a new digital system can feel daunting. If you're less comfortable with digital processes, support will be available to help you through the transition. We're committed to ensuring all users can access and use the new service effectively."
        }
    ]
}