{
    "url": "https://nda.blog.gov.uk/windscale-from-nuclear-pioneer-to-decommissioning-landmark/",
    "title": "Windscale: From Nuclear Pioneer to Decommissioning Landmark",
    "authors": [
        "Eleanor Thursby, corporate communications Officer",
        "Billy Simpson"
    ],
    "categories": [
        "Mission delivery",
        "Operations",
        "Research and development",
        "Uncategorized"
    ],
    "pub_date": "2025-10-14T11:03:45+01:00",
    "content": [
        {
            "text": "Before we were Sellafield, we were Windscale. A small collection of buildings (two reactors – known as piles, two chimneys, one fuel cooling pond, one waste storage silo, and a reprocessing plant) designed to help the UK develop a nuclear deterrent that would sit at the heart of the country’s national defence."
        },
        {
            "text": "Designing and building those ground-breaking nuclear facilities made the site the birthplace of the country’s civil nuclear industry. It also meant that the people working there were true nuclear pioneers."
        },
        {
            "text": "That pioneering spirit continues, but today our brilliant people and supply chain partners have a different challenge – how do we safely decommission these legacy facilities? And how can we do it in such a way that others can learn and benefit from our work?"
        },
        {
            "heading": 2,
            "text": "The origins of Windscale"
        },
        {
            "text": "After the Second World War, fears of a third led nations to pursue nuclear weapons as deterrents. Britain, initially part of the Manhattan Project, had to develop its own capability after the U.S. passed the McMahon Act, ending atomic collaboration."
        },
        {
            "text": "Sellafield, formerly a munitions factory, was chosen to produce plutonium for the weapon. In 1947, the government approved the construction of two Windscale pile reactors."
        },
        {
            "text": "Just three years later, in 1950, the first reactor started working and by 1952 had produced the first batch of metallic plutonium."
        },
        {
            "text": "To do this, the teams on site had to design and build support buildings, including"
        },
        {
            "text": "Both of the reactors were permanently shut down in 1957 following a fire in reactor 1."
        },
        {
            "text": "Some of the Windscale buildings were repurposed after the fire."
        },
        {
            "heading": 2,
            "text": "Windscale Pile Reactors"
        },
        {
            "text": "Constructed between 1946 and 1951, Pile 1 and Pile 2 were among the site’s earliest buildings. Both reactors were shut down following the 1957 fire that occurred in the reactor of Pile 1."
        },
        {
            "heading": 3,
            "text": "Purpose of the Windscale Piles"
        },
        {
            "text": "The two reactors were the first stage in the process of production of material for the UK’s defence programme via neutron irradiation of natural uranium. Fuel was loaded into the reactor  and discharged into a water duct."
        },
        {
            "heading": 3,
            "text": "Windscale Piles decommissioning progress"
        },
        {
            "text": "The fire in Pile 1 caused damage to both the reactor and the chimney. This has made the decommissioning of this facility more complex than its Pile 2 counterpart."
        },
        {
            "heading": 4,
            "text": "Pile 1"
        },
        {
            "text": "Read more about Pile 1 "
        },
        {
            "heading": 4,
            "text": "Pile 2"
        },
        {
            "text": "Read more about Pile 2 "
        },
        {
            "heading": 2,
            "text": "Pile Fuel Storage Pond"
        },
        {
            "text": "Built between 1948–1952, the Pile Fuel Storage Pond is the world’s largest open-air nuclear fuel storage pond."
        },
        {
            "heading": 3,
            "text": "Purpose of the Pile Fuel Storage Pond"
        },
        {
            "text": "The pond was originally designed to cool, decan, and prepare spent fuel from the Windscale Piles before reprocessing. It was later adapted and handled fuel from other reactor types. Whilst operational, the Pile Fuel Storage Pond accumulated a mix of fuel, isotopes, debris, and sludge."
        },
        {
            "heading": 3,
            "text": "Pile Fuel Storage Pond decommissioning progress"
        },
        {
            "text": "Read more about the Pile Fuel Storage Pond"
        },
        {
            "heading": 2,
            "text": "First-Generation Reprocessing Plant"
        },
        {
            "text": "Originally known as the Primary Separation Plant, the First-Generation Reprocessing Plant was built in the late 1940s. It featured six process cells and a 61-metre ventilation stack."
        },
        {
            "heading": 3,
            "text": "Purpose of the First-Generation Reprocessing Plant"
        },
        {
            "text": "The plant received spent fuel from the Pile Fuel Storage Pond  and carried out the first stage of reprocessing for material from the Windscale Pile reactors. The separated materials were then transferred to other facilities for further processing."
        },
        {
            "text": "The plant operated successfully for 12 years before reprocessing responsibilities shifted to the Magnox Reprocessing Plant. Between 1968 and 1973, part of the facility was refurbished to experimentally dismantle and dissolve oxide fuel from reactors like Windscale Advanced Gas Reactor (WAGR), demonstrating the feasibility of oxide fuel reprocessing."
        },
        {
            "text": "Until its stack was removed, the reprocessing plant also provided ventilation to neighbouring operational facilities."
        },
        {
            "heading": 3,
            "text": "First Generation Reprocessing Plant decommissioning progress"
        },
        {
            "text": "The plant has been partially decommissioned, with ongoing monitoring and maintenance to ensure safety and prevent infrastructure degradation."
        },
        {
            "heading": 4,
            "text": "Ventilation stack"
        },
        {
            "heading": 4,
            "text": "Redundant cells"
        },
        {
            "text": "Innovative techniques have been applied to maintain safety and structural integrity:"
        },
        {
            "text": "Read more about the First Generation Reprocessing Plant"
        },
        {
            "heading": 2,
            "text": "Pile Fuel Cladding Silo"
        },
        {
            "text": "Constructed in the 1950s, the Pile Fuel Cladding Silo was inspired by North American grain silos."
        },
        {
            "heading": 3,
            "text": "Purpose of the Pile Fuel Cladding Silo"
        },
        {
            "text": "The silo was a dry storage-facility that received and stored cladding from decanned fuel. It also held other intermediate-level waste from early site operations."
        },
        {
            "text": "It contains six large compartments and was not originally designed for waste retrieval."
        },
        {
            "heading": 3,
            "text": "Pile Fuel Cladding Silo decommissioning progress"
        },
        {
            "text": "Read more about the Pile Fuel Cladding Silo"
        }
    ]
}