{
    "url": "https://digitaltrade.blog.gov.uk/2024/07/09/building-mentally-healthy-workplaces/",
    "title": "Building mentally healthy workplaces",
    "authors": [
        "Katie Pether, Deputy Service Owner",
        "Jason Kitcat, DDaT Director",
        "Vita Shapland-Howes, Digital and Data Programme Manager, Government Legal Department",
        "Kate Shiner, Chief Operating Officer - Ministry of Justice Digital",
        "Bal Kaur, Senior Delivery Manager",
        "Sam Barton, Deputy Director of Customer Experience, Department for Education"
    ],
    "categories": [
        "People"
    ],
    "pub_date": "2024-07-09T13:44:52+01:00",
    "content": [
        {
            "text": "Katie Pether - Department for Business and Trade"
        },
        {
            "text": "For us to thrive in the workplace, we need a few basic things. We need to enjoy our work, purpose and clear direction, to care about what we are delivering, psychological safety and connection."
        },
        {
            "text": "I have worked with a number of government teams that are looking at how we can create mentally healthy workplaces. These must enable people to openly talk about their mental health in a way that helps them get support and encourages learning. "
        },
        {
            "text": "I have asked teams across government how they create environments where people can talk about their mental health, just as we do our physical health. Here is what they said... "
        },
        {
            "text": "Jason Kitcat - Department for Business and Trade"
        },
        {
            "text": "We are all on different journeys. There will be things going on in colleague’s lives we won’t fully see or understand. It might be illness, caring responsibilities, financial worries, legal disputes or abuse. All of these will impact our mental health in different ways. In my case I was leaving a highly abusive relationship. It was so powerful having the psychological safety to share with peers and my manager some of what I was going through and receiving the support I needed. "
        },
        {
            "text": "I believe building trust and psychological safety is so important. From there stems the space and comfort to share challenges and seek help. For me personally, working with a psychotherapist was key to my recovery. Journaling, running outdoors and using flexible working options have also hugely helped me. "
        },
        {
            "text": "I encourage DBT DDaT to support each other in building a culture of kindness. This creates psychological safety, so we feel comfortable discussing our mental health and seeking help. We also encourage getting time away from screens by talking about it and posting fun things we’ve seen on our time spent exercising outdoors in a shared channel. Finally, we put considerable effort into ensuring everyone understands the full range of superb support and flexibility DBT offers staff. "
        },
        {
            "text": "Vita Shapland-Howes - Government Legal Department"
        },
        {
            "text": "In an increasingly complex and volatile world, environmental, societal, and technological changes can happen quickly. Many problems we face need us to have compassion, curiosity, understanding of power dynamics and a willingness to learn and iterate. When applied, these principles can help us work through complexity and find innovative solutions. "
        },
        {
            "text": "In every government team I’ve worked for, I wonder how can we operate these principles to allow people to innovate and create sustainable organisations?  What does making people feel psychologically safe really mean when creating workplace cultures? "
        },
        {
            "text": "In my experience, the healthiest teams have some, if not all, of the following:  "
        },
        {
            "text": "Kate Shiner - Ministry of Justice Digital"
        },
        {
            "text": "If, like me, you are someone who thrives in high pressure jobs, it is important to recognise when the enjoyment tips into stress. We must foster a healthy work environment and supporting mental well-being in those situations."
        },
        {
            "text": "I know I am feeling stressed when the challenges go from feeling like exciting tasks to feeling like a heavy weight on my shoulders. That is when I know I need to prioritise self-care and seek support from my colleagues.  "
        },
        {
            "text": "Seeking support for me means being authentic and honest which is not just beneficial, but essential. When we are authentic, we allow ourselves to be vulnerable and genuine, which creates a space for open communication and mutual support. In the Department for Education Covid team, the stakes were high and the pressure relentless. Being authentic with my colleagues helped me navigate the challenges effectively. I had never met or worked with most of my team before. By voicing difficulties I was experiencing, I was not only helping myself, but role-modelling to them that this was a safe place to share our feelings without judgment. This sense of camaraderie can significantly alleviate the stress and anxiety within demanding work environments. "
        },
        {
            "text": "Being honest about our struggles lets us normalise discussions around mental health and reduce the stigma sometimes associated with it. By sharing our experiences openly, my job share partner and I created a culture where seeking help was not seen as a weakness, but as a proactive step towards preserving our well-being.  "
        },
        {
            "text": "Bal Kaur - Department for Business and Trade"
        },
        {
            "text": "My own personal journey and the kindness that has followed me through my own career has made me an advocate for how important team health is. "
        },
        {
            "text": "I have reflected on certain “big” moments in my life and how work was and is my escape. When I knew my marriage was breaking down and through my divorce, the kindness and support from my managers and colleagues was second to none. I was grateful for my manager’s advice. “Bal – work around the children,” “Work flexibly,” “How can I support?”"
        },
        {
            "text": "My team went above and beyond when I was not 100%. This had a positive effect on my mental health and home life every day as I felt like I was not alone.  "
        },
        {
            "text": "I find exercise, walking and having a clean environment is also great for my mental health. This gives me clarity and space to focus. I also practice a gratitude mindset. Find that “thing you feel grateful for” and do it more! "
        },
        {
            "text": "A simple thing to do in 1-2-1’s is make these about the “person” rather than the “work”. Create that safe space, so that they can be comfortable sharing at any time. If someone is behaving out of character, ask are you okay? What can I do to support you?  "
        },
        {
            "text": "Let us be kind, listen and be compassionate. I am always blown away by how my teams perform as I put team health above anything! "
        },
        {
            "text": "Sam Barton - Department for Education"
        },
        {
            "text": "As a user-centred design division, my team conducts research with user groups such as young people and adult learners. These include those with experience of care, Special Educational Needs and Disabilities, unemployed people and those with financial and personal difficulties. Our User Researchers have challenging roles. They often face tight deadlines, complex data analysis and the emotional weight of understanding user struggles. We have a strong focus on maintaining a psychologically safe working environment."
        },
        {
            "text": "Here is why supporting their well-being matters: "
        },
        {
            "text": "Resilience - User researchers encounter stories of hardship, frustration, and vulnerability. They empathise with users’ challenges, which can impact their own emotional well-being. Providing emotional support and creating a safe space for debriefing sessions is essential. "
        },
        {
            "text": "Burnout Prevention - Tight project timelines and the need to deliver quality insights contribute to burnout. We prioritise work-life balance in the team, encourage breaks, and promote mental health awareness.  "
        },
        {
            "text": "Training and Professional Development- Investing in user researchers’ development enhances their resilience. Training in stress management, coping strategies and self-care equips them to handle the demands of their roles effectively. "
        },
        {
            "text": "In the future, I would like us to focus even more on enhancing mental health support. This could include creating forums where they can share experiences and coping mechanisms. Supporting the team is about recognising their humanity as well as improving services. Prioritising their mental health empowers them to continue making a positive impact on education. We want to build a culture that values both user insights and the well-being of those who uncover them. "
        },
        {
            "text": "Katie Pether"
        },
        {
            "text": "It has been great to hear how people are actively breaking the stigma of talking about mental ill health in the workplace. There is a lot of support available to civil servants, so do check out your department’s offer and the support available through the Charity for Civil Servants. "
        },
        {
            "text": "We will be sharing more experiences and tips from across government in a series of blogs that focus on mental health. Please get in touch if you would like to contribute. "
        },
        {
            "text": " "
        }
    ]
}