{
    "url": "https://openpolicy.blog.gov.uk/2024/07/09/launching-the-new-policy-lab-prospectus-2/",
    "title": "Launching the new Policy Lab prospectus",
    "authors": [
        "Donna Ward"
    ],
    "categories": [
        "Policy Lab"
    ],
    "pub_date": "2024-07-09T10:41:41+01:00",
    "content": [
        {
            "text": "I am delighted to be launching the new Policy Lab prospectus."
        },
        {
            "text": "Policy Lab has a mission to 'radically improve policy making through design, innovation and people-centred approaches'."
        },
        {
            "text": "From multiple disadvantage, to the fresh water system and national security, Policy Lab brings multidisciplinary expertise to help policy teams understand the present, imagine the future and achieve the policy impacts they intend."
        },
        {
            "text": "Over a 10-year period, the Lab has built a track record working on some of the UK’s most challenging and high-profile areas of policy. It has developed a portfolio of more than 250 participatory and innovation projects across government and beyond, engaged many thousands of members of the public to understand how policies affect their daily lives, and trained thousands of policy professionals in innovation approaches."
        },
        {
            "text": "Policy Lab's work happens in collaboration with policy professionals. Together we can create opportunities to connect innovation methods to the highest priority and most complex policy challenges. The new prospectus sets out Policy Lab’s methods and approach, its offer to its commissioners and partners, and a series of impact case studies."
        },
        {
            "text": "As a director in the Department for Work and Pensions and now the Department for Education, I have seen first-hand how these methods are appropriate for complex challenges involving citizens and users."
        },
        {
            "text": "Donna Ward, Director of Strategic Policy, Department for Education"
        },
        {
            "text": "We hope you enjoy exploring our work to bring leading edge approaches to policymaking into the heart of government. If you would like to commission, partner with or learn more about Policy Lab please get in touch: team@policylab.gov.uk"
        }
    ]
}