{
    "url": "https://naturalengland.blog.gov.uk/2026/02/04/greener-faster-better-how-partnership-working-is-streamlining-development-on-the-lower-thames-crossing/",
    "title": "Greener, Faster, Better: How Partnership Working is Streamlining Development on the Lower Thames Crossing",
    "authors": [
        "Marian Spain"
    ],
    "categories": [
        "Development",
        "Growth",
        "Natural England",
        "Nature"
    ],
    "pub_date": "2026-02-04T12:55:00+00:00",
    "content": [
        {
            "text": "By Marian Spain, CEO of Natural England"
        },
        {
            "text": "It’s not often that a major infrastructure project is associated with being green, but recently I visited a project which aims to be ‘Britain’s greenest road’. This is a bold claim but one that many people, working in partnership, are trying to make a reality. The Lower Thames Crossing project will connect Kent and Essex through two 2.6 mile long tunnels beneath the Thames and is designed to alleviate pressure on the Dartford Crossing."
        },
        {
            "text": "A project of this scale gives us an exciting opportunity to build in nature from the very start, not as an afterthought. Because the truth is, nature and growth aren't in competition. When we get this right, congestion will be cut, boosting the economy, and leaving the environment in a better state than we found it."
        },
        {
            "text": "In July 2025 Natural England was appointed by government as the Lead Environmental Regulator for the Lower Thames Crossing, making the project the first pilot to test this model. What does this mean in practice? Instead of developers going back and forth between different regulators, they'll have one front door on areas of advice that overlap. That means faster decisions, more streamlined processes, and more certainty for everyone involved. "
        },
        {
            "text": "As the Lead Environmental Regulator, Natural England’s focus has been to coordinate input from various regulators, reduce duplication, streamline processes and ensure clear communication, all while working within existing legislative frameworks. Collaboration is therefore key and recently I had the opportunity to get on site with partners from the Lower Thames Crossing, National Highways, the Marine Management Organisation and the Environment Agency to hear more about this pioneering project."
        },
        {
            "heading": 4,
            "text": "Environmental Legacy"
        },
        {
            "text": "Recovering nature is core to Natural England’s recently launched strategy, and it was inspiring to visit the site for the early wetland mitigation works at the historic Coalhouse Point. The area was once marshland but was enclosed by a sea wall and farmed. Before construction of the road and tunnels can begin, Coalhouse Point must be up and running as a wetland habitat for birds and climate resilience. Once functioning, this will support a wide range of bird species such as black-tailed godwit, avocet, ringed plover and lapwing. The great news is this vital wetland habitat creation is on track to be delivered on time, thanks to the close partnership working facilitated by the Lead Regulator."
        },
        {
            "text": "But that’s not the only environmental benefit to come from this project; it also plans to reuse material generated by the construction, such as chalk tunnel spoil. This spoil will be used to create habitats that safeguard rare and threatened brownfield invertebrates such as the shrill carder bee, as many invertebrates bury into this type of material as part of their lifecycle."
        },
        {
            "text": "The Lower Thames Crossing team also hope to create seven green bridges of varying sizes and functions. A green bridge is a vegetated structure built over a road to let wildlife safely cross, connect fragmented habitats and reduce animal-vehicle collisions, whilst also providing connection for people and traffic. Natural England is working with the partnership to ensure the green bridges meet the needs of people, nature, traffic and the wider landscape. The green bridges offer the potential to reconnect nature rich sites previously fragmented by existing roads, providing great opportunities for people to connect these sites. Projects like the Lower Thames Crossing and other major infrastructure are catalysts for change and provide the opportunity to support nature’s recovery at a landscape scale."
        },
        {
            "text": "James Seymour, Deputy Director for Sussex and Kent in Natural England shared his experience of working on the project:"
        },
        {
            "text": "“The environmental legacy of this project is significant. From the ambition for green bridges that support traffic, people, and wildlife, to habitat creation around Coalhouse Point, these measures are critical.”"
        },
        {
            "heading": 4,
            "text": "Partnership Working"
        },
        {
            "text": "This type of nature recovery and environmental benefit cannot be achieved by working in isolation, and it was clear from the site meeting that the Lead Environmental Regulator model is trailblazing a new way to expedite nature recovery while accelerating development. For example, coordinating the permissions required to deliver the early wetland mitigation works at Coalhouse Point involved engaging early and openly to build shared understanding and trust, and working closely with other regulatory bodies to ensure a unified, outcome-focused approach."
        },
        {
            "text": "A key part of the Lead Regulator work is agreeing timelines that rely on the developer providing timely and complete information and regulators reviewing information efficiently. This mutual accountability and shared decision-making is vital to ensuring that the project not only meets its delivery goals, but also leaves a lasting environmental legacy. During the visit, I was happy to see how well this partnership is working."
        },
        {
            "text": "Matt Palmer, Lower Thames Crossing CEO, explains the benefits they have seen from the partnership working that is central to the Lead Environmental Regulator Model:"
        },
        {
            "text": "“The Lower Thames Crossing is one of the UK's most important infrastructure projects. Not only will it tackle congestion and create a new route that will add £billions to the UK economy, it will be the UK's greenest road which will be carbon neutral in construction and create six times more green space than new road."
        },
        {
            "text": "Our landscape-scale nature improvements have been developed jointly with Natural England, a partnership that has only strengthened over time and is now further enhanced by its role as Lead Environmental Regulator. Together we've achieved some important wins for nature - like the ones we're already creating at Coalhouse Point - which show how the Lower Thames Crossing can deliver on its ambitions both to grow the economy and enhance and improve access to the natural world.”"
        },
        {
            "heading": 4,
            "text": "Natural England's role as the Lead Environmental Regulator"
        },
        {
            "text": "From early habitat creation to integrated advice and streamlined decision-making, our role as Lead Environmental Regulator enables efficient delivery in partnership, while upholding environmental standards, in a way that adds long-term value for nature, people, and place."
        },
        {
            "text": "As Lead Environmental Regulator, this project represents a valuable opportunity to formalise and amplify the collaborative relationships that exist between regulators and ensure open dialogue and visibility with all project partners. Our shared mission is clear: to actively seek innovative solutions that enhance outcomes for nature and growth, to avoid delays linked to environmental conditions and ensure commitments are delivered on time."
        },
        {
            "text": "There is always opportunity to learn and that’s one of the exciting things about the Lead Environmental Regulator role with Lower Thames Crossing. We have trialled this role as a pilot. Therefore, there will be a formal evaluation so we can learn lessons for the developer and regulators, which can inform other major projects around the country."
        },
        {
            "text": "One piece of learning is already clear though. The practical benefits of the Lead Environmental Regulator approach have been prominent for the Lower Thames Crossing project. Necessary regulatory processes have been streamlined. For example, the time needed to amend a legal requirement was significantly reduced (achieved in record time) - helping to reduce project risk, practical solutions were sought to protect species whilst supporting the project timeline and delays were prevented by collaborating on protective provisions applications."
        },
        {
            "text": "Nick Harris, National Highways CEO, joined us at the Lower Thames Crossing site and we discussed the future applications of the Lead Environmental Regulator role."
        },
        {
            "text": "“National Highways values its close working relationship with environmental regulators and we are actively working with them to deliver good environmental outcomes. We’re proud to be the first partner organisation, working with Natural England in its role as Lead Environmental Regulator. This relationship will help us protect and harness nature on our soft estate, including clean air and water, biodiversity and cultural heritage, to benefit people and the economy.”"
        },
        {
            "heading": 4,
            "text": "Connection and Nature Recovery"
        },
        {
            "text": "Reflecting on the visit, I can see that the Lower Thames Crossing project shows great promise in terms of connectivity. Connection for people, in terms of access to places and nature, connection for wildlife and connection between organisations. This is just one of the ways that we are innovating at Natural England to drive nature recovery while enabling the building of the essential infrastructure and homes that this country needs."
        }
    ]
}