{
    "url": "https://rpc.blog.gov.uk/2026/02/04/how-the-better-regulation-framework-promotes-competition-to-deliver-affordable-prices-innovation-and-growth/",
    "title": "How the Better Regulation Framework promotes competition to deliver affordable prices, innovation and growth",
    "authors": [
        "John Davies, RPC committee member"
    ],
    "categories": [
        "Better Regulation Framework",
        "Competition"
    ],
    "pub_date": "2026-02-04T11:54:15+00:00",
    "content": [
        {
            "text": "The Better Regulation Framework (BRF) requires departments to undertake a proportionate assessment of the effects of policies on competition, because more competitive markets are better for consumers and spur growth. "
        },
        {
            "text": "Unlike more direct impacts such as administrative costs, knock-on effects of policies on competition may not be obvious. Often the most valuable competitor is the one which is not even there yet: a disruptive innovator whose entry might be stifled by regulations suited to existing suppliers. "
        },
        {
            "text": "Fortunately, the Competition and Markets Authority (CMA) and the Organisation for Economic Co-operation and Development (OECD) have published guidance to help - and the RPC has published case histories showing how departments have successfully used the CMA framework in impact assessments."
        },
        {
            "heading": 2,
            "text": "Harm to competition from policy interventions can hurt consumers and restrain growth, by making entry more difficult"
        },
        {
            "text": "Competitive markets usually produce better economic outcomes than monopolised or state-directed markets. When buyers can choose between suppliers, they can find products better suited to their needs and this process rewards those suppliers with better, cheaper or more innovative products than their rivals. "
        },
        {
            "text": "Harming competition does not merely increase prices, it results in a less productive and innovative economy, harming growth, as reported in the OECD's report on competition and macro-economic outcomes."
        },
        {
            "text": "Sometimes, promoting competition is the main objective of a policy intervention, for example by requiring interoperability of digital systems, as highlighted in this Ofcom economics discussion paper."
        },
        {
            "text": "Government intervention and regulation aimed at other policy objectives also has the potential to restrict competition, with effects that can be longer-lasting than the private cartels or monopoly abuses forbidden by competition law. The UK is one of the better performers in this area, but any new policy could harm competition and decision-makers need an honest assessment of the competitive effects, and potential alternatives."
        },
        {
            "text": "Successful entry usually requires something new, significantly cheaper or better than existing products. Entrants are often the source of ‘disruptive innovation’ as noted in the OECD's policy paper on disruptive innovations and their effect on competition. Challengers with new ways of doing things, such as ride-hailing apps like Uber and Bolt, came from apparently nowhere to overturn industry norms. Regulations can be particularly harmful to such radical entrants, if they entrench existing standards, or specify particular ways of doing things."
        },
        {
            "heading": 2,
            "text": "The Better Regulation Framework guidance recommends use of the CMA’s five-step checklist in options assessments and impact assessments"
        },
        {
            "text": "Whether competition is an objective of the policy, or may be harmed by it, this must be assessed when shortlisting policy options and in selecting a preferred option in impact or options assessments. The RPC may require changes to the assessment, or red rate it, if this assessment does not adequately support the proposed way forward. "
        },
        {
            "text": "More detailed assessment should be provided in the regulatory scorecard, considering competition effects within the overall cost-benefit analysis. The CMA’s competition assessment guidelines for policymakers suggest that a policy measure could have a significant impact on competition if it:"
        },
        {
            "text": "Examples of these are available in the CMA’s guidelines and RPC case histories on competition assessments. I will focus here on the first, as this relates to entry."
        },
        {
            "heading": 2,
            "text": "Assess whether the policy could deter entry"
        },
        {
            "text": "Sometimes regulations directly restrict entry, although this is rare. More commonly, regulations can slow down or impose additional costs on entrants. Advertising bans make it harder for new entrants to inform consumers and thus displace rivals. This was a concern examined by the Department of Health and Social Care in the impact assessment for its policy to restrict advertising of high fat, salt and sugar products to children."
        },
        {
            "text": "However, any policy that imposes ‘fixed’ costs that do not scale with firm size will necessarily be placing a greater burden on new entrants than on existing firms. So will standards that are already met by existing firms. Studies have shown that larger firms are more likely to lobby for regulations imposing costs or standards on their industry, as they fully understand these help preserve their positions. "
        },
        {
            "text": "Policymakers need to be aware of these vested interests and the potential impact on barriers to entry."
        },
        {
            "heading": 2,
            "text": "Mitigating harm to competition: explore options to protect new entrants and small business"
        },
        {
            "text": "Policymakers should explore options to mitigate any harm to competition. Does the policy objective really need to be achieved in this manner or are there more pro-competitive alternative ways of intervening? OECD and CMA guidelines provide examples. Think about ways in which policies could be implemented while allowing new entrants flexibility in how to meet requirements. "
        },
        {
            "text": "The BRF always requires formal consideration of a small business exemption. If this is not possible, try to avoid imposing fixed costs disadvantaging smaller and newer firms, or being over-specific about how to meet a regulated standard, as this can protect incumbent firms and existing technologies."
        },
        {
            "text": "When consulting ‘the industry’ be aware of the vested interests of those firms. Make an effort to contact smaller existing suppliers, who may be less active in consultations and industry forums, and try to find possible disruptive entrants, such as tech firms who might be considering entering the industry with radically different business models."
        },
        {
            "text": "Finally, the monitoring and evaluation plan should set out how any competitive effects of the policy will be evaluated in the post-implementation review. For example by identifying data sources that could be used to evaluate entry and exit, or the dynamics of prices, especially if the before-and-after effects of the intervention can be compared to an unaffected industry or region. Again, if the regulation turns out to be harming competition, policymakers will need to understand why, to redesign it to mitigate this effect."
        },
        {
            "text": "The RPC can help in thinking through these problems. We have expertise, derived from applying the BRF in the UK, but also experience from overseas and from the private sector in identifying competition problems and thinking about alternatives. "
        },
        {
            "text": "Contact us at enquiries@rpc.gov.uk and subscribe to our blog for further advice and support."
        }
    ]
}