{
    "url": "https://defrafarming.blog.gov.uk/2026/02/04/introducing-the-new-nutrient-management-planning-tool-on-gov-uk/",
    "title": "Introducing the new nutrient management planning tool on GOV.UK",
    "authors": [
        "David Solomon"
    ],
    "categories": [
        "Farming and Countryside Programme"
    ],
    "pub_date": "2026-02-04T10:52:47+00:00",
    "content": [
        {
            "text": "Managing nutrients is one of the most important jobs on a farm. It affects crop performance, input costs and how farming impacts the environment. "
        },
        {
            "text": "Apply too little and crops won’t reach their potential. Apply too much and fertiliser, slurry and other organic materials are wasted, costs rise, and the risk of nutrients running into rivers and streams increases."
        },
        {
            "text": "Good nutrient planning helps you get the best from your crops, keeps costs down and reduces harm to the environment."
        },
        {
            "text": "To make this easier, we’ve created a new online tool: the Plan and Manage Nutrient Applications Tool."
        },
        {
            "text": "The tool builds on the existing PLANET and MANNER-NPK tools. "
        },
        {
            "text": "Defra developed it with independent provider of agricultural and environmental advice, ADAS (who created PLANET) and the Agriculture and Horticulture Development Board (AHDB)."
        },
        {
            "text": " Farmers and advisers tested it on real farms over several months, helping shape a tool that works in practice."
        },
        {
            "text": "The tool uses the latest RB209 guidance (the Nutrient Management Guide) to calculate nutrient recommendations using your own farm data, such as soil analysis and expected yields. "
        },
        {
            "text": "By following the recommendations, you can reduce over-application, cut waste and make sure every bag of fertiliser or load of slurry contributes to crop growth."
        },
        {
            "text": "Because it’s online, there’s nothing to install. Once you’ve set up your farm and fields and entered your soil type and soil analysis, the tool can pull in local data from your postcode automatically, including rainfall and altitude. You can also adjust the rainfall figure if needed."
        },
        {
            "text": "It then guides you to nutrient recommendations across a wide range of crops, including arable, grassland, horticulture and permanent crops, and it can be used for organic and regenerative systems too."
        },
        {
            "text": "The tool takes account of factors such as soil type, previous crops and the environmental setting of your farm, helping you make well-informed decisions efficiently."
        },
        {
            "text": "Your data is stored securely. In future updates, you’ll be able to import farm data from PLANET to help set up your plan. "
        },
        {
            "text": "Not all data will transfer at first, but we’ll expand this over time so you can build on your plans year after year."
        },
        {
            "text": "You can also share reports with advisers, tenants, or for compliance purposes. No data will be shared directly for compliance monitoring."
        },
        {
            "text": "If your farm is in a Nitrate Vulnerable Zone (NVZ), you can confirm this in the tool. It will then produce the correct compliance reports, giving you confidence that your nutrient planning meets regulatory requirements. "
        },
        {
            "text": "It's free to use. We’re launching it in England and Wales first, with Scotland following in 2026. "
        },
        {
            "heading": 2,
            "text": "Join the explainer webinar"
        },
        {
            "text": "On Wednesday, 4 March, ADAS will run a free webinar explaining how the tool works."
        },
        {
            "text": "Register to join the webinar "
        },
        {
            "text": "As you start using it, we welcome your feedback in the comments below. Your input will inform improvements."
        },
        {
            "text": "The tool has been built and tested with farmers and advisers, and we’re keen to see it used on farms across the country. "
        }
    ]
}