{
    "url": "https://forestrycommission.blog.gov.uk/2026/02/04/looking-back-looking-forward-farewell-reflections-from-the-chair-of-the-forestry-commission/",
    "title": "Looking back, looking forward: farewell reflections from the Chair of the Forestry Commission",
    "authors": [
        "Sir William Worsley"
    ],
    "categories": [
        "Climate change and resilience",
        "Our staff",
        "Woodland creation",
        "Woodland management"
    ],
    "pub_date": "2026-02-04T10:00:00+00:00",
    "content": [
        {
            "text": "As I prepare to step down as Chair of the Forestry Commission after six extraordinary years, I find myself reflecting on what we have achieved, what lies ahead and what this role has meant to me personally."
        },
        {
            "text": "I have always felt a deep connection to the land. Trees and forests have been a constant in my life – grounding, reassuring, and inspiring. My love of nature and my belief in environmental stewardship has shaped everything I do."
        },
        {
            "text": "When I became Chair of the Forestry Commission, I saw it as an opportunity to serve the public and to help safeguard something precious: the landscapes that define our country and the woodlands and forests that will underpin our climate resilience for generations to come."
        },
        {
            "heading": 2,
            "text": "Why forests matter"
        },
        {
            "text": "The Forestry Commission are the government’s forestry experts. We manage the nation’s forests, protect and expand England’s woodlands, and work with landowners, communities and partners to ensure trees and forests thrive. It is work that touches every part of the country and every aspect of our lives."
        },
        {
            "text": "Forests are not just beautiful, they are vital. They lock in carbon, provide timber for our homes, create habitats for wildlife, and offer spaces for people to connect with nature. The Forestry Commission has a unique role in shaping all of this, balancing environmental, economic, and social needs, whilst meeting our important regulatory and legal duties."
        },
        {
            "text": "That sense of purpose drew me in six years ago, and my experience as Chair has only deepened my conviction that forestry matters now more than ever."
        },
        {
            "heading": 2,
            "text": "What we have achieved together"
        },
        {
            "text": "When I look back over my time as Chair, I am proud of how far we have come. We set out to build a more focused, effective organisation, and we have done just that."
        },
        {
            "text": "We have strengthened how the Commission works, with clearer decision making and greater accountability for delivering results. New leadership has made us more resilient for the future and we are now more visible, playing a central role in influencing forestry policy and leading delivery across England."
        },
        {
            "text": "We have also worked hard to improve diversity – both within our workforce and in the way we think about forestry. This is not simply about representation; it’s about bringing in a range of perspectives and skills that make us stronger and more innovative."
        },
        {
            "text": "One of my key ambitions as Chair was to raise the profile of forestry and the Commission’s work. We have championed the importance of trees in tackling climate change, restoring biodiversity, and supporting rural economies. Public awareness and engagement have grown, and forestry is now firmly on the national agenda."
        },
        {
            "text": "These achievements belong to the dedicated staff across the Forestry Commission as much as to me. Their knowledge, professionalism and passion for forestry is extraordinary and I owe a great debt of gratitude for the hard work and support during my time as Chair."
        },
        {
            "heading": 2,
            "text": "Looking ahead"
        },
        {
            "text": "While we have achieved a great deal, there is still much to do. As I hand over to my successor, I want to highlight three priorities that I believe are critical for the years ahead."
        },
        {
            "heading": 3,
            "text": "Timber security, growth and development"
        },
        {
            "text": "Timber is a strategic resource that underpins our homes, infrastructure and economy. Yet, despite record planting rates, England is still losing productive woodland, particularly the conifers that provide the bulk of our domestic timber."
        },
        {
            "text": "Without action, we risk even greater reliance on imports, exposing us to global market shocks and increasing our carbon footprint. With the government committed to building 1.5 million new homes – the question of how many of these can be built using homegrown timber is more pressing than ever."
        },
        {
            "text": "We need a balanced approach. That is why the Forestry Commission has recommended that all government-funded schemes include at least 30% productive species, securing timber for future generations while maintaining biodiversity goals."
        },
        {
            "heading": 3,
            "text": "Building resilience through diversity"
        },
        {
            "text": "Climate change, pests, and diseases are real and growing threats. To future-proof our forests, we must expand species selection and create diverse, resilient woodlands. Planting only native species may not withstand future climate pressures, and unmanaged woods are far less resilient to stressors like wildfires and disease."
        },
        {
            "text": "By integrating a mix of species, including productive conifers and climate-adapted broadleaves, we can safeguard our forests against future risks and ensure they continue to deliver for nature, climate and people."
        },
        {
            "heading": 3,
            "text": "Maintaining strong foundations"
        },
        {
            "text": "Good governance may not be the most thrilling subject, but it is the backbone of everything we do. Over the past six years, we have strengthened how the Commission operates, with a clear strategy, robust planning, and better ways of measuring our performance."
        },
        {
            "text": "This progress must continue. Strong foundations ensures that the Commission remains focused, transparent and effective in delivering its mission – whether that’s bringing timber to market, supporting landowners to grow more trees, or leading world-class research."
        },
        {
            "heading": 2,
            "text": "A personal thank you"
        },
        {
            "text": "As I step down, I do so with immense pride and gratitude. It has been an honour to lead the Forestry Commission through a period of real progress and to work alongside such talented and committed people, in both the Commission and the wider sector."
        },
        {
            "text": "I am delighted to welcome Baroness Young as the new Chair. Her deep experience and lifelong commitment to the environment will serve the Commission exceptionally well. I know the organisation will continue to thrive under her leadership, and I look forward to seeing its important work go from strength to strength in the years ahead."
        },
        {
            "text": "To everyone who cares about our forests, whether you walk in them, work in them, or simply value what they give us, thank you for your support. Our woodlands are one of our greatest national assets and their future has never been more important."
        }
    ]
}