{
    "url": "https://educationhub.blog.gov.uk/2026/02/more-support-for-children-through-foster-care-what-you-need-to-know/",
    "title": "More support for children through foster care: what you need to know ",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Foster Carer",
        "Fostering"
    ],
    "pub_date": "2026-02-04T12:58:34+00:00",
    "content": [
        {
            "text": "Foster carers provide safe, stable homes for children who cannot live with their birth families. For many children, fostering offers the chance to grow up in a caring family environment, close to their community. "
        },
        {
            "text": " New plans have been set out to increase the number of foster carers in England and improve the support available to foster families. Here’s what’s changing and why it matters. "
        },
        {
            "heading": 3,
            "text": "What’s being introduced? "
        },
        {
            "text": "Plans are in place to create up to 10,000 new foster care places during this Parliament, changing rules to accommodate different types of loving families."
        },
        {
            "text": "This is alongside a national drive to encourage more people to consider fostering, opening up fostering to a more diverse range of people. "
        },
        {
            "text": "This comes at a time when more children need foster care, but fewer people are currently approved to provide it, often because they aren’t married to their partner, don’t own their own home, work full time or even if they’ve had therapy for mental health challenges "
        },
        {
            "heading": 3,
            "text": "Why is this needed? "
        },
        {
            "text": "Over the last ten years, the number of approved foster carers in England has fallen by almost 12%, with numbers dropping further since the Covid pandemic. During the same period, the number of children in care has increased. "
        },
        {
            "text": "Because of this, some children are placed far from home or in residential care. These placements can be more disruptive for children, if they have to move far from home, and are often linked to poorer outcomes in education and health. "
        },
        {
            "text": "Increasing the number of foster carers will help more children stay in family homes that meet their needs. "
        },
        {
            "heading": 3,
            "text": "Who can foster? "
        },
        {
            "text": "Fostering is being opened up to a wider range of people by updating long-standing assumptions about what foster carers need to look like. "
        },
        {
            "text": "You do not need to: "
        },
        {
            "text": "People of different ages, backgrounds and family set-ups can foster, as long as they are able to offer a safe, stable and supportive home. "
        },
        {
            "heading": 3,
            "text": "What support is available for foster carers? "
        },
        {
            "text": "Additional funding is being used to strengthen support for foster carers and the services around them. "
        },
        {
            "text": "This includes: "
        },
        {
            "text": "There is also a focus on offering support earlier, rather than waiting until families are under pressure. "
        },
        {
            "heading": 3,
            "text": "What else is changing? "
        },
        {
            "text": "A new vision and action plan for fostering sets out practical changes to make fostering simpler and more supportive, including: "
        },
        {
            "text": "These changes are designed to make fostering easier to understand, easier to access and easier to sustain. "
        },
        {
            "heading": 3,
            "text": "What does this mean for children? "
        },
        {
            "text": "Creating more foster care places would mean more children growing up in safe, supportive family homes, rather than being placed far from their community or in residential care. "
        },
        {
            "text": "Stable foster homes can help children build strong relationships, recover from difficult experiences and feel more settled at school and at home. "
        }
    ]
}