{
    "url": "https://space.blog.gov.uk/2026/02/04/uk-space-agency-accelerator-drives-investment-and-growth-across-space-sector/",
    "title": "UK Space Agency Accelerator drives investment and growth across space sector",
    "authors": [
        "UK Space Agency"
    ],
    "categories": [
        "Catalysing Investment"
    ],
    "pub_date": "2026-02-04T10:00:00+00:00",
    "content": [
        {
            "text": "The UK Space Agency Accelerator announced impressive results from its 2025 Explore and Leo accelerator cohorts, demonstrating how targeted support can rapidly accelerate investment, revenue growth and commercial readiness among UK space entrepreneurs."
        },
        {
            "text": "Since its launch, the Accelerator has delivered 20 cohorts, supported more than 317 high-potential space entrepreneurs from across the UK, and provided over 11,000 hours of hands-on mentoring, guidance and support. Participating ventures have collectively raised more than £65 million, highlighting its strong return on investment and its role as a powerful engine for innovation and growth in the UK’s growing space industry."
        },
        {
            "heading": 2,
            "text": "Explore and Leo outcomes"
        },
        {
            "text": "Earlier in 2025, the Explore and Leo cohorts welcomed 45 entrepreneurs in total, supporting founders at an early stage of their journey to build confidence, sharpen leadership capability and accelerate commercial decision-making. Across both cohorts, participants reported more than 200 new high-value connections with investors, partners, peers and mentors, focused on long-term collaboration and commercial opportunity. Moreover, entrepreneurs formed over 35 new strategic partnerships, reflecting the Accelerator’s emphasis on peer learning, ecosystem engagement and long-term relationship building."
        },
        {
            "text": "In just a few months, entrepreneurs across Explore and Leo secured more than £2.8 million in combined private and grant funding, increased monthly revenue by over £112,000, and strengthened their routes to market. Participants also reported measurable progress in customer engagement, technology readiness and commercial focus; key indicators for ventures moving from development toward deployment. "
        },
        {
            "text": "Founders highlighted the value of personalised mentoring, investor-led insight and practical commercial support in helping them refine their value propositions, build resilience as leaders and move faster with greater clarity. Several entrepreneurs noted that the programme helped unlock opportunities that would otherwise have taken significantly longer to achieve, accelerating time to market by an average of more than six months across the cohorts. "
        },
        {
            "heading": 2,
            "text": "Supporting businesses to scale"
        },
        {
            "text": "One example of this long-term impact is Frontier Space, a UK-based space biotech company that participated in the Leo programme. Through continued access to expert-led support and investor insight, Frontier strengthened its commercial and investment readiness."
        },
        {
            "text": "Since then, the company has successfully validated its SpaceLab Mark 1 autonomous microgravity laboratory in orbit, marking a major milestone in its journey toward scalable in-space research and biomanufacturing services. This milestone positions Frontier Space at the forefront of commercial microgravity science, opening new pathways for pharmaceutical R&D and sustainable production that could benefit industries back on Earth. "
        },
        {
            "text": "Aqeel Shamsul, CEO of Frontier Space, said: "
        },
        {
            "heading": 2,
            "text": "Building a stronger UK space ecosystem"
        },
        {
            "text": "These results demonstrate the Accelerator’s growing impact in developing entrepreneurial capability alongside commercial outcomes. By focusing on mindset, leadership and connection to the wider space ecosystem, the UK Space Agency Accelerator is helping entrepreneurs turn ambition into action, attract investment at pace and deliver lasting economic value for the UK. "
        },
        {
            "text": "Antonia Yendell, Head of Space Ecosystem Development, UK Space Agency said:"
        },
        {
            "text": "While Explore and Leo have now concluded, the Accelerator continues to support ventures through its Fusion, Geo, and Shuttle programmes, further strengthening the UK’s position as a hub for space innovation and commercial growth. "
        },
        {
            "text": "Beyond the space sector itself, the technologies being developed by the UK Space Agency Accelerator’s supported businesses contribute to everyday life, including satellite-enabled navigation and weather forecasting, as well as advances in science and industry that improve productivity and economic efficiency across the UK. "
        },
        {
            "text": "Applications for upcoming programmes are set to open early 2026.  "
        },
        {
            "heading": 2,
            "text": "Register for Fusion’s Demo Day"
        },
        {
            "text": "Join us for Fusion’s Demo Day on 24th February 2026 – an opportunity to meet a cohort of investment-ready UK space ventures, showcasing innovations across defence, agritech, climatetech, AI and more. This virtual event offers a first look at the technologies and entrepreneurs shaping the future of the UK space sector."
        },
        {
            "text": "Find out more and register here."
        },
        {
            "text": "For more on the UK Space Agency Accelerator and how to get involved, visit ukspaceaccelerator.co.uk"
        }
    ]
}