{
    "url": "https://civilservicelocal.blog.gov.uk/2021/08/02/a-chance-to-catch-up-on-some-of-our-recent-events/",
    "title": "A chance to catch up on some of our recent events",
    "authors": [
        "Ian Barton"
    ],
    "categories": [
        "A National Spotlight",
        "East, South East & London"
    ],
    "pub_date": "2021-08-02T14:38:12+00:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": "Civil Service Local East, South East and London is offering civil servants the opportunity during August to catch up on some of our recent online events that they might have missed."
        },
        {
            "text": " "
        },
        {
            "text": "We will be showing recordings of the following events:"
        },
        {
            "heading": 4,
            "text": "Learn about the Benenden Health offer to civil servants"
        },
        {
            "text": "Benenden Health is a not-for-profit Affordable Health Care Provider mutual society UK providing private medical cover for civil servants. In this session you'll to hear about how they support the health and wellbeing of you and your family, the provision of private diagnosis and treatment when there is a wait on the NHS, access to a GP 24/7, physiotherapy and much more."
        },
        {
            "heading": 4,
            "text": "Getting your finances into shape with Commsave Credit Union"
        },
        {
            "text": "Commsave is a staff benefit for civil servants. It is also a credit union, not for profit financial co-operative owned and controlled by its members. In this session you'll hear about the schemes and benefits they have to offer, including top tips for taking control of your finances."
        },
        {
            "heading": 4,
            "text": "Discover the work of the Youth Justice Board"
        },
        {
            "text": "The YJB is a non-departmental public body that oversees the youth justice system in England and Wales. This session offers you a background to the agency, an insight into their roles, and share ways that you can get involved with the vast and exciting volunteering opportunities they have on offer."
        },
        {
            "heading": 4,
            "text": "An Introduction to the National Crime Agency"
        },
        {
            "text": "Do you want to learn more about the agency leading the UK’s fight against serious and organised crime? In this session you will hear from National Crime Agency (NCA) officers as they give an introduction to the agency and explain their roles within it."
        },
        {
            "text": " "
        },
        {
            "text": "These sessions are relevant to civil servants wherever they are in the UK. Please see the following information in order to book your place."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}