{
    "url": "https://deframedia.blog.gov.uk/2021/08/02/funding-boost-for-farmers-to-tackle-water-pollution/",
    "title": "Funding boost for farmers to tackle water pollution",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Weekly stories"
    ],
    "pub_date": "2021-08-02T11:26:21+01:00",
    "content": [
        {
            "text": "There is media coverage in the Times and Daily Express today (2 August) on the government’s expansion of the popular Catchment Sensitive Farming (CSF) programme to cover every farm in England."
        },
        {
            "text": "The programme – which is a partnership between Defra, Natural England and the Environment Agency – provides free 1-2-1 advice to farmers to help them reduce water and air pollution through management of farmyard manure and soils among other things."
        },
        {
            "text": "In recent years it has reduced the number of serious water pollution incidents by almost a fifth, and helped farmers access £100m in grants to help protect the environment."
        },
        {
            "text": "The funding for the programme will now be almost doubled, with an additional £17m over the next three years. The new annual budget will be £30m, up from £16.6m in 2020 / 21."
        },
        {
            "text": "The extra funding will provide more Natural England advisers to help farmers implement practical solutions to reduce pollution, including planting new grassland buffer strips to improve drainage, establishing river side trees to reduce run off into rivers and using better slurry storage facilities to avoid accidental spillage."
        },
        {
            "text": "Environment Minister Rebecca Pow visited Higher Blindmoor Farm in Somerset on Friday, to meet farmer Henry Pym, who has engaged with Catchment Sensitive Farming for a number of years."
        },
        {
            "text": "His small family dairy farm is at the headwater of the River Yarty, which runs into the River Axe – a priority catchment for improvement. As a result of the advice received, he has successfully applied for grants to grow herbal leys (grassland), which have helped with soil health, structure and drainage. The herbal leys mean no fertiliser is needed, cutting operating costs and preventing fertiliser run-off. The quality and output of milk from his dairy herd has also benefitted from the grassland that he’s planted."
        },
        {
            "text": "Minister Pow spoke to Farming Today from Henry Pym’s farm about the expansion of the programme to cover all of England, explaining how the best way to get a grip on the big issues around water pollution is to get advice on the ground to the farmer tailored to the particular challenges of their catchment."
        },
        {
            "text": "Today’s announcement sits alongside other steps the Government is taking to tackle water pollution, including new legislation in the Environment Bill to reduce the use of storm overflows and £144m of new, additional investment from water companies on storm overflows within the current 5-year planning period (2020 – 2025)."
        },
        {
            "text": "Environment Secretary George Eustice said: "
        },
        {
            "text": "Henry Pym from Higher Blindmoor Farm in Somerset, said: "
        },
        {
            "text": "Marian Spain, Chief Executive of Natural England, said: "
        },
        {
            "text": "In addition, Defra has announced it will allocate the Environment Agency £1.2 million to significantly increase the number of inspectors visiting farmers to reduce diffuse water pollution, with 50 additional full time employees recruited for inspections."
        },
        {
            "text": "Sir James Bevan, Chief Executive of the Environment Agency, said: "
        },
        {
            "text": " "
        }
    ]
}