{
    "url": "https://insolvencyservice.blog.gov.uk/2021/08/02/the-world-of-football-comes-to-the-insolvency-service/",
    "title": "The world of football comes to the Insolvency Service",
    "authors": [
        "Alison Wakeling"
    ],
    "categories": [
        "Insolvency",
        "Macclesfield Town FC",
        "Official Receiver"
    ],
    "pub_date": "2021-08-02T10:13:46+00:00",
    "content": [
        {
            "text": "I’m Alison and I’m a Senior Examiner and Deputy Official Receiver here at the Insolvency Service. My team is in the Public Interest Unit, which is part of Official Receiver Services."
        },
        {
            "text": "The Public Interest Unit conducts the high profile, complex, liquidations and bankruptcies that expose the Insolvency Service to reputational or financial risk, or which require urgent responses or resourcing in excess of an ordinary liquidation."
        },
        {
            "heading": 2,
            "text": "A winding-up order received"
        },
        {
            "text": "An example of the complexity and urgency of the cases can be demonstrated by an email I received one day last September titled “Urgent, give me a call”. It was from my manager. A winding-up order had been made that day against Macclesfield Town Football Club Limited on a petition presented by HMRC."
        },
        {
            "text": "The case was allocated to me, and my first thoughts were that I’d never dealt with a football club and I knew it would be high-profile."
        },
        {
            "heading": 2,
            "text": "Football fixtures and contracted players"
        },
        {
            "text": "On the making of a winding-up order for a company operating an English League club, the club remained contractually bound to fulfil its fixtures. Fortunately, sporting fixtures were suspended due the COVID-19 pandemic, and the English football season was not scheduled to restart until 3 October. This bought me some time, but not a lot."
        },
        {
            "text": "Another consequence of the winding-up order was the players’ contracts were to be transferred to the Premier League or the English Football League (EFL). This is where it became interesting."
        },
        {
            "heading": 2,
            "text": "Relegation complicates the story"
        },
        {
            "text": "A month prior to the winding-up order, the EFL arbitration panel had handed down its decision on Macclesfield Town’s off-pitch financial problems."
        },
        {
            "text": "This decision saw the club’s suspended points deduction for the 2020-21 season being applied to the 2019-20 season. This effectively relegated the football club out of the EFL."
        },
        {
            "heading": 2,
            "text": "Inspecting the premises"
        },
        {
            "text": "Despite our best efforts to make immediate contact with the company director, we did not get much joy. What we did know was the director was talking about an application for rescission on the grounds of payment in full (spoiler alert: this did not materialise). We then set out to make an inspection of the premises and to look into any valuable assets the company owned."
        },
        {
            "text": "In the meantime, I began liaising with the National League on their rules, The Football Association (FA), with whom players were registered, and the EFL who helpfully told me about other ongoing High Court proceedings."
        },
        {
            "heading": 2,
            "text": "On the pitch"
        },
        {
            "text": "For a club to continue to play in the National League, it's a rule that any buyer would have to pay off all creditors, including football creditors. This includes players and former players. On the making of the winding-up order, The National League suspended the club, which I agreed for three matches."
        },
        {
            "text": "The FA asked whether the club was entering the 2020-21 FA Cup and FA Trophy, while the National League were asking if the club would be able to play an upcoming match with Eastleigh FC. Suddenly, I had gone from a Senior Examiner at the Insolvency Service to someone in control of football fixtures."
        },
        {
            "heading": 2,
            "text": "The sale of the football club"
        },
        {
            "text": "A campaign was started with full and final offers for the leasehold of the club's Moss Rose stadium and intellectual property to be received by 28 September. Consideration had to be given to any buyer wanting to play the club again at the start of the season or shortly after. Offers were considered on the basis of progressing the sale quickly."
        },
        {
            "text": "Indeed, the sale was completed in just 11 working days on 13 October by the Official Receiver, Catherine Hudson. It was announced that Macclesfield Town FC Limited, the trading company behind the football club, was sold to Macc Football Club Limited."
        },
        {
            "text": "The Official Receiver stated:"
        },
        {
            "heading": 2,
            "text": "A new beginning"
        },
        {
            "text": "There was considerable interest from the media following the sale following the news that former Strictly Come Dancing contestant and Welsh International footballer, Robbie Savage, was part of the new club management."
        },
        {
            "text": "The sale of the company, within just two weeks, allowed the renamed Macclesfield FC to be ready to start its new season in the North West Counties League for the 2021-22 season.  This is something I'm really proud of."
        },
        {
            "text": "This was a real team-work exercise and completely different to our usual investment scams work that drop into our inbox!"
        },
        {
            "heading": 3,
            "text": "Further information"
        }
    ]
}