{
    "url": "https://educationhub.blog.gov.uk/2021/08/what-are-the-benefits-of-learning-latin-and-mandarin-in-school/",
    "title": "What are the benefits of learning Latin and Mandarin in school?",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Languages",
        "Schools"
    ],
    "pub_date": "2021-08-02T17:21:35+01:00",
    "content": [
        {
            "text": "Learning a language has so many benefits. Whether it’s learning about a new culture or history, improving your memory or your performance across other academic areas.  "
        },
        {
            "text": "According to the CBI's Education and Skills Survey published in 2019, 65% of businesses say they value foreign language skills.  "
        },
        {
            "text": "And with the employment benefits, come opportunities, and that’s why we plan to invest £4 million into the new Latin Excellence Programme and will extend the Mandarin Excellence Programme for at least another three years.  "
        },
        {
            "text": "Here, we take a look at the benefits of learning Latin and Mandarin and the opportunities they can bring."
        },
        {
            "heading": 3,
            "text": "So, what is Latin?"
        },
        {
            "text": "Latin is the language of ancient Rome and has a major influence on many of the languages spoken around the world today.  "
        },
        {
            "heading": 3,
            "text": "But nobody speaks it today – so what’s the point in learning it?"
        },
        {
            "text": "Around two thirds of English words are derived from Latin. It’s a similar story for Spanish, Italian, French, Portuguese and many of the other languages spoken in the west.   "
        },
        {
            "text": "Understanding Latin gives anyone looking to understand any of the languages derived from it an advantage. And, in fact, lots of languages that may not have their roots in Latin, like German and even Russian and Chinese have some Latin influence.  "
        },
        {
            "heading": 3,
            "text": "Ok. But pupils have been learning languages successfully without it for years – are there any other benefits?"
        },
        {
            "text": "Latin also has a major influence on the study of Classics which includes the study of other ancient languages, including Ancient Greek and Biblical Hebrew, as well as classical civilisation and ancient history. This includes learning about the very earliest societies, political systems and philosophies, which provided the foundation for modern civilisation.   "
        },
        {
            "text": "Classics helps people understand how political systems work, to see the roots of complex issues and to make sense of European and world history.  "
        },
        {
            "text": "Classics is a highly regarded field of study by many and has been taught more in independent schools than in state schools. That’s why we plan to launch the new Latin Excellence Programme, bringing Latin teaching to more state schools. "
        },
        {
            "text": "Evidence suggests that children are better able to learn the sounds of new languages when they are younger. Although an ancient language, knowing Latin opens significant opportunities for those who learn it. For example, it helps students with other subjects like English, French, Spanish and even maths.  "
        },
        {
            "heading": 3,
            "text": "And Mandarin? Why are pupils being encouraged to learn it?  "
        },
        {
            "text": "Learning Mandarin has the opportunity to open up a wealth of opportunities to students, and it is the most widely spoken first language in the world.   "
        },
        {
            "text": "Given China's huge strategic importance to the UK and the importance of education in developing that wider relationship, we want to boost the number of schools teaching Chinese and the number of pupils studying it.  "
        },
        {
            "text": "Offering more young people the chance to learn Mandarin will help in our efforts to encourage mobility between the two countries and help ensure the long-term success of our economy and society. This could also support students in their future education as our ambitious Turing Scheme includes China on the list of destinations where students UK students will be funded to take up work and study placements. "
        },
        {
            "text": "Our languages strategy goes wider than Mandarin. We recently launched a consultation on reforming the GCSE in French, German and Spanish to make it more accessible. Our £4.8million pilot led by the National Centre for Excellence in Language Pedagogy (NCELP) at the University of York aims to improve uptake and attainment in languages at key stages 3 and 4, and to share best practice in pedagogy.   "
        },
        {
            "text": "These language programmes form part of our ambition to ensure that 75% of year 10 pupils in state-funded mainstream schools will start to study GCSEs in the EBacc combination of subjects by September 2022, as an important stepping stone to reaching 90% of year 10 pupils studying GCSEs in the EBacc subjects by 2025. "
        }
    ]
}