{
    "url": "https://aphascience.blog.gov.uk/2025/11/03/biosecurity-without-borders-aphas-global-impact/",
    "title": "Biosecurity without borders: APHA’s global impact",
    "authors": [
        "Christopher Finnegan",
        "John McGiven",
        "Heather O'Sullivan",
        "Yvonne Spencer",
        "Jenny Stewart"
    ],
    "categories": [
        "International",
        "One Health"
    ],
    "pub_date": "2025-11-03T10:08:48+00:00",
    "content": [
        {
            "text": "If you are an avid reader of APHA blogs, you will be aware that the Animal and Plant Health Agency co-ordinates the government response to any disease outbreak affecting animals in Great Britain. At the heart of this response is APHA’s dedicated emergency team, always on alert for high-risk animal diseases, called the National Emergency Epidemiology Group (NEEG). The actions of this group are vitally important to ensure livestock, wildlife and pets are protected from any escalating disease situations. Their swift and coordinated actions are crucial to protecting livestock, wildlife, and pets from escalating threats. By implementing robust control measures, enhancing biosecurity, and working to limit the spread of disease, NEEG helps safeguard animal and public health, support related industries, and reduce economic impact."
        },
        {
            "text": "During the week beginning 20 October 2025, colleagues from NEEG, together with colleagues based at the British High Commission, Accra, Ghana, hosted training on: “Disease Control and Outbreak Response: Epidemiological Investigations for High Pathogenic Avian Influenza (HPAI)”. Delegates included veterinarians, public health officials, epidemiologists and other professionals, outlining the importance of One Health collaborative works."
        },
        {
            "text": "This workshop was part of the APHA’s Animal Health Systems Strengthening (AHSS) programme, the aim of which is to reduce poverty and increase resilience to climate change through greater protection of animals from disease. Changes in climate can increase risks to certain diseases and decrease animal resistance to disease. Early identification of outbreaks and effective control reduce animal loss and financial losses to the farmer. They also protect the consumer from high food prices and zoonotic disease. During this visit the NEEG team shared their expert knowledge in disease control with the Ghanaian delegation. This included an emphasis on High Pathogenicity Avian Influenza (HPAI) in particular, as mitigating the risks from this will support the high-profile national policy to increase poultry production and reduce reliance on food imports.  "
        },
        {
            "text": "Discussions were centred around a One Health Approach - Coordination and collaboration with other government departments and stakeholders, including:"
        },
        {
            "text": "The delivery was carried out with a participatory and practical approach, encouraging identification of challenges and potential solutions applicable to the current disease situation and local particularities in Ghana."
        },
        {
            "heading": 2,
            "text": "Looking ahead"
        },
        {
            "text": "The development of a National Biosecurity Centre at APHA Weybridge marks a significant step forward in strengthening the UK’s contribution to global One Health efforts. This state-of-the-art facility will serve as a hub for cutting-edge research, diagnostics, and disease response, enhancing our ability to detect, assess, and contain emerging animal diseases with zoonotic potential. By bringing together experts in a wide range of specialised scientific fields, the centre will foster interdisciplinary collaboration essential to tackling complex biosecurity challenges. "
        },
        {
            "text": "As part of this commitment, the government has announced over £1billion of funding for the specialist facility at APHA Weybridge over the period of the current Spending Review period (to 2029/30)."
        },
        {
            "text": "This investment will protect and enhance our ability to respond to new and zoonotic animal disease threats, safeguard human health, and strengthen pandemic preparedness in support of the One Health agenda. "
        },
        {
            "text": "Importantly, APHA Weybridge will also continue to play a key role in supporting international partnerships, like those seen in Ghana, by sharing expertise, building capacity, and promoting best practices in disease control. Its enhanced capabilities will help ensure that the UK remains at the forefront of global efforts to protect animal and human health, safeguard food systems, and build resilience against future outbreaks. As the threats posed by climate change and globalisation continue to evolve, APHA Weybridge stands ready to lead the way in delivering a robust, coordinated, and science-driven response. "
        }
    ]
}