{
    "url": "https://kingsawards.blog.gov.uk/2024/06/14/gripple-kings-award-for-enterprise-in-innovation/",
    "title": "Gripple – King’s Award for Enterprise in Innovation",
    "authors": [
        "The Queen's Awards for Enterprise"
    ],
    "categories": [
        "Recipients"
    ],
    "pub_date": "2024-06-14T15:56:18+01:00",
    "content": [
        {
            "text": "Gripple is the original innovator and manufacturer of wire joining and tensioning devices, as well as anchoring, bracing and suspension systems that have changed the game for many industries."
        },
        {
            "text": "We operate in 85 countries worldwide, employing more than 900 people globally. 100% employee-owned we have a unique business model promoting a culture of innovation and creativity – where people are inspired to design, manufacture and deliver better solutions."
        },
        {
            "text": "We are committed to sustainability. Having already achieved carbon neutral UK operations, the first of three key milestones in our ‘Journey to Climate Positive’, Gripple is a business pushing boundaries when it comes to the environment."
        },
        {
            "text": "We are completely vertically integrated, ensuring we retain complete control over our supply chain. We even make our own bespoke machinery in-house, ensuring we have minimal reliance on overseas suppliers, allowing us to deliver a consistent and reliable product, wherever in the world it is going."
        },
        {
            "text": "Ed Stubbs, Managing Director at Gripple said: "
        },
        {
            "text": " "
        },
        {
            "text": "“Gripple is all about doing more. That means empowering our people to push boundaries and deliver better solutions for the markets we service."
        },
        {
            "text": "  "
        },
        {
            "text": "“Innovations like Fast Trak, designed by engineers, for engineers, are crucial to driving the industry forward. Solving the challenges facing our customers and delivering efficient and sustainable solutions is what drives us. Success for them means success for us."
        },
        {
            "text": " "
        },
        {
            "text": "“We are delighted to have been recognised for this commitment by his Majesty the King. It is testament to the hard work of each and every one of our employee-owners and our commitment to excellence in design innovation and manufacturing.”"
        },
        {
            "text": "\n"
        },
        {
            "text": "Why did you apply for the Awards?"
        },
        {
            "text": "The King’s Awards for Enterprise is the highest honour for British business – an honour we are always striving for. At Gripple, we have a rich history with the Awards, having been recognised a total of six times over the years, including three for innovation. For us, it is a mark of success, a sign of quality, commitment to customers and progress in our markets and one we proudly display. Globally recognised, it impacts not just our work in the UK, but our brand around the world and is a source of great pride for our employee-owners in all our territories."
        },
        {
            "text": "Why did you choose the Innovation category?"
        },
        {
            "text": "Innovation has been at the heart of Gripple for 35 years. Our vision is to engineer game-changing products and systems that make a difference for more global customers. Gripple is innovation. That’s our promise. The King’s Awards for Enterprise is the pinnacle, and has proven to be a good litmus test for us over the years. The criteria: “pioneering new ideas and products that push boundaries”, is what we strive for and this award recognises an unwavering commitment to doing just that."
        },
        {
            "text": "How did you find the application process?"
        },
        {
            "text": "The application process is thorough and detailed, but deliberately so. The King’s Awards for Enterprise aren’t just any awards – they recognise the best of the best and as a result, entries need to be well thought-out and comprehensive."
        },
        {
            "text": "That said, it’s also accessible. If you know your business, products and initiatives inside-out, a strong application is very achievable."
        },
        {
            "text": "How do you feel about receiving this prestigious Award?"
        },
        {
            "text": "Being completely employee-owned, this award, more than anything, represents the hard work and commitment of our people all over the world. Every one of us has directly or indirectly contributed to the development of Fast Trak and to get this award is a huge celebration of the success of that model and the hard work and commitment of our employee-owners all over the world."
        },
        {
            "text": "We are immensely proud to receive this award. Our aim is to project quality and innovation in the industries we serve and this award endorses our commitment to being a business entirely invested in innovation. We will proudly fly the King’s flag at our sites across the globe and display the mark on our products as a signal of success – once again proving that Gripple is a supplier at the forefront of change, driving efficiency and sustainability across our industries."
        },
        {
            "text": "What are your top tips for potential applicants?"
        },
        {
            "text": "The number one thing is to be authentic. Business goes beyond sales and marketing. It’s people, products and making a difference to customers lives. Tell that story, whatever it looks like."
        },
        {
            "text": "Since its launch, Fast Trak has been a huge success and has made a real impact in many construction projects at home and overseas. With clear benefits to installers, contractors and specifiers we were able to demonstrate with certainty these impacts and tell a compelling story about how and why the product was developed and the challenges it solves. This is what innovation is all about, and that story clearly resonated with the judges."
        },
        {
            "text": " "
        },
        {
            "text": "Find our more:"
        },
        {
            "text": "www.gripple.com"
        },
        {
            "text": "Facebook: @gripple "
        },
        {
            "text": "LinkedIn: gripple-limited "
        },
        {
            "text": "Twitter: @grippleltd "
        },
        {
            "text": "YouTube: @GrippleTV "
        },
        {
            "text": " "
        }
    ]
}