{
    "url": "https://kingsawards.blog.gov.uk/2024/06/14/ultramed-receive-kings-award-for-innovation/",
    "title": "Ultramed receive King's Award for Innovation!",
    "authors": [
        "The Queen's Awards for Enterprise"
    ],
    "categories": [
        "Recipients"
    ],
    "pub_date": "2024-06-14T16:27:04+01:00",
    "content": [
        {
            "text": "Ultramed is a digital health company specialising in pre-procedure assessments."
        },
        {
            "text": "Dr Paul Upton, Ultramed’s CEO, said “the King’s Award for Enterprise in the Innovation category was a fantastic recognition of the efforts of every person in our small team of 14 people. It has been a real boost and the team are rightly proud of their achievement”."
        },
        {
            "text": "Nat Willcox, Ultramed’s Head of Operations, said “It has been a real honour for Ultramed to be recognised in receiving our first King’s Award for Enterprise for our innovative work in health technology, delivering efficiency and improved patient experience through our products. Having been selected for such a prestigious award has not only provided a valuable platform for us to raise our profile, but also resonates with our commitment to continued innovation within our industry. The award has reinforced a sense of accomplishment and given us the opportunity to celebrate our achievements as a team.”"
        },
        {
            "text": " "
        },
        {
            "text": "Ultramed is now an entirely virtual company allowing us to recruit across the UK and facilitate our employees working from overseas."
        },
        {
            "text": "Unusually for a digital health company the majority of our investment funding came from a Crowd funding raise. Our 500 shareholders invested their hard earned cash recognising the preoperative assessments could be done so much better than face to face with a nurse recording information on paper."
        },
        {
            "text": " "
        },
        {
            "text": "Why did you apply?"
        },
        {
            "text": "The Queen’s Award for Enterprise was recommended to me by a friend whose company had previously received an award. I’d looked into it a couple of years ago but it was clear that at that stage we didn’t meet the criteria. However, as Ultramed had grown it did now meet the criteria and I decided, with the senior management team, to apply. We had previously won awards for innovation so it was a straightforward decision to chose the Innovation category."
        },
        {
            "text": " "
        },
        {
            "text": "How did you find the application process?"
        },
        {
            "text": "The instructions on how to apply are very helpful but it is essential to follow them to the letter. Whilst the application form is long it is relatively easy to complete. A first draft was written by one individual and then the team contributed to the editing to produce the final version that was submitted. It is vital to have the different skills of the senior management team to ensure that each section is completed to the highest possible standard. There are various estimates about how long it takes to complete and these suggest between 40 and 100 hours. At Ultramed we spent approximately 60 hours but completed the application ourselves rather than using external support. Unlike some awards it is free to apply for a King’s Award for Enterprise."
        },
        {
            "text": " "
        },
        {
            "text": "What benefits have you seen so far?"
        },
        {
            "text": "We have been able to use the KAE emblem on our marketing and email sign offs. Both look fantastic and certainly get noticed."
        },
        {
            "text": "The biggest impact is on the team who have received a real boost in confidence of both individual performance and that of Ultramed. Generally the team of 14 employees are relatively young and moving forwards with their careers. Being able to put on ones CV the role you had and how you contributed to winning a KAE will be very powerful for future careers. We have had no employees leave in the last year."
        },
        {
            "text": "We have recently advertised for 3 new employees. We had a staggering number of applications and have appointed 3 very high calibre individuals. It is clear that having a KAE gives confidence about the company making Ultramed an attractive place to work. One of the posts had 1015 applicants!"
        },
        {
            "text": "Ultramed won an Innovate UK Rapid Response grant during the Covid pandemic. Subsequent to receiving the KAE we secured a place on the Innovate UK scale up programme which helps the highest potential businesses realise their ambitions. https://www.innovateukedge.ukri.org/Scale-with-us#"
        },
        {
            "text": "Associated with this programme a further grant has been secured."
        },
        {
            "text": " "
        },
        {
            "text": "What are your top tips?"
        },
        {
            "text": "Start your application early and take your time to develop it, bringing in the various skill sets of your senior management team."
        },
        {
            "text": "I think it helped to put in bullet points into each section initially. This then allowed each bullet point to be reviewed to ensure it was optimally placed in best section. This helped to provide strong answers for every section."
        },
        {
            "text": "Warn your accountants that they will need to be involved with a short turnaround if your application moves to the stage where an External Accountant’s Report is required."
        },
        {
            "text": " "
        },
        {
            "text": "Find out more:"
        },
        {
            "text": "www.ultramed.co"
        },
        {
            "text": " "
        },
        {
            "text": "https://www.linkedin.com/company/9258547"
        },
        {
            "text": "Twitter (now X) Ultramed_LTD"
        },
        {
            "text": " "
        }
    ]
}