{
    "url": "https://traderemedies.blog.gov.uk/2026/01/15/a-day-in-the-life-senior-lawyer-jamie-munk/",
    "title": "A day in the life - Senior Lawyer, Jamie Munk",
    "authors": [
        "TRA Communications"
    ],
    "categories": [
        "Recruitment"
    ],
    "pub_date": "2026-01-15T11:41:10+00:00",
    "content": [
        {
            "text": "We have recently opened applications to join our legal team. We asked our Senior Lawyer, Jamie Munk about his day-to-day work life and what it's like working at the Trade Remedies Authority... "
        },
        {
            "text": "Tell us about yourself Jamie!"
        },
        {
            "text": "I joined the TRA as a senior lawyer about 18 months ago – and currently lead the legal team’s work advising on new trade remedy investigations. "
        },
        {
            "text": "What motivated you to join TRA? "
        },
        {
            "text": "I started my legal career in private practice as a commercial litigator, but prior to joining TRA much of my working life has been spent in Government on international trade matters - so I already had a fair idea of how interesting and important the work of the TRA is. Working in trade law involves a fascinating intersection of commercial, governmental and civil society interests, and between public international and domestic law. And with its mission to defend UK economic interests against unfair international trade practices – the TRA offered an exciting opportunity to bring my experience to bear on live investigations to support the delivery of this important function.  "
        },
        {
            "text": "What’s it been like in terms of work? "
        },
        {
            "text": "The work itself has been challenging, varied and fast-paced – but also highly rewarding. "
        },
        {
            "text": "The team is also called on to advise on litigation matters – including a judicial review on one of our investigations last year. "
        },
        {
            "text": "Can you give an insight into life at the TRA? "
        },
        {
            "text": "The culture of the TRA as an organisation has been a real highlight for me. For a small organisation, the diversity of experiences and backgrounds of colleagues is amazing – both within the legal team and beyond. This means I’m constantly learning from those with backgrounds in economic analysis, accountancy, investigations, public policy and beyond –  "
        },
        {
            "text": "from across the UK and overseas - in a genuinely multidisciplinary team. I’ve also been supported to develop my expertise further through a great training offering, underpinned by a culture of learning – and the ability to connect with our wider stakeholders, such as through the TRA Stakeholder Forum. "
        },
        {
            "text": "This also makes for an inclusive place to work - and joining as a senior lawyer has given me opportunities to feed into this as part of our senior managers group, helping shape the culture and direction of the organisation as a senior leader. "
        },
        {
            "text": "I’ve also really valued the flexibility of working here – both in terms of the balance of working at home and in the office and wider approach to flexible working and leave. "
        },
        {
            "text": "Who would you recommend the role to? "
        },
        {
            "text": "To any experienced lawyer with a commitment to work in public service, a genuine interest in international trade and its relationship to UK economic interests, and an enthusiasm for developing their expertise in a multidisciplinary, delivery-focussed organisation. For anyone interested, I’d really encourage you to sign up for a chat to learn a bit more about the roles being advertised. "
        },
        {
            "text": "What else should an applicant know? "
        },
        {
            "text": "I’ll be available for informal conversations with those interested in applying about the TRA’s Legal team up until 30 January 2026. Please email jamie.munk@traderemedies.gov.uk to arrange one. "
        },
        {
            "heading": 2,
            "text": "To learn more about the role and apply, head to Civil Service Jobs."
        }
    ]
}