{
    "url": "https://mhclgmedia.blog.gov.uk/2026/01/15/housing-sec-hails-recovery-green-shoots-in-latest-housing-supply-figures/",
    "title": "Housing Sec hails recovery 'green shoots' in latest housing supply figures",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Housing"
    ],
    "pub_date": "2026-01-15T14:27:55+00:00",
    "content": [
        {
            "text": "The Housing Secretary has welcomed new housing supply figures published today, showing green shoots of recovery across the housebuilding sector.  "
        },
        {
            "text": "The new data release confirms a rise in the number of new build starts in the year ending September 2025 (117,980) which is a 18% increase compared to the previous year."
        },
        {
            "text": "It also confirms a 3% rise in new build starts between July and September 2025 (29,620) when compared to the same quarter in the previous year."
        },
        {
            "text": "An estimated 309,600 new homes have been delivered since the start of this Parliament (9 July 2024) – meaning the government has now surpassed a fifth of its 1.5 million homes target."
        },
        {
            "text": "These figures show the government’s overhaul of the planning system, alongside other pro-supply measures, begin to take effect and the impact of reforms will continue to feed into higher levels of delivery in the later years of this Parliament. "
        },
        {
            "text": "As part of the next phase of reforms to get Britain building, the Housing Secretary has pledged to ‘go further than ever before’ to make the system clearer, more predictable, and faster to build 1.5 million homes."
        },
        {
            "text": "Housing Secretary Steve Reed said:"
        },
        {
            "text": "“I said I will build 1.5 million homes and I meant it."
        },
        {
            "text": "“Thanks to our changes to planning laws we’re now seeing the green shoots of recovery – with an 18% increase in work starting on new homes compared to the previous year."
        },
        {
            "text": "“We will keep on streamlining the planning system and investing in social housing so we can end the housing crisis we inherited and give everyone the chance to live in the home they dream of.”Managing Director at Muse, Phil Mayall said:"
        },
        {
            "text": "“The latest housing delivery statistics which have been released by the government are an encouraging sign."
        },
        {
            "text": "“At Muse we’ve been hearing the messages sent out by the government loud and clear and have been readying to respond. For the past two years, our teams have been preparing sites across the country so we can move quickly. Today, we have a pipeline of almost 15,000 homes, including affordable, which we are set to deliver across the country."
        },
        {
            "text": "“The rise in the number of starts points to positive progress and reflects the focus that has been placed on supporting housing delivery. There is, however, still further to go to reach the scale of delivery the country needs, with challenges still to be overcome.” "
        },
        {
            "text": "“As these continue to be addressed, we look forward to continuing to play our part in supporting increased housing supply and delivering homes in sustainable, well-connected places.”"
        }
    ]
}