{
    "url": "https://deframedia.blog.gov.uk/2026/01/15/inaccurate-reporting-on-fines-under-simpler-recycling/",
    "title": "Inaccurate reporting on fines under Simpler Recycling",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "waste"
    ],
    "pub_date": "2026-01-15T14:21:49+00:00",
    "content": [
        {
            "text": "Recent media reporting in the Daily Mail, Sun and the Mirror has claimed that households could face £400 fines for recycling 37 “prohibited” items under the government’s Simpler Recycling reforms, which come into effect from 31 March. "
        },
        {
            "text": "These claims are completely false. Our Simpler Recycling scheme ensures households across England can recycle the same core materials, ending the postcode lottery of collections. It does not introduce new £400 fines for incorrectly recycling items, nor does it ban households from disposing of everyday items. "
        },
        {
            "text": "The items described in media reports as “prohibited” can still be disposed of and they are not banned. They are simply listed in government guidance for local authorities as not in scope for specific recycling streams under Simpler Recycling. "
        },
        {
            "text": "Most of the items referenced can still be placed in the residual (general waste) bin, while some items, such as batteries and electricals, must be taken to appropriate collection points. Local authorities are responsible for providing clear, local information to households about what can and cannot be recycled in each waste stream, to reduce confusion."
        },
        {
            "text": "Any penalty for incorrect presentation of household waste in England is a civil penalty, not a criminal fine. A Fixed Penalty Notice - valued between £60 and £80 - can only be issued after a written warning and where incorrect presentation is causing a nuisance."
        },
        {
            "text": "A Defra spokesperson said:"
        }
    ]
}