{
    "url": "https://taxagents.blog.gov.uk/2022/03/02/bulk-appeal-for-late-filing-penalties-coronavirus/",
    "title": "Bulk appeal for Late Filing Penalties – Coronavirus",
    "authors": [
        "geoffgreensmith"
    ],
    "categories": [
        "News and Updates"
    ],
    "pub_date": "2022-03-02T16:11:21+00:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "Due to the impact of coronavirus on individuals and businesses around the country, HMRC has not issued a Late Filing Penalty for anyone who has been unable to file their 2020-21 Self Assessment (SA) return by 31 January 2022 providing they did so by 28 February 2022."
        },
        {
            "text": "HMRC recognise that due to the ongoing pandemic some customers and agents will still have difficulty meeting their filing obligations and have advised that coronavirus may be accepted as a reasonable excuse for any appeals made against a 2020-21 Late Filing Penalty for Self Assessment customers."
        },
        {
            "text": "To make things easier for agents representing these individuals and businesses, we are introducing a route for Agents to submit a bulk appeal for Late Filing Penalties, on behalf of their clients where coronavirus is being claimed as a reasonable excuse for late filing of the 2020-21 SA return. This facility is not available for 2020-21 SA Late Payment Penalties, nor any other penalties."
        },
        {
            "text": "The bulk appeals facility will be available for appeals made between 9 March and 6 May 2022."
        },
        {
            "text": "These appeals must be recorded using the template on GOV.UK and sent to the following address: Bulk Agent Appeals, HM Revenue and Customs, BX9 1ZH."
        },
        {
            "text": "The template must only be used for 25 or less clients. If you need to submit an appeal on behalf of more than 25 clients, you should complete a second template."
        },
        {
            "text": "Each envelope you return using the above address should contain no more than one template of 25 or fewer clients. If you complete multiple templates, these should be sent in separate envelopes (max 1 template per envelope)."
        },
        {
            "text": "All fields on the template should be completed – without this, we won’t process the appeal for that client."
        },
        {
            "text": "This template must only be used where the return was not filed by 28 February 2022 due to coronavirus. If the penalty is subject to appeal on other grounds, please use existing channels (see below)."
        },
        {
            "text": "Appeals can still be completed via the current method; this new route is for Bulk Appeals only. Appeals on behalf of one client should be filed using either the SA370 or filed online."
        },
        {
            "text": "Please note that any appeals for a High Net Worth Unit case should be submitted via the normal route and should not be included on the attached template."
        },
        {
            "text": "This service is only for a coronavirus related Reasonable Excuse. HMRC reserve the right to carry out random checks to ensure the validity of the data or to seek further clarification as to the exact nature of the coronavirus related Reasonable Excuse."
        },
        {
            "text": "This service will be available for appeals made on or before 6 May 2022."
        }
    ]
}