{
    "url": "https://despatch.blog.gov.uk/2022/03/02/dvsas-youngest-driving-examiner-breaks-the-mould-in-her-new-role/",
    "title": "DVSA’s youngest driving examiner breaks the mould in her new role",
    "authors": [
        "Emily Butler"
    ],
    "categories": [
        "Driving test",
        "Learning to drive"
    ],
    "pub_date": "2022-03-02T14:10:25+00:00",
    "content": [
        {
            "text": "Emily Butler became DVSA’s youngest car driving examiner aged 23 when she started her role in Hartlepool last year."
        },
        {
            "text": "We are recruiting an extra 161 examiners across Great Britain and the deadline for applications is 21 March 2022. Find out more and apply for one of the posts."
        },
        {
            "text": "Emily shares her experience of why she became an examiner, what the training was like and how she’s getting to grips with her new role."
        },
        {
            "heading": 2,
            "text": "Why did you apply to become a driving examiner?"
        },
        {
            "text": "I was in the final stages of becoming a police officer recruit in late 2020 and the process was put on hold for many months due to coronavirus."
        },
        {
            "text": "During this time, I came across the DVSA driving examiner recruitment campaign."
        },
        {
            "text": "My mum is a driving examiner and is proud to work for DVSA, so I started to consider applying for the role."
        },
        {
            "text": "Her job has always intrigued me, and she instilled the importance of road safety in my sister and I from a young age."
        },
        {
            "text": "I also love being around people and enjoy variety, so the position felt like a good fit for me."
        },
        {
            "heading": 2,
            "text": "What feedback did you get back from your friends?"
        },
        {
            "text": "Many of my friends were in disbelief!"
        },
        {
            "text": "One friend thought you had to be retired to be a driving examiner and another believed you had to be a driving instructor to do the job."
        },
        {
            "text": "These are just myths, and my successful recruitment just goes to show they’re not true."
        },
        {
            "heading": 2,
            "text": "What was your training and assessment like?"
        },
        {
            "text": "The assessment fortnight flowed naturally and was what I enjoyed the most. I made really good friends with 2 other applicants who are now based at a neighbouring driving test centre. We’re catching up as often as we can!"
        },
        {
            "text": "The local training was really convenient for me and our trainers made the experience very enjoyable, even during the most challenging days. Each trainer adapted their style to suit our needs and no question was off limits."
        },
        {
            "heading": 2,
            "text": "What has your team and support been like?"
        },
        {
            "text": "My colleagues have been amazing. My driving test centre manager made sure my induction ran smoothly and kept in touch throughout my training."
        },
        {
            "text": "One of my colleagues is a former driving examiner trainer and I’m learning so much from his years of experience and customer service skills."
        },
        {
            "text": "The support that is available for examiners is fantastic – from staff network groups to mental health first aiders. I’m really impressed with what I’ve seen on offer."
        },
        {
            "heading": 2,
            "text": "What do you most enjoy about the role?"
        },
        {
            "text": "Above all, I find my role very rewarding as I’m playing a crucial role in road safety by making sure new drivers have the right skills and knowledge to drive on Britain’s roads safely."
        },
        {
            "text": "I also like that I’m helping to bring down driving test waiting times that have been greatly affected by the pandemic. Recruiting more driving examiners like me means there are more tests available for our customers."
        },
        {
            "text": "This role has given me the challenge of a fast-paced environment and the chance to meet a wide range of people."
        },
        {
            "heading": 2,
            "text": "What would you say to others considering applying for the role?"
        },
        {
            "text": "Just give it a go."
        },
        {
            "text": "Going into training without being a driving instructor background was daunting, but it’s not essential. However, great customer service skills and a passion for road safety are vital for the role."
        },
        {
            "text": "I also hope that I prove you can take on this role from the age of 23 just like me!"
        }
    ]
}