{
    "url": "https://educationhub.blog.gov.uk/2022/03/02/how-students-can-benefit-from-student-space/",
    "title": "How students can benefit from Student Space",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Mental Health",
        "Universities"
    ],
    "pub_date": "2022-03-02T16:34:30+00:00",
    "content": [
        {
            "text": "In February 2022 University Mental Health Day co-founders, Student Minds announced that their mental health platform ‘Student Space’ would be receiving further government funding via the Office for Students (OfS) to run until the end of the academic year."
        },
        {
            "text": "Take a look at what this funding means and how higher education students can benefit from this."
        },
        {
            "heading": 3,
            "text": "What is Student Space and who is eligible to use the platform?"
        },
        {
            "text": "Launched in August 2020, Student Space is an online mental health platform available to all higher education students across England and Wales."
        },
        {
            "text": "The platform was developed to help students navigate through the challenges of the pandemic. Led by student mental health charity Student Minds, the platform was developed collaboratively with services, higher education professionals, researchers and students to complement the existing mental health and wellbeing services available to students."
        },
        {
            "heading": 3,
            "text": "How long will the platform run for?"
        },
        {
            "text": "Thanks to extra funding, the platform will now run until the end of the academic year in July 2022, meaning even more students can benefit from the fantastic resources the platform has to offer."
        },
        {
            "heading": 3,
            "text": "What kind of services are available on Student Space?"
        },
        {
            "text": "Student Space offers higher education students a range of mental health and wellbeing services, including tailored psychoeducational resources, specialist services, and signposting to one-to-one support and to university support services. Student Space is safe, confidential and free."
        },
        {
            "heading": 3,
            "text": "How is Student Space funded?"
        },
        {
            "text": "Student Space is funded by the OfS – an independent body that we sponsor to regulate the higher education sector – and the Higher Education Funding Council for Wales."
        },
        {
            "heading": 3,
            "text": "Are there any case studies available to access from students who have used the platform?"
        },
        {
            "text": "Yes! Jess, a third-year student at University of Exeter shared her experience of using the platform with us and how it has helped her cope with her obsessive compulsive disorder (OCD):"
        },
        {
            "text": "Thursday 3 March is University Mental Health Day."
        }
    ]
}