{
    "url": "https://designnotes.blog.gov.uk/2022/03/02/how-gdss-design-recruitment-process-works/",
    "title": "How GDS’s design recruitment process works",
    "authors": [
        "Kate Ivey-Williams – Head of Design, GDS",
        "Tim Paul",
        "Antonia Awoyemi – Senior interaction designer, GDS"
    ],
    "categories": [
        "Community",
        "Design"
    ],
    "pub_date": "2022-03-02T01:00:01+00:00",
    "content": [
        {
            "text": "The GDS and Cabinet Office design teams have grown a lot over the last few years. Because of this we’ve been iterating and improving our recruitment process. "
        },
        {
            "text": "This blog post sheds some light on how we currently recruit designers to GDS. The work is part of a broader effort to make our design community more equitable. "
        },
        {
            "text": "Getting our recruitment process right is vital. We want to make sure we see the best of every candidate without wasting anyone’s time or excluding anyone who could be perfect for the role."
        },
        {
            "heading": 2,
            "text": "Recruiting in the Civil Service"
        },
        {
            "text": "The Civil Service has a particular method for recruiting people, based on something called Success Profiles. "
        },
        {
            "text": "The Success Profiles are a general framework for hiring people based on their experience, abilities, strengths, technical knowledge and behaviours. They help us recruit more consistently and fairly."
        },
        {
            "text": "In addition to the Success Profiles, we also use our own framework for design roles, based on the Digital, Data and Technology (DDaT) Capability Framework for user-centred design, to help us determine the skill levels and experience someone has."
        },
        {
            "text": "Both these frameworks inform the criteria we use to evaluate applications, interviews, and tasks to be sure that we’re getting a rounded impression of candidates."
        },
        {
            "heading": 2,
            "text": "The recruitment process"
        },
        {
            "text": "For each recruitment campaign, a panel of 3 or 4 people is formed to review applications, participate in interviews and score each candidate. At most, there will be one non-designer on the panel."
        },
        {
            "text": "We aim to reflect the society we serve, so we make sure our interview panels are gender-inclusive as well as minority race and ethnicity inclusive."
        },
        {
            "text": "The recruitment process looks broadly like this:"
        },
        {
            "heading": 2,
            "text": "The job description"
        },
        {
            "text": "All our roles are advertised on the GDS Careers website. We’ve made our job descriptions more inclusive by removing industry jargon and requirements for degrees or coding experience."
        },
        {
            "heading": 2,
            "text": "Applying for a role"
        },
        {
            "text": "When people apply, they send us a cover letter and a CV, which should include a link to a portfolio of their previous work. Remember to include login details if necessary. "
        },
        {
            "text": "Portfolios help us see the range of projects candidates have worked on, the different approaches they use to solve problems, the quality of their design work, and how they talk about and reflect on their practice. "
        },
        {
            "text": "A portfolio can be a set of slides, a website or anything else that clearly summarises the work. Sometimes candidates can’t share work because of confidentiality reasons – we ask these people to describe what they have done generally without identifying details."
        },
        {
            "text": "Alongside their portfolio and CV, candidates also need to provide a cover letter. A cover letter is typically no more than 2 pages long and should help us understand why the applicant is interested in the role and how they think their skills and experience align with the job description. In addition, the cover letter should address the points in the ‘who you are’ section of the job description so the panel can assess the applicant against the desired skills. "
        },
        {
            "text": "We don’t currently anonymise applications for design roles in GDS. This is because portfolios are an essential part of the recruitment process and many people don’t have anonymised versions."
        },
        {
            "heading": 2,
            "text": "Sifting applications"
        },
        {
            "text": "Once the deadline for applications has passed, the panel reviews each candidate’s CV, cover letter and portfolio against the criteria listed in the ‘Who you are’ section of the job description – this is known as ‘sifting’."
        },
        {
            "text": "The criteria help us make sure we only proceed with applicants who can potentially meet the skills and experience levels needed for the role – so applicants are advised to make sure that their application covers each of them."
        },
        {
            "text": "Panellists sift applications individually, then compare their scores with each other. Where panellists have given different scores for the same criteria, we discuss the reasons and agree on a single score."
        },
        {
            "text": "The highest scoring applications are invited to interview – that’s typically 5 to 7 people per role. This means that if we get many applications, some good ones might not go through to the interview stage."
        },
        {
            "heading": 2,
            "text": "The interview"
        },
        {
            "text": "Interviews are remote and last 1.5 hours. A typical interview agenda is:"
        },
        {
            "text": "At the interview, everyone gets the same questions based on the criteria in the ‘What you’ll do’ section in the job description."
        },
        {
            "text": "The first question asks candidates to respond in detail to a typical work scenario. Because this question requires some additional thought, we give candidates 20 minutes or so to prepare their response. Sometimes, we provide them with the task the day before the interview – with all candidates getting the same amount of notice to complete the task. We’re looking for a discussion of how they would approach the scenario."
        },
        {
            "text": "The remaining questions are shorter and best answered by giving examples of situations that demonstrate that the candidate has the relevant skills, experience and behaviours named in the ‘who you are’ section of the job description. "
        },
        {
            "text": "We’ll also ask the applicant to talk through one or two examples from their portfolio. We’re as interested in their approach and methods as we are in the finished designs."
        },
        {
            "text": "During the interviews, panel members individually score the candidates. The panel will then get together, combine scores, discuss candidates in more detail, and decide who to make offers to."
        },
        {
            "text": "Finally, we write feedback for candidates who didn’t make it through this step. The feedback is usually a couple of paragraphs long and summarises the panel’s assessment against the scoring criteria, including areas of improvement where the candidate didn’t show enough evidence. It will help them prepare for future applications."
        },
        {
            "heading": 2,
            "text": "Making offers"
        },
        {
            "text": "Offers are then made to successful candidates. The salary that each candidate is offered will be the band minimum of the salary advertised. In addition to that, we assess the skills and experience demonstrated during the interview against the DDaT Capability Framework for design roles. The framework describes the skills and experience required for designers in government."
        },
        {
            "text": "The candidate will then be offered an additional non-pensionable allowance on top of their base salary according to the allowance that matches their capability level. Capability levels are reviewed yearly, and only those who have passed probation after 6 months are eligible for review."
        },
        {
            "text": "It can be that there are more successful candidates than there are roles. Therefore, the highest scoring applicants will receive their offer first. Other candidates will be added to a reserve list. They might be contacted in the following weeks when another role opens and don’t have to go through the interview process again. "
        },
        {
            "heading": 3,
            "text": "Security clearance"
        },
        {
            "text": "To work in the Civil Service, people need a security clearance. There are different clearance levels, and it can take 2 to 8 weeks to get through the process. "
        },
        {
            "heading": 2,
            "text": "Onboarding"
        },
        {
            "text": "The experience of joining a new organisation can significantly impact overall feelings about the job. So we’ve put some effort into understanding how to meet the needs of new starters."
        },
        {
            "text": "We know that it can take a while between offers and someone actually starting at GDS because of notice periods and the time it takes to get a security clearance, and this can be both an exciting and uncertain time."
        },
        {
            "text": "Because of this, we keep in touch with new starters during this period, sending them onboarding emails before and after they start to slowly introduce them to the way we work at GDS and things they need to know about."
        },
        {
            "text": "By the time a designer joins, they will already have been assigned a line manager and coach, and they have (hopefully) received their laptop and any software they need."
        },
        {
            "text": "Once a designer has joined, we’ll create opportunities for them to meet other designers and colleagues from around GDS, shadow other teams, and get any training they need."
        },
        {
            "heading": 2,
            "text": "Progressing the career"
        },
        {
            "text": "After a person joined GDS, there are plenty of opportunities to gain new skills and experience, apply for promotions, move into other disciplines and otherwise progress their career."
        },
        {
            "text": "Once a year, they can apply for an additional allowance to their salary to recognise any additional skills they have gained."
        },
        {
            "text": "To get promoted to a new role or grade (like senior to lead), they’ll need to apply for the job, possibly alongside other internal or external candidates. "
        },
        {
            "text": "This approach is open and fair, but the person has to wait for an available role. The good news is that there are other ways to get the necessary experience without applying for and getting the job first."
        },
        {
            "text": "For example, temporary promotions can be arranged without a full recruitment process – these allow team members to gain the experience of a higher grade for a period of time."
        },
        {
            "text": "Designers can also explore different design roles - for example, a service designer may wish to work temporarily as an interaction designer to gain experience in prototyping."
        },
        {
            "text": "Temporary moves or promotions typically last 6 to 12 months, after which the permanent job may be advertised. By then, the designer will have gained valuable skills and experience that they can then use to increase their chances of getting the role if they want."
        },
        {
            "heading": 2,
            "text": "Iterate and then iterate again "
        },
        {
            "text": "We are always trying to improve our hiring and onboarding processes to be equitable and fair, and to give applicants the best possible experience. When people join we want them to feel part of an inclusive team culture and an organisation that’s invested in their development. "
        },
        {
            "text": "We believe diverse teams are stronger teams and deliver better services. We want our workplace to be the best it can be – for the people who work here and the people we design for. "
        },
        {
            "text": "This process may change in the future as we improve it and respond to future needs and requirements. "
        }
    ]
}