{
    "url": "https://mojdigital.blog.gov.uk/2022/03/02/i-was-always-a-computer-nerd-in-conversation-with-gina-gill/",
    "title": "I was always a computer nerd! In conversation with Gina Gill",
    "authors": [
        "Gina Gill"
    ],
    "categories": [
        "gender equality",
        "Women in Tech"
    ],
    "pub_date": "2022-03-02T12:46:05+01:00",
    "content": [
        {
            "text": "Gina Gill, MoJ’s Chief Digital & Information Officer was recently featured in the internal Gender Equality Newsletter. Gina talks about her journey as a woman in tech, biases she has faced along the way, and lessons for women joining the workplace today."
        },
        {
            "text": "We started by asking Gina how she got into computing in the first place, which was not a conventional hobby for a girl growing up in an Indian family in Glasgow."
        },
        {
            "text": "My brother and I are about the same age, so we used to get joint Christmas presents. We didn’t have many traditionally “girly” toys; we had things like a Scalextric and a spectrum computer. So having a brother of the same age was what helped me get into computing. But I was always a computer nerd at heart really. In some ways, that was probably helped by growing up in a traditional family because my parents were really strict about things like going out and going to parties so I was a bookworm and loved reading science fiction. At school, we had BBC micro computers and my brain really enjoyed the challenge of computing. I enjoyed computer studies despite the fact that the teacher used to call me Jenna!   "
        },
        {
            "text": "Gina went on to study at Edinburgh University, where she was one of only five women on her course. We asked her how being in a minority of women at university shaped her approach to working life."
        },
        {
            "text": "When I was in the computing lab at Edinburgh people used to assume that I was ditsy and not very good. I remember getting the top mark on a test on algorithms and data structures, and all these boys looking incredulous as if they thought, ‘she can’t have done!’. I had just studied really hard!"
        },
        {
            "text": "Halfway through my degree at Edinburgh, I thought I didn’t want to do it anymore. I was frustrated with the fact that Edinburgh taught a computing language that wasn’t widely used because they thought it helped us to learn how other languages worked. It was frustrating, but I persisted with it – mainly because I was already halfway through - and I’m glad I did."
        },
        {
            "text": "When I left Edinburgh, I moved to London and started work as a developer based in an office above Angel tube station. The office was deathly quiet - no one talked. I was one of three women out of 300 staff and people used to look at me or avert their eyes in the corridor. My experience wasn’t helped by the fact that my manager was awful and had me in the bucket of ‘you’re a girl so you mustn’t be very good’. Then, one day, a friend told me that these men I worked with were probably intimidated by me. That had never occurred to me and changed the way I thought about it.  "
        },
        {
            "text": "Those experiences made me more determined to be myself at work. It made me embrace differences, in myself and other people. I don’t think I would have done that if people hadn’t viewed me as different in the first place. Working as a developer also helped me learn that, while I loved computers, I didn’t want to sit at a computer doing programming all day - I wanted to talk to people about tech."
        },
        {
            "text": "I went on to work in lots of different roles and industries, all with a tech element. I worked in banking, recruitment, and consultancy. I always brought a different perspective to my work, and all those experiences helped me get to where I am today."
        },
        {
            "text": "We asked Gina if she had ever encountered any biases of her own, and what she had learned."
        },
        {
            "text": "Over the course of my career, I’ve seen big changes in the way people talk about differences. There is much more willingness to talk and openness to difference that wasn’t there when I started out as a developer. I think that has been a really positive shift."
        },
        {
            "text": "I remember in a previous role a member of the team went through a gender transition. We all received an email about this and I didn’t know what to make of it; it wasn’t something I knew anything about. Looking back, I think I could have handled it differently and engaged with them more. Perhaps they shared because they wanted to feel accepted, and I didn’t do anything proactive to help them feel accepted.  I would handle that differently now.   "
        },
        {
            "text": "Finally, we talked about changes in the workplace since Gina started out and asked what advice she would give to women starting their working life today."
        },
        {
            "text": "The biggest change I have seen over the course of my career is simply that there are women working in tech now! I’ve gone from working in a place where there were almost no women, to a place where we are close to parity. I had only worked for men for most of my career, to the extent that the first time I worked for a woman it felt weird and I had to adapt the way I engaged. Things are very different now."
        },
        {
            "text": "It is only a few years since the MoJ recruited its first female developer and now the digital and technology function is 39% women. That puts us ahead of the marketplace, but we still need to get more women into tech roles - especially technical architecture and development. We have got to think now about how we encourage women into those types of roles; encourage them to get excited about them and develop in them. That is not something where we can continue to kick the can down the line."
        },
        {
            "text": "It’s a really exciting space to be in. There are a huge range of roles in digital, and something to suit every skill set. It’s a different world to when I started out and much easier to be yourself."
        },
        {
            "text": "My advice to women starting out in the workplace is to reach out and build a network. It took me a long time to do that. When I was working at a large bank, I met a group of women who I’m still good friends with today. So I would say: find your network, find the people that you can lean on and bounce ideas off, and that will help you throughout your career."
        }
    ]
}