{
    "url": "https://educationinspection.blog.gov.uk/2022/03/02/new-inspection-framework-lead-providers-ecf-npqs/",
    "title": "New inspection framework for lead providers of the early career framework and national professional qualifications",
    "authors": [
        "Christopher Russell"
    ],
    "categories": [
        "inspection",
        "professional development",
        "teacher training",
        "teachers"
    ],
    "pub_date": "2022-03-02T09:30:25+00:00",
    "content": [
        {
            "text": "Chris Russell, our National Director for Education, discusses this new area of our work."
        },
        {
            "text": "Today, we have published our new framework and handbook for inspecting lead providers of the early career framework (ECF) and the reformed suite of national professional qualifications (NPQs)."
        },
        {
            "text": "These flagship professional development programmes complete the ‘golden thread’ of professional development for teachers that starts with effective initial teacher education (ITE). Alongside our ITE inspection framework that we published last year, the ECF and NPQ inspection process will provide assurance and insight nationally into the development of high-quality teachers and leaders at all stages of their careers."
        },
        {
            "heading": 2,
            "text": "A highly skilled workforce"
        },
        {
            "text": "Teachers typically enter the profession with energy, motivated by a strong sense of purpose and the chance to change lives. Harnessing that motivation, providing opportunities to deepen expertise and keeping teachers excited about teaching are essential to making it an attractive, rewarding career. As we all know, schools are only as good as the teachers who work in them."
        },
        {
            "text": "Following the pandemic, it is more important than ever that the teaching profession can recruit, train and retain the highly skilled workforce it needs to give pupils the very best experience in education."
        },
        {
            "text": "This must begin with the right foundations. We need to ensure that recently qualified teachers in the critical first years of their career get the right support. The ECF introduces a funded entitlement to a structured 2-year package of professional development for early career teachers (ECTs). This has the potential to transform the early support that teachers receive, bringing it into line with that enjoyed by other top professionals."
        },
        {
            "text": "Professional development remains vital as teachers move through their careers, whether their ambition is to progress into a leadership role or to stay and excel in the classroom. The reformed suite of NPQs has 3 courses in specialist areas and 3 leadership courses. It builds on the foundation the ECF provides, with clear career pathways and access to further professional development."
        },
        {
            "heading": 2,
            "text": "Our plans for inspections"
        },
        {
            "text": "The launch of these 2 new programmes marks a significant investment by the government in improving training and professional development for teachers."
        },
        {
            "text": "Our inspections of lead providers will check whether the programmes are delivering a high quality of training and whether teachers and school leaders are getting the best possible support. We will look at the quality of professional development and training and the effectiveness of leadership and management, so that we’re focusing on the things that matter most to ECTs and NPQ participants."
        },
        {
            "text": "Inspections will begin in summer 2022 with monitoring visits to check that early implementation of the programmes is on track. Inspectors will make a judgement about whether leaders are taking effective action to establish the new courses."
        },
        {
            "text": "From spring 2023, we will carry out full inspections of each lead provider, a minimum of once every 2 academic years."
        },
        {
            "text": "Throughout this term, we will be holding webinars for lead providers, delivery partners, and ECTs and NPQ participants to share more information about the framework and answer questions about what to expect on inspection."
        }
    ]
}