{
    "url": "https://defrafarming.blog.gov.uk/2022/03/02/understanding-and-improving-farming-regulation/",
    "title": "Understanding and improving farming regulation",
    "authors": [
        "Lauren Bradley"
    ],
    "categories": [
        "Things we're doing",
        "Things we've learned"
    ],
    "pub_date": "2022-03-02T13:13:01+00:00",
    "content": [
        {
            "text": "Some farming and land management activities are regulated to safeguard our environment and to protect the health of animals, plants and people. "
        },
        {
            "text": "We do this through around 150 pieces of legislation, comprising primary legislation (such as the Agriculture Act 2020) and secondary legislation (such as the Cattle Identification Regulations 2007).  "
        },
        {
            "text": "All of this legislation applies to agricultural activity, and collectively constitutes what is known as the ‘regulatory baseline for agriculture’.  "
        },
        {
            "text": "This is a complex legislative picture and is not easy to navigate – we intend to improve and evolve this baseline in future as part of our agricultural transition outside of the European Union (EU). "
        },
        {
            "text": "There are around 119 pieces of legislation in the baseline which apply to the keeping of farmed animals, of which a substantial proportion covers disease prevention."
        },
        {
            "text": " The diagram below shows the breakdown:"
        },
        {
            "heading": 2,
            "text": "The regulatory baseline and cross compliance "
        },
        {
            "text": "At the moment, farmers who receive Common Agricultural Payment (through Basic Payment Scheme or agri-environment schemes) must meet minimum standards to receive those payments. These standards are collectively known as cross compliance. "
        },
        {
            "text": "When payments are delinked in 2024, we will stop using cross compliance as the main way to inspect farms, however the rules that form our regulatory baseline will continue to apply.  "
        },
        {
            "text": "Most of the EU cross compliance rules and standards are already part of UK domestic law (the regulatory baseline) and will continue to apply to farmers after delinking in 2024, so farmers will continue to be required to comply with the rules.   "
        },
        {
            "text": "While the majority of EU cross compliance rules are replicated in our regulatory baseline, we are aware of some gaps in protections. Where there are gaps, we are taking an evidence led approach to decide on the most effective ways to achieve our environmental goals. "
        },
        {
            "text": "Over the next few months, we will continue to work closely with stakeholders to understand the impact of gaps and decide on next steps. We will consult ahead of any regulatory changes that are implemented. "
        },
        {
            "heading": 2,
            "text": "The future regulatory baseline "
        },
        {
            "text": "We recognise that the current regulatory baseline, spread across 150 pieces of legislation, isn’t easy to understand and navigate.   "
        },
        {
            "text": "As we make improvements to the regulatory baseline, we will: "
        },
        {
            "heading": 2,
            "text": "Next steps "
        },
        {
            "text": "We will continue to work with farmers, land managers and stakeholders, so that you can tell us what needs to change in the regulatory baseline and why. Thank you to all those involved to date for your active engagement and support.  "
        },
        {
            "text": "We’ll also continue post regular updates on our work to ensure farmers and land managers understand their regulatory responsibilities after cross compliance ends. Look out for our next update and don’t forget to subscribe to the Future Farming Blog.  "
        }
    ]
}