{
    "url": "https://deframedia.blog.gov.uk/2024/09/02/government-announces-tb-eradication-strategy-to-end-the-badger-cull/",
    "title": "Government announces TB Eradication Strategy refresh to end the badger cull",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Protect",
        "Wildlife"
    ],
    "pub_date": "2024-09-02T15:00:56+01:00",
    "content": [
        {
            "text": "There has been widespread coverage across trade media outlets of the announcement of the Government’s new Bovine Tuberculosis eradication strategy refresh."
        },
        {
            "text": "Over the past decade, TB has had a devastating impact on threatened British livestock and wildlife. Over 278,000 cattle have been compulsorily slaughtered and over 230,000 badgers have been killed in efforts to control the disease."
        },
        {
            "text": "The measures to be introduced under the strategy include a survey of the badger population for the first time in a decade, a wildlife surveillance programme, the launch of a Badger Vaccinator Field Force and a badger vaccination study to end the cull by the end of this parliament, which currently costs taxpayers more than £100 million every year."
        },
        {
            "text": "The Government has also stated that it aims to bring the badger cull to an end within this Parliament and the strategy will be an important part of the effort to eliminate bovine TB by 2038."
        },
        {
            "text": "This announcement ensures the government meets its manifesto commitment and represents a new direction in defeating this disease that will both protect the farming community and preserve wildlife."
        },
        {
            "text": "Publications such as The Times, The Guardian, BBC, I News, ITV News, Sky News, Daily Mail and Farmers Guardian covered the news."
        },
        {
            "text": "Minister for Food Security and Rural Affairs, Daniel Zeichner said:   "
        },
        {
            "text": "Chief Veterinary Officer Christine Middlemiss said:   "
        },
        {
            "text": "John Cross, chair of the bTB Partnership said:   "
        },
        {
            "text": "The government will also publish additional information about animal and herd-level bTB risk – for example, the date and type of the most recent TB test completed in the herd of origin of that animal and how long the animal has been in the herd."
        },
        {
            "text": "This greater level of detail will be made available on ibTB – a free to access interactive map set up to help cattle farmers and their vets understand the level of bovine TB in their area and manage the risks when purchasing cattle."
        },
        {
            "text": "Today’s announcement ensures the government meets its manifesto commitment and represents a new direction in defeating this disease that will both protect the farming community and preserve wildlife."
        }
    ]
}