{
    "url": "https://dfedigital.blog.gov.uk/2024/09/02/making-use-of-the-department-for-education-accessibility-experience-lab-in-sheffield/",
    "title": "Making use of the Department for Education accessibility experience lab in Sheffield ",
    "authors": [
        "Bunsi Shah",
        "Rick Garnett"
    ],
    "categories": [
        "Accessibility",
        "culture",
        "design",
        "User-centred design"
    ],
    "pub_date": "2024-09-02T09:00:07+01:00",
    "content": [
        {
            "text": "“White male, 43 years old” said the AI voice as I had a camera pointed at me. In this case AI hasn’t quite got it right yet. But to give you a clue, let’s just say I was very happy with a 7-year discrepancy."
        },
        {
            "text": "Despite AI’s rather flattering miscalculation, this was the end of a brilliant and informative session visiting the Experience Lab. We organised this as part of the Vulnerable Children & Families portfolio away day at DfE's Sheffield office."
        },
        {
            "text": "The session was packed with some great insight! It showed us what Andy Black, Jane Dickinson and Jonathan Mallender do in the Business Engagement & Accessibility Team."
        },
        {
            "text": "As a multipurpose team, they support colleagues with accessibility needs across the department. They also provide accessibility audits for our websites and digital services. These audits test a wide range of accessibility needs to support everybody."
        },
        {
            "heading": 2,
            "text": "How we used the experience lab for our away day"
        },
        {
            "text": "At the away day, Jonathan walked groups of colleagues through just a handful of tools at the lab's disposal. Each session made us more aware of the importance of the team's work."
        },
        {
            "text": "Software based tools that we tried out and discussed included:"
        },
        {
            "text": "We then tried on different glasses that mimicked visual impairments - these included tunnel vision, macular degeneration and cataracts. The glasses help the team test features that these users might find difficult to see."
        },
        {
            "text": "As well as visual impairments, the team audits our services against other types of users such as:"
        },
        {
            "heading": 2,
            "text": "Reflections"
        },
        {
            "text": "The sessions really brought to life the importance of testing accessibility. Imagine testing your website for a blind user. How would you begin? Would you download a screen reader? Would you examine your code to ensure it has alt tags on images? Or would you just turn off your monitor? Probably not that last one, but that is what it would be like to use your service for a blind user."
        },
        {
            "text": "The importance of accessibility cannot be understated. Accessible content means everyone in society is included and importantly not excluded. The Business Engagement & Accessibility Team's services are invaluable. They make sure everyone can take part."
        },
        {
            "text": "You can contact the Business Engagement & Accessibility Team via accessibility.support@education.gov.uk or read more about the services provide by the team via Digital Accessibility Hub - Home (sharepoint.com)."
        },
        {
            "heading": 2,
            "text": "Testing our service"
        },
        {
            "text": "The early years qualification team went to the empathy lab to test their service in August 2024."
        },
        {
            "text": "To make the most of the day in the lab the team took steps to prepare."
        },
        {
            "heading": 4,
            "text": "1. Read up on the assistive tech before you go."
        },
        {
            "text": "If you are unfamiliar, so you have some understanding of the commands you might need to use."
        },
        {
            "text": "We used:"
        },
        {
            "text": "JAWS - https://support.freedomscientific.com/Content/Documents/Manuals/JAWS/Keystrokes.pdfDragon - https://www.nuance.com/products/help/dragon15/dragon-for-pc/enx/dpg-cp/Content/Web/working_with_chrome.htm"
        },
        {
            "heading": 4,
            "text": "2. Plan what you are going to test on the day."
        },
        {
            "text": "Know which journeys you want to test so can concentrate on the testing and prioritise them in case you don't have time to get through everything"
        },
        {
            "text": "If you can do some manual accessibility testing with tools such as WAVE or axe, this can help you prioritise what you are focusing on in the experience lab."
        },
        {
            "text": "We tested browsers, devices, colour contrast etc., before going."
        },
        {
            "heading": 4,
            "text": "3. Prepare how you will record testing notes."
        },
        {
            "text": "Set something up where you can take notes, so you are not wasting time on the day creating these. Some options could be a spreadsheet, word doc or Lucid board."
        },
        {
            "text": "Record any issues you have if you can so you can show your team what happened"
        },
        {
            "heading": 4,
            "text": "4. Give yourself enough time."
        },
        {
            "text": "Focus on your key journeys, try not to pack too much into the day and remember the first few journeys may take you a bit longer to go through as you get familiar with the tech."
        },
        {
            "heading": 4,
            "text": "5. Divide and conquer."
        },
        {
            "text": "Having one person going through the journey and one taking notes, telling you the next steps really helps"
        },
        {
            "text": "The room is small right now (they are looking to move to a bigger area). If there are more than 4 of you and you want to use more than one device to test, you might want to book another meeting room (there is one directly opposite – SPP 4.01) and split up."
        },
        {
            "text": "\n"
        }
    ]
}