{
    "url": "https://educationhub.blog.gov.uk/2024/09/removal-ofsted-single-word-judgements-schools/",
    "title": "Removal of Ofsted single word judgements: what it means for schools and parents",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Schools"
    ],
    "pub_date": "2024-09-02T09:27:42+01:00",
    "content": [
        {
            "text": "Schools in England will no longer receive Ofsted single headline grades, also known as single word judgements, from today."
        },
        {
            "text": "This is the first step towards delivering a better accountability system which will see School Report Cards introduced from September 2025, which will provide parents with a complete picture of how schools are performing."
        },
        {
            "text": "We explain more below, including on how parents can compare schools in the meantime."
        },
        {
            "heading": 3,
            "text": "Why are we removing single headline grades?"
        },
        {
            "text": "We know that one word judgements aren’t working for parents or schools."
        },
        {
            "text": "Ofsted research found fewer than four in 10 parents, and only 29% of teachers, support one-word judgements."
        },
        {
            "text": "We want parents to have access to a much more complete picture of how schools are performing, well beyond a single word."
        },
        {
            "text": "We also want higher standards in schools, and report cards are an important step towards achieving that because they will hold schools to account across a broader range of measures."
        },
        {
            "text": "That’s why we are removing single headline grades with immediate effect for all state schools moving forward."
        },
        {
            "heading": 3,
            "text": "How will parents know which schools are performing well?"
        },
        {
            "text": "Schools that have an existing grade will keep it until their next inspection."
        },
        {
            "text": "Schools that are then inspected this year will receive a rating in the four existing subcategories: quality of education, behaviour and attitudes, personal development and leadership & management."
        },
        {
            "text": "Ofsted inspection reports already contain these subcategories, so parents will be able to compare schools by looking at how they perform in each of these areas."
        },
        {
            "heading": 3,
            "text": "What happens if your child’s school currently has an ‘inadequate’ or ‘requires improvement’ judgement’?"
        },
        {
            "text": "We will continue to intervene in poorly performing schools to ensure high school standards for children."
        },
        {
            "text": "Schools that are classed as 'inadequate' will remain subject to structural change to their leadership and management."
        },
        {
            "text": "For schools that 'require improvement', we are changing and improving how we intervene and we will be introducing new regional improvement teams to offer targeted support, addressing the areas where schools need to improve."
        },
        {
            "text": "In some of these schools there may be plans to change the leadership and management of the school by converting it to an academy or transferring to a different academy trust."
        },
        {
            "text": "Our previous policy was that if a school had two ‘requires improvement’ judgements we may change the management."
        },
        {
            "text": "If plans to do this were due to happen this term, they will go ahead, but in the future for schools in this category, we think it's better and less disruptive to offer support to improve from another high performing school to drive improvement."
        },
        {
            "heading": 3,
            "text": "What will School Report Cards look like?"
        },
        {
            "text": "Report cards will provide parents with a more complete picture of how schools are performing. The content of the report cards will be developed over the coming months."
        },
        {
            "text": "We will work with Ofsted, parents and the education sector to ensure the new report card is as clear and transparent as possible."
        },
        {
            "heading": 3,
            "text": "Are single headline grades being removed for early years and colleges too?"
        },
        {
            "text": "Early years provision in state schools and academies for children aged 2 and above, and Maintained Nursery Schools, will be included in the removal of headline grades for schools."
        },
        {
            "text": "All other Early Years settings will continue to receive headline grades."
        },
        {
            "text": "We are committed to removing headline grades for other settings inspected by Ofsted, including independent schools, early years settings, colleges, children’s social care providers, and initial teacher training."
        },
        {
            "text": "We will be working hard over the next year with students, families and educators across these areas to ensure alternative reporting arrangements provide a clear picture of how education providers are performing."
        },
        {
            "text": "We’re working closely with Ofsted and the sector to make sure it happens smoothly."
        }
    ]
}