{
    "url": "https://moderncivilservice.blog.gov.uk/2024/09/02/upskilling-senior-civil-servants-with-the-digital-excellence-programme/",
    "title": "Upskilling Senior Civil Servants with the Digital Excellence programme",
    "authors": [
        "deepathomas"
    ],
    "categories": [
        "A Modern Civil Service",
        "Capability",
        "Digital and data",
        "Modernisation and Reform",
        "Skilled Civil Service"
    ],
    "pub_date": "2024-09-02T09:25:10+01:00",
    "content": [
        {
            "text": "Guest blog from Olga Winkle, Learning Delivery Manager, Central Digital & Data Office"
        },
        {
            "heading": 2,
            "text": "An online learning programme created specifically to upskill Senior Civil Servants with digital, data and technology skills."
        },
        {
            "text": "The Modern Civil Service agenda set out Digital and Data as one of its priorities. The aim is to be able to harness the power of digital and data to make better decisions, improve service delivery and enhance user experience.  "
        },
        {
            "text": "In its turn the Central Digital and Data Office (CDDO) implements a specific goal of “Over 90% of Senior Civil Servants (SCS) being upskilled on digital and data essentials” as a part of the ‘Digital Skills at scale’ mission. And that is why the  Digital Excellence Programme (DEP) for SCS has been created. "
        },
        {
            "text": "Gemma Jones, who leads on the DEP roll-out across the Civil Service says: “Whilst the strategy’s goal always recognised the importance of upskilling, we have also  collated valuable data on how senior civil servants across all departments feel about their own digital skills as part of this work. So far, nearly 2000 SCS, including some of the most senior leaders across government have completed the survey, which enables leaders to rate their skills against those outlined in the Digital and Data Essentials -  a framework created with the leadership skills needed both now and in the future in mind. The data tells us that only 21% of SCS are confident in those skills, some of whom have already benefited from DEP learning. This shows that a need for the Digital Excellence Programme is real, current and vast. The goal to upskill circa 7000 SCS has always been very ambitious and challenging, but the potential reward of a huge boost to the capability across all departments and professions, and a big step forward to the truly Modern Civil Service, makes it absolutely worthwhile. Whilst we have made  great progress already, with  nearly 2500 DEP licences being purchased by departments across government, there is more to do as not all departments have taken the opportunity to enable leaders to develop by facilitating access to the programme. We continue to engage with departments and ALB’s to ensure they understand the importance of doing so and help them to remove blockers.”"
        },
        {
            "text": "The DEP learning programme was commissioned via the Government Learning Frameworks contract. This means that the learning is pre-approved via this procurement strategy. Through this process, Ernst & Young was successful in gaining the commission to develop the learning and they subcontracted the right expertise via APolitical and London School of Economics who all came together to develop the Digital Excellence Programme. APolitical’s platform was chosen to host the learning due to its provision for social learning and networking for learners. This removes the duplication of effort for departments and means they can be assured that all the relevant checks around governance, data privacy, and finance have been completed. And we also have a well structured and professionally made course that is tailored to meet SCS upskilling needs and based on expertise and user research. It is difficult to believe this, but this cross-government, cross-profession learning is something that did not exist before CDDO started to work on it two years ago."
        },
        {
            "text": "Since the programme was developed, the learning team in the Central Digital and Data office engaged with all Government Departments and ALBs; cross-government functions and SCS professional development schemes in order to roll out the learning. This meant engaging with more than 100 points of contact on a regular basis, constantly taking feedback on board and making improvements to the delivery strategy. "
        },
        {
            "text": "The roll out began with a pilot of the digital and data courses in February 2023, where 400 licences were offered to senior leaders across government. This created the initial momentum for working across all Government departments and professions and allowed further work with partners to iterate the programme, piloting a third course focussing on a user-centred approach, in June 2023. Full rollout commenced in September 2023 and progress is shared  with the Digital and Data Board and the Public Accounts Committee. "
        },
        {
            "text": "“Tomorrow’s government won’t run on yesterday’s technology and the leaders who get us there should be comfortable using data and digital tools to make a difference. With every SCS upskilled we will have an additional benefit of hundreds of people being influenced by their new knowledge. DEP is not just an online course: we are unlocking a new leadership era focused on building a user-centred culture, making data driven decisions and using technological advances to reduce public spending. It is truly difficult to overestimate the impact of this knowledge benefiting the society. The aim of the DEP roll out is to see more than 90% of the SCS being confident in the digital and data domain. This means a huge boost to the capability across all departments and professions and a big step forward to the truly Modern Civil Service”, says Olga Winkle, Learning Delivery manager in CDDO."
        },
        {
            "text": "Please ask your Department’s Learning & Development lead how to enrol or email scs-upskilling@digital.cabinet-office.gov.uk for more information. "
        }
    ]
}