{
    "url": "https://food.blog.gov.uk/2023/07/11/chief-executives-message-to-stakeholders-fsa-publishes-3-year-plan/",
    "title": "Chief Executive’s message to stakeholders - FSA publishes 3-year plan",
    "authors": [
        "Emily Miles, Chief Executive"
    ],
    "categories": [
        "Our mission"
    ],
    "pub_date": "2023-07-11T12:08:49+01:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "Last year the Food Standards Agency (FSA) launched a new strategy which set out a vision and the guiding principles that will enable us to continue to operate effectively in a fast-changing environment. "
        },
        {
            "text": "The strategy recommitted us to our core mission – Food You Can Trust – and set out three key objectives: to ensure food is safe; food is what it says it is; and an explicit new objective - to play our part in transforming the food system to ensure food is healthier and more sustainable."
        },
        {
            "text": "Today we have set out how we will turn the ambitions of our strategy into concrete actions. In a new 3-year corporate plan, which we have just published, our stakeholders can see how we intend to deliver on each part of the strategy and how we will monitor progress."
        },
        {
            "text": "The plan explains how we will continue to deliver our core role, acting as an evidence generator, policy maker and regulator. It also sets out change and transformation objectives: to build new evidence, and create proportionate, risk-based assurance and regulatory services. The plan covers the work we will do to speak out publicly as a watchdog and how we will work in partnership, as a convenor and collaborator, providing the people, resources and processes needed to deliver on our strategy."
        },
        {
            "text": "I am really interested to know your thoughts on particular aspects of this plan:"
        },
        {
            "text": "If you have thoughts on these aspects of our corporate plan, please share them with us at threeyearplan@food.gov.uk."
        },
        {
            "heading": 1,
            "text": "Yr Asiantaeth Safonau Bwyd yn cyhoeddi Cynllun Corfforaethol 3 Blynedd"
        },
        {
            "text": "Y llynedd, lansiodd yr Asiantaeth Safonau Bwyd (ASB) strategaeth newydd a nododd weledigaeth yn ogystal â’r egwyddorion arweiniol a fydd yn ein galluogi ni i barhau i weithredu’n effeithiol mewn amgylchedd sy’n newid yn gyflym."
        },
        {
            "text": "Gwnaeth y strategaeth atgyfnerthu ein hymrwymiad i’n cenhadaeth graidd – Bwyd y gallwch ymddiried ynddo. Nododd hefyd dri amcan allweddol, sef: sicrhau bod bwyd yn ddiogel; sicrhau bod bwyd yn cyd-fynd â’r hyn sydd ar y label; ac amcan newydd penodol, sef sicrhau ein bod ni’n chwarae ein rhan wrth drawsnewid y system fwyd i wneud yn siŵr bod bwyd yn iachach ac yn fwy cynaliadwy."
        },
        {
            "text": "Heddiw, mae’r ASB wedi nodi sut y byddwn ni’n troi uchelgeisiau ein strategaeth yn gamau gweithredu pendant. Rydym newydd gyhoeddi cynllun corfforaethol 3 blynedd newydd, sy’n dangos sut rydym ni’n bwriadu cyflawni pob rhan o’r strategaeth a sut y byddwn ni’n monitro cynnydd."
        },
        {
            "text": "Mae’r cynllun yn egluro sut y byddwn ni’n parhau i gyflawni ein rôl graidd, gan weithredu fel cynhyrchydd tystiolaeth, lluniwr polisi a rheoleiddiwr. Mae hefyd yn nodi amcanion newid a thrawsnewid, er mwyn adeiladu tystiolaeth newydd a chreu gwasanaethau rheoleiddio a sicrwydd cymesur, sy’n seiliedig ar risg. Mae’r cynllun yn cwmpasu’r gwaith y byddwn ni’n ei wneud i godi llais yn gyhoeddus fel corff gwarchod a sut y byddwn ni’n gweithio mewn partneriaeth, fel cynullydd a chydweithredwr, gan ddarparu’r bobl, yr adnoddau a’r prosesau sydd eu hangen i gyflawni ein strategaeth."
        },
        {
            "text": "Byddwn i wrth fy modd yn clywed eich barn ar agweddau penodol ar y cynllun hwn:"
        },
        {
            "text": "Os oes gennych chi unrhyw farn am yr agweddau hyn ar ein cynllun corfforaethol, gofynnwn yn garedig i chi ei rhannu gyda ni yn threeyearplan@food.gov.uk."
        }
    ]
}