{
    "url": "https://defrafarming.blog.gov.uk/2023/07/11/how-we-put-unproductive-farmland-to-use/",
    "title": "How we put unproductive farmland to use",
    "authors": [
        "Graham Higgins"
    ],
    "categories": [
        "A view from the farm"
    ],
    "pub_date": "2023-07-11T12:26:46+01:00",
    "content": [
        {
            "text": "In our latest film, we explore how environmental improvements and farming work together in the Lake District."
        },
        {
            "text": "Filmed in spring last year, local farming facilitator Danny Teasdale took us to Strickley Farm in Cumbria, to meet dairy farmer James Robinson."
        },
        {
            "text": "Danny and James showed us a piece of farmland that has always been unproductive and prone to flooding."
        },
        {
            "text": "In the film, James and Danny explain how they re-meandered the stream through the flooded area to create a natural habitat for wildlife that can also be used for grazing livestock."
        },
        {
            "text": "Danny talks about his role in facilitating the project and James gives a rundown on all the wildlife and flowers that have flourished since the beck and ponds were created."
        },
        {
            "text": "Thanks to James and Danny for taking part."
        },
        {
            "text": "Read the transcript."
        },
        {
            "heading": 2,
            "text": "Learn more about farming payments in England"
        },
        {
            "heading": 3,
            "text": "Landscape Recovery"
        },
        {
            "text": "Landscape Recovery supports landowners and managers to take a large-scale approach to producing environmental and climate goods on their land, alongside the sustainable production of food."
        },
        {
            "text": "The second round focuses on net zero, protected sites, and wildlife-rich habitats."
        },
        {
            "text": "You can apply for Landscape Recovery funding until midday on 21 September 2023."
        },
        {
            "text": "Read the Landscape Recovery guidance and how to apply."
        },
        {
            "heading": 3,
            "text": "The Sustainable Farming Incentive"
        },
        {
            "text": "The Sustainable Farming Incentive (SFI) pays farmers to adopt and maintain sustainable farming practices that can protect and improve the environment."
        },
        {
            "text": "We recently published the SFI handbook and blogged about what to expect from the new, expanded SFI offer in 2023."
        },
        {
            "heading": 3,
            "text": "Countryside Stewardship"
        },
        {
            "text": "You can apply for Countryside Stewardship (CS) to get paid to manage habitats, woodland, flood risk and reduce water pollution."
        },
        {
            "text": "Over the course of this year and next year, we'll evolve CS. You can learn more about our plans in our environmental land management update. It includes the environmental land management actions that will be available."
        },
        {
            "heading": 3,
            "text": "Farming in Protected Landscapes"
        },
        {
            "text": "The Farming in Protected Landscapes programme funds farmers and land managers in Areas of Outstanding Natural Beauty (AONBs), National Parks and the Broads."
        },
        {
            "text": "Funding is available for projects that:"
        },
        {
            "text": "Contact your local protected landscape body for advice on your eligibility."
        },
        {
            "heading": 3,
            "text": "The complete offer"
        },
        {
            "text": "To look at every one-off grant and ongoing payment, visit Funding for Farmers and Land Managers on GOV.UK."
        }
    ]
}