{
    "url": "https://ruralpayments.blog.gov.uk/2023/07/11/introducing-you-to-18/",
    "title": "Introducing You To...",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Introducing You To"
    ],
    "pub_date": "2023-07-11T13:59:36+01:00",
    "content": [
        {
            "text": "Hi, I’m Sue and I’m the Scheme Support Lead for RPA’s Grants Services. I joined RPA in 1989 straight from school. At that time it was the Intervention Board, becoming the Rural Payments Agency in 2001. I’ve had various roles over the years, including Operational Delivery, HR, Programme Management and managing the Chief Executive’s Office. I joined the Grants Service team in 2017 (it was called Rural Development then) and soon realised it was a good move to make! I mainly work out of RPA’s Reading office, but my team are based in Exeter and Worcester so I try and get there as much as I can. "
        },
        {
            "text": "The Grants Service team consists of about 150 people, working across 15 sites located from Truro to Workington, and Alnwick to Weybridge, and my team provide support to everyone by keeping us compliant, supporting audits of our work, maintaining our IT platform, providing a wide range of statistical and performance information, and managing communications across the teams."
        },
        {
            "text": "I love the variety of my role as no two days are ever the same. I really enjoy being able to see the outcome of the projects we fund, as this is really rewarding, especially when we get to go out and visit them. I have a particular interest in English wine and the vineyards we’ve supported! I also enjoy working with the other areas of the business, as this means my previous knowledge of RPA and the contacts I’ve made over the years are not being wasted."
        },
        {
            "text": "The Grants Service team actively support applicants throughout the life of their project, which can be up to five years. Many of the team have experience or knowledge of the farming and agricultural industry, and some even farm themselves. This means that we’re aware of the outside factors that affect the delivery of projects, so we can empathise with our customers and help them find solutions to any problems. We work hard to give our customers the best service we can, which includes making decisions on their applications and paying their claims quickly and efficiently, so that ultimately they can achieve all the outcomes their project identified they would deliver."
        },
        {
            "text": "This commitment helps farmers manage their businesses and fund innovative projects which otherwise may not have happened, whilst helping sustain farming and rural businesses, increase productivity, and improve the environment. Next time you’re walking round your supermarket, or doing your online shopping, look out for some well-known brands who have benefited from our work. We have funded suppliers to Tyrells Crisps and McCain, and processing equipment for Wyke Cheeses, Savoursmith Crisps and Chunk pies to just name a few, and far too many breweries and wineries to mention individually!   I feel really proud to work at the RPA, and I love explaining to people what I do."
        },
        {
            "text": "Outside of work I enjoy getting outdoors and I’m lucky to live in an area where you don’t have to go far to find the countryside and rural communities. My hobbies include anything creative such as sewing, making cards, a little bit of drawing and especially baking.  I also love travelling and have a map above my desk that you can scratch off countries that you’ve visited. I’ve been to some of the larger countries like America, Canada and Russia, and most of Europe, but there is a lot of the world still to be discovered!"
        },
        {
            "text": " "
        }
    ]
}