{
    "url": "https://homeofficemedia.blog.gov.uk/2023/07/11/national-security-act-factsheet/",
    "title": "National Security Act Factsheet",
    "authors": [
        "Home Office news team"
    ],
    "categories": [
        "Fact sheet"
    ],
    "pub_date": "2023-07-11T17:47:35+01:00",
    "content": [
        {
            "text": "Introduction"
        },
        {
            "text": "The National Security Act, which received Royal Assent on 11 July 2023, is a response to the threat of hostile activity from states targeting the UK’s democracy, economy and values. The threat is ever evolving, and we need to stay one step ahead. The Act allows us to keep pace with the changing threat and will keep our country safe by making the UK an even harder target for those states who seek to conduct hostile acts against the UK."
        },
        {
            "text": "The threats are diverse are persistent, the form they take is varied and includes espionage, foreign interference in our political system, sabotage, disinformation, cyber operations, and even assassinations and poisonings. These actions often take place in the shadows, but the harm is very real."
        },
        {
            "text": "The Act will provide our world class law enforcement and intelligence agencies with new and updated tools to deter, detect and disrupt modern threats. The Act also introduces a new Foreign Influence Registration scheme, which will bring greater transparency by requiring registration of foreign influence in our political system and registration of a broader set of influence activities from specified foreign powers."
        },
        {
            "text": "New espionage offences"
        },
        {
            "text": "Prohibited Places"
        },
        {
            "text": "Sabotage"
        },
        {
            "text": " Foreign interference"
        },
        {
            "text": "Obtaining a material benefit from a foreign intelligence service"
        },
        {
            "text": "Preparatory conduct"
        },
        {
            "text": "State threats aggravating factor"
        },
        {
            "text": "Financial and property investigation powers"
        },
        {
            "text": "Powers of arrest and detention"
        },
        {
            "text": " Powers of search and seizure "
        },
        {
            "text": " Serious Crime Act (SCA) amendment"
        },
        {
            "text": "STPIMs"
        },
        {
            "text": "Independent Reviewer"
        },
        {
            "text": "FIRS"
        },
        {
            "text": "Terrorism Measures - Damages"
        },
        {
            "text": " Legal Aid"
        },
        {
            "text": "Terrorism Act (TACT) 2000"
        },
        {
            "text": "Intelligence and Security Committee Memorandum of Understanding"
        }
    ]
}