{
    "url": "https://hmlandregistry.blog.gov.uk/2023/09/05/an-innovative-and-useful-tool-the-digital-registration-service-at-work/",
    "title": "“An innovative and useful tool” –  the Digital Registration Service at work",
    "authors": [
        "Anton Hunt, Account Manager, HM Land Registry"
    ],
    "categories": [
        "Law and practice"
    ],
    "pub_date": "2023-09-05T10:46:36+01:00",
    "content": [
        {
            "text": "A top 60 UK law firm, Harrison Clark Rickerbys (HCR) employs more than 800 people across 10 locations providing a full range of legal services. From my perspective, the firm has been trialling new approaches in its use of HM Land Registry’s Digital Registration Service (DRS). Demonstrating how some customers are thinking outside the box, Victoria Humphries, a Commercial Real Estate Associate based in the firm’s Cardiff office, explains how DRS is helping her and her Real Estate colleagues."
        },
        {
            "text": "I have used DRS since its launch mid-2020 and I find it both useful and efficient. The DRS rollout has provided a new way to lodge and monitor applications, with the added advantage of being able to prepare applications and check the details, ahead of completion. It is great that the system picks up potential inconsistencies. It is user friendly and an unexpected but effective safeguard against minor errors."
        },
        {
            "heading": 2,
            "text": "Reducing inconsistencies"
        },
        {
            "text": "It also saves time. We can be confident that there are no ‘human errors’ when we lodge the application, because we have already run it through DRS. For example, it confirms that there are no irregularities with the names or the property description against the information held at HM Land Registry. When used in this way, it improves efficiency."
        },
        {
            "text": "If we encounter additional issues within our application preparation, we will be more likely to assess these costs accurately so that when it comes to billing, it is useful for both us and our client to have a clear picture of the global cost, on completion."
        },
        {
            "heading": 2,
            "text": "Starting early to get checks done"
        },
        {
            "text": "Where possible, we use DRS at an earlier stage in the process so that we can promptly lodge the application following completion."
        },
        {
            "text": "By doing this, DRS double checks the accuracy of the instruments used in the transaction. It is flexible – for example, it adapts for the scenario in which the registered proprietor has passed away and the seller is the executor."
        },
        {
            "text": "When we are drafting the transaction documents, it is reassuring that we can use DRS to flag any inconsistencies before we complete the transaction, rather than when we lodge the application. For example, once a team member has completed a TR1 any errors spotted by HM Land Registry during the registration process will take considerably more time to put right, so by running it through DRS first we ensure that there are no avoidable delays."
        },
        {
            "text": "DRS will save a drafted application for up to 90 days. It also checks and flags required certificates and will therefore provide us with a mental jog ahead of completion, if used in this way."
        },
        {
            "text": "This goes beyond the original DRS process design because, for us, it is less about the platform and more about verification. It is good to hear that our approach is innovative; all of our colleagues engage with it and appreciate how the new system benefits us in Commercial Real Estate."
        },
        {
            "text": "This final stage of the transaction is sometimes left to more junior members of the team – but colleagues at all levels can benefit from what the DRS system offers. Especially where a transaction is particularly complex or the registered title requires consents, covenants and/or certificates to be given."
        },
        {
            "heading": 2,
            "text": "HM Land Registry’s training and guidance"
        },
        {
            "text": "We have found HM Land Registry’s customer training comprehensive and this is promoted internally. We have been looking forward to the rollout of DRS for all forms of applications including registrable leases and transfers of part – as well as the enhancements such as View [Colleagues’] Applications and the ability to save an application earlier in the process."
        },
        {
            "text": "HCR Law’s Real Estate Teams frequently deal with complex transactions – the new enquiry service, Ask for Guidance, is also beneficial."
        },
        {
            "heading": 2,
            "text": "How we’re reducing our requisitions"
        },
        {
            "text": "In terms of requisitions there is a time lag between lodging the application and when it’s completed, so it could be a while before we see the benefits of the DRS process in terms of the requisition rate. Implementing DRS with our approach avoids simple errors. The service lends itself well to ironing out requisitions and we anticipate over the months ahead we will see requisition rates going down."
        },
        {
            "text": "All credit to Anton for encouraging our early adoption of DRS – he has been a good influence. I always look forward to our meetings when we can discuss the latest developments at HM Land Registry."
        },
        {
            "text": "A final word from me: For me, the greatest innovations come from advances in our systems that benefit us all. In this respect, working with Harrison Clark Rickerbys has been a real partnership and a pleasure. HCR’s innovative use of our new tools has helped broaden HM Land Registry’s understanding of how our customers can and do think outside of the box, not only maximising our service offer, but also adding value."
        },
        {
            "heading": 3,
            "text": "More information"
        },
        {
            "text": "Digital Registration Service guidance"
        },
        {
            "text": "Webinar (recorded): Digital Registration Service User Journey and Application Flow"
        }
    ]
}