{
    "url": "https://stratcommand.blog.gov.uk/2023/09/05/ensuring-safety-and-compliance-fines-imposed-for-airfield-road-misuse-in-gibraltar/",
    "title": "Ensuring Safety and Compliance: Fines Imposed for Airfield Road Misuse in Gibraltar",
    "authors": [
        "blythevictor"
    ],
    "categories": [
        "Gibraltar",
        "Overseas Bases"
    ],
    "pub_date": "2023-09-05T13:43:49+01:00",
    "content": [
        {
            "text": "In recent weeks, the Gibraltar Defence Police (GDP) have taken a proactive stance to ensure the safety and security of all individuals along Winston Churchill Avenue (the road leading to the airfield). Several instances where vehicles have come onto the restricted access road leading into the airfield have led to fines being imposed on drivers as vehicles are no longer permitted to drive through the airfield."
        },
        {
            "text": "This article discusses the importance of adhering to the regulations, outlining the restricted area and its significance, and emphasising the implications for drivers who do not comply with the regulations."
        },
        {
            "text": "The Restricted Area and Safety Concerns:"
        },
        {
            "text": "The airfield in Gibraltar is a safety-critical zone. To maintain the integrity of this space, airfield stakeholders and the Government of Gibraltar (GoG) have implemented strict regulations prohibiting unauthorised motor vehicles from travelling through the airfield."
        },
        {
            "text": "Use of Kingsway Tunnel:"
        },
        {
            "text": "To ensure safe travel for all, drivers and visitors to Gibraltar must use the designated route, the Kingsway Tunnel, situated on the eastern side of Gibraltar. This tunnel is the designated access road for visitors travelling from Spain into Gibraltar by taking a left turn approx. 20 metres after crossing the border and passing through customs."
        },
        {
            "text": "Enforcement and Penalties:"
        },
        {
            "text": "To reinforce the importance of complying with these regulations, the GDP initiated an educative campaign for a period of time. This period has elapsed, and strict enforcement is now being employed."
        },
        {
            "text": "Non-compliant drivers who access the restricted areas leading onto the airfield are liable to be reported for processing through a Traffic Fixed Penalty Notice (TFPN). The penalties associated with such notices may result in a fine of £300. This measure is not only meant to deter violations but also to emphasise the gravity of disregarding the established regulations."
        },
        {
            "text": "Signage and Awareness:"
        },
        {
            "text": "Efforts have been made to inform road users about the restricted nature of airport areas. Clearly visible signage has been installed along the road leading to the restricted areas, notifying drivers and riders of the prohibition. To prevent outdated routing, individuals are encouraged to update their personal and vehicle navigation systems, ensuring they are not guided towards the restricted area inadvertently."
        },
        {
            "text": "The recent fines imposed on drivers and riders misusing the Airfield Road in Gibraltar serve as a reminder of the significance of adhering to regulations. By complying with the directives set by the GDP and GoG and utilising the designated Kingsway Tunnel, individuals contribute to the overall safety, security, and functionality of the airfield areas. Through awareness and cooperation, both residents and visitors can play a pivotal role in upholding the integrity of this restricted space and maintaining operational safety."
        },
        {
            "text": "Crossing the Runway:"
        },
        {
            "text": "Only pedestrians, cyclists, scooter/e-scooter riders, and mobility scooter users will be allowed to cross the runway, this was implemented on the 31st of March 2023. All vehicles, including cars, motorcycles, vans, and trucks must use the tunnel via Devil’s Tower Road and the East Gate roundabout."
        }
    ]
}