{
    "url": "https://traderemedies.blog.gov.uk/2023/09/05/should-it-stay-or-should-it-go-steel-safeguard-extension-review/",
    "title": "Should it stay or should it go? Steel safeguard extension review",
    "authors": [
        "Timothy Sharp, Lead Investigator"
    ],
    "categories": [
        "Investigations"
    ],
    "pub_date": "2023-09-05T09:51:23+01:00",
    "content": [
        {
            "text": "The TRA has initiated a steel safeguard extension review. This will be the first extension review to be conducted under the UK’s trade remedies regime. The purpose of this review is to make a recommendation to government whether the current steel safeguard measure, which is set to expire in 2024, should be extended."
        },
        {
            "heading": 2,
            "text": "What’s in scope of the review?"
        },
        {
            "text": "The review will consider:"
        },
        {
            "text": "The TRA will be issuing questionnaires to a range of stakeholders to inform our assessments, including upstream and downstream industries, importers, exporters, trade bodies, domestic producers, and consumers. The responses to these questionnaires will  be the key method through which the TRA will gather the relevant data and opinions to inform the assessment. On initiation of the extension review, interested parties will have until 19 September 2023 to register their interest on the public case file."
        },
        {
            "heading": 2,
            "text": "The background"
        },
        {
            "text": "Safeguard measures are emergency actions responding to increased imports of particular products, which cause serious injury to the importing country’s domestic industry. They apply to all imports (with some exceptions), rather than being focused on imports from particular countries. They impose duties when imports exceed a level reflecting traditional trading patterns. The use of safeguard measures, the rules for which are set by the WTO Agreement on Safeguards, is rare."
        },
        {
            "text": "The measure on steel was the first safeguard applied by the EU for over a decade. Transitioned from the EU to the UK, it is also one of a number of measures in relation to steel. It applies to nineteen categories of steel product, including hot and cold rolled flat steel, rods, wires, tubes and pipes."
        },
        {
            "text": "This is a trade defence measure that has the potential to impact a high number, and wide range, of individuals and companies. We encourage contributions to the extension review; your opinions, comments, and data are welcomed by the TRA to ensure we make evidence-based recommendations to government."
        },
        {
            "text": "Registration forms are available on the public file for the case and we are available to provide assistance or respond to any questions via the case team's email."
        }
    ]
}