{
    "url": "https://moderncivilservice.blog.gov.uk/2023/09/05/skilled-language-capability/",
    "title": "Skilled: How Civil Service Languages Network (CSLN) is improving language capability",
    "authors": [
        "A Modern Civil Service"
    ],
    "categories": [
        "A Modern Civil Service",
        "Capability",
        "Modernisation and Reform",
        "Skilled"
    ],
    "pub_date": "2023-09-05T17:44:56+01:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "The Civil Service Languages Network (CSLN) aims to improve language capability across government, equipping colleagues with the necessary skills and ambition to achieve the shared goals of A Modern Civil Service."
        },
        {
            "text": "The CSLN is a vibrant community of over 12,000 members across the Civil Service, spanning over 40 language groups including British Sign Language. CSLN offers conversation sessions, speaker events and network socials where fellow language enthusiasts gather to connect as well as supporting the government strategically, lending support to a variety of cross-cultural and translation projects through the unique linguistic resource pool."
        },
        {
            "text": "Mark your calendars for an exciting event coming this autumn - from September 25 to 29, CSLN is hosting a week-long programme of free events to celebrate European Week of Languages 2023!"
        },
        {
            "text": "You can sign up to be a member of the Civil Service Languages Network here. In doing so, you will receive invitations to all the European Week of Languages events and also information on future CSLN events, socials and activities as well as the monthly newsletter. "
        },
        {
            "text": "This year’s theme, ‘Languages on Location’, delves into the role of languages in international events. Fi McNevin, a CSLN committee member, sheds light on the inspiration behind this theme and what's to come."
        },
        {
            "text": "Fi, can you explain what European Week of Languages is? "
        },
        {
            "text": "Fi: The Council of Europe introduced the idea of European Day of Languages in 2001, which is celebrated every year on 26 September to celebrate language learning across Europe. The CSLN team decided that we would turn this day into a week, because who doesn’t want to celebrate for a little longer? "
        },
        {
            "text": "What led the team to pick the theme Languages on Location for this year?"
        },
        {
            "text": "F: The Languages on Location theme came about as we were brainstorming potential speakers - we realised that there had been a number of significant events recently where languages had played a huge role, such as the Coronavirus vaccine campaign and Eurovision 2023. As we explored ideas for other international events linked to languages in government, the week really started to come together! "
        },
        {
            "text": "What is the line-up for the week?"
        },
        {
            "text": "F: We are proud to have a range of diverse and fascinating speakers who will give our members a range of insights into the role languages play in international events and government initiatives. We have events planned every day and we have both online and in person speaker events happening in London for members based there. Have a look at our timetable below to see what’s on each day!"
        },
        {
            "text": "That sounds great - a real range of different speakers! Which event are you most excited about and why?"
        },
        {
            "text": "F: It’s difficult to choose considering they all sound fascinating. Being a huge Eurovision fan, I can’t wait for Thursday’s talk on the making of Eurovision 2023  as I’m hoping we will get a real insight behind the scenes so I can bring out some fun facts when watching next year’s! I am also intrigued to hear more about King Charles’ visit to the Berlin embassy - I know Tom has hinted at some fun stories to come…"
        },
        {
            "text": "What has been the biggest challenge in coordinating the European Week of Languages events?"
        },
        {
            "text": "F: It’s brilliant that we have so many fantastic speakers lined up, but it does mean we have a lot of moving parts requiring clever coordination. We also have a time difference with one speaker dialling in from Australia which required a little more thinking through! Luckily the CSLN team are all very committed and it’s been great to work together to organise the week - our members should be very excited. "
        },
        {
            "text": "And finally I have to ask, do you think you really could run a Royal Visit?"
        },
        {
            "text": "F: I think that’s something I’ll have to give you an answer to after hearing Tom and Bonnie’s talk! From chatting to Tom so far, it sounds like a fantastic experience but definitely something that requires a lot of hard work and flexibility…maybe one day I’ll be in a role where I can prove to myself I could do it!"
        },
        {
            "text": "The Capability mission is one of the 5 reform missions for A Modern Civil Service. The Capability mission supports a Skilled Civil Service which is focused on developing a skilled, knowledgeable and networked Civil Service which can quickly adapt to the changing needs of society. More information on A Modern Civil Service and our missions can be found here."
        }
    ]
}