{
    "url": "https://socialworkwithadults.blog.gov.uk/2023/09/05/social-works-vital-role-in-disaster-situations/",
    "title": "Social work's vital role in disaster situations",
    "authors": [
        "Lyn Romeo",
        "Joe Hanley",
        "Maris Stratulis"
    ],
    "categories": [
        "Education and training",
        "Guidance",
        "Knowledge and skills"
    ],
    "pub_date": "2023-09-05T09:07:27+00:00",
    "content": [
        {
            "heading": 2,
            "text": "New course brings calm to crises"
        },
        {
            "text": "British Association of Social Work (BASW) England are excited to announce the launch of a free online training course for social work in disasters. This training was developed alongside key partners within the BASW England Social Work in Disasters Working Group, including social workers with experience of working in disasters, and those they have supported."
        },
        {
            "text": "The training is informed by these experiences, and the impetus for starting this project arose from those social workers who had previously responded to disasters and described the lack of training available."
        },
        {
            "text": "The development of the training course was also informed by a systematic literature review commissioned by BASW England and completed by the University of Stirling, the course materials were designed in collaboration with The Open University."
        },
        {
            "text": "The training builds upon previous work of the BASW England working group, including the development of guidance and learning outcomes for social work in disasters continuous professional development (CPD."
        },
        {
            "heading": 2,
            "text": "How the course breaks down"
        },
        {
            "text": "The modules are designed to be worked through by social workers either independently or collaboratively, and each module involves a combination of text, audio and video content, alongside preparation reading and follow up tasks to complete. The training is supplemented by a workbook where participants record notes, reflections and responses to individual tasks throughout the training. Each module is designed to take about four hours to complete, meaning the training totals about 16 hours (or two days)."
        },
        {
            "text": "A pilot study of the training, involving a collaboration between BASW England, The Open University, University of Stirling, Durham University and University of Greenwich, found that it was overwhelmingly positively received by social workers working in a range of contexts. This included positive reporting in relation to enhanced knowledge and self-confidence in working in disasters. Some selected quotes from participants include:"
        },
        {
            "heading": 2,
            "text": "Free training open to all"
        },
        {
            "text": "More information will be provided at a free to attend official launch event to be held remotely on 8 September 2023 from 12:00-1:30pm. Click the links below for more details, including how to register."
        },
        {
            "heading": 2,
            "text": "Lived experience at heart of practice"
        },
        {
            "text": "This training compliments the key messages from people with lived experience and social workers in ‘Out of the Shadows: The Role of Social Workers in Disasters’ (2022.) It is the first book to be published focusing on the role of UK social workers in disasters. Their involvement goes beyond the initial crisis as the impact of disasters have long term consequences such as displacement, loss, psychological issues and survivor guilt."
        },
        {
            "text": "This book focuses on the poignant and important personal stories of people with lived experiences of disaster. It also includes voices of social workers and their organisational leaders who have been directly involved in providing support in disasters, their reflections and sharing learning for the future."
        },
        {
            "text": "The impact of disasters not only affect those directly involved but also individuals, families, groups and local communities, nationally and internationally."
        },
        {
            "text": "This book provides an important opportunity to share and develop knowledge, skills, best practice and learning from disasters nationally and internationally and from social workers who have been directly involved in emergency responses as well as from the communities they have served."
        }
    ]
}