{
    "url": "https://insidedvla.blog.gov.uk/2015/07/08/rohan-gye-in-his-new-role-as-dvlas-vehicle-service-manager/",
    "title": "Rohan Gye in his new role as DVLA's Vehicle Service manager",
    "authors": [
        "DVLA digital comms team"
    ],
    "categories": [
        "Abolition of the tax disc",
        "Enforcement",
        "Features",
        "Personalised registrations",
        "Statutory Off Road Notification",
        "Vehicle registration",
        "Vehicle tax"
    ],
    "pub_date": "2015-07-08T13:44:32+01:00",
    "content": [
        {
            "text": "How we design and deliver our services is changing. Rohan Gye, DVLA’s Vehicle Service manager tells us about his role"
        },
        {
            "heading": 3,
            "text": "As one of DVLA’s Service Managers Rohan, can you tell me about your responsibilities? "
        },
        {
            "text": "I’m responsible for all DVLA’s vehicle related services. These include:"
        },
        {
            "heading": 3,
            "text": "How has the service manager structure at DVLA changed the way you and DVLA work?"
        },
        {
            "text": "Personally it’s rewarding to have a broad remit and the ability to influence changes to services that impact millions of customers.  Colleagues say to me “These are your services; you’re accountable for them and have the authority to make the changes you need.” This has changed the focus and mindset at DVLA to deliver better services. It’s also important to point out that the 4 service managers couldn’t do this without the support of all DVLA staff."
        },
        {
            "heading": 3,
            "text": "How is your team structured?"
        },
        {
            "text": "We’ve split the vehicles team and have 2 service design leads. Gill Bevan heads Vehicle Registration and Enquiries; and Michelle Billing leads our Vehicle Licensing and Enforcement team. They each have service designers responsible for each of the specific services eg Personalised Registrations or Enforcement. Service designers are responsible for end to end service improvements, including working on an agile project like the recent View Vehicle Record service or accountability for reducing avoidable calls and casework."
        },
        {
            "heading": 3,
            "text": "How will your role help bring about change for stakeholders and commercial customers?"
        },
        {
            "text": "I want to ensure our services are simple for our users, if you’re an individual with a car or a commercial organisation with tens of thousands of vehicles.  For too long our services have been made more difficult as they’re underpinned by a complex set of policies, rules and technology. We’re bringing them into the modern age by providing services all our customers expect. It’s my role to champion the needs of our customers and ensure our services meet their needs."
        },
        {
            "heading": 3,
            "text": "How will you ensure stakeholders and commercial customers are kept up to speed with everything?  "
        },
        {
            "text": "We work very closely with DVLA’s communications team and Hugh Evans, DVLA’s Corporate Service Manager, and his team. We attend the Industry Liaison Group meetings (who meet twice a year working together to identify opportunities to provide DVLA stakeholders and customers with more modern and efficient services) as subject matter experts, we blog about our progress and we join Customer Insight teams when they conduct user insight. For larger changes, such as V5C On Demand (when a V5C registration document is suppressed, and requested on demand when one is needed) we plan communication campaigns - this will include arranging workshops, awareness sessions and updates via email, social media and through liaison groups."
        },
        {
            "heading": 3,
            "text": "What are the biggest challenges of your role?"
        },
        {
            "text": "We work in an ever changing environment where priorities can change almost daily. Having 2 young children this is something I am used to outside of work! On a serious note, we all face differing pressures continuously as the focus can switch from managing an incident, defining the strategy, providing a new digital service or reacting to a European or Ministerial directive. Balancing everything and also meeting customer and stakeholder expectations, is the most challenging aspect of the role but also the most rewarding."
        },
        {
            "heading": 3,
            "text": "What’s your long term goal?"
        },
        {
            "text": "I want us to be proud of the services we offer. Whenever you speak to customers or stakeholders about DVLA they always mention how easy our online vehicle tax service is. You never tire of hearing that. I want us to hear this for every service we offer regardless of size or complexity. When we’ve released major changes, we need to I have the ability to change our services quickly to meet our customers’ needs. We’re creating a culture where we can continuously improve our services so we don’t leave it 2, 3, 5 years or longer before we change things for the better. That way we’ll continue to keep hearing that pride in the quality of our services."
        },
        {
            "heading": 3,
            "text": "Is there a particular message you would like to give our stakeholders and commercial customers?  "
        },
        {
            "text": "I would echo the comments that Hugh Evans and Dudley Ashford made. The insight and support we’ve had when we’ve developed some of our newer digital services has been fantastic."
        },
        {
            "text": "If you get asked to volunteer to join one of our private beta services (where we test the new services with real transactions) please do. The feedback from this stage is invaluable and really makes a difference to the final service offered to every other user."
        },
        {
            "text": " "
        },
        {
            "text": "Check out some of the research carried out at DVLA."
        },
        {
            "text": "We’ll be introducing John Hewson, our Common Services manager next..."
        },
        {
            "text": " "
        },
        {
            "text": "Follow DVLA on Twitter"
        }
    ]
}