{
    "url": "https://socialworkwithadults.blog.gov.uk/2020/01/10/is-compassionate-ageism-the-curse-within-social-work-and-care/",
    "title": "Is 'compassionate ageism' the curse within social work and care?",
    "authors": [
        "Doctor Mervyn Eastman"
    ],
    "categories": [
        "Ageing",
        "Society",
        "Viewpoint"
    ],
    "pub_date": "2020-01-10T15:26:38+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Terms of engagement"
        },
        {
            "text": "The social work profession is predicated on its ethics, values and what constitutes a ‘good, caring society.’ Our virtues encompass compassion, detached caring, warmth, honesty, courage, hopefulness and humanity, the greatest of which is compassion - or is it?"
        },
        {
            "text": "As with empathy, compassion and concern are seen as forces for good which do not necessarily require the mirroring of others’ feelings. Arguably, compassion can exist independently of empathy and is sometimes opposed."
        },
        {
            "text": "This apparent contradiction - even tension - can, I would argue, be especially apparent in how social work/care engages (or doesn’t) with older adults deemed vulnerable or needy."
        },
        {
            "text": "This is evidenced in some social work practice and applied processes, where we tend to tilt things to favour the outcomes that benefit ourselves or, I would add, our employing organisations."
        },
        {
            "text": "By this I mean assessments, interventions and responses geared towards managing resources, demand, delayed hospital discharges and case load throughput."
        },
        {
            "text": "Definitions of need and vulnerability, risk and safeguarding feed the current doom and gloom narratives about age and ageing, the social care crisis and the increasingly relentless consequences of an ageing demographic!"
        },
        {
            "heading": 2,
            "text": "Devil in the detail"
        },
        {
            "text": "The term ‘compassionate ageism’ is the belief that older adults are needy and deserve special policies to help them."
        },
        {
            "text": "This has led to the commodification and ‘othering’ of older adults and responses which can re-enforce paternalistic and patronising social care services."
        },
        {
            "text": "We use language and adopt behaviours which risk demeaning and disempowering those we are tasked to help, clothed in social work and managerial jargon."
        },
        {
            "text": "As a consequence, we risk celebrating the tangible results of our compassion with little thought to their short and long-term outcomes for individual recipients."
        },
        {
            "text": "The outcomes of our ‘benevolent patronage’ can so often be pernicious and at worse lead to negative and damaging outcomes for the person."
        },
        {
            "text": "These outcomes can be biased, doom laden, frail-obsessed and based on stereotyped assumptions of what it means to be an older adult."
        },
        {
            "heading": 2,
            "text": "History repeating itself?"
        },
        {
            "text": "Compassionate ageism may have had its roots in the 1950s, marking the rise of collective concern and age specific benefits, but the fault remains with us in 2020."
        },
        {
            "text": "It threatens our social care policies and certainly our practice, because it is primarily based on misguided assertions, language and imagery misuse, and damaging assumptions, including:"
        },
        {
            "text": "This mindset labels older adults as ‘aged’ or ‘elderly’ and we, as compassionate caring care workers have colluded in the notion that their chronological age – and assumed status - deems them ‘deserving and worthy’ of a particular approach. In effect, we have institutionalised a specific social care service construct that, in fact, very few people actually want!"
        },
        {
            "heading": 2,
            "text": "Negative power dynamic"
        },
        {
            "text": "Ageism is the exercise of power with reference to age. Beware the presumption of plight, decline and the desire to be rescued – and do not patronise with pity!"
        },
        {
            "text": "A rescuer can easily become the persecutor, and good intentions, risk assessments, safeguarding procedures, care homes, day centres, eligibility criteria, home care, budgets, financial management, and adult social care generally, can become, in reality, oppression."
        },
        {
            "text": "Social work as a profession must be aware of such contradictions and its role within them, critically reflecting on every situation where such challenges arise."
        },
        {
            "text": "Understanding our professional responsibilities, commitment to human independence and relational approaches is just the first step to understanding and resisting any practice that pleases the system at the expense of the person."
        }
    ]
}