{
    "url": "https://ipo.blog.gov.uk/2022/03/14/how-stem-women-are-graduating-towards-patent-examining/",
    "title": "How STEM women are graduating towards patent examining",
    "authors": [
        "Imogen Percival"
    ],
    "categories": [
        "Inclusion and diversity",
        "Patents",
        "Recruitment",
        "STEM career"
    ],
    "pub_date": "2022-03-14T17:25:42+00:00",
    "content": [
        {
            "text": "What’s the most important invention of your lifetime? Wi-Fi, electric cars, the vacuum cleaner? Chances are, most of these have made their way into the IPO as patent applications. If this is the case, they will have passed the people who examined their application for IP protection - patent examiners. "
        },
        {
            "heading": 3,
            "text": "What is patent examining?"
        },
        {
            "text": "Patent examiners are the technical experts who examine inventions coming into the IPO and apply IP law to see if a patent can be granted. They check the specifications of each application, to see if it is new, inventive and more than an adjustment of something which already exists. They are guided by IP legislation in their decision.  "
        },
        {
            "text": "It’s a career which every patent examiner will tell you offers something new every day. They get to see the latest inventions and stay up to date with technology - helping businesses innovate by granting patents."
        },
        {
            "text": "If that sounds like the career for you, keep reading to hear from some of our female patent examiners. Our thanks to Anne, Claire, Joanna and Alison for their contributions. "
        },
        {
            "heading": 3,
            "text": "Q. What do you enjoy most about being a patent examiner?"
        },
        {
            "text": "A: “I’m a patent examiner in the biotechnology group. I really enjoy my job because I get to think about science in lots of detail all the time and learn about so many inventions in biochemistry.” "
        },
        {
            "text": "“I was a bit worried when I started as there was a lot of new information and things to pick up, but everyone was so friendly and helpful when you had any questions. It’s a really good job if you’re a very curious person.” "
        },
        {
            "text": "A: “I’m a patent examiner associate in the construction area, looking at plumbing, scaffolding and much more. My role is really diverse all the time and I feel like I am contributing to the industry.” "
        },
        {
            "text": "A: “I work in the semiconductor devices and electronics area of patent examining. I get to see a lot of really interesting technology around renewable energy, as well as tech like mobile phone screens. "
        },
        {
            "heading": 3,
            "text": "Q. What was your journey to becoming a patent examiner?"
        },
        {
            "text": "A: “I studied woven textiles and ceramics at university and after some time working in that area, I wanted a career change. I studied for an undergrad and PhD in Engineering at the Open University. I came across the opening for a patent examiner whilst looking for a job after graduating. It offered me job security whilst staying in the engineering space.”"
        },
        {
            "text": "A: “I studied natural sciences at university and specialised in physics and semiconductors. After I graduated, I remember looking at job adverts and realising how many opportunities there were available to me as a STEM graduate. I came across the vacancy for a patent examiner and it seemed like a great fit.”"
        },
        {
            "text": "A: “I did a PhD before joining the Intellectual Property Office, but I didn’t really enjoy the research environment and wanted something different. I didn’t know what job to do and my sister pointed out the career path of patent examining to me. It just sounded like the job for me.”"
        },
        {
            "heading": 3,
            "text": "Q. What's your experience of being a woman working in science and tech?"
        },
        {
            "text": "Women make up the minority of those working in STEM, It is recognised that there is a gender imbalance right across STEM workplaces. We wondered what our female patent examiners had to say about their own experiences.   "
        },
        {
            "text": "A: “There’s still quite a lot  more men in STEM than women, which I think is a shame. But it is changing, and more women are entering science and tech careers.” "
        },
        {
            "text": "A: “I’ve always felt like the minority as a woman in STEM- I think around 20% of people in physics are women. In most environments I’ve worked in, everyone is welcoming and friendly.” Our interviewee admitted having experienced stereotyping in the past, but added: “There has been a big shift in attitudes since then though.” "
        },
        {
            "text": "A: “There is a gender imbalance within STEM both at a university level and in the world of work. But I feel like there’s so much more awareness now than when I was younger and the women in my team are some of the most confident people I know. I think the IPO is very good at talking about the imbalance.” "
        },
        {
            "heading": 3,
            "text": "Q. What inspires you as a woman in STEM? "
        },
        {
            "text": "A: “I think relatable role models in STEM are really important. I recently attended a talk with Penny Endersby, the CEO of the Met Office. She spoke about how stereotypically women in science are presented as perfectly dressed and always working in a lab, whereas that couldn’t be further from the truth! It really resonated with me. You might be in a lab, but it could be up to your elbows in grime, which is a lot more fun really.”"
        },
        {
            "text": "A: “There are inspiring women in STEM everywhere. One of the most inspiring people I’ve met was an apprentice I worked with. She wasn’t afraid to ask questions in the lab and she picked everything up very quickly, including running the electron beam lithography service.”"
        },
        {
            "text": "A: “Good, strong role models are helpful. I had great teachers and was lucky enough to go to a fantastic school. Anything that a woman working well in STEM can do to appear a role model is great. The presenter and scientist Maggie Aderin-Pocock is a fantastic example as she speaks so passionately about space and astronomy.”"
        }
    ]
}