{
    "url": "https://insideDIO.blog.gov.uk/2022/03/14/my-experiences-as-a-woman-working-in-defence/",
    "title": "My experiences as a woman working in Defence",
    "authors": [
        "Jenny Bennett"
    ],
    "categories": [
        "Environment and Ecology",
        "Science",
        "Working at DIO"
    ],
    "pub_date": "2022-03-14T16:32:26+00:00",
    "content": [
        {
            "text": "Jenny (pictured left) has been working as a DIO ecologist for nearly two years. [Crown Copyright / MOD 2022]March is Women’s History Month, so this month we’re reflecting on women’s experiences in the workplace and highlighting some of the contributions that women have made in DIO."
        },
        {
            "text": "Hi. I’m Jenny Bennett and I’ve worked as an ecologist for DIO for nearly two years and feel very lucky and privileged to be working in this role. The MOD rural estate is of spectacular value for wildlife and supports large areas of threatened habitat such as chalk grassland and heathland. It’s our job to conserve and manage these landscapes, while working alongside our military colleagues to ensure training and other Defence needs are met."
        },
        {
            "heading": 2,
            "text": "My experiences as a DIO ecologist"
        },
        {
            "text": "My job is highly desirable in the professional ecology sector; many of my peers would jump at the chance to work on fabulous sites such as Salisbury Plain, which supports the largest area of chalk grassland in north-west Europe and contains 40% of the remaining area of this habitat in the UK."
        },
        {
            "text": "However, for me, it’s the people that make the job what it is, as well as the ecology. I work with and alongside a diverse group of people, from military range staff running the training estate, to other subject matter experts within DIO, to our contractors delivering development projects and day-to-day management, to our tenant farmers and a wide range of external organisations. I find that establishing good rapport is a critical factor in doing my job well."
        },
        {
            "text": "Jenny's work is exciting and hands-on, and is at the forefront of DIO's efforts to maintain vital landscapes and habitats on the training estate. [Crown Copyright / MOD 2022]My experience working as a woman in Defence has been overwhelmingly positive, probably in part due to this collaborative way of working and the need for multi-disciplinary engagement. I have experienced nothing but professional respect, even in the very hierarchical world that is the military, and even though we sometimes deliver unpalatable news on legal restrictions relating to protected sites and species!"
        },
        {
            "text": "As a woman with a young family, I have also really appreciated the flexible working systems that I have been able to take advantage of working for DIO. An example of this was during Covid lockdowns when I was faced with the hugely daunting task of home schooling – I know many of you reading this will feel a shudder of horror at these words and the thought of ever having to go through that again! My husband and myself were both working full-time, so we shared the ‘teaching’, but life was made much easier by the flexibility I was offered to fit work in around lessons and childcare."
        },
        {
            "heading": 2,
            "text": "Changing attitudes towards women in the workplace"
        },
        {
            "text": "Prior to working for DIO, I worked in the private sector and for local government, including some time as a self-employed ecologist. In my career I’ve encountered difficult situations as a woman. I vividly remember how hard it was to make your voice heard when dealing with a certain old-school of engineers and site construction workers. I don’t mind swearing and banter at all, for me the important thing is being treated as a professional and an equal."
        },
        {
            "text": "One memory which springs to mind from the late 1990s in another role is when I arrived at a meeting as an ecological consultant working on a project for construction of a new road. There were no other women in a room of around 20 attendees, and I was greeted by ‘Oh good, the lunch has arrived’. I also remember the very long anti-social hours working as a field surveyor - unfortunately bat surveys have to be done at night, although many ecologists wish they had evolved to hunt during the day! I was glad I didn’t have to juggle a family with those working hours at that stage of my career."
        },
        {
            "text": "DIO ecologists such as Jenny use science and research to boost biodiversity across the Defence estate, while working with military colleagues to ensure that training and other Defence needs are met. [Crown Copyright / MOD 2022]As a professional woman, it does feel like the situation with respect to gender equality has improved immeasurably since the early days of my career, and I feel happy and respected in my role here in DIO. I also have the added bonus that stone-curlews, bats and newts do not differentiate on gender grounds at all!"
        }
    ]
}