{
    "url": "https://nationalscreening.blog.gov.uk/2022/03/14/professor-sir-mike-richards-announced-as-new-uk-national-screening-committee-chair/",
    "title": "Professor Sir Mike Richards announced as new UK National Screening Committee chair",
    "authors": [
        "Zeenat Mauthoor",
        "Andrew Anderson"
    ],
    "categories": [
        "General"
    ],
    "pub_date": "2022-03-14T15:57:22+00:00",
    "content": [
        {
            "text": "The UK National Screening Committee (UK NSC) – the independent scientific committee which makes screening recommendations to UK ministers and the NHS – has appointed a new chair to contribute to its ongoing development."
        },
        {
            "text": "The UK NSC was set up 26 years ago to make evidence-based recommendations to ministers so that thousands of people can be helped by health screening programmes."
        },
        {
            "text": "In 2019, a task and finish group was established under the leadership of the 4 UK chief medical officers (CMOs) to review the criteria and terms of reference for the UK NSC to enable the committee to review targeted and population screening programmes."
        },
        {
            "text": "On advice from the 4 UK CMOs, ministers have agreed to expand the functions of the committee. Going forward, the UK NSC will actively consider:"
        },
        {
            "text": "It will have closer links with research bodies and guideline-making organisations such as the National Institute for Health and Care Excellence (NICE) and Scottish Intercollegiate Guidelines Network (SIGN)."
        },
        {
            "text": "The appointment of Professor Sir Mike Richards as the UK NSC's new chair is an important part of signalling the beginning of the new era. Sir Mike said:"
        },
        {
            "text": "Sir Mike brings a wealth of experience and expertise with him following his 30 years in the English NHS. His work and dedication to improving cancer outcomes was recognised when he was awarded a CBE in 2001 and a knighthood in 2010."
        },
        {
            "text": "CMO Professor Chris Whitty said:"
        },
        {
            "text": "Everyone at the UK NSC is looking forward to working with Sir Mike on the many exciting screening projects which lie ahead, and which we’ll be sure to blog about in due course."
        },
        {
            "heading": 2,
            "text": "Huge thanks to Professor Steele"
        },
        {
            "text": "The UK NSC has made significant changes to population screening during Prof Bob Steele’s 6 years as chair. His hard work has supported many recommendations of national and international significance."
        },
        {
            "text": "Important recommendations during Prof Steele's tenure include:"
        },
        {
            "text": "Screening is not straightforward, and Prof Steele’s huge experience, technical knowledge and engagement has helped the committee navigate and unpick many complex matters."
        },
        {
            "text": "Prof Anne Mackie, Director of Screening at the Office for Health Improvement and Disparities, paid tribute to Prof Steele."
        },
        {
            "text": "Prof Whitty added:"
        },
        {
            "heading": 2,
            "text": "UK NSC blog"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK National Screening Committee. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, please contact the UK NSC helpdesk."
        }
    ]
}