{
    "url": "https://knowledgeasset.blog.gov.uk/2022/03/14/the-knowledge-assets-grant-fund-reflections-on-year-1/",
    "title": "The Knowledge Assets Grant Fund - Reflections on Year 1",
    "authors": [
        "Michael Rignall"
    ],
    "categories": [
        "Department for Business Energy and Industrial Strategy",
        "Knowledge Assets Grant Fund"
    ],
    "pub_date": "2022-03-14T09:00:26+00:00",
    "content": [
        {
            "text": "BEIS has hosted the Knowledge Assets team for almost a year now, and I am one of the BEIS staff who joined when the work moved over from HM Treasury. My name is Michael, and I have had the privilege of launching the Knowledge Assets Grant Fund (KAGF) to kickstart innovation activity across the public sector."
        },
        {
            "text": "KAGF is available to organisations across the public sector who have an accounting officer. Providing grants of up to £250,000, the fund aims to support the repurposing, commercialisation, or expanded use of public sector knowledge assets. Knowledge Assets are intangible assets, which includes products like intellectual property, datasets, software. However, we define knowledge assets as a slightly broader category than the traditional intangibles, incorporating things such as processes or knowhow. For example, Prince2 is a management framework that was designed by the UK government as the internal standard for successful management of IT projects. It has now been licenced through private partnerships and has a global reach to over 150 countries generating revenues for the taxpayer."
        },
        {
            "heading": 2,
            "text": "Looking back at the development phase…"
        },
        {
            "text": "In the first funding round, we awarded £1.8m in funding to support 24 projects. This is testament to how hard the team worked to launch this scheme at pace over the course of only six months. Building on the work incubated by the team in HM Treasury, we entered a rapid policy development and delivery phase, reaching out to some amazing members of the innovation community who have offered so much to the broader programme. We wanted to understand how funding would unlock the potential of their assets, and how we could make the process as simple as possible for them."
        },
        {
            "text": "Next we brought together a panel with remarkable expertise, bringing together experiences of entrepreneurship, tech transfer in academia, and experts in public sector innovation. Aside from being lovely to work with, they were also incredibly insightful, offering sage advice across technological disciplines for how we make the fund - and applicants’ projects - a success."
        },
        {
            "text": "We were really heartened to see coaching relationships form over the first round of funding between our panel and some of the applicants, helping them ask some of the right questions in making their project a success. We think this is an example of the service the Knowledge Assets programme can provide. The innovators we have are already brilliant, and more often than not, a few of the right questions from people who have done it before is more than enough to unlock that next stage of innovation. You can learn more about some of our panel members through our blog on Women in Innovation"
        },
        {
            "text": "– Catherine Quinn"
        },
        {
            "heading": 2,
            "text": "Projects with grant funding"
        },
        {
            "text": "A lot of projects had been in gestation for years, unable to progress where budgets were tight in a flurry of other priorities. KAGF gave innovators the chance to make the case for how the knowledge assets in their organisation could realise their potential for the benefit of the UK. Over time, we received and assessed over 30 projects from a variety of organisations. Applicants were quick to tell us how this funding filled a need they had felt for years. Other applicants described how the opportunity let them open their minds and consider their portfolio in a new way, now that funding existed to ask that question, ‘Can we do more with the assets we have?’ Applicants enjoyed having to wear a different hat and think of their project almost like a business proposition."
        },
        {
            "text": "We have received bids from across the technological spectrum. We are supporting NHS trusts exploring novel approaches to diagnosing their patients, optimising their care in emergencies, and training their staff in virtual reality. We are supporting The Defence Science and Technology Laboratory (Dstl) taking cutting edge technology developed for the military and taking its applications forward for civilians, with their partners at Ploughshare Innovations. With Office for National Statistics, we are supporting them into their work to make it easier than ever for companies to report their positive impact on sustainable development. With the National Physical Laboratory and Science and Technologies Facilities Council, we are supporting their world-leading scientists with new ideas for technologies for the energy sector, medical diagnosis, high-fidelity scientific measurement, and more."
        },
        {
            "text": "It’s clear from these projects that the public sector is brimming with innovation, with new tools designed by individuals and teams to enhance the services they are delivering for the public. NPL and STFC are experts in precision and bespoke measurement, and there is no limit to the crossover there can be to applying that knowhow to new problems and products. Healthcare professionals in the NHS are experts in their own fields both in medical research and care management, which can translate to treatments for a range of patients."
        },
        {
            "heading": 2,
            "text": "…and looking forward to the future."
        },
        {
            "text": "The interest we have received in our first year shows that the public sector has an incredible amount of potential to produce new products and service to benefit the UK's people and economy. Our funding has allowed organisations to buy in expertise for commercial exploration or technical development, components for full prototypes, and perform pilot studies to test assumptions and make the idea more real."
        },
        {
            "text": "Building on our success, we are aiming to launch a new round of KAGF in summer 2022. This round will feature a more streamlined process and refreshed guidance for applicants that ensure everyone has the best chance of succeeding. If you or your colleagues could benefit from a KAGF grant, we would love for you to apply! We believe there are ideas in every corner of the public sector, waiting for the light of grant funding to help them shine."
        },
        {
            "text": "We will share more details in due course. Do sign up to our mailing list at GrantFund.GOTT@beis.gov.uk for the latest updates.  Please keep an eye on this blog for more updates from our first year of awardees, the impact of our funding, and how they are getting on with their ideas."
        }
    ]
}