{
    "url": "https://defrafarming.blog.gov.uk/2022/03/14/the-farming-equipment-and-technology-fund-review-of-items/",
    "title": "The Farming Equipment and Technology Fund: review of items",
    "authors": [
        "Gordon Jones"
    ],
    "categories": [
        "Payments for equipment, technology and infrastructure"
    ],
    "pub_date": "2022-03-14T13:13:15+00:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "The first round of the Farming Equipment and Technology Fund closed on 7 January 2022. We received 5,624 eligible applications worth an overall value of just over £53.5 million."
        },
        {
            "text": "We now want to review the list of items available for grant funding ahead of the second round. In this post, I’ll explain how you can shape that list. "
        },
        {
            "heading": 2,
            "text": "The Farming Equipment and Technology Fund"
        },
        {
            "text": "The Farming Equipment and Technology Fund supports the purchase of equipment, technology, and infrastructure designed to improve agricultural, horticultural and forestry productivity in a sustainable way. "
        },
        {
            "text": "The fund does this by offering a grant towards the cost of specific items from a list."
        },
        {
            "text": "The items for the first round were identified following consultation with farmers, industry groups and other stakeholders. We’re adopting the same approach for the next round."
        },
        {
            "text": "The items under review are those related to productivity and slurry management. We want you to tell us:"
        },
        {
            "text": "The Farming Equipment and Technology Fund seeks to:"
        },
        {
            "text": "Any item suggested for inclusion must therefore contribute to at least 1 or more of these.  "
        },
        {
            "text": "In addition, potential items for the list must:"
        },
        {
            "text": "Items must satisfy all of these criteria."
        },
        {
            "heading": 2,
            "text": "Suggestions for items"
        },
        {
            "text": "You will be asked to provide:"
        },
        {
            "text": "Review the items on the Farming Equipment and Technology Fund list."
        },
        {
            "text": "Please complete this by 1st April 2022."
        },
        {
            "heading": 2,
            "text": "Review of items offered in the first round"
        },
        {
            "text": "We would also like your feedback on whether any of the items or specifications we offered are out of date because new products have entered the market."
        },
        {
            "text": "If so, please  explain what needs to be changed and provide a revised specification, or whether it should be removed and why.   "
        },
        {
            "text": "The details of the list of items included in the first round is published on GOV.UK. "
        },
        {
            "heading": 2,
            "text": "Updating specifications "
        },
        {
            "text": "Specifications ensure applicants understand what equipment is eligible for funding support. They are used to establish a standard cost for the item."
        },
        {
            "text": "The specification must be robust enough to enable a standard cost to be determined without favouring one manufacturer over another."
        },
        {
            "text": "It is important not to provide too general a specification as this allows lower quality alternatives to be purchased, giving rise to inequalities in the grant rates being awarded. "
        },
        {
            "text": "We would like any feedback you may wish to make regarding the list of items by 1 April 2022. "
        },
        {
            "text": "Please note that it may not be possible to include all items or changes suggested, but these will be noted and we will look for future opportunities to test the list of items."
        },
        {
            "text": "Below, I'll post the inks for suggestions relevant to Animal Health. Share your feedback by 22 March 2022:"
        },
        {
            "text": "Suggestions for items that improve pig health and welfare"
        },
        {
            "text": "Suggestions for items that improve sheep health and welfare"
        },
        {
            "text": "Suggestions for items that will improve dairy cattle welfare"
        },
        {
            "text": "Suggestions for items that will improve beef cattle welfare"
        },
        {
            "text": "Suggestions for items that will improve meat chicken health and welfare"
        },
        {
            "text": "Suggestions for items that will improve the welfare of laying hens"
        },
        {
            "text": "If you have any technical questions, please contact the Rural Payments Agency. It is responsible for delivering the scheme. "
        }
    ]
}