{
    "url": "https://defradigital.blog.gov.uk/2022/03/14/why-composting-matters-to-me/",
    "title": "Why composting matters to me",
    "authors": [
        "Christina Gyles, Interaction Designer"
    ],
    "categories": [
        "Defra digital",
        "Defra interaction",
        "Digital transformation",
        "User centred design"
    ],
    "pub_date": "2022-03-14T08:00:12+00:00",
    "content": [
        {
            "text": "I work at Defra as a Senior Interaction Designer, and I have an interest in growing vegetables and cut flowers. I use composting as a big part of both waste management and as soil fertiliser."
        },
        {
            "text": "Something I like about working at Defra is that I find lots of my interests outside of design, like agriculture, the environment, and waste management, crop up in the services I work on. I’ve also been really engaged in Defra and wider governments increasing focus on Planet Centred Design."
        },
        {
            "text": "It’s an approach that really appeals to my values, and it’s with a planet-centred approach I’m often designing both within the services I work on at Defra, and outside of it in the garden and allotment - where I focus on re-use and responsible growing."
        },
        {
            "text": "Design is my specialism, I’m not an expert in the sciences behind composting, or the different methods. For me composting has always been about garden waste management in largely improvised forms, which happen to produce a great fertiliser - just by nature doing its own thing. But for this post for #CompostWeekUk I thought I’d gather some research to share on the topic, alongside things I’ve seen or tried myself."
        },
        {
            "heading": 2,
            "text": "What is compost?"
        },
        {
            "text": "David Domoney explains it well in his post demystifying compost."
        },
        {
            "text": "\"The recycling of plant and kitchen waste as a fertiliser and soil amendment. Compost improves soil by returning organic matter to the soil and improves drainage and water retention.\""
        },
        {
            "text": "According to BBC Gardening’s interesting facts, there are more micro-organisms in a teaspoonful of soil than there are humans alive on the planet!"
        },
        {
            "heading": 2,
            "text": "Different ways to do it"
        },
        {
            "text": "There are a few different ways to compost:"
        },
        {
            "text": "I use pretty much all of these options as I get through a lot of green waste, but my favourite ways to compost at the allotment are trench composting (for bean planting), and sheet composting on any large beds that don’t have winter crops on. These methods save having to move and apply the compost, as it’s just where it needs to be once it’s ready."
        },
        {
            "heading": 2,
            "text": "Benefits of composting"
        },
        {
            "text": "Here are just a few composting benefits:"
        },
        {
            "heading": 2,
            "text": " What to do with it"
        },
        {
            "text": "There are plenty of uses for compost when growing outside, here are a few:"
        },
        {
            "text": "If you don’t have an outside space, you can still use your compost:"
        },
        {
            "text": "Hopefully I’ve given you some ideas on how to get composting, if you have the space to do so. Many, of course, don’t have much or any outside space, but some alternatives for space saving composting ideas are:"
        },
        {
            "text": "And if composting isn’t your thing, many of the local authorities will collect food and garden waste from you. It can then either be turned into compost that then gets fed back into your local green spaces for you, or sent for anaerobic digestion to recycle nutrients into the soil whilst also generating energy."
        },
        {
            "heading": 2,
            "text": "Further information"
        },
        {
            "text": "Find out more about Compost Week UK."
        },
        {
            "text": "We’re hiring all the time. Check out the latest Digital data and technology vacancies."
        },
        {
            "text": "See more of our stories on LinkedIn."
        }
    ]
}