{
    "url": "https://ipo.blog.gov.uk/2024/03/12/autonomous-vehicles-and-ip-how-one-uk-business-is-driving-change/",
    "title": "Autonomous vehicles and IP: how one UK business is driving change",
    "authors": [
        "Christina Watts"
    ],
    "categories": [
        "AI",
        "Business",
        "Copyright",
        "Patents",
        "Trade marks",
        "Trade secrets"
    ],
    "pub_date": "2024-03-12T14:20:24+00:00",
    "content": [
        {
            "text": "When learning how to drive I joked that there was no point in me learning as, by the time I pass my test, cars would drive themselves. While unfortunately I do have to drive myself around, it might not be the case for the next generation. "
        },
        {
            "text": "The self-driving car revolution in the UK is moving closer. The government has made recent changes to the Highway Code regarding the introduction of autonomous vehicles (AV). It seems incredible to me that we could be seeing the UK’s first approved self-driving vehicles on our roads very soon, certainly within the next few years. [Source link: Britain moves closer to a self-driving revolution - GOV.UK (www.gov.uk)] "
        },
        {
            "text": "Oxa, headquartered in Oxford, was the first company in the UK to test a self-driving vehicle on public roads as part of Project Endeavour, an Innovate UK-funded trial. Since 2014, the company has been developing software for AVs, culminating on 27 February 2024 with its first commercial deployment in passenger-carrying shuttles in Jacksonville, Florida, US."
        },
        {
            "text": "We caught up with Oxa’s Head of Licencing and IP Management Alex Tame to find out how owning intellectual property (IP) has played a role in the research, production, and scaling of their innovative AV technology.  "
        },
        {
            "heading": 3,
            "text": "Where did Oxa’s journey begin?"
        },
        {
            "text": "Oxa started life as a spin-out company based on the academic research carried out at the University of Oxford. Founders Paul Newman and Ingmar Posner were lecturers in the robotics department, and that's where Paul started to think about commercialising the work they were doing with robotics, and their journey into developing software for AVs began."
        },
        {
            "text": "Alex told us about their mission: “Oxa was founded with a very clear vision, to build software that enables any vehicle to be self-driving, anywhere and at any time. We call this Universal Autonomy.”"
        },
        {
            "text": " Oxa has trade marked ‘Universal Autonomy’ along with a portfolio of other trade marks. For a list of Oxa's trade marks, please visit the following link: Oxa trade marks "
        },
        {
            "heading": 3,
            "text": "IP-you've got to know how to use it  "
        },
        {
            "text": "Protecting IP is essential for Oxa. Alex told us how they think of anything being created as Oxa’s IP and that they feel it is important to use different types of protection to protect the differing IP assets within the business."
        },
        {
            "heading": 3,
            "text": "Oxa’s first patent  "
        },
        {
            "text": "The team at Oxa has been steadily growing their patent portfolio since filing their first one in 2021.  "
        },
        {
            "text": "Alex told us that Oxa tends to file patents at the UK IPO first, which helps them decide if they should also file at other global offices.  "
        },
        {
            "text": "We asked Alex about Oxa’s use of the IPO’s Green Channel for their patent application. "
        },
        {
            "text": "The Green Channel for patent applications was introduced on May 12 2009. This service allows applicants to request accelerated processing of their patent application if the invention has an environmental benefit. "
        },
        {
            "text": "Have you created innovation that benefits the environment? Find out more about the IPO’s green channel via this link: Patents: accelerated processing   "
        },
        {
            "heading": 3,
            "text": "Top IP Tips"
        },
        {
            "heading": 3,
            "text": "What's next for Oxa and its autonomous vehicle software?"
        }
    ]
}