{
    "url": "https://defrafarming.blog.gov.uk/2024/03/12/blending-private-and-public-finance/",
    "title": "Blending private and public finance ",
    "authors": [
        "The Green Finance Team"
    ],
    "categories": [
        "Farming and Countryside Programme"
    ],
    "pub_date": "2024-03-12T13:43:25+00:00",
    "content": [
        {
            "text": "We want farmers and land managers in England to confidently and securely access payments from both the public and private sector for the environmental benefits and food they produce.  "
        },
        {
            "text": "In March 2023, we published a refreshed Green Finance Strategy and the first Nature Markets Framework. These documents set out what we’re doing to provide clarity and ambition for the development of nature markets.   "
        },
        {
            "text": "We set out our commitment in both the Nature Markets Framework, and the payment principles for environmental land management to support the combination of multiple public and private sector payments.  "
        },
        {
            "text": "This compatibility relies on being able to demonstrate that additional action has been taken and that no double funding occurs for the same environmental outcome.  "
        },
        {
            "text": "We recognise this can be a complex area. We’re working to simplify it with farming groups, academics, businesses and conservation experts.  "
        },
        {
            "text": "We’ve commissioned research to carry out analysis on whether a greater degree of stacking should be permitted between ecosystem service markets. We’ll share the findings, due this summer, with you when they’re available.  "
        },
        {
            "text": "Today, we published an update on progress under the Nature Markets Framework on GOV.UK. "
        },
        {
            "heading": 2,
            "text": "The Nature Markets Framework "
        },
        {
            "text": "The Nature Markets Framework sets out our plans to scale up private investment into nature recovery and sustainable farming. "
        },
        {
            "text": "Our goal is that by 2027, £500 million of private investment must go into nature recovery every year. This target rises to more than £1 billion each year by 2030. "
        },
        {
            "text": "The framework includes the principles guiding the development of nature markets so that they operate with integrity. It also includes clearer rules for how farmers and other land and coastal managers can access markets creating an additional income stream. "
        },
        {
            "text": "In this post, we'll share a short summary of the initiatives supporting our ambitions in this space.  "
        },
        {
            "heading": 2,
            "text": "The Natural Environment Investment Readiness Fund (NEIRF) "
        },
        {
            "text": "This competitive scheme offers grants of between £10,000 and £100,000. It supports projects to get ‘investment ready’ through the development of models and market-based mechanisms that can produce revenue from ecosystem services to attract and repay private investment into nature projects.  "
        },
        {
            "text": "The NEIRF is already supporting the development of 86 projects across England - some of which are already transacting and securing investment.  "
        },
        {
            "text": "A third round of NEIRF launched last autumn, specifically targeted at supporting farmers to access nature markets, alongside food production. The bids received in this round are currently being assessed. Awards to successful projects will be made this summer. NEIRF we’ve talked about on the blog. I’ll share a summary of some NEIRF projects. "
        },
        {
            "heading": 3,
            "text": "The Lapwing Estate  "
        },
        {
            "text": "The systematic drainage of lowland peat for agricultural practices accounts for 2-3% of total UK greenhouse gases. Another environmental challenge in agriculture is food supply chain emissions.   "
        },
        {
            "text": "The Lapwing Estate in Nottinghamshire and South Yorkshire received NEIRF funding to ‘Rethink Farmed Peatlands’ by developing business models that abate landscape emissions through growing short rotation coppice willow on peat soils with a raised water table, known as paludiculture.   "
        },
        {
            "text": " The willow is harvested and thermally decomposes, through a process called pyrolysis, producing biochar and generating high grade heat and power. The renewable energy will then be used for controlled environment agriculture, a technology-based approach to create optimal growing conditions for food production to offset the farmland being used to grow crops for pyrolysis.   "
        },
        {
            "text": " The project has developed a complex and novel business model to generate sustainable energy, enhance food production, and restore degraded peatlands. It has the potential to generate income through several other streams including ecosystem services, balancing the risk of market infancies and regulatory or policy changes.   "
        },
        {
            "text": " The business models for different scaled options were explored, scoping out financing opportunities and different income streams with stakeholders.  "
        },
        {
            "text": "The project has 3 options to scale up, including to landscape-scale at 35,000 hectares which will be one of the first of its kind in the UK.  "
        },
        {
            "heading": 3,
            "text": "Hadrian Bond  "
        },
        {
            "text": "Hadrian Bond was conceived as the UK’s first Environmental Impact Bond focused on regenerative agriculture. Through the NEIRF it aimed to channel impact investment to farms which seek to adopt regenerative principles and practices and restore the effectiveness of carbon, water, and mineral cycling in soils and wider ecosystems.   "
        },
        {
            "text": "The NEIRF grant was used to:  "
        },
        {
            "text": "A Special Purpose Vehicle (SPV), Hadrian Bond Company Ltd was set up to operate a pilot project. HBC sells soil sequestered carbon units to corporates seeking to offset their emissions. Over time, approximately two-thirds of revenues will go directly to farmers and the rest will be used to run the project and repay investors.   "
        },
        {
            "text": "Following the pilot, Hadrian Bond aims to expand to 3 further farming clusters in the Midlands, English borders, and Wiltshire, each of around 10,000 hectares at full capacity, with the overall aim to increase the scale of regenerative agriculture in the UK and raise further finance to support farm conversion.  "
        },
        {
            "heading": 2,
            "text": "Projects for Nature "
        },
        {
            "text": "Launched at COP28, Projects for Nature is a platform that connects corporate leaders in sustainability with nature recovery projects, screened by Defra, Natural England and the Environment Agency. The initiative established a partnership with the Council for Sustainable Business, Crowdfunder, and Accenture and leverages corporate donations.  "
        },
        {
            "text": "The pilot aims to determine business appetite for such a platform and whether corporate donations can be leveraged towards nature recovery, including projects focused on sustainable agriculture. Our first founding business partner is Lloyds Banking Group. They have committed a total of £250,000 to 3 projects on the platform. "
        },
        {
            "text": "One of the projects funded by Lloyds Banking Group is taking place at Dalehead in the Peak District. The National Trust is working with partners and tenant farmers in the High Peak to manage the land in their care for nature, climate, and people. Together, they are working to establish more trees, healthy peatlands, and thriving wetlands and grasslands. This will help to improve soil health and water quality, create more space for nature, increase resilience in a changing climate, as well increase and provide public access for all to enjoy the shared history of the landscape.  "
        },
        {
            "text": " Funding will support the restoration of 2.6km of wetland on a site nestled between the iconic landmarks of Mam Tor and Kinder Scout. It will also enable expansion of the Peak Regenerative Farmers initiative, which includes events, workshops, training and peer-to-peer support to support sustainable businesses that produce quality food alongside nature-friendly farming practices. "
        },
        {
            "heading": 2,
            "text": "Partnering with the British Standards Institution (BSI) "
        },
        {
            "text": "This partnership with the British Standards Institution (BSI) will enable us to develop a range of nature investment standards, providing clear rules for what a high integrity nature market unit looks like. This will give farmers more confidence in supplying units and accessing payments from nature markets.  "
        },
        {
            "text": "BSI will shortly consult on the first standard of the programme, the Overarching Principles standard. "
        },
        {
            "text": "BSI has engaged with farming stakeholders to inform the development of the programme and this first standard. "
        },
        {
            "text": "The consultation is a vital opportunity for farmers to shape the scope and direction of the next iteration, due later this year. Learn more about the programme and details of the consultation.  "
        },
        {
            "heading": 2,
            "text": "Action to reduce barriers to accessing nature markets"
        },
        {
            "text": "Our work to support access to nature markets also includes:"
        },
        {
            "heading": 2,
            "text": "Next Steps "
        },
        {
            "text": "With support from HM Treasury, the Department for Energy Security and Net Zero, we’re working towards launching a public consultation in the coming months. "
        },
        {
            "text": "This will test our thinking on what more can be done to support the growth of high-integrity, voluntary carbon and nature markets and to protect against greenwashing.  "
        },
        {
            "text": "We want these initiatives to help farmers, landowners, and land managers to feel confident to participate, and people and businesses to feel confident to invest their money in nature through nature markets. "
        },
        {
            "text": "The outputs of the research commissioned into stacking will be available in the summer. This will support the evidence on blending private and public finance and help to inform our understanding of impacts that stacking may have on economic, social, and environmental outcomes. "
        },
        {
            "text": "By supporting private finance for nature's recovery, we can successfully restore it – creating bigger, better, and more joined-up space for nature."
        }
    ]
}