{
    "url": "https://defraenvironment.blog.gov.uk/2024/03/12/boosting-private-finance-for-nature-and-sustainable-farming-an-update-on-progress/",
    "title": "Boosting private finance for nature and sustainable farming: an update on progress",
    "authors": [
        "Helen Edmundson"
    ],
    "categories": [
        "Green finance",
        "Nature",
        "Nature Markets Framework"
    ],
    "pub_date": "2024-03-12T15:50:44+00:00",
    "content": [
        {
            "text": "Nature is our greatest asset – it provides vital services for our health and wellbeing and underpins our economy.  "
        },
        {
            "text": "Last year, the government set out its approach to improving the state of nature through the Environmental Improvement Plan. Private finance has an important role to play in delivering this plan.  "
        },
        {
            "text": "As part of the government’s 2023 Green Finance Strategy, we published the Nature Markets Framework. The Framework sets out the government’s approach for scaling up private investment into nature’s recovery and sustainable farming. In the Framework, we set a goal for at least £500million of private investment to flow into nature recovery every year by 2027, rising to more than £1billion by 2030.  "
        },
        {
            "text": "I’m Helen, deputy director for Green Finance at Defra. My team, working across government, are developing the approaches and policies needed to help deliver that target and I’m going to share an update on the progress we’re making. "
        },
        {
            "text": "Progress under the Nature Markets Framework "
        },
        {
            "text": "Nature markets create opportunities for farmers and other land and coastal managers to sell the environmental benefits they generate to those who want or need to buy them. "
        },
        {
            "text": "Today marks a significant milestone as we update on our progress under the Nature Markets Framework, including how the government is supporting land managers in accessing nature markets as another income stream alongside farming or other land uses.  "
        },
        {
            "text": "This includes:  "
        },
        {
            "text": "The update spotlights some of the innovative projects like the Lapwing Estate project, which is blazing a trail by developing an innovative business model to generate sustainable energy, food, and reduce greenhouse gas emissions across its nine farms. Projects like these demonstrate how nature markets can best deliver for businesses, local communities and nature. "
        },
        {
            "text": "Nature Investment Standards Programme "
        },
        {
            "text": "In the Nature Markets Framework, the government announced a partnership with the British Standards Institution (BSI) to develop a suite of nature investment standards. These standards will set out what good looks like for all nature markets in the UK. "
        },
        {
            "text": "Currently, there are many schemes or codes being developed, covering woodland creation, peatland restoration and other environmental improvements.  "
        },
        {
            "text": "The BSI work looks to provide consistency across these codes, ensuring nature markets deliver real and lasting benefits. This will improve trust and increase participation in these markets, scaling investment and growth.   "
        },
        {
            "text": "Lloyds Banking Group first to fund Projects for Nature, a new platform supporting nature recovery projects across England "
        },
        {
            "text": " Alongside nature markets, there is scope to use other forms of private capital, such as corporate donations to deliver environmental benefits that are not yet investment ready.  "
        },
        {
            "text": "Projects for Nature  connects corporate leaders in sustainability with nature recovery projects, screened by Defra, Natural England and the Environment Agency. The initiative is a pioneering partnership with The Council for Sustainable Business, Accenture, and Crowdfunder. The project catalogue focuses on projects that are further away from or might never provide a financial return to investors but are still essential components for meeting government’s nature recovery targets. "
        },
        {
            "text": "Today, we are pleased to announce our first Founding Business Partner of the initiative, Lloyds Banking Group, have committed to investing £250,000 into three nature recovery projects across England: "
        },
        {
            "text": "How to get involved with Projects for Nature "
        },
        {
            "text": "We have many more projects on the Project for Nature platform, helping to recover endangered species like the water vole, engage local communities with nature, and use innovative approaches and tools to deliver nature recovery.  "
        },
        {
            "text": "We invite businesses that can demonstrate their commitment to restoring nature in England to register their interest in joining Projects for Nature. "
        },
        {
            "text": "Further interventions to support nature and boost investment "
        },
        {
            "text": "We have made steps today to update on our progress with nature finance, but there is still more to do, and to come. The British Standards Institution (BSI) will shortly launch a public consultation on the first standard: the Overarching Principles Standard. This will, for the first time, set the core requirements that will drive high integrity across all UK nature markets.  "
        },
        {
            "text": "Through this consultation, BSI will seek views on how the standard should function, including which elements of the standard should be certifiable, and how workable it is for different users. For more information on the programme and the consultation, visit the BSI Nature Investment Standards Hub: BSI Nature Investment Standards Hub.   "
        },
        {
            "text": "As committed in the 2023 Green Finance Strategy, with support from Defra and HM Treasury, the Department for Energy Security and Net Zero is working towards launching its own public consultation in the coming months on voluntary carbon and nature markets. This consultation will set out questions on what further measures are needed to foster the growth of efficient, high-integrity voluntary carbon and nature markets.  "
        },
        {
            "text": "We will use the findings from this consultation to further bolster and support the development of the BSI standards as they iterate and integrate stakeholder feedback. "
        },
        {
            "text": "For more information, please read this press release on GOV.UK"
        },
        {
            "text": "To receive more updates like this in the future, please subscribe to our blog. "
        }
    ]
}