{
    "url": "https://teaching.blog.gov.uk/2024/03/12/national-tutoring-programme-funding-used-to-deliver-holiday-tuition/",
    "title": "National Tutoring Programme funding used to deliver holiday tuition",
    "authors": [
        "James Chamberlain"
    ],
    "categories": [
        "Inspiring teachers",
        "Pupil wellbeing and behaviour",
        "School funding",
        "Teachers' reflections"
    ],
    "pub_date": "2024-03-12T09:41:49+00:00",
    "content": [
        {
            "text": "The Harvey Grammar School in Kent is a selective grammar school for boys aged 11 to 18. Assistant headteacher, James Chamberlain, shares how he used the school’s National Tutoring Programme (NTP) funding to introduce holiday tuition."
        },
        {
            "text": "Why we delivered tutoring during the school holidays"
        },
        {
            "text": "We’ve been using NTP since it began in 2020, in response to the educational challenge presented by the COVID-19 pandemic."
        },
        {
            "text": "Having observed the benefits it had on our pupils, and identifying further areas that needed intervention, we expanded our tutoring offer and delivered a ‘Head Start’ tuition programme during the summer holidays."
        },
        {
            "text": "We targeted disadvantaged pupils, pupils with low attendance and year 10 pupils who were at risk of underperforming in maths, English and science, to help them prepare for their GCSEs."
        },
        {
            "text": "Factors for success"
        },
        {
            "text": "Our holiday tuition was successfully delivered online, so pupils could access it at home or whilst on holiday, if they wanted to. It was important that the programme was flexible and therefore could fit around students’ plans during their summer break."
        },
        {
            "text": "We also recognised the importance of fostering strong relationships between pupils and their tutors. Our tuition partner, Mannings Tutors, took proactive measures to communicate with pupils and understand their needs. They also have tutors from a diverse range of backgrounds which our pupils really related to."
        },
        {
            "text": "It was essential to work with parents in order to ensure student ‘buy in’ during the summer holidays. To do this, I reached out to parents to emphasise the importance and benefits of tuition which helped maintain engagement."
        },
        {
            "text": "Impact on pupils "
        },
        {
            "text": "We observed exceptionally high levels of engagement, with a remarkable 93% attendance rate overall."
        },
        {
            "text": "Some of our particularly positive outcomes were amongst students who face challenges in traditional classroom settings, including pupils with behavioural issues. These students demonstrated real enthusiasm during the sessions conducted at home, and some of them have even reintegrated back into the classroom."
        },
        {
            "text": "One of our pupils sadly had a long-term illness and missed a significant amount of classroom learning. He was, however, able to engage with the holiday tuition we offered, and this played a crucial role in his transition from year 9 to year 10."
        },
        {
            "text": "The student commented: “The sessions were fun and engaging and helped me with gaps in my knowledge, so when I returned to school in September, I was confident that I could do it.”"
        },
        {
            "text": "Tutoring in the future "
        },
        {
            "text": "Given the impact tutoring has had in our school, we plan to utilise part of our pupil premium budget to continue supporting pupils via tutoring."
        },
        {
            "text": "We will be prioritising those eligible for pupil premium and those preparing for GCSEs, as part of our ongoing commitment to their academic progress."
        },
        {
            "text": "Further reading: "
        }
    ]
}