{
    "url": "https://stratcommand.blog.gov.uk/2024/03/12/rg-op-cabrit/",
    "title": "Royal Gibraltar Regiment soldiers return from Op Cabrit",
    "authors": [
        "abievans"
    ],
    "categories": [
        "Gibraltar",
        "Overseas Bases"
    ],
    "pub_date": "2024-03-12T14:45:19+00:00",
    "content": [
        {
            "text": "On Monday 11th March 2024, the Royal Gibraltar Regiment proudly welcomed back 17 of its soldiers who successfully completed their deployment on Operation Cabrit in Estonia."
        },
        {
            "text": "During their deployment in Estonia, the soldiers were attached to the First Battalion of the Royal Regiment of Fusiliers over a six month period, where they played a vital supporting role and displayed exceptional professionalism and dedication in serving their country."
        },
        {
            "text": "Their commitment to duty and exemplary performance have earned them the respect and admiration of their comrades and superiors alike."
        },
        {
            "text": "Sergeant Major Class 2 Luke Willis, who was one of the 17 members from the Regiment who served on Op Cabrit, expressed his pride and gratitude for the returning soldiers, saying: “I am immensely proud of the dedication and bravery displayed by our soldiers during their deployment on Operation Cabrit. Their unwavering commitment to serving their country reflects the highest values of the Royal Gibraltar Regiment.”"
        },
        {
            "text": " "
        },
        {
            "text": "Royal Gibraltar Regiment’s Commanding Officer, Lieutenant Colonel Matt Moore, also took the opportunity to say: “These soldiers are testament to the Regiment’s selfless commitment to support wider UK operations. Well done to all those that deployed and welcome back.\""
        },
        {
            "text": "The Royal Gibraltar Regiment extends its heartfelt thanks to the soldiers for their service during their deployment."
        },
        {
            "text": "Their safe return home marks the end of a successful mission and a job well done."
        }
    ]
}