{
    "url": "https://gfie.blog.gov.uk/2024/03/12/you-have-nothing-to-lose/",
    "title": "You have nothing to lose",
    "authors": [
        "karlharvey1"
    ],
    "categories": [
        "#GFIEsuccessstory",
        "Carers",
        "Life Chances",
        "Uncategorized"
    ],
    "pub_date": "2024-03-12T10:00:26+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Celebrating Young Carers Day 2024, Carers Trust share more about their programmes and we speak with a Carer, who has found an opportunity via the GFiE & Carers Trust Life Chance Scheme partnership"
        },
        {
            "text": "Carers Trust works to transform the lives of unpaid carers across the UK.  They partner with a network of local carer organisations to provide funding and support, deliver innovative and evidence-based programmes and raise awareness and influence policy. The vision is that unpaid carers are heard and valued, with access to support, advice and resources to enable them to live fulfilled lives."
        },
        {
            "text": "GFiE are delighted to work with Carers Trust to offer carers opportunities to apply for jobs through the GFiE scheme. Since our partnership began we have already seen several young adult carers secure jobs in the civil service in a number of different departments"
        },
        {
            "text": "Carers Trust’s Young Carers Futures programme"
        },
        {
            "text": "Young Carers Futures is a Carers Trust programme that brings together young adult carers aged 16 to 25 years with some of the UK’s leading brands and employers. It is the only UK-wide programme making these connections for young adult carers which in turn breaks down barriers for young adult carers and helps level the playing field as they look to move into the world of employment."
        },
        {
            "text": " One of the key focus areas of the programme is to help employers better understand the impact caring for a family member can have on young adult carers’ education, employability and life chances. The programme demonstrates to employers that the incredible skills and attributes young adult carers develop directly as a result of their caring role, can also be directly transferred into the workplace. These include excellent time-management skills, a sense of responsibility for other people and the importance of being able to prioritise and juggle lots of tasks – and budgets – simultaneously."
        },
        {
            "text": " The programme supports and connects capable young adult carers to employers through internships, business insight days and soft skills workshop opportunities, as well as introducing young people to long term employment opportunities.   Learn more at Carers Trust Employability Programme - YouTube"
        },
        {
            "text": "Young Action Carers Day 2024 takes place on Wednesday 13th March 2024 and the theme this year is ‘Fair Futures for Young Carers’."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Going Forward into Employment (GFiE) Schemes"
        },
        {
            "text": "If you want to know more about our other GFiE Life Chance Schemes, or are a Government department and would like to discuss providing life changing opportunities to individuals through use of the schemes for vacancies you have coming up, please get in contact with the GfiE Team at GFiE@cabinetoffice.gov.uk"
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}