{
    "url": "https://gds.blog.gov.uk/2022/06/13/climbing-kilimanjaro-gds-teams-charity-work-makes-a-difference/",
    "title": "Climbing Kilimanjaro, GDS team’s charity work makes a difference",
    "authors": [
        "Usmaan Dar - former Programme Delivery Officer for Digital Identity, Government Digital Service"
    ],
    "categories": [
        "People and skills"
    ],
    "pub_date": "2022-06-13T11:30:57+01:00",
    "content": [
        {
            "text": "Naturally, I’ll be honest, I’m someone who avoids leaving their comfort zone. My daily life ordinarily consists of very little risk, and therefore very little personal growth outside of work. It is somewhat out of character then, you might think, for someone who’s never climbed before, never travelled, to be flying more than 11 hours to Tanzania to climb Mount Kilimanjaro."
        },
        {
            "text": "Being someone who is hugely passionate about doing public good and working in the public sector - hence my time at the Government Digital Service (GDS) - it’s important to me to feel like my job, my hobbies, my pursuits make a difference. I will always be happy to work somewhere, or do something, where I can offer a benefit to the public at large: proud to make a difference."
        },
        {
            "text": "At GDS I was proud to act as a mentor to both apprentices and people on the Movement to Work Scheme, passionate about creating equal opportunities for people both young and old. I think it’s vitally important that we, and organisations, look to unlock and empower potential and thus futures."
        },
        {
            "text": "At first, naively, I was rather indifferent to the idea of climbing, seeing it as just another form of exercise. However, the literal sheer scale of this venture soon dawned on me. Standing at 5,895 metres, Kilimanjaro is the African continent’s highest peak - a snow-capped volcano made up of 3 cones: Kibo, Mawenzi, and Shira. Needless to say, I am now exercising as much as possible in preparation for my climb on 17 August."
        },
        {
            "heading": 2,
            "text": "Climbing high to dig deep"
        },
        {
            "text": "I am fundraising for Dig Deep, a charity that believes in the fundamental right of African citizens to have access to safe toilets, good hygiene and clean water. Where they work in Kenya, 8 out of 10 people are not so fortunate."
        },
        {
            "text": "Dip Deep’s mission to collaborate with the Kenyan government is something I’m passionate about after working in government myself and seeing the transformative power of collaboration. Dig Deep focuses on transforming citizens' access to clean water and good hygiene, empowering people."
        },
        {
            "text": "Most residents Dig Deep work with live in rural communities, spending hours every day walking to collect dirty water or find a safe place to go to the toilet. Dirty water and poor hygiene spread diseases, meaning even more time is lost to sickness. For a child, this can mean the difference between receiving an education and not; for a parent earning enough to feed their family or not."
        },
        {
            "heading": 2,
            "text": "In training"
        },
        {
            "text": "My climb, over the Mangaru route, will last 5 days, starting at base camp on 17 August, with a sleep on the summit, the dormant Kibo cone, on 22 August. Mangary, the oldest and most established trekking route, despite being one of the shortest routes, has the highest rate of failure due to the high stamina and endurance needed to acclimatise speedily."
        },
        {
            "text": "In preparation I have become a familiar face at my local gym, as well as getting the most out of my training as an army reservist. I’m currently going through Phase One, or basic training, attending ‘drill nights’ and a number of weekend training sessions, with my fellow recruits. My military gear will certainly come in handy for the majority of my clothing needs on the Kilimanjaro climb: I’ll be taking lots of wet and warm kit to deal with constantly shifting climates as we climb higher."
        },
        {
            "heading": 2,
            "text": "The steps to come"
        },
        {
            "text": "Whilst I’m nervous about the climb I’m also incredibly excited, this after all is the challenge of a lifetime. Looking back at my career so far I’m really pleased that I get to work for organisations like GDS that really make a difference to people’s lives, and continues to support me on my career journey and fundraising work, even though I’ve now moved on - an organisation that, like me, wants to make positive change and supports their people as part of their alumni."
        },
        {
            "text": "Working within government has inspired me to continue to do so in the future: in my career and in my fundraising work. GDS, and the civil service, are full of people like me, people who want to make a difference and empower others, both in their day to day job and in the work they do outside of the office. My climb in August is just one example of the steps I, and many others, take every day to have a positive impact on the world."
        }
    ]
}