{
    "url": "https://civilservice.blog.gov.uk/2022/06/13/inside-policy-operation-warm-welcome/",
    "title": "Inside Policy: Operation Warm Welcome",
    "authors": [
        "Rabia Nasimi, Research and Insights Lead, Afghan Resettlement Team, Department for Levelling Up, Housing and Communities"
    ],
    "categories": [
        "A Skilled Civil Service",
        "An Ambitious Civil Service",
        "An Innovative Civil Service",
        "Better policymaking"
    ],
    "pub_date": "2022-06-13T09:28:27+00:00",
    "content": [
        {
            "heading": 3,
            "text": "When the Afghan government collapsed in 2021, a significant cross-government effort - Operation Warm Welcome - swung into action to support refugees arriving in Britain to rebuild their lives. Two civil servants describe how they help give Afghans a voice."
        },
        {
            "text": "Think back to August 2021: most of us watched the distressing news emerging from Kabul following the fall of Kabul and the Taliban’s takeover. Civilians clinging to the sides of military planes, desperately trying to escape to a safe haven, only to tragically fall to their deaths. Few could forget the chaos in and around Hamid Karzai International Airport as frantic parents passed tiny children over the walls to soldiers, and the ensuing carnage as suicide bombers targeted innocent civilians fleeing."
        },
        {
            "heading": 4,
            "text": "Operation PITTING"
        },
        {
            "text": "During Op PITTING, the UK Government helped around 15,000 people to safety including British Nationals and their families, Afghans who loyally served the UK and others identified as particularly at risk, including campaigners for women’s rights, human rights defenders, Chevening scholars, journalists, judges and members of the LGBT+ community. This was the biggest and fastest emergency evacuation in recent history, and we have continued to bring people to the UK by supporting over 4,000 individuals to leave Afghanistan since the end of Op PITTING."
        },
        {
            "heading": 4,
            "text": "Safety in the UK"
        },
        {
            "text": "The evacuation delivered commitments made by the UK government under the Afghan Relocations and Assistance Policy (ARAP). Earlier this year in January, the Afghan Citizens Resettlement Scheme (ACRS) opened, providing up to 20,000 women, children and others deemed at risk with a safe, legal route to resettle in the UK. "
        },
        {
            "text": "Operation Warm Welcome got underway to support those arriving from Afghanistan through the ARAP and ACRS programmes. Since arriving, Afghan families have received support to freely and safely rebuild their lives in the UK. "
        },
        {
            "text": "This programme is designed to ensure Afghan families get the vital health, education, support into employment and accommodation they need to fully integrate into UK society."
        },
        {
            "heading": 4,
            "text": "Building a team"
        },
        {
            "text": "Operation Warm Welcome is a significant cross-government effort. The Department for Levelling Up, Housing and Communities (DLUHC) set up its Afghan Resettlement Team from the start to play a crucial role within that. A focus from the beginning was working with councils, voluntary sector organisations and stakeholders to develop a clear picture of the ongoing integration needs of Afghan families in order to best meet them."
        },
        {
            "text": "When we saw the opportunity to join the Afghan Resettlement Team, we both jumped at the chance."
        },
        {
            "heading": 4,
            "text": "Understanding their needs"
        },
        {
            "text": "We were asked to undertake policy research working directly with Afghan families to make sure they were included in decisions about their future. To do this, we travelled across the country speaking to Afghan families and collaborating with frontline staff from the Home Office, local councils and Voluntary and Community Sector Organisations to build a better understanding of the needs and challenges of Afghan families."
        },
        {
            "text": "This user-centred approach to policy-making aims to put the Afghan families at the heart of everything we do. We’ve deliberately adopted different approaches to gather their views. For example, we hosted focus groups to bring groups of families together to discuss the accommodation matching process. We’ve also held key informant interviews with individual families to gain in-depth understanding about their specific experiences and needs. We surveyed government and council officials to collect views and feedback on the resettlement programme, and shared our  insights across government. This helped ministers and policy officials understand the needs and challenges Afghan families continue to face, and shone a light on issues important to their resettlement."
        },
        {
            "text": "When Afghan families find out we have both been to Afghanistan, they’re keen to speak with us. We’ve been able to draw on our personal experiences of Afghanistan to really connect with the families. They speak proudly of their work at the British Embassy or supporting the UK military. And despite the difficult circumstances surrounding their arrival in the UK, it has been deeply rewarding, both personally and professionally, to hear stories documenting both their resilience and success as they adapt to life in Britain."
        },
        {
            "heading": 4,
            "text": "Empowering Afghan families"
        },
        {
            "text": "Ministers and Afghan families alike are keen for families to move into homes quickly. Currently, approximately 12,000 Afghans remain in temporary accommodation. This isn’t good for the families’ long-term integration or wellbeing, and doesn’t represent good value for the taxpayer. As recently highlighted by the Home Secretary, it costs around £1.2 million per day to house Afghan families in temporary accommodation."
        },
        {
            "text": "Alongside our direct work with Afghan families, we drew upon our own experiences to think about ways to try and solve this problem and improve their resettlement experience. Rabia’s family of five lived in a one-bedroom flat in Lewisham for a year when they first arrived as refugees in the UK. They recognised this was only a stepping stone in their resettlement journey and wouldn’t be their ‘forever home’. Daniel spoke about his family’s experience of homelessness in the nineties. The council offered two flats that didn’t meet the needs of his family, but his mother was fortunate to find an alternative and received council support."
        },
        {
            "heading": 4,
            "text": "Lessons learned"
        },
        {
            "text": "Key takeaways from these experiences include the importance of empowerment that helps people regain control over their lives. It also underlines the importance of giving individuals accurate information, and respecting that they are often best placed to understand their own needs and make informed and realistic choices."
        },
        {
            "text": "When speaking with Afghan families, it was clear many of them were highly motivated people who, if given the opportunity, have the language skills and capabilities to navigate the UK housing market and find their own private rented accommodation. This would give them the benefit of being able to search for accommodation in their preferred location that meets their needs. This could also mean they would potentially move into settled accommodation quicker than if they waited for the central process to find them a property."
        },
        {
            "heading": 4,
            "text": "Providing accommodation options "
        },
        {
            "text": "Through widely sharing our research findings together with ongoing discussions around alternative accommodation options, we were able, with colleagues across government, to develop an alternative model and funding arrangements. This enabled Afghan families to find their own accommodation without losing wider integration support from councils."
        },
        {
            "text": "We’re now working with councils and Afghan families to give them the right support and information to turn this into a reality. For the first time in a UK government resettlement scheme, families have an active role in a decentralised housing process. The signs, so far, are encouraging. On a recent hotel visit, we spoke with several families who’d already managed to find properties and were enthusiastically discussing with the council how to make their move a reality. And there are already  early signs of success. "
        },
        {
            "text": "Mr Ashgari’s* young family came over in the evacuation and was successfully able to find a new home in Ealing, with support from the local council. Ealing used the integration funding provided by the UK government to cover the family’s deposit and buy them furniture, and allocated them a resettlement worker who helped get the children into school and Mrs Ashgari* into English classes. The family is now fully settled into their new home.​​"
        },
        {
            "text": "*Name has been changed to protect anonymity."
        }
    ]
}