{
    "url": "https://forestrycommission.blog.gov.uk/2022/06/13/new-staffing-support-for-local-authorities-creating-woodland-to-tackle-climate-change/",
    "title": "New staffing support for Local Authorities creating woodland to tackle climate change",
    "authors": [
        "David West"
    ],
    "categories": [
        "Tree Planting",
        "Woodland creation"
    ],
    "pub_date": "2022-06-13T12:20:41+01:00",
    "content": [
        {
            "text": "Local authorities (LAs) have a vital role to play in helping to tackle the two biggest environmental issues facing society – addressing climate change and reversing the decline in biodiversity. A great deal of tree planting has been promised within public net-zero commitments and there is a real urgency to move forward if the full potential of these new trees and woodlands are to be realised by 2050."
        },
        {
            "text": "The Nature for Climate Fund (NCF) is here to help. Capital grant funding for tree planting by public bodies (such as LAs) already exists with a generous package of payments offered by the England Woodland Creation Offer  along with Community Forest and Woodland Trust grants."
        },
        {
            "text": "For those with extensive planting plans, the Forestry England (FE) Woodland Partnership lease scheme provides a simple alternative – you provide the land and FE does the rest – providing a long lease with an annual rent. A wide range of new woodland creation guidance material has been produced, and increased local support is available from Forestry Commission area teams."
        },
        {
            "text": "However, we know there remains the real need for a greater capacity of people within LAs who have the necessary skills to turn promises into new woodlands."
        },
        {
            "text": "The new Woodland Creation Accelerator Fund (WCAF) is here to help in tackling this challenge. This new fund with a total value of £7.8 million (secured from the NCF), is being delivered by the Forestry Commission in partnership with DEFRA. In exchange for revenue support, LAs will commit to a total number of trees or area of new woodland – planted by 2025."
        },
        {
            "heading": 2,
            "text": "About the Woodland Creation Accelerator Fund"
        },
        {
            "text": "The Woodland Creation Accelerator Fund (WCAF) is a simple, competitive fund designed to provide financial support for new staff or consultants time to increase the capacity of specialist skills within LAs. This in turn will enable them to accelerate the delivery of tree planting and woodland creation commitments. The ultimate goal of the fund is to enable more trees planted particularly in winter seasons 2023/24 and 2024/25."
        },
        {
            "heading": 3,
            "text": "What funding is available?"
        },
        {
            "text": "The WCAF is a revenue only fund (funding new staff and / or consultants). It is designed to be simple and flexible. Individual authorities can apply for up to £150,000 in total. Where authorities are working together in partnership, the ceiling for grant support is up to a total of £300,000. The funding will be split over two financial years."
        },
        {
            "text": "We would expect typical applications to seek funding for new posts such as woodland creation officers, community engagement posts, project officers, specialist consultants or a blend of these. The key thing is that you apply to the WCAF for your specific local needs."
        },
        {
            "text": "We want you to tell us what you need in terms of additional staff / consultants and why. How will this resource help accelerate tree and woodland planting in your area? What will be your legacy plans? As well as thinking about your own planting plans, please also consider tree planting applications from others in your area. Is there a consultation ‘bottleneck’ with your historic environment record which is slowing down or even delaying private land applications, for example?"
        },
        {
            "heading": 3,
            "text": "How do I apply?"
        },
        {
            "text": "Further information on the application process can be found on the Woodland Creation Accelerator Fund webpage. Application is by Expression of Interest (EoI) on Bravo - Defra's e-portal system."
        },
        {
            "heading": 3,
            "text": "Assessment"
        },
        {
            "text": "We will group completed applications according to the proportion of urban planting in order to be able to compare like with like bids. An initial assessment against the following three primary criteria will be completed:"
        },
        {
            "text": "A Board comprising of subject matter experts will be involved in the final selection and assessment. This is a competitive bid process and we are hoping to fund at least 50 authorities across England."
        }
    ]
}