{
    "url": "https://defrafarming.blog.gov.uk/2022/02/22/farming-equipment-and-technology-fund-grants-issued/",
    "title": "Farming Equipment and Technology Fund: grants issued",
    "authors": [
        "Gordon Jones"
    ],
    "categories": [
        "Payments for equipment, technology and infrastructure"
    ],
    "pub_date": "2022-02-22T14:20:54+00:00",
    "content": [
        {
            "text": "Recently we ran the first round of our new Farming Equipment and Technology Fund.  We received 5,624 eligible applications worth a total overall value of just over £53.5 million. This is triple our initial budget allocation for the fund. "
        },
        {
            "text": "We’re pleased we’ve been able to identify funding from within the farming budget to award  4,376 Farming Equipment and Technology Fund (FETF) Grant Funding Agreements (GFAs) totalling over £48.5 million. "
        },
        {
            "text": "The Farming Equipment and Technology Fund provides investment towards specific items of equipment which will improve productivity and efficiency for farming, horticultural and forestry businesses. It offers grants between £2,000 and £25,000."
        },
        {
            "text": "It sits alongside the Farming Transformation Fund, which offers grants between £35,000 and £500,000."
        },
        {
            "text": "Both funds are part of the Farming Investment Fund."
        },
        {
            "text": "In this post, I’ll explain the next steps. "
        },
        {
            "heading": 2,
            "text": "Successful applicants"
        },
        {
            "text": "If you’re one of the successful applicants, you must accept your Grant Funding Agreements on the Farming Equipment and Technology Fund (FETF) Acceptance Portal by midnight on 4 March 2022. "
        },
        {
            "text": "Some items are extremely popular, so do work closely with your supplier to order and receive your items as soon as possible. "
        },
        {
            "text": "You’ll then have until midnight on 31 October 2022, to buy and install your items and submit your claim for payment to FETFClaims@rpa.gov.uk. "
        },
        {
            "text": "You’ll notice we’ve extended the deadline by 1 month to ease pressure on suppliers and give more time to farmers to install kit. "
        },
        {
            "heading": 2,
            "text": "Another opportunity ahead"
        },
        {
            "text": "The application window closed on 7 January 2022. Both successful and unsuccessful applicants found out the results within 5 weeks of that date."
        },
        {
            "text": "This first round was significantly over-subscribed, but we plan to launch a second round later this year and would encourage those who weren’t successful this time to apply again. We’re reviewing all the feedback from this round to help inform the design and operation of the next round – thanks to all those who have fed back so far. In the coming weeks we will be reaching out to farmers and stakeholders for input in reviewing the list of items eligible for grant funding in future rounds."
        },
        {
            "text": "We will provide further detail on our funding priorities to help in due course, so do subscribe to the blog for the latest updates."
        }
    ]
}