{
    "url": "https://teaching.blog.gov.uk/2022/02/22/how-school-leaders-can-build-a-flexible-working-culture/",
    "title": "How school leaders can build a flexible working culture",
    "authors": [
        "Asma Maqsood-Shah"
    ],
    "categories": [
        "Flexible working",
        "Primary schools",
        "Teacher wellbeing"
    ],
    "pub_date": "2022-02-22T17:33:23+00:00",
    "content": [
        {
            "text": "Asma Maqsood-Shah, Principal of High Hazels Academy in Sheffield (part of United Learning) talks about how she helped to transform the school’s culture and motivate staff through flexible working."
        },
        {
            "text": "Today, High Hazels Academy is thriving. We’re in a diverse community and our team reflects that. Staff satisfaction, loyalty and retention are at their highest levels, meaning we have a consistent, motivated teaching body, which promotes the best outcomes for our pupils. This stands in contrast to the school I inherited, and flexible working has helped drive that transformation for us."
        },
        {
            "text": "I’ll confess, when our trust approached me to become a pilot flexible working school, I was sceptical. I had always seen flexible working as part-time working only, something associated with problems to overcome, rather than a solution. But I soon learned there was more to it – and there were huge benefits it could bring to High Hazels."
        },
        {
            "text": "Here are my top tips for making flexible working a success at your school:"
        },
        {
            "heading": 3,
            "text": "1. Communicate early with your staff"
        },
        {
            "text": "We spoke to staff at the very start of our flexible working journey. We adopted a wider definition of what flexible working means to ensure staff understood it was more than part-time working. Openly discuss with your team how the process will work too, including points such as:"
        },
        {
            "heading": 3,
            "text": "2. Be proactive"
        },
        {
            "text": "We state we’re open to flexible working in all our vacancies. As a result, we’ve widened the pool of applicants for roles and our team now reflects the diversity of our community. Flexible working has reduced our costs as staff satisfaction and retention have increased."
        },
        {
            "text": "We advertise our roles on Teaching Vacancies which is a large source of primary teaching jobs and nearly 1 in 5 vacancies on the service are listed as flexible roles."
        },
        {
            "heading": 3,
            "text": "3. Set expectations of how to make a request"
        },
        {
            "text": "I ask staff to outline answers to the following questions when they make a flexible working request:"
        },
        {
            "heading": 3,
            "text": "4. Get buy-in"
        },
        {
            "text": "Ensure you have as much support as possible. Our trust and governors supported and trusted me to make these changes. You’ll need that support to help overcome any challenges along the way."
        },
        {
            "heading": 3,
            "text": "5. Communicate clearly with parents"
        },
        {
            "text": "Let parents know why you’re implementing flexible working and explain the benefits it has. For example, it allows the school to retain experienced staff and recruit from a broader pool of teachers. It also promotes wellbeing and improves work life balance."
        },
        {
            "text": "It is important to keep parents updated with progress and keep in mind that all flexible working arrangements can be trialled and adapted where necessary."
        },
        {
            "heading": 3,
            "text": "6. Learn from others"
        },
        {
            "text": "The DfE has appointed eight Flexible Working Ambassador Schools with a track record of making it work in practice, to provide support at a local level."
        },
        {
            "text": "Contact your region's flexible working ambassador school."
        },
        {
            "heading": 3,
            "text": "7. Be brave"
        },
        {
            "text": "Creating a culture of flexible working takes a leap of faith but it’s worth it."
        },
        {
            "text": "Changing your school’s culture to embrace flexible working isn’t always straightforward, but it does bring huge benefits. Despite initial concerns about cost, we now have a budget surplus thanks to excellent staff retention. Staff are more loyal, engagement has increased, and staff are more aligned with our school values. A flexible working culture has been a key factor in our school’s improvement journey."
        },
        {
            "text": "I would encourage you to take the plunge!"
        },
        {
            "text": " "
        }
    ]
}