{
    "url": "https://companieshouse.blog.gov.uk/2022/02/22/my-apprenticeship-journey-just-keep-saying-yes/",
    "title": "My apprenticeship journey at Companies House",
    "authors": [
        "Daniel Gallimore - Infrastructure Engineer"
    ],
    "categories": [
        "Personal blog posts",
        "Working at Companies House"
    ],
    "pub_date": "2022-02-22T15:54:13+00:00",
    "content": [
        {
            "text": "I've worked at Companies House for about 3 and a half years, after completing a 2 year digital apprenticeship in the Digital, Data and Technology directorate."
        },
        {
            "text": "Before that, I was working in the private sector in a low skilled IT job. I was looking to branch out and learn more when I found digital apprenticeship opportunities at Companies House on the GOV.UK website. After reading through the information, I loved the idea and what they were offering."
        },
        {
            "text": "I had a few friends who were already working in the public sector, and they had said how nice it was working within a government organisation, so I applied. The fact that I could learn and develop my skills while getting paid was just the perfect opportunity for me at the time."
        },
        {
            "text": "The application process was very straight forward and easy to follow, along with what was being asked of me. I went through the application process, was approved and then had to complete a practical maths test. I was doing it for 40 minutes because apparently, they keep asking you questions if you get it right. So, I was like, ‘when’s this going to end?’ which was quite funny."
        },
        {
            "text": "On my first day, I met another apprentice in reception. Although we were working in different departments - me in IT services and her in digital user research - it was good to introduce ourselves and know that we could speak to each other about our experience as we went along."
        },
        {
            "text": "I was blown away by how welcoming it was at Companies House and how friendly everyone was. I remember being shown around on my first day and everyone made the effort to introduce themselves and say 'hello' or 'good luck'. That really helped me to settle in during my first week."
        },
        {
            "text": "To start with, I was put into a small team (the device team) where I watched and helped where I could. Alongside that I had coursework to complete. I would go away and do some work towards my qualification - it was around 80% on the job work, 20% qualification assignments. The team were really supportive. They told me to take as much time as I needed to work on my qualification and were always happy to help. If I needed to do something specific, like write about a certain computer technique, they would show me it. That's how I learned, and it was really helpful."
        },
        {
            "text": "I completed my apprenticeship and gained a qualification in City & Guilds Level 3 Diploma in IT User Skills (QCF), and although there are many highlights I could talk about, the main one was definitely the introduction - meeting everyone, seeing lots of friendly faces and making a lot of friends straight away. It was not like an environment where I had worked before. Here, people were happy to help me and to let me learn."
        },
        {
            "text": "Not long after I started, Companies House was due to implement a new meeting room system and there was an opportunity for someone to develop the idea. I volunteered and learned all about it, pulled the project together and then taught people how to use it. I was impressed that they let me do it, especially as I was an apprentice and so new to the organisation. It was never ‘no, you cannot do that’ but instead, ‘we'll help you along the way, we'll show you how to do things, we’ll help you develop’. That’s how it was throughout the 2 years."
        },
        {
            "text": "Just as I was about to finish my apprenticeship, a permanent job came up and I applied for it. Up against 5 others, I was successful. It was stressful because over the 2 years I was so happy working here and I really wanted to stay. I’m very happy it worked out for me."
        },
        {
            "text": "Since getting the role, there have been plenty of opportunities to keep learning. There's always something to jump into within digital and IT and we're always looking at new technology and ways of doing things. I’m given time and encouraged to go on courses, with the idea that you'll come back and share what you have learned with the team to help the organisation and push it forward."
        },
        {
            "text": "There's never a quiet day. The pandemic has been a very busy time for my team, working to get devices to nearly 600 people as fast as we could to make sure they could work remotely. It’s a really interesting time to work in digital."
        },
        {
            "text": "My advice to anyone considering an apprenticeship at Companies House would be to go for it and to keep saying yes. Coming here has taught me so much, not just about IT services but pretty much everything. There are so many opportunities to learn."
        },
        {
            "text": "When I started, I just wanted to jump in and show that I could do the job and show that their investment was worth it. I always just tried to say yes to everything and ended up with something new to learn every day. Just say yes and you'll get taught so much. They guide you through the whole process perfectly and as an apprentice, you’re not just given basic tasks to do. They come and say here's a problem, how would you solve it, and through exploring it is how I've learnt so many new skills."
        },
        {
            "text": "It’s honestly just a brilliant place to work."
        }
    ]
}