{
    "url": "https://defrafarming.blog.gov.uk/2022/02/22/our-priorities-for-the-animal-health-and-welfare-pathway/",
    "title": "Our priorities for the Animal Health and Welfare Pathway",
    "authors": [
        "Fran Edmunds"
    ],
    "categories": [
        "Payments to improve animal health and welfare"
    ],
    "pub_date": "2022-02-22T15:53:02+00:00",
    "content": [
        {
            "text": "Today, we published our initial priorities for the Animal Health and Welfare Pathway."
        },
        {
            "text": "They represent some of the best opportunities for improving animal health and welfare we have across each livestock sector. In this post, I’ll share those priorities. "
        },
        {
            "heading": 2,
            "text": "A recap"
        },
        {
            "text": "But first, a brief recap. The Animal Health and Welfare Pathway offers financial support to farmers who take actions that directly improve the health and welfare of their animals. Beyond financial assistance, the Pathway is designed to stimulate market demand for higher welfare products and continue to raise our already world-leading animal health and welfare standards. The Pathway will also seek to strengthen the regulatory baseline. "
        },
        {
            "text": "We've co-designed every element of the Pathway.  We’re grateful to all the farmers, academics, vets and people from the wider industry who helped to shape our plans. "
        },
        {
            "text": "Through the Pathway, farmers will be able to apply for funding for: "
        },
        {
            "text": "We plan to launch the first parts of the Pathway – annual health and welfare review and animal health and welfare grants - this year.  We’ll be continuing to explore the potential for payment by results for ongoing costs during this year and into 2023."
        },
        {
            "text": "We want to make sure the Pathway works for farmers and makes a difference, so you will soon be able to share your ideas for items we should include within our Animal Health and Welfare Grants offer."
        },
        {
            "text": "Your industry representatives will soon send out a questionnaire, so look out for it and do please share your views."
        },
        {
            "heading": 2,
            "text": "Working together to settle priorities"
        },
        {
            "text": "We worked hard to settle the animal welfare priorities for the Pathway. We worked closely with industry, vets, non-government organisations and welfare scientists to develop them. As you can imagine, sometimes different stakeholders had different views and the final result represents a compromise between them, but we are positive about the outcome."
        },
        {
            "text": "Our welfare priorities are presented below alongside priority endemic diseases and conditions which were previously published in November 2020.  Supporting better stockmanship will be an overarching priority across all sectors, as a critical enabler for good health and welfare."
        },
        {
            "heading": 2,
            "text": "Meat chickens"
        },
        {
            "text": "For meat chickens, our priorities are to: "
        },
        {
            "heading": 2,
            "text": "Laying hens"
        },
        {
            "text": "For laying hens, our priorities are to:"
        },
        {
            "heading": 2,
            "text": "Pigs"
        },
        {
            "text": "For pigs, our priorities are to:"
        },
        {
            "heading": 2,
            "text": "Cattle (beef and dairy)"
        },
        {
            "text": "For cattle (beef and dairy), our priorities are to:"
        },
        {
            "heading": 2,
            "text": "Sheep"
        },
        {
            "text": "For sheep, our priorities are to:"
        },
        {
            "text": "Whether it be: upgrading housing for your cattle to deliver improvements in lameness, cow comfort and calf mortality; working with your vet to control key endemic diseases affecting your flock; gradually moving your hens to cage-free environments; or improving biosecurity on your pig unit, we’ve designed the Pathway so that our priorities cover something applicable to most farms. "
        },
        {
            "text": "If you have any questions about our work, please leave a comment below. Don’t forget to subscribe to the blog for the latest updates on our work and to find out when the Animal Health and Welfare Pathway launches."
        }
    ]
}