{
    "url": "https://food.blog.gov.uk/2022/02/22/precautionary-allergen-labelling-the-may-contain-consultation/",
    "title": "Precautionary allergen labelling - The May Contain Consultation",
    "authors": [
        "Ben Rayner, Team Leader - Food Hypersensitivity"
    ],
    "categories": [
        "Allergy",
        "Business guidance",
        "Our mission"
    ],
    "pub_date": "2022-02-22T11:20:15+00:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "Our precautionary allergen labelling consultation closes in three weeks and we need to hear from businesses and industry bodies on the challenges they face, and what a better system for providing this information might look like."
        },
        {
            "text": " "
        },
        {
            "text": "We're running a consultation to help us plan our future approaches for the provision of precautionary allergen information. The consultation is called the May Contain Consultation."
        },
        {
            "text": "With just three weeks left until the consultation closes, we have been extremely encouraged by the number of responses we’ve received - particularly from consumers."
        },
        {
            "text": "But to achieve our goal of reaching a solution that keeps consumers safe, while still being workable for food businesses, it’s vital that we hear from a representative range of businesses and industry bodies before Monday 14 March 2022."
        },
        {
            "text": "The more information and opinions we receive from businesses and industry bodies, the better we will be able to understand and take into account their views alongside the needs of consumers as we develop our future approach."
        },
        {
            "heading": 2,
            "text": "What is Precautionary Allergen Labelling?"
        },
        {
            "text": "While you may not know the term, you will almost certainly be familiar with what precautionary allergen labels (PALs) are in practice.\nThese statements are a voluntary way that food businesses can communicate the risk of allergen cross-contamination to their food products. The information can be on a label, but sometimes this information is given verbally by staff, or in some other written form, such as a sign or poster."
        },
        {
            "text": "Existing advice is that PAL should only be used where a risk assessment shows there is an unavoidable risk of allergen cross-contamination, which cannot be sufficiently controlled through careful risk management. This may be the case in a small food preparation area, where several different products are being prepared and there is an unavoidable possibility of contamination."
        },
        {
            "heading": 2,
            "text": "Why should I respond?"
        },
        {
            "text": "If you are a business that provides consumers, or supplies other businesses, with food which displays precautionary allergen information, we need to hear from you about the challenges you face. We want your views on what a better system for providing this information might look like."
        },
        {
            "text": "We understand that the majority of food businesses that use precautionary labelling are doing so to protect people with a food allergy, intolerance, or coeliac disease. And whilst we recognise that different types and sizes of businesses will have different challenges and needs, we also know that businesses are confused about when they should use PAL and want clarity on the controls needed to remove or minimise the risk of allergen cross-contamination."
        },
        {
            "text": "It is clear that there is a need for a proportionate and standardised process for assessing, managing and telling consumers about the risk of allergen cross-contamination. Any changes we make will have a direct impact on your business, so it’s vital that you have your say."
        },
        {
            "heading": 2,
            "text": "What do the FSA plan to do once the consultation closes?"
        },
        {
            "text": "The responses to the May Contain Consultation will help inform our efforts to ensure that any future proposals are clear and easy to follow for businesses, and are clear, consistent and understood by consumers."
        },
        {
            "text": "We will take time to fully consider the responses we receive. We will combine this with feedback from a series of workshops with businesses, industry bodies, consumers and other interested parties, and set out our next steps in due course."
        },
        {
            "heading": 2,
            "text": "How do I respond to the consultation?"
        },
        {
            "text": "The consultation is in the style of an online questionnaire. You can share your views through the Precautionary Allergen Labelling (PAL) Consultation."
        },
        {
            "heading": 1,
            "text": "Labelu alergenau rhagofalus a’r ymgynghoriad ‘gallai gynnwys’"
        },
        {
            "text": "Daw ein hymgynghoriad labelu alergenau rhagofalus i ben ymhen tair wythnos ac mae angen i ni glywed gan fusnesau a chyrff y diwydiant am yr heriau y maent yn eu hwynebu, a sut fyddai system well yn edrych o ran darparu’r wybodaeth hon."
        },
        {
            "text": "Mae’r Asiantaeth Safonau Bwyd (ASB) yn cynnal ymgynghoriad i’n helpu i gynllunio ein dulliau o ddarparu gwybodaeth ragofalus am alergenau yn y dyfodol. Enw’r ymgynghoriad yw ‘Yr Ymgynghoriad Gallai Gynnwys’."
        },
        {
            "text": "Gyda dim ond tair wythnos ar ôl nes i’r ymgynghoriad ddod i ben, rydym ni wrth ein bodd gyda nifer yr ymatebion sydd wedi dod i law – yn enwedig gan ddefnyddwyr."
        },
        {
            "text": "Ond er mwyn cyflawni ein nod o ddod o hyd i ateb sy’n cadw defnyddwyr yn ddiogel, tra’n parhau i fod yn ymarferol i fusnesau bwyd, mae’n hanfodol ein bod yn clywed gan ystod gynrychiadol o fusnesau a chyrff y diwydiant cyn 14 Mawrth."
        },
        {
            "text": "Po fwyaf o wybodaeth a safbwyntiau a gawn gan fusnesau a chyrff y diwydiant, gorau oll fydd y sefyllfa o ran gallu deall ac ystyried eu safbwyntiau ochr yn ochr ag anghenion defnyddwyr wrth i ni ddatblygu ein dull yn y dyfodol."
        },
        {
            "heading": 2,
            "text": "Beth yw labeli bwyd rhagofalus (PAL)?"
        },
        {
            "text": "Er na fydd y term yn gyfarwydd i chi o bosibl, byddwch yn gyfarwydd â gweld labeli alergenau rhagofalus (neu PALs) yn cael eu defnyddio."
        },
        {
            "text": "Mae’r datganiadau hyn yn ffordd wirfoddol i fusnesau bwyd gyfleu’r risg o groeshalogi alergenau ar gyfer eu cynhyrchion bwyd. Gall yr wybodaeth fod ar label, ond weithiau caiff ei rhoi ar lafar gan staff, neu ar ffurf ysgrifenedig arall, fel arwydd neu boster."
        },
        {
            "text": "Y cyngor presennol yw na ddylid defnyddio labelu alergenau rhagofalus oni bai bod asesiad risg yn dangos bod risg anosgoadwy o groeshalogi alergenau, na ellir ei rheoli’n ddigonol trwy reoli risg yn ofalus. Gall hyn ddigwydd mewn man paratoi bwyd bach, lle mae nifer o wahanol gynhyrchion yn cael eu paratoi a lle mae posibilrwydd o halogiad nad oes modd ei osgoi."
        },
        {
            "heading": 2,
            "text": "Pam ddylwn i ymateb?"
        },
        {
            "text": "Os ydych chi’n fusnes sy’n darparu bwyd i ddefnyddwyr, neu’n cyflenwi bwyd i fusnesau eraill, sy’n dangos gwybodaeth ragofalus am alergenau, mae angen i ni glywed gennych chi am yr heriau rydych chi’n eu hwynebu, a sut fyddai system well yn edrych o ran darparu’r wybodaeth hon."
        },
        {
            "text": "Rydym ni’n deall bod y mwyafrif o fusnesau bwyd sy’n defnyddio labelu rhagofalus yn gwneud hynny i ddiogelu pobl sydd ag alergeddau bwyd, anoddefiadau bwyd neu glefyd seliag. Rydym ni’n cydnabod y bydd gan fusnesau anghenion gwahanol ac y byddant yn wynebu heriau gwahanol gan ddibynnu ar y math o fusnes a’u maint. Ond rydym ni hefyd yn gwybod nad yw busnesau yn siŵr pryd y dylent ddefnyddio labeli alergenau rhagofalus a bod eisiau eglurder arnynt ynghylch y mesurau rheoli sydd eu hangen i ddileu neu leihau’r risg o groeshalogi alergenau."
        },
        {
            "text": "Mae’n amlwg bod angen proses gymesur a safonol ar gyfer asesu, rheoli a dweud wrth ddefnyddwyr am y risg o groeshalogi alergenau. Bydd unrhyw newidiadau a wnawn yn cael effaith uniongyrchol ar eich busnes, felly mae’n hanfodol eich bod yn dweud eich dweud."
        },
        {
            "heading": 2,
            "text": "Beth mae'r ASB yn bwriadu ei wneud pan ddaw'r Ymgynghoriad i ben? "
        },
        {
            "text": "Bydd yr ymatebion i’r ‘Ymgynghoriad Gallai Gynnwys’ yn helpu i lywio ein hymdrechion i sicrhau bod unrhyw gynigion yn y dyfodol yn glir ac yn hawdd eu dilyn i fusnesau, a’u bod yn glir, yn gyson ac yn ddealladwy i ddefnyddwyr."
        },
        {
            "text": "Byddwn yn ystyried yn llawn yr ymatebion a ddaw i law, a’r adborth a gawn o gyfres o weithdai gyda busnesau, cyrff y diwydiant, defnyddwyr a phartïon eraill â buddiant, ac yn nodi ein camau nesaf maes o law."
        },
        {
            "heading": 2,
            "text": "Sut ydw i’n ymateb i’r ymgynghoriad?"
        },
        {
            "text": "Mae’r ymgynghoriad ar ffurf holiadur sy’n ei gwneud hi’n hawdd i chi ymateb. Gallwch chi rannu eich safbwyntiau yma – Labelu Alergenau Rhagofalus (PAL): Yr Ymgynghoriad ‘Gallai Gynnwys’."
        }
    ]
}