{
    "url": "https://giaa.blog.gov.uk/2022/02/22/what-is-internal-audit-no-really-what-is-it/",
    "title": "What is internal audit? No, really, what is it?",
    "authors": [
        "Julie Kitchin, Professional Practice team, GIAA"
    ],
    "categories": [
        "Internal Audit",
        "People",
        "Quality"
    ],
    "pub_date": "2022-02-22T09:59:28+00:00",
    "content": [
        {
            "text": "When I was asked to write this blog, I recalled a chat with a colleague about our attempts to explain our work to family and friends (yes, auditors do have friends). Our efforts largely resulted in blank expressions and swift changes of subject. Asking other colleagues revealed we were not alone in the challenge."
        },
        {
            "text": " "
        },
        {
            "text": "The definition on our profession’s websites doesn’t shed much light either:"
        },
        {
            "text": "So, what is it all about then … and why does it even matter?"
        },
        {
            "heading": 3,
            "text": "Why does internal audit matter?"
        },
        {
            "text": "Internal audit matters because we deal with issues that matter to the organisations we serve. Through our work, we help the people who run organisations to do so effectively on behalf of their stakeholders. For government organisations, those stakeholders include the public; that’s you and me."
        },
        {
            "heading": 3,
            "text": "What do internal auditors actually do?"
        },
        {
            "text": "We help organisations succeed. That’s a big statement, which needs explaining."
        },
        {
            "text": "To succeed, organisations need to have objectives and they need to manage risks that might have an effect on them meeting those objectives. All organisations, like all individuals, constantly face risks. A risk is simply an event which, should it occur, will have an effect on meeting an objective."
        },
        {
            "text": "We provide assurance, which means that we look at the systems and processes designed to help organisations manage risks and therefore meet their objectives. We then tell the people who run the organisations how well those systems and processes are working to manage those risks and how they can improve them."
        },
        {
            "text": "We provide consultancy, which means we help organisations make improvements to their systems and processes. We might do that by providing advice, facilitation and training, but not by actually doing the work. We don’t do the work because if we were later asked to assure it, our independence would be in doubt."
        },
        {
            "heading": 3,
            "text": "What’s the big deal about independence?"
        },
        {
            "text": "Independence matters because to do our work properly we must be objective and free from undue influence. Being independent of the organisations we work with means we can take a balanced view that is not unduly influenced by our own or others’ interests in the organisation."
        },
        {
            "heading": 3,
            "text": "What does it take to be an auditor?"
        },
        {
            "text": "Apart from a cape, and snazzy tights, (to be clear – I am joking about that), auditors need curiosity. As the popular wartime entertainer George Formby put it, ‘for a nosey parker, it’s an interesting job’. We need curiosity because we need to find out what is really happening before we can reach an opinion on it."
        },
        {
            "text": "We need terrier-like digging skills to gather the evidence to give us a sound basis for our opinion. We need to look, listen and question. Then we need analysis skills to make sense of the evidence we gather; looking at patterns and trends, testing different sources of information against each other to see how it all stacks up. Conclusions rarely fall into our lap fully formed because if things were that simple, our customers wouldn’t need our help."
        },
        {
            "text": "Then we need to be resilient, because we must be willing to back our own judgement and stand up for what’s right. We need to see the big picture too, and understand what really matters. From early in our careers, we talk to people right at the top of organisations about their biggest issues. Those people haven’t got time for trivia, which makes nerves of steel handy too."
        },
        {
            "text": "Whilst we are known for being fond of them in our work, there really is no template for being an auditor. We need a mix of skills and knowledge and come from all sorts of backgrounds; diversity really is our strength."
        }
    ]
}