{
    "url": "https://ipa.blog.gov.uk/2022/02/22/women-in-project-delivery-how-i-overcame-imposter-syndrome-kuljit-sagoo-mbe/",
    "title": "Women in project delivery: \"How I overcame imposter syndrome\" Kuljit Sagoo MBE",
    "authors": [
        "laurenvamplew"
    ],
    "categories": [
        "Diversity & Inclusion",
        "Project Delivery Profession"
    ],
    "pub_date": "2022-02-22T11:41:46+00:00",
    "content": [
        {
            "text": "This blog is part of the Infrastructure and Project Authority’s Role Models Campaign, which aims to increase diversity at all grades in the Project Delivery Profession. "
        },
        {
            "text": "Kuljit Sagoo MBE is the Deputy Director for Civilian HR at the Ministry of Defence and is an experienced civil servant, having spent over 17 years in government. She was awarded a MBE for services to diversity and inclusion at the Home Office."
        },
        {
            "text": "Kuljit’s project management and leadership journey began as an executive officer, where she would regularly volunteer to take specific leadership actions that would contribute to a project’s success. "
        },
        {
            "text": "The ‘glass ceiling’ effect"
        },
        {
            "text": "Working in the Civil Service, I quickly learnt that project leadership and project success draws on ethics, trust and professional conduct. As a portfolio manager, I continue to build on these strong foundations to help build high-performing teams around me. "
        },
        {
            "text": "As an ethnic, female project delivery professional, based in the East Midlands, I have come across many personal, societal, and organisational barriers within my career to date. These have included gender stereotyping as the main child-carer, and the flexible working stigma (the perception that I was less committed than others). This meant that I had often in the past lived up to the ‘always available’ culture and experienced the ‘glass ceiling’ effect."
        },
        {
            "text": "Early in my career, I experienced a lot of self-doubt – a form of imposter syndrome. "
        },
        {
            "text": "Clinical psychologist Emily Hu once said: “We’re more likely to experience imposter syndrome if we don’t see many examples of people who look like us or share our background who are clearly succeeding in our field.” "
        },
        {
            "text": "To overcome this, I learnt to celebrate my achievements, become curious about my abilities and built a strong network of Asian females to empower self-belief."
        },
        {
            "text": "Embedding inclusion and valuing diversity "
        },
        {
            "text": "I also used coaches, mentors and sponsors to help me manage and eradicate (where possible) any barriers that I had direct control over. "
        },
        {
            "text": "To help shift the organisational barriers, I took on the personal responsibility to change the culture of our organisation and support the Civil Service’s ambition of becoming the most inclusive employer. I did this by volunteering to be the chair of the Home Office’s Gender Equality Network. "
        },
        {
            "text": "These small step changes helped me focus my positive energy and enthusiasm on generating some innovative solutions to embed inclusion and value diversity. "
        },
        {
            "text": "Finding a balance"
        },
        {
            "text": "Over the years, I have learnt that the work environment has a lot of pressure built into it. "
        },
        {
            "text": "But, I have learnt to strengthen my ability to accept and release some of the pressure for myself and my team. It is important to remember that you cannot run at full speed 100% of the time, and allowing some quieter moments in your week will help you find balance and succeed as a leader."
        },
        {
            "text": "There’s so much more we need to do to ensure we continue to embed inclusion within the Project Delivery Profession. Here are my top tips:"
        },
        {
            "text": "To access similar content from women in the Government Project Delivery Profession, register for the Infrastructure and Projects Authority's International Women's Day event on 9 March 2022."
        }
    ]
}