{
    "url": "https://educationhub.blog.gov.uk/2021/10/black-history-month-how-black-history-is-taught-in-our-schools/",
    "title": "Black History Month: How Black History is taught in our schools",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Black History Month",
        "Curriculum",
        "Schools"
    ],
    "pub_date": "2021-10-08T14:46:56+01:00",
    "content": [
        {
            "text": "October is Black History Month in the UK and a time to celebrate the contribution Black communities and individuals have made over the centuries in shaping the dynamic and diverse country we have today."
        },
        {
            "text": "It is also about raising awareness of the contribution Black people have made to our freedoms, culture and society."
        },
        {
            "text": "From Roman times onwards, Black people have been an integral part of Britain, and the National Curriculum supports teaching about their contribution."
        },
        {
            "text": "One of the key aims of the history curriculum is to know and understand the history of these islands as a coherent, chronological narrative, from the earliest times to the present day. This includes how people’s lives have shaped this nation and how Britain has influenced and been influenced by the wider world, which helps build an understanding of a shared British history."
        },
        {
            "text": "Although Black History Month only happens once a year, the teaching of Black history doesn’t begin and end there. The curriculum supports children learning about it all year round."
        },
        {
            "text": "Here we look at a number of ways that Black history can be taught in schools using the national curriculum for history from Key Stages 1 to 3, and the subject content requirements for history GCSE at Key Stage 4."
        },
        {
            "text": "As part of a broad and balanced curriculum, pupils should be taught about different societies, and how different groups have contributed to the development of Britain, including the voices and experience of Black people."
        },
        {
            "text": "There are many resources schools and parents can and already use for Black History Month generated by Black communities and others."
        },
        {
            "text": "We have suggested some useful sites below:"
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}