{
    "url": "https://securityprofession.blog.gov.uk/2021/10/08/career-immersion-event-calling-all-students-recent-graduates/",
    "title": "Career Immersion Event - calling all students & recent graduates",
    "authors": [
        "South Asian Network",
        "United Kingdom Security Vetting (UKSV)"
    ],
    "categories": [
        "Events",
        "Government Security"
    ],
    "pub_date": "2021-10-08T10:55:19+01:00",
    "content": [
        {
            "text": "Following phenomenal feedback from 2020, the Civil Service will once again join a unique immersive careers event that helps students navigate and make informed choices about their careers. Returning for the fourth consecutive year this event is run by a group of some of the UK's largest employers, with the Civil Service is playing a key role!"
        },
        {
            "text": "The event provides the unique opportunity to experience a day in the life of different industries and professions. Our immersion groups provide an insight into what schemes we have available, how to write a strong application, what career trajectories look like, the opportunity to hear from recent graduates and apprentices, talking you through their journey so far - this is the kind of deep immersion that isn’t available at traditional career fairs! This will be followed by a virtual Q&A session where students are invited to ask questions and air career concerns."
        },
        {
            "text": "We've seen from previous years that students aren’t always aware of the huge variety of opportunities and schemes out there, particularly within the Civil Service."
        },
        {
            "text": "This year we'll be joined by a fantastic group of other organisations spanning a range of sectors including NatWest Group, KPMG, BT Group, UK Civil Service, Facebook, Metropolitan Police, CBRE and Trowers & Hamlins law firm. "
        },
        {
            "text": "You can find a link to registration here. We would be extremely grateful if you could share this with any students, family and friends that you think may be interested. Students are welcome to register for as many of the sessions as they like. We will be kicking off the series of events from 11 October during the evenings."
        },
        {
            "text": "The Civil Service slot hosted by the South Asian Network in partnership with UK Security Vetting will be taking place on Tuesday 12 October at 5pm. We will be showcasing opportunities on how to enter the UK Civil Service,  how to apply and hear from current civil servants about their journey."
        },
        {
            "text": "See you there!"
        },
        {
            "text": "Cross government Civil Service South Asian Network in partnership with UK Security Vetting, Cabinet Office"
        }
    ]
}