{
    "url": "https://teaching.blog.gov.uk/2021/10/08/holiday-activities-and-food-haf-how-the-successful-programme-improved-the-mental-health-of-vulnerable-children/",
    "title": "Holiday Activities and Food (HAF): How the successful programme improved the mental health of vulnerable children",
    "authors": [
        "Nick Limber"
    ],
    "categories": [
        "COVID-19 support",
        "Primary schools",
        "Pupil wellbeing and behaviour",
        "Secondary schools"
    ],
    "pub_date": "2021-10-08T11:30:40+01:00",
    "content": [
        {
            "text": "Nick Limber is a teacher and Holiday Activities and Food (HAF) programme coordinator at Doncaster Football Academy. He talks us through how the summer camps they ran were able to build on the mental health and wellbeing of attendees just as much as their physical fitness.  "
        },
        {
            "text": "After what were difficult times over the course of the pandemic, Doncaster children had the opportunity to really thrive this summer thanks to the HAF programme. As part of the wider education recovery effort, HAF is one of the ways the government is helping children and young people catch-up on learning and social development missed as a result of the pandemic. The initiative I worked on, Active Futures Educational Development, was one of many providers who benefited from the funding. This enabled us to offer summer activities for children across three sites in Doncaster."
        },
        {
            "text": "As a teacher and leader on summer programmes, I am always amazed how sport can break down barriers, integrate people and put smiles on faces. The camps we ran across Doncaster were no exception."
        },
        {
            "text": "For some children the school holidays can represent loneliness and uncertainty, however the HAF programme was able to offer sanctuary, fun and structured physical activity to some of the most vulnerable children in the Doncaster area. We catered for nearly two hundred children across four weeks of activities, with ages ranging from 8 to 15 and a variety of social and emotional needs."
        },
        {
            "text": "Individual impact "
        },
        {
            "text": "The positive social and developmental impact these programmes can have on attendees was particularly evident with one child who joined us this summer."
        },
        {
            "text": "This child came from a challenging background, had struggled with the isolation of lockdown, and showed evident vulnerabilities. Their specific needs led us to pay special attention to the structure of the activities we were able to have them participate in, whilst ensuring that additional levels of support and reassurance were available."
        },
        {
            "text": "At the start of the programme, they sought regular time outs from activities and relied on the safety of coaches for support rather than mixing with other children. However, by the end, they were a far cry from the nervous, timid child we first encountered. They were walking to and from the camps with friends they had made, with transformed confidence and self-esteem. Their journey was heart-warming and gave an enormous sense of pride to all of us who delivered the programme."
        },
        {
            "text": "Building on strengths "
        },
        {
            "text": "Other children on the camps became natural mentors, so we created a ‘buddy’ system, using some of the older children to act as leaders during social times. Time out areas were also introduced, to be accessed when things become overwhelming, or children just needed a break. The activities we delivered allowed for individual, paired and team interactions, and the coaches made sure that groupings were planned with social needs in mind. By week three, our young people were delivering activities to the rest of the group with our coaches acting as facilitators. The behavioural change in them was immeasurable."
        },
        {
            "text": "I am a firm believer that sport can change lives and provides many of the skills needed to be successful in life. The camps this summer served to reinforce this belief and I am looking forward to supporting more young people through our programmes in the future."
        },
        {
            "text": "Tips for future HAF coordinators:"
        },
        {
            "text": "Looking for more information on HAF?"
        },
        {
            "text": "As with Easter and the summer, HAF will again be available across the country this Christmas. HAF provides support for eligible children and families through high quality and healthy food, engaging activities along with socialising and having fun."
        },
        {
            "text": "Please contact your local authority for information on how to get involved and for full guidance on the HAF programme visit gov.uk"
        }
    ]
}