{
    "url": "https://insidedio.blog.gov.uk/2021/10/08/hope-and-kindness-makes-a-difference-to-mental-health/",
    "title": "Hope and kindness makes a difference to mental health",
    "authors": [
        "Trish Jakeman"
    ],
    "categories": [
        "Mental health",
        "Wellbeing",
        "Working at DIO"
    ],
    "pub_date": "2021-10-08T11:02:58+00:00",
    "content": [
        {
            "text": "Mental health is very important and maintaining mental health has been challenging for many in 2021. [Copyright/TotalShape]Sunday 10 October is World Mental Health Day and I’d like to share my personal thoughts and feelings around mental health."
        },
        {
            "text": "Like most, the continued Coronavirus pandemic drains at my resilience and wears on my inner strength. I wonder when I will stop worrying about those I love, whether taking a lateral flow test will become the norm, whether I should  consent to my children having the vaccine and if I will ever be able to safely go on a holiday."
        },
        {
            "text": "I balance that with family, friends and colleagues who are dealing with loss, health conditions and other circumstances. Mental Health is something we all must manage, like all living things we need light, nourishment and care to thrive and we should protect and support each other so that we have solidarity through the storms."
        },
        {
            "text": "Personally, I hold onto hope, I believe it underpins the recovery of mental illness, we must have the notion that things can be better. I try to look at what I have – not so long ago there was no vaccine to consider, I have a great network of friends that drown me in love and support, I have so many colleagues that lift me up and help me get rid of my own doubts."
        },
        {
            "text": "Secondly never ever underestimate the power of kindness, it can be that one single action that can give hope to someone else, help them find light on a dark day. Whether it be a text to say great presentation, a note to say great piece of work, a comment to say how well they look or even offering to buy a drink or bringing biscuits – they all make a difference and can make the world a happier place."
        },
        {
            "text": "Kindness needs to be present in all we do, the responsibility of reaching out for help has to be matched with our shared responsibility to look out for each other - to provide safe spaces to talk, to listen, and to offer caring responses."
        },
        {
            "heading": 2,
            "text": "What DIO does to support mental health"
        },
        {
            "text": "DIO is doing lots to support our staff going through a difficult time. We’ve supported our staff by running regular online wellbeing coffee and chat sessions. In these sessions we discuss all things wellbeing and there’s always a common theme that our overall wellbeing continuously impacts on our mental health. We’ve also created a wellbeing channel where our staff can share information and resources, experiences, ask questions and have discussions on wellbeing."
        },
        {
            "text": "We  have over 70 volunteers who are trained as mental health first aiders and are on hand to help when individuals need support. Throughout the Coronavirus pandemic they have promoted resources and held 1-1s with individuals to check on their wellbeing."
        },
        {
            "text": "We’ve also created a wellbeing toolkit that has been designed to offer guidance and information on things such as building your own mental health first aid kit, tips on how to measure stress levels, how to manage anxiety as well as activities to help stay mentally fit at work. All our staff are also encouraged to complete an e-learning mental health and resilience training course as well as take part in additional activities such as meditation."
        },
        {
            "text": "There are  lots of resources available to help you. Mind, The Mental Health Foundation and NHS Every Mind Matters offer some great advice to help you look after your mental wellbeing."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}