{
    "url": "https://dcmslibraries.blog.gov.uk/2021/10/08/how-wiilma-partners-with-local-libraries-to-widen-community-cohesion-and-reduce-loneliness/",
    "title": "How WIILMA partners with local libraries to widen community cohesion and reduce loneliness.",
    "authors": [
        "JJ Khun, WIILMA Founder"
    ],
    "categories": [
        "Case study",
        "Outcome: communities",
        "Outcome: culture",
        "Outcome: wellbeing"
    ],
    "pub_date": "2021-10-08T13:00:45+01:00",
    "content": [
        {
            "text": "Guest author JJ Khun is the WIILMA Founder, artist, performer and former academic librarian."
        },
        {
            "text": "WIILMA is a community start-up, based in Leyton, East London.  Its mission is to reduce loneliness, isolation and improve mental wellbeing; connecting diverse communities through access to creative, intergenerational experiences in Heritage, Culture, Music and the Arts."
        },
        {
            "text": "Since October 2019, WIILMA has been piloting innovative community cohesion workshops and events in and around the London Borough of Waltham Forest (LBWF) – The London Mayor’s first Borough of Culture.  "
        },
        {
            "text": "WIILMA brings creative industries expertise from across film, TV, fashion, architecture and the arts to offer local libraries a greater range of community activities for a wide range of people. The activities also involve library staff in presentations and workshops."
        },
        {
            "text": "The organisation passionately believes in the vitally important role Libraries play in our communities; their existence is vital to the future of sustainable communities, inclusion and prosperity and with our broad appeal we’ve demonstrated how organisations like us have a role to play in helping to bring people through Library doors who may not have considered visiting a Library before."
        },
        {
            "text": "Since 2019 WIILMA has reached out to managers within local libraries offering opportunities to partner on educational projects including history, heritage and architectural model making of library buildings. More recently, in partnership with The Barbican Centre, a digital and touring Lockdown Art Exhibition for children and adults, launched at Leytonstone Library."
        },
        {
            "heading": 2,
            "text": "Lockdown concerts"
        },
        {
            "text": "During lockdown, Leytonstone Library obtained special access for a film crew to record an elaborate History & Heritage concert featuring rare East End Victorian Music Hall songs from 1880-1930’s in the Art Deco Library. The concert was live streamed on Christmas Day 2020 aimed at people alone and isolating, with food bank partners delivering meals to people watching at home. Extracts from the concert can be viewed here: https://www.youtube.com/watch?v=GHrYx6xzm4k&t=3s "
        },
        {
            "text": "WIILMA’s principles were reflected in our spectacular Covid-19 Multilingual concert on our YouTube Channel @wiilmamusicarts part of which was filmed in Leytonstone Library.  The concert celebrated diverse traditions and showcased talent from multicultural artists."
        },
        {
            "heading": 2,
            "text": "WIILMA’s partnership with libraries"
        },
        {
            "text": "Libraries have remained an essential part of WIILMA’s journey, whether used as a performance space, community meeting place, or an exhibition gallery bringing art into our everyday lives. "
        },
        {
            "text": "WIILMA is supported by the British Library’s Start-ups in London Libraries (SiLL) program, and are also participating in a national Integrated Communities strategy pilot by the Department for Levelling Up, Housing and Communities, which encourages experimental and unconventional approaches to increasing community integration."
        },
        {
            "text": "WIILMA is delighted to have been invited to be ambassadors for the British Library SiLL Programme and with Waltham Forest already upgrading libraries this will enable us to continue to bring our specialist skills and expertise to enhance diverse community activities within local libraries in the years to come. "
        }
    ]
}