{
    "url": "https://educationhub.blog.gov.uk/2021/10/08/how-the-international-education-strategy-is-championing-the-uk-education-sector-overseas/",
    "title": "How the International Education Strategy is championing the UK education sector overseas",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Higher Education"
    ],
    "pub_date": "2021-10-08T14:45:43+01:00",
    "content": [
        {
            "text": "The UK is a world leader in education, covering all education sub-sectors, from early years through to lifelong learning. To promote UK education around the globe, the Department for Education and the Department for International Trade launched the International Education Strategy and appointed Professor Sir Steve Smith as the UK’s International Education Champion in June 2020."
        },
        {
            "text": "There are two main ambitions of the strategy. The first is to sustainably increase international student numbers to at least 600,000 and drive up the value of education exports to £35 billion per year, both by 2030."
        },
        {
            "text": "By achieving these aims – the government is able to support the UK Education sector and also ensure UK influence overseas."
        },
        {
            "text": "Professor Sir Steve Smith is focusing on promoting growth for the sector in India, Indonesia, Saudi Arabia, Vietnam and Nigeria (as well as Brazil, Mexico, Pakistan, Europe, China and Hong Kong). By doing this the UK Government is helping the UK education sector to further internationalise."
        },
        {
            "text": "In February 2021, the Government published an update to the strategy. The update saw us set the path for the education sector to move from pandemic recovery to sustainable growth (and included more detail on support for chartered bodies, and special educational needs and disabilities providers)."
        },
        {
            "text": "We also launched our pioneering Turing Scheme which saw its first placements start last month and is providing funding for around 40,000 students in universities, colleges and schools to go on placements overseas. You can read more about the Turing Scheme here: What you need to know about the Turing Scheme - The Education Hub (blog.gov.uk)."
        },
        {
            "text": "For more information on the International Education Strategy, please visit: International Education Strategy: global potential, global growth - GOV.UK (www.gov.uk). You can find out about the Department for International Trade’s education events, including webinars and trade missions, here: Great (great.gov.uk)."
        }
    ]
}