{
    "url": "https://defrafarming.blog.gov.uk/2021/10/08/its-not-too-late-to-get-free-business-advice/",
    "title": "It’s not too late to get free business advice  ",
    "authors": [
        "Andrew Powley"
    ],
    "categories": [
        "Transition support"
    ],
    "pub_date": "2021-10-08T15:30:32+01:00",
    "content": [
        {
            "text": "One of the things we're doing to support farmers and land managers through the agricultural transition is providing free business support and advice, through a project called the Future Farming Resilience Fund. "
        },
        {
            "text": "We blogged about the fund a little while ago (I'll add the links at the bottom of the post), but a quick recap: we are funding independent expert business advisers to provide free advice to farmers and land managers. "
        },
        {
            "text": "So far, advisers on the scheme have helped over 1,200 farming businesses, with scope to help many more. "
        },
        {
            "text": "In this post, I’d like to encourage more people to access the free advice that's available. "
        },
        {
            "text": "All you need to do is take a look at the list of advisers, see what they are offering and where they are operating, then contact one directly. "
        },
        {
            "text": "The fund is running in 3 phases. We're currently in the second phase, which ends in spring 2022. We previously said that we would run the scale-up phase from April 2022, but we are now looking at a revised go-live date and will let you know when further information is available."
        },
        {
            "text": "If you're unsure whether it's worth your time, here’s what Richard Wordsworth, senior adviser at the National Farmers Union, said about it:  "
        },
        {
            "text": " And this short video gives you a good idea of what the benefits are like from a farmers' perspective: "
        },
        {
            "text": " "
        },
        {
            "text": "I plan to blog again very soon, but if you have any questions about the fund, leave a comment below. And don't forget to subscribe to the Future Farming blog if you haven't already."
        }
    ]
}