{
    "url": "https://socialworkwithadults.blog.gov.uk/2021/10/08/mental-health-social-work-in-an-unequal-world/",
    "title": "Mental health social work in an unequal world",
    "authors": [
        "Jason Brandon"
    ],
    "categories": [
        "Coronavirus",
        "Mental health",
        "Our profession",
        "Viewpoint"
    ],
    "pub_date": "2021-10-08T15:42:26+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Common cause through common experience"
        },
        {
            "text": "‘Mental health in an unequal world’, this year’s World Mental Health Day theme, is one I believe all mental health social work colleagues can relate to."
        },
        {
            "text": "We work alongside people, their families and carers who find themselves in varying degrees of distress, and often crisis, to strive towards achieving positive outcomes, protecting rights and ultimately making a positive difference."
        },
        {
            "text": "Recent months have emphasised how important the mental health social work role has been, particularly in the midst of an unequal world."
        },
        {
            "text": "I join the Chief Social Worker for Adults’ Office at a time when the Department for Health and Social Care is working at full pelt on a range of vital policy programmes many of which relate directly to the mental health social work agenda in the post-COVID recovery phase."
        },
        {
            "text": "The Mental Health Act reforms provide an exceptional opportunity for mental health social work voices to be heard and to build on a legislative framework based on principles of choice and autonomy. That means least restriction, therapeutic benefit and seeing the person as an individual – each of which resonate with the social work profession."
        },
        {
            "heading": 2,
            "text": "Tough, testing and transforming times"
        },
        {
            "text": "Having experienced more than two decades of my social work career in mental health social care, I can say, with some confidence, I’ve never experienced a similar period of time where my work as a public servant has been so demanding, intense and exhausting."
        },
        {
            "text": "That said, it has also been hugely rewarding, dynamic and valued. We have witnessed the tentacles of this national crisis reach across all things adult social care and have needed to exercise an agility and stamina to make sure people are not excluded and their rights to make choices are respected."
        },
        {
            "text": "The psychological impact of the pandemic means many more people are likely to need support for their mental health in the months and years ahead. This is an important moment for the mental health social work profession to take stock, reaffirm professional leadership in the field, and stand alongside people experiencing stigma, under-representation and discrimination, to make a positive difference."
        }
    ]
}