{
    "url": "https://veteranstoday.blog.gov.uk/2021/10/08/new-service-speeds-up-help/",
    "title": "New service speeds up help",
    "authors": [
        "michaelball"
    ],
    "categories": [
        "Armed Forces",
        "Defence Business Services",
        "Veterans",
        "Veterans Advice",
        "Veterans Support",
        "Veterans Today",
        "Veterans Welfare and Support"
    ],
    "pub_date": "2021-10-08T13:18:04+01:00",
    "content": [
        {
            "text": "Drop-in centres across Britain are a valuable outlet for veterans, but it isn't always easy to access services. Christine Bulpitt from Veterans UK’s helpline acted to help veterans prove their eligibility much faster.ASDIC, the Association of Service Drop-in Centres, represents 90 drop-In centres around the UK that support veterans of the Armed Forces, merchant marine, emergency services and their families.  Often called hubs or centres, between them they offer their service users social interaction, general welfare (e.g. legal, financial, housing and employment advice) and wellbeing, including mental health support. This takes place routinely under one roof, all at the same time and in an informal, relaxed environment. The ASDIC network aims to link these drop-Ins together for their mutual benefit and make them more accessible. Under usual circumstances veterans attending a drop-in will have little difficulty in establishing that they have undertaken military service, through discharge papers, pension records, veterans ID card and other information. Additional confirmation can also be provided by Veterans UK to welfare charities like RBL and SSAFA, who confirm their Verification of Service (VOS) as part of Cbseo’s Casework Management System (CMS) Form 1. However, in some cases this is not possible, either through ill health, loss of paperwork, non-availability of a qualified charity or other circumstances.That's the reason behind the VetCheck process, set up to enable drop-ins to check a veteran’s authenticity where there is still doubt.  This helps to make sure that the right people receive the support they need, without time and resources being wasted. Christine, from the Veterans UK Helpline, was approached by the Outreach Director of ASDIC to see if Verification of Service (VOS) could be confirmed for their service users. Christine liaised with areas of the business including the Data Protection Team as a data sharing agreement (DSA) and a partnership agreement had to be designed. It was decided that all VOS would be via email so it would not affect the telephony service. These emails are currently processed now within one working day. To support this a desk aid for helpline agents was also designed, with Christine holding regular meetings with key stakeholders from ASDIC. This new process now benefits ASDIC service users as once the Verification of Service has been confirmed ASDIC can continue to support the veteran.This new service went live on 1 September. Christine said: 'From a personal point of view I think the more charities the Veterans Helpline can support can only be a good thing and I get a great sense of achievement knowing we are supporting another charity and helping our veterans get the support they need.'"
        },
        {
            "text": "Tracy Bryant, Chief Executive of ASDIC, said that she was delighted with the very swift and positive response she had received from Christine and the Veterans UK team."
        },
        {
            "text": "She said: ‘Christine quickly realised that this initiative would add another string to the bow of practical veterans’ assistance across the country. "
        },
        {
            "text": "'I really appreciate her ready assistance, and in fact this contact with Veterans UK has also revealed other areas where we hope ASDIC can better integrate with their wide range of services."
        },
        {
            "text": "'Communication and information handling are key, and I believe ASDIC can play a major part in ensuring that all aspects of Veterans UK work are better known and valued at the grassroots level where we operate.’"
        },
        {
            "text": " "
        }
    ]
}