{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2021/10/08/world-mental-health-day-2021-mental-health-in-an-unequal-world/",
    "title": "World Mental Health Day 2021: Mental Health in an Unequal World",
    "authors": [
        "Emily-Jane Cramphorn"
    ],
    "categories": [
        "Blog Series",
        "Diversity & Inclusion",
        "Guest Blog",
        "Our People & Deep Dives"
    ],
    "pub_date": "2021-10-08T14:00:21+01:00",
    "content": [
        {
            "text": "Each year October 10th marks World Mental Health Day and this year’s theme is Mental Health in an unequal world. Emily Cramphorn, a final year Science and Engineering Fast Streamer, talks about her experience of mental illness and what this year’s theme means to her. Please note this blog discusses mental illness and may be triggering to some."
        },
        {
            "text": " "
        },
        {
            "text": "For all of my life, I have struggled with my mental health, with my first official diagnosis of anorexia nervosa aged 11. For as long as I can remember managing my mood has been an uphill battle and there have been many days where I’ve felt unable to keep fighting. Fortunately, I am lucky to live in a country where mental illness is formally recognised and have been able to access support to keep living my life despite the struggle."
        },
        {
            "text": "Whilst there is a lot of stigma surrounding mental health, those with long term mental health conditions are protected under the Equalities Act 2010, meaning that employers are required to put in reasonable adjustments so that those with long term mental health conditions are not unfairly disadvantaged. These reasonable adjustments vary from person to person but for me, the ability to work from home and have flexible hours allows me to complete my work around my mental illness by giving me time to attend medical appointments and to engage in self care on days where things feel too much. However, because I am not physically disabled, I often worry that other people will think I am slacking, over exaggerating, or getting unfair advantages. Yet without reasonable adjustments, I would not be able to do my job nor would I have made it through university: living with a mental illness is like climbing a mountain with boulders in your backpack whilst everybody else has feathers. The only way you’ll make it to the top is if you reduce the load and it will likely take you a little longer to get there. My journey to the Fast Stream has taken me a little longer than others but with the right support I am thriving."
        },
        {
            "text": "So what does this mean in the context of this year’s theme? The world is an unequal place, especially for those living with mental illness. However, I was lucky enough to be born into a situation of privilege which has enabled me to access support. Many people around the world do not have access to mental health care and are not supported to live with mental illness simply because of where they were born or who their parents are. For many people mental illness means a life of destitution, social exclusion, and early mortality so it is important when we raise awareness of mental health problems we talk about the role of inequality: as COVID-19 has shown us, inequalities impact every aspect of our lives and they harm us all."
        }
    ]
}