{
    "url": "https://civilservice.blog.gov.uk/2021/09/15/a-question-of-honours/",
    "title": "A Question of Honours",
    "authors": [
        "Stephanie Karpetas OBE"
    ],
    "categories": [
        "A great place to work",
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Ambitious Civil Service"
    ],
    "pub_date": "2021-09-15T08:10:38+00:00",
    "content": [
        {
            "heading": 3,
            "text": "The nation’s favourite celebrities may dominate the headlines when they’re awarded honours, but also included in every honours list are members of the public from a range of backgrounds. Civil servant Stephanie Karpetas shares the story of her own Palace investiture."
        },
        {
            "text": "We’re all familiar with reading honours stories at New Year and The Queen’s Birthday, and seeing some recipients kneeling before The Queen – the late Captain Sir Tom Moore comes to mind. However, very little is known about what happens at an investiture. So, let me fill you in on what happened when I received my OBE for services to the community."
        },
        {
            "text": "Spring in my step"
        },
        {
            "text": "When I opened the official letter, my immediate thought was that it might be an eye-watering bill, so to read that I was being awarded an OBE was unbelievable. I had a spring in my step for months while I had to stay quiet. When I finally broke the news to my family, they were over the moon - as were many people I’d worked with over the years, who saw it as recognition for their own efforts. "
        },
        {
            "text": "On the day of my investiture I was off to the Palace, but this wasn’t a garden party with its lavish high tea and freedom to wander the grounds. Oh no, only you, as the recipient, are offered a glass of sparkling water or juice. Meanwhile your guests - you’re allowed up to three - are escorted to a grand room and directed to their seats. "
        },
        {
            "text": "Over three hours, they watched more than 300 people be announced, step forward, have their medal pinned to their lapel and share a quick regal chat. The five-hour event ruled out my parents, both of whom have health conditions, so instead, I took a close family friend and my twins. The occasion held a huge sense of gravitas."
        },
        {
            "text": "What to wear?"
        },
        {
            "text": "Rather like a society wedding, you do get all sorts. It’s a hapless task (unless you spend thousands), seeking celebrity inspiration. With seven months to search for my perfect outfit, I searched ‘mother of the bride’ on eBay, hoping to stumble across an Alexander McQueen outfit at a bargain price."
        },
        {
            "text": "I spent hours glued to ‘style hack’ videos on YouTube but didn’t strike gold. Instead, I enjoyed a day out at Bicester, with my friend who took great pride in telling shop assistants: “She’s going to the Palace…” "
        },
        {
            "text": "Finally, I chose a turquoise LK Bennett shift dress that I could wear to work on days where I needed a bit of a boost. I borrowed a Mulberry bag (that all the palace staff later said they’d been eyeing up) and a ring from a friend. "
        },
        {
            "text": "The big day "
        },
        {
            "text": "Everything runs like clockwork and mere moments after arriving at the Palace, you’re led away from your guests to be briefed on etiquette. "
        },
        {
            "text": "A video of the day shows me and others concentrating, laughing nervously at the jokes to help us feel at ease. However, with no time to practise, you’re in a queue watching the person in front: step forward, stop mid-point, then step forward again, turn to face Prince Charles, shake his hand, let him pin your medal to your lapel, chat a little before taking three steps back to curtsy and leave. "
        },
        {
            "text": "Prince Charles asked what I’d done to achieve my award and was gracious and interested in my response. “Is it difficult to engage people in sustainability?” he asked. “Yes,” I replied. “I think you have first-hand experience of that.” "
        },
        {
            "text": "“Oh, thank you for noticing,” he replied, simultaneously indicating my moment was over. "
        },
        {
            "text": "Having walked my ‘Path of Honour’, I found myself next to a fellow OBE with a knack for observing the crowd. “They must be his wife and children,” she remarked. “Ah, they’ve just seen their daughter in the queue…”"
        },
        {
            "text": "As we savoured our shared experience of a unique celebration, she kept coming back to one elderly man who looked completely out of place. He looked as if he’d been dragged there under obligation - that was our conclusion as we surveyed all the faces full of anticipation, struck by his incongruous, glowering expression. Then came the moment when his fixed expression changed – his mouth contorted and he looked down at his legs, trying hard to stop them from shaking. Looking at the line, we could only assume his son had stepped forward."
        },
        {
            "text": "What happens next? "
        },
        {
            "text": "I tell many people about watching this man bursting with pride, because this is what happens when you nominate someone for an Honour. "
        },
        {
            "text": "For those few hours, you share an incredible experience with a few hundred people whose pride and excitement is palpable. "
        },
        {
            "text": "It’s a celebration, but all the recipients are captivated by the ritualistic ceremony. Stepping into the courtyard afterwards, I began to relax and feel joyous. Getting souvenir photos taken and looking forward to a celebratory meal is when your big day becomes about you and your loved ones again, before stepping back outside with great memories. "
        },
        {
            "text": "The day flew by in a haze and a photo with my children is now in pride of place. We’ve been extremely lucky to have enjoyed such an experience and, as many people tell you, an OBE is for life. "
        },
        {
            "text": "The next day was the royal wedding of Prince Harry and Meghan, Duchess of Sussex. I watched along with millions as Prince Charles walked her up the aisle and thought to myself, “Yesterday, I met him at the Palace!”"
        }
    ]
}