{
    "url": "https://socialcareinspection.blog.gov.uk/2021/09/15/applying-to-register-a-childrens-home-top-tips/",
    "title": "Applying to register a children’s home: top tips",
    "authors": [
        "Yvette Stanley"
    ],
    "categories": [
        "children's homes"
    ],
    "pub_date": "2021-09-15T12:40:28+01:00",
    "content": [
        {
            "text": "Yvette Stanley, our National Director for Regulation and Social Care, sets out some top tips for completing an application to register a children’s home."
        },
        {
            "text": "Applying to register and operate a children’s home is a significant undertaking and should not be entered into lightly. Your application will have a greater chance of success if you are prepared and have a good understanding of the commitment that you are making."
        },
        {
            "text": "Just now, the average time it takes to complete the process from accepting your application to registering your home is 17 weeks. Applications eventually withdrawn take on average six weeks longer to reach their end point. These are average times, and so some providers will experience delays in getting to the final decision, while for others the journey will be much quicker."
        },
        {
            "text": "We have set out some hints and tips in this blog post to help you with your application."
        },
        {
            "heading": 2,
            "text": "Initial steps and understanding the three stages of your application"
        },
        {
            "text": "First, familiarise yourself with the guidance about registration – both the general guide and the ‘introduction to children’s homes’ guide. Providers have told us that our guides are clear and easy to follow and have handy checklists of the information we expect you to give us. They should help you to get your application accepted at first try."
        },
        {
            "text": "For a full new application, you will need to complete and upload a form called an SC1 with all the documents attached. You should name the people that you want to be associated with the SC1 application, and they must complete and upload a form (called an SC2) each, with all the required documents. Without all this, we cannot accept your application."
        },
        {
            "text": "Once we have accepted your application (this is called stage 1), we will carry out further checks and may ask for other documents. We look at what your Disclosure and Barring Service (DBS) check and GP health assessment tell us. We send out reference requests to the referees that you have identified for us. We ask the local authority you have been living in for the last five years whether it has any information about you. We ask you to complete a form about your property."
        },
        {
            "text": "We may then ask for more information from you or from other parties because of the information we receive. It is important that you are open and honest in the information you give us, and that you chase referees to get back to us quickly. This is called stage 2 of the application process. An inspector will be allocated to your application, and they can tell you about how your application is progressing."
        },
        {
            "text": "We move to the final stage once we have all the information that we need. This is called stage 3. In this stage, we will interview you or your responsible individual (if you need one) and manager to give you each a chance to demonstrate your fitness by telling us about your vision for the home, and how you meet the requirements of registration. We need a separate application from the provider and from the manager, and we treat each application separately. We will assess the fitness and suitability of both to meet the requirements and regulations, and we will speak to each person about their own application."
        },
        {
            "text": "Make sure that the people who are part of the application have the right qualifications. Also make sure that they have the knowledge and understanding to tell us about how they are going to meet the regulations and offer the best possible care to children so that they thrive. Those people must be recruited using the right checks for suitability. We will also carry out our own checks on their suitability to work with children."
        },
        {
            "heading": 2,
            "text": "Preventing delays in having your application accepted"
        },
        {
            "text": "If you are making a priority application to register a children’s home, please make sure that you read our guidance on the extra steps you must take before you send in any application. "
        },
        {
            "text": "All the information comes from you, so be prepared! Have all the documents together that we ask for before you apply. Make sure that they contain up-to-date information and that they are your documents, written especially for your children’s home, not copied from somewhere else. Again, be open and honest in everything that you tell us."
        },
        {
            "text": "We will tell you if we think there is something wrong with your application, so please regularly check by logging into the application website."
        },
        {
            "text": "A common reason for delay in accepting an application is when a person who is part of the application changes, for example the manager or the responsible individual. This seriously delays an application because we must wait until the new person fills out the application form, and we start again to get all the checks back that we need. We cannot go forwards with the rest of an application if one part of it changes. We must wait until that part has caught up to where everything else is."
        },
        {
            "text": "The same is true if you have problems with your property or planning. Although you can apply before your premises are ready to be used, your home must be ready for children to live in (with no outstanding planning permission applications or ongoing building work) before we can grant your registration. This is entirely your responsibility. It often causes delay in registration because we cannot move out of stage 2 while this information is missing. That is why it is better for you to have everything ready before you apply, rather than applying and hoping that you can ‘get things fixed’ as the application progresses. There is more information on planning permission in the next section of this blog post."
        },
        {
            "text": "We do not have a blueprint for how a children’s home should look, or what facilities are offered beyond that children have their own bedroom and family-style arrangements to eat and relax in a comfortable and safe environment, and that any official places like offices and any staff sleeping arrangements do not detract from the homeliness children need. For example, you do not need to provide a specific telephone room for children, but you would need to think about how children can have private conversations with their family, friends or any professional who is supporting them."
        },
        {
            "text": "Another cause for delay is not sending in the right paperwork. Although our online system tells you what to provide, it does not check the content. Our inspectors will only review all your documents once they get the application in stage 2. Sometimes providers send us the wrong documents, such as incorrect paperwork about planning permission. We have some sections below that will help you to send the right information."
        },
        {
            "text": "Sometimes providers try to send documents that are too big to be accepted through the online system. It is always best to send us Word documents with any photos and graphics removed because this is what usually makes them too big. We can always look at any pictures on our site visit. If you cannot make the document small enough, upload a blank document with a note that you are sending the completed document on email. Email the completed document to sc.admin@ofsted.gov.uk and make sure that you include your full name and reference number."
        },
        {
            "text": "The most common reason for delays in an SC1 being accepted is that the details provided about the organisation do not match the details on the Companies House register. Only you can confirm what information is correct, so this is an important area to get right."
        },
        {
            "text": "Sometimes the provider application comes through (SC1) and we have to wait for the people part of the application (SC2) to be sent to us. It’s a good idea to check with the individuals that they have added the SC1 application number to their SC2, and that they have had their applications accepted. Regularly check in with your individuals about how their application is progressing. We do not let you know if there are delays with their applications. Encourage all the individuals named on your SC1 form to fully complete their SC2 form and check that they have given us everything we ask for. Common reasons for their delay include:"
        },
        {
            "heading": 2,
            "text": "Making sure your documents and information are high quality"
        },
        {
            "heading": 3,
            "text": "Statement of purpose"
        },
        {
            "text": "Every application needs a statement of purpose (SOP). Make sure yours complies with Regulation 16 and Schedule 1 of the Children’s Homes (England) Regulations 2015."
        },
        {
            "text": "The SOP is where you set out a unique vision for your service, and what you want to provide and how you are going to provide it. It needs to cover all the areas set out in the regulations, and it needs to be written especially for your home. Don’t be tempted to cut and paste from someone else’s SOP. Inspectors will always check with you during your interviews that you know what your vision is, and that your vision is supported by the right policies and procedures."
        },
        {
            "heading": 3,
            "text": "Children’s guide"
        },
        {
            "text": "Your children’s guide to your service is an important document. When creating this, it is important that you have in mind the level of understanding of those who are going to read it. The type of words you use, the pictures you include, and the level of detail you go into should help every child who reads it to understand the important things about your service and what they can to do tell you something isn’t right."
        },
        {
            "heading": 3,
            "text": "Policies"
        },
        {
            "text": "It is important that the policies you have reflect your SOP and match the needs of children that you intend to care for. The best policies follow relevant government guidance, but also are tailored to the children who will be in your setting. For example, a policy to prevent bullying may look very different in a children’s home where children have special educational needs and disabilities to one in a home where children have less staff support."
        },
        {
            "heading": 3,
            "text": "Planning permission"
        },
        {
            "text": "We cannot decide about registration until you have all the planning permission you need for your home, so make sure you are ok to use the property as a children’s home. Even if you think that you don’t need planning permission, we need to see evidence from the local planning authority that this is also their view. You may already have a certificate of lawful development or evidence that the current planning permission or use class is correct, and so you can send us that with your application."
        },
        {
            "text": "If you don’t have such paperwork, get in touch with the local planning authority as soon as possible and keep chasing for a reply if you don’t hear back soon. We are not able to do this for you, and we can only accept documents that are directly from the planning authority."
        },
        {
            "text": "If you are leasing or buying a property, make sure that you understand any restriction or covenant that might limit whether you can run your home in the way that you want to."
        },
        {
            "heading": 3,
            "text": "Business plans/financial forecasts "
        },
        {
            "text": "Unless you are part of a local authority, we need a reference from your bank and a clear business plan. If your bank will not give you a reference, we need a verifiable note from the bank about why not. You must then upload this instead of the bank reference, and make sure that you have given us all the other required financial information."
        },
        {
            "text": "Believe it or not, business plans sometimes fail to include the most obvious things that must be paid for, such as staff salaries, car and travel costs and even food! You need to be realistic when forecasting income and the figures you give us need to be understandable. We will ask you about your business plan when we interview you."
        },
        {
            "heading": 3,
            "text": "Local area risk assessment "
        },
        {
            "text": "We have guidance about what we expect you to consider when you complete an assessment of risk for the area where your premises are going to be. We expect you to consider the needs of the children you are proposing to care for when you look at the local area. As with all good risk assessments, the important part is how you intend to minimise those risks."
        },
        {
            "heading": 3,
            "text": "Registered manager"
        },
        {
            "text": "Make sure that any manager who is applying to register has the right qualifications, skills, and experience for their role. Children’s homes regulations and the guide to the quality standards are very specific about that. We have no power to ignore those requirements, and so any application that does not meet them will be refused."
        },
        {
            "text": "A manager can apply to be the manager of two children’s homes if they have the skills, experience, and qualifications to oversee each home on a day-to-day basis so that children have good experiences and make progress."
        },
        {
            "heading": 3,
            "text": "Responsible individual"
        },
        {
            "text": "Although we do not register a responsible individual, this is a really important role so make sure that who you propose as responsible individual is suitably experienced and skilled. We will interview them to assess their fitness by checking whether they have the knowledge and capacity to supervise the home as defined by the children’s homes regulations and the guide to the quality standards."
        },
        {
            "heading": 3,
            "text": "Information from referees"
        },
        {
            "text": "Our guidance says that we will always want a reference from your last employer in social care, even if that was some time ago or when you were working with adults. The reference must be from the employer, and not a colleague who worked with you."
        },
        {
            "text": "The strongest applications are those that include referees who can give us an informed opinion as to whether you have the right skills and experience and know how to keep children safe."
        },
        {
            "text": "You will give us two referees, and it is best if you let them know about the request and ask them to reply promptly to our enquiries. Waiting for references to be returned is one of the major points for delay, closely followed by us having to get different references because the ones we have had back do not give us enough information. We always telephone each referee to talk about the reference."
        },
        {
            "heading": 2,
            "text": "What happens during a site visit and interviews?"
        },
        {
            "text": "Once we have received everything that we need, we will arrange to come and visit the home. During the visit, we will have a look around to check that the home is suitable. We understand that the home may not be fully equipped at the time of the visit for security reasons, but you must have enough furniture for children to live there as soon as it is registered. We have visited homes before that do not even have beds!"
        },
        {
            "text": "The visit also gives us a chance to see the local area. Sometimes we will identify risks that providers have not, and this would concern us about how thoroughly you had researched and completed the local area risk assessment. We will also look at staff sleep-in arrangements, locks on doors and any CCTV."
        },
        {
            "text": "Normally during the visit, we will interview the proposed registered manager and proposed responsible individual (sometimes, inspectors make separate arrangements to hold the formal interviews somewhere else). This is their chance to shine and demonstrate that they are suitable, so please make sure that they are ready and prepared. Inspectors will put interview questions together that relate to each applicant – we don’t use a set interview format."
        },
        {
            "heading": 3,
            "text": "Information we will ask for"
        },
        {
            "text": "We will also want to see specific documents during the visit that you have not been asked for in the original application. This is because the information we ask for at the visit is to confirm your readiness to operate and is information that you will have been gathering and completing after we have accepted your application, such as the staff you have employed. It is unlikely that we can decide about registration without this extra information as it helps us to evaluate how well children will be cared for and kept safe."
        },
        {
            "text": "Below are examples of extra information that we will always want, and inspectors will tell you before they visit if they expect anything else."
        },
        {
            "heading": 2,
            "text": "Queries about your application"
        },
        {
            "text": "We know that your application is very important to you, and sometimes you want to speak to us to ask us questions about where things are up to. Once we have sent your application to our regional team, an inspector will be allocated to your application. They will speak to you and let you know how to contact them."
        },
        {
            "text": "In the early stages, if the application website doesn’t give you the information that you need, the best way to speak to someone in our social care applications team is to send an email to sc.admin@ofsted.gov.uk, title it ‘Social care application’ and provide your full name and reference number for someone to call you."
        },
        {
            "heading": 2,
            "text": "Paying for your application"
        },
        {
            "text": "After we have everything that we need, we will tell you that we are ready to accept your application and ask you to pay the registration application fee."
        },
        {
            "text": "Until you pay the application fee, nothing happens. Only when we have the fee will we send your application to an inspector in our regional team where your proposed children’s home is located for their attention."
        },
        {
            "text": "Please make sure you have had an acknowledgement from us that we have received your fee after you have sent us it."
        },
        {
            "heading": 2,
            "text": "Preventing delays in progressing an accepted application"
        },
        {
            "text": "We have already mentioned that there are some things we prefer you to send to us at the start, but you can send us after the application is accepted. For example, you could send us a health self-declaration at the start, and later provide us with a GP health form, or you may have applied for but not yet gained planning permission. The risk for you is that without the full information, we will not be able to move to stage 3. This means that applications can get stuck in stage 2. If we are waiting for a GP health form to be returned, a planning dispute to be settled, a suitable referee to be provided or a professional conduct investigation to be concluded, we become dependent on those external agencies to provide you with the information you need to pass to us."
        },
        {
            "text": "We are unable to influence decision-making or chase that information ourselves, so it is much better if you have everything ready at the start."
        },
        {
            "heading": 2,
            "text": "Withdrawal and refusal"
        },
        {
            "text": "Once we have accepted your application, you can change your mind and withdraw it  but unfortunately, as the application process will have started, we will not be able to refund your fee. If you ask to withdraw after we have issued a notice of proposal to refuse your registration, we may not agree to allow the withdrawal if we have safeguarding concerns. Our compliance handbook has more details on this."
        },
        {
            "text": "If we refuse your application to manage a children’s home, you will become disqualified from private fostering when we write our notice of decision. This means that you cannot carry on, be concerned in the management of, have a financial interest in, or be employed in a children’s home, unless you get written consent from Ofsted. We know that there is confusion about what this means for the person who is disqualified. It certainly does not mean that a disqualified person is forever banned from working with children, but there are some steps that you or your employer will need to take if you want to work in a children’s home in future. This is called a waiver application. Our compliance handbook has more information on this."
        },
        {
            "text": "You may appeal against the notice of decision to refuse your registration. However, the disqualification will remain pending the appeal being determined."
        },
        {
            "text": "What happens when we propose to refuse your application is set out fully in our compliance handbook. "
        },
        {
            "heading": 2,
            "text": "Our registration decision"
        },
        {
            "text": "We make all our decisions about whether to register a children’s home once we have all the information that we need. We make separate decisions for the provider and for the manager. A manager in the region makes the final decision."
        },
        {
            "text": "Inspectors do not have a fixed format for registration work, and there is no scoring system to see whether you pass or fail. Our decision is based on looking at all the information we have gathered: about the vision for the home, about the people who will work there, and about the premises. You must have shown us that you can meet the regulations and quality standards from the start and that children in your care will have the best possible chance to do well."
        },
        {
            "text": "Our inspectors will not tell you what their recommendation or the outcome of the application is likely to be, nor offer any advice as to whether you should withdraw your application. The decision will be made by looking at all the information gathered and ensuring that there is enough information to help the regional manager decide whether to register you or not. We try to do this as quickly as possible and will try to let you know if there are any delays."
        },
        {
            "text": "If we decide to register you, we will send you a notice of decision and a certificate. If you want to stop operating or managing your children’s home at any time, you must complete a form called a voluntary cancellation of registration."
        }
    ]
}