{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2021/09/15/gse-returners-pack/",
    "title": "GSE Returners' Pack",
    "authors": [
        "Leon Kennedy"
    ],
    "categories": [
        "GSE Profession Updates"
    ],
    "pub_date": "2021-09-15T16:05:18+01:00",
    "content": [
        {
            "text": "The GSE profession team has launched a returners’ pack; a toolkit for recruiting managers to encourage them to consider diversifying their workforce through the development of local returners’ programmes."
        },
        {
            "text": "Returners are individuals who have been away from the workplace, typically for two years or more. There any many reasons why people take breaks from work; this may include those who have had caring responsibilities, been managing their own health conditions, had a career break or even those who are seeking a return to science and engineering after pursing an alternative career."
        },
        {
            "text": "The importance of embedding science and engineering skills throughout government has been catapulted into the public eye recently. So it’s never been more timely for us to use this to our advantage to attract a wealth of talent, skills and experience in the science and engineering field. We recognise that for some people who have been away from the work environment for an extended period, the transition back into work can be daunting, so offering a programme to assist that return can help ease that return process."
        },
        {
            "text": "Recruiting through a returners’ programme provides a supported route back to employment for individuals seeking to return to their profession. For some returners their interest in and ability to return are likely to be influenced by the level of flexibility and support provided by their employer. Having the option of applying via a returners’ programme, which allows individuals the flexibility to manage their return to work in a way that suits both them and the future employer, makes for a more positive and inclusive experience upon their re-entry to the working environment."
        },
        {
            "text": "So, calling out to managers who are seeking to fill team vacancies – choose to recruit via a returners’ programme to address your team’s skills gaps. In doing so you can help those returners utilise their existing skills and experience to confidently pursue a role, in the knowledge that having a break in work history will not be regarded as a barrier when applying for new roles."
        },
        {
            "text": "Please find the accessible GSE Returners’ pack here, on our GSE Knowledge Hub site (for civil and public servants only)."
        }
    ]
}