{
    "url": "https://deframedia.blog.gov.uk/2021/09/15/national-audit-office-report-on-future-farming/",
    "title": "National Audit Office Report on Future Farming",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Farming"
    ],
    "pub_date": "2021-09-15T15:35:51+01:00",
    "content": [
        {
            "text": "Today the National Audit Office has published a report on Defra’s Future Farming and Countryside Programme."
        },
        {
            "text": "The report focuses specifically on the management and delivery of the Environmental Land Management schemes which will set out new payments and incentives to reward farmers for farming more sustainably, creating space for nature on their land and enhancing animal welfare."
        },
        {
            "text": "The report acknowledges that Defra has made significant progress since the NAO’s last report in 2019, but also raises questions about the objectives of the schemes in the programme, long-term planning and the deliverability of the first scheme in the programme – the Sustainable Farming Incentive (SFI)."
        },
        {
            "text": "Coverage in The Times, Telegraph and the i focuses on the perceived low interest in the SFI pilot, due to start in October with 2,178 farmers expressing interest in the pilot out of a possible 44,000."
        },
        {
            "text": "We have been clear that we only needed up to 1,000 participants to successfully test the pilot approach and are pleased that more than 2,000 farmers expressed an interest."
        },
        {
            "text": "The Sustainable Farming pilot is only intended for a small number of farmers who are prepared to get involved in testing early versions of the scheme and its component parts. Most farmers will be more interested in the main scheme rollout from 2022 onwards."
        },
        {
            "text": "We are at the start of the biggest change in agricultural policy for over 50 years and we know that this marks a significant change for the way that farmers operate. They can expect more details over the coming months. We will now be considering the NAO report’s findings carefully before responding in due course."
        },
        {
            "text": "Environment Secretary, George Eustice said:"
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}