{
    "url": "https://ukhsa.blog.gov.uk/2021/09/15/what-the-health-profile-for-england-shows-us-about-the-wider-impacts-of-covid-19-on-health/",
    "title": "What the Health Profile for England shows us about the wider impacts of COVID-19 on health",
    "authors": [
        "Justine Fitzpatrick",
        "Natasha Roberts"
    ],
    "categories": [
        "Health Profile for England"
    ],
    "pub_date": "2021-09-15T13:46:01+01:00",
    "content": [
        {
            "text": "Today we have published the Health Profile for England 2021 report."
        },
        {
            "text": "The Health Profile for England report provides the most comprehensive look at the state of the nation’s health."
        },
        {
            "text": "Like in previous year’s reports, this update looks at a range of population health data, such as smoking and obesity, but it also provides an early summary of the impact of the COVID-19 pandemic on many aspects of health and health inequalities."
        },
        {
            "text": "Here we look at five important points the report makes about how the nation’s health has been affected directly and indirectly by the pandemic."
        },
        {
            "text": "In 2020, COVID-19 was the leading underlying cause of death among males, replacing heart disease, and the second largest cause of death among females after dementia and Alzheimer’s disease. By the end of June 2021, 132,053 deaths had been registered with COVID-19 mentioned on the death certificate among England residents."
        },
        {
            "text": "Between 21 March 2020 and 2 July 2021, deaths were 1.14 times higher than expected across England, based on data for the previous five years."
        },
        {
            "text": "Deaths were higher than expected in all age groups over 25 but were particularly high in those who live in deprived areas (1.17 times higher) and in the Black and Asian population (1.50 times higher), reflecting the disproportionate impact of the pandemic on these groups. This can be seen in figures 1 and 2 below."
        },
        {
            "text": "Figure 1: Cumulative excess mortality ratio, by deprivation, England, week ending 27 March 2020 to week ending 2 July 2021"
        },
        {
            "text": "Source: PHE Excess mortality in England weekly reports"
        },
        {
            "text": " "
        },
        {
            "text": "Figure 2: Cumulative excess mortality ratio, by ethnic group, England, week ending 27 March 2020 to week ending 2 July 2021"
        },
        {
            "text": "Source: PHE Excess mortality in England weekly reports"
        },
        {
            "text": "Dementia and Alzheimer’s disease remained the leading cause of death in England in females and the third largest in males. Deaths from dementia continued to increase in 2020 and dementia was reported as the main pre-existing health condition in 26% of all deaths involving COVID-19 between March and June 2020."
        },
        {
            "text": "By June 2021, there were around 35,000 fewer people aged 65 and over with a diagnosis of dementia. Although increased mortality among people with dementia during the pandemic may be a factor, this is also likely due to reduced access to services where diagnosis takes place."
        },
        {
            "text": "Very few GP referrals were made to Memory Assessment Services in the first lockdown and by September 2020 referrals were down by 25% of those expected. It is estimated that there were 10,000 missed referrals up to March 2021."
        },
        {
            "text": "During the pandemic, hospital admissions, A&E attendances and the number of GP consultations were all down, particularly in the first wave of the pandemic."
        },
        {
            "text": "Surveys show that half of people with a worsening health condition between May 2020 and January 2021 did not seek treatment, most commonly because they did not want to put pressure on the NHS or were concerned about catching COVID-19."
        },
        {
            "text": "This has meant that new diagnoses for some diseases this year were considerably down compared with previous years. This includes cancer, for which there were 16% less diagnoses between April and December 2020 than in the same months in 2019, as seen in Figure 3 below."
        },
        {
            "text": "Figure 3: Monthly new cancer diagnoses, working day adjusted, England, January 2018 to April 2021"
        },
        {
            "text": "Source: National Cancer Registration & Analysis Service, PHE COVID-19 rapid cancer registration and treatment data. Date accessed: 06/08/2021 Note: Source data may be revised in future updates. This is most likely to affect the later months in the time series."
        },
        {
            "text": "This reduced contact with health services may mean that preventative treatment has been missed but could also lead to long-term health complications and an increase in deaths in the future, meaning that we can still expect to see the impact of COVID-19 in years to come."
        },
        {
            "text": "Children’s education has been severely disrupted during the pandemic. From 23 March 2020 until June 2020, most schools in England were closed to children other than those with parents who were keyworkers or who were classed as vulnerable."
        },
        {
            "text": "Whilst the full impact of the pandemic on child health and development is still not known and will not be known for some time, initial studies suggest that children who started school in the Autumn 2020 term needed additional support when compared with children in previous academic years and that learning has suffered to some degree for most pupils and year groups, particularly primary and more disadvantaged students."
        },
        {
            "text": "Almost all schools have indicated that they are concerned about young pupils’ communication and language development, personal, social and emotional development and levels of literacy as children were not experiencing the social interactions that they usually would, such as play dates and interacting with grandparents."
        },
        {
            "text": "In 2020, one in six children aged five to 16 years were identified as having a probable mental disorder, increasing from one in nine in 2017. Children and young adults with a probable mental disorder were more likely to say that lockdown had made their life worse."
        },
        {
            "text": "There has been an unprecedented increase in alcohol-specific deaths (deaths which were caused by alcohol use), mainly due to increased alcoholic liver disease mortality. In 2020, alcohol-specific deaths increased by 20% compared to 2019. Although alcohol-specific mortality rates have been increasing in recent years, this represented a significant acceleration in the upward trend."
        },
        {
            "text": "A recent PHE report monitoring alcohol consumption and harms during the pandemic noted that the increase in alcoholic liver disease mortality was ‘likely to be due to increased consumption among an already at-risk group of heavy drinkers’."
        },
        {
            "text": "Increased mortality has impacted on life expectancy…"
        },
        {
            "text": "The high number of deaths due to COVID-19 caused life expectancy in England to fall in 2020, by 1.3 years for males to 78.7 years and 0.9 years for females to 82.7 years. This is the lowest life expectancy since 2011 for males and females."
        },
        {
            "text": "The pandemic has exacerbated existing inequalities in life expectancy by deprivation to the largest we have seen in two decades, which is as far back as our data goes. The gap between the most and least deprived areas in England in 2020 was10.3 years for males, one year larger than in 2019, and 8.3 years for females, 0.6 years larger than in 2019, as Figure 4 shows."
        },
        {
            "text": "Figure 4: Life expectancy, by sex and deprivation decile, England 2019 and 2020"
        },
        {
            "text": " "
        },
        {
            "text": "Source: PHE Wider Impacts of COVID-19 on Health (WICH) tool"
        },
        {
            "text": "COVID-19 was the cause of death that contributed most to this gap, however, higher mortality from heart disease, lung cancer, and chronic lower respiratory diseases in deprived areas remained important contributors. You can read more about how life expectancy changed in 2020 here."
        },
        {
            "text": "We will continue to monitor the impacts of the pandemic on the nation’s health as a priority as additional health data becomes available."
        }
    ]
}