{
    "url": "https://nationalscreening.blog.gov.uk/2021/09/15/why-the-uk-nsc-is-needed-now-as-much-as-25-years-ago/",
    "title": "Why the UK NSC is needed now as much as 25 years ago",
    "authors": [
        "Dr Robert Sherriff"
    ],
    "categories": [
        "General"
    ],
    "pub_date": "2021-09-15T10:45:19+01:00",
    "content": [
        {
            "text": "Back in the mid-1990s I was a junior doctor doing my training in public health medicine in East Anglia and looking for a national placement as a senior registrar."
        },
        {
            "text": "I’d seen a paper published in 1994 by Sir Kenneth Calman, the Chief Medical Officer for England, called ‘Developing screening in the NHS’. It argued that there are general principles of screening and there should be better processes to scrutinise evidence for screening and make sure that new national screening programmes do more good than harm. This might seem self-evident now but at the time all sorts of screening proposals were being made around the UK with no clear evidence base, oversight or thoughts about quality assurance."
        },
        {
            "text": "I was working in Quarry House in Leeds, as that’s where the NHS Executive HQ was based, and met with one of the regional directors of public health. We started talking about whether there was a need for a committee to make screening recommendations and he said of course there was: “It's just obvious”. But what seems obvious to us now, with the benefit of hindsight, required huge leadership from the public health experts of 25 years ago to set up."
        },
        {
            "heading": 2,
            "text": "Public health leadership"
        },
        {
            "text": "Sir Muir Gray was regional director of public health in Oxford, and Dr Pat Troop was his counterpart in Cambridge. They were inspirational public health leaders and I jumped at the chance when the opportunity came to work with them in the newly-merged Anglia and Oxford NHS region to help set up a new national body of the sort that Sir Kenneth had proposed. It was exciting to be working on a national Department of Health project."
        },
        {
            "text": "My initial priorities were to:"
        },
        {
            "heading": 2,
            "text": "The first meeting"
        },
        {
            "text": "We started the preparation in early 1996 and the UK National Screening Committee (UK NSC), as it became known, first met in July 1996. One of the crucial things was to establish the members of the committee. As is still the case, we wanted as wide representation on the committee as possible. Patient and public representation has always been important and back then we were lucky to have the journalist Polly Toynbee to represent screening consumers."
        },
        {
            "text": "I would go to the Department of Health offices in Richmond House, on Whitehall, for monthly meetings with the CMO. As a junior doctor, it was a brilliant opportunity for me to work with such experienced and important people. I still remember how plush the office was!"
        },
        {
            "text": "The first meeting, also in Richmond House (in the Cathedral room, overlooking the Cenotaph), was really about getting to know each other and establishing the processes and business of the committee."
        },
        {
            "heading": 2,
            "text": "Early priorities and milestones"
        },
        {
            "text": "One of the initial priorities was to consider prostate cancer screening, which was taking place using the PSA test in various parts of the country. Following review by the UK NSC, the Department of Health issued an executive letter in June 1997 to say the NHS should not offer screening for prostate cancer due to the potential harm that could be caused to men. This was a significant moment in terms of the committee preventing harm from existing screening activity and it set the scene for the committee to continue making important recommendations NOT to screen for conditions which were not warranted by the evidence. But the committee realised that, in the absence of screening, men needed help to make decisions about PSA testing and established the prostate cancer risk management programme."
        },
        {
            "text": "The next milestone was for bowel cancer screening. The Nottingham Bowel Cancer Screening Trial had shown that screening had great public health potential but we needed to look at how it could be implemented safely, effectively and consistently across the NHS. I was involved in setting up 2 national workshops, one in Edinburgh and the other in Cardiff, to consider all the issues relating to setting up a new screening programme. What quickly became obvious was the need for a national ‘do once and share’ approach to make sure that screening would be the same high quality everywhere in the country."
        },
        {
            "text": "After this I lost involvement with the committee for a few years while I got my first public health consultant job and then became a Director of Public Health. But I started working for Muir again in around 2004, just at the time that screening for abdominal aortic aneurysms was being considered by the committee. By now the UK NSC was really in its stride and, importantly, was focussing on screening as being a whole pathway (supported by quality assurance and effective IT systems), not just an isolated test."
        },
        {
            "text": "It felt to me that implementing the NHS Abdominal Aortic Aneurysm (AAA) Screening Programme showed everything coming together. Muir emphasised the use of standard operating procedures (SOPs) in screening to bring a level of consistency to local screening services. And we know that implementing AAA screening also had an extremely positive impact on other parts of the NHS such as vascular treatment services."
        },
        {
            "text": "By now, the committee was also constantly stressing the importance of ongoing screening programme quality. The UK NSC insisted on quality assurance as part of screening programmes to ensure they continue to improve, to minimise the chance of things going wrong and to learn from them if they do."
        },
        {
            "heading": 2,
            "text": "What’s next"
        },
        {
            "text": "Looking over the last 25 years, I feel that the role of the committee is still fundamentally the same: to systematically assess the evidence and make the best possible recommendations to ministers so that money is spent effectively on screening programmes that will help the most people possible. But over that time, the committee has evolved and developed better, more rigorous processes for achieving that."
        },
        {
            "text": "The current recruitment drive shows that the committee will have even greater expertise to call on in future. I hope that in another 25 years, we’ll be looking back on an even more significant role for the UK NSC in supporting the public health of the UK."
        },
        {
            "text": "In the first UK NSC annual report, Sir Kenneth and the other CMOs wrote:"
        },
        {
            "text": "The same thing could equally be written today."
        },
        {
            "heading": 2,
            "text": "UK NSC blog"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK National Screening Committee. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, please contact the UK NSC helpdesk."
        }
    ]
}