{
    "url": "https://naturalengland.blog.gov.uk/2024/08/08/clarifying-the-facts-tagging-of-hedgehogs-and-licensing-requirements/",
    "title": "Clarifying the Facts: Tagging of hedgehogs and licensing requirements",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Biodiversity",
        "Licensing",
        "Monitoring",
        "Natural England",
        "Nature Recovery",
        "Protected sites and species",
        "Science and evidence",
        "Species recovery",
        "Uncategorized",
        "Wildlife"
    ],
    "pub_date": "2024-08-08T16:05:15+01:00",
    "content": [
        {
            "text": "There has been some misinformation on social media recently regarding the tagging of hedgehogs to enable identification of individuals. This blog post from Natural England aims to set the record straight and provide clarity on this important issue."
        },
        {
            "text": "Background"
        },
        {
            "text": "Marking a hedgehog by glueing coloured or other identifying pieces of plastic tubing to some of their spines is typically done for research and conservation purposes. This enables individual identification and subsequent monitoring of health, growth and behaviour."
        },
        {
            "text": "Plastic tubing is a preferred method because it is lightweight, non-toxic, and can be easily attached to the hedgehog's spines without causing discomfort or hindrance. It is a practical and humane way to achieve research and conservation goals."
        },
        {
            "text": "A licence is not required from Natural England to tag a hedgehog with plastic tubing, as long as other factors related to their capture and welfare have been followed as described below."
        },
        {
            "heading": 3,
            "text": "Understanding the legislation relating to hedgehogs"
        },
        {
            "text": "Wildlife and Countryside Act (1981)"
        },
        {
            "text": "Hedgehogs have some legal protection through listing on Schedule 6 of the Wildlife and Countryside Act (1981). https://www.legislation.gov.uk/ukpga/1981/69/schedule/6)"
        },
        {
            "text": "Section 11 of the Act includes legal measures to safeguard hedgehogs (https://www.legislation.gov.uk/ukpga/1981/69/section/11#:~:text=11%20Prohibition%20of%20certain%20methods%20of%20killing%20or%20taking%20wild%20animals. These include (this is not an exhaustive list) prohibiting the use of traps, snares, nets as well as the use of artificial lights, mirrors, or other dazzling devices to kill or capture hedgehogs."
        },
        {
            "text": "Licences are issued by Natural England to researchers who are studying these animals to enable them to catch hedgehogs safely and legally."
        },
        {
            "text": "There is no prohibition on marking or attaching a tag to a hedgehog, so this is not an activity that requires a licence. Where we issue licences to researchers to use prohibited methods (such as a trap or artificial illumination device) we may refer to tags and marking in licence notes to encourage good practice and avoid adverse welfare outcomes."
        },
        {
            "text": "Animal Welfare Act 2006"
        },
        {
            "text": "Hedgehogs that have been caught, marked and tagged are also protected by the provisions of the Animal Welfare Act 2006. We have produced a guidance note explaining the responsibilities of people catching wild animals (see Wildlife management advice note: The animal welfare act 2006 - what it means for wildlife (publishing.service.gov.uk ). An offence could be committed if marking or tagging compromised the welfare of a hedgehog. It is a condition of Natural England licences, that licensees comply with this legislation."
        },
        {
            "text": "When hedgehogs are taken into care, the Animal Welfare Act 2006 provides further guidance on tagging:"
        },
        {
            "text": "The Wild Mammals (Protection) Act 1996"
        },
        {
            "text": "Hedgehogs also receive protection under the Wild Mammals (Protection) Act 1996 ( https://www.legislation.gov.uk/ukpga/1996/3/contents  ), which prohibits any cruel treatment of wild mammals."
        },
        {
            "text": "Safe Tagging Methods"
        },
        {
            "text": "Using heat shrink tubing or other appropriate lightweight tubing attached with superglue to a hedgehog’s spines is a useful and minimally invasive method for identifying individuals. This method is safe and unobtrusive, meaning it is not an activity that requires a licence from Natural England, as long as the hedgehog has been caught appropriately, and is handled with care."
        },
        {
            "text": "Natural England is also aware of projects which use small lightweight radio transmitters glued to the spines of hedgehogs so researchers can track their movements to understand more about hedgehog behaviour. Again, providing hedgehogs have been caught appropriately and the tags pose no welfare concern, this is not an activity which requires a licence from Natural England."
        },
        {
            "text": "Conclusion"
        },
        {
            "text": "It's important to rely on accurate information and legislation when it comes to wildlife conservation. Appropriate tagging of hedgehogs, when done correctly, is a safe practice that helps us monitor and protect these wonderful creatures."
        },
        {
            "text": "Get Involved"
        },
        {
            "text": "We encourage everyone to stay informed and support hedgehog conservation efforts. If you come across misinformation, please share this blog to help spread the facts."
        },
        {
            "text": "Natural England is supporting the National Hedgehog Monitoring Programme in partnership with the Peoples Trust for Endangered Species and The British Hedgehog Preservation Society. For the first time, this survey will enable robust estimates of hedgehog populations in different habitats across the country, show how these are changing year on year, and, in time, give a national estimate of Britain’s hedgehog population. The new project utilises sophisticated, cutting-edge artificial intelligence, which is a world-first in hedgehog conservation. For an opportunity to get involved, please see https://ptes.org/campaigns/hedgehogs/nhmp/"
        },
        {
            "text": "For further information about the information contained in this blog please contact: enquiries@naturalengland.org.uk"
        },
        {
            "text": " "
        }
    ]
}