{
    "url": "https://digitaltrade.blog.gov.uk/2024/08/08/how-working-in-cycles-and-rhythms-of-nature-reflects-in-our-product-lifecycle-framework/",
    "title": "How working in cycles and rhythms of nature reflects in our Product Lifecycle framework",
    "authors": [
        "Andy Revell, Product Manager, Trade Support Services",
        "Madeline Lasko, Service Owner"
    ],
    "categories": [
        "Products"
    ],
    "pub_date": "2024-08-08T14:28:43+01:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "Andy Revell"
        },
        {
            "text": "I work in the Trade and Regulatory Services portfolio at DBT as a Product Manager.  The portfolio supports businesses and workers to understand, engage and comply with domestic and international regulations, so that they are able to benefit from trade opportunities and domestic business and worker protections."
        },
        {
            "text": "Our team works in lifecycle frameworks to manage the many digital products and services across DBT. "
        },
        {
            "text": "What do you mean by product lifecycle framework? "
        },
        {
            "text": "The world of digital services follows similar patterns to the cycles and rhythms of nature. Take for example, the lifecycle of a plant with flowers. Flowering plants generally follow 5 key stages of germination, growth, flowering, seed formation and decline. "
        },
        {
            "text": "Digital products and services generally follow a ‘Product Lifecycle’ framework. This starts with an idea and progresses through 5 distinct stages - development, introduction, growth, maturity, and decline. There are several ways of defining and describing the product lifecycle. When developing services on GOV.UK, we follow the Service Standard which includes researching, designing and building services through the phases of Discovery, Alpha, Beta, Live and Retirement. "
        },
        {
            "text": "Why is it needed? "
        },
        {
            "text": "A digital product lifecycle allows product teams to frame the stage their product is at and plan accordingly. The mindset and the tools and techniques are different depending on the stage. Just as the techniques and tools for managing plants throughout their natural lifecycle differ. "
        },
        {
            "text": "How does it work? "
        },
        {
            "text": "Digital product lifecycle management is about ensuring that the service is meeting the needs of users. This is based on user feedback, research, and market changes. The aim is to ensure the service is relevant and creates value for users and the organisation. "
        },
        {
            "text": "At DBT we have developed and grown as a department. User needs change over time and the products and services we provide for both internal and external users need to change too. "
        },
        {
            "text": "Much is said about bringing new products to market and the innovation of existing products with technological advancements. Whilst these are exciting and important, it is also vital to take bold steps to review the strategy and withdraw a product or service when it is no longer used, nor providing sufficient value to the organisation. "
        },
        {
            "text": "Madeline Lasko"
        },
        {
            "text": "We ‘sunset’ 2 services recently that no longer provided value for money. These were the ‘Resilience Tool’ - designed to collate and visualise data on critical supply chains, and the ‘Trade with the UK’ service which enabled overseas companies to view tariffs and regulations that apply when bringing goods into the UK. In both cases, use of the services had declined since they were first launched, and we were able to meet the user needs through other means. "
        },
        {
            "text": " "
        },
        {
            "text": "How we ‘sunset’ these services "
        },
        {
            "text": "For the Resilience Tool, the team's ongoing requirements could be met through a simple dashboard on Data Workspace - DBT’s central reporting and analysis platform. For Trade with the UK, it was through HMRC’s Trade Tariff service which had evolved to cover the user needs we had identified. This included information on how ‘rules of origin’ apply to goods being brought into the UK. "
        },
        {
            "text": "The ‘sunset’ process is not just switching off and storing data. It is informed by the assessment of the product in the market, performance and operational metrics. We review the user needs and produce a clear communication plan for stakeholder engagement and sign off.  "
        },
        {
            "text": "To follow the analogy of the plant lifecycle, we remove plants as they start to wither. "
        },
        {
            "text": "What were the outcomes?  "
        },
        {
            "text": "Actively managing products and services through the product lifecycle helps rationalise portfolios and prioritises services which provide value for money for taxpayers. It also provides resources for higher priority projects and importantly gives teams focus. A reduced number of services provides clarity to work on services which will have the greatest impact. On a personal level, I find ‘clearing the decks’ and sunsetting services gives a mental clarity and prevents unnecessary legacy services. "
        },
        {
            "text": "Summary "
        },
        {
            "text": "Here at DBT, we provide digital services that promote business and trade and support the UK’s interests around the world. This is live digital product and service management with a clear purpose towards economic prosperity.  "
        },
        {
            "text": "We work as part of a multi disciplinary team to solve user need based problems and achieve business goals. "
        }
    ]
}