{
    "url": "https://environmentagency.blog.gov.uk/2024/08/08/protecting-the-south-humber-coastline/",
    "title": "Protecting the South Humber coastline",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Climate change"
    ],
    "pub_date": "2024-08-08T12:56:18+00:00",
    "content": [
        {
            "text": "Mark Adams from the Partnerships and Strategic Overview coastal team talks about progress on strengthening flood defences in North East Lincolnshire."
        },
        {
            "text": "Last year our team began work on a three-year project to improve 4.5km of coastal defences between the Ports of Immingham and Grimsby on the south Humber bank."
        },
        {
            "text": "Stallingborough’s coastal defences were originally built following devastating floods in 1953. They are now at increasing risk of damage from rising sea levels and more frequent storms. The work on the defences will benefit 2,400 properties, nationally important infrastructure and vital infrastructure."
        },
        {
            "text": "After 4 years in development, work is starting to step up a gear as the project moves into its second year of construction."
        },
        {
            "text": "What work is happening this year?"
        },
        {
            "text": "One of the big pieces of work this year will be to place more rock armour onto the existing sea-defence. Rock armour is key tool that we use to help strengthen our coastal flood defences. It’s size and strength in resisting waves and erosion from the sea mean it can help the defences protect the coast for at least a further 25-years and can be re-used beyond this period."
        },
        {
            "text": "It is sourced sustainably with around 80% being transported by barge from Oban in Scotland, which significantly reduces carbon compared with road transportation. The rock armour is also an adaptable material meaning it  can be moved around the defences as necessary in the future to ensure it retains its strength. This may include building the armour up higher or wider in some places as required without having to install further materials."
        },
        {
            "text": "This work will continue throughout the summer between the Middle Drain and the former Novartis plant. At the same time work will also be carried out to refurbish another 1.5km of defences further south east, to extend the life of the existing stone and concrete revetment."
        },
        {
            "text": "Refurbishment will also be taking place on what is known as gravity outfall culverts along the defence. Gravity outfall culverts are used to allow surface water through tunnels and out into the into the estuary, whilst preventing the incoming tide from puncturing the defences. The culverts will be inspected, desilted and repaired as needed with additional repairs set to be carried out to other parts of the structure at the same time. Improvements are being made to maintenance access and extra resilience measures."
        },
        {
            "text": "Throughout the project we will be continuing to work closely with our partners at North East Lincolnshire Council and North East Lindsey Drainage Board as well as landowners."
        },
        {
            "text": "What happens next?"
        },
        {
            "text": "We will continue to carry out work into Autumn 2025, when we will again stop the defence work during the ecological sensitive winter period. The schedule for our third year currently includes the completion of the gravity outfalls work as well as landscaping and habitat works in the area."
        },
        {
            "text": "Whilst we carry out work with our contractors Jacksons the bridleway along the crest of the flood embankment will be closed."
        },
        {
            "text": "Further information"
        },
        {
            "text": "Subscribe to updates from the Environment agency or follow us on X"
        },
        {
            "text": " "
        }
    ]
}