{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2024/08/08/royal-society-pairing-scheme-2024/",
    "title": "Royal Society Pairing Scheme 2024",
    "authors": [
        "gseprofession"
    ],
    "categories": [
        "Blog Series",
        "GSE Offer",
        "GSE Opportunities",
        "Guest Blog"
    ],
    "pub_date": "2024-08-08T16:44:31+01:00",
    "content": [
        {
            "text": "This year, The Royal Society Pairing Scheme took place in March and provided policymakers and research scientists an opportunity to experience a different working environment. To do this, 30 research scientists each year are paired with UK parliamentarians and civil servants. They learn about each other’s work by spending time together in Westminster and the researcher’s institutions. "
        },
        {
            "text": "Following the longstanding collaboration between government and the Royal Society, the scheme gives research scientists an opportunity to shadow policymakers, providing an insight into how academic research can help inform decision making. The scheme also helps to build connections and develop a better understanding of how research scientists and policymakers can support one another."
        },
        {
            "heading": 4,
            "text": "Eunice Wong, a participant in this year’s scheme, shares her thoughts on the experience: "
        },
        {
            "text": "“As a Senior Research Advisor in the Office for Product Safety and Standards, my role involves working with deep specialists outside of government ranging from academia to industry.  "
        },
        {
            "text": "When I saw the Royal Society Pairings Scheme with GO-Science being advertised in the GSE Newsletter, I knew I wanted to apply.  "
        },
        {
            "text": "The scheme provided me an opportunity to widen my network by engaging with different scientists and gaining an understanding of the research challenges that are faced in both academia and government.  "
        },
        {
            "text": "My day visiting The Royal Society and engagement with my scientist pair, George, from UK Dementia Research Institute, further deepened my understanding of how science and policy overlap in different ways.  "
        },
        {
            "text": "I identified the importance for us as policy makers to communicate with scientists from all different levels, ensuring a wide evidence base to inform on regulations and policy making.  "
        },
        {
            "text": "I also thoroughly enjoyed meeting other scientists and engineers in different government departments and learning from their experience. I would encourage anyone who shared the goal of using science for policy to apply for the scheme.” "
        },
        {
            "heading": 3,
            "text": "Applying for the scheme  "
        },
        {
            "text": "Next year’s Pairing Scheme will be held over a week in March 2025 (dates to be confirmed).  "
        },
        {
            "text": "The ‘Week in Westminster’ will see participating civil servants hearing from invited speakers, engaging in events and workshops, and arranging shadowing time for their pair in their home department. You will then be invited to a reciprocal visit at the scientist’s home institution to learn more about their work in person.  "
        },
        {
            "text": "Applications open in September 2024.  "
        },
        {
            "text": "For more information on the Pairing Scheme, please visit the Royal Society website.  "
        }
    ]
}