{
    "url": "https://defraenvironment.blog.gov.uk/2024/08/08/scottish-and-southern-electricity-networks-powers-up-nature-recovery-by-backing-projects-for-nature-with-250000/",
    "title": "Scottish and Southern Electricity Networks powers up nature recovery by backing Projects for Nature with £250,000",
    "authors": [
        "Justin Francis"
    ],
    "categories": [
        "Green finance",
        "Nature"
    ],
    "pub_date": "2024-08-08T09:36:11+01:00",
    "content": [
        {
            "text": "I’m Justin, the Chairperson for Projects for Nature. We’re thrilled to welcome Scottish and Southern Electricity Networks (SSEN) as a founding business partner and the first utility company to support Projects for Nature. "
        },
        {
            "text": "As we explained in a previous blog post, Projects for Nature is accelerating nature recovery by connecting businesses with screened nature restoration projects across England. "
        },
        {
            "text": "Through Projects for Nature, SSEN is providing almost £250,000 to 2 projects in their licence area: the restoration of 24 hectares of woodland in Somerset and 11 hectares of fen in Oxfordshire. "
        },
        {
            "text": "Restoring farmland and fens"
        },
        {
            "text": "SSEN’s funding represents the largest ever one-off contribution to Heal Rewilding, a national nature recovery charity. They have given over £166,000 for the regeneration of 24 hectares of woodland within the charity’s first rewilding site, a 460-acre former dairy farm near Bruton."
        },
        {
            "text": "The funding will enable the charity to install deer fencing around the perimeter of the Northern Fields area to control the impact of deer on saplings, new scrub plants and returning native flora. "
        },
        {
            "text": "The fencing will also enable ‘ecosystem engineer’ livestock – pigs, cattle and ponies – to be introduced in the future. They will help to accelerate nature’s recovery by rootling, grazing, browsing and seed-spreading in the fields. "
        },
        {
            "text": "Heal Rewilding are working with ecologists from Providence Ecological to ensure that other wildlife can pass through the fencing, because the Northern Fields are already criss-crossed with long-established wild animal paths. "
        },
        {
            "text": "SSEN has also provided nearly £77,000 to national wildlife conservation charity Freshwater Habitats Trust. Their donation will be used to restore 11 hectares of alkaline fen bordering a Site of Special Scientific Interest in Oxfordshire. "
        },
        {
            "text": "Alkaline fens support a wide array of wetland species – some of which are very rare and not found anywhere else. They are extremely important for UK biodiversity, but are vulnerable to encroachment from trees and shrubs, and can get dried out by land conversion.  "
        },
        {
            "text": "SSEN’s funding will help rewet this vulnerable area, building on Freshwater Habitats Trust’s ongoing commitment to restoring these declining habitats. It is also a significant boost for the Freshwater Network’s plan to create a national network of wilder, wetter, cleaner and more connected habitats to revitalise freshwater biodiversity. "
        },
        {
            "text": "Businesses contributing to change  "
        },
        {
            "text": "Nature recovery projects often rely on different revenue streams, and corporate donations can be a vital part of that. Projects for Nature mobilises this support by bringing together businesses, land managers and environmental stewards on a common platform.  "
        },
        {
            "text": "The initiative has already seen some significant early wins since its launch in December at COP28. For example, Lloyds Banking Group committed £250,000 to 3 flagship projects to create habitat corridors, reduce flood risk through nature-based solutions and restore wetlands. "
        },
        {
            "text": "Multi-stakeholder collaboration is crucial as we face escalating climate and biodiversity crises. We also need to improve nature locally to benefit communities. Projects for Nature provides a model for harnessing businesses' resources and accelerating environmental stewardship at scale. "
        },
        {
            "text": "We are calling on more corporate leaders to register their interest in supporting this national movement. By pooling expertise and funding, we can begin to regenerate nature across England – creating a more resilient future for businesses, communities and all living creatures. "
        }
    ]
}