{
    "url": "https://services.blog.gov.uk/2024/08/08/services-week-2024-in-review/",
    "title": "Services Week 2024 in review",
    "authors": [
        "Ella Boyer - Senior Communications and Events Manager, CDDO",
        "Marc O’Connor - Lead Service Designer, HMRC",
        "Andy Jones - Head of Profession for Design, DFE",
        "Kara Kane – Head of Profession for Design, GDS",
        "Angie Dickinson, Senior Communications Manager, CDDO",
        "Dani Wise - Content Designer, DWP",
        "Lisa Jeffery – Design Manager, Defra"
    ],
    "categories": [
        "Events",
        "Service transformation"
    ],
    "pub_date": "2024-08-08T15:27:06+01:00",
    "content": [
        {
            "text": "Services Week, the annual event series run by the Government Digital and Data community for people working in the UK public sector, grew in reach again this year. An estimated 5,000 participants took part in Services Week 2024, over 62 sessions run by people from 29 different organisations. "
        },
        {
            "text": "As always, Services Week enabled participants to ‘look sideways’ at what else is happening across the public sector. Together, we grew our skills, knowledge and networks to improve the design and delivery of public services.  "
        },
        {
            "text": "This year, sessions involved local and central government, health bodies, businesses and charities. Themes ranged from teams and sustainability to data and AI, and many sessions were attended by more than 100 participants.  "
        },
        {
            "text": "Some session recordings were uploaded to a playlist, and write-ups were shared on the #ServicesWeek channel on the UK government Slack. For example, the Department for Education published Making the service assessment process easier and more consistent. We also hope to publish more blog posts here to document sessions and outcomes. "
        },
        {
            "text": "To further understand the impact of Services Week 2024, we asked session organisers and participants to recap and share their views. "
        },
        {
            "heading": 2,
            "text": "How was it for you? "
        },
        {
            "text": "Said Dom Billington, Senior Content Designer at the Ministry of Justice (MoJ):"
        },
        {
            "text": "“I ran a session at Services Week to share our insights from redesigning an internal staff-facing service at the MoJ. It was great to see how many people were interested in improving cross-government collaboration on designing internal services. This has already led to knowledge-sharing with other departments and we’re now organising a new community focused on designing internal services.”"
        },
        {
            "text": "Moza Ackroyd, Business Analyst, Fast Stream, Department for Work and Pensions (DWP), who attended DWP sessions and Defra’s ‘Greener Services Hack Day’ said:  "
        },
        {
            "text": "“Services Week 2024 was my first Services Week, and I found it eye-opening and encouraging. I saw a sample of how much consideration goes into service design, which can best serve people and the planet. Now, I feel even better equipped to create services that bring together best practices from examples that people shared during the week. Also, Services Week highlighted that it is important not to be complacent and to keep iterating service design as an individual and more widely, with changing times and increased experience.” "
        },
        {
            "text": "Ezequiel Serrano, Senior Service Designer at the Department for Culture, Media and Sport (DCMS), reflected:"
        },
        {
            "text": "“This was the second year that DCMS took part in Services Week, where we ran a case study session on designing with policy which was attended by over 120 participants from across government. Setting up the event was simple and straightforward thanks to the guidance and support provided by the organisers. Taking part in Services Week also helped us to connect with other organisations facing similar challenges, and we're looking forward to continuing building those relationships in the future.”"
        },
        {
            "text": "Priyanca D'Souza, Senior User Researcher at Government Digital Service (GDS) said:"
        },
        {
            "text": "“If you have an idea for Services Week, go for it! I've been joining these sessions for years, but this is the first event I've co-organised and facilitated for Services Week. I wanted to raise the representation of ‘accessibility’ on the agenda and make the session interactive where the participants can actively shape what we discuss. Designing and developing services which are as inclusive as possible is challenging and I wanted to reinforce to attendees that there are peers out there in other organisations tackling similar challenges. "
        },
        {
            "text": "“It's been so rewarding to bring people together, we had so much interest I had to close the form early. The maturity and quality of the discussions were fantastic and people want us to do more events on inclusive design and accessibility. It was also fab to collaborate closely with the brilliant accessibility team on GOV.UK One Login, Shaun and Derren.”"
        },
        {
            "text": "Marc O’Connor, Lead Service Designer at HM Revenue and Customs (HMRC) recapped:"
        },
        {
            "text": "“This is the fourth year in a row that we have run the ‘Introduction to Service Design’ training remotely as part of Services Week and the first time that we have run 2 sessions during the week. Due to this increased capacity we were able to facilitate the training for 34 individuals over the week from 20 different central and local government departments, our largest remote audience to date. "
        },
        {
            "text": "“Here are some of the key takeaways from our participants: ‘I'm now vastly more informed of the methodology and language of service development and delivery’, ‘the importance of continuous zooming in/out of service’, ‘good service design requires a village’ and ‘even complex systems can be broken down into understandable processes with the right tools’.” "
        },
        {
            "heading": 2,
            "text": "Services Week 2025 "
        },
        {
            "text": "Each year, Services Week is supported by an organising group made up of civil servants from different departments. The group meets weekly in the months leading up to the event series to co-design the approach to Services Week.  "
        }
    ]
}