{
    "url": "https://defrafarming.blog.gov.uk/2026/01/26/using-local-nature-recovery-strategies-to-guide-on-farm-decisions/",
    "title": "Using Local Nature Recovery Strategies to guide on-farm decisions",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Farming across the UK"
    ],
    "pub_date": "2026-01-26T10:33:51+00:00",
    "content": [
        {
            "text": "Local Nature Recovery Strategies (LNRSs) are locally developed plans that bring together ecological evidence, land use data and local knowledge. They show where nature recovery is most needed and most likely to succeed. "
        },
        {
            "text": "LNRSs are existing plans, published online, so they are a ready-made resource farmers can use to help plan a profitable, sustainable business. "
        },
        {
            "text": "Each strategy is published under your local authority. You can find out who your local authority is by using this map of LNRS areas. "
        },
        {
            "text": "Your LNRS can help you: "
        },
        {
            "text": "Each LNRS includes a local habitat map that shows where: "
        },
        {
            "text": "Each LNRS is created by local authorities working closely with farmers, landowners, environmental groups and community organisations."
        },
        {
            "text": "By working together and sharing local knowledge, LNRSs can help support resilient farm businesses, healthier landscapes and a countryside that continues to produce food while delivering benefits for nature. "
        },
        {
            "text": "Whether you’re looking to improve soil health, manage flood risk, diversity income or plan future environmental activity, your LNRS can help you decide what to do. "
        },
        {
            "heading": 2,
            "text": "Case studies"
        },
        {
            "heading": 3,
            "text": "Cheshire: turning local priorities into action"
        },
        {
            "text": "In Cheshire, more than 400 farmers and landowners have pledged 30,000 hectares, around 12.5% of the county, towards nature recovery."
        },
        {
            "text": "This growing network shows how Local Nature Recovery Strategies can help farmers identify practical, locally relevant nature-based solutions to shared challenges. "
        },
        {
            "text": "Like many rural areas, Cheshire faces growing pressure from increasing flood risk and significant biodiversity loss. This includes the loss of 99% of species-rich grassland since the 1930s. These challenges directly affect soil health, food production, flood risk to communities and long-term farm viability. "
        },
        {
            "text": "Through the LNRS process, these challenges have become opportunities for farmers to shape nature-based solutions.  "
        },
        {
            "text": "One of the challenges this area is facing over the next 10 years is low water availability. One of the solutions proposed in the Cheshire and Warrington LNRS is the Weaver-Gowy water and wildlife blended finance model.  "
        },
        {
            "text": "This is a private investment and natural capital scheme that will be paid for by a range of stakeholders with an interest in water quality and availability, carbon sequestration, nature restoration and high-quality farm produce.  "
        },
        {
            "text": "Farmers will be paid to restore habitats, like wetlands, to reduce flood risk and improve water availability for the surrounding area. "
        },
        {
            "text": "This approach delivers environmental benefits and supports wider economic growth. It provides water for housing and industry and helps communities and businesses become more climate resilient. "
        },
        {
            "text": "The process of creating the LNRS brought some farmers and land managers together for the first time. To continue collaborating on the strategy, they created the Future Farmers Group, which will: "
        },
        {
            "text": "The Hedgerow Recovery Scheme, which has emerged from the strategy and the Future Farmers Group, focuses on improving field boundaries and margins."
        },
        {
            "text": "It will re-establish hedgerows that were removed from the landscape in the 1970s and provide margins for pollinators through wildflower corridors."
        },
        {
            "text": "The dense root systems of hedges and the vegetation in margins can help anchor the soil, preventing wind and water erosion. This preserves fertile topsoil, reduces water runoff and can help increase yields, while also supporting wildlife. "
        },
        {
            "text": "If you’d like to get involved with the LNRS in Cheshire, contact:  naturesrecovery@cheshirewestandchester.gov.uk "
        },
        {
            "heading": 3,
            "text": "Dorset: shaping an LNRS around farm businesses"
        },
        {
            "text": "With around 70% of Dorset classified as farmland, farmers and landowners played a central role in shaping the county’s Local Nature Recovery Strategy from the start. "
        },
        {
            "text": "Farming representatives and farmer clusters worked closely with Dorset Council through a steering and advisory group, helping ensure the strategy reflected on-farm priorities and practical delivery. "
        },
        {
            "text": "The Dorset LNRS local habitat map was created from 110 proposals from land managers and projects - which included farmer clusters, individual farms and landowners, and landscape recovery projects. This helped ground it in local knowledge and opportunity.  "
        },
        {
            "text": "To support delivery, Dorset Council is strengthening collaboration through the Nature Recovery Dorset network, which already has 300 members, including 83 from the farming sector. "
        },
        {
            "text": "The council is also exploring how the cluster approach could support county farm tenants to deliver environmental actions. "
        },
        {
            "text": "In the video above, advisory group member Sam Vincent explains how collaboration on issues such as water quality and flood management can support both nature recovery and business resilience."
        },
        {
            "text": "If you’d like to get involved with the LNRS in Dorset, email: contactLNRS@dorsetcouncil.gov.uk"
        },
        {
            "heading": 2,
            "text": "Learn more "
        },
        {
            "text": "Local Nature Recovery Strategies are not about telling you how to manage the land you farm. They bring together local evidence, experience and opportunity, so decisions about nature recovery make sense for individual businesses and the wider landscape. "
        },
        {
            "text": "Whether you are already taking environmental action, thinking about your next steps, or interested to know what is happening locally, your LNRS can help you see where opportunities exist and where collaboration could add value. "
        },
        {
            "text": "Over half of the 48 LNRSs are now published. All will be available this year. "
        },
        {
            "text": "Even a short conversation can help you understand what support, funding or partnerships may be available now or in the future. "
        }
    ]
}