{
    "url": "https://traderemedies.blog.gov.uk/2022/06/27/a-history-of-trade-remedies-in-the-uk-from-alarm-clocks-to-ironing-boards/",
    "title": "A history of trade remedies in the UK: from alarm clocks to ironing boards",
    "authors": [
        "Ilona Serwicka, Economic Adviser"
    ],
    "categories": [
        "Analysis"
    ],
    "pub_date": "2022-06-27T12:54:59+01:00",
    "content": [
        {
            "text": "What do mechanical alarm clocks, ladies’ raincoats, butter, rainbow trout and ironing boards have in common? The answer: trade remedies, i.e. duties on imports of these goods into the UK."
        },
        {
            "heading": 3,
            "text": "UK trade remedies after EU exit"
        },
        {
            "text": "The UK’s Trade Remedies Authority (TRA) investigates whether trade remedy measures are needed to counteract unfair import practices like dumping or subsidisation and surges in imports. Trade remedies usually take the form of tariffs on imports of certain goods:"
        },
        {
            "text": "The TRA, which was established on 1 June 2021 has been conducting trade remedy investigations since the UK’s exit from the EU on 31 January 2020. Prior to that, the European Commission conducted trade remedy investigations on behalf of the UK (and other EU Member States)."
        },
        {
            "text": "The TRA’s ongoing investigations include a number of industrial products manufactured by the steel, aluminium and glass sectors. The TRA has initiated four new investigations: an aluminium extrusions anti-dumping investigation, optic fibre cables and an ironing boards anti-subsidy investigation."
        },
        {
            "heading": 3,
            "text": "UK trade remedies until the 1970s"
        },
        {
            "text": "The UK is not a complete newcomer to the world of trade remedies. The Board of Trade, which was established in the UK in 1786 and existed until 1970, conducted the UK’s first trade remedy investigations and imposed the UK’s first trade remedy measures in 1958."
        },
        {
            "text": "The use of trade remedies has been debated even before this. The first ever reference to ‘anti-dumping’ in a UK parliamentary debate was made by Winston Churchill on 29 March 1904. In his speech, Churchill referred to \"the mysterious words 'retaliation' and 'anti-dumping'\", and questioned what dumping was and what comprised anti-dumping:"
        },
        {
            "text": "Anti-Dumping (No. 1) Order, 1958 imposed the UK’s first anti-dumping tariffs on 7 January 1958: anti-dumping duty of 4s. per lb. on polymethylsiloxane fluids (commonly known as silicone fluids) originating in France and produced by Societe des Usines Chimiques Rhone-Poulenc. This investigation found that the British silicone industry was suffering material injury caused by the dumping of silicone fluids."
        },
        {
            "text": "Sir David Eccles, the President of the Board of Trade, explained to the Members of the House of Commons that:"
        },
        {
            "text": "The Board of Trade conducted at least 15 anti-dumping investigations. Its successors – the Department of Trade and Industry (1970-74) and the Department of Trade (1974-83) – conducted at least further 35 anti-dumping investigations. These investigations looked at a variety of products ranging from silicone fluids, through butter, to mechanical alarm clocks."
        },
        {
            "text": "Anti-subsidy investigations have been rarer than anti-dumping investigations in the past. The Board of Trade, and its successors, conducted at least two anti-subsidy investigations."
        },
        {
            "text": "The Countervailing Duty Order, 1968, imposed the countervailing duty of £1 4s. 3d. per cwt. on domestic, electrically-operated refrigerators with a storage capacity not exceeding 12 cubic feet originating in Italy (Italian refrigerators). This investigation examined both alleged dumping and/or subsidisation of Italian refrigerators. It found that \"export subsidy (…) had caused, and threatened further, material injury to the domestic refrigerator industry in the United Kingdom, and that countervailing action against it would be in the national interest\" but found no evidence that Italian refrigerators had been dumped. Another anti-subsidy investigation considered imports of men’s moccasins and boots originating in Brazil, and resulted in the imposition of a countervailing duty rate of 8% in 1976."
        },
        {
            "text": "The UK acceded to the European Communities (EC) on 1 January 1973. Temporarily the UK continued to conduct its own trade remedy investigations and deal with cases of dumped imports originating in countries outside the EC under its national legislation."
        },
        {
            "text": "Under the provisions of Article 133 of the Treaty of Accession, on 1 July 1977 (the end of the transition period) the UK handed the competency to conduct trade remedy investigations to the Commission of the EC that acted on behalf of the existing members of the European Coal and Steel Community (ECSC). Anti-dumping duties which were imposed by the UK and which were in force on 30 June 1977 did not expire ipso facto on 1 July 1977. The Anti-Dumping Unit of the UK’s Department of Trade, which at the beginning of 1977 had 26 staff, temporarily continued to operate beyond the transition of trade remedy competencies from London to Brussels."
        },
        {
            "text": "Below we include a list of some of the anti-dumping and anti-subsidy investigations conducted by the UK until 1977."
        },
        {
            "text": "As part of our analysis we looked at digitised pieces of legislation but also reports of UK parliamentary debates from Hansard. It is difficult to tell how complete our list of 40 anti-dumping investigations and two anti-subsidy investigations is: a lot of the older legislation has not been digitised."
        },
        {
            "text": "We also believe that there are likely to be other anti-dumping and anti-subsidy investigations that may have initiated but which resulted in no imposition of anti-dumping and countervailing measures. For example, the Department of Trade started an investigation into allegations of the dumping of men's footwear by Poland in 1976 but it had obtained a satisfactory undertaking on the future price levels of men's leather sandals from Poland and did not impose anti-dumping duties. There may have also been cases where UK industry called for trade remedy measures but where the UK never opened an investigation: for example, the case of the Soviet manufactured Christmas cards."
        },
        {
            "text": "We invite anyone reading this blog to get in touch and help us identify other cases and interesting facts from the history of UK trade remedies. Any thoughts and comments are most welcome: we look forward to hearing from you."
        },
        {
            "text": " "
        },
        {
            "text": "Table 1: Anti-dumping investigations conducted by the Board of Trade, Department of Trade and Industry, and Department of Trade, which resulted in the imposition of an anti-dumping duty."
        },
        {
            "text": "Source: Analysis of legislation.gov.uk, Hansard, and Tynwald Library."
        },
        {
            "text": "Notes: Specific anti-dumping duty rates were converted to and expressed in 2021 prices using the Bank of England’s Inflation Calculator. Conversion rates for pre-decimal sterling currency and mass units: 1s. (shilling) = £0.05 and 1d. (pence) = £0.0042; 1 lb. (the pound or the pound-mass) = 0.45359237 kilograms; 1 cwt. (the hundredweight) = 112 pounds (50.80 kilograms); 1 ton = 2,240 pounds (1,016 kilograms)."
        },
        {
            "text": " "
        },
        {
            "text": "Table 2: Anti-subsidy investigations conducted by the Board of Trade, Department of Trade and Industry, and Department of Trade, which resulted in the imposition of a countervailing duty."
        },
        {
            "text": "Source: Analysis of legislation.gov.uk, Hansard, and Tynwald Library."
        },
        {
            "text": "Notes: Specific countervailing duty rates were converted to and expressed in 2021 prices using the Bank of England’s Inflation Calculator, available at: https://www.bankofengland.co.uk/monetary-policy/inflation/inflation-calculator. Pre-decimal sterling currency (LSD) was converted to decimal currency as follows: 1s. (shilling) = £0.05 and 1d. (pence) = £0.0042."
        },
        {
            "text": "lb. (the pound or the pound-mass) is a British imperial unit of mass equal to 0.45359237 kilograms."
        },
        {
            "text": "cwt. (the hundredweight) is a British imperial unit of mass equal to 112 pounds (50.80 kilograms)."
        },
        {
            "text": "ton is a British imperial unit of mass equal to 2,240 pounds (1,016 kilograms)."
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}