{
    "url": "https://socialcare.blog.gov.uk/2022/06/27/care-home-open-week-expect-the-unexpected/",
    "title": "Care Home Open Week: expect the unexpected",
    "authors": [
        "Sanjay Dhrona"
    ],
    "categories": [
        "Care and support",
        "Communities",
        "Events"
    ],
    "pub_date": "2022-06-27T17:40:07+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Raising awareness, dispelling fear"
        },
        {
            "text": "Unlike the education system and the NHS, social care is not engaged with by the majority of the population from a young age. It isn’t even accessed by every member of the population. However, when the time comes to call on social care services, people are normally in crisis mode, panicked, confused and exhausted by the situation which created the need in the first instance."
        },
        {
            "text": "Further challenges around discussing reduced mobility, changes in abilities or capacity, and even mortality, mean care homes are often at the back of people’s minds, a conversation topic to be spoken of on another occasion, “we can deal with it tomorrow…”"
        },
        {
            "text": "The social care industry is misunderstood. People generally have archaic and outdated paradigms, cliches and stereotypes of social care and it is these very reasons, which display the importance of engaging with Care Home Open Week. We invite you to see and feel for yourself what a wonderful, exciting place social care has become and has the potential to be."
        },
        {
            "text": "Going to a care home need not be scary, they are in fact nice places - regulated on their ability to care. They are warm, and loving places filled to the rafters with teams of people who have a vocational calling to deliver compassionate care at the most difficult of times for people who need the greatest support. You will be welcomed and appreciated!"
        },
        {
            "heading": 2,
            "text": "Fun and surprises!"
        },
        {
            "text": "It mustn’t be forgotten, they are fun… and filled with laughter! Joy radiates through homes and, post pandemic, families can once again celebrate long awaited milestones and occasions. You can sense the pleasure and familial nature of these events."
        },
        {
            "text": "Social care settings love to have visitors and most host events throughout Care Home Open Week, looking for people to be engaged with their local service. Why limit it to a week? Here at the Close Care Home in Oxfordshire we host a number of events all year round that we invite the local community too. Fetes, tea parts, garden events, dog shows… the key thing is to see and get involved with what we do."
        },
        {
            "text": "It must be said, social care is continuing to change. New innovations, techniques and styles of care evolve using a mix of ideas and learning from provider to provider. The sector is levelling up. Care Home Open Week is a great opportunity to see this vanguard of change and really engage with today’s new and dynamic social care space. You’ve been invited!"
        }
    ]
}