{
    "url": "https://food.blog.gov.uk/2022/06/27/chairs-stakeholder-update-the-launch-of-our-food-an-annual-review-of-food-standards-across-the-uk/",
    "title": "Chair's stakeholder update - The launch of Our Food: An annual review of food standards across the UK",
    "authors": [
        "Professor Susan Jebb, FSA Chair"
    ],
    "categories": [
        "Our mission"
    ],
    "pub_date": "2022-06-27T14:01:02+01:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "We know that food matters. We enjoy it every day. Food nourishes us and brings us together with our loved ones. The food system provides livelihoods for many people and plays a vital part in our economy."
        },
        {
            "text": "Today, as part of the watchdog role outlined in our new strategy, we are publishing, with Food Standards Scotland, Our Food: An annual review of food standards across the UK, a comprehensive report of food standards in the UK."
        },
        {
            "text": "As a valued stakeholder of the FSA, with a shared interest in ensuring our food is safe, healthy, and is what it says it is, we think our report will be of interest to you. It includes insights drawn from data across a range of issues, including the nation’s diet, food incidents and trading patterns."
        },
        {
            "text": "The good news is that despite the challenges of the pandemic and the UK’s exit from the EU, food standards in the UK remain high. There are, however, challenges ahead. Local authority funding pressures, the delay in establishing full UK imports controls, the cost-of-living crisis, and the ongoing global impact of the war in Ukraine will all test the resilience of the UK food system in the coming months and impact on the ability of consumers to access safe, healthy and sustainable food."
        },
        {
            "text": "Our report provides a baseline assessment of our food standards and we will continue to collect data and report on an annual basis. We look forward to working with you to create a resilient food system that offers a safe, healthier and more sustainable future for UK consumers and our trading partners."
        },
        {
            "text": "If you have any thoughts or questions about the findings in our report, please do let us know in the comments section below."
        },
        {
            "heading": 2,
            "text": "\nLansio Ein Bwyd: Adolygiad blynyddol o safonau bwyd ledled y DU"
        },
        {
            "text": "Rydym yn gwybod bod bwyd yn bwysig. Rydym yn ei fwynhau bob dydd. Mae bwyd yn rhoi maeth i ni ac yn dod â theulu a ffrindiau at ei gilydd. Mae’r system fwyd yn darparu bywoliaeth i lawer o bobl ac yn chwarae rhan hanfodol yn ein heconomi."
        },
        {
            "text": "Heddiw, fel rhan o’n rôl fel corff gwarchod a amlinellir yn ein strategaeth newydd , rydym ni, ar y cyd â Safonau Bwyd yr Alban, yn cyhoeddi adolygiad cynhwysfawr o safonau bwyd yn y Deyrnas Unedig (DU), sef Ein Bwyd 2021: Adolygiad blynyddol o safonau bwyd ledled y DU."
        },
        {
            "text": "Fel un o randdeiliad gwerthfawr yr Asiantaeth Safonau Bwyd (ASB), sy’n rhannu diddordeb mewn sicrhau bod ein bwyd yn ddiogel, yn iachus ac yn cyd-fynd â’r hyn sydd ar y label, credwn y bydd ein hadroddiad o ddiddordeb mawr i chi. Mae’n cynnwys mewnwelediadau yn seiliedig ar ddata ar ystod o faterion, gan gynnwys deiet y genedl, digwyddiadau bwyd a phatrymau masnachu."
        },
        {
            "text": "Er gwaethaf heriau’r pandemig ac ymadawiad y DU â’r Undeb Ewropeaidd, mae safonau bwyd yn y DU yn parhau i fod yn uchel. Fodd bynnag, mae heriau ar y gorwel. Bydd pwysau ar gyllid awdurdodau lleol, yr oedi wrth sefydlu rheolaethau mewnforio llawn y DU, yr argyfwng costau byw, ac effaith fyd-eang barhaus y rhyfel yn Wcráin i gyd yn herio gwytnwch system fwyd y DU dros y misoedd nesaf, ac yn effeithio ar allu defnyddwyr i gael mynediad at fwyd diogel, iachus a chynaliadwy."
        },
        {
            "text": "Mae ein hadroddiad yn darparu asesiad sylfaenol o’n safonau bwyd, a byddwn yn parhau i gasglu data ac adrodd yn flynyddol. Edrychwn ymlaen at weithio gyda chi i greu system fwyd gadarn, a fydd yn sicrhau dyfodol diogel, iachach a mwy cynaliadwy i ddefnyddwyr y DU a’n partneriaid masnachu."
        },
        {
            "text": "Os oes gennych unrhyw sylwadau neu gwestiynau am y canfyddiadau yn ein hadroddiad, rhowch wybod i ni yn yr adran sylwadau isod."
        }
    ]
}