{
    "url": "https://teaching.blog.gov.uk/2022/06/27/developing-a-lifelong-love-of-physical-activity/",
    "title": "Developing a lifelong love of physical activity",
    "authors": [
        "Neil McAvoy"
    ],
    "categories": [
        "Primary schools",
        "Pupil wellbeing and behaviour"
    ],
    "pub_date": "2022-06-27T17:23:06+01:00",
    "content": [
        {
            "text": "Neil McAvoy is Deputy Headteacher at Clavering Primary School in Hartlepool. One of his roles at the school is leading the nationally recognised Physical Education School Sport and Physical Activity (PESSPA) Programme, he is also an ambassador for the Youth Sport Trust. He talks about his experience of embedding physical activity in every school day. "
        },
        {
            "text": "At Clavering Primary School, ‘developing a lifelong love of physical activity’ is the motto for our PESSPA Programme. We embrace being a physically active school and maximising the physical, mental, social and emotional benefits of regular physical activity. It is always a joy to bump into ex-pupils who want to reminisce about their participation in our PESSPA Programme and tell me about how they are continuing to be physically active. "
        },
        {
            "text": "For me, physical activity isn’t just something to restrict to PE and school sport opportunities. At Clavering, we embrace a physically active approach to teaching; we try to use our outdoor space and local environment; and we aim to make the most of our two playtimes per day, active lunchtimes, two hours of PE, extra-curricular activities, and active transport before and after the school day. "
        },
        {
            "text": "Outdoor education "
        },
        {
            "text": "Lockdowns during the pandemic convinced me even more about the importance of wild places and aspects of our school curriculum such as outdoor learning, fieldwork in geography and involvement with the John Muir Award (which encourages people from all backgrounds to connect with, enjoy and care for nature). Our progressively challenging outdoor adventure programme is extremely popular with our pupils, giving them the chance to explore wild places with their friends and develop a love for outdoor learning, adventure and nature – all linked to the national curriculum. "
        },
        {
            "text": "At Clavering, we promote wonderful opportunities for children and their families to access the great outdoors in our area. Seeing one of our Year 4 pupils and their family visit the area of the North York Moors where I had recently taken their class camping and hiking was truly inspirational. "
        },
        {
            "text": "Pupil participation "
        },
        {
            "text": "Pupil voice is essential in our desire to see every child develop a lifelong love of physical activity. We speak to children about the relevance, usefulness and enjoyment of the many sport activities offered in our PE curriculum and in our extra-curricular clubs, giving them the opportunity to self-direct their learning and choice of activity. Pupils also value the opportunity to participate in PESSPA leadership groups, particularly our PESSPA Leaders and Girls Active Leaders, which develop our pupils as positive role models who make a significant contribution to our PESSPA Programme across the school. "
        },
        {
            "text": "30:30 strategy for physical activity "
        },
        {
            "text": "Possibly one of the standout features of our PESSPA Programme is the ‘Clavering 30:30 strategy for physical activity’. This simple but highly effective programme ensures that no child is sedentary for longer than thirty minutes and every child is guaranteed a minimum of thirty minutes physical activity in the classroom every day through our ‘get up, get active’ sessions and active breaks.  "
        },
        {
            "text": "Empowering leaders  "
        },
        {
            "text": "The Association for Physical Education and Sports Leaders strongly believe that those teaching PE are key to supporting the emotional wellbeing of our pupils through the curriculum and they have developed a qualification – the Level 4 Qualification in Supporting Pupils’ Wellbeing Through Physical Education – that is well worth completing. Certainly, I have found it a very useful course to complete on top of the Level 5 Certificate in Primary School Physical Education and Level 6 Award in Primary School Physical Education Leadership. Plus, I would encourage all schools to join the Youth Sport Trust’s Well Schools movement, focused on using wellbeing to improve school outcomes and academic performance. "
        },
        {
            "text": "Over the last decade, our PESSPA Programme has been transformed through commitment and passion from all stakeholders; the government’s PE and Sport Premium; and involvement with the School Games, Youth Sport Trust and Association for Physical Education. "
        },
        {
            "text": "We know that there is so much that pupils can gain from a thriving PESSPA Programme, including connecting with others, developing important life skills, and improving both their physical and mental health. There is no better time than now to place physical activity and wellbeing at the heart of school life. "
        },
        {
            "text": "Through the PE and Sport Premium, £320 million will be delivered to schools in 2022/23 to give more children access to high quality PE lessons and sporting opportunities, supporting both their physical and mental wellbeing. "
        },
        {
            "text": "Read guidance on the PE and Sports Premium"
        }
    ]
}