{
    "url": "https://educationhub.blog.gov.uk/2022/06/27/how-we-are-working-with-the-united-nations-to-protect-childrens-rights-2/",
    "title": "How we are working with the United Nations to protect children’s rights",
    "authors": [
        "media officer"
    ],
    "categories": [
        "Child protection"
    ],
    "pub_date": "2022-06-27T14:08:01+01:00",
    "content": [
        {
            "text": "Every five years, the United Nations (often known as the UN) ask us to report on our progress to make sure we’re looking after the people and children we represent."
        },
        {
            "text": "This is to see what we’re doing to promote children’s rights, and where we need to work harder to protect children and young people’s rights."
        },
        {
            "text": "What is the United Nations Convention on the Rights of the Child (UNCRC)?"
        },
        {
            "text": "The UNCRC is an international agreement setting out the fundamental rights of everyone under the age of 18 and is the most widely ratified human rights treaty in history. The treaty covers England, Wales, Scotland and Northern Ireland, the Crown Dependencies and Overseas Territories."
        },
        {
            "text": "The United Nations (UN) Committee issues a list of questions on areas that we need to address."
        },
        {
            "text": "In response, the government submits a report to the UN Committee to demonstrate the great work we have been doing across the UK to promote children’s rights."
        },
        {
            "text": "The reporting process is a great opportunity to celebrate successful child centred initiatives, and review areas for improvement."
        },
        {
            "text": "The full report is available here: Treaty bodies Sessions (ohchr.org)."
        },
        {
            "text": "What did the UN committee ask of the UK government in relation to children’s rights? "
        },
        {
            "text": "The UN Committee asked the government on the measures we have taken to progress several child’s rights issues, this includes education, health, wellbeing, environment, school exclusions, and the voice of the child."
        },
        {
            "text": "Ok so what are you doing to address these areas? "
        },
        {
            "text": "The UK Government submitted the report to the UN Committee on 15 June 2022, responding to the UN Committee’s questions on the measures we have taken to promote children’s rights."
        },
        {
            "text": "The report includes some of the following areas."
        },
        {
            "text": "The government knows how important it is for children to understand their rights. When we started this response to the UNCRC, we spoke to more than 5000 children across the country to ask their opinions and tell them more about their rights. We have taken their views into account throughout."
        },
        {
            "text": "Every year, the government supports the UK youth parliament, which allows children to have their say on the way the country is run. We regularly consult the youth parliament and other groups on issues like climate change, discrimination, education and more."
        },
        {
            "text": "To protect children in challenging situations, the government created something called ‘The Victim’s Code’. This makes sure children who are victims of a crime understand what’s happening, are listened to, and are offered the right support."
        },
        {
            "text": "We are working hard to stop discrimination for all children. We are investigating race inequality and building an action plan to support disadvantaged children and make sure that fewer children in minority groups are excluded from school."
        },
        {
            "text": "In the last two years the government has provided £4 million to help schools address bullying."
        },
        {
            "text": "We also launched the SEND (Special Educational Needs and Disability) Review, which heard from children with special needs about their experiences of discrimination. We’re using this research to help us make changes to laws to improve children’s experiences."
        },
        {
            "text": "We know how important online services are for children. In 2020, we provided £400 million to help children access education and online social care services from home."
        },
        {
            "text": "We know that more must be done to keep children safe online. In 2022, the government put in place an Online Safety Bill to hold technology companies accountable for harmful content on their services, with the strongest protections for children."
        },
        {
            "text": "We also launched our Online Media Literacy Action Plan to help children make safer choices."
        },
        {
            "text": "How can I talk to my child about this report? "
        },
        {
            "text": "We have created some useful tools to help discuss this report with children and young people, either at home or during school time to help them understand how we are respecting children’s rights."
        },
        {
            "text": "This helpful infographic encapsulates our responses to the above and more in the report in an easy to digest way."
        },
        {
            "text": "We have also developed three bitesize child friendly videos which can be viewed here, here and here."
        },
        {
            "text": "Minister for Children and Families, Will Quince has also issued a letter to children and young people on the report here https://www.unicef.org.uk/wp-content/uploads/2022/06/WQ-Letter-to-CYP-UNCRC.pdf"
        },
        {
            "text": "The full report is available here: Treaty bodies Sessions (ohchr.org)."
        }
    ]
}