{
    "url": "https://insideDIO.blog.gov.uk/2022/06/27/impressions-of-dio-to-date/",
    "title": "Impressions of DIO to date",
    "authors": [
        "Mike Green"
    ],
    "categories": [
        "Accommodation",
        "MOD Guard Service",
        "Working at DIO"
    ],
    "pub_date": "2022-06-27T11:36:05+00:00",
    "content": [
        {
            "text": "Mike at DIO's Head Office, St George's House, at Defence Medical Services Whittington in Staffordshire. [Crown Copyright / MOD 2022]As I’m now a couple of months in to my tenure as DIO’s Chief Executive, following the retirement of Graham Dalton, I thought it was high time I introduce myself."
        },
        {
            "text": "I started my career as a civil engineer before joining the Civil Service in 2012. I was previously Director of Commercial and then Chief Operating Officer at the Department for Education. Making the move to working in Defence was exciting, as I’ve always had an interest in the military. If I had to guess, that stems back to listening to my grandfather’s stories of his time as a Desert Rat. Given my background, I’d been watching DIO for a few years and looking out for an opportunity to join and combine my military interest and my career, so this is perfect for me."
        },
        {
            "heading": 2,
            "text": "The first few weeks"
        },
        {
            "text": "As you might expect, I’ve been busy getting to grips with my new role. DIO is a big and varied organisation, but even so is only part of a much larger department. There’s been a lot to learn and I have had to get stuck in to briefings and meetings to help me hit the ground running as soon as possible."
        },
        {
            "text": "I’ve met with many senior MOD officials from across the Department and have been travelling around, meeting staff and hearing what matters to them as well as learning more about the organisation. I’ve visited several DIO offices including at Catterick, RAF Wyton and our head office at DMS Whittington as well as Main Building in Whitehall. At Catterick, our local estate facilities team showed me round some of the facilities we manage, including the health centre and sports stadium. When we passed a Chieftain tank I had to stop for a photo – I do love a tank!"
        },
        {
            "text": "Mike and fellow DIO staff in front of the Chieftain tank at Catterick Garrison. [Crown Copyright / MOD 2022]A few weeks ago I visited Kendrew Barracks in Rutland for a deep dive into our Service Family Accommodation with Head of Accommodation Air Cdre James Savage. We visited a number of different homes, some good and some less so, as well as some which have been upgraded under our Project Speed investment. The team even ran me through a simulated Move In procedure to help me understand the process from a service family’s point of view. We then held a round table discussion on accommodation and I was especially grateful to hear from a Corporal about her and her family’s experiences."
        },
        {
            "text": "At Kendrew Barracks. Mike listens to a briefing from Air Commodore James Savage, DIO's Head of Accommodation, on recent investment to improve Service Family Accommodation and play areas. [Crown Copyright / MOD 2022]I’m also making space in my diary for ‘back to the floor’ time with staff. I spent half a day with one of our MGS security officers, understanding what a shift looks like for them and the importance of their role, both the security and customer service elements. They are, after all, the first people many visitors will see when they visit over 100 MOD sites across the country. I’m really looking forward to visiting our senior archaeologist on the site of a dig at Westdown Camp on Salisbury Plain. The breadth of our work is really quite incredible."
        },
        {
            "text": "Mike was able to spend time with some of our MGS security officers to understand their role. [Crown Copyright / MOD 2022]These kind of visits, and especially hearing first-hand from staff and those who use our estate, really helps me to understand what we do, how important it is, and where we can improve. I’ve learned a lot."
        },
        {
            "heading": 2,
            "text": "Plans for the future"
        },
        {
            "text": "Now I feel a little more settled in, it’s time to turn my attention to future plans. Graham left the organisation in a great place but of course, there’s always more to do. My initial priorities are a continued focus on safety, improving our use of technology to support our work and priorities, and supporting DIO’s fantastic staff to continue their work to enable the Armed Forces to live, work, train and deploy."
        }
    ]
}