{
    "url": "https://beisdigital.blog.gov.uk/2022/06/27/whats-it-like-being-a-business-analyst-in-beis-digital/",
    "title": "What’s it like being a business analyst in BEIS Digital? ",
    "authors": [
        "Gary Wheatland"
    ],
    "categories": [
        "Business analysis",
        "People and skills",
        "Services and products",
        "User-centred design"
    ],
    "pub_date": "2022-06-27T14:35:04+00:00",
    "content": [
        {
            "text": "I’m Gary, a Lead Business Analyst in BEIS Digital.  "
        },
        {
            "text": "Business analysts work with customers to: "
        },
        {
            "text": "Where a recommended solution involves digital technology we work with policy colleagues and other digital specialists to design, create and test software to meet those needs.   "
        },
        {
            "text": "Each day is different, one day you could be preparing requirements for a procurement competition, the next, mapping out a process for a brand-new service or identifying specific metrics to measure the success of efficiency improvements.   "
        },
        {
            "heading": 2,
            "text": "Why would you need a business analyst on your project?  "
        },
        {
            "text": "A business analyst will help you to use data to diagnose and evidence a problem. For example, what does the data say about the scale, frequency, and root cause of a problem? How does a problem affect your daily business performance?  "
        },
        {
            "text": "Secondly, we will work with you and your users to establish the needs for achieving your business goals. We aim to design an experience that not only meets those needs but does so in a user-centred way, improving your ways of working.  "
        },
        {
            "text": "Finally, a business analyst will identify solution options to best meet those needs, outlining the pros and cons in areas like costs, timescales, complexity and feasibility. We will consider what benefit each option could bring and how it could be measured to demonstrate its success.  "
        },
        {
            "text": "We will work together to iterate and test possible solutions, supporting you through to implementation.  "
        },
        {
            "heading": 2,
            "text": "When should you involve a business analyst in your project?  "
        },
        {
            "text": "Ideally from the start, so that we can explore the problem space together and make sure we have identified all the users and their high-level needs before we consider how to solve it.  "
        },
        {
            "text": "Working with a business analyst during the crucial early stages of an idea or project can save time, cost, re-work and reduce the risk of implementing a solution that does not fully meet business and user needs.  "
        },
        {
            "heading": 2,
            "text": "Meet the team "
        },
        {
            "text": "I asked some of our team what the best bits of being a business analyst in BEIS Digital are. This is what they said."
        },
        {
            "heading": 3,
            "text": "Warren, Senior Business Analyst, says:  "
        },
        {
            "text": "My job is really varied, and no two pieces of work are the same. In the brief time I have been at BEIS I’ve dipped my toes into areas as diverse as offshore coal and gas regulation and the procurement of a new HR system.   "
        },
        {
            "text": "The best things about working at BEIS are the people I'm working with, the variety of work, a great collaborative culture and interesting and diverse projects. "
        },
        {
            "heading": 3,
            "text": "Giorgi, Senior Business Analyst, says:  "
        },
        {
            "text": "It’s exciting that you can put theoretical knowledge gained from training courses into practice by working on high-profile projects.   "
        },
        {
            "text": "There is a lot of activity and plenty of opportunities to learn, develop and make a real difference.   "
        },
        {
            "heading": 3,
            "text": "William, Senior Business Analyst says:  "
        },
        {
            "text": "Working at BEIS involves working on a broad variety of impactful projects such as those relating to energy efficiency, a hot government topic for reducing carbon footprint in the home.   "
        },
        {
            "text": "The flexibility of hybrid working, the support for office equipment at home, and good colleagues have made working at BEIS an enjoyable experience.  "
        },
        {
            "heading": 3,
            "text": "Becky, Lead Business Analyst, says:   "
        },
        {
            "text": "Our business analysis team is relatively small but we are a supportive community. The team is driven by shared interests and goals.  "
        },
        {
            "text": "Wellbeing is at the forefront of what we do, and we check-in as a team daily so that we can all remain in touch. We talk about our projects and share ideas on how we can improve what we’re doing as a profession.  "
        },
        {
            "text": "We hope we've managed to shed a bit of light on what business analysts do at BEIS!  Keep an eye on the blog for details on our projects.  "
        },
        {
            "text": "You can stay up-to-date with the latest developments by signing up for email alerts or by following us on Twitter."
        }
    ]
}