{
    "url": "https://gds.blog.gov.uk/2022/06/27/why-its-important-to-add-gender-identity-options-to-digital-services/",
    "title": "Why it’s important to add gender identity options to digital services",
    "authors": [
        "The GDS Team"
    ],
    "categories": [
        "GDS team",
        "People and skills"
    ],
    "pub_date": "2022-06-27T08:00:46+01:00",
    "content": [
        {
            "text": "\nDiversity information, and particularly gender and sexual identity, is very personal information, but it is also complex and broad information about a person."
        },
        {
            "text": "Diversity data matters because it can help us understand the impact of our working practices and policies. By tracking diversity data and cross-referencing it with recruitment, retention, learning, development and progression, we can work to make sure that both recruitment processes and career progression are more diverse. It allows us to see how far we have come and how far we have to go."
        },
        {
            "text": "At the Government Digital Service, ensuring the diversity of our team is key. Located at the very centre of government, our role in supporting the government to build brilliant services for everyone means that we, more than ever, are working to ensure diversity of thought and representation of the country that we serve."
        },
        {
            "heading": 2,
            "text": "Recording your gender identity and what we did to change this"
        },
        {
            "text": "We surveyed staff at Government Digital Service in October 2021 and they told us that the options to record their gender identity for their employee records was too narrow and didn’t allow the option to provide a description that reflected their identity accurately. The data recording options only allowed staff to record their gender as ‘male’ or ‘female’, but didn’t cater to those who identified any other way."
        },
        {
            "text": "People made suggestions to add more options and allow free text to describe their identity themselves. People felt that the lack of options restricted them and made it more likely that they would not provide information at all."
        },
        {
            "text": "Our LGBT+ group worked with other parts of the Cabinet Office to explore what questions or options could be added into our data recording system, how these could be implemented and what the timelines could be. During this process, we shared the questions with members of the LGBT+ community in Government Digital Service to get views as well as keeping them updated on the progress."
        },
        {
            "text": "Working with a wide network of colleagues across the Cabinet Office, we secured an option to add and recognise gender identity in our recording system, which was added in March 2022."
        },
        {
            "text": "People are now asked firstly if they identity with the sex they were assigned at birth and can answer ‘Yes’, ‘No’ or ‘Prefer not to say’. If they answer the first question as ‘No’, they are then given the option to provide free text about their gender identity."
        },
        {
            "text": "We’re looking forward to seeing the results of this change reflected in our quarterly data during 2022/23 and hope to share some more information about this in a future update."
        },
        {
            "heading": 2,
            "text": "Diversity and inclusion strategies"
        },
        {
            "text": "Government Digital Service supports the Civil Service Diversity and Inclusion Strategy: 2022-2025 to have a truly diverse workforce and culture of openness and inclusivity. Team diversity is crucial to organisational performance, innovation and difference of thought."
        },
        {
            "text": "Establishing teams with differing perspectives, experiences and insight is integral to tackling complex problems, and there is a clear correlation between diversity and organisational performance; enabling better attraction of top talent, improvement of employee satisfaction and decision-making, which leads to improved outputs."
        },
        {
            "heading": 2,
            "text": "Recording data helps to review progress"
        },
        {
            "text": "However, we can only achieve this if we collect information about who is in our teams and match companies like Monzo in their ability to report and be transparent on the diversity of their organisation and see how this changes over time."
        },
        {
            "text": "Enabling staff to record their gender identity with the Cabinet Office is a major step forward in helping those people feel valued and understood."
        },
        {
            "text": "As well as adding this option to our data recording, GDS has also encouraged people to fill out spaces in our internal communications tools to record their preferred pronouns and people are also encouraged to include these in their email signatures."
        }
    ]
}