{
    "url": "https://defrafarming.blog.gov.uk/2024/03/04/fipl-spotlight-improving-nutrient-use-and-reducing-nitrate-and-phosphate-pollution-in-the-broads/",
    "title": "FiPL spotlight: improving nutrient use and reducing nitrate and phosphate pollution in the Broads",
    "authors": [
        "Juliette Howlett"
    ],
    "categories": [
        "Payments to support parks, National Landscapes and the Broads"
    ],
    "pub_date": "2024-03-04T12:51:04+00:00",
    "content": [
        {
            "text": "With a population of just over 6,000, spread across 303 square kilometres, the Broads, located in Norfolk and Suffolk, is among the smaller National Parks. "
        },
        {
            "text": "The landscape is characterised by shallow lakes formed from peat digging in medieval times, seven rivers and more than 125 miles of navigable waterways. This flat and wet environment creates a haven for over a quarter of Britain’s rarest species, including the Norfolk hawker dragonfly and fen raft spider."
        },
        {
            "text": "The Broads has a long history of land drainage for the purpose of livestock grazing and arable cropping. "
        },
        {
            "text": "The fertile loamy, clay and peat soils are susceptible to overstocking and compaction, which leads to nutrients leaching into the surrounding watercourses."
        },
        {
            "text": " Agricultural intensification has seen a corresponding decline in the ecological value of Broadland habitats, especially flower-rich fen meadows and traditional washlands (land adjacent to rivers).  "
        },
        {
            "text": "The River Waveney catchment has particularly suffered from over-enrichment of nutrients, which has caused eutrophication and harmed the surrounding ecosystem and biodiversity.  "
        },
        {
            "heading": 2,
            "text": "Waveney Farming Cluster and their FiPL project  "
        },
        {
            "text": "To address these issues the River Waveney Trust took on the facilitation of the Waveney Farming Cluster aiming to improve water quality, water availability and habitat connectivity throughout the catchment. "
        },
        {
            "text": "Facilitated by the Trust’s Catchment Officer, the farming cluster has grown from 12 farms, to over 40 landowners across 11,000 hectares.  "
        },
        {
            "text": "In 2021, the cluster group applied for a grant through the Farming in Protected Landscapes programme (FiPL) to help improve their nutrient use efficiency and, as a result, the surrounding aquatic environment. With a PhD in lowland fisheries and previous project management experience, the farming cluster facilitator Emily Winter was well-skilled to lead this work.  "
        },
        {
            "text": "The project aimed to establish a nutrient usage baseline, provide training on how different farming practices affect nutrient losses, and conduct innovative trials amongst members.  "
        },
        {
            "text": "The Broads Authority FiPL Officer, Hannah Norman, provided advice on the proposed activities, ensuring that all consents, agreements, and quotes were in place prior to the application being presented to the Local Assessment Panel (LAP) for consideration.  "
        },
        {
            "text": "Like all LAPs, our LAP is comprised of local farmers, representatives from local environmental non-governmental organisations (ENGOs) and government organisations. The panellists approved the project, welcoming an application that involved a wide group of farmers and land managers collaborating to improve water quality. "
        },
        {
            "text": "The first year of FiPL funding enabled the cluster to purchase soil and water sampling tools, chlorophyll monitoring equipment, as well as officer time to undertake the testing. The testing methodology was developed with professional advice from the University of East Anglia, Anglian Water, technicians at Essex & Suffolk Water, and the Rivers Trust. "
        },
        {
            "text": "Chlorophyll monitoring, measured the plant mineral status of the crops. This provided farmers with specialist recommendations for reduced or variable-rate fertiliser application – where in-field fertiliser is optimised depending on crop requirements.  "
        },
        {
            "text": "Initial water sampling found that heavy rain was resulting in large nitrate concentrations in land drains, from soil leaching. The financial cost of this was approximately 30 pence per hectare per day in February 2022. Framing the runoff issue as a financial issue helped motivate the farmers to improve nutrient use efficiency.  "
        },
        {
            "text": "Alongside the practical analysis, the cluster also received specialist advice on the impact of their practices on soil compaction from Phillip Wright of Wright Resolutions, and how this effects nutrient uptake and efficiency. "
        },
        {
            "heading": 2,
            "text": "Second year project"
        },
        {
            "text": "The LAP approved funding for a second year, whilst encouraging the group to pursue broader goals. Funding  contributed to further officer time, soil organic matter tests, and grain analysis. Grain analysis provided insight into crop mineral content. As this has implications for crop nitrogen uptake, it allowed the farmers to further optimise nutrient applications. "
        },
        {
            "text": "Farmers also put in place measures to improve nutrient use efficiency in their test fields. Land management practices, including cover crops, variable-rate fertiliser application, reducing cultivations, and the earlier sowing of winter cereals were also trialled. The results highlighted that sowing cover crops before spring barley particularly helped to lower nitrate loss.  "
        },
        {
            "text": "Alongside the practical measures, the cluster continued to receive external advice to enhance their understanding of agricultural drainage systems. Norfolk Rivers Trust delivered a talk on the benefit of leaky dams, and how they can ‘slow the flow’ of water, leading to sediment settling and enhanced water quality. "
        },
        {
            "text": "The cluster facilitator found that this specialist advice, in conjunction with the results from the monitoring, inspired action at the farm level. Testing offered new insights, allowing the farmers to use manure more efficiently on their land. Continued testing helped farmers feel confident in maintaining reduced fertiliser rates, as it revealed the real-time progress towards improving nutrients use efficiency.  "
        },
        {
            "text": "Testing results showed average fertiliser use efficiency was 92% across all arable fields monitored in 2022. This suggests that nearly all fertiliser inputs were productively taken up by the crops. With experts advising farmers to aim for 70-80% efficiency, it showed that the recommended fertiliser rates from the specialist equipment were successful in improving nutrient use efficiency.  "
        },
        {
            "heading": 2,
            "text": "Project outcomes"
        },
        {
            "text": "Overall, savings in the test fields totalled around 2.5 tonnes of nitrogen, or 7.5 tonnes of Ammonium Nitrate fertiliser, equating to a reduction in equivalent CO2 emissions of approximately 24 tonnes. This has enhanced the aquatic habitat of the Waveney Valley, with levels of phosphate in field drains shown to be above ecologically accepted standards.  "
        },
        {
            "text": "By reducing fertiliser use without compromising yield, the financial sustainability of the farm businesses increased. The farmers and land managers now have a greater understanding of how changes to land management practices can help to both reduce pollution and improve their input costs. "
        },
        {
            "heading": 2,
            "text": "Longevity "
        },
        {
            "text": "After 2 years of FiPL funding, the cluster group were keen to continue building on the success of this project and were encouraged to look for alternative funding sources to sustain the project. "
        },
        {
            "text": "The project is currently set to continue for the 2024/25 agricultural calendar through funding from the Landscape Enterprise Network. "
        },
        {
            "text": "Our LAP has continued to support the cluster – organising for Nick Padwick from Wild Ken Hill to give a talk on their fertiliser-free farming model. "
        },
        {
            "text": "I'll include links below for you to learn more."
        }
    ]
}