{
    "url": "https://teaching.blog.gov.uk/2024/03/04/how-were-encouraging-children-at-our-school-to-read-for-pleasure/",
    "title": "How we’re encouraging children at our school to read for pleasure",
    "authors": [
        "Vanessa Hill",
        "Liz Kenny"
    ],
    "categories": [
        "English Hubs"
    ],
    "pub_date": "2024-03-04T10:07:40+00:00",
    "content": [
        {
            "text": "Liz Kenny, english hub lead, and Vanessa Hill, headteacher, at Whiston Worrygoose Primary school in Rotherham talk about their approach to encouraging reading, and the benefits it’s brought their pupils. "
        },
        {
            "text": "Reading is at the heart of everything we do"
        },
        {
            "text": "Whiston Worrygoose is a ‘Reading School’. Reading drives everything we do and it’s at the centre of our whole curriculum offer. Teachers, parents and children all understand the importance of reading and the benefits it brings. Our staff regularly read with all our children, and we really encourage the children to talk about their reading with passion."
        },
        {
            "text": "Developing staff knowledge of children’s literature"
        },
        {
            "text": "Enriching the reading curriculum for all children and developing staff knowledge of children’s authors and literature has required determination and commitment. We conducted a survey with staff that showed only 38% of teachers read children’s literature beyond the directed class texts. Staff were not naturally choosing to read these books, so we made a decision to take a more planned approach."
        },
        {
            "text": "We recommended our favourite children’s books, gave staff time to read them and created a space to share their increasing knowledge of authors and their writing styles. We placed a particular emphasis on new authors and texts, and books aimed at age groups beyond the specific key stage they worked in. We also covered specific genres and authors including poetry and graphic novels."
        },
        {
            "text": "Through this we supported our teachers to re-ignite their passion and interest in children’s literature, and this increased interest had such a positive impact on our pupils. We’ve also noticed an increase in teacher’s confidence in teaching text selections and engaging children in purposeful book talk."
        },
        {
            "text": "Get stuck-in, not stuck"
        },
        {
            "text": "We’ve also introduced a ‘love of reading’ tracker across KS2, and this has helped us track the children’s book choices more rigorously. Through the tracker we can see if a child is ‘getting stuck’ in a book that they’re not truly enjoying, allowing us to make interventions and direct children’s reading choices. By expanding teacher’s knowledge of children’s literature, we can quickly introduce children to alternative titles and authors available in both our classroom and school libraries."
        },
        {
            "text": "Sharing is Caring"
        },
        {
            "text": "Another positive outcome for us was that we saw an increase in reading motivation amongst pupils. Attendance at our lunchtime library club increased significantly, and it was great to see so many children engaged in reading discussion and positive reading behaviours. One child told us “It was good to see the teachers enjoying reading too and reading with us. It feels like we share the books together”, and this is the exact sort of experience we want them to have."
        },
        {
            "text": "The children also loved our assemblies, where a member of staff reads a book aloud to all the children. This ‘Mystery Text’ has ensured that children across the key stages have a shared experience and it’s been wonderful to hear the children discuss the text at lunch and playtimes."
        },
        {
            "text": "How we’re going to build on our success"
        },
        {
            "text": "We’ve had so many positive outcomes so far but our reading for pleasure journey is far from over. Over the next academic year, we’re going to build on our momentum and continue to try more things to encourage our children’s love of reading. We are looking to further develop our teacher/parent reading group and want to continue to develop our outdoor spaces to promote recreational reading even further. We’re also hoping to develop wider community links, including forming reading buddies with residents of our local nursing home."
        },
        {
            "text": "As a school, we’re committed to continuing to educate and motivate our pupils (and staff!) to read for pleasure."
        },
        {
            "text": " "
        },
        {
            "text": "Thursday 7 March is World Book Day, an annual reading for pleasure campaign and celebration of authors, illustrators, books. For ideas and resources to help you celebrate, take a look at the World Book Day activity hub."
        },
        {
            "text": "If you’d like to encourage a love of reading at your school, engage with the DfE’s English Hubs programme. Literacy specialists within each hub will provide tailored support to schools including showcase events in teaching phonics, early language and reading for pleasure."
        },
        {
            "text": "To contact any of the schools in the English Hubs programme, please visit the English Hubs website."
        }
    ]
}