{
    "url": "https://valuationoffice.blog.gov.uk/2024/03/04/how-we-work-with-local-authorities-business-rates/",
    "title": "How we work with local authorities - business rates",
    "authors": [
        "VOA"
    ],
    "categories": [
        "Business Rates",
        "Local authorities"
    ],
    "pub_date": "2024-03-04T09:57:52+00:00",
    "content": [
        {
            "text": "The Valuation Office Agency (VOA) is responsible for valuing non-domestic properties for business rates. We value 2.1 million commercial properties, like shops, offices and pubs, across England and Wales."
        },
        {
            "text": "Our valuations are used by councils to calculate business rates bills."
        },
        {
            "text": "In this blog, we look at role of the VOA and local councils in the administration of business rates."
        },
        {
            "text": "Read our previous blog to for information about Council Tax."
        },
        {
            "text": "Your property’s rateable value"
        },
        {
            "text": "The VOA calculates your property’s rateable value. This is the open market annual rental value your property could have been let for at a certain date."
        },
        {
            "text": "We work out the rateable value of a property using 3 main methods:"
        },
        {
            "text": "Learn more about how we value properties."
        },
        {
            "text": "A property’s rateable value is not the same as its business rates bill. Local councils use the rateable value to calculate the business rates bill."
        },
        {
            "text": "Business rates bills"
        },
        {
            "text": "Your local council works out your business rates bill by multiplying the rateable value by a ‘multiplier’ then applying any rates relief."
        },
        {
            "text": "For example, in England, if an individual’s property had a rateable value of £10,000, the council would work out their business rates this way:"
        },
        {
            "text": "£10,000 (rateable value) x 49.9 pence (multiplier) = £4,990 (basic business rates)"
        },
        {
            "text": "In this example, the 2023 to 2024 small business multiplier is 49.9 pence. The multiplier depends on your rateable value."
        },
        {
            "text": "Your local council also sends you your bill."
        },
        {
            "text": "How we can help"
        },
        {
            "text": "The VOA can help with any questions you have about your rateable value."
        },
        {
            "text": "Use our find a business rates valuation service to find your property’s rateable value, compare it with similar properties and check how it was calculated."
        },
        {
            "text": "If you want to report a change to your property or challenge its rateable value, you can do this through your business rates valuation account."
        },
        {
            "text": "We may also ask you to submit details of your rent and lease arrangements."
        },
        {
            "text": "When to contact your local council"
        },
        {
            "text": "Your council deals with your business rates bill. Any questions about your bill, including how and when to pay, should be directed to them."
        },
        {
            "text": "Your council will also be able to tell you about any reliefs you are eligible for, such as small business rate relief."
        },
        {
            "text": "To find your local council, visit GOV.UK."
        }
    ]
}