{
    "url": "https://ruralpayments.blog.gov.uk/2024/03/04/my-experience-as-an-rpa-ambassador/",
    "title": "My experience as an RPA Ambassador",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "External engagement"
    ],
    "pub_date": "2024-03-04T15:51:06+00:00",
    "content": [
        {
            "text": "Last summer we launched our RPA Ambassador programme, aimed at getting our people out and about engaging with external audiences. As we explain in our 5 year strategy, we’re keen to grow our presence in rural communities to ensure the interests of farmers are understood. This is so that we can help them through agricultural transition, demonstrating that we will listen, learn and do better."
        },
        {
            "text": "The Ambassadors represent RPA by engaging with a wide variety of external audiences including farmers, and stakeholders, and the Ambassadors get the chance to gain an increased appreciation of the farming industry. The Ambassadors help support RPA by developing links to the communities we serve, and demonstrating our commitment to our customers through the authentic interactions we have with them. "
        },
        {
            "text": "In this blog Dee Tsouvallaris, a Regional Engagement Manager within the Stakeholder Engagement team, talks about her experience as an RPA Ambassador. "
        },
        {
            "text": "As an RPA Ambassador, I volunteered to attend a DEFRA industry meeting in Nottingham on the replacement for the Fruit & Vegetables (F&V) Aid Scheme. With a smooth, but early (5.59am) train out of Worcester and a bit of an adventure catching a tram through Nottingham, I reached the venue on time."
        },
        {
            "text": "The people attending were from varied backgrounds and clearly had travelled from all parts of the country. There was also an interesting group of producers from the fruit and vegetable sector who were all very passionate about the industry they worked in. They helped contribute to the discussion on a wide range of issues; on how a new scheme could be created and what support could really benefit to keep the sector flourishing. While taking notes of all that was discussed at the table, I had the opportunity to gain an understanding and insight into the horticultural world and how the UK industry can benefit from becoming more sustainable, provided they receive the extra support and ongoing funding."
        },
        {
            "text": "After a very successful meeting, I caught up with family living in Nottingham, where I spent the night, and made my way down to Kenilworth early the next morning to attend the DairyTech event at Stoneleigh Park, near Coventry. After some train delays, I reached the venue which was really buzzing with activity - there were many more stands than when I was last there for the CropTech event. After working my way through the bustling crowds, I reached the RPA stand and my colleagues."
        },
        {
            "text": "I was definitely more at ease and confident this time as I knew what was expected of me as an Ambassador. It was clear that RPA’s presence was continuing to be very well received as we encountered numerous customers approaching the stand and raising queries on the Sustainable Farming Incentive and other grant schemes. As I listened closely to conversations conducted by colleagues, I absorbed invaluable knowledge and updates on other parts of RPA."
        },
        {
            "text": "I had the chance to engage with lots of customers on farming matters, climate change and its environmental impact. I got to witness first-hand lots of innovative machinery involved with dairy farming and wherever possible, I grasped the opportunity to further promote the amazing work of the RPA Ambassador network."
        },
        {
            "text": "On the train journey home, I caught up with work emails and summarised notes from the previous day’s event, feeling satisfied from spending two full days as an Ambassador and relishing the opportunities to get out and about to represent RPA."
        }
    ]
}