{
    "url": "https://nationalscreening.blog.gov.uk/2024/03/04/screening-workstreams-prominent-in-england-rare-diseases-action-plan/",
    "title": "Screening workstreams prominent in England Rare Diseases Action Plan",
    "authors": [
        "Silvia Lombardo"
    ],
    "categories": [
        "General"
    ],
    "pub_date": "2024-03-04T14:39:56+00:00",
    "content": [
        {
            "text": "The UK National Screening Committee's (UK NSC's) work to improve the newborn screening evidence base features prominently in the England Rare Diseases Action Plan 2024. "
        },
        {
            "text": "The plan provides an update on actions that are addressing the priorities highlighted in the UK Rare Diseases Framework, which sets out a national vision for improving the lives of people living with rare diseases. Part of the plan focuses  on the work of the UK NSC Blood Spot Task Group (BSTG) over the past year. "
        },
        {
            "text": "Every baby in the UK is offered newborn blood spot (NBS) screening for 9 rare but serious conditions. Screening enables timely identification and treatment of babies with these conditions, improving their health, preventing severe disability or even death.  "
        },
        {
            "text": "In addition to these 9 conditions, NBS screening for severe combined immunodeficiency (SCID) is currently being evaluated in England, and the UK NSC has recommended the introduction of newborn screening for tyrosinaemia. Work is also under way to assess the case for newborn screening for spinal muscular atrophy (SMA) by developing a new comprehensive modelling study and scoping an in-service evaluation of screening for SMA in NHS services in the UK. "
        },
        {
            "text": "Assessing the case for NBS screening for very rare conditions is difficult because good quality evidence is often lacking. The BSTG was set up to identify practical and innovative approaches to help researchers and others develop this evidence in order to help the UK NSC make robust recommendations. "
        },
        {
            "text": "BSTG work highlighted in the England Rare Diseases Action Plan includes: "
        },
        {
            "text": "In January, BSTG members agreed to commission a review of studies that explore outcomes from newborn screening, focusing on the mechanisms used in those studies to measure and monitor outcomes in the short and long term. See summary notes from January 2024 BSTG meeting."
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK NSC. You can register to receive updates direct to your inbox, so there is no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, please email uknsc@dhsc.gov.uk."
        }
    ]
}