{
    "url": "https://naturalengland.blog.gov.uk/2024/03/04/securing-off-site-biodiversity-net-gain-expert-legal-perspectives/",
    "title": "Securing off-site Biodiversity Net Gain: Expert legal perspectives",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Biodiversity",
        "Biodiversity Net Gain",
        "Biodiversity Net Gain – Hints and Tips",
        "Development",
        "Environmental Improvement Plan"
    ],
    "pub_date": "2024-03-04T21:36:36+00:00",
    "content": [
        {
            "text": "In our third Natural England instructional Biodiversity Net Gain (BNG) guest blog, legal professionals offer helpful insights into securing off-site Biodiversity Net Gain (BNG)."
        },
        {
            "text": "Our guest bloggers are:"
        },
        {
            "text": "Off-site means any biodiversity gains to be delivered on land outside of the red-line boundary of a development. Any land proposed for use for off-site BNG must be a registered biodiversity gain site. To be eligible for registration on the gain site register, land must be secured by one of two legal mechanisms. The first are planning obligations with local planning authorities (LPAs) under section 106 Town and Country Planning Act 1990 (the Act). The second legal mechanism is conservation covenants."
        },
        {
            "text": "Planning obligations"
        },
        {
            "text": "A planning obligation is a legal agreement between the planning authority and a person or persons with an interest in the land. An obligation can require a person to do something on land or restrict what can be done on land and may be conditional or unconditional. Planning obligations are registered as Local Land Charges. They run with the land and are enforceable against the people entering into the obligation and their successors, such as a subsequent owners of the land. All planning obligations must be legal instruments executed as deeds."
        },
        {
            "text": "Conservation covenants"
        },
        {
            "text": "A conservation covenant is a private, voluntary agreement between a landowner and a “responsible” body, such as a conservation charity, government body or a local authority. It delivers lasting conservation benefit for the public good. A covenant sets out obligations in respect of the land which will be legally binding not only on the landowner but on subsequent owners of the land. So far these have yet to be used (at the time of writing). See the list of designated responsible bodies."
        },
        {
            "text": "The information that follows are the views of the authors and should not be interpreted as official advice."
        },
        {
            "text": "Penny Simpson - Freeths"
        },
        {
            "text": "1. Avoid common confusion!"
        },
        {
            "text": "Even though planning obligations are usually used by landowners and LPAs to facilitate the grant of a planning permission, they can be used ‘standalone’. That is, they can be used without any linked planning application when securing off-site biodiversity units (BUs), unless the habitat enhancement works needed planning consent. Be assured that this is perfectly OK!"
        },
        {
            "text": "We anticipate a s106 agreement being used to secure off-site BUs so that the landowner can get covenants back from the LPA. This is in contrast to a unilateral undertaking which can only consist of ‘one way’ promises from the landowner to the LPA."
        },
        {
            "text": "2. The planning obligation requires two provisions"
        },
        {
            "text": "The planning obligation will need a schedule containing the habitat enhancement works which give rise to the BUs. It will also need to contain the ‘at least 30 years’ management and maintenance obligations relating to those enhancements. These two provisions need to be clearly and separately stated. This is because the 30-year maintenance obligation imposed by the legislation must start after the completion of the habitat enhancement works (see s100(2)(b) Environment Act 2021)."
        },
        {
            "text": "This can be tricky where the intention is to allow the land to re-wild gradually. Nevertheless, in all situations, there needs to be clear obligations over the habitat enhancement works as well as obligations for the 30-year maintenance period which starts from the completion of those enhancement works. Guidance is available to help with this."
        },
        {
            "text": "3. Other considerations for landowners and LPAs"
        },
        {
            "text": "Careful thought is needed in drafting:"
        },
        {
            "text": "(i) the LPA’s rights and obligations to monitor and enforce the landowner’s obligations"
        },
        {
            "text": "(ii) the landowner’s payments to the LPA to fund the LPA’s monitoring and enforcement role"
        },
        {
            "text": "We would expect an LPA to receive regular monitoring reports from the landowner over the 30-year maintenance period. We would also expect the LPA to have land entry and step in rights to allow it to effectively enforce the landowner’s obligations. In addition, we would expect the landowner to agree to providing reasonable funds to allow the LPA to perform this role. For example, an up-front lump sum or interim payments over the 30-year period."
        },
        {
            "text": "Grace Pinault - Dentons"
        },
        {
            "text": "1. Offsite BNG"
        },
        {
            "text": "LPAs should ultimately consider whether there is sufficient control over the off-site BNG land to ensure the performance of monitoring and maintenance requirements over the 30-year period."
        },
        {
            "text": "Where the 'donor' habitat bank is located has several implications for LPAs. LPAs will only be able to enforce section 106 obligations within its jurisdiction. Also, the statutory biodiversity metric reduces the number of habitat units generated for off-site works outside of the boundary of the LPA or National Character Area (NCA). Habitat units from neighbouring LPAs or NCAs will be reduced by 25%. Habitat units from outside neighbouring LPAs or NCAs will be reduced by 50%. Gaining insight into where the land will be is necessary for LPAs to understand how many habitat units are required."
        },
        {
            "text": "2. Flexibility"
        },
        {
            "text": "LPAs should consider whether it is acceptable in planning terms to vary the amount of BNG between phases of development. Delaying BNG delivery to the later phases of development may be justified but risks non-delivery. Under the new regime, LPAs adopting this approach must be satisfied that the development will still achieve its biodiversity gain objective across the site."
        },
        {
            "text": "BNG could also be a material consideration in the grant of some planning consents. In schemes where a masterplan or BNG is still subject to change, LPAs should be mindful of what subsequent approvals are needed to secure the desired level of BNG."
        },
        {
            "text": "3. Conservation covenants"
        },
        {
            "text": "A conservation covenant is a legal agreement between a landowner and a responsible body. The responsible body could be a:"
        },
        {
            "text": "The responsible body can enter into conservation covenant to secure habitat enhancements anywhere."
        },
        {
            "text": "Conservation covenants will be enforceable by the responsible body that is party to the agreement. LPAs entering into conservation covenants should consider whether they can appropriately monitor the land and, if necessary, enforce against landowners. LPAs wishing to attract enhancements to support strategic habitat sites could benefit from the use of conservation covenants."
        },
        {
            "text": "David Short - Lux Nova Partners"
        },
        {
            "text": "The following tips are based on experience so far with legal agreements to enable sale of biodiversity units from farmer led enhancement projects. Our first suggestion is to do your baseline early and use a good ecologist. This helps to see if you have a biodiversity enhancement project that will work and be worth it, before even thinking about legal agreements."
        },
        {
            "text": "1. Enter into a legal agreement"
        },
        {
            "text": "To create and sell biodiversity units, you will need to find an organisation that will hold you to account using either a S106 agreement or a conservation covenant. You will need to talk to your LPA or find some other ‘responsible body’ (of which there are practically none at the moment!) that will enter into this legal agreement with you. This may be the greatest challenge as this is very new to all involved."
        },
        {
            "text": "2. Find buyers for your biodiversity units"
        },
        {
            "text": "You will need to find buyers for your biodiversity units, so think about how you are going to do that. Buyers will typically be developers that need units for planning applications. For example, housing developers or infrastructure companies."
        },
        {
            "text": "How are you going to market and sell your units? The government will not do this for you, so you may try local brokers or one of the new online marketplaces for biodiversity units."
        },
        {
            "text": "3. Consider an ‘option agreement’ transaction"
        },
        {
            "text": "Once you have a buyer, both parties will need to enter a contract to give effect to the sale. This involves transferring or allocating the units to the developer and securing payment from the developer to the seller. This is a new type of transaction with no established precedents. It is likely a developer will want to start with an ‘option agreement’. Under this, developers can reserve the option to purchase the units upon receiving planning permission, by paying a non-refundable deposit to the seller. The remainder paid if the developers exercise the option. This means that when the developer successfully obtains their planning permission, they pay the remainder. The deposit, or reserve fee, is paid upon signing the option agreement, effectively rewarding the landowner for reserving units during the option period."
        },
        {
            "text": "The information shared here offers insights rather than legal advice. For queries regarding contracting for BNG, seek advice from a legal expert tailored to your specific situation."
        }
    ]
}