{
    "url": "https://buyingforschools.blog.gov.uk/2024/03/04/using-get-help-buying-for-schools-to-buy-cleaning-services-for-my-trust/",
    "title": "Using Get help buying for schools to buy cleaning services for my trust",
    "authors": [
        "Lisa Jones, Director of Finance and Resources, Consortium Trust"
    ],
    "categories": [
        "Services"
    ],
    "pub_date": "2024-03-04T10:54:05+00:00",
    "content": [
        {
            "text": "Lisa Jones is Director of Finance and Resources for the Consortium Trust, based in East Anglia. The trust is made up of 11 rural primary schools, a nursery and two special schools. In this blog post, Lisa shares her experience of using Get help buying for schools to buy cleaning services for 7 schools in her trust."
        },
        {
            "text": "Our cleaning services contract was due to end in August 2023 so in autumn 2022, we started to think about retendering. The new contract would cover 7 out of the 11 primary schools in the trust. I’d heard about Get help buying for schools through various news bulletins. I’d also met a member of the DfE’s Schools Commercial team at a local network meeting and was offered a 1:1 conversation to go through my needs in more detail. That conversation led to me using the service."
        },
        {
            "text": "Our main motivation for using the service was to save time. None of us here at the trust would say we have any spare time and yet it’s incredibly time consuming to run a fully compliant tender. We felt that none of us had the capacity to take this on and needed someone to help take that load."
        },
        {
            "text": "Compliancy was also a factor in our decision to use the service. There are obviously lots of regulations around tenders and we are not procurement experts, so making sure the tender was fully compliant was crucial."
        },
        {
            "text": "Cost savings were a consideration too. During our initial research we had talked to other companies who could have taken this on for us for a fee, but we were looking at several thousands of pounds to go out and tender. The fact that Get help buying for schools is a free service was a huge positive for us."
        },
        {
            "text": "It was easy to access the service. I placed an enquiry via the Get help buying for schools website and received a response within 48 hours. From that point on, the service I received was regular, consistent, and proactive. We were fully supported by the service throughout the process which meant that they worked closely with us and did a lot of the hard work for us. If I needed to speak to someone at any point during the process I had a direct point of contact, which was reassuring."
        },
        {
            "text": "A cleaning tender requires a lot of information to be gathered. Our contact at the service told us exactly what we needed to provide and then took this information and used it to build the tender document. They sent the invitation to tender (ITT) out and then collated all the bids, dealing with all enquiries from suppliers along the way."
        },
        {
            "text": "When we received the bids, our contact advised us on the best way evaluate to ensure fairness and consistency. Once we had completed our evaluation, we talked the result through with our contact to make sure we were being compliant and fair. This was reassuring as we knew that this thorough process of checks and balances would minimise the risk of challenge further down the line if a supplier was not successful."
        },
        {
            "text": "We awarded the contract to a new supplier and they started working for us at the beginning of the 2023/2024 academic year. The whole process was such a positive experience with a successful outcome, resulting in new supplier with fresh ideas, that wanted to work with us to achieve the highest cleaning standards in our schools."
        },
        {
            "text": "The main positive difference the Get help buying for schools service made was taking a chunk of the workload away. It would have been so much more time consuming if we’d not had that support. I’m not a procurement expert so would have been taking more time over everything. This coupled with the fact that the process was compliant and we were doing things correctly – this was really reassuring."
        },
        {
            "text": "I would definitely recommend the service. The fact that it’s free means there is no reason to not to! Yes, there are companies who can offer this service, but they could cost you money. By using DfE you know it’s compliant before you start, you are taken through the process step by step, and they will do a lot of the work for you."
        },
        {
            "text": "To my school business professional colleagues, I would say just give it a try! It’s worked so well for us and we will definitely use the service again. I have a couple of tenders coming up and will be contacting Get help buying for schools before I do anything else."
        },
        {
            "text": "If you’ve found this article useful and want to learn more about how we’re supporting schools, click ‘sign up and manage updates’ to subscribe to our blog and receive notifications when we next post."
        }
    ]
}