{
    "url": "https://extremismcommission.blog.gov.uk/2022/03/03/commission-for-countering-extremism-hosts-inaugural-conference/",
    "title": "Commission for Countering Extremism hosts inaugural conference",
    "authors": [
        "Commission for Countering Extremism"
    ],
    "categories": [
        "Latest news"
    ],
    "pub_date": "2022-03-03T14:57:54+00:00",
    "content": [
        {
            "text": "The Commission for Countering Extremism hosted its first conference last week, bringing together academics, policy-makers, and operational and regulatory partners to discuss ‘Extremism in the UK: What does it look like and how should we respond?’"
        },
        {
            "text": "Robin Simcox, Interim Commissioner for Countering Extremism, opened the full-day conference by stressing the importance of counter-extremism work and the role the Commission plays in this fight. These sentiments were echoed by key-note speaker, the Home Secretary Rt Hon. Priti Patel MP, and guest speaker Andrew Griffith MP, Head of the Policy Unit at No.10."
        },
        {
            "text": "Reflecting on the event, Robin says:"
        },
        {
            "text": "“Counter-extremism work remains as vital as ever. Extremism poses a range of harms to individuals and wider society. It can lead to terrorism and other acts of violence, while also causing long-term social divisions and intolerance."
        },
        {
            "text": "“This event provided an opportunity to have honest discussions about the landscape of extremism in the UK and how we can improve our response."
        },
        {
            "text": "“Bringing together practitioner experience, academic insight, and policy-makers not only paves the way for greater collaboration between sectors. It also ensures a more thorough understanding of both extremism and counter-extremism."
        },
        {
            "text": "“These conversations help refine our understanding of the threat, the scale of extremism, and how we can challenge it”."
        },
        {
            "text": "The conference focused on four separate thematic panel discussions: extremism in the UK today, online harms, prisons, and young people. All were followed by a frank and lively Q&A exchange."
        },
        {
            "text": "The CCE plans to expand on the success of this conference with similar events in the future while continuing to seek innovative ways of disseminating research and insights across the counter-extremism sector."
        },
        {
            "text": " "
        }
    ]
}