{
    "url": "https://dragonsden.blog.gov.uk/2022/03/03/dragons-den-episode-9-series-19/",
    "title": "Dragons' Den, Episode 9, Series 19",
    "authors": [
        "Laurien Webb"
    ],
    "categories": [
        "Designs",
        "Patents",
        "Trade marks"
    ],
    "pub_date": "2022-03-03T21:05:09+00:00",
    "content": [
        {
            "text": "It’s hard to believe, but we are more than halfway through series 19 of Dragons’ Den already. Intellectual Property was a hot topic in the Den tonight, so I’ve picked my favourite pitch of the episode."
        },
        {
            "heading": 3,
            "text": "I wish you’d had a patent!"
        },
        {
            "text": "I’m a real believer in turning pain into purpose and that is exactly what entrepreneur Paul Westerman did after suffering an embolism and having a near-death experience. Paul entered the Den asking for £50k for 15% of his business with his RBR Legflow – The DVT prevention Device. The DVT prevention device is a piece of healthcare equipment that actively increases the bodies own blood flow to the lower limbs.A simple and highly effective piece"
        },
        {
            "text": "It really struck a chord with me when Paul explained that this can happen to anyone who sits for longer than 90 minutes at any given time."
        },
        {
            "text": "I must admit, as someone who has worked from home since the beginning of the pandemic, I often have to tell myself to get up and go but there have been many occasions where I have realised, I’ve been sat still for too long and daily exercise is well overdue – could this be a product for me to alleviate such worries at home?"
        },
        {
            "heading": 3,
            "text": "Can you just talk around the IP on the product?"
        },
        {
            "text": "After delivering a great factual pitch, Deborah Meaden was the first Dragon to ask the question that had been on my mind since Paul displayed his product. What IP protection have you got?"
        },
        {
            "text": "“We have a trade mark and design rights but we haven’t got a patent.”"
        },
        {
            "text": "So what do the design rights Paul has on his product mean? And what is the implication of the IP right that he hasn’t got."
        },
        {
            "text": "Designs are automatically protected by design rights. These can protect your design in the UK for 10 years after it was first sold or 15 years after it was created, whichever is earliest. However, registered designs offer more protection and last up to 25 years."
        },
        {
            "text": "To register your design, it must:"
        },
        {
            "heading": 3,
            "text": "Trade marks "
        },
        {
            "text": "Trade Marks protect a company brand, name or logo and are  registered for particular areas of business (classes). It is possible for similar marks to be registered in different classes."
        },
        {
            "text": "Take the word polo for example; the car, the mint, the aftershave. Three companies own the same word but for different areas of business."
        },
        {
            "text": "It is therefore advisable to search the trade marks database before submitting an application. You can check that your mark, or something similar, is not already registered, potentially saving you valuable funds and time."
        },
        {
            "heading": 3,
            "text": "“If you don’t patent it you can’t go back and re patent it”"
        },
        {
            "text": "Although Peter thought the product was great after disclosing his own personal experience with DVT, Deborah thought that she had already seen something very similar on the market."
        },
        {
            "text": "If your patent is already in the public domain in any format you will not be able to patent it.  Before seeking a patent it is always worthwhile seeking advice from a patent attorney."
        },
        {
            "text": "You can use a patent to protect your invention. It gives you the right to take legal action against anyone who makes, uses, sells or imports it without your permission."
        },
        {
            "text": "To be granted a patent, your invention must be all of the following:"
        },
        {
            "text": "Before you apply, check if a patent is right for your business."
        },
        {
            "text": "Although patents are a great way to protect an invention the process can be lengthy and expensive."
        },
        {
            "text": "Renewal fees are also payable on the fourth anniversary of the filing date and every year after that to keep it in force."
        },
        {
            "text": "Therefore, you may want to consider the current market and your target audience before applying."
        },
        {
            "text": "Our Do I need a patent? guide can help you decide whether a patent is right for you."
        },
        {
            "text": "Watch our video for more information:"
        },
        {
            "text": "Fortunately for Paul, Touker Sulymen decided to invest in Pauls RBR legflow! Congratulations Paul."
        },
        {
            "text": "How the IPO can help your business"
        }
    ]
}