{
    "url": "https://socialcare.blog.gov.uk/2022/03/03/external-care-givers-really-are-essential/",
    "title": "External care givers really are essential",
    "authors": [
        "Laura Storey"
    ],
    "categories": [
        "Care and support",
        "Carers",
        "coronavirus"
    ],
    "pub_date": "2022-03-03T16:32:17+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Care from inside and outside"
        },
        {
            "text": "Family, friends, and external carers are integral to our residents’ wellbeing and safety. The relationships they have with their loved ones underpin who they are and remain just as important, if not more so, when people move into our service."
        },
        {
            "text": "The pandemic has impacted every aspect of life and changed all our daily routines. At Outwood, a specialist residential service in West Yorkshire, we support individuals with learning disabilities and autism who rely heavily on familiar routines and structures, which their families and external carer givers are very much a part of."
        },
        {
            "text": "The role of an essential care giver was introduced in the government guidance on visiting in care homes in midst of the pandemic so that residents can have support and companionship from a relative/friend even during periods of lockdown. It refers to individuals who may provide companionship or emotional support and carry out personal care tasks with service users."
        },
        {
            "text": "At the height of the lockdown, Cygnet Health Care gave tablet devices to every service and installed all the necessary virtual communication tools, including Zoom and Skype so that residents could stay in touch with family and friends who might normally have visited in person. Those tools actually enabled some families to be more involved than before, because it meant they could join us at regular meetings which otherwise might have been a struggle in-person."
        },
        {
            "text": "Later, when only outdoor visits were allowed, we were able to purchase outdoor furniture so that we could have a small garden party and treasure hunt in the garden."
        },
        {
            "heading": 2,
            "text": "Person-centred partnership"
        },
        {
            "text": "Cygnet has developed a dedicated ‘Support and Engagement: A Partnership Strategy’, which recognises the central importance of working with people, their friends, families and loved ones for maximum quality of life and well-being. Working together, we adopt a strengths-based approach and focus on consistent improvement of our services, based on the valuable feedback we receive."
        },
        {
            "text": "We understand it is essential to have constant conversations with families and we value their input in care planning. After all, these are the people who know our residents the best and have their interests at heart."
        },
        {
            "text": "Some of our residents have difficulty expressing themselves and often essential care givers like families and friends can shed light on the person’s past, their likes and dislikes, beliefs and values that can be really valuable when it comes to helping residents move forward."
        },
        {
            "text": "Services like ours also have a responsibility, I believe, to offer support to friends and family, alongside the care to residents. For us, family and external carers are part of the small community we have at Outwood. In this spirit, we make adjustments to make sure our service users, their families and external carers are all well supported when the unexpected happens, including the ongoing pandemic."
        },
        {
            "text": "Family and external carers’ involvement should be front and centre of good care. It has been a pleasure to collaborate with them so closely at Outwood to support our residents in these challenging times."
        }
    ]
}