{
    "url": "https://foresightprojects.blog.gov.uk/2022/03/03/finding-the-technologies-that-matter/",
    "title": "Finding the technologies that matter",
    "authors": [
        "Charlie Rogers"
    ],
    "categories": [
        "Emerging Technologies"
    ],
    "pub_date": "2022-03-03T11:47:43+00:00",
    "content": [
        {
            "text": "     "
        },
        {
            "text": "We, the Technology and Science Insights team in the Government Office for Science, are updating our list of priority technologies for 2022. We are on the hunt for new technologies so we can provide up to date insights to policymakers. The first way we do this is through data analysis. But the second is through speaking to experts.  "
        },
        {
            "text": "If you have expertise in emerging technology and are aware of new technological innovations that may be of interest to us, we would like to hear from you.  "
        },
        {
            "text": "Who are we? "
        },
        {
            "text": "We help government departments keep up to date with developments in emerging technology. Our work assists policy makers in understanding and acting upon risks and opportunities to future proof decision making. Our evidence base supports government to target science and technology to address the most significant challenges of the future and increase UK prosperity, wellbeing and security. "
        },
        {
            "text": "Updating our list "
        },
        {
            "text": "The first step in updating our list is to collate the work of technology and horizon scanning teams across government to identify areas of importance. We will then engage with experts from academia and industry to identify early-stage technologies that policymakers may not be aware of.  The next step is to synthesize this information and set out our view of the technologies that should be on Government’s radar. Finally, these findings will be tested with experts. "
        },
        {
            "text": "For the last two years, we have been tracking 65 emerging technologies from across a wide range of technology areas. Our work is incredibly broad, spanning the seven technology families outlined in the 2021 BEIS Innovation Strategy and beyond. "
        },
        {
            "text": " The criteria we use to filter technologies for inclusion are:  "
        },
        {
            "text": "   1)   Technologies should be well defined  "
        },
        {
            "text": "   2)  Technologies should be “emerging” and not already commercialised "
        },
        {
            "text": "   3)  Technologies should either:"
        },
        {
            "text": "   a. reflect cross-cutting departmental interests   "
        },
        {
            "text": "   b. contribute to productivity, growth and/or international influence to support HMG ambitions to sustain “strategic advantage” in Science & Technology   "
        },
        {
            "text": "   c. enable/accelerate the development of other emerging technologies within the ecosystem   "
        },
        {
            "text": "  What next?  "
        },
        {
            "text": "Once we have an updated list of technologies, our analysts will track their emergence so we can see what’s coming from the global research base and identify hot spots of investment and patent filing activity. These data-driven insights are at the heart of our evidence capability and will soon be accessible to all civil servants via our GOSInsights web application.  "
        },
        {
            "text": "GO-Science Emerging Technology Taxonomy "
        },
        {
            "text": "We are also developing an Emerging Technology Taxonomy to define, relate and categorise the technologies we are tracking. The work will provide a standardised set of definitions for technologies to improve understanding of EmTech within government and facilitate insight sharing between departments. This is ultimately a tool we would like to share externally with other governments, as well as collaborators in industry and academia, so watch this space! "
        },
        {
            "text": "What do we need from technology experts? "
        },
        {
            "text": "We are hoping to cast our net far and wide to capture technologies across the Seven Technology Families and beyond. We are looking for technologies to add to our list, and for experts to review our final output.  "
        },
        {
            "text": "If you are a researcher, a technology expert or investor and have ideas about technologies you think we should track, please get in touch via emtech@go-science.gov.uk  and tell us how your technology meets the criteria above. We are always very happy to hear from civil servants interested in our work, including our web app.  "
        }
    ]
}