{
    "url": "https://educationhub.blog.gov.uk/2022/03/03/how-we-are-strengthening-family-support-and-helping-thousands-more-families-to-adopt/",
    "title": "How we are strengthening family support and helping thousands more families to adopt",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Adoption"
    ],
    "pub_date": "2022-03-03T17:10:49+00:00",
    "content": [
        {
            "text": "The importance of a loving, stable family cannot be overstated, no matter what shape it takes."
        },
        {
            "text": "That’s why, this week, we have unveiled a series of measures to strengthen support for new and growing families in adopting, investing millions of pounds as part of our National Adoption Strategy."
        },
        {
            "heading": 3,
            "text": "What have you announced? "
        },
        {
            "text": "We have announced that vulnerable children living in care are waiting less time to find permanent homes, with a multi-million-pound investment to support thousands of new adoptive families settle into their new lives."
        },
        {
            "text": "We have also released important data which shows a positive picture of more adopters being approved and fewer children waiting for adoption."
        },
        {
            "heading": 3,
            "text": "How much is this funding and how will it be used? "
        },
        {
            "text": "New funding worth more than £160 million will build on existing support, helping remove the remaining barriers in adoption and reduce delays for thousands more children still waiting in care, so they can be matched more quickly with the right family."
        },
        {
            "text": "This includes £144 million for the government’s Adoption Support Fund to improve support for new and growing adoptive families. Adoptive families will also receive additional support including cognitive therapy, family support sessions and activities to help children recover from earlier traumas like abuse or neglect, helping them settle into their new families and homes."
        },
        {
            "text": "The new funding also includes £19.5 million to strengthen the work of Regional Adoption Agencies, improve national matching between parents and children, and focus on the recruitment of prospective adopters from all communities ensuring they are not deterred from the idea of adoption because of their background."
        },
        {
            "heading": 3,
            "text": "What does the data show in terms of adoption uptake? "
        },
        {
            "text": "It is promising to see that adoptions are on the rise, with the number of children waiting to be adopted falling."
        },
        {
            "text": "The latest stats show overall 3,700 children left care under a permanence order between April-September 2021-22 – either through adoption or a Special Guardianship Order, where a close relative or family friend takes parental responsibility – an increase of 31% on the same period last year."
        },
        {
            "text": "The number of children waiting longer than 18 months to be adopted has also fallen, despite the challenges faced by the care sector during the pandemic."
        },
        {
            "text": "We also launched our recruitment campaign to find more adoptive parents in 2019, which includes a focus on prospective parents from Black and Minority Ethnic communities."
        },
        {
            "text": "Data from this campaign shows an increase in the number of approved adopters waiting to be matched to children in care, with more than 100 adopters from Minority Ethnic backgrounds being approved at the end of September 2021. This increase takes the number to 590 compared to 450 at the end of March 2020 – an increase of more than 30%."
        }
    ]
}