{
    "url": "https://marinescience.blog.gov.uk/2022/03/03/identifying-cites-listed-sharks-amidst-a-global-pandemic/",
    "title": "Identifying CITES-listed sharks amidst a global pandemic",
    "authors": [
        "Joanna Murray"
    ],
    "categories": [
        "Vulnerable species"
    ],
    "pub_date": "2022-03-03T10:55:45+00:00",
    "content": [
        {
            "text": "Warning: This blog contains images of sharks without fins or heads as part of a training exercise to identify species by their trunks. Some people may find this distressing."
        },
        {
            "heading": 3,
            "text": "Since last we spoke"
        },
        {
            "text": "It seems like a lifetime ago since we last wrote about our Illegal Wildlife Trade (IWT) Challenge Fund project on the trade of sharks and rays in Indonesia. It was actually only early 2020, when Cefas scientists had travelled to Jakarta to join a dedicated team of experts from the Ministry of Maritime Affairs and Fisheries (MMAF), Wildlife Conservation Society (WCS) Indonesia, Elasmo Project, University of Salford and the Mariani Lab, to take part in our projects milestone Training the trainers workshop."
        },
        {
            "text": "January 2020 was a hugely productive month for the project; 20 verifiers representing six Marine and Fisheries Resource Management Agency (BPSPL) offices across Indonesia received an intensive five-day training programme, project team members accompanied shark expert Debra Abercrombie to Bali to collect imagery and information to inform the development of the first visual carcass identification guide for CITES-listed species, and our IWT Challenge Fund PhD candidate Andhika Prasetyo collected an impressive 565 samples from factories and fish markets across Indonesia, which he would go on to analyse in the UK."
        },
        {
            "text": "But shortly after, the Covid-19 pandemic emerged bringing the world to a standstill, and so too our project. Before the pandemic, training events and scientific collaboration took place in person, and training of staff managing trade of shark and ray products, such as fins, involved seeing, holding, and feeling the very products that need to be identified.  For Andhika, who had just landed back in the UK armed with nearly 600 samples to extract DNA from, his entire lab work schedule went up in the air as the university’s laboratory closed."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Trade in sharks and ray during Covid-19"
        },
        {
            "text": "Of course, it’s not just our projects training schedule and activities that has been delayed – the shark and ray trade in Indonesia has itself been directly affected by the global pandemic."
        },
        {
            "text": "Reports in national news articles and scientific publications suggested a significant decline in trade during the early phase of the pandemic with one article in Mongabay stating that in early 2020, there was a 68% decline in trade from West Nusa Tenggara compared to the previous year. A similar story was published in the proceedings of the 4th International Conference on Sustainability Science, where there was a drop in the value of shark products in Kupang, East Nusa Tenggara due to low demand."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Adaption and innovation"
        },
        {
            "text": "Despite a demand reduction, there were still exports of shark and ray products which had to be inspected and verified, and in these times of adversity, shark trade management staff in Indonesia who are responsible for checking boxes of product prior to export, had to adapt."
        },
        {
            "text": "Inspectors modified the way they checked the contents of bags and boxes using the video call function in apps such as WhatsApp and Zoom to conduct their initial inspection. In cases where this online inspection was inadequate (for example where suspicious products were seen or where online visual identification was not possible), the technical staff collected samples for DNA testing."
        },
        {
            "text": "As if a PhD studentship wasn’t challenging enough, Andhika had to modify his study plan to account for not being able to access the lab. Instead, he focused his attention on publishing the first chapter of his PhD in which analysed shark and ray trade in and out of Indonesia, mapping the flow of trade and identifying mismatches in declared exports and what other countries report they import. Andhika also grabbed the chance to join his lab colleagues for virtual training sessions on bioinformatics – the computational science of biological data; then he could analyse the DNA from his shark and ray tissue samples once he was able to get his samples processed. He also produced articles, a poster and footage about his research."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Moving forward"
        },
        {
            "text": "With the rise and fall of Covid cases globally, the process for inspecting shark and ray products has never returned to its normal procedure despite indications from fishers, fish collectors, and trade management staff which suggest a substantial increase in 2021 trade compared to the lull of 2020. But as the world slowly returns to some level of normality and trade in shark products bounces back, our project activities have begun to resume."
        },
        {
            "text": "Andhika was able to access the molecular lab in January 2021 and although working around reduced numbers of scientists in the lab and fewer opportunities for face-to-face training, he spent almost 3,120 hours in one year(!) on his laboratory work completing his sample analysis by the end of 2021. Andhika is now in the final writing phase of his studies and plans to return to Indonesia in July 2022 to a scientific role within the governments National Research and Innovation Agency (BRIN)."
        },
        {
            "text": "In early October 2021, we also held our first combined (in person and virtual) training event in wedgefish and giant guitarfish ID and identification of shark and ray carcasses. The technical team and some members of the training team met in person in Jakarta and were joined by additional trainers, workshop facilitators and the participants located across Indonesia via an online platform. Sixty-two participants were able to attend the training which focused on the identification of Wedgefish and Giant Guitarfish and the identification of sharks and rays from."
        },
        {
            "text": "Budi Raharjo, one of the workshops trainers from LPSPL Serang said:"
        },
        {
            "text": " "
        },
        {
            "text": "Given the challenges of shark and ray product identification training virtually, the second workshop which took place from 14-15 of December 2021 in Bali, was conducted in person with 36 socially distanced participants. The two-day training event was divided into two parts: classroom training on identification methodology on the first day, and identification practice on the second day. The training was a great success due to the full support from the MMAF Directorate of Conservation, BPSPL Denpasar, and a shark exporting company in Bali who provided facilities and shark and ray specimens for practical identification training."
        },
        {
            "text": "Although this training was designed for verifiers of the BPSPL Denpasar, we also involved representatives from other related institutions and agencies in Bali; the MMAF research and training center office in Bali, the BKIPM (quarantine agency) of Denpasar, the MMAF Tuna Research Center of Denpasar, the PSDKP (MMAF surveillance agency) of Benoa, and the Pengambengan Fishing Port Authority. We also had two trainees from this shark exporting company on board. The training was delivered by four trainers: Mr. Budi Rahardjo and Mrs. Nurmila Anwar from LPSPL Serang, Mr. Endratno from MMAF, and Ms. Benaya Simeon from WCS."
        },
        {
            "text": "Participants' understanding and identification skills have improved because of the opportunity to directly identify shark and ray specimens, with higher average scores in post-training tests compared to results from the previous virtual training. Some even received a perfect post-test score! We hope that this training model can be replicated in other parts of Indonesia, although the challenge is to ensure we can provide specimens for training practice. This year we will conduct a third training for stakeholders in Central Java, one of the hotspots of shark and ray fisheries in Indonesia."
        },
        {
            "text": " "
        },
        {
            "text": "We close this blog almost exactly as we did our last post in February 2020. The next phase of our project will be a visit to the UK in June for MMAF officials, selected BPSPL shark product inspectors, and REKAM staff. The visit will include seminars at Cefas on our fisheries data-collection and stock assessment process, data-limited assessments, shark and ray research, and the Fish Health Inspectorate. This will be followed by visits to Border Force’s CITES team based at Heathrow airport to see how they deal with illegal wildlife trade head-on, and Defra, to meet the team supporting this initiative and representing the UK within the CITES community. We can’t wait to be reunited in person with our project team!"
        }
    ]
}