{
    "url": "https://ipo.blog.gov.uk/2022/03/03/one-ipo-transformation-first-glimpse-of-the-new-customer-accounts/",
    "title": "One IPO Transformation – first glimpse of the new customer accounts",
    "authors": [
        "Chris Mitchell"
    ],
    "categories": [
        "IPO",
        "Transformation",
        "User research"
    ],
    "pub_date": "2022-03-03T12:23:18+00:00",
    "content": [
        {
            "text": "Chris Mitchell, Project Lead, explains what you can expect from the new IPO customer accounts and gives you a first glimpse of what the service will look like."
        },
        {
            "text": "Our One IPO Transformation programme is now in full swing. The new patents service is launching in just over two years, followed by a new service for trade marks in 2025 and designs in 2026."
        },
        {
            "text": "I’m really happy to be working with the talented team of people that has been brought together to work on the Manage IP project."
        },
        {
            "text": "Designing new services is a collaborative process that starts with user’s needs and relies on continuous feedback and improvement. With that in mind, I want to give you an early glimpse of our work. I’d be really interested to hear your initial thoughts and feedback."
        },
        {
            "heading": 3,
            "text": "Why are we building you a customer account?"
        },
        {
            "text": "At the moment, managing your IP and account information is clunky. There are more than 30 different forms relating to ‘Manage IP’ services. You don’t get automatic updates or notifications to see how your application or request is progressing. Many requests have to be made separately for each IP right. There’s no single view of your IP."
        },
        {
            "heading": 4,
            "text": "We’re building a customer account that will allow you to manage all of your IP in one place. You’ll see several benefits from this:"
        },
        {
            "text": "We want our customers to be able to effortlessly control their IP and account information."
        },
        {
            "heading": 3,
            "text": "Where we are now"
        },
        {
            "text": "We’ve started designing and testing early prototypes of the customer accounts, focusing on the features which will be most tricky to get right."
        },
        {
            "text": "Below is some more information and a demo video for each of those features. We’re still changing and improving the designs, so there’s plenty of time for you to give us feedback. The features that make it into the final design may change as we learn more."
        },
        {
            "heading": 3,
            "text": "Account Dashboard"
        },
        {
            "text": "The account dashboard is the home page of the IPO accounts and is the gateway to our new services. It gives you a really good idea of what the IPO accounts could look like and how you’d make the most of everything they have to offer."
        },
        {
            "text": "We’ve listed the services in order of what you’re most likely to want to use based on our testing so far. We plan to have different views for different types of customers."
        },
        {
            "text": "The ‘View IP Rights’ page gives you a list of all your IP rights in one place. No more visiting different websites to search for different IP rights. It allows you to search your rights; filter them by type of right, status, filing date or expiration date; and download your list of rights."
        },
        {
            "text": "View our short demo video where we run through our first design of the account dashboard."
        },
        {
            "heading": 3,
            "text": "Creating an IPO account"
        },
        {
            "text": "We’ve also looked at how account registration will work. Creating your account is straightforward and just like Amazon, Netflix or any other online service."
        },
        {
            "text": "You’ll also need to link any IP rights you own or manage to your account. It should only take a few minutes and you'll only have to do it once. We've tried to make the process as easy as possible, and when the service launches, we’ll have people on hand to support you."
        },
        {
            "text": "Below is a short demo video where we run through our first design of the registration and linking process."
        },
        {
            "heading": 3,
            "text": "Transferring ownership of IP"
        },
        {
            "text": "We also took a look at a service that we only offer on paper at the moment. We want to give you the ability to digitally record a transfer of IP ownership for multiple rights in a single transaction. We hope that this will help you keep more accurate records and keep the IP register more up to date, as well as saving time."
        },
        {
            "text": "Currently, after you’ve bought an IP right you have to send us evidence that a transfer of ownership has taken place before we update our records. To make things easier, we’re exploring if we can do this without asking for evidence. Instead we would notify the seller that their IP right has been transferred to another account. They would then have the opportunity to login and challenge the transfer if they wish."
        },
        {
            "text": "Below is a short demo video where we run through our first design of how you transfer ownership of an IP right."
        },
        {
            "heading": 3,
            "text": "What’s next"
        },
        {
            "text": "Over the next few months we’ll be refining and improving these designs and also designing other parts of the account, like:"
        },
        {
            "text": "We’ll also be doing further research into how we can link our services to IP management software. This would allow customers to view and edit their IP rights from their existing IP management software."
        },
        {
            "heading": 3,
            "text": "What do you think?"
        },
        {
            "text": "I hope you like what we’ve been working on so far, and we look forward to working with you to improve these designs and make the best service possible."
        }
    ]
}