{
    "url": "https://environmentagency.blog.gov.uk/2022/03/03/operation-goldjuno-joining-forces-to-stop-crime-in-the-waste-industry/",
    "title": "Operation Goldjuno: joining forces to stop crime in the waste industry",
    "authors": [
        "elenaholmes"
    ],
    "categories": [
        "Regulated industry",
        "Waste"
    ],
    "pub_date": "2022-03-03T16:21:09+00:00",
    "content": [
        {
            "text": "Kevin Knight, Senior Environmental Crime Officer, discusses an operation carried out by the Joint Unit for Waste Crime (JUWC) and the Environment Agency to tackle catalytic converter theft and wider illegal waste site operations."
        },
        {
            "text": "Last year Operation Goldiron involving the Joint Unit for Waste Crime (JUWC) and Environment Agency helped reduce catalytic converter thefts by a whopping 57%. But we weren’t stopping there! Our next move was to coordinate a multi-agency operation, code named, Operation Goldjuno, to tackle not just catalytic converter theft, but also the illegal waste sites treating or buying them and to target permitted sites committing offences."
        },
        {
            "text": "While rates of offending have continued to be significantly lower than previous years, Operation Goldjuno seeks to keep offending levels down. The thefts are driven by the increase in the price of metals found within catalytic converters, namely Rhodium and Palladium but these are classed as hazardous waste by the Environment Agency meaning they require careful handling to prevent harm to peoples’ health and our environment. Through raising the profile of catalytic converter crime, infrastructure crime and cash-based money laundering happening within the waste industry, Operation Goldjuno worked to mobilise a proportionate response to assist in intelligence gathering to identify suspected crime."
        },
        {
            "text": "Catalytic converter thefts peaked in March 2021, with 3,245 recorded in the UK that month alone. A surge in the price of precious metals saw theft of catalytic converters become a national issue, and Police across the UK joined forces to combat the trend with the JUWC. Theft of catalytic converters continues to be a priority crime for Police forces across the country with the source sites linked to waste metal sites."
        },
        {
            "text": "We know our best chance to stop waste criminals is by working in partnership with other agencies."
        },
        {
            "text": "Intelligence held by the Environment Agency helped drive activity during the Operation Goldjuno week of action.  We worked with the British Transport Police to assess and develop this intelligence which enabled us to target our resources where we would get the biggest benefit.  This demonstrates the importance of intelligence being reported to us so that we can use it to help focus our efforts."
        },
        {
            "text": "The national week of action was carried out across all Environment Agency areas and 43 Police forces, working together with British Transport Police and other partners including local councils and BT Open Reach. The results from the week demonstrate the benefits of partners working together."
        },
        {
            "text": "During the week of action, the Environment Agency visited 100 scrap metal dealer sites. While the Police looked for stolen cables, catalytic converters and other stolen metal, we used our powers to check records, permits and exemptions."
        },
        {
            "text": "We identified a number of illegal waste sites and non-compliance with permit conditions at several permitted sites. We also passed intelligence to the Police regarding potential stolen metal."
        },
        {
            "text": "Work continues by the JUWC on intelligence gained on other illegal sites actively involved in criminality within scrap metal dealers and End of Life Vehicle operators."
        },
        {
            "text": "Remember if you suspect illegal waste activity, you can report it anonymously to Crimestoppers: 0800 555 111  Give information | Crimestoppers (crimestoppers-uk.org)"
        },
        {
            "text": " "
        }
    ]
}