{
    "url": "https://mattersoftesting.blog.gov.uk/reviewing-the-authorised-examiner-designated-manager-aedm-role/",
    "title": "Reviewing the Authorised Examiner Designated Manager (AEDM) role",
    "authors": [
        "Helen Jacquest"
    ],
    "categories": [
        "MOT Modernisation",
        "MOT testing service",
        "News and updates"
    ],
    "pub_date": "2022-03-03T15:03:01+00:00",
    "content": [
        {
            "text": "The role of a trained person to manage MOT garage activities was first introduced in 1995 and became known as the Authorised Examiner Designated Manager (AEDM) in 2005."
        },
        {
            "text": "The AEDM’s role is really important, as they make sure that garages have the right approach and checks in place to maintain MOT test standards and procedures."
        },
        {
            "text": "After consultation with the MOT industry, we’ve been working to make the responsibilities of the AEDM clearer."
        },
        {
            "text": "As part of these changes, we’re also going to make the Authorised Examiner Principal (AEP) a formal role on the MOT testing service (MTS). New AEPs will get access to MTS for the first time and be able to see data relating to their Authorised Examiner (AE) and Vehicle Testing Station (VTS) records."
        },
        {
            "text": "Making things clearer "
        },
        {
            "text": "We’re making changes to the AEDM position so it’s clearer what the AEDM is responsible for. This will help people that carry out the role to be more effective."
        },
        {
            "text": "By making these changes, we’re recognising the importance of the AEDM role in the MOT service."
        },
        {
            "text": "We know there is currently some confusion about who manages the AEDM role in a garage. It may be that the wrong person in the company has been trained for the job, or they’re not clear about what the role involves."
        },
        {
            "text": "Some AEDMs are not accessing MTS, which means there are times when they’re not monitoring the MOT activities or they’re delegating the AEDM work to others."
        },
        {
            "text": "This can lead to a lack of engagement by AEDMs, which affects the level of management and supervision in the MOT station."
        },
        {
            "text": "Expanding who can be an AEDM"
        },
        {
            "text": "To address this, we’re changing the eligibility of the AEDM role. It can now be held by either:"
        },
        {
            "text": "This means that the AEDM no longer has to be an AEP, opening opportunities for more people to perform the AEDM role."
        },
        {
            "text": "Better explanation of the AEDM role"
        },
        {
            "text": "We’ve updated the MOT testing guide to define the tasks and responsibilities of the AEDM role, as well as other roles in the MOT testing service."
        },
        {
            "text": "We hope this will give you a clearer description of the roles and how they fit into the MOT testing service."
        },
        {
            "text": "It’s important you have a look at these descriptions and familiarise yourself with them."
        },
        {
            "text": "Action you may need to take"
        },
        {
            "text": "MOT garages who make a change to their approval (for example by adding or removing an AEP, or changing their AEDM) will need to complete a VT01 form."
        },
        {
            "text": "Each AEP will also need to create a personal account on MTS."
        },
        {
            "text": "Doing this will give the AEP access to MTS, which is a new feature we’re adding. AEPs will get to see data relating to their AE and VTS records."
        },
        {
            "text": "Further changes"
        },
        {
            "text": "We’ll soon be consulting with the industry on further proposals for the development of the AEDM role. This will cover:"
        },
        {
            "text": "We’ll also look at how we can improve the other role descriptions in the MOT service. We’ll blog more about these upcoming changes in the next few months. In the meantime, please leave any questions you might have below and we’ll get back to you."
        }
    ]
}