{
    "url": "https://publicpolicydesign.blog.gov.uk/2022/03/03/the-well-being-sweet-spot/",
    "title": "The Well-Being Sweet-Spot",
    "authors": [
        "Sophie Howe"
    ],
    "categories": [
        "Thought leadership"
    ],
    "pub_date": "2022-03-03T12:00:06+00:00",
    "content": [
        {
            "text": "Everyone has their own individual ‘sweet-spots’. Maybe it’s a bottle of wine that hits the perfect balance of not too expensive and great taste after a long week of hard work. Maybe it’s striking the golf ball in exactly the right spot on a glorious Sunday afternoon among friends, or that blissful moment of rolling over after waking up to see an hour left before your alarm on a rainy day."
        },
        {
            "text": "Some sweet spots will need to be left in the past; we may have to forget the joy of hitting exactly £20 of petrol when we fill up our cars, and instead be satisfied with our electric charging points which are better for our planet’s health."
        },
        {
            "text": "But there’s a new ‘sweet-spot’ that we can all look forward to. I call this the ‘well-being sweet spot’."
        },
        {
            "text": "So, what do I mean by this?"
        },
        {
            "text": "The well-being sweet spot is all about making policies that are interconnected to meet holistic well-being goals. It’s the point where different policies, some that may seem unrelated, overlap and meet in the middle to reach true well-being."
        },
        {
            "text": "Take healthcare for instance. Increasing the budget for mental health support in schools is an obvious policy to improve health and well-being. But what if that was paired with a universal basic income that allows the poorest in society to heat their homes in winter, and free bus fares to reduce congestion and lower pollution in our communities. What about building safe bike paths for the commute to work or opening more green areas in our cities to create the physical and mental space we need in our days. And we can go further. Imagine if schools could only feed our children locally grown food, not only improving the community’s economy, but giving our young people a great start in life with nutritious food without the carbon footprint."
        },
        {
            "text": "The well-being sweet spot is all about turning away from the ‘obvious’ or traditional solutions in favour of the creative. It isn’t just about policies either, it’s a spot where people meet for integrated, collaborative work from diverse backgrounds and schools of thought. One of my favourite examples is our National Museum working with local health boards to utilise our rich culture and history in Wales for the well-being of our communities and prevent mental health issues and loneliness."
        },
        {
            "heading": 2,
            "text": "Safeguarding future generations"
        },
        {
            "text": "In Wales, we have legislation that helps us to meet this sweet spot. In 2015, the Welsh Parliament passed the ‘Well-Being of Future Generations (Wales) Act’ and appointed me as the world’s first Future Generations Commissioner. It is my role as the ‘guardian of future generations’ to ensure that the decisions we make to improve the lives of our current communities always consider the communities of tomorrow."
        },
        {
            "text": "The Act is centered around the ‘Sustainable Development Principle’ which requires that each of the 42 public bodies, including Welsh politicians, “must act in a manner which seeks to ensure that the needs of the present are met without compromising the ability of future generations to meet their own needs”. Each public body listed in the Act, which includes bodies such as local health boards and arts & sports councils, have a legal duty to improve the economic, social, environmental and cultural well-being of Wales. To do this they must set and publish wellbeing objectives and take every reasonable action to make sure they meet the objectives they set."
        },
        {
            "text": "The Act not only sets a legal duty but supplies a blueprint of the Wales we want to see and how to make decisions to get there. The seven well-being goals provide a shared vision for the public bodies:"
        },
        {
            "text": "Public bodies can’t pick and choose, they must work to meet all of these goals, and that’s when we find collaboration, integration, and the well-being sweet spot."
        },
        {
            "text": "The ‘5 ways of working’ asks decision makers to act in collaboration with others, consider how their decision making can integrate the well-being goals, involve those affected by the decisions, balance short-term needs with long-term needs for future generations, and act preventatively to stop issues occurring in the first place."
        },
        {
            "heading": 2,
            "text": "Delivering meaningful change"
        },
        {
            "text": "This new way of working is producing results. The Welsh Parliament was the first parliament in the world to declare a climate and nature emergency, and Wales now sits at number 3 in the world for recycling whilst increasing spend on climate change solutions. We also have a Climate Ministry which combines the environment, energy, housing, planning and transport portfolios for truly integrated decision making."
        },
        {
            "text": "After scrapping plans for a £1.4bn, 13-mile relief road that would have torn through a nature reserve, the Welsh Government announced a pause on road building - the first government to do so. We also have a new transport strategy focussed on public transport and active travel, putting the car at the bottom of the travel hierarchy, and a new future-focussed curriculum for our children framed around well-being. I am especially looking forward to the Welsh Government’s Universal Basic Income pilot, which if implemented fully, could reduce poverty by 50%. These are all examples that politics can, and should, be done differently. They show that putting health before wealth and planet before profit is possible."
        },
        {
            "heading": 2,
            "text": "Making global change"
        },
        {
            "text": "Things are changing in Wales for the better, that’s undeniable. Yet, although we are a small and mighty nation, if we are going to make global change, we need other nations to come on board with our vision and implement well-being frameworks of their own. In 2021, the UN announced its commitment to the Future Generation vision with support for the establishment of a UN Special Envoy for Future Generations, a Futures Summit in 2023 and a UN Declaration for Future Generations. Inspired by the Welsh model, the UN’s futures vision will shape how nations around the world make decisions today for a better tomorrow. Yet, until this becomes a priority for every nation, we will continue to live in a world that allows the poor to get poorer, our planet to get hotter, and our communities to be separated by hate."
        },
        {
            "text": "I have been working with the other devolved nations and Ireland on their plans and considerations about adopting similar models for their current and future generations, as I do with many countries around the globe. There is a global growing interest and care about the limits of our planet and the needs of future generations, and I am calling on countries to establish governance mechanisms for future generations, building on the leadership in Wales and at the UN. Speaking with young people across the globe, they are quite rightly concerned that political leaders and systems are only paying ‘lip service’ to their interests, only sharing their campaigns for the re-tweets, and passing legislation to appease but barely touch the surface of the issue. We must highlight the importance of placing future generations at the centre of decisions and ensure that they have a voice at the policy level. I have found that the members of my Future Generations Leadership Academy have inspired my work and guided my journey as a commissioner."
        },
        {
            "text": "I truly believe that we can have collaboration where there is segregation, peace where there are wars, and prosperity where there is poverty. We just need the structure to make it happen. My vision for our future generations is a world in balance, for the world to be a sweet spot."
        }
    ]
}