{
    "url": "https://deframedia.blog.gov.uk/2022/03/03/uk-supports-global-action-to-tackle-plastic-pollution-at-un-environment-assembly/",
    "title": "UK supports global action to tackle plastic pollution at UN Environment Assembly",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Weekly stories"
    ],
    "pub_date": "2022-03-03T14:22:07+00:00",
    "content": [
        {
            "text": "There has been positive coverage today on BBC News Online, The Times, The Independent, Guardian, Financial Times, Evening Standard, Politics UK and in the Western Morning News on progress towards a new treaty to combat plastic waste and pollution."
        },
        {
            "text": "At the UN Environment Assembly in Nairobi yesterday there was UK and international support to establish an intergovernmental negotiating committee to develop an international, legally binding instrument on plastic pollution."
        },
        {
            "text": "We welcomed the move in a press release issued yesterday with BBC News, The Times, Independent and other outlets noting our support and including quotes from our International Environment Minister Lord Zac Goldsmith who attended the conference."
        },
        {
            "text": "While the terms of the treaty are still to be negotiated it could include measures that promote sustainable production and consumption of plastics, as well as more environmentally sound waste management."
        },
        {
            "text": "It is also hoped it will help tackle marine plastic pollution, one of the greatest global environmental challenges. It’s predicted that unless action is taken there will be a threefold increase in the amount of plastic flowing into the ocean between 2016 and 2040."
        },
        {
            "text": "Our landmark Environment Act gives us a raft of new powers to step-up our war against plastic pollution. We are also committed to introducing a Deposit Return Scheme for drinks containers, which will recycle billions more plastic bottles and stop them being landfilled or littered."
        },
        {
            "text": "Lord Zac Goldsmith, UK Government Minister for International Environment said:"
        },
        {
            "text": "While there are multilateral agreements to tackle biodiversity loss and climate change, up to now there has been no equivalent agreement to tackle plastic pollution."
        },
        {
            "text": "The resolution titled “End plastic pollution: towards a legally binding international instrument” establishes an Intergovernmental Negotiating Committee (INC) tasked with preparing a new treaty that would address plastic pollution through a life-cycle approach, with the aim of producing the treaty by 2024."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}