{
    "url": "https://hmlandregistry.blog.gov.uk/2022/03/03/were-accelerating-our-move-towards-digital-applications/",
    "title": "We’re accelerating our move towards digital applications ",
    "authors": [
        "Eddie Davies, Deputy Director – Digital Services"
    ],
    "categories": [
        "Digital services"
    ],
    "pub_date": "2022-03-03T14:37:11+00:00",
    "content": [
        {
            "text": "Last year we announced that, from November 2022, most AP1 applications to change the register via our online portal will only be possible through the new Digital Registration Service. Some AP1 applications – namely leases and transfers of part – were not planned to be part of the service until 2023. "
        },
        {
            "text": "We have been working with a wide range of customers to find out how we can make using the new service as simple and easy as possible. The good news is, based on those conversations, we have found a way to move ALL application types into the Digital Registration Service this year, including leases and transfers of part, months ahead of our original plans. "
        },
        {
            "text": "You can already use the Digital Registration Service for most AP1 applications, and over the next 6 months we’ll add the remaining transaction types ahead of the switchover to give you time to move to the new system before the withdrawal of the electronic Document Registration Service in November. \n\nSteps to electronic Document Registration Service withdrawal in November 2022 "
        },
        {
            "text": "Moving to digital applications is better for all of us. Already, customers using the new Digital Registration Service have seen significant improvements in requisition rates and found it quicker and easier to use than the old system.  "
        },
        {
            "text": "Andrea Fairweather, Residential Property Partner at Birchall Blackburn, told us: “It’s definitely making a difference. Taking the time to switch to the new service has been worth the benefits.”"
        },
        {
            "text": "Read more about Birchall Blackburn’s experience. "
        },
        {
            "text": "We know incorporating any change into an organisation is hard. We are committed to working with customers over the next 6 months to support this move. If you would like more information or help with making the switch to digital, please get in touch at drs@landregistry.gov.uk.  "
        },
        {
            "text": "Some customers are already submitting digital applications using their case management system or conveyancing software. Find out more about your options for switching to digital."
        },
        {
            "text": "Watch this overview about our switch to digital applications or this demo of the Digital Registration Service. "
        }
    ]
}