{
    "url": "https://companieshouse.blog.gov.uk/2022/03/03/what-the-economic-crime-transparency-and-enforcement-bill-and-the-corporate-transparency-and-register-reform-white-paper-means-for-companies-house/",
    "title": "What the Economic Crime (Transparency and Enforcement) Bill and the corporate transparency and register reform white paper means for Companies House",
    "authors": [
        "Louise Smyth - Chief Executive and Registrar of Companies",
        "Martin Swain - Director of Strategy, Policy and External Communications"
    ],
    "categories": [
        "Companies House transformation"
    ],
    "pub_date": "2022-03-03T17:15:24+00:00",
    "content": [
        {
            "text": "This week, the government has announced that new legislation will be brought forward to tackle economic crime. We welcome the measures set out in the Economic Crime (Transparency and Enforcement) Bill and the publication of the corporate transparency and register reform white paper."
        },
        {
            "text": "We’re keen to do all we can to play our part in tackling global economic crime and improving corporate transparency to prevent a wide range of illegality, including illicit finance and money laundering."
        },
        {
            "heading": 2,
            "text": "Our progress so far"
        },
        {
            "text": "We’ve been clear about our ambition to do more to tackle economic crime and we’ve been actively involved in shaping the government’s plans over the last few years. We published our 2020-25 strategy 18 months ago which clearly sets out our vision to be the most innovative, open and trusted registry in the world, and we’ve always known that we needed legislative reform to help us to achieve this. One of our 6 strategic goals is to ‘combat economic crime through active use of analysis and intelligence’ which demonstrates the strategic importance of this work for Companies House."
        },
        {
            "text": "We haven’t stood still since the launch of our strategy. We’ve been working hard on delivering our transformation programme, making sure we’ll be ready to move quickly once the legislation is introduced. This work has included quickly delivering digital solutions to support customers during the COVID-19 pandemic, transforming our systems and services to improve existing customer journeys, and scoping technological solutions for current and future challenges. Thanks to our brilliant people, we’re in a positive position as we approach the next milestone."
        },
        {
            "text": "We’ve vastly improved our relationship with law enforcement partners over the last few years and we already provide valuable intelligence for wide-ranging criminal investigations. However, up until now, we haven’t had the tools to go further and to prevent the misuse of corporate entities. We’ve been very keen to play a greater role and to go that step further, and these large-scale reforms will give us the powers to do that."
        },
        {
            "heading": 2,
            "text": "Register of Overseas Entities"
        },
        {
            "text": "We know that the new Register of Overseas Entities is an immediate priority, and we’re working at pace to make sure this is implemented as soon as possible after Royal Assent. The Register of Overseas Entities will apply retrospectively to property bought by overseas owners up to 20 years ago in England and Wales and since December 2014 in Scotland. The new register will be held by Companies House, with support from the UK’s Land Registries."
        },
        {
            "text": "The Register of Overseas Entities will be at the heart of a new global standard for transparency and will greatly contribute to improved transparency of ownership. Entities who do not declare their ‘beneficial owner’ will face restrictions over selling their property, and those who break the rules could face up to 5 years in prison. The new register will support a new whole-system approach to tackling economic crime and we’re proud to be at the forefront of this landmark change."
        },
        {
            "heading": 2,
            "text": "Wider reforms of Companies House"
        },
        {
            "text": "We’re also making sure that the wider reforms of Companies House included within a further Economic Crime Bill are at the front and centre of our transformation programme. These new measures will enable us to play a much broader role in tackling economic crime and improving corporate transparency. They include:"
        },
        {
            "text": "All these measures combined will ensure that the UK continues to be a great place to do business, while taking a tough stance against economic crime and the misuse of corporate entities. We believe these wide-ranging reforms will enable us to play a leading role in achieving this ambition."
        },
        {
            "text": "We’re ready to implement the biggest transformation to Companies House since 1844, and to play our part in tackling economic crime and driving confidence in the UK economy."
        }
    ]
}