{
    "url": "https://defradigital.blog.gov.uk/2022/03/03/why-im-celebrating-world-book-day/",
    "title": "Why I’m celebrating World Book Day",
    "authors": [
        "Abbi Smith"
    ],
    "categories": [
        "Defra digital",
        "Defra interaction",
        "Defra services",
        "Open data"
    ],
    "pub_date": "2022-03-03T08:00:34+00:00",
    "content": [
        {
            "text": "Even as a librarian my heart sinks a little at the thought of World Book Day. Am I the only parent who encourages their child to dress as a particular book character, because it will be easy to get a costume together? I suspect not."
        },
        {
            "text": "This year my son Walt wants to dress up as Bilbo Baggins – is that an improvement on Captain Underpants, or worse? It’s certainly not as easy as Tintin. But if dressing up helps kids get enthusiastic about books and reading, I really don’t mind."
        },
        {
            "text": "Evidence from the OECD in 2002 found that reading for pleasure is more important for children’s educational success than their family circumstances, their parents’ educational background or their socio-economic status. Getting a costume together for World Book Day might be a pain, but if it helps develop a life-long habit of reading for pleasure that improves my child’s life chances, bring it on!"
        },
        {
            "heading": 2,
            "text": "No encouragement needed in our house"
        },
        {
            "text": "I’m actually very lucky because there is nothing my son would rather do than read. When he was a toddler, we’d spend a good hour sitting in the book corner of local playgroups reading the same books we had at home.\nNow he can read, the first thing he does on getting home from school is pick up a book. He reads in the car (though he knows it’ll make him sick), in the bath and long into the night. World Book Day for him is preaching to the converted."
        },
        {
            "heading": 2,
            "text": "Déjà vu or natural progression?"
        },
        {
            "text": "But what does the future hold for him? I too loved reading and ended up becoming a librarian, but it’s not always the right career choice for a bookish person. The Defra library, like all libraries, has the needs of the customer at its heart, so first and foremost a librarian needs to be a people person. If you’re not, you’re unlikely to enjoy your job or give your users the responsive and reliable service they need."
        },
        {
            "text": "This year’s World Book Day carries the strong message for all children that ‘you are a reader ‘. It will be filled with lots of exciting, celebratory ways to promote reading for pleasure on World Book Day, and all-year round."
        },
        {
            "text": "2022 is also the 25th anniversary of the first Harry Potter book being published. It’s amazing to think it’s 25 years since that first book appeared. I cringe when I remember that I wouldn’t read the books when they were published because I was an adult, and they were written for children. In 1997, a teacher friend enthusiastically told me how great the first book was and how much his class of generally unruly and disinterested 11-year-olds loved it, but I still wouldn’t read it."
        },
        {
            "text": "Twenty years later, when I read it to my son and then, eagerly, the rest of the series, I was awed by their creativity and the skill of the writing, I had to admit I’d been wrong to have waited so long. Most school librarians will tell you the key to getting children reading is to find the book that lights the spark. If they live, breathe and sleep football, let them read about it. Not everyone loves fantasy, so let the child choose the book that’s right for them."
        },
        {
            "heading": 2,
            "text": "Feedback is key to providing a good service"
        },
        {
            "text": "Here in the Defra Library, we work hard to provide the right information resources to as many colleagues as possible, within our budget. Of course, we spend time making sure the books on our shelves are still relevant and accessible, but with hybrid working now the norm, we’re also investing more in electronic resources, making the library collection accessible to staff wherever they’re located."
        },
        {
            "text": "Our library catalogue tells colleagues what’s available, if they’re curious to know. We also maintain a list of electronic subscriptions on our community site which helps colleagues to see what additional resources are available to them."
        },
        {
            "text": "We love to hear that our library users value the service we provide. Perhaps when we’ve quickly supplied documents that someone was after, or when we’ve helped with a literature search or advised them on copyright issues. Their appreciation matters and when they tell us they’re grateful, it makes us feel good."
        },
        {
            "text": "We’re always on the lookout for opportunities to remind colleagues that we’re here and how we can help. Given how busy we’ve been the past couple of years, I think many of our Defra colleagues have developed the reading bug too."
        },
        {
            "heading": 2,
            "text": "Let your curiosity lead the way"
        },
        {
            "text": "There are plenty of reading resources out there for parents and kids. For example, the BookTrust and National Literacy Trust have lots of advice for parents of children who don’t enjoy reading. Don’t despair – take them to your local library for some inspiration!"
        },
        {
            "text": "Though I doubt my son will follow me into librarianship as a career, perhaps he will become a civil servant. After all, to do your job well you need to keep up to date with news and developments in your sector. A colleague told me recently that after a period on temporary promotion they hadn’t applied for the permanent post because it wouldn’t give them enough time to read. A job like that would be right up my son’s street!"
        },
        {
            "heading": 2,
            "text": "Want to know more?"
        },
        {
            "text": "World Book Day aims to change lives through a love of books and shared reading, with thousands of bookshops and supermarkets taking part in a range of activities."
        }
    ]
}