{
    "url": "https://civilservice.blog.gov.uk/2022/03/03/world-hearing-day-3-march-the-rose-looks-fair/",
    "title": "World Hearing Day - 3 March. The Rose Looks Fair",
    "authors": [
        "Ian Wallace"
    ],
    "categories": [
        "A Skilled Civil Service",
        "An Ambitious Civil Service",
        "An Innovative Civil Service"
    ],
    "pub_date": "2022-03-03T08:57:33+00:00",
    "content": [
        {
            "heading": 3,
            "text": "To mark World Hearing Day, Ian Wallace hails the success of Strictly Come Dancing star Rose Ayling-Ellis as a trailblazer for the deaf."
        },
        {
            "text": "Every year on 3 March, World Hearing Day is celebrated. On this day, the World Federation of the Deaf says “Let’s Remember to Sign” because national sign languages are important for everyone."
        },
        {
            "text": "Rose Ayling-Ellis, who won Strictly Come Dancing in 2021, is a profoundly deaf British Sign Language (BSL) user, who is singularly helping to break down barriers for people and showing us what could be possible. "
        },
        {
            "text": "Rose's courage"
        },
        {
            "text": "My Facebook feed was full of deaf people, who wouldn’t normally watch a dance  show, spreading the word about her talent. I agreed and thought she was great. Rose is showing a new generation of deaf children just what is achievable. There were endless online platitudes splashed across social media, hailing Rose’s courage and how wonderful she is, letting everyone know they voted for her. However, why has it taken such a long time for societal attitudes to really ‘see’ these amazing people and great achievements?     "
        },
        {
            "text": "Disability Discrimination Act"
        },
        {
            "text": "It wasn’t until 1995 that we saw the Disability Discrimination Act 1995 enter the statute books following a long campaign by activists. It took nine years after BSL was recognised as an official language before Rosie Cooper’s British Sign Language bill was presented to Parliament and gained government support."
        },
        {
            "text": "However, whilst there are great strides being made, there remains a long way to go."
        },
        {
            "text": "It’s all very well issuing platitudes but this isn’t enough. It would also be inspiring  for people to do something positive. One of the most positive aspects of Rose Ayling-Ells’ performance on Strictly was that google searches for learning sign language soared after she introduced BSL choreography into two particularly memorable routines."
        },
        {
            "text": "It would be encouraging to hope that trend continues and that civil servants might be inspired to sign up for a course, learn about deaf culture and how it affects your friends, colleagues and families."
        },
        {
            "text": "Breaking down barriers"
        },
        {
            "text": "Rose didn’t achieve success alone. She has significant communication barriers and did it with the help and support of people around her, working together to help break down these barriers. Rose’s dance partner Giovanni recognised that the way she hears music and feels the beat is different, and worked with that to create their routines. The BBC provided BSL interpreters at all times. Cynthia Erivo, a guest judge for musicals week, used BSL to communicate with Rose when giving her feedback."
        },
        {
            "text": "Similarly, deaf colleagues in the Civil Service need your help and support. Be an ally and work with your colleagues who are deaf or have hearing difficulties, recognising their differences."
        },
        {
            "text": "In the past, deaf staff in DWP had difficulties accessing communication support, despite occupational health recommendations, due to restricted budgets in local cost centres. I am proud that following a campaign from the DWP Deaf and Hearing Loss Network, interpreters are paid from a central cost centre, and this is working well."
        },
        {
            "text": "Improved accessibility"
        },
        {
            "text": "The COVID-19 pandemic has seen a rapid turnaround in accessibility for deaf colleagues. In DWP, we saw increased use of Microsoft Teams video calls with captions and transcript facilities. These workplace adjustments have fostered a sense of inclusion. In particular, allowing lipspeakers and BSL interpreters into internal meetings providing much needed communication support.     "
        },
        {
            "text": "My manager Ray has been fantastic since I had my cochlear implant in September 2021. Ray’s first concern is for me as a person, and he has worked with me using sick and special leave to help manage this. Ray also allowed easements on productivity and continued communicating with me in the way I needed rather than making assumptions about my needs. Every deaf person is unique and has their own abilities."
        },
        {
            "text": "You need to hold useful conversations and have mutual trust with your deaf colleagues. This approach is necessary as there is a strong need to prevent disillusionment and disengagement in the workplace. We need to aim to create a skilled, innovative, ambitious and, importantly, a diverse Modern Civil Service to cater for all."
        },
        {
            "text": "The Rose looks fair, but fairer it we deem/"
        },
        {
            "text": "For that sweet odour which doth in it live"
        },
        {
            "text": "Sonnet 54, William Shakespeare"
        },
        {
            "text": "The Civil Service Deaf and Hard of Hearing Network welcomes new members with all types of hearing impairments. Visit the network's web page to find out more."
        }
    ]
}