{
    "url": "https://educationhub.blog.gov.uk/2022/03/03/world-book-day-reading-for-pleasure-from-an-early-age-benefits-children-throughout-their-education-and-beyond/",
    "title": "World Book Day – Reading for pleasure from an early age benefits children throughout their education and beyond",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "World Book Day"
    ],
    "pub_date": "2022-03-03T00:01:34+00:00",
    "content": [
        {
            "text": "Today (Thursday 3 March), on World Book Day, schools will be celebrating by inviting in authors and encouraging children to dress up as their favourite characters, helping them form a longstanding love of reading."
        },
        {
            "text": "Reading for pleasure is a key indicator of a child’s future success. When children learn to read at an early age, they have greater general knowledge and a wider range of vocabulary, their reading is more fluent, and they have improved attention spans."
        },
        {
            "text": "Achieving good standards in reading is key to unlocking the rest of the curriculum and is an indicator of future success in further education, higher education, and employment."
        },
        {
            "text": "We have set an ambitious target for 90 per cent of children leaving primary school to meet the expected standards in reading and writing by 2030 – the more children that want to pick up a book after school or at a weekend, the closer we will get to that target."
        },
        {
            "text": "School libraries also play an important part in promoting the reading of books and other kinds of texts, both in and out of school."
        },
        {
            "text": "The National Curriculum requires teachers to encourage pupils to develop the habit of reading widely and often, for both pleasure and information. It also emphasises the importance of listening to, discussing, and reading for themselves a wide range of stories, poems, plays and non-fiction books."
        },
        {
            "text": "The Department is investing a further £7 billion in core schools’ funding by 2024-25, compared to 2021-22, bringing total funding to £56.8 billion by 2024-25, allowing schools to provide more resources like library provision, to make sure all pupils get the top-quality education they deserve."
        },
        {
            "text": "Here, our Ministers provide some inspiration and tell us what their favourite books were when they were children."
        },
        {
            "text": "Minister for the school system, Baroness Barran said: "
        },
        {
            "text": "Minister for skills, Alex Burghart said: "
        },
        {
            "text": "Minister for higher and further education, Michelle Donelan said: "
        },
        {
            "text": " Education Secretary Nadhim Zahawi said:"
        }
    ]
}