{
    "url": "https://environmentagency.blog.gov.uk/2024/07/15/citizen-science-in-the-west-midlands/",
    "title": "Citizen Science in the West Midlands",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Environment Agency",
        "Fisheries and biodiversity",
        "Sustainability",
        "Water"
    ],
    "pub_date": "2024-07-15T09:59:50+00:00",
    "content": [
        {
            "text": "My name is Lydia Ashworth and I have been a Citizen Science Coordinator for the Environment Agency in the West Midlands since July 2023."
        },
        {
            "text": "In this blog, you can find out about the Environment Agency’s ‘Supporting Citizen Science Project’ and some of the exciting innovations in this field that are happening in the West Midlands."
        },
        {
            "text": "Citizen science is a form of scientific research conducted in whole or in part by amateur or non-professional scientists. It has grown rapidly in the UK over the past few years, particularly in the field of freshwater monitoring. This interest is important for the health of our local waterways and blue spaces and the data being collected has huge potential in helping to make the right decisions for catchment improvement."
        },
        {
            "text": "The first phase of the supporting citizen science project has been running since April 22 and will finish in March 2025. To find out more, see Kelly Haynes’s blog: Celebrating International Day of Women and Girls in Science and the Environment Agency’s Citizen Science Projects – Creating a better place (blog.gov.uk)."
        },
        {
            "text": "It has been a privilege to work with various teams on this project. Citizen science crosses many of our work streams and collaboration and communication is key to its success. Across our area we have been working with citizen science for many years, most notably through the national Riverfly scheme and through catchment partnership projects, many of which are managed by our catchment coordinators. See Weir making a real difference to water quality on the River Cole – Creating a better place (blog.gov.uk)."
        },
        {
            "text": "The benefits of working with citizen science range from engaging and empowering local communities, to producing data that can help build a picture of catchment health and the effectiveness of projects."
        },
        {
            "text": "Since 2021 we have been working closely with the Wye Alliance of citizen science groups, recognising that their data can help to build a more comprehensive picture of the water quality in the River Wye and its tributaries. Of particular concern in the catchment are the levels of phosphate, and through the work done by Cardiff University we were able to show good correlation between Environment Agency samples and citizen scientists’ samples of nutrients. This has given us greater confidence in the data and enabled its use in the Environment Agency’s yearly integrated report which can be found on the River Wye information site. Data of this consistency, over this long a timeframe can be used to fill spatial and temporal gaps in monitoring giving a more comprehensive understanding of nutrient hotspots in the catchment to enable targeted work."
        },
        {
            "text": "However, long term data is not the only way that citizen scientists can contribute valuable information. Working with Birmingham University and supported by Birmingham and Black Country Wildlife Trust and Severn Trent Water, the Environment Agency set up a project in the city named Birmingham River Champions. The project aims to better understand specific urban pollution that comes from things such as surface water drainage, combined sewage overflows, misconnections and more, and its impact on the Water Framework Directive status of the River Cole."
        },
        {
            "text": "Citizen scientists have been trained on three methods of monitoring, such as Urban Riverfly, water quality techniques and Outfall Safari to carry out monitoring along the river."
        },
        {
            "text": "Riverfly monitoring is a method used to check the health of rivers and streams by observing the types and numbers of small freshwater insects, particularly riverflies, living in the water. Collecting data on freshwater invertebrates through Riverfly can provide that all important ecological impact which is so complementary alongside water quality information."
        },
        {
            "text": "Outfall Safari is scheme led by the water companies that systematically surveys the length of a river to identify and locate polluting outfalls or pipes; this allows Severn Trent and the Environment Agency to identify pollution hotspots in the West Midlands. Through this project local communities are getting the opportunity to learn from experts, understand the impacts on the rivers and contribute meaningfully to better understand their local waterways."
        },
        {
            "text": "In the West Midlands we are also collaborating with other national citizen science schemes, such as DEFRA’s Natural Capital and Ecosystem Assessment (NCEA) citizen science work. and the Rivers Trust and water company led Catchment Systems Thinking Cooperative (CaSTCo) project. On the River Teme we are working with and advising the CaSTCo demonstrator led by Severn Rivers Trust. Through this project, trials are underway to further understand how citizen science monitoring can contribute to a better understanding of bacterial levels within rivers. With Ludlow recently being designated as a bathing water, this is a topical subject in the Teme and there is plenty of interest in the outcomes of this work."
        },
        {
            "text": "My role is a great way to get out in the community, support the growth of citizen science and work towards maximising the many benefits that it can bring to both the Environment Agency and others. Citizen Science in the West Midlands is evolving, innovating and ever growing and there is no doubt that all this data and information being generated will be (and already is!) vital in catchment decision making."
        },
        {
            "text": "To keep up to date with our activity, follow the Environment Agency on X, and sign up for email alerts. "
        },
        {
            "text": " "
        }
    ]
}