{
    "url": "https://dragonsden.blog.gov.uk/2022/02/17/dragons-den-episode-7-series-19/",
    "title": "Dragons' Den, Episode 7, Series 19",
    "authors": [
        "Kayleigh Enticknap"
    ],
    "categories": [
        "Licensing",
        "Trade marks"
    ],
    "pub_date": "2022-02-17T21:00:23+00:00",
    "content": [
        {
            "text": "Convenient cold brew coffee in a can, an alternative to single use plastic, a game changing way to bike ride indoors and an app to make giving to charity even easier."
        },
        {
            "text": "It’s episode 7 in this series of Dragons’ Den and my very first one. How exciting!"
        },
        {
            "text": "This week’s episode was full of variety and suspense. I certainly had my hands over my eyes shouting at the screen during one particular pitch."
        },
        {
            "heading": 2,
            "text": "Across the pond"
        },
        {
            "text": "First up was American entrepreneur Annie Mitchell, with her Bottleshot Cold Brew Coffee, asking for a £80,000 investment for a 2% stake."
        },
        {
            "text": "As a coffee lover, this pitch instantly got my attention. I’m a busy mum and I’m always looking for a quick and convenient way to get my coffee fix. My friend often says “first coffee then everything else”, and I agree."
        },
        {
            "text": "Cold brew coffee is fast becoming the go to coffee beverage, with many mainstream shops stocking it. Annie enthusiastically entered the Den hoping to bag her favourite Dragon, Peter Jones."
        },
        {
            "text": "The Dragons' were initially confused by the unique name and were clearly hoping to have their socks blown off but seemed less than taken with the taste."
        },
        {
            "text": "A brand is more than just a name, logo or slogan, it is the ‘identity’ of a business. It offers customers assurance of what product or service level they can expect to receive. Protecting these elements by registering them as a trade mark can help build credibility, warn off potential copiers and open windows of opportunity such as franchising or licensing."
        },
        {
            "text": "Registering a trade mark isn’t as expensive as you might think. Starting from £170 when applying online, a trade mark will last 10 years until it needs to be renewed. The cost of an initial trade mark application depends on the number of ‘classes’ in which it needs to be registered."
        },
        {
            "text": "When applying to register, you use the classification system to define the goods and/or services area you'll be marketing in. One class is included in the cost of a trade mark application and extra classes cost an additional £50 per class, to protect your IP. Read our guide on how to classify trade marks for more information."
        },
        {
            "text": "The Dragons started to give the entrepreneurs chilled coffee a roasting and declare themselves out."
        },
        {
            "text": "Annie was able to win over and secure the Dragon of her dreams, however. Peter Jones saved the day by offering all the money for a 10% stake reduced to 5% after 12 months if his investment was returned."
        },
        {
            "heading": 2,
            "text": "Go Green "
        },
        {
            "text": "Next in the Den were business partners Vahid and Thibault offering an alternative to single use plastic. This certainly got the attention of resident eco-warrior Deborah Meaden who quickly expressed an interest in their pitch. The duo were asking 150K for a 7.5% stake in their business."
        },
        {
            "text": "The entrepreneurs declared that they have exclusive licensing rights in the UK and hold rights for 10 years with an Indonesian company...but they stumbled when it came to the terms of the agreement. Steven Bartlett, the Den’s newest Dragon, saw this as a red flag and quickly declared himself out."
        },
        {
            "text": "Unfortunately alarm bells started ringing for the other Dragons, too, who quickly followed Steven. Vahid and Thibault failed to bag a Dragon and went away empty handed."
        },
        {
            "heading": 2,
            "text": "So, what is licensing and what benefits can it provide for your business?"
        },
        {
            "text": "A license is an agreement between the IP right owner and another party. It grants them permission to do something that would be an infringement of the rights without the licence."
        },
        {
            "text": "IP can be ‘licensed-out’ or ‘licensed-in’. You can ‘license-out’ to another company in return for a fee. You can ‘license-in’ if you want to use another company’s IP to develop your own business and products. The person granting the licence is usually called the licensor, and the person receiving the licence is usually called the licensee. There may be more than one licensor or more than one licensee in a licence agreement."
        },
        {
            "text": "To find out more, watch our video:"
        },
        {
            "text": "If you think you have an excellent brand, have invented the next must have gadget or designed something beautiful why not have a look at our IP Basics videos to find out more."
        },
        {
            "text": "Don’t forget to come back next week to read our highlights unpicking the IP in Episode 8!"
        },
        {
            "text": "Need to learn about IP and how it can help your business? Start with our online support tools."
        },
        {
            "text": " "
        }
    ]
}