{
    "url": "https://dwpdigital.blog.gov.uk/2022/02/17/dwp-digital-is-improving-cross-government-data-sharing/",
    "title": "DWP Digital is improving cross-government data sharing",
    "authors": [
        "Paul Lodge"
    ],
    "categories": [
        "Data",
        "DWP Digital",
        "Government Digital Service"
    ],
    "pub_date": "2022-02-17T14:36:25+00:00",
    "content": [
        {
            "text": "Better use of data underpins everything we want to achieve in DWP Digital.  Our work enables DWP to make better informed decisions, based on how timely and situationally aware we can be, to help shape DWP policy and operational delivery. Making a real impact on millions of people’s lives. "
        },
        {
            "text": "The COVID-19 pandemic demonstrated the need for several departments to urgently collaborate and have access to the right data and insights at the right time. This was particularly important for cross-cutting work such as the shielding programme or the COVID-19 vaccination programme during the pandemic, and now the same is true for our efforts in supporting the labour market and its continued recovery. "
        },
        {
            "heading": 2,
            "text": "The Labour Market Data Trust"
        },
        {
            "text": "The Labour Market Data Trust pilot is building on the work of the Open Data Institute (ODI) on Data Trusts and the Alan Turing Institute’s work on Data Safe Havens.  This has enabled us to explore improved data accessibility between the four government departments closest to everyday Labour Market activity, namely the Department for Work and Pensions (DWP), the Department for Education (DfE), the Department for Business, Energy and Industrial Strategy (BEIS) and Her Majesty’s Revenue and Customs (HMRC). "
        },
        {
            "text": "DWP is committed to maximising employment across the country to aid the economic recovery. It’s also the case that other government departments need granular insights into everyday labour market developments, especially those affecting local areas, specific sectors and disadvantaged groups.  For example, the Department for Education’s National Skills Fund or the Department for Business, Energy and Industrial Strategy’s work supporting the Government’s Plan for Growth by creating the right business environment for a stronger, greener and more resilient economy across the UK. "
        },
        {
            "text": "Based on the need to collaborate on shared outcomes, we are actively exploring whether thematic data trusts can help government as a way of sharing pertinent and timely data to enable better outcomes. "
        },
        {
            "text": "The Labour Market Data Trust pilot is being financed through HM Treasury’s Shared Outcomes Fund, which incentivises departments to work collaboratively across departmental boundaries and challenging policy areas. "
        },
        {
            "text": "We’ve used the term ‘Data Trust’ to broadly mean a trusted framework for digital collaboration. The nine-month pilot focuses on understanding and testing the feasibility of meeting the respective labour market data needs of different departments using the Data Trust concept. This means proving the legal, digital and data protection framework necessary of a collective engagement.  It aims to help departments to proportionately share their data, while rigorously protecting the privacy of those whose data it is. "
        },
        {
            "text": "It will also make sure that government bodies, as well as providing services to the public, learn from what the data is showing, to improve public services and respond earlier to dynamic changes in the labour market. "
        },
        {
            "text": "Joining up on what we need to know "
        },
        {
            "text": "Connecting and making better use of government’s different pockets of labour market data is vital to informing and improving citizen outcomes, iterating policies based on wider evaluation and, ultimately, delivering the best value for taxpayers’ money. "
        },
        {
            "text": "Currently data sharing arrangements between departments are lengthy to put in place or amend, and resource intensive. Government analysts and service delivery teams seeking data are unable to easily understand what data is held by others or confidently navigate their governance processes. As a result, the value of public sector data is being underexploited. "
        },
        {
            "text": "To be effective, a data trust requires the data to be accessible and discoverable, and the onward extraction of any results need to be monitored and governed. That means asking new technical, procedural and legal questions of our data to see whether a data trust can help to deliver greater collaboration or what changes would be needed. "
        },
        {
            "text": "In line with Mission 1 of the National Data Strategy, we want to move away from batch-file data sharing and towards in-place data shares, whereby data is shared from a single source and reused many times without unnecessary copying. "
        },
        {
            "text": "This approach avoids creating new data warehouses and drives up data quality across government by having a single source of truth. We are testing this concept over the course of the pilot when assessing data from other government departments and when drawing on their existing internal data catalogues. This is enabling us to test what improves discoverability and interoperability of data. "
        },
        {
            "text": "The security controls for any platform will align to industry best practice and include specific department requirements.  All designs and processes across the project have been developed in line with our ‘privacy by design’ principle and informed by the National Cyber Security Centre’s cloud security principles."
        },
        {
            "text": "Next steps "
        },
        {
            "text": "This work is important to find smarter ways to support economic recovery, levelling up and longstanding productivity challenges, all while directly helping some of the most vulnerable and disadvantaged groups in society. "
        },
        {
            "text": "The pilot will continue until the end of DWP’s financial year in March, when it will be fully evaluated to find out how it can help DWP, HMRC, DfE and BEIS work better going forward. My team is also working closely with HMT, the Office for National Statistics (ONS) and the Central Digital and Data Office (CDDO) within Cabinet Office on how to carry forward the learnings and expand the legacy of the pilot beyond just the labour market challenge. "
        },
        {
            "text": "DWP Digital have a huge mission to ensure that everyone can access DWP services when they need to, whether it's claiming benefit, getting help finding a job or understanding their State Pension.  "
        }
    ]
}