{
    "url": "https://educationhub.blog.gov.uk/2022/02/17/political-impartiality-guidance-for-schools-what-you-need-to-know/",
    "title": "Political impartiality guidance for schools – what you need to know",
    "authors": [
        "Media Officer"
    ],
    "categories": [
        "Schools"
    ],
    "pub_date": "2022-02-17T00:01:23+00:00",
    "content": [
        {
            "text": "We want all pupils to finish their education with the knowledge and skills to be able to form clear opinions about issues they see in the world. That’s why it’s really important that teachers are able to help pupils decipher complex and sensitive topics without promoting partisan political views."
        },
        {
            "text": "Most schools do this really well, but we know it can be tricky and that’s why we’ve published new guidance to support teachers. Here is everything you need to know about our new impartiality guidance."
        },
        {
            "heading": 3,
            "text": "Why is it so important teachers are politically impartial? "
        },
        {
            "text": "Everyone has their own views on particular subjects and issues and teachers are no different, but it is important that teachers explain things to their students in a way that is impartial. Teaching about political issues and the differing views on these is an essential part of the curriculum, helping pupils to form their own opinions and prepare them for later life. The law states that teachers must not promote partisan political views and should offer a balanced overview of opposing views when political issues are taught."
        },
        {
            "text": "We’ve produced this guidance to support teachers to do this."
        },
        {
            "heading": 3,
            "text": "What sort of thing does this impartiality guidance cover? "
        },
        {
            "text": "It covers a wide range of topics and concepts including how to discuss politics but also how to discuss issues where the political context around them can pose difficulties."
        },
        {
            "text": "Practical examples include:"
        },
        {
            "heading": 3,
            "text": "Does this mean teachers aren’t allowed to talk about politics in the classroom?"
        },
        {
            "text": "Teachers absolutely can talk about politics – and they are encouraged to do so. What they shouldn’t do, though, is present their own, or anyone else’s, political views as fact. As a general principle, they should avoid expressing their own personal political views to pupils unless they are confident this will not amount to promoting that view to pupils."
        },
        {
            "heading": 3,
            "text": "How do you define a political issue? "
        },
        {
            "text": "It’s easier with some things than others. When discussing party politics it’s easy to see the need for balance and that it’s necessary to present the opposing views on a subject in an impartial way. But in some instances an issue may not be political but some of the responses to it may be – like climate change, for example. Climate change isn't a political issue – it is scientific fact – but some views on it, around the causes, solutions and more, are politically influenced. It’s important that pupils are able to draw a clear distinction between facts and opinions and how political views can influence those opinions."
        },
        {
            "text": "This guidance helps teachers to do that."
        },
        {
            "heading": 3,
            "text": "Does this mean that teachers should be expected to present arguments for and against matters that are fundamentally wrong? "
        },
        {
            "text": "No. For instance the guidance makes it clear that schools do not need to present misinformation, such as unsubstantiated claims that anthropogenic climate change is not occurring, to provide balance.  In addition, some concepts and views are shared principles which underpin our society and should be reinforced by schools. This includes fundamental rights, tolerance and challenging discrimination and prejudice."
        },
        {
            "heading": 3,
            "text": "Will this prevent teachers from exploring important modern movements like #metoo?"
        },
        {
            "text": "No. We want teachers to be able to discuss contemporary issues and movements with their pupils to help them understand them better. This guidance should help them do that in a way that separates out political views from the issues themselves."
        },
        {
            "text": " "
        }
    ]
}