{
    "url": "https://marinescience.blog.gov.uk/2022/02/17/trade-in-live-coral-how-we-are-developing-tools-to-improve-tracking-of-the-most-traded-marine-animals/",
    "title": "Trade in live coral: how we are developing tools to improve tracking of the most traded marine animals",
    "authors": [
        "Joanna Murray"
    ],
    "categories": [
        "International",
        "Vulnerable species"
    ],
    "pub_date": "2022-02-17T08:30:07+00:00",
    "content": [
        {
            "text": "It may come as a surprise to some that corals are not rocks or plants, but marine invertebrate animals made up of hundreds to thousands of tiny organisms called polyps, joined together by limestone skeletons. Corals are the building blocks of coral reef ecosystems and provide essential food and shelter to other species such as fish, crustaceans, turtles, and people."
        },
        {
            "text": "Corals are also the most traded CITES-listed (Convention on the International Trade in Endangered Species of Wild Fauna and Flora) marine animals globally. A 2021 study by the FAO found that from 1990 to 2016, exporting countries reported to CITES around 1.6 million direct export transactions in marine animals (excluding mammals, birds and reptiles), 97% of which were in corals. Here in the UK, over 60% of direct CITES imports are in live coral, therefore making it our most imported CITES-listed species."
        },
        {
            "text": "From an environmental perspective, collection of live coral is a localised pressure which is highly selective and considered low impact in the long-term relative to other activities such as coral mining and dynamite fishing. While it can incentivise local stewardship of reef ecosystems, there are some concerns that collection for trade is an additional pressure to global scale threats such as climate change and ocean acidification."
        },
        {
            "text": "But why is coral traded at all? Primarily, it supplies the marine aquarium market and will ultimately end up in a hobbyist’s fish tank. Worldwide, over 2 million people own marine aquaria and as technology and expertise have developed, the range of species which can be kept has rapidly expanded. Today’s hobbyists strive to replicate what is found in nature and can establish mini reef ecosystems in their living room."
        },
        {
            "text": "While Indonesia is the world’s largest exporter of CITES-listed coral, accounting for an estimated 90% of the market, they are also paving the way to finding more sustainable alternatives to harvesting wild corals. Farming corals is a primary alternative, and over the past two decades Indonesia have increased the proportion of farmed corals exports significantly. However, it is not always easy to tell the difference between a wild collected and a farmed coral, even for those people tasked with management of trade along the supply chain."
        },
        {
            "text": "In Indonesia, the Ministry of Environment and Forestry (MOEF – KLHK), act as the Management Authority, and the Ministry of Marine and Fisheries Affairs (MMAF – KKP) act as the final point of inspection before international transport. It is during these inspections that CITES implementing staff experience challenges identifying corals and differentiating between wild collected corals (CITES Source Code W) and farmed corals (CITES Source Code F)."
        },
        {
            "text": "With over 440 different types of traded coral there is a risk that desirable, high-value species which may be difficult to farm or may be subject to an import suspension, could be mis-labelled as something else and would therefore classify as illegal trade."
        },
        {
            "heading": 3,
            "text": "Taking action"
        },
        {
            "text": "In response to this coral identification challenge, scientists from the Centre for Environment, Fisheries and Aquaculture Science (Cefas) are working the Indonesian Coral Reef Foundation (TERANGI) and the Indonesian Nature Foundation (Yayasan Alam Indonesia Lestari - LINI) on a Defra funded project. We aim to build a shared understanding of the coral trade between Indonesia and the UK, and to develop a practical identification guide for traded corals which can help regulators quickly identify if a species is what it says it is on the box, and spot mis-declared farmed coral."
        },
        {
            "text": "Our first task was to bring together project partners, collaborators, and stakeholders, including governmental bodies from Indonesia and the UK, scientific experts, regulatory bodies, regional NGOs, and industry members, in a series of four virtual knowledge exchange workshops. The aims of these workshops were to:"
        },
        {
            "text": " "
        },
        {
            "text": "Inge Yahesa from Indonesia’s Management Authority (MOEF/KLHK) said;"
        },
        {
            "text": " "
        },
        {
            "text": "One key output of the workshops was the exchange of knowledge and understanding between the Joint Nature Conservation Committee (JNCC), who are the UK’s CITES Scientific Authority for animals, and the CITES Management Authority (Ministry of Environment and Forestry) and CITES Scientific Authority (PRO - BRIN (Research Centre for Oceanography)) in Indonesia."
        },
        {
            "text": "CITES is an international Convention that was founded in 1975, and today 184 countries (called Parties) have joined. The aim of the Convention is to ensure that international trade in listed wild animals and plants does not threaten their survival. As the UKs Scientific Authority, JNCC provides scientific advice to the UK Government on licence applications (c. 20,000 per year) for all CITES-listed animals. This role is essential for CITES to work in protecting the survival of species in the wild."
        },
        {
            "text": "Indonesia is one of the UK’s key coral trading partners, importing thousands of small, live fragments of coral each year from locally owned coral farms. To ensure this trade is sustainable, the UK CITES Scientific Authority must perform a review of available information on the populations of coral species in the wild, along with the impact of harvest, trade, and other threats. This information is compiled in a document called a “non-detriment finding”."
        },
        {
            "text": "The projects workshops provided essential information for the UK to update their non-detriment finding for the import of Indonesian farmed corals and strengthened the relationship between the two trading partners. This is essential for sharing knowledge and combining efforts to improve outcomes for both people and planet."
        },
        {
            "text": " "
        },
        {
            "text": "Alison Littlewood, Head of UK CITES Scientific Authority (fauna), JNCC said:"
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Next steps"
        },
        {
            "text": "Armed with a clear understanding of the practical challenges faced by coral trade managers and CITES enforcement teams when identifying live coral in transit, our next step is to design and develop a visual guide that can be used quickly and easily to improve coral checks during their journey from reef to retail."
        },
        {
            "text": "Barmawi a technical staff member from the Ministry of Marine Affairs and Fisheries (MMAF/KKP) in Indonesia who is tasked with inspecting shipments of coral prior to export, said:"
        },
        {
            "text": "Project partners will be working with trade inspectors, like Barmawi, and industry both in the UK and Indonesia, to prioritise which species the guide should focus on, and to identify key signals in mislabelling a wild collected coral for a farmed one."
        },
        {
            "text": "Once the guide has been finalised and tested in the field, we plan to make it available to all those CITES Parties trading in coral to ultimately ensure coral trade is legal, traceable, and sustainable."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Project partners:"
        },
        {
            "heading": 3,
            "text": "Project collaborators and stakeholders:"
        },
        {
            "text": " "
        }
    ]
}