{
    "url": "https://mojdigital.blog.gov.uk/2024/11/28/evolving-our-approach-to-benefits-analysis/",
    "title": "Evolving our approach to benefits analysis",
    "authors": [
        "Liz Bryant",
        "Valentina Mogaji"
    ],
    "categories": [
        "Justice Digital Strategy",
        "MoJ strategy",
        "Our services",
        "our users",
        "Technology"
    ],
    "pub_date": "2024-11-28T12:02:24+01:00",
    "content": [
        {
            "text": "‘Evolve’ is a portfolio of projects within Justice Digital, improving the way workplace technology services are delivered. We aim to make sure that the 100,000 people working across the Ministry of Justice (MoJ) have the digital tools, services, equipment, connectivity and support they need to achieve the organisation’s objectives – both now and in the future. "
        },
        {
            "text": "Some of our projects are securing external providers to supply essential technology services. Others are bringing management and support of services in-house, or upgrading our existing technology. Our aim is always to give our colleagues or the public the best possible experience with the technology they use.  "
        },
        {
            "text": "We’re dedicated to making MoJ’s technology services more cost-effective – and building in flexibility so we can keep them up to date and secure, allowing them to evolve as requirements and ways of working change over time. "
        },
        {
            "text": "Defining the benefits "
        },
        {
            "text": "We begin each project with a business case to demonstrate why it’s an appropriate use of resources. An essential part of this is defining the benefits the project will bring.  "
        },
        {
            "text": "Some benefits are easier to quantify and track, such as reducing the costs of providing services or the number of IT issues reported by colleagues.  "
        },
        {
            "text": "Others are just as important but harder to measure – more qualitative benefits such as an improved user experience, better collaboration between teams, time saved, services made easier to support, improved security, and so on.   "
        },
        {
            "text": "Either way, we ensure we have a robust understanding of the quantifiable benefits before embarking on a new project – because we understand that better, more resilient systems will make our colleagues’ working lives more straightforward and will support more effective and responsive public services.  "
        },
        {
            "text": "Assessing the benefits "
        },
        {
            "text": "In Evolve, we use an 8-stage benefits management process for defining, refining and delivering all project benefits.  This includes assessing each benefit using investment appraisal techniques.  "
        },
        {
            "text": "One of our goals is to ensure value for money through our projects. We evaluate monetary benefits using a net present value calculation. For non-monetary benefits, we carry out a qualitative assessment using a weighting and scoring approach. "
        },
        {
            "text": "So far, we’ve identified an impressive 103 anticipated benefits across 6 of our projects. Because there are so many, we’ve had to prioritise the benefits we’ll be specifically monitoring and tracking.  "
        },
        {
            "text": "Our prioritisation process includes considerations like potential savings, strategic significance, and the level of difficulty associated with achieving and tracking the realisation of each benefit.  "
        },
        {
            "text": "We currently have 20 priority benefits which we’re actively managing across the portfolio since April 2024. "
        },
        {
            "text": "Tracking our progress "
        },
        {
            "text": "We create a ‘profile’ for each priority benefit. This includes information on its categorisation, baseline and future targets. It also specifies how it will be measured and who’s responsible for monitoring the benefit at each stage. "
        },
        {
            "text": "Our dashboards track the progress of each benefit against the realisation plan. This means we can make regular reports on progress to the appropriate governance teams, and we can take corrective action if any benefits are not emerging as we expect. "
        },
        {
            "text": "Making sure we get the right data allows us to track quantitative benefits – such as reducing our overall costs or cutting the average length of time it takes to resolve an IT issue.   "
        },
        {
            "text": "To assess more qualitative benefits, we get in-depth feedback from colleagues who’ve been working with us across the different parts of MoJ.  It’s essential to help us gauge how successful we are. For example, in our contact centre project, a critical stage in our plans is running post-implementation user surveys. These help us assess the real impact of improving and standardising the service and the support which are provided to these vital, public-facing teams.  "
        },
        {
            "text": "Making a difference "
        },
        {
            "text": "Workplace Technology can make or break the employee experience and we understand that our work profoundly affects both frontline colleagues and the public who rely on our services. "
        },
        {
            "text": "Our projects are not just about immediate gains, but are designed to establish a sustainable model of continuous and iterative improvement so we can continue delivering high quality, cost effective, up-to-date and secure services in the long term.   "
        },
        {
            "text": "Benefits analysis will be a fundamental part of our ongoing service management as we ensure that these services continue to deliver the expected improvements over time. "
        }
    ]
}