{
    "url": "https://food.blog.gov.uk/2024/11/28/meat-inspection-charges-explained/",
    "title": "Meat Inspection Charges Explained",
    "authors": [
        "Dr James Cooper, Deputy Director of Food Policy"
    ],
    "categories": [
        "Business guidance"
    ],
    "pub_date": "2024-11-28T15:53:10+00:00",
    "content": [
        {
            "text": "Today we have published the FSA December Board papers and one of the issues to be discussed is the cost of meat inspections.  "
        },
        {
            "text": "Meat inspections are vital to the UK’s food security. These inspections are carried out by highly trained official vets and meat hygiene inspectors who look at the health of the animal and make sure it is safe to eat. They also protect animal welfare to ensure animals are treated humanely."
        },
        {
            "text": "This allows the UK’s meat industry to supply meat to the market. These inspections are also required if a business wants to export their products to another country."
        },
        {
            "text": "The FSA must charge businesses to conduct these inspections. A taxpayer-funded discount is applied to reduce the cost for businesses. Smaller businesses receive a higher percentage discount than larger businesses."
        },
        {
            "text": "We want to know if we are using taxpayers' money and supporting the meat industry in the most effective way. We started discussing meat inspection charges with stakeholders when we called for evidence on how discounts benefit consumers and businesses."
        },
        {
            "text": "This is the beginning of a collaborative process, which will involve everyone who could be affected to develop options and gather evidence for future plans."
        },
        {
            "text": "On Wednesday 11 December, the FSA Board will consider the approach to meat inspection charges from April 2026."
        },
        {
            "text": "The questions and answers below help explain this topic more clearly:"
        },
        {
            "heading": 3,
            "text": "Why do you conduct meat inspections? "
        },
        {
            "text": "Official veterinarians (OVs) and meat hygiene inspectors (MHIs) carry out inspections, known as Official Controls, in some meat food businesses such as abattoirs and game handling establishments. "
        },
        {
            "text": "Meat and poultry can’t be sold unless it’s checked by an official veterinarian before processing and given a health or ID mark by a meat hygiene inspector. This is a requirement to trade with other countries too. "
        },
        {
            "text": "This important work carried out by OVs and MHIs protects animal health and welfare as well as assuring food safety, which supports the domestic meat industry. "
        },
        {
            "heading": 3,
            "text": "What are you charging for? "
        },
        {
            "text": "The OVs and MHIs are highly skilled professionals who have undergone rigorous training.   "
        },
        {
            "text": "OVs check the animals when they arrive at the slaughterhouse and during slaughter, making sure they are being looked after within welfare regulations. They look at the health of the animal on arrival which is an important part of the UK’s surveillance for animal diseases like foot and mouth and avian influenza. "
        },
        {
            "text": "Then, after slaughter, meat hygiene inspectors do post-mortem checks for any signs of disease, such as tuberculosis. Ultimately, they make sure that the carcass is safe for consumers to eat. "
        },
        {
            "text": "Our overall aim with charging is to maintain our current high standards of food safety and animal welfare through the work of OVs and MHIs, whilst keeping the costs for this service to a minimum for businesses and the taxpayer.    "
        },
        {
            "heading": 3,
            "text": "What is the cost? "
        },
        {
            "text": "The FSA charges businesses for inspections and applies discounts to this service depending on the amount of time OVs and MHI services are required. The smallest meat operators can receive a discount of up to 90% of the cost of inspections. "
        },
        {
            "text": "For example, this year: "
        },
        {
            "heading": 3,
            "text": "Who pays? "
        },
        {
            "text": "In short, the cost is split between food businesses and taxpayers. The FSA currently recovers around 70% of its costs from businesses. The remainder is met by a taxpayer-funded discount for businesses with small abattoirs paying the least.  "
        },
        {
            "text": "Usually, public sector bodies should recover costs in full for the services they provide. We have been reducing discounts gradually year on year and it's right that we review this periodically, so we know we're using taxpayers' money appropriately and supporting the meat industry in the most effective way.   "
        },
        {
            "text": "The cost of this regulation is a very small proportion of the total value of this industry. Last year, businesses paid £39.5million for inspections and the taxpayer paid about £17.8million. The total value of meat production in the UK is almost £11billion and the meat export market £2billion."
        },
        {
            "heading": 3,
            "text": "What will costs look like next year? "
        },
        {
            "text": "We review the cost of inspections each year. The cost of providing this service will increase significantly in 2025/26 due to inflation, shortages of veterinary personnel and an increase to salaries for overseas workers. "
        },
        {
            "text": "The FSA expects to continue to offer a discount in 2025/26 and the level of this is expected to be calculated on a similar basis as the last couple of years."
        },
        {
            "heading": 3,
            "text": "What about smaller operators?"
        },
        {
            "text": "A smaller operator will have less animals to process but still require an OV to be present. They therefore receive a higher discount to allow for this."
        },
        {
            "text": "We’re aware of the vital role of small abattoirs play in supporting their local food system and the challenging market pressures they face.  We will continue to work with government partners and the sector to support the long-term viability of the small abattoir network. "
        },
        {
            "heading": 3,
            "text": "What will happen to the discounts that support businesses from 2026? "
        },
        {
            "text": "We are looking at how much of the cost of inspections should be met by the taxpayer and how much businesses should pay.  "
        },
        {
            "text": "To help us examine this, we recently held a Call for Evidence to hear what the food sector and members of the public think. This is the first part of an engagement process to better understand the value of the discounts. "
        },
        {
            "text": "This evidence has been very valuable insight into what small and large meat operators care about, and how they might be affected by any change. This has informed the Board paper on meat charging which provides a high-level overview of the response."
        },
        {
            "text": " This is the beginning of a collaborative process, which will involve everyone who could be affected to develop options and gather evidence for future plans. "
        },
        {
            "text": "On Wednesday 11 December, the FSA Board will consider the approach to meat inspection charges from April 2026. The Board is being broadcast live, and you can sign up to view the meeting. "
        }
    ]
}