{
    "url": "https://defraenvironment.blog.gov.uk/2024/11/28/new-tree-planting-taskforce-launched-during-national-trees-week/",
    "title": "New Tree Planting Taskforce launched during National Tree Week",
    "authors": [
        "Environment blog team"
    ],
    "categories": [
        "Forestry",
        "Nature",
        "Tree planting",
        "Woodland management"
    ],
    "pub_date": "2024-11-28T17:20:50+00:00",
    "content": [
        {
            "text": "This week is National Tree Week, the UK’s largest annual tree celebration."
        },
        {
            "text": "To celebrate the week, the conservation sector, volunteer groups, charities and tree-lovers are coming together to mark the start of the tree planting season.  "
        },
        {
            "text": "As part of the Government’s efforts to boost tree planting rates, we've launched a new Tree Planting Taskforce."
        },
        {
            "text": "In this post, the Environment blog team will highlight what this means, as well as some other ways we’re celebrating the week."
        },
        {
            "text": "Launching a new Tree Planting Taskforce"
        },
        {
            "text": "Over 90% of people in the UK agree that forests and woodlands are vital for wildlife, with 84% believing more trees should be planted in response to climate change. Defra is working on these priorities."
        },
        {
            "text": "Tree planting will help us to reach our net zero targets, reverse the decline in nature, improve water quality, and support job creation and economic growth.   "
        },
        {
            "text": "That’s why this morning, we launched a new Tree Planting Taskforce, hosted by Nature Minister, Mary Creagh."
        },
        {
            "text": "The Taskforce brought together Ministers from Scotland, Wales and Northern Ireland, alongside key delivery partners and arm’s-length bodies, to discuss how to increase the country's tree planting rates in order to meet our net zero targets. This is part of the Government’s critical mission to make the UK a clean energy superpower. "
        },
        {
            "text": "The Taskforce will be reflective of the devolved nature of forestry in the UK and will provide a platform for oversight, sharing best practice and identifying barriers on tree-planting in each nation."
        },
        {
            "text": "Our nation’s woodlands and trees are the heart of communities around the country, essential to supporting wellbeing and improving quality of life, alongside being home to some of our most treasured species."
        },
        {
            "text": "Collaborative working is key"
        },
        {
            "text": "The Taskforce is designed to strengthen collaboration across the UK, identifying opportunities to work together to improve tree planting and ensure long-term survival, safeguarding their benefits for future generations. "
        },
        {
            "text": "Alongside the launch of the Taskforce, Defra has been celebrating National Tree Week with a range of activity to increase awareness of tree planting and woodland management across the country while putting down roots for future generations."
        },
        {
            "text": "This includes the publication of a detailed Tree Species Guide for UK Agroforestry Systems. This guide was developed by Forest Research in partnership with the University of Reading and provides information on 33 different species of trees and shrubs suitable for planting in UK agroforestry systems."
        },
        {
            "text": "This will help inform farmers’ tree species selections based on the individual needs and conditions of the farm. Minister Creagh also visited Hainault Forest alongside the Woodland Trust to see first-hand the important work taking place to protect our woodlands and ancient trees on the site."
        },
        {
            "text": "Putting down roots for the future"
        },
        {
            "text": "Trees are a long-term endeavour, but the results are worth it. The treescapes created in the coming years will outlive us, and today’s decisions will profoundly shape the kind of country future generations will inhabit. "
        },
        {
            "text": "Planting new woodlands and looking after those we already have are both fundamental to achieving the Secretary of State’s ambitions on nature recovery and to achieving our statutory targets on tree planting."
        },
        {
            "text": "We are working hard to achieve the Environment Act target of 16.5% tree cover in England by 2050 and have launched a review of the Environmental Improvement Plan."
        },
        {
            "text": "There is also a strong pipeline of Government funded planting projects planned for this new tree season."
        },
        {
            "text": "We are working towards creating new national forests and boosting tree planting for net zero, biodiversity, and the economy. This is a big step up in tree planting, but we know there is more work to do to reach the Tree and Woodland Cover target."
        },
        {
            "text": "How you can play your part"
        },
        {
            "text": "If you’re feeling inspired, visit the The Tree Council’s website to get involved. There are activities from a free Tree Talks, to National Tree Week resources and even a map for events taking place in your local area."
        },
        {
            "text": "You can also visit our Put Down Roots site for advice on how to maximise the benefits to land and business."
        },
        {
            "text": "To receive an email notification whenever we publish a new post, please subscribe to the blog."
        }
    ]
}