{
    "url": "https://marinescience.blog.gov.uk/2024/11/28/seeing-red-cefas-contributes-to-iucn-global-assessment-of-threatened-coral-reefs/",
    "title": "Seeing Red: Cefas contributes to IUCN global assessment of threatened coral reefs",
    "authors": [
        "Michelle Devlin",
        "Elena Couce",
        "Benjamin Cowburn",
        "Joanna Bluemel"
    ],
    "categories": [
        "adaptation",
        "Climate Change",
        "International",
        "Policy"
    ],
    "pub_date": "2024-11-28T09:26:51+00:00",
    "content": [
        {
            "text": "Coral reefs are vital for our oceans. They are among the most diverse and productive ecosystems on the planet, providing habitat for a vast array of marine life. They also provide livelihoods for over 600 million people, and coastal protection for millions more. However, coral reefs are one of the most threatened habitats on earth under threat from a range of human activities, including overfishing, pollution, and climate change, with highest global losses in the Eastern Pacific, South Asia and the Great Barrier Reef. With up to 67% of historical global extent now lost and much of the remaining intact coral reef systems facing unprecedented risk from climate change, overfishing and pollution."
        },
        {
            "text": "Understanding the health of coral reefs through the IUCN Red list "
        },
        {
            "text": "The IUCN Red List of Threatened Species  (‘Red List’), produced by the Species Survival Commission (SSC) of the World Conservation Union (IUCN), highlights species that are at the greatest risk of extinction and  provides a reliable source of information for policymakers, conservationists, and the general public on the status of species. This information is used for guiding conservation and protecting biodiversity by ‘concentrating minds on true priorities’. Currently, the Red List includes more than 157,100 species, with over 44,000 threatened with extinction. Specifically, 36% of reef-building corals are currently threatened. The last comprehensive assessment of corals on the Red List was in 2008, making this recent update long overdue."
        },
        {
            "text": "The IUCN Red list assesses and then classifies species in terms of the risk of extinction with categories ranging from extinct, endangered, vulnerable, least concern, data deficient and not evaluated (Figure1).  The assessment is comprehensive, using research outcomes, monitoring and expert opinions to asses species against a set of criteria.  Species assessments are compiled from published and unpublished information and typically include expert input by one or more ‘assessors’. Assessments must be backed up by data, justifications, sources and estimates of uncertainty and data quality.  Evaluated species for which insufficient data are available to make an assessment are classified as Data Deficient. The assessments are peer reviewed by at least two ‘evaluators’ assigned by the relevant ‘Red List Authority’ (established for taxonomic groups; typically, the corresponding IUCN-SSC Specialist Group)."
        },
        {
            "text": "Figure 1"
        },
        {
            "text": "Cefas science and collaboration to support coral reef protection "
        },
        {
            "text": "In 2019 five Cefas staff took IUCN RedList training and examination to become official assessors, along with over 100 coral reef experts from our 30 countries. We were assigned around 20 coral species, based on our taxonomic and geographic expertise, to work on with several other assessors remotely during the pandemic. We gathered literature on each species traits (e.g geographic range, depth preference & bleaching susceptibility), which was then used to inform an analysis of population reduction using global monitoring data from the Global Coral Reef Monitoring Network (GCRMN). When restriction began to lift in 2022, we met for the first time in person at the International Coral Reef Symposium in Bremen, Germany. During this time, we agreed on the methods for the population reduction analysis and how coral traits should weight species scores."
        },
        {
            "text": " In October last year, three Cefas scientists (Elena Couce, Benjamin Cowburn and Joanna Bluemel) attended a RedList assessment attended a workshop organised by the Coral Specialist Group hosted by the Lee Kong Chain Natural History Museum of Singapore, to complete over 400 outstanding species assessments for the Indo Pacific region. We joined a group of 20 coral reef scientists from around the globe and over 4 days of intense work, to provide expert advice and evidence, focusing on filling in missing trait information. The workshop also discussed interventions aimed at helping coral reefs better adapt to global pressures and research and development (R&D) needs to help understand and manage ecological risks from current activities and the most promising new interventions."
        },
        {
            "text": "The latest update is available now [link], with the final assessments are due at the end of October 2024 and the participants have been working on drafting peer reviewed papers to present the outcomes. These species assessments, alongside other efforts by the RedList networks, such Red Listing of Ecosystems, represent a major update into our understanding of global biodiversity loss. The assessments are a metric of extinction risk and do not recommend any conservation actions, however they are used as a tool in conservation to evaluation the importance of various areas, direct funding and monitoring efforts, and plan mitigation and intervention activities. Unfortunately, but somewhat predictably, the results of our work show that the proportion of threatened species has increased since 2008. However, the support for coral reefs in terms of new technology and finance has also increased in recent years, with the Global Fund for Coral Reefs and the recent ICRI Coral Reef Breakthrough which aims to secure the future of at least 125,000 km2 of shallow-water tropical coral reefs with investments of at least US$12 billion. There has also been an acceleration of research for coral reef interventions under the Coral Research & Development Accelerator Platform (CORDAP) to fast-track research and development solutions to save the world’s corals."
        },
        {
            "text": "Ultimately, this IUCN assessment provides accurate and up to date information for the global assessment of 900 coral species that will help direct funds and inform future coral conservation efforts trying to halt the loss of biodiversity in this unique ecosystem. It is a strong reminder that biodiversity faces many challenges, and that we need to recognise those risks, and build a strong platform of mitigation, conservation and restoration to protect species loss. This is particularly true for the risks faced by coral reefs, and the IUCN Red List provides critical information on where to prioritise actions and solutions."
        }
    ]
}