{
    "url": "https://environmentagency.blog.gov.uk/2020/11/05/monitoring-radioactivity-in-the-environment-2/",
    "title": "Monitoring radioactivity in the environment",
    "authors": [
        "Ray Pemberton"
    ],
    "categories": [
        "Regulated industry"
    ],
    "pub_date": "2020-11-05T11:29:02+00:00",
    "content": [
        {
            "text": "This blog refers to our 2020 publication of RIFE"
        },
        {
            "text": "Radioactivity is all around us. It occurs naturally in the earth’s crust and it can be found in the food we eat, the water we drink and the air we breathe. We are also exposed to man-made radioactivity, such as in medical applications used in hospitals and nuclear power. It is a legal requirement to make sure the amount of man-made radiation that people are exposed to from discharges is kept within a safe limit."
        },
        {
            "text": "I’m a radiation specialist at the Environment Agency. As part of our work to create better places for people and wildlife we work with the other UK environment agencies, food standards agencies and the Centre for Environment, Fisheries and Aquaculture Science (Cefas) to pull together and analyse data from our UK-wide radiological monitoring programmes."
        },
        {
            "text": "25 years of reporting"
        },
        {
            "text": "We publish information about levels of radioactivity in food and the environment every autumn in our ‘Radioactivity in Food and the Environment report’, known to many as the 'RIFE report'. Overall we carry out around 10,000 analyses and radiation dose rate measurements each year."
        },
        {
            "text": "This year we are celebrating 25 years of RIFE – and so over this period in excess of a quarter of a million measurements have been taken and recorded. The report was first published by the Ministry of Agriculture, Fisheries and Food in 1996 - the first joint monitoring and assessment report for the whole of the UK."
        },
        {
            "text": "It’s evolved over the years into its current format and will continue to develop as we move forward. I’d like to acknowledge the significant effort and commitment of a large number of people, who have contributed in so many different ways over many years."
        },
        {
            "text": "Our combined independent monitoring of radioactivity in food and the environment is an important part of our regulatory process and fulfils a vital reassurance role."
        },
        {
            "text": "The programme monitors the environment and the diet of people who live or work near nuclear sites throughout the UK, from Dungeness in Kent to Dounreay on the north coast of Scotland. The report brings together all the results of monitoring of radioactivity in food and the environment. We use this information to estimate the amount of radiation the general public is exposed to, and particularly to those small groups of people who are most exposed because of their age, diet, location or way of life."
        },
        {
            "text": "Headlines from 2019 data"
        },
        {
            "text": "Overall, between 2018 and 2019 there have been no major changes in radioactivity in samples measured around UK nuclear sites or at other locations."
        },
        {
            "text": "Exposure from all sources of man-made radioactivity to members of the public was well below legal limits, demonstrating that radioactivity in food and the environment is safe."
        },
        {
            "text": "Learn more"
        },
        {
            "text": "The report includes summaries at the start of each chapter. Over the months ahead we’ll be reporting on the results to communities around nuclear sites and environmental groups."
        },
        {
            "text": "If you have any questions comment below or email nuclear@environment-agency.gov.uk"
        }
    ]
}