{
    "url": "https://vmd.blog.gov.uk/2023/07/24/advertising-and-labelling-unauthorised-veterinary-medicines-manufactured-for-use-under-the-cascade-extemporaneous-preparations/",
    "title": "Advertising and labelling unauthorised veterinary medicines manufactured for use under the cascade (Extemporaneous Preparations)",
    "authors": [
        "Lee Grist",
        "James Garrity"
    ],
    "categories": [
        "Inspections",
        "Legislation"
    ],
    "pub_date": "2023-07-24T11:44:39+01:00",
    "content": [
        {
            "text": "Lee Grist, Head of Distribution and Supply, and James Garrity from our Legislation Office explain what manufacturers can and can’t do when advertising and labelling extemporaneous preparations (also known as ‘specials’) manufactured for use under the cascade."
        },
        {
            "heading": 2,
            "text": "Manufacturers cannot advertise or promote unauthorised products"
        },
        {
            "text": "Extemporaneous preparations are not authorised veterinary medicines and can only be manufactured and supplied in response to a prescription issued by a vet under the cascade."
        },
        {
            "text": "Therefore, under Regulation 11 of the Veterinary Medicines Regulations (VMR), a manufacturer cannot advertise or promote this type of product."
        },
        {
            "heading": 2,
            "text": "What is considered advertising?"
        },
        {
            "text": "Manufacturers cannot advertise active ingredients, strengths or sizes, or specific diseases or conditions in any promotional material, including verbal, for their extemporaneous products."
        },
        {
            "text": "We have defined ‘advertising’ in our guidance as any activity that is aimed or designed to promote the sale, supply or use of a veterinary medicine, whether for profit or not. This includes electronic advertising, for example website banners and emails."
        },
        {
            "text": "Types of promotional adverts include:"
        },
        {
            "heading": 3,
            "text": "Manufacturers can:"
        },
        {
            "heading": 2,
            "text": "Providing vets with a price list "
        },
        {
            "text": "A manufacturer can provide price lists to a vet if they request one, and vets can sign up to receiving regular price list updates."
        },
        {
            "text": "These specifically requested price lists can include all active substances, formulations, and prices of all the products available from the manufacturer but may not include photos or additional information such as dosage instructions or indications for use."
        },
        {
            "text": "Price lists must be comprehensive, unbiased, and not highlight or give additional prominence to any product, such as marking any as “Newly available”."
        },
        {
            "text": "Providing a list that only includes a selection of products, or highlighting any products in any way, is considered advertising and therefore a breach of the VMR."
        },
        {
            "heading": 2,
            "text": "Product labels must only include necessary information"
        },
        {
            "text": "Extemporaneous preparations must be labelled by the manufacturer with only the necessary information as listed under Schedule 2, paragraph 26:"
        },
        {
            "text": "Instructions for use should be limited to the route of administration, for example ‘for intramuscular use’."
        },
        {
            "text": "Any other specific information for use should be added by the prescribing vet at the time of supply."
        },
        {
            "heading": 2,
            "text": "Brand names are not allowed"
        },
        {
            "text": "Including any other information on the label, such as a brand name, is considered to be promoting an unauthorised veterinary medicine and a breach of the VMR."
        }
    ]
}