{
    "url": "https://defrafarming.blog.gov.uk/2023/07/24/animal-health-and-welfare-equipment-and-technology-grants-help-shape-the-next-round/",
    "title": "Animal Health and Welfare Equipment and Technology grants: help shape the next round",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Payments to support animal health and welfare"
    ],
    "pub_date": "2023-07-24T11:18:43+01:00",
    "content": [
        {
            "text": "In March, we took another step forward on the Animal Health and Welfare Pathway by launching the first round of the Animal Health and Welfare Equipment and Technology grant."
        },
        {
            "text": "Grants ranging from £1,000 to £25,000 were offered towards the cost of items on a list. These items were chosen for their ability to improve the health and welfare of livestock and support our priorities. "
        },
        {
            "text": "The first round received a high level of interest from a range of sectors. As we evaluate how things went and look to the next round of the grant, we'd like you to share your thoughts."
        },
        {
            "text": "In this post, we'll explain how."
        },
        {
            "heading": 2,
            "text": "Get involved"
        },
        {
            "text": "If you're a farmer, supplier, industry consultant or manufacturer, we want to hear from you."
        },
        {
            "text": "We seek your feedback on 2 aspects of the grant:"
        },
        {
            "text": "Please share your views through the survey"
        },
        {
            "text": " It will remain open until 7 August."
        },
        {
            "heading": 2,
            "text": "Reviewing specifications "
        },
        {
            "text": "Each specification sets out the minimum criteria an item must satisfy to be eligible for funding. For example, it might list the minimum capacity for a water tank or the material of the tank."
        },
        {
            "text": "A clear specification is important because it ensures applicants understand exactly which pieces of equipment or technology are eligible for support."
        },
        {
            "text": " It also helps us to ensure that grants are targeted at high-quality items that deliver health and welfare benefits. "
        },
        {
            "text": "For example, farrowing arks for pigs that are fully insulated with extra ventilation better protect a sow and her piglets from extreme temperatures.  "
        },
        {
            "text": "The current specifications are included in the list of items that were eligible for the first round. "
        },
        {
            "text": "If you think an aspect of the specifications should be changed, please let us know through the survey."
        },
        {
            "heading": 2,
            "text": "Sector eligibility"
        },
        {
            "text": "At the moment, our list of items includes some equipment that is available to all sectors and some which were only available to a specified sector."
        },
        {
            "text": " It may be that some of these items could be useful to farmers from other sectors."
        },
        {
            "text": " As part of the survey, you can suggest changes to which sectors are eligible for items already on the list.  "
        },
        {
            "text": "Carrying out regular evaluations of our grants helps us ensure they work well, so please share your views. If you have any questions about the survey, leave a comment below. "
        }
    ]
}