{
    "url": "https://socialworkwithadults.blog.gov.uk/2023/07/24/care-plans-with-added-technology/",
    "title": "Care plans with added technology",
    "authors": [
        "Tommy Henderson - Reay",
        "Lyn Romeo"
    ],
    "categories": [
        "Care and support",
        "Innovation",
        "Knowledge and skills"
    ],
    "pub_date": "2023-07-24T14:07:34+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Tech solutions and social work"
        },
        {
            "text": "Technology is playing an increasingly important role in how care and support is delivered. As people’s needs change however, it’s important  technology solutions supporting those needs are also reviewed."
        },
        {
            "text": "Care technologies can be used by individuals, carers, local authorities, and care providers to support quality of life and the provision of high quality, safe, and personalised care."
        },
        {
            "text": "Increasing numbers of people are benefiting from technology solutions, helping them live independently in their own homes. These can range from specialist devices, including falls prevention and detection, to smart home technologies many of us use everyday."
        },
        {
            "text": "Telecare equipment, including wearable alarm devices, which can send an alert to a call centre, play an important role in supporting people to remain independent in their own homes, as well as acting as lifelines when emergency help is needed. Around 1.8 million people in the UK are using telecare devices."
        },
        {
            "heading": 2,
            "text": "Review and adapt"
        },
        {
            "text": "When care needs change, technology must adapt accordingly. Social workers may need to consider whether any devices in place to support a person’s care are still relevant in the wider context of their care plan, especially if their health is deteriorating."
        },
        {
            "text": "For example, a person might have diminishing mobility, which could put them at increased risk if there was a fire, especially if they smoked. Is there a telecare system already in place and is it compatible with a smoke alarm system? Does the change in circumstances mean there is a need to also make use of specialist devices, such as those to prevent falls or other smart home technologies?"
        },
        {
            "text": "Where technology is used most effectively, it is considered an integral part of good quality, consistent and safe care. Technology which supports a person's care should be referenced in any relevant care planning documentation, or digital social care record. This not only makes sure it is embedded into an overall approach to care, it also means its use is reviewed and updated as any preferences or needs change."
        },
        {
            "heading": 2,
            "text": "Our role as social workers"
        },
        {
            "text": "Social workers will continue to play an increasingly vital role in the use of technology within adult social care. We offer a unique perspective, one that holds technology to account to the standards, ethics and practices we ourselves adhere to. Reviewing care plans allows us to consider its use as part of an individual’s holistic care package, working with other local authority and care colleagues to provide high quality care."
        },
        {
            "text": "Viewing technology as part of the care people might receive is going to be an essential aspect of promoting high quality, safe and effective support in future. The risks of seeing it through a siloed lens, disconnected from a person’s experience of care, comes with great risk, yet social workers can bring a positive, person-centred perspective to how it is used by people drawing on care and support."
        },
        {
            "text": "We offer a unique insight into what person-centred care looks like. We understand risk and bring excellent systemic practice examples of how technology can support its delivery."
        },
        {
            "text": "As our world becomes increasingly digitised, it’s important to challenge digital exclusion and make sure social workers have the skills and training to understand the role technology plays in good care planning."
        }
    ]
}