{
    "url": "https://deframedia.blog.gov.uk/2023/07/24/coverage-on-new-protected-status-for-single-malt-welsh-whisky/",
    "title": "Coverage on new protected status for Single Malt Welsh Whisky",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Food"
    ],
    "pub_date": "2023-07-24T12:21:10+01:00",
    "content": [
        {
            "text": "There has been widespread coverage, including in BBC News, ITV News, Sky News, Radio 4’s Today Programme, BBC Radio Scotland, The Times, The Daily Telegraph, The Sun, The Guardian and The Mirror, following our announcement that Single Malt Welsh Whisky has been successfully registered under the UK Geographical Indication (UKGI) scheme."
        },
        {
            "text": "There is further coverage in specialist and regional titles including Decanter, Food Manufacture, Farming UK and Wales Online, as Food and Farming Secretary Thérèse Coffey announced the move today at the Royal Welsh Show."
        },
        {
            "text": "This new protected status is possible due to our departure from the EU and has been granted in recognition of the unique qualities of Single Malt Welsh Whisky, which now enjoys the same status as other Welsh fare like Gower Salt Marsh Lamb and Welsh Leeks. The scheme provides a guarantee to consumers that the product they are buying is the authentic local Single Malt and protects Single Malt Welsh Whisky producers from imitation products."
        },
        {
            "text": "Dating back to 1887, Single Malt Welsh Whisky is made using malted barley and water of 100% Welsh origin, with each step of the production process taking place in Wales, from brewing to bottling. The moderate and damp Welsh climate allows for an even rate of maturation, producing a smooth and refreshing flavour."
        },
        {
            "text": "Food and Farming Secretary Thérèse Coffey said: "
        },
        {
            "text": "Stephen Davies, CEO of Penderyn Whisky said:"
        },
        {
            "text": "Welsh Secretary David TC Davies said:"
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}