{
    "url": "https://environmentagency.blog.gov.uk/2023/07/24/ea-at-plastics-future-2023-sharing-creative-approaches-to-end-plastic-pollution/",
    "title": "EA at Plastics Future 2023 – sharing creative approaches to end plastic pollution",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Waste"
    ],
    "pub_date": "2023-07-24T14:54:50+00:00",
    "content": [
        {
            "text": "To celebrate Plastic Free July, Victoria Prowse and Helen Powers from the East Midlands Regulated Industry team write about their recent talk at the Plastics Future 2023 conference at Plymouth University."
        },
        {
            "text": "Earlier this year, we answered a call from the team at the Plastics Future 2023 conference at Plymouth University. The event aimed to bring together teams from around the world to share ideas and best-practice work to inspire new solutions to end plastic pollution.  They were looking for projects that had gone above and beyond the typical ways of engaging with the public about the impact of plastic pollution."
        },
        {
            "text": "In a 10 minute presentation, we talked about our 2021 collaboration with Nottingham’s Backlit Gallery and international artist Joshua Sofaer; who has previously produced works based on waste with the Science Museum."
        },
        {
            "text": "We had been looking for new ways to show our local communities the impact that waste has on our environment. And explained that because art is a medium that so many people can connect with, we saw this as a new and unusual way to engage with communities that we might typically struggle to connect with."
        },
        {
            "text": "In 2019, Joshua joined our officers and visited sites across the East Midlands so he could see the scale of the situation for himself. Joshua then came up with the idea of turning an art gallery into a plastic factory where plastic waste ends up."
        },
        {
            "text": "We shared pictures from the exhibition that showed how Joshua brought issues to life that the general public wouldn’t normally be able to see. In one room, people could watch a ‘day in the life of our officers’ and see the connection between waste and wildlife. In another, we showed the importance of recognising odour."
        },
        {
            "text": "There was also a sorting room where science communicators sorted plastic collected from the public. This plastic was then turned into a life size sculpture of a local resident weighing 96.8kg, because this is the average weight of plastic waste created per person per year in the UK."
        },
        {
            "text": " "
        },
        {
            "text": "We explained that as the Environment Agency is a science-based organisation, sometimes our messages can’t reach everyone. But this visual representation of waste powerfully showed the environmental harm caused by the production and consumption of plastic in a really accessible way."
        },
        {
            "text": "We then talked about the different ways we spread the message even further. Through organised litter picking sessions we were able to engage with our local communities and could talk about plastic pollution in their areas. Working with Nottingham City Council, we created STEM sessions for a local primary school. By talking about the different types of plastics, we could inform the next generation about the impact of plastic pollution. We also highlighted the power of using local media across the region and the success of inviting our local BBC tv/radio to join us at a STEM session."
        },
        {
            "text": "We finished by explaining how teams can continue their impact even after their projects finish and make them part of their long-term work. Through our Regulated Exhibition we learned that connecting in-person and talking about our local area worked really well. So, our teams continue to run STEM sessions in schools. We also still litter pick around the local area and make new connections with the outreach group and council."
        },
        {
            "text": "Because of the connections we made during the Exhibition, we were able to secure a place at Nottingham’s Green Hustle eco festival, so our Sustainability Network could spread the message even further"
        },
        {
            "text": "We also supported BACKLIT to set up an eco-arts initiative to provide a platform for more projects like this in the East Midlands."
        },
        {
            "text": "The conference was a great place to meet a wide variety of experts from a number of different disciplines and we were honoured to share the stage with really impressive projects. Many of the presentations were thought provoking and it certainly generated lots of conversation on the journey home."
        },
        {
            "text": "We hope that the contacts made during the conference will bring about future collaborations and that our contribution on the day has encouraged others to try something different. By engaging with wider audiences, together we can all work to create a better environment."
        }
    ]
}