{
    "url": "https://defrafarming.blog.gov.uk/2023/07/24/funding-applications-now-open-for-high-growth-agri-tech-businesses/",
    "title": "Funding applications now open for high-growth agri-tech businesses",
    "authors": [
        "Michael Reardon"
    ],
    "categories": [
        "Payments for research and innovation"
    ],
    "pub_date": "2023-07-24T13:05:56+01:00",
    "content": [
        {
            "text": "Photo credit: Budimir Jevtic Adobe Stock"
        },
        {
            "text": "Earlier this month we announced the £5 million Farming Innovation Investor Partnership competition with Innovate UK. We are pleased to say that applications are now open. The application window will remain open for 6 weeks until 30 August and there is a briefing session for potential applicants on 25 July at 10.30 a.m."
        },
        {
            "text": "In this post we'll give you a recap on the competition and how to apply for funding."
        },
        {
            "heading": 2,
            "text": "Farming Innovation Investor Partnership"
        },
        {
            "text": "The Farming Innovation Investor Partnership is a £5 million competition aimed at small and medium sized agri-tech businesses that are developing innovative solutions and technologies that make farming more productive, sustainable and resilient."
        },
        {
            "text": "The competition combines grant funding with private investment. "
        },
        {
            "text": "Defra will award grant funding for experimental development projects, e.g., a pilot or prototype of an innovative technology that is close to the market with demonstrable benefits to farmers, growers and foresters in England. "
        },
        {
            "text": "Private investment will then come from Innovate UK’s Investor Partner Pool which comprises around 80 investors with the expertise and appetite to invest in innovative agri-tech businesses. Private investment can be used to support wider company growth and scale ambitions outside of the aligned project."
        },
        {
            "heading": 2,
            "text": "Eligibility"
        },
        {
            "text": "Eligible project costs must be between £750,000 and £3 million and last 18 months. "
        },
        {
            "text": "Projects must start by 1 April 2024 and demonstrate benefits to farmers and growers in England, and must be led by a sole UK-registered micro/small or medium business. Defra will fund between 45% and 35% of eligible project costs, depending on business size."
        },
        {
            "text": "Aligned private investment must be at least twice the amount of the grant requested to complete the project and support the company to grow and scale."
        },
        {
            "heading": 2,
            "text": "How to apply"
        },
        {
            "text": "Applications must meet the eligibility criteria and be submitted through Innovate UK’s Innovation Funding Service before 11.00 a.m. on 30 August. Detailed guidance can be found in Innovate UK’s competition documents. "
        },
        {
            "heading": 2,
            "text": "Innovate UK Q&A Session"
        },
        {
            "text": "If you haven’t already, you can still sign up to Innovate UK’s applicant briefing session on 25 July at 10.30 a.m."
        }
    ]
}