{
    "url": "https://naturalengland.blog.gov.uk/2023/07/24/how-many-mussels-in-morecambe-bay-understanding-the-value-of-mudflats-and-sandflats-for-birds-humans-and-the-ecosystems-we-share/",
    "title": "How many mussels in Morecambe Bay? Understanding the value of mudflats and sandflats for birds, humans, and the ecosystems we share",
    "authors": [
        "Elizabeth Mitchell",
        "Louise Whatley"
    ],
    "categories": [
        "Marine environment",
        "Monitoring",
        "Natural England"
    ],
    "pub_date": "2023-07-24T16:42:08+01:00",
    "content": [
        {
            "text": "By Louise Whatley, Marine Ecology Specialist and Elizabeth Mitchell, Senior Advisor for Engagement and Impact "
        },
        {
            "text": "As summer sets in in earnest, millions of us will head to the coast. In between dropping our ice-creams on our feet and taking a large bite of sandy sandwich, there’s a reasonable chance that we’ll take some time to appreciate the landscapes around us: warm sand spilling between our toes, the magic seaweed gardens of a sheltered rockpool, an oystercatcher letting out a shrill hu-eep as it skims over the mudflats. "
        },
        {
            "text": "We recognise the value of our coastlines in our decision to spend our precious free time enjoying them. But we also receive many other “ecosystem services” from this zone between sea and land, not all of them as visible as a summer holiday. "
        },
        {
            "text": "Mudflats and saltmarshes defend homes, businesses and agricultural land against unpredictable surges and sea level rise, and act as quick fixers of carbon (a hectare of saltmarsh captures between two and eight tonnes in a year). They also underpin the healthy functioning of ecosystems at a much broader scale, among other things by providing food, refuge, and nesting habitat for wading birds and seabirds. "
        },
        {
            "text": "In autumn 2022 and spring 2023, as part of Defra’s marine Natural Capital and Ecosystem Assessment programme, Natural England carried out surveys in Morecambe Bay and the Solway Firth, some of the largest areas of mudflat and sandflat in the UK. Surveyors went out on foot on the sediments near the shore, while areas further out were surveyed by hovercraft. "
        },
        {
            "text": "The goal was to determine which animals live where in the intertidal zone (the area which is covered by water at high tide but exposed at low tide), and from this to establish the capacity of these mudflats to provide food for overwintering birds.  "
        },
        {
            "text": "Animals which live in the sediment of mudflats and sandflats are called infauna. They include ragworms, lugworms, cockles, and mussels, and are usually hidden to the human eye, with a few exceptions like lugworm casts – worm-shaped mounds of sand left on the surface as relics of the living worm’s burrowing activity underneath. "
        },
        {
            "text": "In Morecambe Bay and the Solway Firth, infauna are preyed on by overwintering birds including ringed plover, knot, oystercatcher, little tern and arctic tern – an all-you-can-eat restaurant whose opening hours are determined by the rise and fall of the tides.  Some infauna are also preyed on by humans: shellfish (cockles and mussels) are harvested from these areas for human consumption.  "
        },
        {
            "text": "The data from these sediment surveys will be integrated with digital aerial bird survey data and with assessments of shellfish stock undertaken by the local Inshore Fisheries and Conservation Authority (IFCA).  From the results, we’ll model the energy content of sediment-dwelling animals across these sites, and predict how well bird populations are likely to survive over winter based on their energy requirements and the energy value of their food. "
        },
        {
            "text": "Finally, we’ll integrate data on the cultural worth of wading birds and wildlife recreation: how much local residents and external visitors value these mudflats and the birds which use them, whether through sitting on the shore with binoculars, or simply through the wellbeing which comes from knowing that the sites are there and are in good condition.  "
        },
        {
            "text": "Considered together, these different types of information about different types of value, from the ecological to the socio-economic, will help us to make better decisions about how to manage these sites for nature and for people. For example, once we’ve predicted the quantity of shellfish required to maintain bird populations, we’ll have a better sense of how much humans can harvest before the birds (and also local residents and visiting tourists) start to suffer from the competition."
        },
        {
            "text": "This sort of holistic decision making, which tries to incorporate the wider benefits of the environment to society, is known as a natural capital approach, and the work is one of the many projects that contribute to the marine Natural Capital and Ecosystem Assessment (mNCEA) programme, a 3-year research and development programme led by Defra. mNCEA is providing the robust evidence base, suite of tools and underpinning framework which will improve our understanding of the complex trade-offs faced in using marine environments sustainably; the programme supports the government’s ambition to integrate natural capital approaches into marine decision making. "
        },
        {
            "text": "You might even notice the results on a future summer holiday… "
        }
    ]
}