{
    "url": "https://valuationoffice.blog.gov.uk/2023/07/24/proving-letting-information-for-self-catering-holiday-lets/",
    "title": "Proving letting information for self-catering holiday lets",
    "authors": [
        "Chris Sykes - Director of Operations, Regional Valuation Units"
    ],
    "categories": [
        "Self-catering holiday lets"
    ],
    "pub_date": "2023-07-24T11:22:07+01:00",
    "content": [
        {
            "text": "Staying in a self-catering holiday let is a popular option for many holiday makers in England and Wales. Holiday lets are often run on a commercial basis, providing a source of income for their owners.  "
        },
        {
            "text": "If an owner wants their property to be liable for business rates, they need to meet criteria to be eligible to remain in the non-domestic rating list. The criteria changed in April 2023.  "
        },
        {
            "text": "Why we ask for letting information "
        },
        {
            "text": "We are legally required to make sure the non-domestic rating lists and Council Tax lists are accurate.  "
        },
        {
            "text": "We have been writing to holiday let owners, whose properties are currently in the non-domestic rating lists for England and Wales, asking them to provide letting information about their property. We then use this information to check whether the eligibility criteria have been met. If it has, then the property can remain in the non-domestic rating list and continue to be liable for business rates.  "
        },
        {
            "text": "We also ask for letting information as part of our regular revaluations.  "
        },
        {
            "text": "We let owners know when they need to provide this information. The only time owners need to contact us proactively to share letting information is when a property is currently in the Council Tax list, but the property has met the criteria to move to the non-domestic rating list. There is a specific form for this – one for England and one for Wales.  "
        },
        {
            "text": "Provide the information within 56 days "
        },
        {
            "text": "If you receive a letter from the VOA asking for letting information about your self-catering holiday let, it’s important that you return it within 56 days of when it was issued. If you don’t then your property will be moved into the Council Tax list, regardless of whether you meet the criteria or not.  "
        },
        {
            "text": "We’re required legally to do this. Again, this is part of our statutory requirement to maintain accurate non-domestic rating lists. When we ask for information to help us do this, owners are legally required to provide an accurate response within 56 days.  "
        },
        {
            "text": "Digital is best "
        },
        {
            "text": "We send a hard copy form when asking for this information. But you can complete a digital version of the form and return it to the VOA via email. There is a form for England and a form for Wales. We prefer receiving this information over email where possible. It gets to us quicker, and it’s more efficient."
        }
    ]
}