{
    "url": "https://educationhub.blog.gov.uk/2023/07/24/school-uniform-how-much-does-it-cost-and-what-financial-support-is-available/",
    "title": "School uniform: How much does it cost and what financial support is available",
    "authors": [
        "media officer"
    ],
    "categories": [
        "Schools"
    ],
    "pub_date": "2023-07-24T14:18:15+01:00",
    "content": [
        {
            "text": "School uniforms provide a sense of belonging for students. They are helpful in developing a good learning environment and can help build the character of a school."
        },
        {
            "text": "They can also reduce peer pressure at school for the latest clothes and help children feel settled at school, but we recognise they can be costly for parents, which is why we have guidance for schools to manage costs down."
        },
        {
            "text": "Here’s what you need to know about your child’s school uniforms and our guidance on costs."
        },
        {
            "heading": 3,
            "text": "What are the rules about school uniform?"
        },
        {
            "text": "Although we encourage schools to have a uniform, it’s up to individual schools to set their own policies, they may even decide that they don’t want a uniform. Whatever they decide, their policy should make it fair for all."
        },
        {
            "heading": 3,
            "text": "How much should school uniform cost?"
        },
        {
            "text": "How much school uniforms cost varies depending on the school, but no school uniform should be so expensive that it leaves pupils or their families feeling unable to apply to, or attend, a school of their choice due to the cost of the uniform."
        },
        {
            "heading": 3,
            "text": "What is the government doing to ensure school uniforms are affordable for parents?"
        },
        {
            "text": "To ensure uniform costs are reasonable for families we published statutory guidance in 2021, which schools must have regard for when developing and implementing their uniform policy."
        },
        {
            "text": "It also covers the use of branded items, the provision of second-hand uniform, and the information schools should provide to parents regarding their uniform requirements."
        },
        {
            "text": "The guidance came into effect this academic year and we expect all schools to be compliant by September 2023."
        },
        {
            "heading": 3,
            "text": "What help is there for families struggling with school uniform costs? "
        },
        {
            "text": "In England, some local authorities (LAs) provide discretionary grants to help with buying school uniforms for those struggling to meet the costs, providing they are eligible."
        },
        {
            "text": "In some cases, individual schools or trusts may run their own schemes to provide assistance, for example to support new intakes of pupils or in the event of large changes to the existing uniform.  This will vary depending on the school."
        },
        {
            "text": "Schools should also make sure that arrangements are in place so that second-hand school uniforms are available for all parents. Schools can participate by signposting parents to an already established second hand uniform scheme, or they can set up their own provision."
        },
        {
            "text": "Information on second-hand uniforms should be clear for parents of current and prospective pupils and published on the school’s website."
        },
        {
            "heading": 3,
            "text": "Do children have to wear the school's branded clothing? "
        },
        {
            "text": "We know that parents can sometimes be required to buy branded items of school uniform for their children, so our guidance makes clear that schools should keep the use of branded items to a minimum and limit it to only long-lasting or low-cost items."
        },
        {
            "text": "It means parents should be able to buy most uniform items from a wide range of shops, including high street retailers and supermarkets."
        },
        {
            "text": "Branded items do need to be bought from specific shops, but schools will be required to make sure that cost and value for money are given the highest priority when choosing suppliers."
        },
        {
            "heading": 3,
            "text": "What happens if a school doesn’t appear to be following the rules?"
        },
        {
            "text": "We expect schools to comply with the guidance."
        },
        {
            "text": "If parents are concerned that their child's school is not following the guidance, they should raise this with the school through the school’s published complaints process."
        },
        {
            "text": "Where parents have gone through their school’s complaints process and feel the school has not adequately addressed their concerns, they may raise this with the Department for Education."
        }
    ]
}