{
    "url": "https://defradigital.blog.gov.uk/2023/07/24/why-its-important-for-me-to-make-time-for-self-care/",
    "title": "Why it’s important for me to make time for self-care",
    "authors": [
        "Sarah Hoy"
    ],
    "categories": [
        "Defra digital",
        "Digital transformation"
    ],
    "pub_date": "2023-07-24T09:17:39+01:00",
    "content": [
        {
            "text": "On International Self-Care Day Sarah Hoy explores what self-care means to her, and considers how each of us can try to improve our health."
        },
        {
            "text": "International Self-Care Day is an annual opportunity to put a spotlight on self-care and the benefits that effective self-care can bring to both individuals and healthcare systems as a vital foundation of health. It’s the culmination of a month of activities promoted by the World Health Organisation (WHO)."
        },
        {
            "text": "It was reading my colleague Kata Papunen’s recent blog about mental health and tips for managing mental wellbeing that inspired me to share my own thoughts around this topic."
        },
        {
            "heading": 2,
            "text": "What is self-care?"
        },
        {
            "text": "WHO defines self-care as individuals, families and communities’ promoting and maintaining their own health, preventing disease, and coping with illness and disability, with or without the support of a health worker."
        },
        {
            "heading": 2,
            "text": "What it means to me"
        },
        {
            "text": "For me, self-care includes trying to make sure I take time to exercise as part of my everyday routine – which might be cycling/walking/jogging as part of the nursery drop off/pick up for my two year old son; making time to do an online on-demand yoga session on my lunch break or before I start work (which might only be a 15 minute session if I’m having a busy day, but every little helps);  or finding opportunities to connect with nature as part of exercising  (which might be cycling along the canal to the train station; going for a walk to the nearby river; or a quick walk around the fields close to home if I’m short on time)."
        },
        {
            "text": "I also try to be mindful about what I’m eating and try to make sure I don’t get through the day on snacks rather than meals. This means making time to prep for the day ahead to make sure I eat healthy and balanced meals. Those who I work closely with will already know that I really enjoy my food, and it’s important to me to keep fuelled up so I maintain my energy and concentration levels."
        },
        {
            "text": "I find the ‘no meeting hour’ that we have in Defra over lunchtime an important time that provides the space not only as a break from meetings, but also provides a reminder to take a break from work for half an hour to prioritise my own needs."
        },
        {
            "text": "I find that having a network is another important part of maintaining my mental health, which includes relationships with colleagues, friends, and family. Having people that I can be open and honest with about challenges, fears or concerns helps by not only from hearing other people’s perspectives, but also takes the burden away from having something bottled-up which in itself can provide a sense of relief."
        },
        {
            "heading": 2,
            "text": "Things we do in Defra to prioritise self-care"
        },
        {
            "text": "In our Digital Data and Technology Services function within Defra we host a monthly virtual ‘Air and Share for Wellbeing’ session, which is all about connecting in a safe, supportive space. We talk about our mental health, free from judgement, and share survival tips on managing our mental health. Often the power of someone sharing their own experience can help others feel that they are not alone."
        },
        {
            "text": "This month the session will focus on Personal Resilience. We’ll talk about how small habits can help people cope when facing change or pressure. Personal resilience draws on your inner strength when you have difficult days and helps you prioritise your self-care when you need it most."
        },
        {
            "text": "We have also just introduced a new Wellbeing Charter, which includes many self-care tips, such as taking breaks and muting work devices outside your working hours. These working practice principles encourage us to maintain a healthy work-life balance and ensure good physical and mental health in the workplace.​"
        },
        {
            "text": "Our Coffee Roulette is another great way to boost mental health by making connections with each other at work. Over 150 of our colleagues are part of the initiative each month where they are matched with a different person and find 30 minutes to have a chat and a brew. It isn’t always a work-related conversation, and offers an opportunity to connect us, build networks, and get to know each other better across our widely dispersed teams in DDTS."
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}