{
    "url": "https://prisonjobs.blog.gov.uk/2022/06/01/a-day-in-the-life-of-a-probation-officer/",
    "title": "A day in the life of a probation officer",
    "authors": [
        "Sam Gildersleeve"
    ],
    "categories": [
        "Personal stories",
        "PQiP",
        "Probation",
        "Ways of working"
    ],
    "pub_date": "2022-06-01T11:11:42+01:00",
    "content": [
        {
            "heading": 3,
            "text": "Ever wondered what a typical day looks like for a probation officer? The role can be challenging yet exciting. We asked Sam Gildersleeve what a day in his shoes looks like."
        },
        {
            "text": "Morning routine "
        },
        {
            "text": "After an all-important cup of coffee, Sam’s day starts at 9am with a quick diary check to plan for the day."
        },
        {
            "text": "He then heads to his first appointment with a person on probation. As this individual has committed a sexual offence, Sam uses the Maps for Change toolkit to structure their supervision."
        },
        {
            "text": "Sam’s second appointment of the day is with someone who has recently been sentenced to court. As part of this meeting, Sam completes initial paperwork. This includes the offender agreement where Sam outlines what is expected from the probation appointments. He also summarises what is expected from them and how they should engage."
        },
        {
            "text": "As the day goes on"
        },
        {
            "text": "Sam’s role as a probation officer often involves working with other agencies. A person on probation Sam works with has recently become homeless, so he has organised a meeting with the local council to explore the support that could be offered."
        },
        {
            "text": "Next, Sam has a video call with a prison to interview an individual who has recently been recalled to custody."
        },
        {
            "text": "End of the day"
        },
        {
            "text": "Sam ensures his contact logs are updated for all the people on probation he’s interacted with. Once this is done, Sam is ready to head home."
        },
        {
            "text": "All in all, as Sam puts it “no two days are the same.” As a probation officer, you will get to utilise lots of different skills to communicate with lots of different people on a daily basis."
        }
    ]
}