{
    "url": "https://defrafarming.blog.gov.uk/2022/06/01/a-fresh-start-for-new-entrants/",
    "title": "A fresh start for new entrants",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Payments for entering farming"
    ],
    "pub_date": "2022-06-01T11:46:23+01:00",
    "content": [
        {
            "text": "It's hard to get started in farming, or any related land-based business."
        },
        {
            "text": "Newcomers to the industry (usually known as \"new entrants\") face all sorts of barriers. It's challenging for them to find land, secure finance and progress their businesses."
        },
        {
            "text": "When we published the Agricultural Transition Plan towards the end of 2020, we said that we would establish a support scheme for new entrants, and make the whole process easier."
        },
        {
            "text": "At a time when economic and environmental challenges make innovation and fresh thinking more valuable than ever, we want to do what we can to encourage new entrants to the industry, with all the new ideas and new business models they can bring."
        },
        {
            "text": "We're also keen to encourage investment and growth in all manner of land-based businesses. This is not just about arable or animal farming, but also horticulture, agro-forestry and provision of environmental services, such providing livestock for arable farms as part of an agroecology system. When businesses use land for growing food and/or environmental benefits, we want creativity to be the lead."
        },
        {
            "text": "This blog post is an update on what we've learned so far by working collaboratively with people across the sector, and the next steps."
        },
        {
            "heading": 2,
            "text": "Working with the right people"
        },
        {
            "text": "Early on in the process, we set up a steering group to bring in external expertise, made up of landowners, estate managers, support providers and some recent new entrants."
        },
        {
            "text": "We've also been working with trade associations, banks, unions, research institutions and Young Farmers’ groups, just to name a few, as well as hosting a series of webinars to share the rich knowledge out there."
        },
        {
            "text": "Among other things, we have learned that:"
        },
        {
            "heading": 2,
            "text": "Testing solutions – pilot incubators"
        },
        {
            "text": "Our collaborative work has also begun to identify potential solutions, which we now want to test."
        },
        {
            "text": "This month we are putting out a call for proposals from organisations to lead pilot incubator projects over the coming autumn and winter. These incubators will provide tactical support to young businesses through the early stages of development, nurturing would-be entrepreneurs to further develop a business idea, and fostering innovation and growth."
        },
        {
            "text": "The pilot incubators will support new entrants of any age, at different stages of their journey: those with practical experience now looking to start-up their own land-based business and those wanting to scale-up their business in the first 10 years. These incubators will cover a reasonable geographical spread and both rural and peri-urban situations, which tend to pose different challenges."
        },
        {
            "text": "We want to use these pilots to see what works in terms of increasing the chances of new and recent entrants’ accessing the land and finance they need to develop innovative new land-based businesses. Landowners and finance providers want to support fresh, innovative business thinking, and we want to work with them to understand how to make new entrants less risky as an investment."
        },
        {
            "text": "While the incubator work is very important, it is not the only work that will feed into the design of the final scheme. For instance, we want to look at how to attract a more diverse range of people into land-based businesses. This is not the only government activity in this space, as we have also funded The Institute for Agriculture and Horticulture to work to develop a comprehensive career development platform for people in land-based businesses, whether they are starting their own business or not."
        },
        {
            "text": "If you would like to apply for this opportunity for your organisation to lead a pilot incubator project this autumn and winter, please respond on the Defra e-tendering portal."
        },
        {
            "text": "To find out more about co-design, or take part in future co-design sessions and webinars, please email us at: ffcpcodesign@defra.gov.uk"
        }
    ]
}