{
    "url": "https://insidehmcts.blog.gov.uk/2022/06/01/a-sobering-success-for-alcohol-monitoring-requirements/",
    "title": "A sobering success for alcohol monitoring requirements",
    "authors": [
        "Daniel Hodges"
    ],
    "categories": [
        "Crime"
    ],
    "pub_date": "2022-06-01T16:30:22+01:00",
    "content": [
        {
            "text": "According to latest crime statistics, 39% of victims of serious offences believe that alcohol played a part in the offence."
        },
        {
            "text": "Since March last year, courts in England have been able to impose Alcohol Abstinence and Monitoring Requirements (AAMRs). If drinking was a factor in an offender’s crime, AAMRs ban them from drinking alcohol for up to 120 days. They must also wear an alcohol monitoring tag as part of their community sentence."
        },
        {
            "text": "Last May, I blogged about how HMCTS prepared for the new sentencing requirement and our work with probation and partner agencies."
        },
        {
            "text": "Over a year since their introduction, I want to reflect on the courts’ role in sentencing, as well as the positive impact on courts’ workloads due to high compliance rates with this particular sentencing requirement."
        },
        {
            "heading": 2,
            "text": "Why are electronic monitoring tags used?"
        },
        {
            "text": "Using tags as a requirement of a court order gives courts and probation practitioners more certainty around whether the offender is complying with the order or not. It also provides greater opportunities for more informed conversations and collaboration across the agencies dealing with the offender."
        },
        {
            "text": "Roughly 20% of offenders supervised by the Probation Service have an alcohol misuse problem. The service monitors risk, provides support to offenders and helps them address their alcohol consumption while linking them to specialist help."
        },
        {
            "text": "When courts impose an alcohol ban with an alcohol tag for a community sentence, they’re also providing time and space to address underlying issues to support offenders’ rehabilitation, and ultimately help reduce reoffending."
        },
        {
            "heading": 2,
            "text": "How the tags work"
        },
        {
            "text": "An alcohol tag is imposed within an AAMR for adult offenders as a requirement of a community order or suspended sentence order for an alcohol-related offence, or for an associated offence that’s also alcohol-related."
        },
        {
            "text": "The tag takes a sample of the wearer’s sweat every 30 minutes. It provides a continuous record of whether the offender has been drinking. If the tag detects alcohol or is tampered with, an alert is sent to the Probation Service."
        },
        {
            "text": "In the event of non-compliance with the AAMR, the Probation Service decides whether a case should be brought back to the court, with a full and detailed report of all alleged breaches."
        },
        {
            "text": "The detail and the clarity of the probation report helps the court to decide on further sentencing. If an offender breaks their alcohol ban, they can face a return to court or prison sentence."
        },
        {
            "heading": 2,
            "text": "Compliance rates to date "
        },
        {
            "text": "I asked Robyn Malan de Merindol from the Policy, Communications and Analysis Group at Ministry of Justice about the overall success rates to date:"
        },
        {
            "heading": 2,
            "text": "Positive impact on courts "
        },
        {
            "text": "Overall, courts have coped really well with the introduction of the AAMR over the last year."
        },
        {
            "text": "It was a difficult time to roll it out because it was during the height of the pandemic. We had to hastily reschedule our training so it could be delivered online, but through this training we were able to show that the impact on court staff would be minimal."
        },
        {
            "text": "The high compliance rates mean lower numbers of offenders breaching their sentencing requirements and being sent back to court. This gives courts more time to deal with other cases and priorities."
        },
        {
            "text": "The most rewarding thing for me is that it’s actually helping offenders turn their lives around and it’s reducing reoffending rates. And that’s a huge positive."
        },
        {
            "text": "Find out more about how alcohol tags are helping thousands of offenders stay sober."
        }
    ]
}