{
    "url": "https://digitaltrade.blog.gov.uk/2022/06/01/data-workspace-challenge-how-different-directorates-worked-together-to-make-better-use-of-data/",
    "title": "Data Workspace Challenge: how different directorates worked together to make better use of data",
    "authors": [
        "Freya Krol, Data Engineer"
    ],
    "categories": [
        "Culture",
        "Data",
        "People and Skills"
    ],
    "pub_date": "2022-06-01T12:21:07+01:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": "During Digital, Data and Technology (DDaT) week, 25-29 April, the Data Infrastructure team ran a ‘Data Workspace Challenge’ for all Department for International Trade (DIT) staff. Colleagues were encouraged to put forward ideas about how DIT could use data in new and creative ways to solve or fix problems. We shortlisted the best ideas to be brought to life, with the help of an assigned Data Analyst. "
        },
        {
            "heading": 2,
            "text": "Encouraging the use of data"
        },
        {
            "text": "We opened the challenge to everyone in DIT, with the aims of: "
        },
        {
            "text": "We sought ideas that would improve the lives of those working at DIT or using our public services. We wanted to progress projects we could make tangible progress on in a week or would provide the foundations for wider delivery of DIT’s priority outcomes.  "
        },
        {
            "text": "The reception from DIT colleagues was fantastic. Over 22 project proposals were submitted from 18 different teams from around the globe across four directorates.  "
        },
        {
            "heading": 2,
            "text": "Selecting our shortlist  "
        },
        {
            "text": "We shortlisted 5 proposals to be developed in the Data Workspace Challenge and partnered each project with a data analyst from our team. This provided an opportunity for colleagues to collaborate with others outside of their teams. Participants outside the DDaT function were able to deepen their data capability and learn new skills through tailored assistance and support.  "
        },
        {
            "text": "Some of the shortlisted projects included: "
        },
        {
            "text": "Karl Gunner, Chief Digital Officer: North America Trade and Investment, shared: "
        },
        {
            "text": "‘We loved working with DDaT. It was such fun and incredibly motivating to collaborate with Shan Zhang (Head of Business Analysis and Reporting, China Strategy Team) and Matt McKenzie (Data Analyst) across Beijing, London, and New York. We were able to produce a prototype for something that our Trade professionals and leadership have been seeking for a long time. We’re excited to show the potential for any region to see their export pipeline integrated with their wins and targets. This provides evidence-based forecasting for the very first time and will, we believe, lead to an increase in UK trade.’ "
        },
        {
            "heading": 2,
            "text": "Presenting and judging the finalists  "
        },
        {
            "text": "Our Showcase and Awards ceremony was a hybrid event. It took place in Old Admiralty Building and virtually, with some colleagues dialling in from abroad! Each project was given the chance to present what they had worked on over the course of the week. Both audience members and the judging panel were then given the opportunity to ask questions and probe deeper into each project. Our judging panel composed of Sian Thomas, Chief Data Officer, Jane Naylor, Chief Statistician, and Martin Cook, Deputy Director: Export Programmes, who deliberated and selected a final winner.  "
        },
        {
            "heading": 2,
            "text": "The winning project "
        },
        {
            "text": "The winning project was led by Ralph Steeden, Governance Lead, and Tom Mockford, Contract Manager, supported by Leah Levy, Data Analyst. Their idea was to create a dashboard that would allow the Financial Governance team to provide various sets of data to Directors and Director Generals (DGs). Previously, the team had no data where they could identify spend per DG group on expenses and Government Procurement Card transactions.  "
        },
        {
            "text": "The new dashboard allows them to track data across various years, filter down to director level, and conduct trend analysis on policy violations over time. This will save them substantial amounts of time and make it easier to identify non-compliant claims.  "
        },
        {
            "text": "Tom Mockford, who worked on the project, said:  "
        },
        {
            "text": "‘We can now ‘cross-check’ claims against pre-defined values, meaning that we are conducting more in-depth analysis which was simply not possible without this dashboard. We can also now create and give reports to seniors on their spend, enabling them to identify savings where appropriate”. "
        },
        {
            "heading": 2,
            "text": "Next steps "
        },
        {
            "text": "The Data Workspace Challenge was a fantastic showcase of the data-driven innovation possible through cross-collaboration between DDaT and other directorates. It allowed colleagues outside of DDaT to discover and explore data available on Data Workspace, improve their skills and build relationships across the department. "
        },
        {
            "text": "Seeking creative opportunities to drive value from data sources aligns with our new data strategy, which lays out our commitment to develop DIT culture, capability, and skills. DIT’s mission to use data to inform decision making is dependent on initiatives that champion ongoing learning across all roles and areas. We hope to make the Challenge an annual event, to continue using DIT’s data in new and inventive ways.  "
        }
    ]
}