{
    "url": "https://marinedevelopments.blog.gov.uk/2022/06/01/drop-in-sessions-on-planning-for-demersal-non-quota-fisheries/",
    "title": "Drop-in sessions on planning for demersal non quota fisheries",
    "authors": [
        "David Patrick, Digital Communications Manager"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2022-06-01T14:22:56+01:00",
    "content": [
        {
            "text": "We are hosting a series of engagement sessions with fishers to kickstart conversations on development a Fisheries Management Plan (FMP) for demersal non quota stocks in the Channel."
        },
        {
            "text": "These events are just the start of our programme of engagement with fishers, the wider fishing industry and a range of marine stakeholders as we scope out what the FMP needs to achieve and how we’re going to do it."
        },
        {
            "text": "The Channel NQS FMP will include ICES divisions 7d and 7e and will cover demersal species such as red, tub and grey gurnards, cuttlefish, squid, octopus, john dory, surmullet and lesser spotted dogfish​."
        },
        {
            "text": "The planned programme of events is below – we will visit more ports to meet stakeholders later this year:"
        },
        {
            "text": "Plymouth | Drop in | 9.30-12 noon | Quayside | 14 June"
        },
        {
            "text": "Plymouth | Drop in | 9.30-12 noon | Plymouth Trawler Agents  | 14 June"
        },
        {
            "text": "Newlyn | Drop in | 11am-2pm | CFPO office | 15 June"
        },
        {
            "text": "Brixham | Drop in | 9am-12 noon | Quayside | 15 June"
        },
        {
            "text": "Truro | Drop in | 4pm-6pm | County Arms Hotel | 15 June"
        },
        {
            "text": "Brixham | Drop in | 4pm-6pm | Brixham Trawler Agents | 15 June"
        },
        {
            "text": "Mevagissey | Drop in | 9am-12noon | Social Club  | 16 June"
        },
        {
            "text": "Exmouth | Drop in | 10am-12 noon | Quayside | 16 June"
        },
        {
            "text": "Axmouth | Drop in | 1.30-2.30pm | Quayside | 16 June"
        },
        {
            "text": "Fowey | Drop in | 2pm-4pm | Quayside | 16 June"
        },
        {
            "text": "Lyme Regis | Drop in | 4pm-6pm | Quayside |  16 June"
        },
        {
            "text": "Looe | Drop in | 9am-12noon | Quayside | 17 June"
        },
        {
            "text": "Weymouth | Drop in | 9am-12 noon | Quayside | 17 June"
        },
        {
            "text": " "
        },
        {
            "text": "For locations covering Hampshire, Sussex and Kent (ICES 7d), here are the locations and dates  – please email FMP@marinemanagement.org to register your interest in talking with us so we can set up a conversation when we’re in your area. Facebook page."
        },
        {
            "text": "Brighton                                            June 20 (PM)"
        },
        {
            "text": "Hastings & Rye                               June 21"
        },
        {
            "text": "Eastbourne & Newhaven             June 22"
        },
        {
            "text": "Shoreham & Selsey                       June 23"
        },
        {
            "text": "Gosport                                              June 24"
        },
        {
            "text": " "
        },
        {
            "text": "Development of a plan specifically for demersal non-quota species in the Channel was highlighted by the fishing industry and other key marine stakeholders as a necessary move to ensure stocks are not being over-exploited given the lack of data about non-quota stocks in general."
        },
        {
            "text": "This FMP is one of 43 FMPs to be developed under the Joint Fisheries Statement to support a sustainable and profitable fishing industry."
        },
        {
            "text": "The Channel demersal NQS FMP will be among the first of six frontrunner FMPs being developed, with an aim to publish the plans at the end of 2023."
        },
        {
            "text": "In addition to our engagement sessions we have set up a dedicated email channel address for stakeholders to contact us directly. So if you are interested in the Channel demersal NQS FMP and want to be included in our stakeholder communications please send your details in confidence and a summary of your particular interest to FMP@marinemanagement.org.uk."
        }
    ]
}