{
    "url": "https://ruralpayments.blog.gov.uk/2022/06/01/introducing-you-to-5/",
    "title": "Introducing You To...",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Basic Payment Scheme",
        "Countryside Stewardship",
        "Environmental Stewardship",
        "Introducing You To",
        "Rural Payments service"
    ],
    "pub_date": "2022-06-01T15:01:41+01:00",
    "content": [
        {
            "text": "Hi. I’m Paul and I’m a Senior Geospatial Analyst with RPA based in Leeds. I’ve been with the agency for three years, having transferred from Natural England (NE) with the Countryside Stewardship Scheme. However, I’ve worked for NE and its predecessors for 24 years. My current role is essentially morphed from my role as subject matter expert for mapping, data and reporting in the Countryside Stewardship development team. I’ve always had the link to Geospatial work since I first started as a cartographer in 1998."
        },
        {
            "text": " "
        },
        {
            "text": "I’m responsible for ensuring RPA has the latest available intelligence in support of the Countryside and Environmental Stewardship schemes, and I’m part of a project team currently working up options for the future land management schemes."
        },
        {
            "text": " "
        },
        {
            "text": "For me, it’s all about providing our customers with the best intelligence we have to help guide their choices on the actions they’d like to take up on their land and then supporting them through the process. I provide analysis outputs that feed into toolkits used by RPA operations colleagues. It’s one of those back office ‘under the radar’ scenarios where colleagues may not even realise the geospatial team have been involved."
        },
        {
            "text": " "
        },
        {
            "text": "In the Geospatial team we’re always looking for opportunities to innovate and make things better for everyone. My days are very hectic. There’s an awful lot of work going on across Defra and we are all working together to identify the most appropriate route for building an application for Local Nature Recovery (LNR) as part of the Sustainable Farming Incentive (SFI). As the delivery body, we have a key part to play, with my involvement being around the use of a wide variety of data assets for prioritising what actions/options are appropriate in what areas and how this feeds into the application process. Data standards are also a key part of our requirements to get the best out of any data assets, but also allows for customers to be engaged in this process and potentially submit their own evidence data to help improve our assets going forward. Ultimately, having confidence in our data assets improves our relationship with stakeholders and provides potential for automation of checks for compliance, monitoring and evaluation of the scheme."
        },
        {
            "text": " "
        },
        {
            "text": "My current work on the future schemes is really quite interesting, and a big challenge, and it provides me with an opportunity to shape how we do things in the future. Improving data is a constant cycle. If we can improve the data and reduce any issues that can arise from inaccuracies, we can free up the time to support our customers more."
        },
        {
            "text": " "
        },
        {
            "text": "I live in a great community in Leeds with my partner and two grown up children. Super proud of both of them, with my 23-year-old son, having just graduated with a first (with honours) in Music Technology and my 19-year-old having recently started a degree apprenticeship with Yorkshire Building Society. We are coming to the end of a major extension on the house, so most free time is taken up with DIY activities. I also enjoy walking and cycling, rugby (mostly watching these days after one too many injuries) and have started getting into a bit of pyrography… takes my mind away from everything for a little while to recharge the batteries…"
        }
    ]
}