{
    "url": "https://videosurveillance.blog.gov.uk/2022/06/01/is-there-a-legitimate-role-for-facial-recognition-in-policing-and-law-enforcement/",
    "title": "Is there a legitimate role for facial recognition in policing and law enforcement?",
    "authors": [
        "frasersampson"
    ],
    "categories": [
        "AI technology",
        "Biometrics",
        "Biometrics and Surveillance Camera Commissioner",
        "Facial Recognition Technology",
        "Policing",
        "Privacy",
        "Surveillance cameras",
        "Uncategorized"
    ],
    "pub_date": "2022-06-01T11:16:59+01:00",
    "content": [
        {
            "heading": 3,
            "text": "London School of Economics, 5pm-9.15pm, 14 June 2022"
        },
        {
            "text": "Face recognition technology is a contemporary development that combines surveillance cameras with biometric face recognition capability. Although the technology is still in its infancy, there are already calls for wider deployment, especially in relation to identifying known serious offenders. Inevitably there have been disputes about the effectiveness of the technology, its social acceptability and implications for civil liberties. These discourses point to a need for a public debate on the future of the technology and this event is designed to give members of the public an opportunity to question experts and have their say."
        },
        {
            "text": "To get a better understanding of how facial recognition technology in policing and law enforcement is seen, my office in conjunction with Professor William Webster (Centre for Research into Information, Surveillance and Privacy) has organised an event for expert witnesses to provide evidence on whether there is a legitimate role for facial recognition in policing and law enforcement. Taking place before a live audience, attendees will be able to ask questions to test the strength of the different arguments being put forward."
        },
        {
            "text": "The event will be organised around a series of short expert statements, which will be debated with the audience and the other expert panellists. There will be lots of opportunities for audience participation, either through the Question and Answer session, social media, or the online polling that will take place during the event."
        },
        {
            "text": "Experts who will be participating in the event include:"
        },
        {
            "text": "- Silkie Carlo, Director, Big Brother Watch (BBW)"
        },
        {
            "text": "- Jeremy Vaughan, Chief Constable, South Wales Police"
        },
        {
            "text": "- Isabelle Moeller, Chief Executive, Biometrics Institute"
        },
        {
            "text": "- Roger Baldwin, Advisory Council Member, Biometrics Institute"
        },
        {
            "text": "- Gary Pugh, Forensic Science Regulator"
        },
        {
            "text": "- Anne Russell, Group Manager, Information Commissioners Office (ICO)"
        },
        {
            "text": "- Dr Joe Purshouse, Senior Lecturer, University of Sheffield"
        },
        {
            "text": "- Professor William Webster, Director of CRISP, University of Stirling"
        },
        {
            "text": "Doors open at 5pm, with refreshments available. Expert witness statements start at 6pm with the event finished by 9:15pm."
        },
        {
            "text": "Admission to the event is free. All audience members must register via Eventbrite to attend. Each audience member can reserve up to three tickets. Final joining details, including location, will be emailed to audience members a couple of days prior to the event."
        },
        {
            "text": "The event will be recorded and will be available online. Audience members will be asked to consent to this recording as part of the ticketing process."
        },
        {
            "text": "NEW Livestream option: Contact CRISP@stir.ac.uk if you would like to get access to the MSTeams livestream."
        }
    ]
}