{
    "url": "https://lifeathmrc.blog.gov.uk/2022/06/01/managing-together-part-3-discover-what-its-like-to-be-one-of-hmrcs-13000-managers/",
    "title": "Managing Together (part 3) – discover what it’s like to be one of HMRC’s 13,000+ managers",
    "authors": [
        "Kian Mokhtary"
    ],
    "categories": [
        "Diversity",
        "General",
        "Management"
    ],
    "pub_date": "2022-06-01T11:40:47+00:00",
    "content": [
        {
            "text": "Here we are on our 3rd blog of the 5-part series on core manager functions."
        },
        {
            "text": "This time Kian will explain how using ‘Support and Develop’ helps with the wellbeing and effective progression of a team."
        },
        {
            "heading": 2,
            "text": "Support and Develop "
        },
        {
            "heading": 2,
            "text": "Kian’s story"
        },
        {
            "text": "I left University with a degree in Environmental Management and subsequently have worked in numerous and diverse jobs, both in the public and private sectors. I began working at HMRC in June 2021 as a team leader for Customer Compliance within Debt Management. We deal with complex queries and debt matters brought through our private debt agency partners."
        },
        {
            "text": "I struggled at University until I was assessed for dyslexia, which was confirmed. Dyslexia affects working memory, so technology is a great tool for me. I have found that I can support and develop my team better as I understand my own strengths and can value the great team I have with all their unique skills and characters."
        },
        {
            "text": "A key challenge is completing the work on time to meet tight deadlines. As a team leader, I support and develop my team and ensure their welfare so they can meet these deadlines, while I balance the workload to make sure it is manageable. I keep in mind that a lot can be going on in a person's life other than their work, so I support them by getting to know them and their circumstances first. I know what they are capable of and by listening and trusting each of the team to do various pieces of work, I have been able to share opportunities out better. I develop my team by building on their strengths and re-thinking how we do things as a team, which has created a productive environment."
        },
        {
            "text": "Developing my own manager skills, such as Emotional Intelligence, has proved very beneficial to my own self-awareness. This has proved helpful when talking to individuals about their own development and supporting them to meet the tight deadlines. I have developed the team by being empathic, listening to their issues but not necessarily offering solutions, encouraging individuals to try to work problems through for themselves."
        },
        {
            "text": "I am proud to work for HMRC as the department has a strong commitment to making their workforce accepting of difference and neurodiversity and an understanding of the positive gains that can be achieved through having a neuro-diverse workforce. As a new manager, I know I have a long way to go and lots to learn but am looking forward to the challenges ahead and continuing to support and develop my team so watch this space!"
        },
        {
            "text": "If you haven’t already, catch up with our previous editions in the series; Kyle talks about how he owns and initiates change and Carol talks how she engages and leads."
        }
    ]
}