{
    "url": "https://marinedevelopments.blog.gov.uk/2022/06/01/meeting-with-users-of-studland-bay/",
    "title": "Meeting with users of Studland Bay",
    "authors": [
        "Eleanor Johnston, Marine Conservation Team"
    ],
    "categories": [
        "marine conservation"
    ],
    "pub_date": "2022-06-01T09:43:41+01:00",
    "content": [
        {
            "text": "Before Easter our Marine Conservation, South and Marine Planning teams met with recreational boat users in Studland Bay and held drop-in sessions and talks about the voluntary no anchor zone in the area."
        },
        {
            "text": "These talks were in aid of raising awareness of the measures in Studland Bay which came into effect in December 2021. The team were also keen to gain insight before the interim voluntary no anchor zone is replaced by Phase 2 - a larger area protecting the majority of the seagrass beds in the MCZ - from 1 June 2022."
        },
        {
            "text": "In the blog, Eleanor Johnston from the Marine Management Organisation’s (MMO) Marine Conservation Team answers the most occurring questions that came up during the events."
        },
        {
            "text": "Why Studland Bay?"
        },
        {
            "text": "MMO is responsible for assessing and managing impacts of marine non-licensable activities in the 157 marine protected areas (MPA) between 0 and 12 nautical miles (nm) from the coast in English waters. There is a huge variety of activities here, from jet-skiing, recreational anchoring to snorkelling. Where these activities are not compatible with the conservation objectives of an MPA, MMO is responsible for implementing management measures to protect the relevant habitats and species."
        },
        {
            "text": "Studland Bay has historically received a high level of stakeholder interest, owing to the popularity of the site amongst the boating community, and the sensitivity and importance of the habitats and species present there. Studland Bay was designated as a Marine Conservation Zone by the Secretary of State for Environment, Food and Rural Affairs in May 2019 in recognition of the importance of the species and habitats present to the marine protected area network. Due to the risks from recreational activities to the designated features of the MCZ, including seagrass beds and long-snouted seahorses (also known as spiny seahorses) MMO assessed for the need for management in 2020."
        },
        {
            "text": "Timing of Phase 2"
        },
        {
            "text": "Some stakeholders for Studland Bay have requested that we delay the extended voluntary no anchor zone. We have listened carefully to these requests and the reasons given, for example the lack of moorings to provide an alternative to anchoring within the voluntary no anchor zone. After careful consideration of a range of options, we have decided to proceed with the introduction of Phase 2 of the voluntary no anchor zone."
        },
        {
            "text": "While we understand the desire for boaters to continue anchoring over the seagrass beds until additional moorings are available, this would not allow us to meet our legal duties to ensure the seagrass beds are protected from damage. While we recognise how much visiting Studland Bay means to many boaters, and the disruption that the no anchor zone may cause, it is also really important that we stop the damage to the seagrass beds from anchoring. We hope that people will continue to enjoy Studland Bay and will adhere to the voluntary no anchor zone when doing so. People will still be able to sail over the seagrass beds, and to anchor in other parts of the Bay."
        },
        {
            "text": "Have recreational boaters been listened to?"
        },
        {
            "text": "Engaging with, and listening to, a wider range of stakeholder views is central to MMO’s management of activities in Studland Bay. We have been engaging with stakeholders since October 2020 and have been using feedback to develop and refine our management approach."
        },
        {
            "text": "We held a call for evidence and formal engagement period in 2020 and 2021 to gather feedback and identify the most appropriate management approach. We have since held further engagement events (April 2022) in the area including pop-up stands and meetings."
        },
        {
            "text": "As a direct result of stakeholder feedback, the no anchor zone has been introduced as a voluntary measure, rather than a statutory measure such as an MMO byelaw. We also introduced this in a phased approach, rather than all at once, in order to allow to give time for boaters to understand and adapt to the no anchor zone."
        },
        {
            "text": "We understand that some boaters may feel frustrated that we are introducing the larger voluntary no anchor zone, despite the requests to delay Phase 2. We have listened, and carefully considered these requests. Despite this, for the reasons outlined above, we have decided to continue with Phase 2 of the voluntary no anchor zone. . We are always keen to hear from stakeholders and understand their views, so if you want to ensure your voice is heard, please get in touch via email:  info@marinemanagement.org.uk or by telephone: 0300 123 1032."
        },
        {
            "text": "What’s the evidence around impacts of anchoring? "
        },
        {
            "text": "Seagrass beds are some of our most important coastal habitats. They provide an important habitat for many species, for example seahorses and cuttlefish. In particular, they act as a nursery for many commercially important fish and shellfish species. They are one of the most effective habitats at capturing and storing carbon dioxide, helping in our fight against climate change."
        },
        {
            "text": "Seagrass beds were once much more widespread around the UK, however an outbreak of a wasting disease in the 1930s caused the loss of almost all of our seagrass beds."
        },
        {
            "text": "The good news is that seagrass beds in Studland Bay, and around our coasts more generally, have generally been expanding since that point. Despite this, there are a range of threats to seagrass beds. This includes physical impacts from human activities, including certain types of fishing, and anchoring."
        },
        {
            "text": "Even in an expanding seagrass bed, physical impacts such as uprooting and breaking up of seagrass rhizomes, reduce the ability of seagrass to support a healthy ecosystem, and can even create barren patches."
        },
        {
            "text": "There have been some claims that anchoring can benefit seagrass by, for example, creating loose clumps of seagrass which can then establish new areas of seagrass. Unfortunately, there is no evidence for this. In fact, there is a large and increasing body of evidence which consistently shows that anchoring is harmful to the health of seagrass beds. A summary of this evidence is available in the MMO Studland Bay MCZ Habitat Protection Strategy."
        },
        {
            "text": "We need marker buoys and moorings now!"
        },
        {
            "text": "We understand that there may be frustrations regarding marker buoys and the limited number of moorings within the voluntary no anchor zone. We recognise that marker buoys and additional moorings would make it easier for boaters to adhere to the voluntary no anchor zone and are currently looking into what we can do on both of these points."
        },
        {
            "text": "As a user of the bay, I feel that more communication is need."
        },
        {
            "text": "Since phase 1 of the voluntary no anchor zone was launched in December 2021, we have been sharing information online regularly through GOV.UK and social media."
        },
        {
            "text": "As part of our efforts, we have also undertaken site visits, held drop-in sessions, held local meetings, and distributed physical resources such as leaflets and posters."
        },
        {
            "text": "We understand the importance of engaging both locally and nationally to ensure coverage for all those who use Studland Bay. This will help users of the bay understand the voluntary measures."
        },
        {
            "text": "We are currently in the process of looking at how we raise further awareness such as signage, electronic charts, and almanacs."
        },
        {
            "text": "I want to install a mooring; do I need a marine licence? "
        },
        {
            "text": "Yes, to install a mooring, you will need a marine licence. Applications for the installation, maintenance, and removal a mooring must be made to MMO for approval."
        },
        {
            "text": "An applicant wishing to apply for a marine licence must register on the MMO's online system and set up an account which can be used to submit a marine licence application."
        },
        {
            "text": "It is MMO's goal to decide on most applications within 13 weeks after the application has been validated. Every application is unique, and some applications may take longer while others will take less time. You will be notified by MMO if additional information is required to support your application."
        },
        {
            "text": "MMO understands that advanced mooring systems are an important alternative to anchoring, in order to support sustainable use of the area and effectiveness of the voluntary no anchor zone. MMO is supporting the work of Studland Bay Marine Partnership who are working on an eco-mooring project and we encourage interested applicants for moorings to engage with this project."
        },
        {
            "text": "Where can I find more information about the voluntary no anchor zone?"
        },
        {
            "text": "We have a dedicated webpage for Studland Bay where you can find a digital leaflet and the MMO Studland Bay MCZ Habitat Protection Strategy. These include information on where the voluntary no anchor zone applies."
        },
        {
            "text": "On 1 and 3 June, our local MMO Poole team will be carrying out on water engagement in Studland Bay to raise awareness of the voluntary no anchor zone, listen to stakeholders, and provide information about the Phase 2 extension of the zone. Please let them know if you have any questions or need further information."
        }
    ]
}