{
    "url": "https://rtau.blog.gov.uk/2022/06/01/piloting-the-national-algorithmic-transparency-standard/",
    "title": "Piloting the UK algorithmic transparency standard",
    "authors": [
        "Amy Dickens",
        "Elena Hess-Rheingans, Central Digital and Data Office"
    ],
    "categories": [
        "Algorithms",
        "Transparency",
        "Trustworthy innovation"
    ],
    "pub_date": "2022-06-01T07:11:41+01:00",
    "content": [
        {
            "text": "Today, the Central Digital and Data Office (CDDO)  and Centre for Data Ethics and Innovation (CDEI) have published the first reports from our transparency standard pilots. The public sector algorithmic transparency standard is one of the world’s first initiatives of its kind. It provides a framework for public sector organisations to share information on their use of algorithmic tools with the general public and other interested stakeholders. "
        },
        {
            "heading": 2,
            "text": "Developing and piloting the algorithmic transparency standard"
        },
        {
            "text": "The standard was developed in response to commitments the government made to algorithmic transparency in the National Data Strategy and National AI Strategy, as well as calls from civil society organisations for greater transparency around the use of algorithmic tools in the public sector. We published the first version of the standard in November 2021. For more information on how and why we developed the standard, see our previous blog."
        },
        {
            "text": "Since January this year, we have been piloting the standard with teams across the public sector. The piloting process involves:"
        },
        {
            "text": "The pilot reports we have published today are:  "
        },
        {
            "text": "Alongside the pilots, we have gathered feedback on the standard through further discussion with officials from government departments and public bodies, and an open call for feedback from members of the public. We also held two roundtable discussions with suppliers of algorithmic solutions to incorporate the perspectives of third party suppliers on the standard. The roundtables were facilitated by techUK and the Crown Commercial Service respectively and were attended by nearly 100 representatives from the private sector."
        },
        {
            "text": "We are currently collating and evaluating all the feedback we have received. "
        },
        {
            "heading": 2,
            "text": "Preliminary findings from the pilots"
        },
        {
            "text": "Preliminary findings from the pilots suggest participating teams are generally supportive of algorithmic transparency and its potential benefits but also mindful of its risks and challenges. "
        },
        {
            "text": "Some key themes have emerged through the pilots and we will incorporate this feedback in an updated version of the standard. Teams told us that:"
        },
        {
            "heading": 2,
            "text": "Next steps"
        },
        {
            "text": "We are completing the pilot evaluation in order to update the standard and develop the accompanying guidance, which we will publish later this year. Alongside this, we will publish a blog providing more detail on the findings from the evaluation and how these have been incorporated into the revised standard, and we will keep releasing further pilot reports in the coming months.  "
        },
        {
            "text": "We are also exploring avenues to promote uptake of the standard across government and the public sector more widely. This includes seeking the Data Standards Authority's endorsement of the standard as an official cross-government standard. "
        }
    ]
}