{
    "url": "https://history.blog.gov.uk/2022/06/01/the-queen-and-her-prime-ministers/",
    "title": "The Queen and her Prime Ministers",
    "authors": [
        "Dr Michelle Clement"
    ],
    "categories": [
        "No 10 guest historian series",
        "Past prime ministers",
        "The Monarchy"
    ],
    "pub_date": "2022-06-01T11:45:06+01:00",
    "content": [
        {
            "text": "By Dr Michelle Clement, Researcher in Residence at No.10 Downing Street"
        },
        {
            "text": "Her Majesty Queen Elizabeth II, the longest-reigning monarch in British history, celebrates her Platinum Jubilee this week. Festivities will be held across the country to mark the Queen’s incredible 70 years on the throne. During the last seven decades, fourteen individuals from Winston Churchill to current Prime Minister Boris Johnson have 'kissed hands' with the Queen and thus become prime minister."
        },
        {
            "text": "The relationship between the Queen and her prime ministers is underpinned by a quietly pivotal meeting, known as the audience, whereby the head of state and her prime minister meet each week for a private conversation to discuss the affairs of state."
        },
        {
            "text": "Successive prime ministers have remarked on how much they valued this convention. Harold Macmillan noted in his diary that at his first audience, he had warned the Queen \"half in joke, half in earnest, that I could not answer for the new government lasting more than 6 weeks. She smilingly reminded me of this at an audience 6 years later\"’[1] Macmillan found that \"the Queen was a great support, because she is the one person you can talk to.\"[2] Similarly Edward Heath found his weekly audience with the Queen to be an occasion that he \"looked forward to … It was always a relief to be able to discuss everything with someone, knowing full well that there was not the slightest danger of any information leaking. I could confide in Her Majesty absolutely.\"[3]"
        },
        {
            "text": "Let us look back at highlights of the Queen’s visits to No.10 Downing Street, some of which marked earlier Jubilee celebrations."
        },
        {
            "text": "Some 67 years ago in April 1955, the Queen was invited to dine in No.10’s State Dining Room with outgoing Prime Minister Winston Churchill. On that watershed evening, the day before he resigned, the great wartime leader toasted Her Majesty and recalled that he had relished drinking to the same toast as a cavalry subaltern \"in the reign of Your Majesty’s great-great-grandmother\", Queen Victoria.[4] Churchill’s Private Secretary, John Colville recalled the dinner of fifty or so Cabinet ministers, grandees and officials: \"It was a splendid occasion. … Lady Churchill took special pains about the food and 10 Downing Street can seldom if ever have looked so gay or its floorboards have groaned under such a weight of jewels and decorations.\"[5]"
        },
        {
            "text": "Harold Wilson became the Queen’s first Labour Prime Minister in 1964. Though they came from differing social backgrounds a warm relationship developed. Wilson said, \"I have great respect for tradition. … I like the real ceremonies of the Monarchy.\"[6] He would often remark that a prime minister had to do their homework ahead of an audience with the Queen, or she was likely to catch them out.[7] Wilson and the Queen got on very well, their audiences became lengthier with one reportedly lasting 2 hours.[8] In the mid-1970s Wilson returned as Prime Minister for 2 years. Upon tendering his resignation in 1976, he chose to invite Her Majesty to No.10 for a farewell dinner. This took place 21 years on from the Queen’s last visit to No.10, when Churchill had marked his own departure with a royal banquet."
        },
        {
            "text": "As Prime Minister in the early 1970s, Edward Heath convened a dazzling musical gathering to celebrate composer William Walton’s 70th birthday. Heath invited the Queen and the Queen Mother along with a selection of some of the greatest musicians at the time including Sir Arthur Bliss, Master of the Queen’s Music and actor, Laurence Olivier.[9] After dinner the guests moved to the Pillared Room in No.10, where they were treated to a performance of Schubert’s B Flat Trio by Leader of the London Symphony Orchestra, John Georgiadis, Douglas Cummings, its first cello and acclaimed pianist, John Lill.[10]"
        },
        {
            "text": "On the advent of the Queen’s Silver Jubilee in 1977, then Prime Minister James Callaghan reflected:"
        },
        {
            "text": "Then Leader of the Opposition, Margaret Thatcher, also thanked the Queen and quoting John Colville, said: \"In an age of melting convictions and questionable needs the Queen's unassuming virtues and faultless example have stood out like a rock in a sea of troubles.\"[12]"
        },
        {
            "text": "James Callaghan’s Cabinet marked the Queen’s Silver Jubilee by presenting her with a silver coffee pot. On giving this gift to Her Majesty at Buckingham Palace, the Queen said to Callaghan: \"Oh! I’m so glad you haven’t repeated (former Prime Minister) Mr Disraeli’s gift to Queen Victoria. He gave her a painting of himself. \"[13]"
        },
        {
            "text": "Callaghan recalled a range of events during the summer of the Queen’s Silver Jubilee from conferences with the Heads of Government of the Commonwealth, of NATO powers and a Downing Street Summit with G7 members. He reflected: \"The Queen, in addition to her other heavy duties … also agreed to entertain those attending this rapid succession of meetings. … She seemed to thrive on the constant procession of visitors and never once did I see her less than sparkling and vivacious at her many public engagements.\"[14]"
        },
        {
            "text": "Though there was no Jubilee to celebrate during Margaret Thatcher’s eleven-year premiership, 1985 marked the 250th anniversary of Robert Walpole’s occupancy of No.10. Walpole is regarded as the first British Prime Minister.[15] Thatcher took great delight in being able to mark the occasion with a grand dinner in the State Dining Room, to which the Queen and the Duke of Edinburgh were invited as well as former prime ministers Harold Macmillan, Alec Douglas-Home, Harold Wilson, Edward Heath and James Callaghan. Her Majesty gave a speech in which she remarked that by that point in her father King George VI’s tenure, he had visited No.10 more frequently. In jest she said, \"I was beginning to wonder what I’d done wrong!\"[16]"
        },
        {
            "text": "The Queen’s Golden Jubilee came in 2002, then Prime Minister Tony Blair welcomed Her Majesty to Downing Street where a dinner was hosted in her honour. Blair was born in the same year as the Queen’s coronation, and as Her Majesty remarked in their first audience: \"You are my tenth prime minister. The first was Winston. That was before you were born.\"[17] The Golden Jubilee dinner at Downing Street was attended by former prime ministers Edward Heath, James Callaghan, Margaret Thatcher and John Major. It was an enjoyable occasion for all. The Queen noted, \"Isn’t it wonderful not to have to be introduced to anyone?\"[18] Her Majesty received a silver gilt plate from her Cabinet ministers, which was engraved with their signatures.[19]"
        },
        {
            "text": "To mark her Diamond Jubilee in 2012 the Queen attended a Cabinet meeting in No.10 Downing Street. This was the first time she had done so during her reign, though Her Majesty receives a copy of the confidential Cabinet minutes each week. She sat in the Prime Minister’s chair, the only seat with arms. The Cabinet presented Her Majesty with 60 placemats in honour of her 6 decades on the throne, and a section of British Antarctic Territory was named Queen Elizabeth Land."
        },
        {
            "text": "As these selected highlights illustrate Her Majesty’s reign has provided a beacon of continuity over an extraordinary breadth of change. Though the Queen’s visits to No.10 Downing Street have been somewhat infrequent, the discreet advice which she has offered to 14 prime ministers throughout the last 70 years, based on her unrivalled institutional memory, has been invaluable, and far more regular. In Her Majesty’s own words:"
        },
        {
            "text": "Dr Michelle Clement is Lecturer and researcher on government reform and delivery at The Strand Group, King’s College London and Researcher in Residence at No.10 Downing Street. Twitter: @MLClem"
        },
        {
            "text": " "
        },
        {
            "text": "[1] A Horne, 'Macmillan 1957-1986: volume 2 of the official biography' (London: Macmillan, 1989), page 4"
        },
        {
            "text": "[2] Horne (1989), page 168"
        },
        {
            "text": "[3] E Heath, 'The course of my life: my autobiography' (London: Hodder & Stoughton, 1998), page 317"
        },
        {
            "text": "[4] RJ Minney, 'No.10 Downing Street, a house in history' (London: Cassell, 1963), page 421"
        },
        {
            "text": "[5] A Seldon, '10 Downing Street: the illustrated history' (London: HarperCollinsIllustrated, 1999), page 145"
        },
        {
            "text": "[6] B Pimlott, 'The Queen: Elizabeth II and the monarchy' (London: HarperPress, 2012), page 397"
        },
        {
            "text": "[7] B Pimlott, 'The Queen: Elizabeth II and the monarchy' (London: HarperPress, 2012), page 397"
        },
        {
            "text": "[8] B Pimlott, 'Harold Wilson' (London: William Collins, 2016), page 7"
        },
        {
            "text": "[9] Seldon (1999), page 194"
        },
        {
            "text": "[10] Seldon (1999), page 195"
        },
        {
            "text": "[11]  Address to Her Majesty (Silver Jubilee), 3 May 1977"
        },
        {
            "text": "[12] Address to Her Majesty (Silver Jubilee), 3 May 1977, quoting John Colville, 'The New Elizabethans' (London: Collins, 1977), page 10"
        },
        {
            "text": "[13] J Callaghan, 'Time and chance' (London: Collins, 1987), page 462"
        },
        {
            "text": "[14] Callaghan (1987), page 481"
        },
        {
            "text": "[15] J Brown, No.10: 'The geography of power at Downing Street' (London: Haus Publishing, 2019), page 93"
        },
        {
            "text": "[16] Seldon (1999), page 90-91"
        },
        {
            "text": "[17] T Blair, 'A journey' (London: Hutchinson, 2010), page 14"
        },
        {
            "text": "[18] A Campbell, 'The Alastair Campbell diaries volume 4, the burden of power: countdown to Iraq' (London: Arrow, 2013), page 219"
        },
        {
            "text": "[19] V Low and M Savage, 'Queen to attend Cabinet to mark Jubilee', The Times, 18 December 2012"
        },
        {
            "text": "[20] P Hennessy, 'The hidden wiring: unearthing the British constitution' (London: Victor Gollancz, 1995), page 69"
        },
        {
            "text": " "
        }
    ]
}