{
    "url": "https://disabilityunit.blog.gov.uk/2022/06/01/the-currency-of-memory-how-the-royal-mint-is-marking-the-queens-platinum-jubilee/",
    "title": "The currency of memory: how the Royal Mint and Royal Collection Trust are marking the Queen’s Platinum Jubilee",
    "authors": [
        "Disability Unit"
    ],
    "categories": [
        "Event"
    ],
    "pub_date": "2022-06-01T17:38:19+01:00",
    "content": [
        {
            "text": "In the lead up to Her Majesty The Queen’s Platinum Jubilee across the country projects  are underway to ensure everyone can celebrate The Queen’s 70-year reign. More than 70,000 ‘Big Lunches’ are planned across the country, activities for children have been released including “Colour a Corgi” and big screens will be set up outdoors in London, Edinburgh and Cardiff so thousands of people can come together."
        },
        {
            "text": "We look at two projects using 70 years of royal history to stimulate discussion, engagement and enjoyment for disabled and older people leading up to the Jubilee."
        },
        {
            "text": "Free virtual tours of Windsor Castle for care homes"
        },
        {
            "text": "The Royal Collection Trust has been running a programme of free virtual tours for residents from care homes in Berkshire and Surrey to the royal palaces, including Windsor Castle, Buckingham Palace, and the Royal Collection."
        },
        {
            "text": "Organised by the Royal Collection Trust after a difficult year for residents, the sessions were introduced to provide residents an opportunity to engage with art from home. "
        },
        {
            "text": "The sessions are interactive, with a mix of images, music and video designed to stimulate memories and stories from residents on their interaction with The Queen and the royal palaces over the decades. "
        },
        {
            "text": "The care homes had made the sessions a ‘real celebration’ by providing tea, cake, scones, and decorations for their residents. They said that participants have continued to talk about the sessions and their memories afterwards with other residents in communal areas and at mealtimes."
        },
        {
            "text": "Margaret and Marie, at Mountbatten Grange Care Home in Windsor, said: "
        },
        {
            "text": "Amy Stocker, Access Manager at the Royal Collection Trust, said that the virtual sessions had been ‘entertaining’ for both residents and staff running the sessions."
        },
        {
            "text": "Revisiting decimalisation with the Royal Mint "
        },
        {
            "text": "For the Queen’s Platinum Jubilee, the Royal Mint Museum have been hosting a national programme of activities to commemorate the Queen’s long reign, celebrating the achievements of the nation, exploring the Royal Mint’s role in past Jubilees, and bringing together people up and down the country to celebrate this momentous occasion. "
        },
        {
            "text": " "
        },
        {
            "text": "Many of us have only ever known Her Majesty the Queen as monarch throughout our lifetimes, but those who witnessed the beginning of Her reign in 1952 can attest to the memorable nature of the milestone. This generation, for whom the Queen’s presence has been an enduring comfort, celebrated with her the Silver, Golden, and Diamond Jubilees and have a wealth of treasured memories from each of them. Handling and discussing the objects associated with these events can be a positive and nostalgic experience."
        },
        {
            "text": "A lot has changed since the young Princess Elizabeth became Queen in 1952 from the first broadcast of commercial television in 1955, England winning the world cup in 1966 to the Channel Tunnel was opened to passengers in 1995. Notably, in February 1971 Britain adopted a decimal currency. This was a momentous event for the whole country, with every man, woman and child having to change the way they used money. Handling and chatting about pre-decimal coins can stimulate happy memories for those who lived through the changeover, and it was from this idea that the Royal Mint Museum developed reminiscence sessions."
        },
        {
            "text": "The reminiscence session takes the form of a ‘Museum in a Box’, which contains replicas and original objects from the time for people to handle. This collection is focused on Her Majesty The Queen's Platinum Jubilee and her previous Jubilee celebrations, including pre-decimal coins, commemorative items, images and newspaper clippings which explore a separate event or memory. The box is fitted with a sensor and speaker and each object is fitted with a special micro-chip which, when placed on the box, play audio clip specific to that object to explain it and tell a story. This can be a fun and stimulating activity, giving people who lived through the changeover an opportunity to talk about their memories throughout their lives."
        },
        {
            "text": "As of 2022, these reminiscence sessions have reached over 580 care homes around the United Kingdom. The boxes are being loaned across the UK and are provided free of charge, along with the materials and support needed to run a session. "
        },
        {
            "text": "For more information about the Royal Collection Trust, accessible facilities available at the royal palaces and their inclusion programme please visit: https://www.rct.uk/"
        },
        {
            "text": "If you would like more information about the Royal Mint ‘Museum in a Box’, please email borrowabox@royalmintmuseum.org.uk"
        }
    ]
}