{
    "url": "https://cspl.blog.gov.uk/2022/06/01/the-government-should-go-beyond-a-low-level-of-ambition-on-the-ministerial-code/",
    "title": "The government should go beyond a \"low level of ambition\" on the Ministerial Code",
    "authors": [
        "Lord Jonathan Evans"
    ],
    "categories": [
        "Ministerial Code",
        "Standards Matter 2"
    ],
    "pub_date": "2022-06-01T16:15:08+01:00",
    "content": [
        {
            "text": "Lord Nolan's 1995 report - the first of this Committee - defined a three-part structure for upholding ethical standards in public life in the UK. First, rules on ethics should be clearly defined in codes of conduct. Second, those codes should be regulated through a process of independent scrutiny. Third, those rules - and the values they reflect, the Seven Principles of Public Life - should be promoted through regular training and education."
        },
        {
            "text": "Reforms to the Ministerial Code over the past 25 years sought to apply this structure to the unique circumstances of ministerial office. In 2006 - following a CSPL recommendation - an Independent Adviser on Ministers' Interests was appointed to provide a degree of independent scrutiny to the regulation of the Code."
        },
        {
            "text": "Following the recent publication of the government policy statement on the Ministerial Code, and the publication yesterday of the Independent Adviser's annual report, it is clear that recent reforms to the Code and the role of the Adviser do not go far enough, nor do they implement the package of measures the Committee called for."
        },
        {
            "text": "The role of the Independent Adviser on Ministers' Interests - the person tasked with helping the Prime Minister enforce the Ministerial Code - has never quite lived up to its name. Unlike the Commissioners for Standards in the House of Commons and the House of Lords, the Adviser has never been able to independently initiate their own investigations into alleged ministerial misconduct, instead only being able to do so when instructed by the Prime Minister. Nor does the Adviser have the final say on whether the Ministerial Code has been breached, instead only advising if they think a breach has occurred, with the definitive finding being left to the PM."
        },
        {
            "text": "This limited independence was linked to the all-or-nothing approach taken to sanctions for breaches of the Code. As the expectation persisted that any breach of the Code should lead to a minister's resignation, past calls for greater independence for the Adviser fell on deaf ears. In political terms, it is understandable for Prime Ministers to want to retain control of powers of investigation when the conclusion of an investigation could force a ministerial resignation. In constitutional terms, administrations past and present argued that greater independence for the adviser would effectively override the Prime Minister's prerogative powers to organise the composition of the government as they see fit."
        },
        {
            "text": "The Committee made a series of recommendations in our recent report, Upholding Standards in Public Life, which sought to address this. First, we recommended that breaches of the Code be subject to an explicit range of sanctions, and that any decision on sanctions be solely in the hands of the Prime Minister. This was inextricably linked to our other recommendations - that the Adviser should be given the full, independent authority to initiate investigations and determine breaches of the Code. We made clear that our proposed reforms on sanctions \"ensures that there is no constitutional impropriety\" in greater independence for the Adviser."
        },
        {
            "text": "Graduated sanctions and greater independence for the Adviser were therefore part of a mutually dependent package of reforms, designed to be taken together. Our proposals both protected the right of the Prime Minister to hire and fire ministers as they see fit, and introduced greater independence in the regulation of ministerial conduct. It is therefore highly unsatisfactory that the government has only accepted the former and not the latter."
        },
        {
            "text": "The new Code now makes explicit what those graduated sanctions may be - either a public apology, a fine of a minister's salary, or a request for a minister's resignation. The Code continues to specify that ministers who knowingly mislead Parliament will be expected to resign."
        },
        {
            "text": "But the new process for initiating investigations does not create the degree of independence we called for. Whereas previously the Adviser could only conduct an investigation into an alleged breach of the Code at the Prime Minister's request, the Adviser can now initiate their own investigations \"having consulted the Prime Minister and obtained his consent\".  So no longer a direct commission by the Prime Minister, but still dependent on the Prime Minister's permission.  This is a step forward, it is an improvement in process, but it does not fundamentally change the powers of the Independent Adviser."
        },
        {
            "text": "I agree with Lord Geidt that this represents a \"low level of ambition\". The new arrangements fail to address the risk of what Lord Geidt describes as a \"circular process\": an Adviser who believes their advice will be rejected will simply not put forward advice at all, with the precedent already established that this will lead to the Adviser's resignation."
        },
        {
            "text": "Lord Geidt, whose integrity cannot be doubted, has said that he believes these new arrangements represent a \"workable scheme\", given the \"very high standard\" required for a proposed investigation to be rejected and the assumption that the reasons for a rejection would be published. Yet it remains the case that a clearer separation of powers would better protect the constitutional rights of the Prime Minister, the integrity of the Adviser, and the independent regulation of the Ministerial Code. The Independent Adviser should be able to independently initiate investigations and determine breaches - a power entirely separate from the Prime Minister's right to author the Code and decide on what the consequences of any breach should be."
        },
        {
            "text": "The Committee also recommended improving the independence of the appointments process for the Adviser, as well as establishing the Adviser's role in primary legislation - recommendations the government appears to have rejected."
        },
        {
            "text": "As I wrote to the Minister of State in the Cabinet Office, Lord True, earlier this week, a system where the Independent Adviser still requires the Prime Minister's permission to launch an investigation will not restore public trust in ethical standards at the heart of government. Instead, suspicion about the way in which the Ministerial Code is administered will linger.  Without meaningful reform, questions about the remit of the Adviser and the regulation of the Code will persist."
        }
    ]
}