{
    "url": "https://space.blog.gov.uk/2022/06/01/the-night-sky-in-june-2/",
    "title": "The night sky in June",
    "authors": [
        "Derek Smale"
    ],
    "categories": [
        "Astronomy",
        "Stargazing"
    ],
    "pub_date": "2022-06-01T17:03:34+01:00",
    "content": [
        {
            "text": "The summer solstice falls on 21 June, marking the point on our orbit around the sun where the tilt of our planet leans the northern hemisphere towards the sun. While it brings the shortest night of the year with the sun being below the horizon for less than eight hours, there are plenty of reasons to stay up for a night of stargazing!"
        },
        {
            "heading": 2,
            "text": "Alignment of the planets"
        },
        {
            "text": "As sunrise approaches in the mornings throughout June, the planets of our solar system provide a rare and beautiful sight.  The brighter planets Mercury, Venus, Mars, Jupiter and Saturn appear to line up in our skies in order of their distance from the sun.  The best views will fall towards the middle and end of the month, when Mercury is easier to spot, rising a little earlier and appearing further away from the glow of the imminent sunrise."
        },
        {
            "text": "Saturn rises first, at around 1.30am, followed by the unmistakably bright light of Jupiter and the smaller, reddish light of Mars about an hour later.  Brightest planet Venus rises at around 3.30am, with Mercury completing the line up at around 4am."
        },
        {
            "text": "Those with binoculars or a telescope can also hunt out distant planets Uranus (a faint pale green light close to Venus), and blue-hued Neptune (to the right of Jupiter)."
        },
        {
            "heading": 2,
            "text": "The Moon"
        },
        {
            "text": "Much closer to earth, the moon will appear to sail through this planetary alignment in the second half of the month, providing a helpful pointer if you’re not sure where to look.  When it passes Saturn on the 18th and 19th it’ll be around 75% illuminated.  It will sweep under Jupiter on the 22nd, less than half illuminated, and past Mars on the 23rd.  By the time passes very close to Venus on 26th and Mercury on the morning of the 27th, just 5% of the moon’s surface will be illuminated."
        },
        {
            "text": "The full moon this month will be a ‘supermoon’ – appearing slightly larger than usual in our skies as the full moon coincides with the moon being slightly closer to earth in its orbit around our planet.  Look south on 14 June where the moon will sit between the constellations of Scorpius and Ophiuchus."
        },
        {
            "heading": 2,
            "text": "The Milky Way"
        },
        {
            "text": "When we look south into our night skies during the summer months, we’re actually looking in towards the centre of our galaxy, the densely star-packed core of the Milky Way.  Try to get as far away from sources of bright light as you can, such as streetlights, cars, buildings etc and look south.  From truly dark-sky sites, the view is unforgettable!"
        },
        {
            "heading": 2,
            "text": "Noctilucent clouds"
        },
        {
            "text": "The summer months also provide an opportunity to see the rare and beautiful blue glow of noctilucent or “night-shining” clouds.  These clouds consist of tiny ice crystals high in our atmosphere (around 80 km or 50 miles) being under-lit by the Sun as it sits just below the horizon throughout the summer nights."
        },
        {
            "text": "The ice crystals are believed to be at a temperature of around -130 degrees centigrade, are only visible at certain latitudes (50 – 70 degrees from the equator) and only appear in the northern hemisphere between May and August each year."
        },
        {
            "text": "For the best chance to see them, look north (towards the lightest patch of the night sky), particularly an hour or two after sunset and before sunrise.  Aside from their distinctive glow, which can be pale or electric blue depending on the density of the ice crystals, you’ll recognise this phenomenon as the ‘clouds’ do not obscure the light of the stars behind them."
        },
        {
            "heading": 2,
            "text": "Space exploration"
        },
        {
            "text": "NASA’s Curiosity Rover, that landed on Mars in 2012, has discovered and photographed a small coral-shaped rock, about the size of a coin, believed to be caused by the crystallisation of minerals from a time when liquid water existed on the Martian surface."
        },
        {
            "text": "Meanwhile NASA’s Perseverance Rover, that on the red planet’s Jezero Crater in February last year has captured a solar eclipse caused by Phobos, one of Mars’ two small moons.  You can see the remarkable footage here."
        },
        {
            "text": " "
        },
        {
            "text": "Join us next month for more about the stars and constellations you can see in our summer nights skies!"
        }
    ]
}