{
    "url": "https://environmentagency.blog.gov.uk/2021/09/03/a-day-in-the-life-of-a-medway-lock-keeper/",
    "title": "A day in the life of a Medway Lock Keeper",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Our staff"
    ],
    "pub_date": "2021-09-03T12:50:50+00:00",
    "content": [
        {
            "text": "Terry is a lock keeper for the Environment Agency along the River Medway in Kent. The Environment Agency is the Navigation Authority for 19 miles of inland navigation between Allington Lock and Tonbridge. We have asked him some questions about life as a lock keeper based at Allington Lock."
        },
        {
            "text": "Why did you become a lock keeper?"
        },
        {
            "text": "After joining the navigation team as an officer 20 years ago, I fancied a change. I didn’t want to move onwards or upwards and I liked the idea of working on one site permanently so I applied for the lock keeper job. It’s a really nice job and I get on very well with the other lock keeper, Steve. I like being outdoors as I am a practical, outdoors person, so I thought this job would be a good fit. I do my fair share of paperwork, looking at boat registrations, for example."
        },
        {
            "text": "What do you do on a day-to-day basis? What is your average day? "
        },
        {
            "text": "Our day starts at seven in the morning. Firstly, we check all the sites, then we start our list of jobs. These can vary day-to-day from routine maintenance around the site, such as mowing, to assisting customers with opening and closing of the lock and answering public queries. We try to keep a tidy and attractive site at all times."
        },
        {
            "text": "We have a high tide twice a day, and the lock operates two hours either side of the tide during the day. We have to keep an eye out for boats which may want to come through the lock at any time. I mentioned that I also complete paperwork - this includes checking and selling boat registrations, which all boats must have. Steve and I are usually the first port of call for a lot of people as one of us is on site 24/7. We work in a shift pattern for two days on and two days off, and during those days we do not leave Allington. Even when we may be called out to a boat rescue someone will need to stay on site at all times, whether it’s myself or another member of the team, because someone needs to be there to manage the locks."
        },
        {
            "text": "During the summer months we are very busy as Allington is a public site with the pub and cafe attracting a lot of customers and we usually get a lot of questions from the public. We also have a slipway which can be very busy with paddle boarders, canoeists and boaters, especially with the influx since lockdown lifted. The site has permanent moorings and a campsite and we have to be available if anyone has any questions. We’ve recently been undergoing capital works to the lock, and we’ve had lots of contractors on site and queries from the public about the works."
        },
        {
            "text": "In the winter we are a different sort of busy. We have strong stream events when river levels are high, in which we have to look after the lock gates and change the settings to make sure we keep the water moving."
        },
        {
            "text": "Our phone line is on 24/7, and sometimes during busy periods we can receive up to 40 calls a day. The queries range from general ones regarding the lock and questions from river users, to queries from concerned boaters during a strong stream event in the winter. We offer advice and explain what is going on, and we will try to assist as much as we can over the phone."
        },
        {
            "text": "What is the best part of your job?"
        },
        {
            "text": "The best part of my job is being on site, speaking with customers and keeping everyone happy. I like to be busy, so it is nice that I can sort of be my own boss a lot of the time. During lockdown we have been able to build a nice community with the general public and the people who are permanently moored at the lock. We try to help out where we can. Having the added bonus of the coffee shop means the area is busy with people creating a really nice atmosphere. We are also finding that there has been an increase of visitors to the river since lockdown restrictions lifted, as it’s a real boost for their mental health and wellbeing."
        },
        {
            "text": "What is the most frustrating part of your job?"
        },
        {
            "text": "Not always being able to deal with things on the spot. People who are slightly worse for wear, on or around the water, mean that our time may be diverted to ensuring their safety. Also, not being able to accommodate differing recreational activities on site at the same time and therefore having to move people on."
        },
        {
            "text": "During Lockdown, have you noticed an increase in anti-social behaviour/littering?"
        },
        {
            "text": "Generally speaking – yes. There has been an increase in anti-social behaviour along the river, but due to Allington Lock being manned all the time we are able to move people on in most instances. At some of our popular sites, such as Teston and East Farleigh, the litter and anti-social behaviour has been very hard to manage. With people not having places to go when restrictions were in place, the river has been a popular destination to head for and we’ve had thousands of visitors over the past 18 months."
        },
        {
            "text": "What is the weirdest thing you have seen in or on the river?"
        },
        {
            "text": "Boats hitting booms during flooding."
        },
        {
            "text": "Follow the Environment Agency on Twitter, and be a #WaterWarrior and dispose of your rubbish. If the bin is full, look for another or better still, take rubbish home to throw away or recycle."
        }
    ]
}