{
    "url": "https://valuationoffice.blog.gov.uk/2021/09/03/how-we-value-hydrogen-plants/",
    "title": "How We Value: Hydrogen Plants",
    "authors": [
        "matthewmountfordbrock"
    ],
    "categories": [
        "How We Value"
    ],
    "pub_date": "2021-09-03T13:50:44+01:00",
    "content": [
        {
            "text": "Michael Banks is an AssocRICS Specialist Property Inspector in our National Valuation Unit, tasked with inspecting technical properties. Here, he talks about the methodology for assessing hydrogen plants which are used to produce electrical energy."
        },
        {
            "text": "The emergence of hydrogen plants"
        },
        {
            "text": "There is rarely a normal day as a specialist property inspector, due to the 200-odd different classes of properties we deal with. These include petro-chemical plants, refineries, large distribution warehouses, satellite communication sites, heritage attractions, quarries, airports and port sites to name a few – some of which have already been covered in previous blogs."
        },
        {
            "text": "Recently, a completely new class of property appeared - a hydrogen filling station for vehicles."
        },
        {
            "text": "Despite some disastrous early results using hydrogen in airships, it is still a popular choice for the fuel industry and its popularity is on the increase. Hydrogen is an emerging fuel technology with potential to replace battery powered electric cars, plus it’s an abundant element and it’s free. In fact, there are estimates that the running costs of hydrogen and electric will be equal within the next few years."
        },
        {
            "text": "As a whole, the fuel industry is evolving rapidly to tackle resourcing issues and climate change. This has led to significant funding and investment in increased hydrogen use and development of hydrogen production and research facilities. The government has also provided funding for projects looking at using hydrogen and wind as green sources of electricity."
        },
        {
            "text": "What to consider"
        },
        {
            "text": "When faced with a new type of property I like to think about the basics – such as how did the developer create the site and infrastructure, and what processes are involved in the day-to-day operations?"
        },
        {
            "text": "Unlike a tank at a petrol filling station, this site actual produces the hydrogen on demand for sale as vehicles fill up. However, the amount being held on site must be limited as it’s an explosive compound, dangerous in higher volumes. Some sites use solar power to supply green energy to the site, creating another element to consider when inspecting."
        },
        {
            "text": "Undertaking an inspection"
        },
        {
            "text": "Inspecting a property like this involves following the production process around the site, noting characteristics such as where the supply of electricity comes from (solar, mains or generator) to the type of walls used. This is important as proximity to buildings may mean the walling is actually a blast wall, with extensive protective foundations, and therefore a greater design and building cost must be taken into account for the valuation."
        },
        {
            "text": "As mentioned, our work has great variety and we’re seeing new types of premises and properties emerging all the time. This keeps us on our toes and makes sure our work is always interesting as we manoeuvre our way through a growing modern world. Thankfully we tend to enjoy not knowing what’s coming our way on the horizon!"
        }
    ]
}