{
    "url": "https://rpc.blog.gov.uk/2021/09/03/is-regulation-working-as-intended/",
    "title": "Is regulation working as intended?",
    "authors": [
        "Jeremy Mayhew"
    ],
    "categories": [
        "Evaluation",
        "Independent scrutiny"
    ],
    "pub_date": "2021-09-03T16:50:24+01:00",
    "content": [
        {
            "heading": 2,
            "text": "The purpose of evaluating regulations after they are introduced"
        },
        {
            "text": "An effective regulatory framework should review regulations after implementation to see if they are working as intended or need to be revised. This is the purpose of Post Implementation Reviews (PIRs). Done well, they should:"
        },
        {
            "text": "However, between 2016 and 2018, 72% of required PIRs were completed on time, and this dropped to below 40% in the last 2 years (partly due to the pressures of COVID-19). The problem is long term and systemic."
        },
        {
            "heading": 2,
            "text": "Current obligations and context"
        },
        {
            "text": "Section 28 of the Small Business, Enterprise and Employment (SBEE) Act, 2015 places a statutory duty on ministers to either:"
        },
        {
            "text": "The deadline for completion of PIRs is generally 5 years from the measure coming into force. However in practice, PIRs are often:"
        },
        {
            "heading": 2,
            "text": "What PIRs should deliver"
        },
        {
            "text": "A good PIR should address the following key questions:"
        },
        {
            "heading": 3,
            "text": "Looking backwards"
        },
        {
            "heading": 3,
            "text": "Looking forward"
        },
        {
            "heading": 2,
            "text": "The current position and suggestions for reform"
        },
        {
            "text": "The current Review of the Better Regulation Framework is considering bringing PIRs forward to 2 years after the regulation comes into effect (from the present 5 years). Earlier evaluation would be welcomed (although sufficient time needs to be allowed to pass to properly see the impacts of the regulation). However to be effective, PIRs need to be given greater ministerial and political importance than currently."
        },
        {
            "text": "Perhaps the 2 most obvious reasons for the current under-performance are:"
        },
        {
            "text": "If evidence is to be available to evaluate a regulatory measure properly, information needs to be gathered from its introduction with the PIR in mind. This requires an effective monitoring and evaluation (M&E) plan which sets out the evidence to be gathered to support the PIR. IAs should already contain plans for M&E, but at present over 1 in 5 IAs that we have reviewed have ‘weak’ or ‘very weak’ M&E plans. We are currently unable to ‘red rate’ IAs on inadequate M&E plans (but do provide comments on them in our opinion). One way to improve the quality of evidence underpinning PIRs would be to allow opinions explicity to ‘red rate’ the IA’s M&E plans."
        },
        {
            "text": "The current political governance structure does not lend itself to ensuring priority is given to PIRs (unlike IAs which are required to be laid before Parliament alongside the legislation, together with the associated RPC opinion)."
        },
        {
            "text": "One possible way forward would be by giving responsibility for evaluation to a dedicated cross-departmental function within government (potentially located in the Cabinet Office or BEIS) with the power to effectively ‘call out’ ministers or departments that do not meet their PIR obligations, but we recognise that there may be alternative, more effective ways of ensuring that PIRs are properly undertaken and acted upon."
        },
        {
            "text": "This could be supported by an explicit requirement to adopt an ‘evaluate first’ approach to new regulation – ensuring that the effectiveness of the existing regulatory landscape is evaluated before any new regulations are proposed. This could be incorporated as a required element in pre-consultation stage IAs."
        },
        {
            "text": "We encourage anyone with an interest in these issues or suggestions of other ways to improve the evaluation of regulations to respond to the government consultation. The deadline for responses is 1 October 2021."
        },
        {
            "text": "Stay up-to-date by signing up for email alerts from this blog."
        }
    ]
}