{
    "url": "https://educationhub.blog.gov.uk/2021/09/03/mental-health-resources-for-children-parents-carers-and-school-staff/",
    "title": "Mental health resources for children, students, parents, carers and school/college staff",
    "authors": [
        "Media Officer"
    ],
    "categories": [
        "Coronavirus",
        "Mental Health"
    ],
    "pub_date": "2021-09-03T13:19:39+01:00",
    "content": [
        {
            "text": "We have put together some useful links and sources of mental health support so that children and young people, parents, carers, and school and college staff can get the advice and help they need."
        },
        {
            "text": "We have also added a new module to the RSHE curriculum for primary and secondary schools specifically designed to focus on mental health. This important addition will enable much-needed conversations about mental health to happen inside the classroom. "
        },
        {
            "text": "The list below is not exhaustive, and many other useful organisations and services exist, but it is hoped that these will help children, young people and adults navigate the key resources and get the support they deserve. "
        },
        {
            "text": "Please note that we have marked resources applicable to and for young people and staff in further education with an asterisk (*). "
        },
        {
            "text": " Seeking specialist support for children and young people "
        },
        {
            "text": "Local children and young people’s mental health services (CYPMHS) are continuing to operate and in many cases are providing support remotely. Children and young people or their parents or carers can also contact their GP or refer to NHS 111 online*. Local CYPMH services will also have information on access on their websites: many offer self-referral or single points of access. "
        },
        {
            "text": "NHS trusts have established 24-hour urgent mental health helplines in most parts of England for people of all ages. If you have urgent concerns about a child or young person, you can find your local helpline here*to discuss these with a mental health professional. "
        },
        {
            "text": "And remember to refer to your local children’s services if you have any safeguarding concerns. "
        },
        {
            "text": "General information relevant to children and young people’s wellbeing and mental health "
        },
        {
            "text": "These resources are dedicated to children and young people’s general mental health and wellbeing, with a particular focus on mindfulness with developing coping skills in young people. "
        },
        {
            "text": " "
        },
        {
            "text": "Covid-19 specific children and young people’s wellbeing and mental health support "
        },
        {
            "text": "For young people who feel particularly overwhelmed and troubled by Covid-19, these resources are helpful ways to manage anxiety around the pandemic, with helpful tools on homeschooling and self-care during lockdown. "
        },
        {
            "text": " "
        },
        {
            "text": "Mental health support for parents, carers, and school or college staff "
        },
        {
            "text": "Keeping in mind that parents, carers and school staff can often be impacted by children’s mental health, we have provided some select resources that can help adults better support children, and also find the help that they themselves might need. "
        },
        {
            "text": " "
        },
        {
            "text": " Workplace / organisational approaches to mental health and wellbeing "
        },
        {
            "text": " "
        },
        {
            "text": "Issue and group specific children and young people’s mental health and wellbeing support "
        },
        {
            "text": "Sometimes, children need specific and targeted resources to help with problems they are facing. Below we have outlined some support available for particular issues, including loneliness, suicide prevention, eating disorders and domestic abuse. "
        },
        {
            "text": "SEND "
        },
        {
            "text": " Care leavers "
        },
        {
            "text": "Loneliness "
        },
        {
            "text": " Bullying, harassment, and abuse  "
        },
        {
            "text": " Bereavement support  "
        },
        {
            "text": " Self-harm  "
        },
        {
            "text": " Eating disorders  "
        },
        {
            "text": " Suicide prevention  "
        },
        {
            "text": "Trauma  "
        },
        {
            "text": "Domestic abuse  "
        },
        {
            "text": "Drug and alcohol support "
        },
        {
            "text": "Helplines "
        }
    ]
}