{
    "url": "https://space.blog.gov.uk/2021/09/03/the-night-sky-in-september/",
    "title": "The night sky in September",
    "authors": [
        "Derek Smale"
    ],
    "categories": [
        "Astronomy"
    ],
    "pub_date": "2021-09-03T13:43:30+01:00",
    "content": [
        {
            "text": "NASA’s Ingenuity helicopter has performed amazingly well on Mars, successfully completing its eleventh flight last month, scouting out the terrain that the Perseverance Rover will traverse across Jezero crater."
        },
        {
            "text": "The rover, which touched down on Mars in February, is preparing for a second attempt to drill a surface sample after the first sample appeared to have crumbled before it could be stored."
        },
        {
            "text": "Our planet is tilted on its orbit around the Sun and our seasons are determined by the extent to which we are leaning more toward or away from the Sun. On 22 September we pass one of the two midway points in the orbit around our star where neither the north or south pole leans closer to the Sun, and the days and nights are equal in length."
        },
        {
            "text": "This point in time is called an ‘equinox’, which is derived from the Latin words ‘equi’ (equal) and ‘nox’ (night) and marks the start of ‘Astronomical Autumn’."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Autumn is coming"
        },
        {
            "text": "As the nights get longer, the summer triangle of stars (see June and July’s blog for more information) that have been high overhead after dark, start to give way to the autumn constellations such as Pegasus, the distinctive ‘W’ shape of Cassiopeia, and Andromeda.  This brings an opportunity to see the wonderful Andromeda Galaxy."
        },
        {
            "text": "Andromeda is visible to the naked eye as a small faint, fuzzy patch of light, though you’ll need to get away from bright town and city lights to see it."
        },
        {
            "text": "Scanning this patch of sky with binoculars or a small telescope will also reveal the Triangulum Galaxy (bottom left), and sitting within our own Milky Way galaxy and much closer to home at 1,300 light years away, the star cluster NGC 752 (top left). Use bright star Mirach (centre), which is 100 times larger and nearly 2,000 times brighter than our Sun, as a guide to finding these deep sky objects."
        },
        {
            "text": "This patch of sky is home to a remarkable solar system that lies around 44 light years away from us. The star Titawin (top - labelled) is part of a system that has three other stars around it, but also hosts four large planets, most likely gas giants like Jupiter."
        },
        {
            "text": "Looking at the number of stars visible in this patch of sky alone it’s mind-blowing to think of the possible discoveries that are yet to be made, not only about the stars, but the planets and their moons around them!"
        },
        {
            "text": "The constellation of Andromeda can be seen rising in the east soon after dark. For a map of the constellations around this patch of sky, see last month’s blog."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "A year in space"
        },
        {
            "text": "One of the fascinating things about stargazing is being able to observe the passing of the seasons each year, with the familiar patterns of the stars and constellations rising and setting."
        },
        {
            "text": "September sees the completion of a full year of these astronomy blogs, and those who’ve been following these since they started last October may spot some similarities this month with that very first edition."
        },
        {
            "text": "The distinctive winter constellations of Taurus and Orion can once again be seen in the early hours, following Andromeda across the night sky.  Jupiter and Saturn again feature prominently. Their orbits around the Sun are far longer and slower than Earth’s, so while we have made a full trip around the Sun since the first of these blogs, Jupiter and Saturn have completed only a fraction of their own orbits."
        },
        {
            "text": "Draw a line on each of the images above using bright stars Vega and Altair as a guide, and you can see that Jupiter, being the closer of the two to the Sun and therefore orbiting more quickly, has moved furthest on its 12-year orbit of the Sun, while Saturn has only moved a fraction of its 29-year journey around the Sun."
        },
        {
            "text": "Mars only completes around half of its orbit in an Earth year, so while the two planets were at their closest point (or ‘opposition’) to each other this time last year, the red planet is now sitting on the opposite side of the Sun to us, a period called Mars Solar Conjunction."
        },
        {
            "text": "The position of the two planets in the coming weeks means that the hot, ionised gases expelled from the Sun will start to cause interference with the signals travelling to and from our spacecraft on and around Mars."
        },
        {
            "text": "Towards the end of the month, the scientists overseeing these spacecraft will cease communications with them for more than a week, to prevent the spacecraft from receiving, and potentially acting upon commands that could have been corrupted by this interference."
        },
        {
            "text": "With the great distance to the gas giants, with Mars currently at its greatest distance from Earth, and with Venus and Mercury still some way ‘behind’ Earth in their orbits around the Sun, our planet is currently closer to the Sun than to any of the planets in our Solar System."
        },
        {
            "text": "Mercury travels fast, however, completing a solar orbit every 88 days, and by the middle of the month it starts to catch up, and move between the us and the Sun, ahead of its ‘opposition’ with (or closest point to) earth early next month."
        },
        {
            "text": "Did you know:  Due to the positions, distances and speeds of the planets, Mercury spends more time as the closest planet to Earth than the other planets!"
        },
        {
            "text": "By the end of September, the Andromeda Galaxy will be more than 3,150,000,000km (nearly 2,000,000,000 miles) closer to our own Milky Way Galaxy than it was a year ago. Despite moving towards us at this incredible speed, the distances between the galaxies are so vast that it won’t reach us for more than four billion years!"
        },
        {
            "heading": 3,
            "text": "Other night sky sights this month"
        },
        {
            "text": "With the spring constellations dipping low in the north west after sunset, see if you can spot the constellation of Ursa Major (the Great Bear), which appears to be stood on the horizon as darkness falls."
        },
        {
            "text": "The full Moon will appear near the constellation of Pisces this month on 20 September. Meanwhile the best time to try to view more stars and faint objects like the Andromeda Galaxy is on the days around the new moon (7 September), as the skies will be considerably darker."
        },
        {
            "text": "There are a number of bright passes of the International Space Station this month.  The table below features some of the highest, brightest passes across the sky, and you can find all of the passes for your location at https://www.heavens-above.com/."
        },
        {
            "text": " "
        }
    ]
}