{
    "url": "https://companieshouse.blog.gov.uk/2021/09/03/using-the-find-and-update-company-information-service/",
    "title": "Using the 'Find and update company information' service",
    "authors": [
        "Gary Townley - Senior communications manager"
    ],
    "categories": [
        "Company guidance"
    ],
    "pub_date": "2021-09-03T10:20:28+01:00",
    "content": [
        {
            "text": "The Find and update company information service is your portal for finding information and uploading certain information to the Companies House register."
        },
        {
            "text": "If you want to find information about a limited company, the register is available for anyone to use free of charge and it’s usually available 24 hours a day."
        },
        {
            "heading": 2,
            "text": "Search and access information"
        },
        {
            "text": "Let’s first look at the information that you can access and how to search using the online service."
        },
        {
            "text": "Sitting at the top of our homepage is the ‘Find company information’ link, which is pretty much self-explanatory. By selecting this link, you’ll be able to search for free company details such as:"
        },
        {
            "text": "You’ll also be able to look at the filing history and download accounts and confirmation statements if they’re available."
        },
        {
            "text": "In fact, you can get a wide array of company details which can be extremely useful if you’re thinking of working with another company or using their services. By entering the company name, number, or the name of a director you’ll be supplied with a list of names from the register which match your criteria."
        },
        {
            "text": "You can narrow the search down by choosing to search companies, officers, or disqualifications and by scrolling through the results you should find what you’re looking for."
        },
        {
            "text": "Once you have found and selected a company, you’ll be presented with the overview screen. Here you’ll find the registered address, date of incorporation, nature of business and the dates the last accounts and confirmation statement were filed, and when the next are due."
        },
        {
            "text": "You’ll have the option to view the filing history to see any changes, appointments and download any accounts or confirmation statements, if they’re available."
        },
        {
            "text": "You can also see the officers and people with significant control (PSC) with their correspondence addresses. A company snapshot is available containing the last 100 entries and you can order a certificate or certified document."
        },
        {
            "text": "The last 2 options you have on the overview screen are to follow the company or file for the company."
        },
        {
            "heading": 2,
            "text": "Follow a company"
        },
        {
            "text": "To follow a company, you’ll need to register with an email address and a password. When you have chosen the company to follow, you’ll be notified of that company’s activity. The company you’re following will not be informed that they’re being followed. So, if you want to keep a check on a competitor or even make sure that nothing awry is filed on your own company, this is a great way to do it."
        },
        {
            "heading": 2,
            "text": "File information for your company"
        },
        {
            "text": "It’s now possible to file some documents using the Find and update company information service, which include abridged or full accounts and a change to a registered office."
        },
        {
            "text": "Future plans include adding filing for:"
        },
        {
            "text": "Until these are tested and launched you’ll need to file using WebFiling, which is one of our older services."
        },
        {
            "text": "You should be aware that although we carry out basic checks on documents we receive, to make sure they have been fully completed and signed, we do not have the statutory power or capability to verify the accuracy of the information that companies send to us. The fact the information has been placed on the public record should not be taken to indicate that Companies House has verified or validated it in any way."
        },
        {
            "text": "When we examine accounts we only makes basic checks on them, for example to make sure that:"
        },
        {
            "text": "If we receive a complaint that the accounts do not comply with the Companies Act in some way, we have a duty to draw this to the company’s attention and, if appropriate, ask for a set of revised accounts which comply with the requirements."
        },
        {
            "text": "With just a few clicks, the Find and update company information service allows you to get basic information on any company on the register. It’s also free to use and there’s no limitation on how many searches you perform. You can search and follow as many companies as you want."
        }
    ]
}