{
    "url": "https://socialworkwithadults.blog.gov.uk/2022/12/19/a-message-for-the-festive-season-from-lyn-romeo/",
    "title": "A message for the festive season from Lyn Romeo",
    "authors": [
        "Lyn Romeo"
    ],
    "categories": [
        "Coronavirus",
        "Recognition"
    ],
    "pub_date": "2022-12-19T16:12:55+00:00",
    "content": [
        {
            "heading": 2,
            "text": "2022 has gone by amazingly quickly..."
        },
        {
            "text": "...but, somehow, it also packed in a lot of incident."
        },
        {
            "text": "As I prepare to make arrangements to travel to the north of England to spend Christmas with friends, I am reminded I was making the same plans this time last year, but ended up home alone for 10 days isolating with Covid! Hopefully, fully vaccinated and boosted both for both coronavirus and flu, train strikes and weather permitting, I will make it up there this time and enjoy my Christmas dinner."
        },
        {
            "text": "We began the year emerging gingerly from the impact of the pandemic, to then experience the repercussions of war in Ukraine, an energy crisis, inflation, rising interest rates and pressures on the cost of living. All this on top of ongoing challenges for an adult social care sector dealing with increasing demand, complexity of needs and workforce capacity issues across the sector."
        },
        {
            "heading": 2,
            "text": "A tough year but your resilience shines through once again"
        },
        {
            "text": "It is a bit of an understatement to say it has been another tough and exhausting year. So much change and uncertainty is unsettling for everyone. However, I continue to be humbled and proud to hear and see the amazing work social care staff undertake each and every day.  through these very challenging times."
        },
        {
            "text": "I have witnessed real practice leadership at every level in local areas, seeing so many colleagues doing the best they can to make a positive difference to people’s lives and support the wellbeing of staff."
        },
        {
            "text": "I do hope everyone has a chance to have a bit of a break and a rest. Seasons greetings and wishing everyone of you a happy and hopeful new year."
        }
    ]
}