{
    "url": "https://planninginspectorate.blog.gov.uk/2022/12/19/biodiversity-and-solar-farms-an-insightful-experience-during-our-placement-year/",
    "title": "Biodiversity and solar farms: An insightful experience during our placement year",
    "authors": [
        "Jessica Jones",
        "Jade Woodger-Bassford"
    ],
    "categories": [
        "Environment"
    ],
    "pub_date": "2022-12-19T17:50:59+00:00",
    "content": [
        {
            "text": "Jess and Jade, aspiring environmental professionals and university students on placement at the Planning Inspectorate, shine a light on the effects of solar farms on biodiversity."
        },
        {
            "text": "One of the highlights of our placement year so far has been a recent site visit to two solar farms: Eveley Solar Farm just outside of Stockbridge (completed in 2016) and Solar Light Solar Farm in Sulhamstead Abbots (currently under construction)."
        },
        {
            "text": "Alongside other colleagues, the visit was to help gain a better understanding of:"
        },
        {
            "text": "The role of the Environmental Services Team, in which we work, is to ensure proposed developments such as solar farms have due consideration to environmental impacts. A trip of this nature helps us to experience in-person the impact and mitigations for these types of development."
        },
        {
            "heading": 2,
            "text": "Solar Light Solar Farm"
        },
        {
            "text": "Once completed, this solar farm will consist of 14,762 (545 watt) panels. The site was consented in 2014 and construction began in July 2022. It has a completion date of November 2022."
        },
        {
            "text": "Construction took a long time to commence as the connection agreement with Scottish and Southern Energy and National Grid took two years to negotiate. The site is situated in a semi-rural and largely agricultural area with a small, rural road running alongside."
        },
        {
            "heading": 2,
            "text": "Eveley Solar Farm"
        },
        {
            "text": "Eveley Solar farm, which has been in operation since March 2016, measures 70 hectares and is still one of the biggest solar farms in the UK with a capacity of 49,33MW - powering around 12,300 homes."
        },
        {
            "text": "It is located near the village of Stockbridge in Hampshire, an area which is surrounded by designated sites. These include:"
        },
        {
            "heading": 2,
            "text": "Biodiversity"
        },
        {
            "text": "The sites vary in terms of levels of biodiversity. Solar Light is still under construction and subject to major disturbances. Whereas, Eveley Solar Farm has been without construction or major disturbances since it began operation in 2016 - biodiversity has had chance to recover and to increase."
        },
        {
            "text": "Since the end of construction, increased soil fertility has led to greater biodiversity around Eveley Solar Farm, due to:"
        },
        {
            "text": "The soil, displaced from construction, was formed into bunds surrounding the site. Since their formation, these bunds have grown hedgerows and shrubbery encouraging breeding birds to the area."
        },
        {
            "text": "Mitigation measures have been embedded into the design of the solar farm to protect biodiversity and reduce/avoid environmental impacts. These measures include deer fencing and mammal gates, planting of wildflowers and trees. During construction, exclusion zones are implemented for badgers, tree canopies and root protection areas."
        },
        {
            "heading": 2,
            "text": "The Lifecycle of a Solar Farm"
        },
        {
            "heading": 3,
            "text": "Construction"
        },
        {
            "text": "Construction includes building access tracks with 450ml drainage either side, installation of fencing for security of deliveries, ducting is then installed in the ground and cables are trenched (up to around 2.4m) and then trenches are backfilled, and foundations are piled (usually around .5m deep). Then the structures are mounted onto the foundations."
        },
        {
            "heading": 3,
            "text": "Operation"
        },
        {
            "text": "Panels are split in 2 so that the top and bottom produce energy separately. This is so that if part of the panel is in shadow, the other half can still produce energy rather than the whole panel being ‘shut down’ by the shade. This split also allows for water runoff halfway down the panel through the gap."
        },
        {
            "text": "Panels are approximately 2.8m in portrait and this size is unlikely to change much over the years as it is optimum in terms of size relative to energy output and environmental impacts e.g. visual impact."
        },
        {
            "text": "Drones are used to monitor the panels and if they have been damaged after storms."
        },
        {
            "text": "English weather is ideal for solar energy production because our rain washes off dust and debris to ensure maximum luminescence, and bright but ambient temperatures are best as panels produce more energy when cold and thinner film can be used – in hotter countries they use thicker film to protect from heat and some require cooling systems."
        },
        {
            "heading": 3,
            "text": "Decommissioning"
        },
        {
            "text": "Solar panels lose 0.3% of their generation capacity per year. However, it is not worth replacing them in terms of cost unless they are broken due to storm damage. After 30 – 40 years when the site is ready to be decommissioned the solar panel works at 60%."
        },
        {
            "text": "A decommissioning fund has been set up for each site so that when the lease ends, funds are available to decommission the site regardless of the financial viability of the business."
        },
        {
            "text": "The components of solar panels are recyclable, and this is a growing industry"
        },
        {
            "heading": 2,
            "text": "What we learned from a site visit"
        },
        {
            "text": "Seeing the sites in person gave the developments we read about some real-life context in terms of surrounding geography and understanding potential environmental impacts."
        },
        {
            "text": "The site visit was useful as when it comes to writing scoping opinions or carrying out screenings in the future, we can draw on this experience and compare similarities with other schemes to the two schemes we visited making identification of potential impact pathways easier."
        },
        {
            "text": "The site visit was an enjoyable learning experience that has enriched our placement year at the Planning Inspectorate and came with the bonus of meeting other employees that we may not otherwise have met."
        },
        {
            "heading": 2,
            "text": "Find out how you can make an impact in your student placement year!"
        },
        {
            "text": "Are you a student looking for a meaningful placement year? The Planning Inspectorate is currently looking to take on 4 students across 2 placements for a year - either working on Nationally Significant Infrastructure Projects or on our Environmental Impact Assessment team."
        },
        {
            "text": "For more information and to apply visit the placements page. But hurry, closing date is 2 January 2023!"
        },
        {
            "heading": 2,
            "text": "About the authors"
        },
        {
            "text": "We are both placement students within the Environmental Services Team. We are in our 3rd year of university, studying Zoology with Environmental Management at Harper Adams University (Jess) and Ecology and Environmental Science at University of Gloucestershire (Jade), graduating in 2024."
        }
    ]
}