{
    "url": "https://marinescience.blog.gov.uk/2022/12/19/in-deep-water-understanding-the-future-climate-risks-to-pitcairns-coral-reefs/",
    "title": "In deep water? Understanding the future climate risks to Pitcairn’s coral reefs",
    "authors": [
        "Bryony Townhill",
        "Susana Lincoln",
        "Colette Wabnitz"
    ],
    "categories": [
        "adaptation",
        "Climate Change",
        "Science"
    ],
    "pub_date": "2022-12-19T10:08:24+00:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "The UK overseas territory of the Pitcairn Islands is one of the most remote in the world. Spanning the four small islands of Pitcairn, Oeno, Henderson, and Ducie, they form part of a remote volcanic outcrop in the Southern Pacific Ocean. Pitcairn is the only inhabited island, with around 50 permanent residents. The Pitcairn Islands are also home to one of the largest marine protected areas in the world, where hidden under its clear waters, coral reefs are abundant."
        },
        {
            "text": "The Convention on Biological Diversity Conference of the Parties 15 (CBD COP15) held in Montréal, Canada has once again highlighted the vital role that coral reefs play in the functioning of healthy marine ecosystems. As well as supporting a large proportion of all marine biodiversity, they directly provide vital services to over 500 million people through the provision of food, coastal protection, and livelihoods."
        },
        {
            "text": "However, climate change is one of the greatest threats to coral reef ecosystems. With global temperatures likely to rise above 1.5 degrees, warming seas, increased sea level, ocean acidification, and increased damage due to storms are likely to lead to mass bleaching and mortality. The UN estimates that by the end of the century, bleaching will affect all of the world’s coral reefs with annual severe bleaching occurring by 2034."
        },
        {
            "text": "Coral reefs, Henderson Island. Photo Luke Hosty, Protect Blue."
        },
        {
            "text": "The Pitcairn Islands’ coral reefs are particularly unique and vulnerable to climate change. They grow in deeper, cooler waters compared to most other tropical coral reefs and because of their isolation from any other reefs in the tropical Indo-Pacific, they harbour endemic fish species, such as the Pitcairn sandlance (Ammodytoides leptus), Henderson triplefin (Enneapterygius ornatus) and a species of squirrelfish (Sargocentron megalops) found nowhere else in the world."
        },
        {
            "text": "“It is due to their remoteness”, explained Blue Belt Programme scientist Susana Lincoln from Cefas, “that very little is known about these waters and therefore their future and how climate change will affect them remains uncertain.\""
        },
        {
            "text": "Exploring Pitcairn Islands’ coral reefs"
        },
        {
            "text": "In 2020, marine scientists from around the world teamed up to assess the risk of climate change to the coral reefs of the Pitcairn Islands. Over the next 24 months, the team conducted an expansive review of information and data collected from around 400 scientific reports and articles from expeditions and studies of the islands and the surrounding region of the Southern Pacific Ocean."
        },
        {
            "text": "The scientific team included 15 marine biologists and ecologists, coral experts and climate change as well as fisheries scientists from Cefas, the University of York, the Marine Management Organisation and the University of Warwick in the UK; the University of British Columbia in Canada and the Stanford Center for Ocean Solutions in the USA; and the Commonwealth Scientific and Industrial Research Organisation and the University of Tasmania in Australia."
        },
        {
            "text": "“This work represents the outcome of a remarkable international and interdisciplinary collaboration. The outputs provide a valuable overview of the state of knowledge for the Pitcairn Islands, which can meaningfully inform policy and decision making for the management and protection of the islands’ unique coral reef system in the face of climate change.” said Colette Wabnitz, lead scientist at Stanford’s Center for Ocean Solutions and the Institute for the Oceans and Fisheries at the University of British Columbia."
        },
        {
            "text": "     Coral reefs, Henderson Island. Photo Luke Hosty, Protect Blue."
        },
        {
            "text": "Exploring Pitcairn Islands’ coral reefs"
        },
        {
            "text": "The findings summarised in a report card published last year and just published peer-reviewed journal article, reveal that, overall, to date, the Pitcairn Islands’ reefs have escaped the impacts of coral bleaching. This is mainly due to cooler-than-average sea temperatures because these corals grow deeper than usual for tropical reefs. Some reef areas were found to stretch from 30 m to 75 m depth, meaning they have been relatively sheltered from thermal stress. For this same reason, it is likely that the corals of the Pitcairn Islands will continue to elude severe bleaching for longer than other tropical reefs. However, the report also notes that these corals remain at risk from several other factors, including:"
        },
        {
            "text": "Overall, the findings suggest that while the level of human activity is currently relatively low, existing local environmental pressures could potentially exacerbate the impacts of climate change on local coral reefs in the future."
        },
        {
            "text": "“Because of their isolation and small population, the Pitcairn Islands do not suffer some of the problems of other coral atoll islands, but nevertheless they are still exposed to the risk of illegal fishing, pollution and marine litter, anchor damage, erosion and invasive non-native species. One way to boost the resilience of the corals and their chances of recovery and survival following impacts from future climate change, is to control and where possible reduce these other local pressures.” says Blue Belt Programme scientist Bryony Townhill from Cefas."
        },
        {
            "text": "Pitcairn Island. Photo by Luke Hosty, Protect Blue."
        },
        {
            "text": "Adaptation to increase resilience "
        },
        {
            "text": "Steps that could be taken to increase adaptation to increase resilience to future changes could include a range measures, such as effective and sustainable management of fisheries and prevention of marine pollution. Direct interventions on the reefs, such as coral planting, could also help, however, these would be very costly and labour-intensive, and probably not as effective in the longer term."
        },
        {
            "text": "“While the scarcity of scientific data about these islands and the isolation of their reefs presents many challenges in terms of assessing the risks of climate change, there are also exciting opportunities”, said Susana Lincoln. It is hoped that the findings of this study will not only support management and conservation in the Pitcairn Islands Marine Protected Area, but also provide vital evidence to support marine conservation worldwide."
        },
        {
            "text": "“Due to their remoteness and low human population, the coral reefs of the Pitcairn Islands could help us to disentangle the effects of climate change from those of other human activities. This could help us find the answers and solutions we are desperately seeking to conserve coral reefs globally\"."
        },
        {
            "text": "About the Blue Belt Programme"
        },
        {
            "text": "The Blue Belt Programme supports the UK government’s commitment to enhance marine protection for over four million square kilometres of marine environment across the UK Overseas Territories. The programme is an innovative partnership the Centre for Environment, Fisheries and Aquaculture Science (Cefas) and the Marine Management Organisation (MMO) working with, and in support of, the UK Overseas Territories."
        },
        {
            "text": "For more information:"
        }
    ]
}