{
    "url": "https://homeofficemedia.blog.gov.uk/2022/12/19/martyns-law-factsheet/",
    "title": "Martyn’s Law Factsheet ",
    "authors": [
        "Home Office news team"
    ],
    "categories": [
        "Fact sheet"
    ],
    "pub_date": "2022-12-19T10:36:56+00:00",
    "content": [
        {
            "text": "On Monday 19 November, the Government announced details for the Protect Duty, now to be known as ‘Martyn’s Law’ in tribute of Martyn Hett, who was killed alongside 21 others in the Manchester Arena terrorist attack in 2017."
        },
        {
            "text": "Why do we need Martyn’s Law?  "
        },
        {
            "text": "There have been 14 terror attacks in the UK since 2017. These tragic attacks have caused deaths and casualties amongst people going about their everyday lives.  "
        },
        {
            "text": "The terrorist threat we currently face is multifaceted, diverse, and continually evolving. As such, it remains difficult to predict which locations could be targeted by terrorists with attempts being harder to spot and harder to stop.  "
        },
        {
            "text": " We need to improve security and ensure robust, proportionate, and consistent measures at public places to make sure we can better prepare and improve public security, in light of possible future attacks.  "
        },
        {
            "text": "  We are aware through engagement with industry that, without legal compulsion, counter terrorism security efforts often fall behind legally required activities. The prioritisation, consideration and application of security processes and measures is currently inconsistent. "
        },
        {
            "text": " What will Martyn’s Law do?  "
        },
        {
            "text": "Martyn’s Law will keep people safe, enhancing our national security and reducing the risk to the public from terrorism by the protection of public venues.   "
        },
        {
            "text": "It will place a requirement on those responsible for certain locations to consider the threat from terrorism and implement appropriate and proportionate mitigation measures.  "
        },
        {
            "text": "The legislation will ensure parties are prepared, ready to respond and know what to do in the event of an attack. Better protection will be delivered through enhanced security systems, staff training, and clearer processes.  "
        },
        {
            "text": "Who will be in scope?  "
        },
        {
            "text": "Premises will fall within the scope of the Duty where “qualifying activities” take place. This will include locations for purposes such as entertainment and leisure, retail, food and drink, museums and galleries, sports grounds, public areas of local and central Government buildings (e.g., town halls), visitor attractions, temporary events, Places of Worship, health, and education. "
        },
        {
            "text": "It is proposed that the Duty will apply to eligible locations which are either: a building (including collections of buildings used for the same purposes, e.g., a campus); or location/event (including a temporary event) that has a defined boundary, allowing capacity to be known. Eligible locations whose maximum occupancy meets the above specified thresholds will be then drawn into the relevant tier.  "
        },
        {
            "text": "Therefore, premises will be drawn into the scope of the Duty if they meet the following three tests: "
        },
        {
            "text": "How will it work?  "
        },
        {
            "text": "The Bill will impose a duty on the owners and operators of certain locations to increase their preparedness for and protection from a terrorist attack by requiring them to take proportionate steps, depending on the size and nature of the activities that take place there.  "
        },
        {
            "text": " Proportionality is a fundamental consideration for this legislation. It will therefore establish a tiered model, linked to the activity that takes place at a location and its capacity:  "
        },
        {
            "text": "Who will it apply to? "
        },
        {
            "text": "Premises will fall within the scope of Martyn’s Law where “qualifying activities” take place. This will include locations for purposes such as entertainment and leisure, retail, food and drink, museums and galleries, sports grounds, public areas of local and central Government buildings (e.g., town halls), visitor attractions, temporary events, Places of Worship, health and education."
        },
        {
            "text": "Eligible locations whose maximum occupancy meets the above specified thresholds will be then drawn into the relevant tier. "
        },
        {
            "text": "There will be some limited exclusions and exemptions from the Duty. This includes locations where transport security regulations already apply; and those that are vacant over a reasonable period or are permanently closed. Those with a large floor space and low occupancy in practice (e.g., warehouses and storage facilities) as well as offices and private residential locations, will not be in scope. "
        },
        {
            "text": "What will the standard tier be asked to do?   "
        },
        {
            "text": "Standard Duty holders will need to undertake easy and simple activities to meet their obligations. This will include completion of free training, awareness raising and cascading of information to staff and completion of a preparedness plan.   "
        },
        {
            "text": "The aim is to ensure staff are better prepared to respond quickly to evolving situations, aware of what processes they should follow, able to make rapid decisions and carry out actions that will save lives. This could be as simple as locking doors to delay attackers progress and access whilst guiding staff and customers to alternative exits. It could also enable lifesaving treatment to be administered by staff whilst awaiting the arrival of emergency services.   "
        },
        {
            "text": "What will enhanced tier be asked to do?   "
        },
        {
            "text": "A risk assessment and security plan, considered to a ‘reasonably practicable’ standard, will be required. This will allow Duty holders to assess the balance of risk reduction against the time, money and effort required to achieve a successful level of security preparedness - a recognised standard in other regulatory regimes (including Fire and Health and Safety).    "
        },
        {
            "text": "What about locations run by volunteers?  "
        },
        {
            "text": "Government intended for places of worship to receive bespoke treatment under the duty, in reflection of the existing range of mitigation activities delivered and funded by Government to reduce their vulnerability to terrorism and hate crime. All places of worship will be placed within the standard tier of the Duty regardless of their capacity, barring a small cohort across all faiths that charge tourists for entry and/or hire out the site for large commercial events. "
        },
        {
            "text": "Charities, community groups and social enterprises own and operate a broad range of locations (museums, national trust sites, sizeable public venues e.g., the royal opera house and national theatre). Some organisations also hire out premises to others for various purposes.  As most locations owned or operated by charitable organisations, community groups and social enterprises will likely fall below the 800+ capacity threshold, Government considers the requirements to be proportionate "
        },
        {
            "text": "Will this affect accessibility? "
        },
        {
            "text": "Duty requirements will vary but would for many include changes to security systems and processes, and how staff are trained. As such, many changes the Duty will drive are likely to be ‘behind the scenes’ that the public would not notice. In some instances, physical security features might however be obvious to the public but they should never compromise accessibility. "
        },
        {
            "text": "How will Martyn’s Law be enforced?  "
        },
        {
            "text": "An inspection capability will be established to seek to educate, advise, and ensure compliance with the Duty. Where necessary, the inspectorate will use a range of sanctions to ensure that breaches are effectively dealt with.   "
        },
        {
            "text": "How will you ensure this doesn’t create undue burden on businesses? "
        },
        {
            "text": "Consultation and ongoing liaison with the business community is integral to our approach. Government has carefully considered the impact on premises and locations that may be captured. This includes ensuring requirements placed on Duty holders are proportionate whilst achieving better public security, and without placing undue burden on parties responsible for public places. However, it is reasonable that many locations should take appropriate and proportionate measures to protect their staff and the public.  "
        },
        {
            "text": "Is there support for this legislation? "
        },
        {
            "text": "The Manchester Arena Inquiry Volume One Report strongly recommended the introduction of a duty to improve the safety and security of public venues.   "
        },
        {
            "text": "The London Bridge and Borough Market inquests also recommended the introduction of legislation which would govern the duties of public authorities regarding protective security.  "
        },
        {
            "text": "Seven in ten respondents to the Protect Duty consultation agreed that those responsible for publicly accessible locations (PALs) should take appropriate and proportionate measures to protect the public from attacks. This 18-week consultation    This 18-week consultation closed on 2nd July 2021 and received a total of 2,755 responses from a wide range of participants across the UK.  "
        },
        {
            "text": "Figen Murray and the Martyn’s Law campaign team have tirelessly campaigned for the introduction of new legislation. Their efforts have helped Government raise awareness of this important issue. Collaboration continues as we engage both the public and industry partners to debate how we can work together to improve public security. "
        },
        {
            "text": "Proposals to date have been well received by the security community and Government’s commitment to this reform has been broadly welcomed in Parliament, as Members of both Houses recognise how important it is to improve safety and security for our citizens, so they can go about their lives without fear. "
        },
        {
            "text": "Will Martyn’s Law apply to all of the UK?   "
        },
        {
            "text": "Yes. The legislation will apply across England, Wales, Scotland and Northern Ireland, as national security is a reserved matter for the UK Government.   "
        },
        {
            "text": "When will this important legislation be introduced? "
        },
        {
            "text": "The Government will introduce the Protect Duty as soon as parliamentary time allows. "
        },
        {
            "text": "When will the Protect Duty become law? "
        },
        {
            "text": "It is not possible to give a date. There will be a lead in time allowing for those captured by the Duty to prepare for commencement, and as soon as the parliamentary timetable is known this will be set out. "
        },
        {
            "text": "What are you doing to ensure public places have appropriate security before Martyn’s Law is implemented?   "
        },
        {
            "text": "Martyn’s Law is one part of our extensive efforts across Government including those of the police and security services, to combat the threat of terrorism. There remains an extensive programme of guidance in place which has been developed by security experts, Counter Terrorism Policing, and other partners to provide stakeholders and others responsible for public places, with high quality advice. Many businesses and organisations already do excellent work to improve their security and preparedness – however the absence of legislative requirements has at times led to inconsistencies and lack of clarity on accountability. Government wants to redress this position through this reform. "
        },
        {
            "text": "How will my business be supported on Martyn’s Law?  "
        },
        {
            "text": "Dedicated guidance and support will be provided for Martyn’s Law, to ensure that those in scope have the required information on what to do and how best to do it. As part of this approach, we will expand the support available to those responsible for delivering security in public places.  "
        },
        {
            "text": "A new online platform has been developed by the National Counter Terrorism Security Office (NaCTSO), Home Office and Pool Reinsurance to support all those seeking to enhance their protective security. ProtectUK is a central, consolidated hub for trusted guidance, advice, learning and engagement with experts in security and Counter Terrorism. It will serve as the ‘go to’ resource for free, 24/7 access the latest information on protective security and will be regularly updated with new engaging content and increased functionality. "
        }
    ]
}