{
    "url": "https://ruralpayments.blog.gov.uk/2022/12/19/opportunities-for-stewardship-agreement-holders-from-2023/",
    "title": "Opportunities for Stewardship agreement holders from 2023",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Agricultural Transition",
        "Countryside Stewardship",
        "Environmental Stewardship"
    ],
    "pub_date": "2022-12-19T13:46:07+00:00",
    "content": [
        {
            "text": "We wanted to help farmers understand the latest updates regarding their Stewardship agreements, so we are writing to all existing agreement holders to explain what the changes mean for them, and to outline some opportunities for 2023 and beyond."
        },
        {
            "text": "As of 1 January 2023, all Stewardship agreements including Environmental Stewardship Higher Level Stewardship (HLS) and Organic Higher Level Stewardship (OHLS), Countryside Stewardship (CS) Higher Tier, Mid Tier and Wildlife offers will be under domestic terms and conditions (T&Cs)."
        },
        {
            "text": "All new agreements that started on or after 1 January 2021 are already under domestic T&Cs and we are pleased to have been able to offer a greater level of advice, guidance and signposting where we’ve needed to visit a farm."
        },
        {
            "text": "From 1 January 2023, existing agreements signed under European Union (EU) T&Cs will be moved to align with agreements taken up after January 2021. Significantly this means for the first time, everyone will benefit from the same supportive, partnership-based approach as we move away from the penalty-based inspection system under the EU."
        },
        {
            "text": "Recognising the positive outcomes being delivered under the scheme, eligible HLS agreement holders with agreements expiring in 2023 will be able to extend and remain in the scheme for up to a further 5 years. We also intend to offer 5 year extensions for agreements due to end in 2024. For those who are already delivering valuable outcomes and wish to continue as they are, this offers some stability and certainty."
        },
        {
            "text": "For those who wish to explore other options, where there are no conflicts, HLS agreement holders will also be able to apply for a range of CS Capital grants, a CS agreement or a Sustainable Farming Incentive (SFI) agreement, while keeping their existing HLS agreement."
        },
        {
            "text": "Alternatively, HLS agreement holders who wish to leave HLS early will be able to do so without any penalty, if they successfully apply for a CS agreement starting January 2024 or another new land management scheme starting after January 2023. The new agreement would need to offer equivalent or greater environmental benefits than the HLS agreement, but this gives farmers some additional flexibility."
        },
        {
            "text": "Similarly, existing eligible CS agreement holders will be able to leave their agreement early without penalty to join a new land management scheme, providing the environmental benefits are equivalent or greater. They will also be able to apply for Capital grants or another CS agreement to start from 1 January 2024 or apply for the SFI – providing there are no conflicts in CS and SFI options."
        },
        {
            "text": "We remain committed to support farmers through the transition to new schemes and more details will become available throughout 2023.  In the meantime, we hope the benefits moving to domestic T&Cs and the options outlined to those with existing stewardship agreements will assist farmers in making the right choices and decisions for them on any changes they may wish to take up."
        }
    ]
}