{
    "url": "https://cspl.blog.gov.uk/2022/12/19/proactive-attention-to-standards-is-necessary/",
    "title": "Proactive attention to standards is necessary",
    "authors": [
        "Lord Jonathan Evans"
    ],
    "categories": [
        "Ethical standards",
        "Intimidation",
        "Leading in Practice",
        "Local government",
        "Standards Matter 2"
    ],
    "pub_date": "2022-12-19T10:53:12+00:00",
    "content": [
        {
            "text": "As we end a tumultuous year, I want to pay tribute to public servants across the country who have continued to formulate policy and deliver services to citizens. Our system benefits from having an impartial and effective civil service as part of the checks and balances in our democracy. It allows essential government business to continue, while new political leadership takes shape. "
        },
        {
            "text": "I also want to applaud those who put themselves forward for political office, both nationally and locally.  Our system relies on talented people willing to participate, debate and take decisions on behalf of the public. This can be especially difficult at a time when there continues to be unacceptable levels of abuse and intimidation of those in public life."
        },
        {
            "text": "Public standards issues have continued to cause concern this year, and although it can be argued that our structures have encountered - and mostly withstood - a great deal of challenge, I believe there remains an urgent need to update and strengthen them, in both central and local government. "
        },
        {
            "text": "Our report on local government standards will be 4 years old this January. The recommendations were well evidenced and supported by the sector, thanks to extensive input from local councillors, officers, independent persons and the public who gave us their views. The Committee has no remit to consider individual cases, but we continue to receive impassioned pleas from people caught up in local standards issues who feel the system is wholly inadequate. Democratic accountability via the ballot box is insufficient on its own; our system relies on checks and balances in between elections to deal with serious cases and maintain standards. The limited government response to our report is regrettable and we hope that our suggested reforms can be looked at with fresh eyes. "
        },
        {
            "text": "Similarly, ‘Upholding Standards in Public Life’ (November 2021) recommended stronger rules, greater independence and a better compliance culture for central government. This report, and those of Boardman and the House of Commons Public Administration and Constitutional Affairs Committee recognise the need for urgent attention to standards issues to prevent a further scandal like Greensill. The government has recently said they intend to respond to our report by next summer. I welcome the fact that serious thought is being given to reforms but am concerned that eighteen months will have been lost. "
        },
        {
            "text": "Proactive and ongoing attention to standards will always be necessary to ensure the systems and processes are able to meet the challenges faced today and while it is understandable that major events can overtake, we can ill afford another scandal with the subsequent knock to public trust. "
        },
        {
            "text": "Looking ahead, the Committee will be publishing its report on Leading in Practice in January. This report will share how a range of organisations, sometimes following a scandal or problem, have sought to inspire and support ethical behaviour. We hope it will prompt a wider discussion and encourage public sector organisations to look at their own practice."
        },
        {
            "text": "In the meantime, I wish everyone a Merry Christmas and with very best wishes for 2023. "
        }
    ]
}