{
    "url": "https://dluhcdigital.blog.gov.uk/2022/12/19/the-12-milestones-of-dluhc-digital-planning-2022/",
    "title": "The 12 Milestones of DLUHC Digital Planning 2022",
    "authors": [
        "Digital Planning"
    ],
    "categories": [
        "Digital Land",
        "Digital Planning",
        "PropTech"
    ],
    "pub_date": "2022-12-19T10:35:58+00:00",
    "content": [
        {
            "text": "There may not be any partridges or pear trees in sight as we reach the end of 2022, but the DLUHC Digital Planning team have reflected back on the year’s 12 stand out moments to acknowledge a fantastic year of work in collaboration with Local Planning Authorities and industry partners."
        },
        {
            "heading": 3,
            "text": "Our team and networks grew"
        },
        {
            "text": "None of our work would be possible without the people behind it and 2022 has been a year of growth for the team - We’ve welcomed colleagues from a variety of disciplines including communications, engagement, delivery management and technical specialisms. Coupled with our growing number of relationships with Local Government, digital and planning delivery partners, including the 54 LPAs we have funded this year, we are really proud of our diverse team and wider network who are #DoingPlanningDifferently as we head into 2023. "
        },
        {
            "heading": 3,
            "text": "planning.data.gov.uk went live"
        },
        {
            "text": "This year we moved from being a team testing different ways of improving land and housing data to passing a service assessment and launching the planning.data.gov.uk platform, a place to find, understand, use and trust data needed to build better planning services. "
        },
        {
            "text": "Behind the scenes we have begun to establish the team structure needed to operate the service, and develop better ways of supporting local planning authorities and policy teams needing to add more data to the platform."
        },
        {
            "heading": 3,
            "text": "Three Local Planning Authorities launched new digital planning services"
        },
        {
            "text": "Three new DLUHC funded digital planning services, co-designed by a pioneering group of local councils went live on the websites of Buckinghamshire, Lambeth and Southwark Councils in 2022. "
        },
        {
            "text": "The 2 PlanX services and BoPs service are part of the Open Digital Planning Project. You can find out more about the launch of these services and how they help citizens and Planning Officers in this blog post. "
        },
        {
            "text": "The work of the DLUHC Digital Planning Software team in collaboration with LPA partners has also been nominated for a 2023 IPA Government Project Delivery Award in the Digital Change Project of the Year category. "
        },
        {
            "heading": 3,
            "text": "The Open Digital Planning Project website and brand was launched "
        },
        {
            "text": "The software team’s first ‘post pandemic’ face to face team together day with LPA partners and the launch event of the Open Digital Planning website and brand took place this year. "
        },
        {
            "text": "The team workshop brought together councils already part of Open Digital Planning (ODP) to work together to focus on the future of Digital Planning and how ODP can help to achieve that. "
        },
        {
            "text": "At the evening ODP launch event, information was shared about the Planning Software Improvement Fund which is open for applications until 23 December 2022. "
        },
        {
            "heading": 3,
            "text": "The Levelling Up and Regeneration Bill was introduced into Parliament"
        },
        {
            "text": "The introduction of the Levelling Up and Regeneration Bill into Parliament this year was a significant milestone for the Digital Planning policy team as we look to establish a legal mandate for the digital and data requirements needed to modernise the planning system and enable the wider outcomes of desired departmental policy changes. "
        },
        {
            "text": "We have now completed the Commons stage of the bill's passage to Royal Assent and so far our powers remain the same as they were introduced, which we are delighted with. Councillor James Jamieson noted “The key thing is that we are all immensely supportive of digitisation; it is the way to go.” "
        },
        {
            "text": "Collaboration with our lawyers, the bill team, stakeholders and wider policy colleagues has been key to progress made so far and we are keen to continue building on this engagement in the new year."
        },
        {
            "heading": 3,
            "text": "The PropTech Engagement Fund has grown  "
        },
        {
            "text": "Our first Round of the PropTech Engagement Fund supporting 13 LPAs wrapped up in 2022, with some amazing achievements and learnings - Our Round 1 showcase was attended by 600+ people. "
        },
        {
            "text": "Many of these LPAs went on to join us in Round 2 which was launched this year. We are so proud of the work achieved by the 28 Round 2 digital engagement projects which have accelerated the adoption of digital citizen engagement tools and services which can demonstrate how to incentivise communities to positively engage in planning conversations. "
        },
        {
            "text": "Highlights from round 2 LPAs include Stevenage seeing a 290% increase in resident responses compared to using traditional engagement methods, and Plymouth, South Hams and West Devon who saw an 86% uplift in online survey take up versus other traditional submission methods in previous planning consultations. "
        },
        {
            "text": "As a final wrap up to the year - we are thrilled to announce the launch of our continuous funding to support existing LPAs with their journey to better platform interoperability and data management."
        },
        {
            "heading": 3,
            "text": "We’ve increased engagement and networking within the PropTech space "
        },
        {
            "text": "Our PropTech team has been busy expanding the PropTech conversation in 2022. In the summer we held a virtual Roundtable event to connect senior DLUHC officials with a wide range of voices to discuss how the PropTech sector might help inform and deliver the government’s levelling up ambitions. "
        },
        {
            "text": "More recently the team embarked on a ‘virtual road trip’ of policy teams at DLUHC, including Home Buying and Selling, Net Zero and Building Safety colleagues, to build a case for PropTech’s potential. They have also engaged globally with colleagues in Canada, New York City and Ireland to hear their take on the direction and potential of the international PropTech market. "
        },
        {
            "heading": 3,
            "text": "We’ve established a Front Door and Pipeline for Digital Planning Reform Projects "
        },
        {
            "text": "At the start of the year we established a Front Door and Pipeline for digital planning reform projects. Now each emerging reform area with digitalisation aspects is recorded and, working alongside the Digital Policy team, we are able to prioritise fundamental problems to solve and map interdependencies to deliver the right improvement at the right time."
        },
        {
            "heading": 3,
            "text": "We’ve set ourselves up to deliver modern Local Plans "
        },
        {
            "text": "We now have three agreed priority projects which we are kicking off with delivery partners in 2023: New Local Plans (the ‘what’), Site Selection and Consultation Responses. These projects are improving high-profile and critical elements of planning reforms and must meet multiple user needs - the new system needs Local Plans that are more understandable and approachable, as well as being more visual and anchored in consistent, open data so users can easily see what is planned in local areas. "
        },
        {
            "heading": 3,
            "text": "We’ve represented Digital Planning by attending and running a number of virtual and in person events. "
        },
        {
            "text": "Colleagues from across the team have been out and about in 2022, representing the programme’s various strands of work at industry events and visits to the local authorities and partners we work with. "
        },
        {
            "text": "From show and tell sessions to workshops exploring themes such as youth engagement, social media and the future of planning the team have travelled the country to engage with the projects we support on the ground and bring over 20 LPAs together at in person events run by DLUHC. "
        },
        {
            "text": "Notable industry events the team have attended include Planning Portal / RTPI’s National Planning Conference, the Institute for Government’s Data Bites #34: Getting things done with data in government and the inaugural Public Sector Proptech Summit at which the team chaired a panel session along with local authorities involved in our PropTech Engagement Fund and supported DLUHC’s Director General, Emran Milan, in delivering the opening plenary speech - ‘How the PropTech sector can support housing and planning ambitions.’"
        },
        {
            "heading": 3,
            "text": "Key programme reviews took place"
        },
        {
            "text": "The Infrastructure and Projects Authority (IPA) Gate 2 Review took place for the Digital Planning Programme in September. The IPA agreed that the Digital Planning Programme’s circumstances merits its continuing inclusion on the Government Major Projects Portfolio (GMPP). "
        },
        {
            "text": "In addition the programme’s Accounting Officer (AO) Assessment final review took place with our Permanent Secretary in November. This review focused on the outcomes of IPA and previous AO reviews and recommendations to make sure our Programme is set up for success."
        },
        {
            "heading": 3,
            "text": "We’re growing a community through our communications channels "
        },
        {
            "text": "In 2022 we launched our LinkedIn and Twitter pages to showcase how we’re #DoingPlanningDifferently with partners. With almost 650 followers across platforms in the first few months it’s been fantastic to grow our online presence and community - we are looking forward to enabling further conversations around digital planning and building engagement via our channels in 2023. "
        },
        {
            "text": "We have also published a number of blog posts on the DLUHC Digital Blog this year, which delve into these milestones in more detail, and have held monthly Show and Tell sessions to showcase the work of the team. In 2023 we will be launching our external newsletter, so do keep an eye out on Twitter and LinkedIn for information on how to join our mailing list. "
        },
        {
            "text": "All in all, we are incredibly grateful for the wonderful LPAs and stakeholders we’ve had the chance to work with across this year, and are looking forward to what’s to come in 2023. "
        },
        {
            "text": "Finally, the entire DLUHC Digital Planning Team wishes everyone a very happy and healthy winter holiday season. "
        }
    ]
}