{
    "url": "https://healthcareleaders.blog.gov.uk/2021/07/30/building-an-open-and-inclusive-nhs-workplace/",
    "title": "Building an open and inclusive NHS workplace",
    "authors": [
        "Sajid Javid - Secretary of State for Health and Social Care, Department of Health and Social Care"
    ],
    "categories": [
        "Personal reflections",
        "Supporting NHS staff"
    ],
    "pub_date": "2021-07-30T17:03:24+01:00",
    "content": [
        {
            "text": "The NHS was founded on the principle of equality: that good healthcare should be available to all, “based on clinical need, not ability to pay”. It’s so important that we practice what we preach and make sure that the NHS is an inclusive place of work for the 1.3 million people who work there."
        },
        {
            "text": "As a child of immigrants growing up in the 70s and 80s, I know what it’s like to face prejudice and discrimination, and I know what it’s like to feel like you don’t fit in at work. Now that I’m Secretary of State - first Secretary of State at DHSC from an ethnic minority - I will do everything I can to make sure the NHS is free from discrimination."
        },
        {
            "text": "A year ago this month, NHS England and NHS Improvement published the People Plan, and I’m pleased to see that the plan includes a chapter on belonging in the NHS."
        },
        {
            "text": "The plan demonstrates that where an NHS workforce is representative of the community it serves, patient care and the overall patient experience improves, and we’ve seen through our vaccination programme the importance of our diverse workforce in encouraging uptake in communities with lower uptake."
        },
        {
            "text": "However, the evidence also shows that discrimination is far too prevalent. Last week, NHS England published the Medical Workforce Race Equality Standard (MWRES), which focuses on the experiences of doctors and dental staff."
        },
        {
            "text": "It was upsetting to see that across almost all indicators, BME doctors reported a worse experience at work compared to white doctors, and that even when BME doctors become consultants, they continue to report greater levels of discrimination and harassment and that they felt less involved at work."
        },
        {
            "text": "I’m determined that we must address this, and I’m encouraged that the MWRES sets out a number of areas where we can take action. These include gathering better data, more targeted communications and greater diversity leadership levels."
        },
        {
            "text": "These are positive steps, and I will keep pushing this agenda, which is close to my heart. Because the NHS is one of our most cherished institutions, and we must make sure that everyone who works there get the appreciation and the care that they deserve."
        }
    ]
}