{
    "url": "https://hmlandregistry.blog.gov.uk/2021/07/30/customers-join-new-business-gateway-community-to-have-their-say-on-development/",
    "title": "Customers join new Business Gateway Community to have their say on development",
    "authors": [
        "Andrew Roddy, Senior Product Manager"
    ],
    "categories": [
        "Digital services"
    ],
    "pub_date": "2021-07-30T10:49:27+01:00",
    "content": [
        {
            "text": "On 12 May we launched the Business Gateway Community to an audience of 70 customers. Business Gateway application programming interfaces (APIs) allow customers to access our service from within their case management systems."
        },
        {
            "text": "Our Chief Operations Officer, Chris Pope, set out how important the forum would be in helping us to refine our plans to transform digital services over the next 2 years. The Business Gateway channel will benefit from new investment and a focus on delivering a range of new APIs to help customers automate their interactions with HM Land Registry."
        },
        {
            "text": "The vast majority of customers who attended the launch expressed interest in becoming early adopters for new services in the future. This will enable us to test service enhancements and new products ahead of their general release."
        },
        {
            "text": "This initial session validated the work done to date to create the roadmap and supported the priority of the new services planned for release this year. There were also new ideas for future services which have been added to the backlog, and input from the community will help to prioritise."
        },
        {
            "heading": 2,
            "text": "Second community event"
        },
        {
            "text": "On 22 June we hosted our second Business Gateway Community event for a more detailed discussion on our development plans. Our developers presented an overview and demonstration of the first new service, which enables users to see which official copy documents are available to order, and if they’re available for immediate download. We ran breakout sessions to invite input on the priority features for a new Developer Hub for customers – the aim of which is to make it easy to integrate with our APIs. Customers highlighted the importance of receiving clear and comprehensive documentation, access to a more advanced test environment and better transparency around system availability."
        },
        {
            "text": "If you would like to get involved, please sign up. We’re keen to engage as many current or prospective Business Gateway customers as possible to help us transform working practices and make the registration process as fast and easy as possible."
        }
    ]
}