{
    "url": "https://defradigital.blog.gov.uk/2021/07/30/joining-up-the-journey-for-fresh-produce-exporters/",
    "title": "Joining up the journey for fresh produce exporters",
    "authors": [
        "Neil Johnson"
    ],
    "categories": [
        "Defra digital",
        "Defra services",
        "Digital transformation",
        "User research"
    ],
    "pub_date": "2021-07-30T09:16:02+01:00",
    "content": [
        {
            "text": "Plants and fresh produce account for a substantial proportion of export trade, so it was important to conduct detailed user research with a group of exporters as a priority."
        },
        {
            "text": "While our service was originally scoped to focus solely on the end-to-end journey for getting a phytosanitary certificate, we wanted to fully understand user needs and ensure that the new service provides a solution for the complexities of the wider plant export process."
        },
        {
            "heading": 2,
            "text": "Following user needs"
        },
        {
            "text": "We therefore expanded our user research to explore the user process for obtaining Certificates of Conformity (CoC)). We spoke to produce exporters to understand how they made CoC applications and discussed with colleagues from the Horticultural Marketing Inspectorate (who conduct CoC inspections) how they handle the data provided by users."
        },
        {
            "text": "Whilst conducting this research, we wanted to explore how users were affected by the need for two different teams in the Animal and Plant Health Agency (APHA)) having to maintain two different systems to obtain each of the certificates, and how we might be able to find a solution to bring the two systems closer together."
        },
        {
            "heading": 2,
            "text": "Understanding how produce exporters work"
        },
        {
            "text": "Our user research helped test our assumptions, and uncovered some valuable findings, such as:"
        },
        {
            "heading": 2,
            "text": "Joining up the journey"
        },
        {
            "text": "Based on these findings, we workshopped ideas on how to solve the user needs. We prototyped a concept on how users might apply for both a phytosanitary certificate and a certificate of conformity at the same time, within the same digital service. We are currently using this prototype to test if the concept solves the whole user need. We are also discussing with APHA colleagues how the dual trained inspectors will be able to maximise the efficiency of the process."
        },
        {
            "text": "In the meantime, we will continue to conduct research with users to better understand their needs and test our assumptions as our service develops."
        }
    ]
}