{
    "url": "https://ofqual.blog.gov.uk/2021/07/30/more-than-half-a-million-functional-skills-qualifications-taken-despite-pandemic/",
    "title": "More than half a million functional skills qualifications taken despite pandemic",
    "authors": [
        "Emma Scott"
    ],
    "categories": [
        "Coronavirus (COVID-19)",
        "Vocational and technical qualifications"
    ],
    "pub_date": "2021-07-30T13:30:35+01:00",
    "content": [
        {
            "text": "Awarding organisations, colleges, training providers, schools and employers have been working hard to offer functional skills assessments that are safe and convenient for learners throughout the pandemic. This is incredibly important for learners hoping to complete an apprenticeship or progress in their chosen careers. Functional skills qualifications provide evidence of a student’s achievements relevant to the workplace."
        },
        {
            "text": "Evidence shows that both traditional and remote assessments are taking place at an increasing rate as workplaces and training providers re-open. Since March, nearly 525,000 functional skills assessments have been completed through traditional face-to-face assessment. And since January, more than 50,000 functional skills assessments have taken place using remote invigilation."
        },
        {
            "text": "In some cases, learners have been offered face-to-face assessments, but have been unable to take them up. This may have been because they were shielding or isolating, or because they were anxious about potentially contracting COVID-19. Ofqual’s regulations enable awarding organisations to offer remote assessment and remote invigilation. The increased use of these methods has meant that many of these learners have been able to take assessments outside of an approved centre, such as at the learner’s home or an employer’s premises."
        },
        {
            "heading": 3,
            "text": "Apprentices completing programmes"
        },
        {
            "text": "Latest data also shows that many apprentices who were past their planned end date and needed to achieve a functional skills qualification have been able to complete their programmes. This is due to a combination of factors, such as flexibility introduced by ESFA allowing end-point assessments (EPA) to be taken before FSQ assessments, lockdown restrictions easing, greater use of remote invigilation, and collaboration by employers and providers to accommodate safe face-to-face assessments."
        },
        {
            "text": "When done well, remote assessment and remote invigilation allows learners to take a valid assessment which may otherwise have been delayed. We have seen some excellent examples of where both have been used, such as cameras controlled remotely by the assessor being used to observe practical assessments. More simple solutions – such as the use of web-based applications – avoids technical issues for learners who may otherwise have had to download software."
        },
        {
            "heading": 3,
            "text": "Providing support for learners"
        },
        {
            "text": "Many awarding organisations have been carrying out live, remote invigilation of functional skills maths, English reading and writing exams. Some, such as Skillsfirst, have found that this enables the invigilator to interact with learners and make the process more comfortable for them."
        },
        {
            "text": "Myra Wall, Chief Executive of Skillsfirst said: “There have been a couple of occasions where the invigilator can see the learner has been visibly anxious or upset and they have contacted the learner through the message box on the learner’s screen, encouraging them to take a deep breath, keep calm and to keep going.”"
        },
        {
            "text": "Awarding organisations are using a variety of ways to ensure that learners are familiar with systems before their assessment takes place, including pre-test checks either 24 or 48 hours before, to make sure the technology will work correctly on the day."
        },
        {
            "text": "Some awarding organisations, such as Highfield Qualifications, give learners the opportunity to have a 'practice run' of the on-screen remote assessment system, where they are shown the layout of the system and the features available. Pearson also offers on-screen practice tests and has a learner space on its remote invigilation webpage, which includes videos and FAQs to help them prepare."
        },
        {
            "text": "Future Quals offer what they call a ‘pre-flight’ video, which demonstrates the assessment platform. Learners can also access sample assessments, to help familiarise themselves with the platform."
        },
        {
            "text": "City and Guilds provide centre and candidate guidance documents and an audio deck that ‘walks through’ the test experience."
        },
        {
            "heading": 3,
            "text": "Assessing securely "
        },
        {
            "text": "Concerns about malpractice have also been tackled by awarding organisations. Learners can be asked to show the room in which they are taking the assessment beforehand. And they can be asked to hold photo ID in a specific space so that a photo of the learner with their ID can be taken and stored. Use of multiple cameras has also enabled awarding organisations to prevent learners being helped by third parties."
        },
        {
            "text": "Terry Bloor, Director of Centre Support and Compliance, from Highfield Qualifications said: “Our remotely invigilated examinations have proven popular and are monitored as they happen by Highfield invigilators who are well trained in identifying any irregularities in real time. For both on-screen and paper-based examinations we have maintained our high level of scrutiny and we are confident that all of our assessment options effectively serve to identify and mitigate risks or potential breaches of examination conditions.”"
        },
        {
            "text": "These flexibilities, adopted by awarding organisations in their approach to functional skills assessments, enabled many learners to progress without delay. And although teacher-assessed grades (TAGs) have been allowed for functional skills where no other assessment method was feasible, only a very small number – around 6,000 – have been issued so far."
        },
        {
            "text": "As lockdown restrictions have lifted, we anticipate that more learners will be able to take assessments at their school, college, training provider or workplace as well as remotely, and the need for alternative arrangements will decrease."
        },
        {
            "text": "To find out further information about these options please see the information on our website about awarding functional skills in 2021."
        },
        {
            "text": " "
        },
        {
            "text": "Emma Scott\nDirector of Operations, Vocational and Technical Qualifications"
        }
    ]
}