{
    "url": "https://prisonjobs.blog.gov.uk/2021/07/30/neurodiversity-and-the-criminal-justice-system/",
    "title": "Neurodiversity and the criminal justice system",
    "authors": [
        "Laura"
    ],
    "categories": [
        "Probation"
    ],
    "pub_date": "2021-07-30T10:26:49+01:00",
    "content": [
        {
            "text": "Neurodivergent individuals often struggle in unfamiliar environments, this is because their brain processes, functions and interprets information differently from a ‘neurotypical’ brain. So, the court setting, and the fact that the probation service become involved very quickly after they’ve been convicted of an offence can be very stressful for them."
        },
        {
            "text": "When I meet offenders for the first time, it is not always apparent if they have a neurodivergent condition such as Autism, ADHD, or dyslexia and they may require additional support. Although committing a crime is completely unacceptable, those with learning difficulties often offend due to their own vulnerabilities."
        },
        {
            "text": "I work in the local Crown Court where my role is to interview offenders and work with agencies such as social care, police and prison to gather all the information I need to complete a pre-sentence report. These reports provide information about the offence, how the offender feels about their actions, and their background which helps the judge to consider either a custodial sentence or a community sentence."
        },
        {
            "text": "The interviews help us to pick up on any speech or communication difficulties. We  then  quickly adapt our interview style by offering reassurance and making sure they understand the process. Our reports must be accurate, so it’s important we give them the support and help they need to give us the right information."
        },
        {
            "text": "Like many other services, the impact of coronavirus has meant we need to adapt even further. We have had to do the majority of our work remotely which means interviewing offenders over the phone and by video links. This has been challenging in regards to communicating and building up a trusting relationship for people to discuss sensitive issues. We are, however, able to do this by continuous communication including sending text messages to remind them of appointments."
        },
        {
            "text": "Meeting all kinds of people from all walks of life and hearing their stories is one of the best parts of my job."
        },
        {
            "text": "The role does require patience, determination and an ability to adapt to individual needs. It is good to feel like you are making a valuable contribution in the interests of justice for both victims and offenders by being involved at the very start of the sentencing process. If we don’t help address the needs of offenders and help them to rehabilitate then there will be more victims."
        },
        {
            "text": "…"
        },
        {
            "text": "Our prison and probation staff work hard to meet the needs of all offenders. Two prisons and a Probation Service Division has already been autism accredited by the National Autistic Society after an intensive inspection and hundreds of hours of specialist training. This includes:"
        },
        {
            "text": "Find out more about being a probation officer here."
        }
    ]
}