{
    "url": "https://space.blog.gov.uk/2021/07/30/new-regulations-mean-lift-off-for-uk-spaceflight/",
    "title": "New regulations mean lift-off for UK spaceflight",
    "authors": [
        "Ian Annett"
    ],
    "categories": [
        "LaunchUK",
        "Satellites",
        "Small Satellites"
    ],
    "pub_date": "2021-07-30T10:56:49+01:00",
    "content": [
        {
            "text": "Every sector, from planes to trains to automobiles, is governed by an evolving set of laws and regulations within which it can grow safely, create commercial opportunities for investors and deliver better public services while keeping the environment safe as technology advances."
        },
        {
            "text": "Space is no exception, and our growing commercial space sector - which provides essential services from defence and security, to monitoring traffic and keeping us connected, to helping us tackle climate change - also needs an effective regulatory framework within which it can fulfil its potential."
        },
        {
            "text": "As we ramp up our ambitions for the UK space industry, with the first satellite launches from home soil planned for 2022, the government has worked with the space sector and public bodies, including the Health and Safety Executive and the Air Accident Investigation Branch, to create the most modern and progressive spaceflight regulations in the world."
        },
        {
            "heading": 3,
            "text": "What are the regulations for?"
        },
        {
            "text": "Signed into law today (29 July), this legislation is underpinned by a focus on keeping the public safe, protecting the environment on Earth and in space, and safeguarding our national security. Instead of the detailed and prescriptive operating requirements traditionally used in aviation, operators of launches and spaceports will be required to demonstrate to the new space regulator, the UK Civil Aviation Authority, that any risks have been managed to as low as is reasonably practicable and to an acceptable level.  This will enable us to cater for a wide range of current and future spaceflight technology, with flexibility to support the pace of innovation safely."
        },
        {
            "text": "This approach will support the growth of a safe, sustainable and lucrative launch industry, as well as other related space industries, without imposing excessive bureaucratic or cost burdens.  We will ensure, for example, that insurance requirements for all missions are proportionate to the associated risk and are affordable, so that space companies are not deterred from doing business in the UK.  We have been clear with our partners in industry that no firm will face unlimited liability, and that we will keep the regulations under review so that they remain fit for purpose as we grow our space industry."
        },
        {
            "text": "The government has always been clear that spaceflight activities must not unduly impact the natural and built environment, and today’s spaceflight regulations will maintain this commitment. We will require launch operators and spaceports to complete an assessment of environmental effects of their proposed activities and if necessary, mitigate any risks. We will continue to develop and adapt our regulatory frameworks so they remain fit for purpose and can serve future generations well."
        },
        {
            "text": "Creating a fair and transparent framework within which our £16 billion domestic space industry, alongside the international space companies that will invest in the UK, can grow sustainably is good news for communities that need reassurance the new space age won’t come at a high cost to the places they love."
        },
        {
            "text": "It is good news for those parts of the UK, such as Sutherland, Shetland and Cornwall, who will benefit from the  high-value jobs and investment that the spaceflight industry will create. And it is good news for the UK’s global reputation as a country that is open for business, keen to push the boundaries of economic and scientific development, and focussed firmly on the future."
        }
    ]
}