{
    "url": "https://dcmslibraries.blog.gov.uk/2021/07/30/online-media-literacy-why-public-libraries-are-the-perfect-partners/",
    "title": "Online Media Literacy: why public libraries are the perfect partners",
    "authors": [
        "Olive Baring, Media Literacy Policy Adviser, DCMS"
    ],
    "categories": [
        "Digital",
        "Good practice"
    ],
    "pub_date": "2021-07-30T13:00:12+01:00",
    "content": [
        {
            "text": "On 14 July Caroline Dinenage, Minister for Digital and Culture, visited Battersea Public Library to launch the government’s Online Media Literacy Strategy which sets out our ambition to improve media literacy provision across the UK. We are delighted that the event took place in a public library as they are an integral and vital part of increasing media literacy skills. "
        },
        {
            "text": "While huge amounts of work are being done to develop legislation that will make online platforms safer for all users, it will never be possible to eradicate some harms entirely. Equipping citizens with media literacy skills is another vital way to ensure everyone is able get the most out of all the internet has to offer, whilst also making safe and informed decisions online. Understanding the media ecosystem, both online and offline, is a key part of life as a citizen in a 21st century democracy. "
        },
        {
            "text": "The theme of 'Rediscover Summer' this week is Reading and the act of settling into a good book and escaping to another world is a vital part of many peoples lives. But reading also equips us with other essential skills: it enables us to look at things from other perspectives, teaches us to check sources, question an author’s biases and critically assess information. These are all important media literacy competencies. By improving our powers of comprehension and analysis, reading enables us to identify misinformation and disinformation, recognise bias and spot satire."
        },
        {
            "text": "Libraries are a key part of the strategy because we hope they will become media literacy ‘hubs’ in the community. One of the initiatives set out in the Media Literacy Action Plan for 2021/22, is to upskill library staff and ensure they have the confidence to offer support to the people who use their services to build media literacy skills. This includes developing their resilience to misinformation and disinformation, understanding how to keep personal data safe online, and promoting positive interactions with others online. These are vital skills for all citizens. "
        },
        {
            "text": "During the development of the strategy, we spoke to a wide range of stakeholders – the UK has a rich and diverse media literacy sector with over 170 organisations active in this space. Despite this, media literacy levels remain low. "
        },
        {
            "text": "The primary objective of the strategy is to support the media literacy sector to have impact  in a more coordinated, wide reaching and effective way. We have identified six key challenges which have informed the 11 Strategic Sector Priorities that set out actions that sector organisations can take to address these challenges. "
        },
        {
            "text": "The strategy includes the first annual Media Literacy Action Plan which sets out the Government's actions. From an Online Media Literacy Portal, to working with tech companies to implement features that promote media literacy on their platforms, to supporting public service workers to deliver media literacy support to the people they work with, we are committed to ensuring that everyone has the skills and knowledge they need to stay safe and thrive online. "
        },
        {
            "text": "We are pleased to have been able to highlight the role of public libraries in relation to this agenda, and to provide funding to Libraries Connected to develop and roll out a training module on information literacy for frontline staff. This initiative will enable libraries to increase the support they already provide to the public with information literacy skills and knowledge. We are excited about working closely with public libraries across England as key partners in driving this agenda forward. "
        }
    ]
}