{
    "url": "https://competitionandmarkets.blog.gov.uk/2019/09/06/how-the-cma-investigates-cartels/",
    "title": "How the CMA investigates cartels",
    "authors": [
        "Ashley Wakeman"
    ],
    "categories": [
        "Competition Act 1998 and cartels"
    ],
    "pub_date": "2019-09-06T12:11:20+01:00",
    "content": [
        {
            "text": "As a principal investigation officer at the CMA, I work to investigate illegal cartel activity. Those involved in cartels will often go to great lengths to ensure they go undetected. Therefore, we have a number of tools at our disposal to expose them, such as gathering covert intelligence or turning up at company offices to search them unannounced."
        },
        {
            "text": "In this blog, I’ll provide some insight into this key area of our work by discussing some of the different stages of an investigation. I’ll also explore the types of things we might need to consider and act upon along the way."
        },
        {
            "heading": 2,
            "text": "The start of an investigation"
        },
        {
            "text": "There are several ways we can be alerted to suspicious activity. This can happen from our own intelligence gathering activities, an anonymous tip-off or companies or individuals applying for leniency."
        },
        {
            "text": "It’s worth noting that in the case of a tip-off from a whistle-blower who wishes to remain anonymous, those investigating the case will not meet the person or know who they are. Instead, the person will interact with specially trained officers from the CMA’s intelligence team who are independent of the case team and will ensure that the identity of the whistle-blower is kept confidential. We will not be able to rely on what the whistle-blower has told us in any enforcement action. Whatever they tell us will help us to know where to look for evidence, but the case team will have to find this for themselves as part of their investigation."
        },
        {
            "text": "If the information has come from a leniency applicant we’ll also want to gather evidence for ourselves, but we will not treat the applicant as an anonymous intelligence source. The identity of the applicant will be known to the case team and, as a condition of their leniency, the applicant can be asked to provide evidence, including by acting as a witness."
        },
        {
            "text": "In each case we’ll have to decide on a strategy that considers the following:"
        },
        {
            "text": "If we do decide to launch a formal investigation, one of the main tasks will be preparing for and using our formal investigation powers. Let’s take a closer look at what those powers are."
        },
        {
            "heading": 2,
            "text": "Getting underway"
        },
        {
            "text": "As the CMA, we have a number of investigatory tools at our disposal. We can:"
        },
        {
            "text": "We may do some or all these things during an investigation."
        },
        {
            "text": "This can result in an awful lot of material that needs processing and reviewing. One way our teams overcome this challenge is through the use of sophisticated review software and techniques. Digital evidence review software can help us trawl through thousands of documents, identifying crucial bits of evidence, key people and any gaps in the evidence. Other investigative steps will arise from the evidence review, which may include conducting further interviews, gathering more evidence and possibly additional site visits."
        },
        {
            "heading": 2,
            "text": "Reaching the right result"
        },
        {
            "text": "If we’re confident we have enough evidence to prove illegal activity has taken place, we’ll send the businesses involved a Statement of Objections. This is a document which outlines the CMA’s initial findings in the cartel investigation and gives the parties an opportunity to reply. After this, the case may proceed to a final published CMA decision."
        },
        {
            "text": "In criminal cases, we will also carry out an assessment on whether there are sufficient grounds for any individual to be charged and prosecuted. If prosecuted, individuals have a chance to respond to the allegations, and then the case will go to a criminal trial at the Crown Court."
        },
        {
            "text": "We can also apply to the court for the directors of companies guilty of cartel behaviour to be disqualified from acting as company directors for up to 15 years."
        },
        {
            "text": "A recent example of our enforcement activity is a case we completed in the office fit-out sector. We investigated six companies engaged in illegal bid-rigging, resulting in fines of over £7 million. On the back of this, we acted swiftly to disqualify 6 directors for periods of between 18 months and 5 years."
        },
        {
            "heading": 2,
            "text": "Moving forward"
        },
        {
            "text": "We won’t hesitate to use the tools and powers at our disposal to ensure that cartels are uncovered and tackled wherever they appear."
        },
        {
            "text": "We’ve also made it easier to report suspected cartel activity. Read our blog on what to expect when you report a cartel or visit our 'Cheating or Competing?' website for information on how to spot cartels."
        }
    ]
}