{
    "url": "https://dwpdigital.blog.gov.uk/2023/06/07/celebrating-our-unsung-hero-nominee/",
    "title": "Celebrating our unsung hero",
    "authors": [
        "DWP Digital"
    ],
    "categories": [
        "Digital With Purpose",
        "Volunteering/Community",
        "Volunteers Week"
    ],
    "pub_date": "2023-06-07T09:24:35+01:00",
    "content": [
        {
            "text": "Vitalij is a backup engineer within our Hybrid Cloud Services Team. He was recently recognised for the outstanding volunteering work he did helping people fleeing the Ukrainian war. This work led him to be nominated for a DWP Unsung Hero Award."
        },
        {
            "heading": 2,
            "text": "Investing in my career "
        },
        {
            "text": "I’ve worked in IT for over 12 years, starting as an apprentice at Hewlett Packard before joining DWP Digital.  "
        },
        {
            "text": "My current role involves migrating backups from IBM Spectrum Protect to Rubrik, our strategic backup solution. We have daily stand-up calls where we discuss any issues, share information, and then document fixes. My role is never boring, and there’s always something new to learn. "
        },
        {
            "text": "In my role I have plenty of opportunities to build my expertise and gain skills on a range of new systems such as AWS and Azure.  I have the ability to learn, grow and develop thanks to the support of those around me. "
        },
        {
            "text": "DWP Digital is investing in my career and helping me progress. "
        },
        {
            "heading": 2,
            "text": "Making a difference through volunteering "
        },
        {
            "text": "Last year, the Home Office were looking for volunteers to work at the Visa Application Centre in Poland to help those in need flee the Ukraine war and find refuge in the UK. Being a Russian speaker, who understands Ukrainian, this was close to my heart. I wanted to do all I could to help and I knew my employer would support me. "
        },
        {
            "text": "DWP Digital encourages volunteering by allowing us to take up to three days a year as paid volunteering leave. My line manager and team gave me their full support, so I was temporarily released from my role. Not all employers are so flexible, so I’m grateful I was given this opportunity.  "
        },
        {
            "heading": 2,
            "text": "Being on the front-line  "
        },
        {
            "text": "Before being deployed I did some local volunteering providing humanitarian aid, advice and guidance on how the visa application process worked. I worked with a Ukrainian charity to help deliver pickup trucks for Ukrainian armed forces."
        },
        {
            "text": "I then spent time in the Visa Application Centres. At the centre I helped applicants complete the paperwork needed to enter the UK.  "
        },
        {
            "text": "Understandably the first few days were very busy at the centre and we did all we could to help those in need. I began to identify the ways that I could help and started building solutions based on feedback from my colleagues. I created an information letter which was translated into Russian and Ukrainian to help claimants understand the process. I also created various templates to capture data, and I helped to streamline our processes. This is where my work experience came in very handy.  "
        },
        {
            "text": "I always met people with a friendly smile, and sweets to give out to all the sad faces I saw, even after a gruelling 12-hour daily shift. My work on this led to my nomination for the Unsung Hero Award. "
        },
        {
            "heading": 2,
            "text": "Full training and Support  "
        },
        {
            "text": "I was asked to complete the Level 2 Personal Safety Training course, and we were offered counselling from DWP’s wellbeing service when on-site. It was a relief to know we were being looked after by our employer. It helped us get through the long hours and sad emotions upon hearing all the heart-wrenching stories of people fleeing their homes. "
        },
        {
            "heading": 2,
            "text": "Proud to be a Civil Servant  "
        },
        {
            "text": "Becoming a Civil Servant was one of the proudest moments of my life, and being able to help people while working makes it even more rewarding.  "
        }
    ]
}