{
    "url": "https://foresightprojects.blog.gov.uk/2023/06/07/ensuring-everyone-has-a-voice-in-imaging-the-future/",
    "title": "Ensuring everyone has a voice in imaging the Future",
    "authors": [
        "mikeaskew"
    ],
    "categories": [
        "Futures Capability & Resource",
        "Methodologies",
        "Outreach"
    ],
    "pub_date": "2023-06-07T16:27:22+01:00",
    "content": [
        {
            "heading": 6,
            "text": "by Sara Elias and Professor Genevieve Liveley"
        },
        {
            "text": "For Public Health Wales and the Office for the Future Generations Commissioner for Wales, creating a More Equal Wales is a key, national goal. But how do we ensure that decision-makers are able to take into account the needs, hopes and fears of some of our least heard communities when thinking and planning the future scenarios we need to help us achieve this goal? In our report Inequality in a Future Wales we called for new ways of working which could take us towards a more equal Wales, and avoid taking decisions which could inadvertently exacerbate inequality in vulnerable communities. But what would this way of working look like?"
        },
        {
            "text": "Over the past year we have worked with a group of academics called FLiNT (Futures Literacy Through Narrative) on a project which highlights how we can better involve communities in our futures work. The Communities and Climate Change in a Future Wales project had a dual function: to provide useful insight on a topic which affects all public bodies in Wales and beyond, and to provide detailed methodological insight and resources which would inspire and support other bodies to conduct their own participatory futures work."
        },
        {
            "text": "Led by FLiNT, a project was developed which utilised character-led storytelling as a narrative method which empowered community members to build and explore future scenarios (or worlds). This accessible method was implemented using:"
        },
        {
            "text": "These narrative methods gave participants a familiar way to explore unfamiliar territory, and a safe space where assumptions and sometimes conflict could be projected and explored through characters who interacted within the future world that the participants co-designed. More information about the role of narratives in developing futures literacy can be found here."
        },
        {
            "text": "The outputs for this project include:"
        },
        {
            "text": "With additional funding from University of Liverpool we have also produced a short animation to introduce the concept of Futures Literacy and to highlights the methods we used and why."
        },
        {
            "text": "For more information on this work, please contact Sara Elias (sara.elias2@wales.nhs.uk),  Professor Genevieve Liveley (G.Liveley@bristol.ac.uk) or Dr. Will Slocombe (wsg@liverpool.ac.uk)"
        }
    ]
}