{
    "url": "https://civilservice.blog.gov.uk/2023/06/07/how-good-content-design-makes-it-easier-to-move-jobs-across-government/",
    "title": "How good content design makes it easier to move jobs across government",
    "authors": [
        "Chris Spencer"
    ],
    "categories": [
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Ambitious Civil Service",
        "Uncategorized"
    ],
    "pub_date": "2023-06-07T14:31:21+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Chris Spencer, Content Designer, Government People Group, shares how his team used informed content design to make it easier for civil servants to move departments. "
        },
        {
            "text": "Approximately 24,000 civil servants transfer between government departments every year. However, the current process is largely manual. User satisfaction is quite low and it often takes longer than it should for a civil servant to complete their transfer. Ineffective guidance contributes to low user satisfaction and it’s one of the reasons a transfer takes so long. "
        },
        {
            "text": "Work is underway to digitise the staff transfer process. This will make it easier for the Civil Service to have the right people in the right places at the right time to deliver for citizens. In the meantime, the Cabinet Office Staff Transfers team looked at how content design could improve the current experience for civil servants."
        },
        {
            "heading": 4,
            "text": "Good content design helps everyone"
        },
        {
            "text": "Nearly one in four people look at GOV.UK every week. Users rely on it to find detailed information and guidance on a range of government services."
        },
        {
            "text": "When designed correctly, guidance should:"
        },
        {
            "text": "This doesn’t happen by magic. Good content relies on user research and analytics to find out exactly what users need to know, not what we might want to tell them. "
        },
        {
            "text": "Without expert content design, even if content is created with best intentions to meet user needs, there may be problems when trying to engage a range of diverse users."
        },
        {
            "heading": 4,
            "text": "Challenges with the previous staff transfers guidance"
        },
        {
            "text": "Feedback from users told us that the previous guidance was not as helpful as expected. It was:"
        },
        {
            "text": "These problems meant users:"
        },
        {
            "heading": 4,
            "text": "What we did to improve the guidance"
        },
        {
            "text": "Research shows that even higher literacy people prefer plain English. It allows them to understand the information as quickly as possible."
        },
        {
            "text": "In the context of guidance, simpler really is better. And making the staff transfer guidance easier to understand would result in fewer errors and a quicker process. "
        },
        {
            "text": "Working with users and HR experts, we reviewed and rewrote the guidance. We identified complex text and replaced it to:"
        },
        {
            "text": "This helped us remove almost 3,000 words while also making it clearer."
        },
        {
            "text": "We also developed an improved step-by-step guide which helps users find the information they need faster."
        },
        {
            "heading": 4,
            "text": "Putting it to the test "
        },
        {
            "text": "We tested several versions of the new content with a range of users from across the Civil Service to assess:"
        },
        {
            "text": "This was to make sure the designs met the needs of the people who use it."
        },
        {
            "text": "Through testing, we found that when we presented with a link to the form early in the guidance, some users did not read on. They missed valuable information, instead opting to just fill in the form. By moving the link to later in the guidance, we discouraged users from skipping information that will help them transfer."
        },
        {
            "text": "We were also able to use the guidance to address common misunderstandings that came up in testing. For example, employees do not need to resign when transferring because they are not leaving the Civil Service. "
        },
        {
            "heading": 4,
            "text": "Positive improvements "
        },
        {
            "text": "Since launching the improved guidance, we have seen: "
        },
        {
            "heading": 4,
            "text": "Where to find the new guidance  "
        },
        {
            "text": "The new and improved guidance and staff transfer form are available on the GOV.UK staff transfer webpage."
        },
        {
            "text": "These updates improve the existing transfer experience before the digital service launches in autumn 2023."
        },
        {
            "text": "Look out for more blogs where we will share future updates."
        }
    ]
}