{
    "url": "https://lifeathmrc.blog.gov.uk/2023/06/07/jacks-role-on-the-prism-lgbt-network-at-hmrc/",
    "title": "Jack’s role on the PRISM LGBT+ Network at HMRC",
    "authors": [
        "Jack"
    ],
    "categories": [
        "Diversity and inclusion",
        "Employee support"
    ],
    "pub_date": "2023-06-07T08:40:22+00:00",
    "content": [
        {
            "text": "Alongside his role as a Data Utilisation Lead, Jack is a member of our PRISM LGBT+ network which offers support, raises awareness and helps make HMRC a truly inclusive place to work. We caught up with Jack to find out more about some of the great work that he, and the network do across HMRC."
        },
        {
            "heading": 2,
            "text": "About me  "
        },
        {
            "text": "Hi, my name is Jack (he/him), I'm a gay man and I am a Data Utilisation Project Lead at HMRC. "
        },
        {
            "text": " Outside of work, you're likely to find me either: "
        },
        {
            "heading": 2,
            "text": "My role on the PRISM Network "
        },
        {
            "text": "I have been part of the steering group of the PRISM staff network at HMRC since February 2020 which is a support and consultation community to discuss LGBT+ issues, raise awareness and encourage all to play an active role in helping HMRC to be a fully inclusive organisation. The network provides me with a safe space, and I feel as though I'm amongst a group of friends rather than work colleagues. "
        },
        {
            "text": "Since joining the network, I have helped deliver several sessions and events, including a body positivity and wellness event and regular ‘ask our steering group’ sessions, which gives colleagues the opportunity to ask questions, share ideas or raise any issues or concerns they might have. "
        },
        {
            "text": "Being part of delivering those sessions and events has helped me grow and develop in myself and my confidence – and this is thanks to PRISM. There's a real sense of community within the network, but we still have work to do to continue to raise awareness and make the workplace a safe space for all. "
        },
        {
            "text": "I'd also like to be more proactive and involved with LGBT+ causes and events outside of work, but it can be hard to find the time with other responsibilities to juggle. However, I hope that by improving my own awareness of LGBT+ issues and successes through the PRISM network, I can use my learnings to help myself and others, which will make it all the worthwhile. "
        },
        {
            "text": "I am looking forward to what is to come for the network and how we can all continue to make the workplace inviting and safe for all. "
        },
        {
            "heading": 2,
            "text": "What have I learned? "
        },
        {
            "text": "During the LGBT+ Civil Service Conference in October 2022, I learnt a real and genuine piece of advice – it is human nature to make assumptions on others, no matter how hard we try not to. You cannot prevent this, let people make their assumptions. The only thing you can control in this, is how you continue to be yourself and how you behave and interact with others that determines whether or not their assumption of you changes. If you’ve been genuine and yourself, not much more can be asked of you. "
        },
        {
            "heading": 2,
            "text": "Find out more "
        },
        {
            "text": "Visit the HMRC Careers Site to find out more about our culture and values at HMRC. "
        }
    ]
}