{
    "url": "https://teaching.blog.gov.uk/2023/06/07/optimise-the-benefits-of-the-national-tutoring-programme-ntp/",
    "title": "Optimise the benefits of the National Tutoring Programme (NTP)",
    "authors": [
        "Jody Clarke"
    ],
    "categories": [
        "School funding",
        "Secondary schools",
        "Teachers' reflections"
    ],
    "pub_date": "2023-06-07T10:41:21+01:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "Jody Clarke is the deputy headteacher of Wood Green Academy, a secondary school in Wednesbury in the West Midlands. He shares advice for schools on optimising the benefits of tutoring by using a combination of school-led tutoring and academic mentors."
        },
        {
            "text": "We started using the National Tutoring Programme (NTP) in Spring 2021 to provide tutoring, primarily online, to pupils during the pandemic. We prioritised year 10 pupils who were eligible for pupil premium and provided tutoring in GCSE English language and maths. Since then, our tutoring model has evolved to use different tutoring routes. In the current academic year, we’re delivering school-led tutoring and have employed an academic mentor to focus on raising attainment in reading and literacy of pupils in key stage 3. In total, 325 pupils have started tutoring courses."
        },
        {
            "text": "Impact of tutoring "
        },
        {
            "text": "The combination of school-led tutoring and academic mentors has had a positive impact on academic attainment and increased pupil confidence. In the 2021 to 2022 academic year, the first full academic year of providing tutoring via the NTP, 93% of our pupils who received tutoring confirmed that they would recommend tutoring to others. Most pupils felt that the support was helping them to make progress in their targeted subject areas."
        },
        {
            "text": "Our own analysis verified that the majority of tutored pupils made greater improvements between exam predictions at the start of the year and final grades, in comparison to students not involved in the programme. In some subjects, pupils who were tutored improved by almost a full grade."
        },
        {
            "text": "Advice to schools"
        },
        {
            "text": "We strongly encourage schools to use an academic mentor. Our academic mentor works with students both within class and in small groups. Pupils receive intensive support and get the opportunity to ask questions, which helps develop their knowledge and understanding that may be missed during the busy environment of a lesson. The strong relationship the academic mentor has with the students helps them build confidence and enjoy the subject."
        },
        {
            "text": "Our experienced staff have guided the academic mentor as they adopt the most effective ways to support students’ needs. Before we introduced the NTP, we already had a set of academic coaches who worked with students to accelerate their academic progress. As such, we were well equipped to embed the academic mentor into our team of coaches, allowing our current staff to upskill them on the methods that work well to support students’ progress and attainment at Wood Green Academy."
        },
        {
            "text": "We recommend the academic mentor route to help schools make the most of their NTP funding. For our school, it has been the most cost-effective method of broadening the reach of tuition."
        },
        {
            "text": "We also highly recommend combining the school-led tutoring route. At Wood Green Academy, we are confident in our teaching staff’s ability to deliver high-quality tuition. We have full control of the tuition that is delivered to our students, ensuring high-quality teaching is delivered in a safe, secure and familiar setting. We have also been able to offer greater flexibility to both students and staff, offering the option to participate during both term-time and school holidays. In turn, this flexibility has meant more students and staff are participating in the programme."
        },
        {
            "text": "Use data to select the right pupils for tutoring, to assess pupil engagement and to measure impact. We have a rigorous internal data infrastructure. We are extremely confident in our ability to accurately identify the priority areas for all our students. Pupil engagement is key to the success of our tutoring programme. For this reason, we seek feedback from pupils on their perception of the helpfulness of tuition. It’s also important to keep track of the impact that tutoring is making on their academic attainment."
        },
        {
            "text": "For more information on the National Tutoring Programme:"
        }
    ]
}