{
    "url": "https://environmentagency.blog.gov.uk/2023/06/07/working-with-dorset-farmers-to-become-some-of-the-most-nitrogen-efficient-in-the-uk/",
    "title": "Working with Dorset farmers to become some of the most nitrogen efficient in the UK",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Environment Agency"
    ],
    "pub_date": "2023-06-07T10:09:38+00:00",
    "content": [
        {
            "text": "The Environment Agency has been working with the local farming community on a unique and innovative nutrient cap-and-trading scheme to address nitrate water pollution from farmers in Poole Harbour."
        },
        {
            "text": "The Poole Harbour Agricultural Group has been established as a Community Interest Company (CIC) and is the first of its kind. Designed and managed by farmers, not only does the scheme help with their environmental responsibilities but importantly it makes financial sense to farm businesses."
        },
        {
            "text": "Poole Harbour in Dorset, one of the world’s largest natural harbours, is a wonderful tourist destination and its wetlands are designated of international importance and a European Marine Site. However, the wildlife, ecosystems and habitats that underpin why we value places like this so much are vulnerable to change and easily disturbed by increased nutrients. Nutrients such as nitrates are flowing through the catchment and into the harbour leading to the rapid growth of algae which smothers the estuarine habitat and reduces the amount of food available for birds."
        },
        {
            "text": "Since the scheme was launched at the end of 2022, 200 farmers covering an incredible c45,000 hectares of land (making up around 72% of the agricultural land across the Poole catchment) have become members of this new CIC."
        },
        {
            "text": "The nutrient trading scheme is in addition to the existing regulation in Poole Harbour and the Environment Agency is continuing its routine farm inspections."
        },
        {
            "text": "How the scheme works"
        },
        {
            "text": "As the environmental regulator we have set an annual gradual reduction in nitrate emissions over time and some wider rules that members of this scheme must meet. This glidepath down reduces to the agreed final target by 2030. Each year farmers will use a Nitrate Leaching Tool (NLT) to calculate their annual emissions and plan how they will meet the following year’s target. Farmers can then trade excess amounts or buy required credits from their neighbours to achieve their emission limit for that year. This helps farmers adapt their businesses at their own pace and in their own ways, places environmental considerations at the heart of business decision making and creates a commercial incentive to drive reductions through placing a value on nitrogen."
        },
        {
            "text": "Development Manager for the Poole Harbour Agricultural Group, Louise Stratton, said that the scheme enables farmers to manage their businesses. “This partnership with the EA has created an innovative and modern regulatory approach to addressing our shared goals in ways that work for all of us,” she said. “As an agricultural group we are on a journey to becoming the most nitrogen efficient farmers in the UK.”"
        },
        {
            "text": "The project became a pilot for the Environment Agency and Defra’s Natural Environment Investment Readiness Fund, which aims to demonstrate the viability of innovative nature recovery funding models – known as green finance that address environmental problems such as water quality improvements. We can only create truly sustainable approaches if the environmental and financial benefits align. It takes time to improve the environment but by adopting approaches like this we can start on the journey to make those improvements now."
        },
        {
            "text": "By Andy Slaney, Environment Agency, 19th May 2023"
        }
    ]
}