{
    "url": "https://defradigital.blog.gov.uk/2023/06/07/work-that-touches-everyone-being-a-user-researcher-at-defra/",
    "title": "Work that touches everyone: being a user researcher at Defra",
    "authors": [
        "Clare Hussey"
    ],
    "categories": [
        "User centred design",
        "User research"
    ],
    "pub_date": "2023-06-07T08:21:55+01:00",
    "content": [
        {
            "text": "Senior User Researcher Clare Hussey reflects on why she loves her work, and why she feels compelled to stay at Defra."
        },
        {
            "text": "Imagine working on something that touches every single person. That’s how I think about my work as a user researcher on Extended Producer Responsibility (EPR)  - basically about the future of how we as a nation deal with waste."
        },
        {
            "text": "I’ve always been driven to make things better for people in a constructive way. Before I was a civil servant, I spent a decade working in the area of textile and clothing sustainability. I recently told the participants in some workshops I was running: “you’re lucky to have me: I’m interested in waste, I’m interested in the work that you do, and I’m interested in making things better”."
        },
        {
            "heading": 2,
            "text": "Don’t just take my word for it though"
        },
        {
            "text": "A number of my user research colleagues, who are as passionate as me about our work, have also written about their experiences working in Defra in recent months. Fran Redman shared her 'Day in the Life of a User Researcher in Defra' story, which explains what we do, why it interests her and the kinds of projects she has worked on."
        },
        {
            "text": "In her 'User Research – what’s it all about?' blog, Amy Dyde explains how user researchers support the implementation of Government policy."
        },
        {
            "text": "More recently, Jason Stockwell explained why we have user research panels, and how these are managed for large projects and programmes. Jason also highlighted more recently what he’s learned about panel management in a growing research team and, in particular, the constant challenge of trying to recruit participants to research panels."
        },
        {
            "text": "I myself have written about my own experiences of having a neurodivergent condition and how, as a civil servant, I’ve been able to use my skills as a user researcher in championing work on neurodiversity. All these personal stories offer further insight into our user research world here in Defra, so do give them a look."
        },
        {
            "heading": 2,
            "text": "Come for the mission…"
        },
        {
            "text": "While not all of my colleagues are quite as much of a sustainability nerd as I am, I’ve noticed that a lot of them are passionate about making positive changes to the environment. Some of my colleagues have moved from the private sector to Defra to be part of this mission."
        },
        {
            "text": "There’s a lot of important work happening right now. Defra stands for the ‘Department for Environment, Food & Rural Affairs’, and that means that the range of projects are vast.  While some projects are, like EPR, very broad (another big programme of work is Future Farming), others are very focused (flooding, animal health, even cow slurry)."
        },
        {
            "text": "It’s exciting to see more opportunities to be involved in Defra outside of London. I’m based in the Newcastle hub, which opened in April 2022. The hubs are also for all Defra colleagues (rather than just for some roles), which makes it easier to collaborate on policy as well as delivery."
        },
        {
            "heading": 2,
            "text": "…stay for the communities"
        },
        {
            "text": "I don’t just consider myself a user researcher, I think of myself as a civil servant, and through that, part of Defra and its user-centred design (UCD) community."
        },
        {
            "text": "The Defra UCD community is now over 100 people, and we have regular quarterly meetups, even bringing in external speakers. One of the recent speakers was the former head of user research at the Government Digital Service (GDS), Leisa Rechelt."
        },
        {
            "text": "Joining Defra also means becoming part of a wider cross-government UCD community. If you’re keen to progress, there’s a lot of chances for training and courses targeted for user research. There are also opportunities to apply for leadership programmes, even apprenticeships."
        },
        {
            "text": "When it comes to the wider Defra organisation, I love that Defra’s leadership is very visible and accessible. I’ve been able to use programme-level calls to ask Director Generals questions relating to my work and feel confident that I am supported."
        },
        {
            "text": "Finally, I’m able to be part of wider initiatives to improve the civil service. I’m incredibly proud to be co-chair of the Defra group neurodiversity network, a staff network for supporting around 34,000 people across Defra and 34 agencies and arm's length bodies."
        },
        {
            "text": "My volunteer efforts also feed into my work as part of the Civil Service Dyslexia and Dyspraxia Network (CSDDN). Defra Digital Data and Technology Services also has monthly ‘Equality, Diversity and Inclusion’ huddles, where a Director goes to each hub and they sit down with colleagues for a discussion."
        }
    ]
}