{
    "url": "https://deframedia.blog.gov.uk/2021/06/07/public-urged-to-plant-for-our-planet-and-8m-announced-for-international-conservation-projects/",
    "title": "Public urged to Plant For Our Planet and £8m announced for international conservation projects",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Weekly stories"
    ],
    "pub_date": "2021-06-07T12:23:31+01:00",
    "content": [
        {
            "text": "There is widespread positive coverage of the Government’s ‘Plant for Our Planet’ campaign launched on World Environment Day (Saturday 5 June). The campaign is aimed at encouraging people, businesses and communities to get planting and protect nature through green actions ahead of the environmental summit COP26. It is supported by green organisations including, the National Trust, Woodland Trust, The Wildlife Trusts, Wildlife and Countryside Link, Horticultural Trades Association and the Royal Horticultural Society."
        },
        {
            "text": "The Daily Telegraph, Daily Mirror, Daily Express, The I and Good Housekeeping covered the launch, highlighting the aims of the campaign and recommending activities for people to get involved in – from planting flowers or pollinators, building insect hotels and letting lawns grow, to joining existing nature projects. Coverage also reported that those taking part are encouraged to nominate their “nature heroes” and share their #PlantForOurPlanet activities on social media."
        },
        {
            "text": "Environment Minister Rebecca Pow was interviewed by Garden News and for BBC Radio London where she urged that everyone can play a part in helping to protect and enhance our natural environment, and stressed that community spirit is particularly important as we build back greener from the pandemic."
        },
        {
            "text": "Speaking on a campaign launch visit to ‘Walthamstow Village in Bloom’ a community planting group in East London, Environment Minister Rebecca Pow said:"
        },
        {
            "text": "Also on Saturday 5 June, over £8 million new funding from the Darwin Plus Programme was announced to protect rare wildlife and vulnerable habitats across the globe. International Environment Minister Lord Goldsmith was featured on Sky News, and a spokesperson from RSPB was interviewed for the BBC Radio 4 Today Programme. The story was also covered on the Daily Express and Business Green."
        },
        {
            "text": "International Environment Minister Lord Goldsmith said:"
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}