{
    "url": "https://deframedia.blog.gov.uk/2017/12/15/friday-15-december-minister-coffey-visits-cumbria-and-raptor-persecution-maps/",
    "title": "Friday 15 December: Minister Coffey visits Cumbria and raptor persecution maps",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Weekly stories"
    ],
    "pub_date": "2017-12-15T14:17:34+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Minister Coffey: ‘We will better protect Cumbria from flooding’"
        },
        {
            "text": "Minister Coffey visited Cumbria today to reaffirm the government’s commitment to better protecting Cumbria from flooding."
        },
        {
            "text": "The Minister was interviewed live by BBC Radio Cumbria this morning, where she announced that on top of the £72 million being invested across Cumbria the county has been allocated an extra half a million from the recent Budget to provide further protection against flooding."
        },
        {
            "text": "The Minister was also interviewed by the local Carlisle paper the News and Star and the copy carries Minister Coffey’s assurances that work to build new £25 million flood defences will begin next year - reducing flood risk to 1,667 properties in the city."
        },
        {
            "text": "Whilst in Carlisle, the Minister visited the revived Botcherby community centre to see how far the community has come since Storm Desmond and she met with local residents who felt the full force of the floods, to hear about their experiences and needs."
        },
        {
            "text": "The Environment Agency (EA) is leading ongoing work across Cumbria in collaboration with local council and community flood groups and EA Chair Emma Howard Boyd accompanied the Minister on her visit."
        },
        {
            "text": "The Westmorland Gazette, the Cumberland and Westmorland Herald, ITV Border and That’s Cumbria also interviewed the Minister while she was in Cumbria, and further coverage is expected to run later today."
        },
        {
            "text": "Floods Minister Thérèse Coffey said:"
        },
        {
            "text": "Prior to her visit to Carlisle, Minister Coffey visited the Lowther Estate to meet the owner and plant one of the 213,000 trees that be put into the ground over 170 hectares of the estate this winter."
        },
        {
            "text": "Thanks to government funding, the recently-approved large-scale tree planting scheme will be one of the most productive woodland creation sites in England for more than 25 years."
        },
        {
            "text": "The project is being funded through the Countryside Stewardship Woodland Creation Grant scheme, which opens again for new applications on Tuesday 2 January 2018."
        },
        {
            "heading": 2,
            "text": "New raptor persecution maps to help tackle wildlife crime"
        },
        {
            "text": "Raptor persecution maps for England and Wales have been published to enable the police to clearly see where the highest incidents are taking place and focus enforcement efforts in the areas that need it most."
        },
        {
            "text": "The maps present the number of shootings, trappings, poisonings and nest destructions that took place across England & Wales between 2011 and 2015 and will be updated annually, providing an invaluable intelligence tool to help fight crimes again birds of prey."
        },
        {
            "text": "North Yorkshire will be a priority area as the most incidents occurred there (39), followed by Norfolk (17), Cumbria (11), Derbyshire (11), Lincolnshire (10), Suffolk (8) and Northumberland (8)."
        },
        {
            "text": "There are already strong penalties in place for committing offences against birds of prey and the unlawful use of traps and all wild birds are protected under the Wildlife and Countryside Act 1981."
        },
        {
            "text": "The Government takes all wildlife crime very seriously and raptor persecution has been identified as a UK wildlife crime priority. Each priority has a delivery group to consider what action should be taken, develop a plan to prevent crime, gather intelligence on offences and enforce against it."
        },
        {
            "text": "This has been covered by the Times, the Northern Echo and the Yorkshire Post."
        },
        {
            "text": "For further details, read the full news story here."
        },
        {
            "text": "Wildlife Minister Thérèse Coffey said:"
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Abstraction reform: further moves made towards Green Brexit"
        },
        {
            "text": "The government has published a new plan to reform abstraction management - to protect the environment while improving access to water where it is needed most."
        },
        {
            "text": "Access to clean and safe water supplies is essential for people and the environment, however increasing demand for water is putting pressure on supplies."
        },
        {
            "text": "Latest data shows that five per cent of surface water bodies and 15 per cent of groundwater bodies are at risk from increasing water use by current abstraction licence holders that could damage the environment."
        },
        {
            "text": "Today’s new abstraction reform plan will improve better access to water by:"
        },
        {
            "text": "This has so far been covered by the Horticulture Times, the Water Briefing and the East Anglia Daily Times."
        },
        {
            "text": "Read the full story here."
        },
        {
            "text": "Environment Minister, Thérèse Coffey said:"
        }
    ]
}