{
    "url": "https://digitaltrade.blog.gov.uk/2025/04/22/dbts-machinery-of-government-an-insight-into-the-teams-behind-the-single-it-platform-migration-project-part-2/",
    "title": "DBT's Machinery of Government: an insight into the teams behind the Single IT Platform migration project (part 2)",
    "authors": [
        "Imogen Barker, Senior Engagement and Strategic Adoption Officer",
        "Charlotte Saxby, Engagement Manager",
        "Miriam Wheeler, Business Change Manager"
    ],
    "categories": [
        "People"
    ],
    "pub_date": "2025-04-22T10:00:49+01:00",
    "content": [
        {
            "text": "Welcome to part 2 of our Machinery of Government (MoG) blog. This series explores one of the biggest digital MoG migration programmes in government.  We migrated almost 2,000 colleagues onto the Department for Business and Trade’s (DBT) Single IT Platform."
        },
        {
            "text": "Read the MoG blog part 1 which discusses some of the technical workstreams on this migration programme. In part 2 we hear from a different workstream; the Change, Communication and Engagement (CCE) team. CCE played a crucial role in ensuring the success of the programme, helping colleagues navigate their digital migration into DBT and adapt to the changes brought with it.   "
        },
        {
            "text": "While 2 blog posts cannot do the hard work of this migration programme full justice, we are trying to capture some of the incredible work that has gone into it. Hopefully this can help others working on future MoGs or large change programmes, and showcases the breadth of work that colleagues across Digital, Data and Technology (DDaT) do."
        },
        {
            "heading": 2,
            "text": "Change Communication and Engagement"
        },
        {
            "heading": 3,
            "text": "Miriam Wheeler"
        },
        {
            "heading": 3,
            "text": "Imogen Barker"
        },
        {
            "heading": 3,
            "text": "Charlotte Saxby"
        },
        {
            "text": "The Change, Communication and Engagement workstream was made up of colleagues from the DBT Project, Delivery and Change, and DDaT directorates. We have expertise in working on change projects, colleague engagement, communications, User Research and Content Design."
        },
        {
            "text": "The CCE workstream has been vital in bridging the gap between the programme team and colleagues undergoing their migration onto the DBT Single IT Platform. We engaged with colleagues to ensure they were fully supported throughout their migration journey. We used:"
        },
        {
            "text": "CCE worked closely with all the programme workstreams including DBT’s internal communications team, as we were responsible for cascading key messages to colleagues on their behalf."
        },
        {
            "text": "We worked most closely with the Device Rollout and Personal Data Migration (PDM) workstreams discussed in part 1 of this blog. We were in direct contact with colleagues booking to attend sessions to receive their replacement DBT devices. It was fundamental for us to stay connected with these workstreams to ensure they knew when colleagues were scheduled for their migrations. The Device Rollout and PDM workstreams could then ensure the correct personal data migrations were completed and the engineers running the sessions were notified."
        },
        {
            "text": "As this was a change programme, we learnt to tailor our communications to suit individuals and help them feel more confident adapting to new ways of working. Many colleagues required help with accessibility or were worried about what the changes would bring, so we needed to consider the impact this would have."
        },
        {
            "text": "We adjusted our messaging to be more informal and used direct messages with colleagues when required. We worked with the engineers to arrange one-on-one sessions with colleagues where needed to help those who were particularly anxious or less ‘tech-savvy’. We also worked with colleagues who used assistive technology or equipment to understand what they required to make sure we were prepared ahead of their sessions. This helped alleviate anxieties and made sure they could continue working effectively through their migration."
        },
        {
            "text": "We also ran and facilitated drop-in information sessions in collaboration with other workstreams. This was a chance for colleagues to have their questions answered and make sure they knew what to expect."
        },
        {
            "text": "Colleagues migrated with their directorates in cohort groups. Each cohort was assisted through the MoG by a diverse network of Champions; representatives from each cohort who provided a pivotal link between the programme team and colleagues."
        },
        {
            "text": "The CCE workstream led engagements with the Champions, who were able to assist colleagues with queries and provide support along with a familiar face. They also helped gather feedback and encourage colleagues to take part in User Research to help us continuously improve their experience."
        },
        {
            "heading": 2,
            "text": "Adapting our approach from User Research"
        },
        {
            "text": "It was challenging for us to establish clear processes at the start of the MoG. As the programme evolved, we learned and continually improved the experience for each cohort.  "
        },
        {
            "text": "Throughout the programme, we conducted User Research (UR) sessions and issued surveys to gather feedback on how to iteratively improve our communications and colleagues’ understanding of the MoG."
        },
        {
            "text": "At the beginning, we were sending guidance which was unclear for colleagues and used time-consuming methods. These were often static such as PowerPoints or manually sent emails. From UR feedback, the programme’s content designer created a Migration Hub. This was a fantastic SharePoint site where colleagues could find all the information and guidance they needed at every stage of their migration journey. This could also be continuously updated and meant guidance was kept current."
        },
        {
            "text": "This resource was hugely improved by carrying out UR with colleagues undergoing their migration. We learnt that they were busy and required simple language which was easy to understand and not too technical. They preferred guidance to be presented in a variety of digestible formats such as pictures or videos. They also wanted to easily find out who to contact for help. These changes proved to be hugely useful for colleagues also using assistive technology. Having to download PowerPoint documents makes it difficult to navigate back to guidance pages and unnecessary images are hard for screen readers to understand."
        },
        {
            "heading": 2,
            "text": "Key learnings"
        },
        {
            "text": "We have a lot of learnings from working on this programme. The 5 top things the CCE team have learnt are needed to deliver a successful migration programme include,"
        },
        {
            "text": "Colleague quote: “The team are truly amazing and everyone they speak to and help comes out of the room praising them. Thank you all so much. They deserve all the praise.These projects are not easy to manage, but this had felt very professionally and humanly led”"
        },
        {
            "text": "Although this only captures a small amount of the migration programme work, we hope this provides useful insight into the type of work DDaT can do. This is also not the end. The team are creating a MoG playbook for DBT, capturing everything that has gone into this programme and our learnings, to help future programmes like this one."
        },
        {
            "heading": 3,
            "text": "Ready to join us?"
        },
        {
            "text": "Digital, Data, and Technology are always looking for a wide range of skills. Explore current opportunities and discover how you can make a difference."
        }
    ]
}