{
    "url": "https://defrafarming.blog.gov.uk/2025/04/22/fip-guidance-now-available-for-upcoming-funding-competitions/",
    "title": "FIP: Guidance now available for upcoming funding competitions ",
    "authors": [
        "Joss Wallace"
    ],
    "categories": [
        "Payments for research and innovation"
    ],
    "pub_date": "2025-04-22T12:33:23+01:00",
    "content": [
        {
            "text": "I’m pleased to share that guidance is now available for 2 upcoming funding competitions under the Farming Innovation Programme (FIP): Precision Breeding and Low Emissions Farming. "
        },
        {
            "text": "Both competitions open on 5 May. We’ve published the guidance now, so farmers, growers and foresters have time to prepare. "
        },
        {
            "text": "A total of £25 million is available through these competitions.  "
        },
        {
            "text": "These areas have been identified as priorities for support because of their potential to improve productivity and sustainability. "
        },
        {
            "text": "Precision breeding can support farmers to be more productive, resilient and resource efficient. Investing in low emissions farming supports the sector’s efforts to reduce its environmental impact while maintaining profitability. "
        },
        {
            "text": "Whether you're focused on advancing precision breeding or reducing emissions, these competitions are here to help bring your ideas to life.  "
        },
        {
            "text": "In this post, I’ll share links and provide an overview of both competitions.  "
        },
        {
            "heading": 2,
            "text": "Precision Breeding Competition"
        },
        {
            "text": "Aim of funding: This competition will fund research in precision breeding, a technology that has the potential to transform the plant breeding sector in England. Precision breeding enables the commercialisation of new crops in years, rather than decades. These crops can be: "
        },
        {
            "text": "Ultimately, research from these projects could reduce the need for pesticides, increase food production and lower costs for farmers. "
        },
        {
            "text": "Funding available: A share of £12.5 million. "
        },
        {
            "text": "Open to: Collaborative projects, led by farm businesses or agricultural supply chain businesses. "
        },
        {
            "text": "Project cost: £1 million to £2.5 million.  "
        },
        {
            "heading": 2,
            "text": "Low Emissions Farming Competition"
        },
        {
            "text": "Aim of funding: This competition will support research into innovative ways to reduce emissions on farms. Projects could focus on areas such as: "
        },
        {
            "text": "Funding available: A share of £12.5 million. "
        },
        {
            "text": "Open to: Collaborative projects led by farm businesses, agricultural supply chain businesses, or research organisations. "
        },
        {
            "text": "Project cost: £1 million to £2.5 million. "
        },
        {
            "heading": 2,
            "text": "Networking and briefing events "
        },
        {
            "text": "Applications for both competitions are open to consortia, which are collaborative teams made up of businesses and research organisations.  "
        },
        {
            "text": "The funding supports projects at all stages of the R&D lifecycle, from early ideas through to commercialisation, helping the most promising solutions to move forward. "
        },
        {
            "text": "To help you connect with potential partners and gain a clearer understanding of the application process, we’re hosting networking and briefing events: "
        },
        {
            "text": "Farmers, industry leaders and researchers will come together at these events to share ideas, explore opportunities and form new partnerships. "
        },
        {
            "heading": 2,
            "text": "Support for innovation "
        },
        {
            "text": "Since 2021, the Farming Innovation Programme, in partnership with Innovate UK, has backed over 290 projects across more than 600 organisations, supporting the creation and adoption of innovative technology. "
        },
        {
            "text": "With over £150 million committed by government and a further £54 million in private investment secured, an interim evaluation indicates that the programme aligns well with industry priorities, notably, increasing productivity and reducing greenhouse gas emissions. "
        },
        {
            "text": "These competitions offer a chance to help build a farming sector that is more resilient, sustainable and profitable."
        },
        {
            "text": "Your involvement could make a meaningful difference to the future of farming in England. We’ll share updates along the way, so do subscribe to the Farming blog."
        }
    ]
}