{
    "url": "https://educationhub.blog.gov.uk/2025/04/free-breakfast-club-roll-out-everything-you-need-to-know/",
    "title": "Free breakfast club roll out: everything you need to know ",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "breakfast clubs",
        "Childcare",
        "Free School Meals",
        "Schools"
    ],
    "pub_date": "2025-04-22T00:01:00+01:00",
    "content": [
        {
            "heading": 3,
            "text": "What is the new free breakfast club scheme?  "
        },
        {
            "text": "We have introduced free breakfast clubs - 30 minute sessions before school where children get a free breakfast so they to start every day ready to learn. "
        },
        {
            "text": "Around 180,000 pupils in the most disadvantaged communities will be able to access free breakfast clubs. As children return from the Easter holidays, the first 750 schools will take part in the programme."
        },
        {
            "text": "These schools are based across nine regions in England and will be funded to provide this service – available to all children in each setting.  "
        },
        {
            "text": "This is the first phase of a national roll out which will see free breakfast clubs in every primary school in England in due course "
        },
        {
            "text": "Free breakfast clubs will help ensure pupils start every day ready to learn, and in turn will improve behaviour, attendance and attainment. "
        },
        {
            "heading": 3,
            "text": "What will my child get for breakfast? "
        },
        {
            "text": "Schools will provide healthy, nutritious and varied breakfasts that follow the School Food Standards.  "
        },
        {
            "heading": 3,
            "text": "What are the benefits of free breakfast clubs? "
        },
        {
            "text": " Free breakfast clubs mean no child starts school hungry and will help set children up for the day by providing a nutritious breakfast as well as time with friends to enjoy activities such as reading and crafts. "
        },
        {
            "text": "Breakfast clubs, such as those already run by the Magic Breakfast programme have been shown to boost children’s reading, writing, and maths by an average of two months.   "
        },
        {
            "text": "For parents, free breakfast clubs mean help with childcare at the start of the school day – at no extra costs. It means those parents can drop their children off half an hour earlier – helping parents get into work, giving them up to 95 additional hours back to juggle busy mornings, and saving working families up to £450 a year."
        },
        {
            "text": "We know many families are feeling the impact of the cost-of-living crisis. Out of the around 180,000 children who will benefit in the first 750 schools, around 80,000 attend schools in deprived areas.  "
        },
        {
            "text": "This is one of the measures we are taking to cut the cost of living for families. We are also legislating to significantly cut uniform costs through a cap on branded items, alongside our government-funded childcare rollout."
        },
        {
            "heading": 3,
            "text": "Which schools are part of the first phase of free breakfast clubs? "
        },
        {
            "text": "Schools selected for the early adopter scheme will contact families directly about how to sign up for the breakfast club. The chosen schools represent different types, sizes and geographical areas across England. "
        },
        {
            "heading": 3,
            "text": "What if my school isn't part of the scheme yet? "
        },
        {
            "text": "This is the first phase of a planned national rollout. The government is using this early adopter phase to learn from different types of schools before expanding the programme. Schools are currently testing various approaches to ensure the programme works effectively for all communities. "
        },
        {
            "text": "If you have specific questions about how the new breakfast club scheme will work in your child's school, we recommend speaking directly with the school once they confirm their participation. "
        },
        {
            "heading": 3,
            "text": "How much funding will schools get?"
        },
        {
            "text": "Schools will receive a lump sum for set up, and then a further recurring lump sum of over £1000 to help with costs.  "
        },
        {
            "text": "To put this in perspective, an average school with 50% take up on the early adopter scheme would receive around £23k for a full year. "
        },
        {
            "text": "That money will cover the cost of food, delivery and staffing costs.  This is much more than the existing school breakfast programme - on average, a school switching to the early adopter scheme would receive an additional £21,400 of funding."
        }
    ]
}