{
    "url": "https://space.blog.gov.uk/2025/04/22/how-uk-technology-helped-land-on-the-moon/",
    "title": "How UK technology helped land on the Moon",
    "authors": [
        "Nammo UK"
    ],
    "categories": [
        "Delivering Missions and Capabilities"
    ],
    "pub_date": "2025-04-22T11:53:47+01:00",
    "content": [
        {
            "text": "Sunday 2 March 2025 marked a momentous day for Nammo UK as Firefly’s Blue Ghost became the first commercial lunar lander to successfully land on the Moon! This wouldn’t have been possible without our LEROS 4-ET (Extended Thrust) engine."
        },
        {
            "text": "In 2011, the European Space Agency and the UK Space Agency were looking for a company to develop a high-thrust apogee engine (HTAE). Despite being a much smaller company at the time, Nammo UK won the contract and began developing this exciting new capability.  "
        },
        {
            "text": "Fast forward to 2021, Firefly Aerospace approached Nammo UK in search of an engine capable of landing their Blue Ghost lunar lander on the Moon. Thanks to the development of the HTAE, Nammo UK were well equipped to meet Firefly’s needs, leading to the creation of the LEROS 4-ET (Extended Thrust)."
        },
        {
            "text": "The LEROS 4-ET was designed, manufactured and tested in-house at Nammo’s Westcott (Buckinghamshire) and Dublin sites by their highly skilled team. The engine was tested on site in Nammo UK’s vacuum test facility, a capability made possible through the support of the UK Space Agency’s National Space Propulsion Test Facility. The collaboration between these two sites allows the team to simulate the conditions in space under vacuum."
        },
        {
            "text": "What makes this engine unique is that the very first unit built went straight to flight following a highly successful series of tests."
        },
        {
            "text": "Before doing its final burn, the LEROS 4-ET had to complete a series of other manoeuvres to get to that point. On 9 February 2025 it completed its trans-lunar injection burn, which accelerated Blue Ghost to a velocity sufficient enough to escape Earth’s gravity and enter free space towards the Moon. Approximately 4 days later, the 4-minute-long lunar orbit insertion burn occurred to slow Blue Ghost sufficiently for capture into lunar orbit."
        },
        {
            "text": "The LEROS 4 performed its longest burn on 2 March. This was the descent orbit insertion burn, lasting approximately 550 seconds, that was critical to the successful landing of Blue Ghost, working in conjunction with Firefly’s 200 Newton engines on the perimeter of the spacecraft."
        },
        {
            "text": "Ian Coxhill, Chief Engineer at Nammo UK, explained:"
        },
        {
            "text": "Now a piece of the UK is sat comfortably on the lunar surface forever; you can see the engine very clearly in this blog’s first image at the bottom of the lander’s shadow!"
        },
        {
            "text": "Nammo UK would like to thank the UK Space Agency and ESA for the success of the LEROS 4, as it would not have been possible without their support in the development of the engine."
        },
        {
            "text": "The UK Space Agency’s National Space Propulsion Test Facility enabled the test campaign, demonstrating its value as a critical facility for the UK’s space industry. There are more exciting things to come, as ESA’s Envision mission to Venus will be powered by the HTAE that will be qualified for flight using the Facility."
        }
    ]
}