{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2025/04/22/stem-futures-bridging-knowledge-across-sectors/",
    "title": "STEM Futures: Bridging knowledge across sectors",
    "authors": [
        "gseprofession"
    ],
    "categories": [
        "Interchange"
    ],
    "pub_date": "2025-04-22T15:33:18+01:00",
    "content": [
        {
            "heading": 2,
            "text": "Interchange Symposium 2025"
        },
        {
            "text": "STEM Futures is a partnership of organisations across government, industry and academia, delivered by the Government Science and Engineering (GSE) Profession team at the Government Office for –Science (GO-Science). STEM Futures aims to foster knowledge exchange at every career stage, from secondments and placements through to mentoring and coaching. "
        },
        {
            "text": "In March 2025, we hosted the second STEM Futures Interchange event at the Royal Society, bringing together approximately 50 attendees both in person and online. The day was a celebration of the diverse opportunities the scheme has made possible, and focused on how this can be developed further through cross-sector knowledge exchange.  "
        },
        {
            "text": "Opening remarks "
        },
        {
            "text": "The event was opened by a keynote speech from Andreea Anastasiu, the Executive Director of the Government Outcomes Lab at the Blavatnik School of Government, University of Oxford. Andreea shared her reflections on the importance of cross-sector partnerships and highlighted how people, rather than organisations, are at the heart of collaboration. "
        },
        {
            "text": "Showcasing success "
        },
        {
            "text": "Ted Hayden, the Director of GO-Science, then chaired a panel showcasing the exciting knowledge exchange activities supported by STEM Futures. Delegates heard perspectives from the Nuclear Hub, the Space Hub, the Department for Energy Security and Net Zero (DESNZ), and a secondee from the National Physical Laboratory (NPL) into the Department for Science, Innovation and Technology (DSIT). Each shared their personal experiences of the scheme, highlighting the importance of engaging with the right people early on to set up secondment opportunities. "
        },
        {
            "text": "Collaborating on priority topics "
        },
        {
            "text": "To support partners in getting the best out of STEM Futures, delegates took part in a collaborative workshop activity centred around four priority topic areas: "
        },
        {
            "text": "This allowed partners to share their insights and discuss how they could work together, generating a host of fantastic ideas about how to better support knowledge exchange opportunities across sectors. "
        },
        {
            "text": "Looking ahead "
        },
        {
            "text": "Sophie Boldon, Deputy Director for Science and Innovation Systems and Capability at GO-Science, wrapped up the day with reflections, sharing her excitement about the future of STEM Futures.  "
        },
        {
            "text": "Interested in how STEM Futures can benefit your organisation?  Get in touch with us at STEMFutures@go-science.gov.uk to find out more about how the scheme can help deliver innovative STEM knowledge-exchange opportunities.  "
        }
    ]
}