{
    "url": "https://mhclgdigital.blog.gov.uk/2025/04/11/local-digitals-next-steps-with-tom-smith-director-for-artificial-intelligence-and-advanced-analytics/",
    "title": "Local Digital’s next steps with Tom Smith, Director for Artificial Intelligence and Advanced Analytics ",
    "authors": [
        "Tom Smith, Director for Artificial Intelligence and Advanced Analytics"
    ],
    "categories": [
        "Artificial Intelligence",
        "Data",
        "Local Digital"
    ],
    "pub_date": "2025-04-11T11:56:19+01:00",
    "content": [
        {
            "text": "I’m Tom Smith, the Director of a new Artificial Intelligence (AI) and Advanced Analytics Directorate within MHCLG. Local Digital is now part of this directorate, strengthening MHCLG’s ability to support councils with AI adoption, digital and data transformation, and cyber resilience."
        },
        {
            "text": "It’s an exciting time to lead this work with the current landscape presenting a huge opportunity to make progress. The English Devolution White Paper, Local Government Reform, and the Blueprint for Modern Digital Government set a clear direction: digital and data transformation must be central to how councils evolve. AI and other emerging technologies present new opportunities to improve efficiency, service delivery, and collaboration across the sector."
        },
        {
            "text": "But alongside the opportunities for improvement, the risks of not modernising are clear: higher costs, inefficiencies, and services that don’t meet the needs of residents and businesses. At the same time, the public sector must navigate change carefully. While adopting new technologies comes with challenges, failing to do so is an even bigger risk."
        },
        {
            "text": "I’m also excited by the great and innovative work that councils are already doing in the digital transformation and AI space - with lots for us to learn from in national government. However, many still face common challenges with data sharing, fragmented systems, and inconsistent user experiences.  "
        },
        {
            "text": "Real transformation will require collaboration between councils, suppliers, government departments and sector bodies. By working together, we can solve common problems, test new approaches, and share solutions across the sector. "
        },
        {
            "text": "I’m looking forward to working with you all. "
        },
        {
            "heading": 2,
            "text": "What this means for Local Digital"
        },
        {
            "text": "Local Digital’s core priorities remain:"
        },
        {
            "text": "We have detailed the work we’ve completed to reduce the incidence and impact of cyber attacks, particularly through the Cyber Assessment Framework for local government."
        },
        {
            "heading": 3,
            "text": "Our focus areas for digital transformation"
        },
        {
            "text": "To help councils address the challenges and take advantage of the opportunities ahead, we’re focusing on key areas that will enable better digital services."
        },
        {
            "heading": 4,
            "text": "Data standards"
        },
        {
            "text": "We’re working to establish and promote data standards that improve interoperability, data quality, and ease of integration"
        },
        {
            "heading": 4,
            "text": "Data mobility and integration"
        },
        {
            "text": "We’re exploring solutions that reduce the burden on councils when migrating data, submitting statutory returns, and sharing information across borders"
        },
        {
            "heading": 4,
            "text": "Supplier engagement and market analysis"
        },
        {
            "text": "We want to work with councils and suppliers to understand the challenges and opportunities the evolving local government landscape presents. Our aim is to help improve market conditions, increase supplier transparency, and help councils navigate the software market and procure better digital solutions."
        },
        {
            "heading": 4,
            "text": "Scaling adoption of common digital solutions"
        },
        {
            "text": "We’re identifying opportunities for local government to adopt shared digital solutions, whether they are government-built tools like GOV.UK One Login, sector-developed products, or private market solutions."
        },
        {
            "heading": 2,
            "text": "What’s new"
        },
        {
            "text": "The new directorate is exploring how best to support the scaling of the use of AI across local government operations and services, to help maximise efficiency and support improved service delivery and prevention. There’s lots of brilliant work already happening in this space, but a lot of barriers to address to enable mass adoption. The team will be working closely with the sector as they develop their work. "
        },
        {
            "heading": 2,
            "text": "Get involved"
        },
        {
            "text": "We’ll share more about our focus areas in the coming weeks, along with opportunities to contribute your insights."
        },
        {
            "text": "We are particularly keen to hear about the challenges and opportunities your council faces with data sharing and data insight generation. Let us know by completing our short survey."
        },
        {
            "text": "Follow our channels for the latest updates and opportunities: "
        }
    ]
}