{
    "url": "https://nationalscreening.blog.gov.uk/2025/04/11/wealth-of-evidence-highlights-the-benefits-of-bowel-cancer-screening/",
    "title": "Wealth of evidence highlights the benefits of bowel cancer screening",
    "authors": [
        "Harriet Strachan",
        "Dr Becky Maclean"
    ],
    "categories": [
        "Bowel Cancer Screening"
    ],
    "pub_date": "2025-04-11T08:41:18+01:00",
    "content": [
        {
            "text": "The UK National Screening Committee (UK NSC) only recommends screening if good quality evidence shows it will do more good than harm at reasonable cost."
        },
        {
            "text": "April is Bowel Cancer Awareness Month. It's a good opportunity to highlight research analysis, along with data from the NHS Bowel Cancer Screening Programme in England, that provides clear evidence of the benefits of bowel cancer screening. Regular screening reduces both the risk of getting bowel cancer and the risk of dying from the condition. Research shows an estimated 186 bowel cancers are prevented for every 100,000 people screened over a 15-year period.[1]"
        },
        {
            "heading": 2,
            "text": "What bowel cancer screening does"
        },
        {
            "text": "Bowel cancer screening can detect cancer early, even when there are no symptoms. It can also detect polyps, which are abnormal growths that can develop into cancer over time. Removing polyps is a relatively simple procedure that can reduce the chance of developing bowel cancer in the future."
        },
        {
            "text": "The NHS in England invites people aged 54 to 74 for bowel cancer screening every 2 years. The programme is gradually expanding to make it available to eligible people aged 50 and over. Bowel cancer screening  is already offered from age 50 in Wales and Scotland."
        },
        {
            "text": "The screening programme sends out a faecal immunochemical test (FIT) kit, and people use this kit to return a sample of faeces (poo) for testing in a laboratory. If blood is found in the sample, the programme invites that person for further tests, which can include a colonoscopy – an examination of the lining of the large bowel during which any polyps can be removed."
        },
        {
            "heading": 2,
            "text": "Improving and evolving"
        },
        {
            "text": "The NHS Bowel Cancer Screening Programme has evolved significantly since its rollout across the UK began back in 2006."
        },
        {
            "text": "Improvements have included the replacement of the guaiac faecal occult blood test (gFOBt) with the FIT kit in 2019, following a positive UK NSC recommendation."
        },
        {
            "text": "FIT can detect human blood in faeces at lower concentrations than the gFOBt. It can detect more cancers, particularly advanced adenomas (tumours that may become cancers), and results in more polyps being removed at colonoscopy that might otherwise grow into cancers. Screening is not perfect, and there will always be some cancers that are missed (a false negative result) and some results which suggest people have cancer when they do not (a false positive result). FIT returns fewer false positive results than gFOBt. "
        },
        {
            "text": "FIT also only requires a single faecal sample, compared to the gFOBt kit that needed 6 samples from 3 bowel motions. FIT is a much more acceptable test to the public. Since April 2019 when FIT was introduced, national bowel cancer screening uptake has increased from under 60% to nearly 70%. This increase has been particularly marked in under-served groups with historically low screening uptake."
        },
        {
            "text": "In recent years, the age at which the NHS first invites people to screening in England has been gradually lowered from 60 to 50, leading to an increase in the number of referrals for further tests and an increase in the numbers of cancers diagnosed and polyps removed."
        },
        {
            "text": "There are many other developments that have the potential to improve the programme in the years to come, some of which were discussed at an horizon scanning event in January 2024."
        },
        {
            "text": "The NHS is committed to making the programme even more effective in line with UK NSC recommendations and to improving data collection."
        },
        {
            "heading": 2,
            "text": "What the research and data tell us"
        },
        {
            "text": "A study published in August 2023 found that, following the introduction of the English bowel cancer screening programme, the incidence of colorectal cancer fell among adults of screening age by almost 7%. This study did not consider the impact of the introduction of FIT as the bowel cancer screening test, so the reduction could be even bigger than 7% now."
        },
        {
            "text": "During 1 April 2023 to 31 March 2024, data from the NHS Bowel Cancer Screening Programme in England showed:"
        },
        {
            "text": "Bowel cancer screening is very good at correctly identifying people who are at higher risk of the condition. For every 1,000 people screened, just 2 people are likely to receive a false positive result."
        },
        {
            "heading": 2,
            "text": "Tackling inequalities in screening"
        },
        {
            "text": "There is a significant gap in the proportion of people who take up the offer of screening and follow-up diagnostic tests between the most and least deprived areas of the country."
        },
        {
            "text": "In the most deprived areas in England (lowest 20%), uptake of screening was 55.8% in 2023 to 2024, compared to 75.8% in the least deprived areas (highest 20%)."
        },
        {
            "text": "If we could increase screening uptake among the most deprived groups to 67% so that an additional 160,000 people would be screened, there would be an estimated 3,170 additional people invited for further tests and approximately 255 more cancers would be diagnosed and treated every year."
        },
        {
            "text": "The NHS is committed to increasing participation in these under-served populations. It has a national plan which was developed in the summer of 2024, in collaboration with representatives from the screening team in the Department of Health and Social Care, to reduce inequalities. This plan aims to help increase participation and early diagnosis among those most at risk."
        },
        {
            "text": "[1] Li, S.J., Seedher, T., Sharples, L.D. et al. Impact of changes to the interscreening interval and faecal immunochemical test threshold in the national bowel cancer screening programme in England: results from the FIT pilot study. Br J Cancer 127, 1525–1533 (2022). https://doi.org/10.1038/s41416-022-01919-y"
        },
        {
            "heading": 2,
            "text": "Keep up to date "
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK NSC. You can register to receive updates direct to your inbox, so there is no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, please email uknsc@dhsc.gov.uk. "
        }
    ]
}