{
    "url": "https://nationalscreening.blog.gov.uk/2026/01/05/feedback-invited-on-uk-nscs-work-on-screening-for-coeliac-disease/",
    "title": "Feedback invited on UK NSC’s work on screening for coeliac disease",
    "authors": [
        "Dr David Thompson"
    ],
    "categories": [
        "Adult screening"
    ],
    "pub_date": "2026-01-05T12:34:02+00:00",
    "content": [
        {
            "text": "The UK National Screening Committee (UK NSC) has been reviewing evidence relating to population screening for coeliac disease in adults."
        },
        {
            "text": "Coeliac disease is one of the health conditions the committee reviews regularly to assess the evidence that would support a national screening programme."
        },
        {
            "text": "Evidence maps are typically the first step in the evidence review process and the UK NSC commissioned an evidence map to outline the volume and type of evidence on screening for coeliac disease published since the previous UK NSC review of this topic in 2014."
        },
        {
            "text": "We are now offering stakeholders the chance to provide feedback on the evidence map and its conclusions. We are also asking stakeholders to highlight any issues related to coeliac disease screening in the adult population that it would be useful to explore. "
        },
        {
            "heading": 2,
            "text": "How to respond"
        },
        {
            "heading": 2,
            "text": "About Coeliac disease"
        },
        {
            "text": "Coeliac disease is a common bowel condition. It occurs when the immune system is too sensitive to a protein called gluten. Gluten is found in wheat, rye and barley, which are often used to make foods such as bread, pasta and biscuits."
        },
        {
            "text": "Coeliac disease damages the small intestine so the body cannot properly take in nutrients. It causes a range of symptoms, including diarrhoea, abdominal pain and bloating."
        },
        {
            "text": "Treatment is a strict gluten-free diet."
        },
        {
            "heading": 2,
            "text": "The evidence"
        },
        {
            "text": "The 2025 evidence map identified a substantial volume of new published evidence since 2014."
        },
        {
            "text": "It found that:"
        },
        {
            "heading": 2,
            "text": "Next steps"
        },
        {
            "text": "Based on the findings of this evidence map, the UK NSC is working to commission further evidence synthesis work to assess the published evidence on screening for coeliac disease in adults in greater depth."
        },
        {
            "text": "This feedback exercise aims to gather insights, priorities, and considerations that will help shape the scope and direction of this future evidence synthesis."
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK NSC. You can register to receive updates direct to your inbox, so there is no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, please email uknsc@dhsc.gov.uk."
        }
    ]
}