{
    "url": "https://naturalengland.blog.gov.uk/2025/08/07/24-hour-bioblitz-at-one-of-englands-newest-national-nature-reserves/",
    "title": "24 hour 'bioblitz' at one of England's newest National Nature Reserves",
    "authors": [
        "Karen Faux"
    ],
    "categories": [
        "Biodiversity",
        "Connecting People with Nature",
        "Landscape",
        "National Nature Reserve",
        "Natural England",
        "Nature",
        "Nature Recovery",
        "Nature Recovery Network",
        "Species recovery",
        "Wildlife"
    ],
    "pub_date": "2025-08-07T13:54:10+01:00",
    "content": [
        {
            "text": "By Karen Faux - Local Nature Recovery Senior at Natural England"
        },
        {
            "text": "In July, over 50 Natural England staff and partners came together for a 24 hour species recording event (or ‘bioblitz’) on the recently declared North Kent Woods and Downs (NKW&D) National Nature Reserve, one of the King's Series of National Nature Reserves. "
        },
        {
            "text": "The declaration, which brought together charities, private estates, and local councils, showcases Kent’s significant contribution to nature recovery and provides opportunity for people to experience, engage with and enjoy nature, whilst recovering nationally important biodiversity."
        },
        {
            "text": "Natural England were joined by the Birling Estate, Silverhand Estate, Medway Council, Woodland Trust, Kent Wildlife Trust, Kent Field Club, the Kent Downs National Landscape and University College London for the event. Having been kindly invited onto both Birling Estate and The Silverhand Estate Vineyard (the largest single holding organic vineyard in the UK), the teams were able to record over 500 species, including the incredibly rare Maidstone Mining Bee; a species of bee only recently discovered, thought previously extinct in the UK."
        },
        {
            "text": "Grant Hazlehurst, a member of the Kent Field Club and solitary bee specialist said:"
        },
        {
            "text": "Over at Birling Estate, winged insects were the star of the show; in the day the hot chalk in Kent makes for quite the butterfly display, and once the sun set over 270 species of moths were documented in just one evening! This incredible number reflects the fantastic land management taking place across the farm. During the event, Richard Moyse, Chair of The Kent Field Club, spotted a nationally scarce Rufous Grasshopper:"
        },
        {
            "text": "But the new National Nature Reserve (NNR) is not just about rare species. NNRs are built on three core pillars: science, nature and people. Whilst Natural England is dedicated to the restoration and protection of our natural environment, people remain at the forefront of this work."
        },
        {
            "text": "Stretching from Gravesend to the Medway Valley, The NKW&D is the first of over 220 NNRs to include a vineyard, demonstrating how environmental responsibility can work hand in hand with growth and local business. The NNR is also located near several large urban populations and will deliver access to green spaces to communities who might otherwise have limited access to the countryside."
        },
        {
            "text": "James Seymour, Deputy Director for Natural England’s Sussex and Kent team, said"
        },
        {
            "text": "Nick Johannsen FLI, Director of the Kent Downs National Landscape and Chair of the NNR partnership said:"
        },
        {
            "text": "The NNR is just one of the many projects supporting the Nature Recovery Network. The reserve sits within the ‘Chalk to Coast’ (C2C) Project, an ambitious, farmer-led initiative connecting Kent’s diverse landscapes from the chalk downlands to coastal habitats. Three established farm clusters (Hoo Peninsula, Swale, and North Medway Gap) have come together within the C2C to help farmers and partners work more cohesively in their locality, deliver greater benefits for soil, water and wildlife. "
        },
        {
            "text": "These partnerships are striking a delicate balance between supporting local businesses, local people, and the local environment.  This partnership approach is expected to serve as a model for future NNRs and conservation projects, balancing environmental and commercial interests in a way which benefits the whole community."
        },
        {
            "text": "You can find out more at these partner links:"
        },
        {
            "text": "Kent farmers in innovative Chalk to Coast project"
        },
        {
            "text": "North Kent Woods and Downs National Nature Reserve (NNR) - Kent Downs"
        },
        {
            "text": "Kent Field Club"
        },
        {
            "text": "Silverhand Estate"
        },
        {
            "text": "Birling Estate"
        }
    ]
}