{
    "url": "https://vmd.blog.gov.uk/2025/08/07/breaking-barriers-building-bridges-reflections-from-the-2025-cvo-amr-forum/",
    "title": "Breaking Barriers, Building Bridges: Reflections from the 2025 CVO AMR Forum",
    "authors": [
        "Aisling Glennie",
        "Jen Dow"
    ],
    "categories": [
        "Antimicrobial Resistance (AMR)",
        "VMD News"
    ],
    "pub_date": "2025-08-07T11:58:05+01:00",
    "content": [
        {
            "heading": 2,
            "text": "What is the Chief Veterinary Officers (CVO) AMR Forum?"
        },
        {
            "text": "Antimicrobial Resistance (AMR) is one of the most pressing global health challenges of our time. Tackling it requires more than national strategies - it demands international collaboration."
        },
        {
            "text": "Building on the momentum of the inaugural event in 2024, this year’s forum -  co-hosted by UK Chief Veterinary Officer (CVO) Christine Middlemiss and Sweden’s CVO Lena Hellqvist Björnero - brought together CVOs and animal health experts from nearly 30 countries, alongside multilateral organisations like Food and Agriculture Organization (FAO) and World Organisation for Animal Health (WOAH), and non-governmental organizations (NGOs). The goal? To turn the UN General Assembly’s Political Declaration on AMR into tangible action by creating a forum for countries to share their experiences, technical expertise and best practice."
        },
        {
            "heading": 2,
            "text": "What made this year’s forum stand out?"
        },
        {
            "text": "With broader participation from low and middle-income countries (LMICs), the conversations were more grounded and reflective of real-world challenges. Countries shared candid insights into their progress and hurdles in implementing AMR strategies."
        },
        {
            "text": "Ensuring that antibiotics remain part of the veterinary toolkit is essential. We heard about promising initiatives - like vaccination programmes aimed at reducing antibiotic use, regulatory reforms, and improved surveillance systems. Brazil’s multi-stakeholder forum, which fosters dialogue between government and the livestock industry, stood out as a model for collaboration."
        },
        {
            "heading": 2,
            "text": "What challenges are countries facing?"
        },
        {
            "text": "Despite the progress, persistent barriers remain. Funding gaps, limited laboratory capacity, and the difficulty of translating policy into practice were common themes. Yet, there was a shared commitment to overcoming these obstacles."
        },
        {
            "text": "Surveillance and data sharing emerged as top priorities. The global data collection tool ANIMUSE is helping countries monitor antimicrobial use, providing critical insights to guide interventions."
        },
        {
            "text": "FAO highlighted the key issue of the overuse and misuse of antibiotics driving AMR in livestock production and promoted their RENOFARM (Reduce the Need for Antimicrobials on Farms for Sustainable Agrifood Systems Transformation) initiative. This initiative supports farmers and producers in reducing their reliance on antimicrobials. FAO noted how important stakeholder engagement is to making the initiative a success."
        },
        {
            "heading": 2,
            "text": "What role did the World Organisation for Animal Health play?"
        },
        {
            "text": "We were honoured to hear from Dr. Emmanuelle Soubeyran, WOAH’s Director General, who reaffirmed the organisation’s commitment to reducing antimicrobial use, promoting responsible practices, and strengthening animal health systems. Her message echoed the forum’s central theme: collaboration is key. WOAH was very supportive of the event and reflected afterwards that the forum lent itself to informal and insightful dialogues with countries open and willing to share their experiences with the group."
        },
        {
            "heading": 2,
            "text": "Why was this forum important for the UK?"
        },
        {
            "text": "For the UK, the forum was a valuable opportunity to listen, share, and strengthen international relationships and a fantastic example of the power of multi-lateral engagement. It reinforced our belief that we’re part of a truly global effort - one that’s committed to protecting both animal and human health through responsible antimicrobial use. "
        },
        {
            "heading": 2,
            "text": "What's next?"
        },
        {
            "text": "This forum has carved out a unique space in the global AMR calendar - a place for honest dialogue, shared learning, and sustained commitment. It’s more than a technical meeting; it’s a growing network of CVOs and animal health experts working together to protect global health. "
        },
        {
            "text": "The forum delivered new insights, stronger connections, and a renewed sense of purpose. AMR remains a global priority, and while the challenges are real, so are the opportunities. This event reminded us that when we work together, we can make meaningful progress. "
        },
        {
            "heading": 2,
            "text": "In other international news..."
        },
        {
            "text": "Following on from the WOAH General Session, FAO held its 44th Conference in Rome to support the adoption of a resolution on AMR where VMD was in attendance. "
        },
        {
            "text": "This resolution, led by the UK and Kenya, set out commitments for Member States and FAO in the agrifood sector, primarily focussed of the implementation of the UNGA Political Declaration on AMR. "
        }
    ]
}