{
    "url": "https://educationhub.blog.gov.uk/2025/08/how-are-apprenticeships-funded-and-what-is-the-apprenticeship-levy/",
    "title": "How are apprenticeships funded and what is the apprenticeship levy?",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Apprenticeships",
        "Funding"
    ],
    "pub_date": "2025-08-07T17:22:49+01:00",
    "content": [
        {
            "text": "Apprenticeships allow people of all ages to earn while they learn and gain the sApprenticeships allow people of all ages to earn while they learn and gain the skills they need to build a rewarding career. Since 2020, over 1.6 million apprentices have started their apprenticeship journey in a wide range of industries, from health to digital, to engineering and beyond. "
        },
        {
            "text": "This is in part thanks to the apprenticeship levy which was created so businesses can take on more apprentices, alongside the opportunity to invest in high quality training to develop the skilled workforce they need. Here, we explain more about how it works. "
        },
        {
            "text": "What is the levy and how does it work? "
        },
        {
            "text": "The apprenticeship levy is paid at a rate of 0.5% by large employers with an annual pay bill of over £3 million.  "
        },
        {
            "text": "Every employer who pays the levy has an apprenticeships service account where they can access levy funds to spend on apprenticeship training. "
        },
        {
            "text": "While only the biggest businesses pay the levy, the funding generated by it also funds apprenticeship training for other employers who want to take on apprentices, including small and medium sized enterprises (SMEs). "
        },
        {
            "text": "Employers with a total annual pay bill of less than £3 million pay up to 5% of the cost of their apprenticeship training and the Government pays the rest. "
        },
        {
            "text": "Does all of the funding raised by the levy  get spent? "
        },
        {
            "text": "In the 2023-24 financial year, 99% of the overall apprenticeships budget was spent.  "
        },
        {
            "text": "Although linked, the apprenticeships budget is distinct from the total levy receipts and the funds in employer apprenticeship service accounts. The apprenticeships budget is set by HM Treasury and covers the spend drawn down by all levy-paying employers, as well as apprenticeship costs for those who do not pay the levy.  "
        },
        {
            "text": "Individual levy paying employers can see the balance of notional levy funds in their account. After 24 months any unused levy funds are removed from accounts, but this money does not go to waste. "
        },
        {
            "text": "Behind the scenes DfE is already using this money to pay for apprenticeship training for smaller employers and for any additional payments needed to support training providers and employers who take on young apprentices. Around 40% of all apprenticeship starts are in small and medium employers, which accounts for more than 100,000 apprenticeship starts each year.  "
        },
        {
            "text": "For large employers who can’t make full use of the levy funds in their apprenticeship service accounts, we have set up a system so they can transfer up to 50% of their levy funds to other businesses to support them to invest in apprenticeship programmes. Levy transfers cover the 5% contribution that would be paid for by the employer - the remaining 95% is paid for by the government, from the apprenticeship budget.  "
        },
        {
            "text": "What can the levy be used for? "
        },
        {
            "text": "The apprenticeship levy funds over 650 different types of apprenticeships to train people for a huge variety of jobs. Whether funds are spent on GCSE-equivalent apprenticeships in social care work or higher-level apprenticeships in engineering, the levy creates flexibility and choice in how employers provide apprenticeships. "
        },
        {
            "text": "The Government is launching the Growth and Skills Levy to offer greater flexibilities, for employers and learners, to help more people get on the path to a rewarding career, support employers to take on new apprentices and increase the skills of their current workforce. "
        },
        {
            "text": "The changes include:  "
        },
        {
            "text": "• New foundation apprenticeships from August 2025 to help young people get started and meet employers' skills needs  "
        },
        {
            "text": "• Shorter minimum apprenticeship duration (8 months instead of 12) from August 2025, so training matches what industry actually needs "
        },
        {
            "text": "• More flexible English and maths requirements for apprentices over 19 - they won't always need to achieve these qualifications if employers agrees they're not essential to their training  "
        },
        {
            "text": "• New short courses to help employers fill skills gaps more quickly "
        },
        {
            "text": "For more detail and to keep up to date with the changes read our Growth and Skills Levy page. "
        },
        {
            "text": "What can’t the levy be used for? "
        },
        {
            "text": "Levy funds can’t be used to pay apprentice wages or qualifications that are not already approved as part of the apprenticeship. Levy funds also can’t be used for travel expenses, or costs associated with setting up an apprenticeship. "
        },
        {
            "text": "What are you doing to get more young people into apprenticeships? "
        },
        {
            "text": "In financial year 2023/2024, young people under the age of 25 accounted for more than half of all apprenticeship starts.  "
        },
        {
            "text": "From August 2025, we're introducing foundation apprenticeships to give young people new routes into good jobs. These will help young people learn job skills and develop confidence, with the chance to move on to more advanced apprenticeships later. "
        },
        {
            "text": "To support even more businesses to offer apprenticeships to young people: "
        },
        {
            "text": "Young people can use our find an apprenticeship service to discover which apprenticeship is the right one for them. They can also find and apply for apprenticeships by searching for them on the UCAS site, alongside degree courses. "
        },
        {
            "text": "To help existing apprentices manage their apprenticeship the Government recently launched the ‘Your Apprenticeship’ app. The app provides easy access to essential tools, resources and support. "
        },
        {
            "text": "Our Skills for Life campaign also aims to raise awareness and understanding of all the different education and training pathways open at post-16 and post-18, including apprenticeships. "
        },
        {
            "text": "Find out more: "
        },
        {
            "text": "For more information on becoming an apprentice, visit this link. "
        },
        {
            "text": "For employers looking to find out more about the levy, visit this page. "
        },
        {
            "text": "Watch our video for more information about how the apprenticeship budget works"
        }
    ]
}