{
    "url": "https://mhclgmedia.blog.gov.uk/2025/08/07/speculative-reporting-on-council-tax-rises/",
    "title": "Speculative reporting on council tax rises",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Council finance",
        "Local government"
    ],
    "pub_date": "2025-08-07T16:13:08+01:00",
    "content": [
        {
            "text": "There has been media reporting that some local authorities will increase council tax because of the government's Fair Funding Review 2.0."
        },
        {
            "text": "The current, outdated way in which local authorities are funded means the link between funding and need for services has broken down. Some places have been left behind with communities facing declining neighbourhood services – this is not fair."
        },
        {
            "text": "The previous government themselves understood this in their ‘Fair Funding Review’ but they did not deliver, launching the Fair Funding Review in 2016, but did not take proposals forward.  We are taking a different approach and making good on this long-overdue promise through the Fair Funding Review 2.0. "
        },
        {
            "text": "Subject to the consultation's results, we will update the funding system to more accurately account for deprivation, including pockets of disadvantage, and to account for the differing ability of councils to raise income locally, which results from the number and values of homes within a council area. "
        },
        {
            "text": "We recognise that change of this scale requires careful management. That is why we are inviting views on a package of transitional arrangements available over the multi-year Spending Review period, including providing a funding floor. And any council with concerns about their ability to set or maintain a balanced budget can approach government directly."
        },
        {
            "text": "Reporting of the impact on council tax is speculation. It is for local authorities to decide at what level they set their council tax within the referendum thresholds. The Spending Review confirmed the government intends to maintain the referendum threshold at 3%, with 2% for the adult social care precept."
        },
        {
            "text": "An MHCLG spokesperson said:"
        },
        {
            "text": "“The current, outdated way in which local authorities are funded means the link between funding and need for services has broken down, leaving communities left behind."
        },
        {
            "text": "“That’s why we are taking decisive action to reform the funding system so we can get councils back on their feet and improve public services, with the IFS recognising that our changes will better align funding with councils’ needs.”"
        }
    ]
}