{
    "url": "https://nationalscreening.blog.gov.uk/2025/08/07/uk-nsc-publishes-sma-screening-evidence-documents/",
    "title": "UK NSC publishes SMA screening evidence documents",
    "authors": [
        "Silvia Lombardo"
    ],
    "categories": [
        "Newborn Blood Spot Screening"
    ],
    "pub_date": "2025-08-07T08:54:52+01:00",
    "content": [
        {
            "text": "Today we are publishing a suite of 4 documents relating to the review of evidence on newborn screening for spinal muscular atrophy (SMA)."
        },
        {
            "text": "You can view and download the documents by clicking on the following links:"
        },
        {
            "text": "SMA is a rare inherited disease that can cause the nerves in the spinal cord to deteriorate. These nerves transmit instructions from the brain to the muscles that control a person’s ability to move, speak, swallow and breathe. This nerve damage causes gradual muscular weakening and muscle loss."
        },
        {
            "text": "In 2018, the UK NSC recommended not to screen for SMA (see UK NSC recommendation) but there have been significant developments since then, including new drug treatments."
        },
        {
            "heading": 2,
            "text": "Background and early work (2022 to 2023)"
        },
        {
            "text": "A great deal of work has taken place in recent years to assess the case for newborn blood spot screening for SMA."
        },
        {
            "text": "Following a stakeholder workshop, the Sheffield Centre for Health and Related Research (SCHARR) at the University of Sheffield was commissioned in 2022 to undertake initial scoping work. The aim of this was to understand the evidence developments in key areas and   developments in work exploring the clinical and cost-effectiveness of screening."
        },
        {
            "text": "SCHARR’s initial scoping work is presented in 2 of the documents we have published today, the: "
        },
        {
            "text": "The scoping work concluded that a new, comprehensive and flexible cost-effectiveness modelling study for the UK screening context was needed to assess the uncertainties and unanswered questions of existing models."
        },
        {
            "text": "It also concluded that systematic reviews of PCR-based screening for SMA, as well as presymptomatic treatment of SMA, should be undertaken. These have since been carried out and published by the International Journal of Neonatal Screening. See: Systematic Review of Newborn Screening Programmes for Spinal Muscular Atrophy and Systematic Review of Presymptomatic Treatment for Spinal Muscular Atrophy."
        },
        {
            "text": "At its June 2023 meeting, the UK NSC endorsed a twofold approach to review the case for newborn screening for SMA by:"
        },
        {
            "heading": 2,
            "text": "Modelling study work (2023 to 2025)"
        },
        {
            "text": "In early 2025, SCHARR completed the new modelling study, which is one of the 4 documents we have published today."
        },
        {
            "text": "The model estimates the cost-effectiveness of newborn screening for SMA and is informed by clinical trials, relevant published literature and stakeholder workshops. The model compared the potential impact of newborn screening with the current practice of no newborn screening, and assumed that all 3 drug treatments (nusinersen, zolgensma and risdiplam) would be available."
        },
        {
            "text": "The model estimated that newborn screening for SMA would each year:"
        },
        {
            "text": "However, the model also predicted that newborn screening would identify around 3 babies a year with SMA who would not be affected until adulthood, if at all, and that this information might harm their health and wellbeing."
        },
        {
            "text": "All the analyses suggested that implementing screening could result in better outcomes and lower costs compared to the current approach of no screening plus treatment. The cost savings would depend on the treatments used and the price of treatments to the NHS."
        },
        {
            "text": "Remaining uncertainties include:"
        },
        {
            "heading": 2,
            "text": "SMA screening in-service evaluation"
        },
        {
            "text": "Following the cost effectiveness modelling work by SCHARR, the UK NSC conducted a review to consider whether the research questions of the ISE brief were still relevant and if an ISE was still required."
        },
        {
            "text": "The review concluded that an ISE was still required. A brief report describing that analysis is the fourth report we have published today."
        },
        {
            "text": "Earlier this summer, the National Institute for Health and Care Research (NIHR) advertised the research call for the SMA ISE."
        },
        {
            "text": "The planning and development of the ISE is being overseen by a partnership board that includes:"
        },
        {
            "text": "We will continue to update stakeholders and the public on the progress of this work via the blog."
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK NSC. You can register to receive updates direct to your inbox, so there is no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, please email uknsc@dhsc.gov.uk."
        }
    ]
}