{
    "url": "https://ukhsa.blog.gov.uk/2025/08/07/what-are-the-symptoms-of-the-chikungunya-virus-and-is-there-a-vaccine/",
    "title": "What are the symptoms of the chikungunya virus and is there a vaccine? ",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Global health",
        "Travel"
    ],
    "pub_date": "2025-08-07T15:13:53+01:00",
    "content": [
        {
            "text": "Chikungunya may not be a household name, but this mosquito-borne viral infection has become a significant concern for travellers to some destinations. The disease, whose name derives from the Kimakonde (a language of Southern Tanzania) word meaning ‘that which bends up’ due to the severe joint pain it causes, has spread across the globe in recent decades. "
        },
        {
            "text": "First identified during an outbreak in Tanzania in 1952, chikungunya remained relatively contained to parts of Africa and Asia for many years. However, the virus has now spread to new territories and is affecting millions of people worldwide. Major outbreaks have occurred in the Indian Ocean islands, the Caribbean, Central and South America, and parts of the Pacific. Even temperate regions like France and Italy have experienced smaller but significant outbreaks, and this year there have been significant outbreaks in China and the French Outermost Regions of Reunion and Mayotte.  "
        },
        {
            "text": "Chikungunya’s spread is likely due to favourable climatic conditions for mosquitoes and increased travel. "
        },
        {
            "heading": 2,
            "text": "UK cases of chikungunya "
        },
        {
            "text": "In 2024, there were 112 confirmed and probable cases of chikungunya reported among travellers returning to England, Wales and Northern Ireland - nearly one and a half times the number reported in 2023. Travel to India accounted for the majority of these cases, followed by travel to Pakistan and Brazil – all popular destinations for people travelling from the UK. "
        },
        {
            "text": "There is currently no risk of onward transmission of chikungunya in the UK, as there is no evidence of invasive species of mosquito established in the UK. While invasive mosquitoes could currently establish in parts of the UK, climate change is likely to increase suitability for these species. "
        },
        {
            "heading": 2,
            "text": "How it spreads "
        },
        {
            "text": "Chikungunya spreads through the bite of infected Aedes mosquitoes, particularly Aedes aegypti and Aedes albopictus species. Mosquitoes breed in natural and human-made sources of standing and stagnant water such blocked gutters and drains, litter, tarpaulins, open buckets, bins, plant pots and discarded items like tyres, and these are a risk factor for transmission if left around human habitation. Unlike malaria-carrying mosquitoes that are active at night, these insects are most active during the day, and particularly at dusk and dawn. This timing makes them troublesome for travellers engaged in daytime activities. "
        },
        {
            "heading": 2,
            "text": "Signs and symptoms "
        },
        {
            "text": "The first symptoms of the disease are usually a high fever and severe joint pain, often more severe in the small joints or where there have been previous injuries. Many patients also experience muscle pain, headaches, sensitivity to light, and distinctive skin rashes. While most people recover fully within 1 to 2 weeks, the joint pain can persist for months or even years in some cases, with up to 12% of patients still experiencing discomfort 3 years after infection. "
        },
        {
            "text": "Serious complications are rare, occurring in approximately one in every 1,000 cases. However, certain groups face higher risks, including young babies, elderly people, and adults with underlying health conditions. Occasional complications affecting the eyes, nervous system, heart, and digestive system have been reported. "
        },
        {
            "heading": 2,
            "text": "Prevention and treatment "
        },
        {
            "text": "Currently, there is no specific antiviral treatment for chikungunya, making prevention crucial for travellers. The most effective approach involves rigorous mosquito bite prevention measures. This includes using repellents containing DEET or picardin on exposed skin, and wearing light-coloured, loose-fitting clothing that covers arms and legs.  Use of insect repellents should be according to the manufacturer's instructions, and care should be taken for babies and young children.  "
        },
        {
            "text": "Travellers should also be aware that these mosquitoes breed in standing water around human habitation. Avoiding areas with natural and artificial water containers can help reduce exposure risk. Unlike some mosquito species that prefer rural areas, Aedes mosquitoes thrive in urban environments and often bite indoors, making hotel room precautions equally important. "
        },
        {
            "heading": 2,
            "text": "New vaccine options "
        },
        {
            "text": "Two new vaccines were recently approved for use by UK travellers, and will be added to the Green Book used by healthcare professionals in due course. IXCHIQ and Vimkunya have been shown to provide good protection against infection, however, their use requires careful consideration. As of July 2025, IXCHIQ should not be given to adults aged 60 years and older, and it's also not recommended for people with a history of thymus disorders.  "
        },
        {
            "text": "For those who are suitable candidates, vaccination may be considered for travellers visiting regions with active chikungunya outbreaks, frequent or long-term travellers to areas with recent transmission, and laboratory staff working with the virus. Vimkunya can be offered to individuals aged 12 and over, while IXCHIQ is suitable for immunocompetent individuals aged 18 to 59 years. "
        },
        {
            "heading": 2,
            "text": "How UKHSA addresses this threat "
        },
        {
            "text": "Several of our teams at UKHSA play a vital role in tackling diseases like chikungunya. Our Medical Entomology and Zoonoses Ecology group (MEZE) monitor and assess new and existing species and the threat they pose to public health, advising the government on appropriate measures. The Emerging Infections and Zoonoses (EIZ) Team provide epidemic intelligence, while the Rare and Imported Pathogens Laboratory (RIPL) provides clinical advice and laboratory testing of samples. The Travel Health Team collaborates with the National Travel Health Network and Centre (NaTHNaC) to translate all of this information into comprehensive advice for health professionals and members of the public."
        },
        {
            "heading": 2,
            "text": "Looking ahead "
        },
        {
            "text": "Chikungunya's rapid global spread reflects our interconnected world, where infected travellers can inadvertently introduce viruses to new regions. Climate change and urbanisation are likely to expand the range of Aedes mosquitoes, potentially bringing chikungunya to new areas. The presence of suitable mosquito vectors in parts of Europe, combined with regular travel from endemic areas, means the risk of local transmission in temperate regions remains a genuine concern. "
        },
        {
            "text": "You can find information on outbreaks of diseases including chikungunya, and country-specific travel advice, on the Travel Health Pro website. While chikungunya is rarely fatal, its potential for causing prolonged joint pain and disability, and lack of a specific treatment, makes prevention vitally important for reducing the impact of this infection.  "
        }
    ]
}