{
    "url": "https://publicpolicydesign.blog.gov.uk/2025/08/07/why-public-design-is-more-important-than-ever/",
    "title": "Why public design is more important than ever",
    "authors": [
        "Alice Goldman"
    ],
    "categories": [
        "PublicPolicyDesign",
        "Thought leadership"
    ],
    "pub_date": "2025-08-07T12:00:00+01:00",
    "content": [
        {
            "text": "There are important signs of energy at the edges of the government system, according to writer James Plunkett. These are initiatives and movements that are firmly flourishing, yet not quite mainstream. They are “pockets of vitality” in governments that can sometimes struggle to reform at pace.   "
        },
        {
            "text": "James points to design as one of these bright spots …and I agree! To my mind, design sits firmly in the category of up-and-coming social and political initiatives that address the great challenges of the moment."
        },
        {
            "text": "Let’s unpack how."
        },
        {
            "heading": 2,
            "text": "Recap: what is design for"
        },
        {
            "text": "In our modern world of pluralism and market choice, most people regularly have ‘good’ and ‘bad’ experiences. It’s almost universally recognised that a process could be anywhere from very good (convenient, slick, enjoyable) to very poor (maddening, broken, frustrating). It might be argued that design only exists to fix bad experiences. If everything was already optimised, we wouldn't need any designers. Thus we can sum up design's raison d’etre as 'where there are experiences that are intended to achieve outcomes, we should tailor them to best achieve that outcome'."
        },
        {
            "heading": 2,
            "text": "Design has taken on new importance over time"
        },
        {
            "text": "The term design was primarily used in reference to products and components. But as western economies shifted their focus from goods to services, the discipline of design mirrored the change, increasingly encompassing information, interventions and holistic ‘customer experiences’ in addition to physical products. Design in this broad sense is one of the underpinning disciplines of our era… but why?"
        },
        {
            "text": "Making new technologies usable - One reason is that organisations wishing to expand the use of new technologies - whether their motives are to do with productivity, education, profit, efficiency or something else - find that their objectives are more easily met when designers think about how non-technical users can master new tools and integrate them into their workflow."
        },
        {
            "text": "Navigating complexity - A second driver of growth in design is that globalisation and technology have created a more networked, complex world. The more variables are introduced into a system, the harder it is for humans to understand it, and the more they need it to be specifically designed to be manageable. A system for connecting, say, two doctors and fifty patients is the sort of task a single receptionist can set up and handle. Introducing a national phone service into an existing operational healthcare system with thousands of possible outcomes, like NHS111, requires a different magnitude of design capability."
        },
        {
            "text": "Responding to change - Finally, a third driver of growth in design has been the need to re-establish successful delivery pathways in systems whose activities were upended by shocks, financial crises and disruptive reorganisations. There are a number of case studies from UK local government showing how failing or risky services have been reimagined in a deliberate way (like Liberated Method, Radical Help, or Only we can save the state). It’s important to note that it was not incompetent management or staff that caused these transformations to be necessary, but systemic factors that fundamentally altered the paradigm in which the services were previously operating. In a world where systemic shocks are becoming increasingly common, we may well find that investing in design and re-design is increasingly necessary."
        },
        {
            "heading": 2,
            "text": "Connecting design with other movements"
        },
        {
            "text": "Coming from a public-sector digital government background, I’ve always found it strange that there isn’t more recognition of the synergies between the digital/design and local/civic agendas. I suspect this is because ‘digitisation’ has earned a bad reputation for imposing one-size-fits-all change. Careless digitisation sets back the efforts of those digital and design professionals who are committed to fundamental principles in which technology is balanced with human needs."
        },
        {
            "text": "This brings us back to the list of “pockets of vitality”. All are concerned with exploring human needs - for civic participation, for a fair distribution of scarce resources, for control over their data, for agency in the place they call home. We could say they add up to one philosophy: that excellent public service means leveraging the full potential of communities, individuals, places and technologies to achieve the outcomes we want, at a price we can afford. If we fail to do this, we will be at significant risk of intensifying dehumanisation and dissatisfaction, with knock-on impacts to trust and democracy."
        },
        {
            "text": "Are you a reader from outside the ‘design’ space? Reach out to us via the comments. How could the public design network connect with other movements?"
        }
    ]
}