{
    "url": "https://dragonsden.blog.gov.uk/2017/01/29/dragons-den-series-14-episode-12/",
    "title": "Dragons’ Den series 14: Episode 12",
    "authors": [
        "Gary Townley"
    ],
    "categories": [
        "Designs",
        "Patents",
        "Trade marks"
    ],
    "pub_date": "2017-01-29T21:01:35+00:00",
    "content": [
        {
            "text": "A real mixed bag in tonight’s episode with drinks, dolls, beauty products and bicycle accessories all being pitched for that all important investment. It just goes to show that IP affects every area of business."
        },
        {
            "heading": 2,
            "text": "A buzz in the den"
        },
        {
            "text": "First through the door this week, wearing very fetching overalls, were Joe Harper and Andy Sugden from Just Bee drinks. They were looking for an investment of £65K for 10% of their honey sweetened drinks business, Just Bee drinks. The dragons could not comprehend how such a simple idea had not been done before. Certainly in the world of patents applying known technology to something new is patentable, think of the areas where solar power is now being used. So if you discover a new use for existing technology don’t overlook patents, get advice from a patent attorney."
        },
        {
            "text": "The area of soft drinks does not usually lend itself to patent protection as there is no technical effect. There are some exceptions though, Yakult and the use of probiotics for instance. But most new beverages will rely on the brand to drive sales. Think Evian (yes it is naive spelt backwards) or Coca Cola and Pepsi."
        },
        {
            "heading": 2,
            "text": "But a sting in the tail"
        },
        {
            "text": "Having protected the brand with a trade mark and with promising sales figures Peter Jones was keen to invest. In fact he had a genius idea to move the brand forward (From Jerk to genius). But Peter was looking for his offer to secure him 25% of the business. The duo were reluctant to release more equity and after a tense negotiation they turned the dragon down."
        },
        {
            "heading": 2,
            "text": "Childs play"
        },
        {
            "text": "Next to enter the Den was Frances Cain with a different take on toy dolls. Her product, A Girl for All Time, provides a doll with a book detailing its background history. For those of you who may remember, a bit like an up market Cabbage Patch Doll. Unfortunately unlike the Cabbage Patch Dolls which had cuteness and appeal, none of the dragons could see the appeal in Frances’s dolls as they looked quite eerie."
        },
        {
            "text": "When it comes to protecting the look of a product, it doesn’t matter how scary it looks, it can still be protected by a registered design. But on this occasion all the dragons were scared off."
        },
        {
            "text": "Last but not least, out of the lift came Luca Amaduzzi and Agostino Stilli  and their innovative, magnetic, bicycle indicator lights. With a granted patent and a touch of Italian flair, the dragons were impressed with the pitch and the quality of the safety product. Both Touker and Nick wanted to go along for the ride and both offered to invest in the “CYCL” business."
        },
        {
            "text": "Again the entrepreneurs were brave enough to negotiate and they finally settled for an investment from Nick Jenkins for 12.5% of the company."
        },
        {
            "text": "So we saw almost every area of IP being used in the Den tonight. If you are not sure what type of IP you own, why not try IP Equip our free and interactive online tool?"
        },
        {
            "text": "Keep in touch. Sign up to email updates from this blog, or follow us on Twitter."
        }
    ]
}