{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2023/09/25/celebrating-national-inclusion-week-2023/",
    "title": "Celebrating National Inclusion Week 2023",
    "authors": [
        "gseprofession"
    ],
    "categories": [
        "Blog Series",
        "Diversity & Inclusion"
    ],
    "pub_date": "2023-09-25T16:32:45+01:00",
    "content": [
        {
            "text": "National Inclusion Week is taking place this year from 25 September to 1 October. The theme for 2023 is Take Action Make Impact, a call for everyone to think about what actions they can take that make a positive and lasting impact in our organisations. This blog post will share the inspirational career stories from two members of the GSE Diversity and Inclusivity Action Group (DIAG)."
        },
        {
            "heading": 3,
            "text": "Sue Richards – Senior Electrical Engineer at Ofgem – Member of DIAG Women’s Working Group"
        },
        {
            "text": "How I got into my profession of engineering:"
        },
        {
            "text": "As a teenager, my parents set zero expectations for my career. There were two criteria: don't be in debt and get a job. The rest was up to me."
        },
        {
            "text": "As a result, I was left to carve my own path. Careers advice at school was pointless. All I remember is filling in a questionnaire, but not what I was ‘destined’ to be. What I wanted to do was join the Army."
        },
        {
            "text": "My heart was set on the Royal Engineers. Being 16 years old, I needed my mum’s permission, which she refused to give, so I did the next best thing and ran away and joined the Electricity Board."
        },
        {
            "text": "My journey so far:"
        },
        {
            "text": "I joined the Electricity Industry as an apprentice. I loved the dependability of doing maintenance and operations, but the bright lights beckoned me to London. As a High Voltage technician, I learnt a whole new skill set and eventually moved into my first managerial role. I have had many engineering management roles and have managed a wide variety of teams."
        },
        {
            "text": "I joined Ofgem because the industry was rapidly changing and the regulation behind that needed to change, and I saw myself adding value to this change. Once again, I find myself learning a new skill set. I started in the Cost Assessment world and moved into the Engineering profession in July 2022."
        },
        {
            "text": "My hopes for the future:"
        },
        {
            "text": "Outreach and social mobility are really important to me. You cannot be what you cannot see. Therefore, I will continue to promote the Engineering profession, but my future hopes are that all Civil Service Engineering professions embark on promoting different career paths and attracting great people into great roles."
        },
        {
            "heading": 3,
            "text": "Josephine Oyinlola – Senior Policy Manager at the Department of Health and Social Care – Member of DIAG Disability and Ethnic Minorities Working Groups"
        },
        {
            "text": "How I got into my profession of science:"
        },
        {
            "text": "I was very curious and inquisitive as a child and have always loved murder mysteries and whodunnit shows like Murder She Wrote, every iteration of CSI, old episodes of Perry Mason, Columbo etc. I was always trying to find the clues before the detectives’ “ah hah” moment. I have always been fascinated by how the body works, the amazing things that people do and the amount that is still unknown. I had really inspirational science teachers in secondary school and was keen to continue studying it at university despite the career advice I got from teachers in School. I am the person that doesn’t like being told “you can’t do …” or “you won’t be able to …”, so was even more determined to excel when my Head of Sixth Form said: “Science wasn’t for me.” (Paraphrased.) He also said this to a few of my friends, so we created a study group to share learning. My family were so supportive in motivating me and sharing tips."
        },
        {
            "text": "At university, I absolutely loved laboratory work, neurology and child health, but didn’t know what to specialise in, so I decided to move into policy. That way I could still utilise my science background and techniques to improve health outcomes."
        },
        {
            "text": "My journey so far:"
        },
        {
            "text": "After I graduated with a master’s degree, I worked at the Royal College of Paediatrics and Child Health. I literally googled ‘child health jobs London’ and found an amazing job. I worked there for a few years on mental health, disability and patient safety projects and child health research. I also got the opportunity to dabble in things I never considered before, such as marketing, social media and patient engagement. It opened my eyes to the importance of effectively communicating policy and research in a range of formats to ensure that the message is understood and acted upon."
        },
        {
            "text": "My hopes for the future:"
        },
        {
            "text": "I hope that we continue to be ambitious and brave in taking actions to address inequalities and removing barriers to equality, diversity and inclusion in the Civil Service. Over my time in the Civil Service, I have witnessed truly inspirational efforts that are being made to ensure that we have a workforce that not only represents the population we serve, but also looks at how we can support each other to advance equality through support groups, sponsorship, mentoring, outreach programmes, collaborations, events and awareness-raising initiatives."
        },
        {
            "text": "There is a Nigerian proverb, ‘you may have many clothes, but you can never have more rags than your elders’. I hope that we continue to build on the work of Civil Servants who came before to ensure that we deliver better outcomes for the public, close the health gap and create an environment where everyone feels safe and that they belong."
        }
    ]
}