{
    "url": "https://educationhub.blog.gov.uk/2023/09/get-the-most-out-of-freshers-weeks/",
    "title": " 5 ways to get the most out of Freshers’ Weeks",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Universities"
    ],
    "pub_date": "2023-09-25T09:23:34+01:00",
    "content": [
        {
            "text": "The end of summer marks the beginning of a new journey for many students, with thousands packing their bags to start their studies at university."
        },
        {
            "text": "As well as meeting new people and socialising, Freshers’ Week is an opportunity for students to get used to the university lifestyle and find out about their course, campus and more."
        },
        {
            "text": "Here are our top tips on how you can get the most out of your Freshers’ Week."
        },
        {
            "heading": 3,
            "text": "Go to the Freshers' Fair "
        },
        {
            "text": "A Freshers’ Fair is a great opportunity for students to find out the curricular and extra-curricular activities on and off campus."
        },
        {
            "text": "Universities tend to host multiple fairs throughout the Freshers’ period and offer an array of stalls, activities and freebies. Whether it be representatives from student societies, sports clubs or local businesses, there’s something for everyone."
        },
        {
            "text": "Freshers’ fairs are the perfect opportunity to pick up leaflets to take home and find out more about how you can get the most out of your experience."
        },
        {
            "heading": 3,
            "text": "Complete the registration process "
        },
        {
            "text": "As part of Freshers’ Week, you will be required to complete the registration process at university. Before you’ve moved in you should have registered online. Once you’ve settled, you will need to register with your relevant department and will be provided with an ID."
        },
        {
            "text": "To help you prepare for registration, you will be sent an email with a list of timings and the documents required."
        },
        {
            "heading": 3,
            "text": "Make sure you know where to get mental health support"
        },
        {
            "text": "Although going to university is an exciting time for most students, it also comes with its unique set of challenges.."
        },
        {
            "text": "We believe that students’ mental health and wellbeing should be prioritised and there is a range of support available via online mental health and wellbeing platform Student Space. Funded by the Office for Students (OfS), Student Space provides dedicated one-to-one text and web chat support services."
        },
        {
            "text": "Most universities also have their own wellbeing services on offer which you can find out about at Freshers’ Fairs and induction events."
        },
        {
            "heading": 3,
            "text": "Find out what financial help is available "
        },
        {
            "text": "We know that many students are facing increased living costs which is why we have made sure financial support is available through universities by boosting hardship funds by millions. We’ve also increased loans and grants to support undergraduate and postgraduate students with living and other costs by 2.8% for the 2023/24 academic year."
        },
        {
            "text": "If you are a student and worried about your circumstances, you should speak to your university. If you are not sure where to get help, your university should have a student support service or a students’ union who can direct you to the correct team."
        },
        {
            "text": "UCAS also has a range of resources available to help you manage your budget, so you can feel confident about your finances as you go into your first term."
        },
        {
            "heading": 3,
            "text": "Find out where you can get careers advice "
        },
        {
            "text": "There can be a huge amount going on during your first few weeks at university with lots of things to think about. As you start to find your feet you might start to wonder if you are on the right course or be thinking about finding part-time work to support student life."
        },
        {
            "text": "You might also start thinking about your future and wondering how your degree will help you start or progress in a career. If you’d like some guidance from the experts then, alongside your university careers service, the National Careers Service is a great place to start."
        },
        {
            "text": "You can access a range of free tools and information on the National Careers Service website, chat to a careers adviser online or give them a call. Careers advisers can talk to you about your hopes and ambitions and help you make a plan of action that’s personalised to you."
        }
    ]
}