{
    "url": "https://naturalengland.blog.gov.uk/2023/09/25/nature-returns/",
    "title": "Nature Returns",
    "authors": [
        "Tim Hill"
    ],
    "categories": [
        "Biodiversity",
        "Climate change",
        "Nature Returns",
        "Nature-based solutions",
        "Science and evidence"
    ],
    "pub_date": "2023-09-25T09:25:34+01:00",
    "content": [
        {
            "text": "Dr Tim Hill, Chief Scientist at Natural England, tells us about the launch of Nature Returns."
        },
        {
            "text": "Today, 25 September 2023, Natural England is launching Nature Returns."
        },
        {
            "text": "Nature Returns is about collaboration across government and the private sector to explore head-on some of the biggest challenges we face: how can we best use land across England to address climate change whilst producing food and promoting thriving nature? And, how can we work with companies and financial institutions to mobilise the billions in private investment that Government estimates we need to meet our national net zero commitments?"
        },
        {
            "text": "I’ll admit they are significant challenges! In response to these challenges, Natural England has been leading a partnership with the Environment Agency, Forestry Commission, RBG Kew at Wakehurst and local partners. Our work is co-sponsored by Defra and DESNZ, which is helping to ensure that emerging results can be integrated into developing policy. All of this has been funded directly by HM Treasury Shared Outcomes Fund."
        },
        {
            "text": "Climate change teams and other scientists at Natural England and RBG Kew, Wakehurst have been working together to really understand how much carbon is held in hedgerows, grasslands and other habitats commonly taken up as options through agri-environment schemes in farmed landscapes."
        },
        {
            "text": "We are working with our local partners across England to sample habitats at different stages of development. At Wakehurst, Kew's 'living laboratory' in Sussex, Kew scientists are collecting data above and below ground across a broad range of habitats in their wild botanic garden, from woodland to grassland and wetland."
        },
        {
            "text": "This partnership approach is allowing us to gather the evidence to fill gaps in our understanding of what really happens below the soil when new habitats are developed, what variation there is in different landscapes across England, and how carbon and greenhouse gas capture changes over time."
        },
        {
            "text": "We’ve also been working closely with the Environment Agency whose Future Funding team has been exploring what approaches to blending public and private finance have proven successful, and how new approaches can help get the right investment in place to deliver for Nature and people. As part of this, they have been talking with major investors to understand what is standing in the way of unlocking the really significant private investment in nature that is needed."
        },
        {
            "text": "The Forestry Commission has been investigating the UK Voluntary Carbon Market, getting behind the surface to understand how the UK carbon credit schemes are working and helping to make better financial data available for those looking to be involved. This builds on the Forestry Commission’s experience of running the Woodland Carbon Code for more than a decade."
        },
        {
            "text": "Some of this work has already been published and is available to guide new or expanding projects. As new evidence is ready, we will continue to update our Access to Evidence page."
        },
        {
            "text": "If Nature Returns had a middle name, it would be collaboration! It hasn’t been enough to work across the Defra and DESNZ. We are delighted that our partnership extends beyond government and is already bringing about change across England. Together, we are building a better understanding of the challenges and opportunities in recovering Nature and delivering sustainable solutions to our climate and biodiversity challenges."
        },
        {
            "text": "Earlier this year we awarded nearly £5 million in grants to six local partnerships across the country. These local partnerships are working with our scientists, local businesses and communities to bring their vision to life. These local partnership projects are:"
        },
        {
            "text": "I’ve had the privilege of seeing first-hand the hard work it takes to breathe life back into traditional orchards and wood pasture near Gloucester where six hectares of orchards have been planted around the River Severn. This is good news for biodiversity and flood prevention. However, work to restore nature has been made more challenging as our weather becomes more unpredictable due to the impacts of climate change."
        },
        {
            "text": "We will be continuing to help join up with other existing restoration projects to create truly landscape-scale action."
        },
        {
            "text": "This illustrates why Nature Returns is so important and so urgent now. Nature has many of the answers to climate change and biodiversity loss. But to reap the returns, we need to invest in the research. Through Nature Returns, we are backing the science that asks what’s really happening inside grasslands, floodplains and even orchards. Then we are connecting scientists, stakeholders and green investors to share what works, what doesn’t, and why."
        },
        {
            "text": "From carbon capture to sustaining biodiversity, we need evidence-based answers and community-based action. By investing in nature, we will all share in the benefits."
        },
        {
            "text": "If you would like to find out more or access reports being produced by the Programme, visit the Natural England Nature Returns evidence page."
        },
        {
            "text": " "
        },
        {
            "text": "Previous related blog posts:"
        },
        {
            "text": "Nature based solutions for climate change at a landscape scale - July 2021"
        },
        {
            "text": "New grant scheme opens: Nature based solutions for climate change at a landscape scale - July 2022"
        },
        {
            "text": " "
        },
        {
            "text": "Press release:"
        },
        {
            "text": "Pioneering nature projects launched to test carbon capture methods in fight against climate change - February 2023"
        },
        {
            "text": " "
        },
        {
            "text": "Report:"
        },
        {
            "text": "Carbon Storage and Sequestration by Habitat 2021"
        }
    ]
}