{
    "url": "https://publicguardian.blog.gov.uk/2023/09/25/powers-of-attorney-bill-receives-royal-assent/",
    "title": "Powers of Attorney Bill receives Royal Assent ",
    "authors": [
        "Amy Holmes"
    ],
    "categories": [
        "Digital",
        "LPA",
        "ModernisingLPA"
    ],
    "pub_date": "2023-09-25T09:06:35+01:00",
    "content": [
        {
            "text": "\n[English] - [Cymraeg]"
        },
        {
            "text": "Authored by Amy Holmes, Chief Executive and Public Guardian"
        },
        {
            "text": "We have recently reached a key milestone in our journey to modernise lasting powers of attorney. As a result of the hard work of Stephen Metcalfe MP and Viscount Stansgate, on Monday 18 September, the Powers of Attorney Bill received Royal Assent and became an Act of Parliament."
        },
        {
            "text": "The Powers of Attorney Act 2023 makes changes to the Mental Capacity Act 2005 which mean we can improve how lasting powers of attorney (LPAs) are made in future. The modernised service will make the LPA process safer, simpler and fit for the future. Achieving Royal Assent is an exciting step forward in our aim to increase and improve accessibility for customers so that anyone who wants to make an LPA can do so easily."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Fit for the future"
        },
        {
            "text": "We want to offer a modern, dynamic and innovative service for our customers, and Royal Assent takes us one step closer to achieving this. As demand for our services continues to grow, it is important we provide excellent customer service while managing the increasing number of LPAs being registered. Introducing an online system and an overall simpler process will improve the customer experience."
        },
        {
            "text": "Under the changes, we will be offering customers a more convenient and simpler way to make an LPA with the choice of doing this completely online for the first time, on paper, or through a combination of the two methods. The Act will also change the objection process so anyone with a valid concern can raise an objection directly with us."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "What does this mean for our customers?"
        },
        {
            "text": "Our customers are at the heart of everything we do, and we want to provide an LPA service that will offer greater protection for donors. This new legislation means we can introduce measures to better protect against fraud and abuse, including allowing OPG to check the identity of those involved in the LPA."
        },
        {
            "text": "While the new modernised service will change the way LPAs are made, our current Use an LPA service will continue to be available for attorneys and donors to share LPA details online with third party organisations, such as banks or health care providers."
        },
        {
            "text": "Our current services remain available as usual, and you should continue to make an LPA if you are considering or in the process of doing so."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Work in progress "
        },
        {
            "text": "So much work has been happening across our business to get us to this point but it’s important to recognise that we’ve still got a long way to go."
        },
        {
            "text": "The next legislative stage will be to develop secondary legislation to amend the regulations which govern LPAs and the process OPG uses to register them. We will provide further information, including on timescales for this, as work progresses."
        },
        {
            "text": "As an organisation we need to ensure the modernised service is fully tested and right for our customers before it’s introduced to the public. We will be continuing to develop the new service over the coming year until we are ready."
        },
        {
            "text": "We will keep you updated around these exciting developments as we improve our processes to ensure LPAs are safer and simpler for everyone. Thank you for supporting us on our journey to becoming fit for the future."
        },
        {
            "text": " "
        },
        {
            "text": "\n[English] - [Cymraeg]"
        },
        {
            "text": "Ysgrifennwyd gan Amy Holmes, Prif Weithredwr a Gwarcheidwad Cyhoeddus \n "
        },
        {
            "text": "Rydym wedi cyrraedd carreg filltir allweddol yn ddiweddar yn ein taith i foderneiddio atwrneiaethau arhosol. O ganlyniad i waith caled Stephen Metcalfe AS a ViscountStansgate, ar Dydd Llun Medi 18fed, cafodd y Bil Atwrneiaethau Gydsyniad Brenhinol a daeth yn Ddeddf Seneddol."
        },
        {
            "text": "Mae Deddf Atwrneiaethau 2023 yn gwneud newidiadau i Ddeddf Galluedd Meddyliol 2005 sy’n golygu y gallwn wella sut mae atwrneiaethau arhosol yn cael eu gwneud yn y dyfodol. Bydd y gwasanaeth modern yn gwneud y broses Atwrneiaeth Arhosol yn fwy diogel, yn symlach ac yn addas ar gyfer y dyfodol. Mae sicrhau Cydsyniad Brenhinol yn gam cyffrous ymlaen yn ein nod o gynyddu a gwella hygyrchedd i gwsmeriaid fel bod unrhyw un sydd am wneud atwrneiaeth arhosol yn gallu gwneud hynny’n hawdd. \n "
        },
        {
            "heading": 2,
            "text": "Addas ar gyfer y dyfodol"
        },
        {
            "text": "Rydym eisiau cynnig gwasanaeth modern, deinamig ac arloesol i’n cwsmeriaid, ac mae Cydsyniad Brenhinol yn mynd â ni gam yn nes at gyflawni hyn. Wrth i’r galw am ein gwasanaethau barhau i gynyddu, mae’n bwysig ein bod yn darparu gwasanaeth rhagorol i gwsmeriaid wrth reoli’r nifer cynyddol o atwrneiaethau arhosol sy’n cael eu cofrestru. Bydd cyflwyno system ar-lein a phroses symlach yn gyffredinol yn gwella profiad y cwsmer.  "
        },
        {
            "text": "O dan y newidiadau, byddwn yn cynnig ffordd fwy hwylus a symlach i gwsmeriaid wneud atwrneiaeth arhosol gyda’r dewis o wneud hyn yn gyfan gwbl ar-lein am y tro cyntaf, ar bapur, neu drwy gyfuniad o’r ddau ddull. Bydd y Ddeddf hefyd yn newid y broses wrthwynebu er mwyn i unrhyw un sydd â phryder dilys allu codi gwrthwynebiad yn uniongyrchol gyda ni.  \n "
        },
        {
            "heading": 2,
            "text": "Beth mae hyn yn ei olygu i gwsmeriaid? "
        },
        {
            "text": "Mae ein cwsmeriaid wrth galon popeth a wnawn, ac rydym am ddarparu gwasanaeth Atwrneiaeth Arhosol a fydd yn cynnig mwy o warchodaeth i roddwyr. Mae’r ddeddfwriaeth newydd hon yn golygu y gallwn gyflwyno mesurau i ddiogelu’n well rhag twyll a cham-drin, gan gynnwys caniatáu i Swyddfa’r Gwarcheidwad Cyhoeddus wirio pwy yw’r rheini sy’n ymwneud â’r atwrneiaeth arhosol. "
        },
        {
            "text": "Er y bydd y gwasanaeth modern newydd yn newid y ffordd y caiff Atwrneiaethau Arhosol eu gwneud, bydd ein gwasanaeth Defnyddio Atwrneiaeth Arhosol presennol yn parhau i fod ar gael i atwrneiod a rhoddwyr rannu manylion Atwrneiaeth Arhosol ar-lein gyda sefydliadau trydydd parti, fel banciau neu ddarparwyr gofal iechyd. "
        },
        {
            "text": "Mae ein gwasanaethau presennol ar gael fel arfer o hyd, a dylech barhau i wneud atwrneiaeth arhosol os ydych chi’n ystyried gwneud hynny neu wrthi’n gwneud hynny.  \n "
        },
        {
            "heading": 2,
            "text": "Gwaith ar y gweill"
        },
        {
            "text": "Mae cymaint o waith wedi bod yn cael ei wneud ar draws ein busnes i gyrraedd y pwynt hwn, ond mae’n bwysig cydnabod bod llawer o waith i'w wneud eto. "
        },
        {
            "text": "Y cam deddfwriaethol nesaf fydd datblygu is-ddeddfwriaeth i ddiwygio’r rheoliadau sy’n rheoli atwrneiaethau arhosol a’r broses y mae Swyddfa'r Gwarcheidwad Cyhoeddus yn ei defnyddio i’w cofrestru. Byddwn yn darparu rhagor o wybodaeth, gan gynnwys gwybodaeth am amserlenni ar gyfer hyn, wrth i’r gwaith fynd rhagddo.  "
        },
        {
            "text": "Fel sefydliad, mae angen i ni sicrhau bod y gwasanaeth wedi’i foderneiddio yn cael ei brofi’n llawn a’i fod yn addas i’n cwsmeriaid cyn iddo gael ei gyflwyno i’r cyhoedd. Byddwn yn parhau i ddatblygu’r gwasanaeth newydd ac yn y misoedd nesaf byddwn yn rhannu mwy o wybodaeth am pryd y bydd ar gael i’r cyhoedd."
        },
        {
            "text": "Byddwn yn rhoi’r wybodaeth ddiweddaraf i chi am y datblygiadau cyffrous hyn wrth i ni wella ein prosesau i sicrhau bod atwrneiaethau arhosol yn fwy diogel ac yn symlach i bawb. Diolch am ein cefnogi ar ein taith tuag at fod yn barod ar gyfer y dyfodol.   "
        },
        {
            "text": " "
        }
    ]
}