{
    "url": "https://educationhub.blog.gov.uk/2021/10/going-to-university-heres-how-to-protect-yourself-from-freshers-flu-covid-and-other-illnesses/",
    "title": "Going to university? Here’s how to protect yourself from freshers’ flu, Covid, and other illnesses",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Coronavirus",
        "Universities"
    ],
    "pub_date": "2021-10-04T17:12:01+01:00",
    "content": [
        {
            "text": "When students arrive for their first years at university there is often a wave of colds and other bugs that go around the student population – these are collectively referred to as ‘freshers’ flu’."
        },
        {
            "text": "It means that the good hygiene and care that people have been taking to stop the spread of Covid are even more important."
        },
        {
            "text": "Below, we outline helpful advice from Public Health England (PHE) as well as the ways you can protect yourself on campus and keep fresher’s flu at bay."
        },
        {
            "heading": 3,
            "text": "Practise good hygiene"
        },
        {
            "text": "Germs spread by coughs and sneezes are the primary way in which colds and flu – and Covid-19 - are passed on."
        },
        {
            "text": "To reduce the risk of spreading illnesses:"
        },
        {
            "text": "Things like face masks and hand sanitisers also help stop the spread of illnesses. And if you feel unwell in any way – and particularly if you have a temperature, a continuous cough, experience sneezing fits, feel sick or have diarrhoea – you should avoid close contact with other people and contact your GP."
        },
        {
            "heading": 3,
            "text": "If you are unwell – whether it’s a cold, flu, or Covid-19 – you should stay away from other people and look after yourself"
        },
        {
            "text": "Make sure you get plenty of rest and sleep, stay warm, take ibuprofen or paracetamol to lower your temperature and treat aches and pains and avoid dehydration by drinking plenty of water."
        },
        {
            "heading": 3,
            "text": "It’s important to get both doses of a COVID-19 vaccine"
        },
        {
            "text": "Getting vaccinated protects you and those around you. Which is why an ONS survey recently revealed that 90% of students have already been, or are likely, to be vaccinated."
        },
        {
            "text": "For students starting or returning to university, we know many higher education providers will be providing vaccine pop-up centres and other ways of supporting access to the vaccine programme from the start of term."
        },
        {
            "text": "Two doses of a vaccine offers the highest level of protection so make sure you get your second dose, which should be around 8 – 12 weeks after your first."
        },
        {
            "text": "You don’t need to have both doses in the same place. You can arrange your second dose through the booking service at www.nhs.uk/covidvaccine or by going to a local walk in clinic 8 weeks after your first dose. So you can have your second dose while you are away at uni. You can find a local walk in vaccination centre here."
        },
        {
            "heading": 3,
            "text": "But it’s also important to make sure you’re vaccinated against other infectious diseases"
        },
        {
            "text": "Make sure you are up to date with all your vaccinations, including MMR and MenACWY. These vaccines help protect against measles, mumps and rubella, as well as some common types of meningococcal meningitis (swelling of the brain lining) and septicaemia (blood poisoning). You can easily book this at your local GP – so make sure you have registered with a GP near you. These infections tend to spread at the start of university terms as lots of new people mix closely together."
        },
        {
            "heading": 3,
            "text": "Take a Covid test before travelling to uni and keep getting tested"
        },
        {
            "text": "While universities are safe spaces, and there have been new safety measures put into place, students still need to make sure they’re taking COVID-19 tests. Before moving to university take a rapid lateral flow device (LFD) Covid-19 test at home. It’s free, quick and easy and you can order them online through the NHS. Once at university keep taking two LFD tests each week on site, or at home and report all your results online to NHS Test and Trace or by calling 119."
        },
        {
            "text": "Testing regularly means you’ll know early if you have COVID-19 and can make sure you don’t pass it on to others."
        },
        {
            "text": "Remember that about 1 in 3 people with COVID-19 do not have any symptoms. Regular LFD testing can help uncover hidden cases of the virus that would otherwise go undetected."
        },
        {
            "heading": 3,
            "text": "Use the NHS COVID-19 App and NHS COVID Pass"
        },
        {
            "text": "Students can download the NHS COVID App to be alerted to what’s happening in your area, book a PCR or LFD test, use a QR code for visiting places and to be alerted if you are a close contact so you can help stop the spread of the virus."
        },
        {
            "text": "Also make sure to download the NHS COVID Pass to prove your full vaccination status so that you don’t miss out and so you don’t have to self-isolate if you are identified as a close contact."
        },
        {
            "heading": 3,
            "text": "Mental health support is available"
        },
        {
            "text": "There is no doubt it has been a difficult time for many students, which is why we’ve worked together with representatives from the higher education and health sectors to specifically address mental health."
        },
        {
            "text": "Students struggling with their mental health can find support from PHE’s Every Mind Matters campaign, and their local NHS trust, which now provide dedicated, 24-hour support lines, including suicide prevention support."
        },
        {
            "text": "The online resource at Student Space has a variety of useful mental health and wellbeing materials that can support you and others. Public Health England also provides resources to support young people’s mental health and wellbeing here"
        },
        {
            "text": "As part of the government’s Mental Health Recovery Action Plan, the government has provided an additional £13 million to ensure young adults aged 18 to 25, including students at uni, are supported with tailored mental health services, helping bridge the gap between children’s and adult services."
        }
    ]
}