{
    "url": "https://valuationoffice.blog.gov.uk/2021/10/04/voa-graduate-scheme-launch-ayesha-azar/",
    "title": "VOA Graduate Scheme launch – Ayesha Azar",
    "authors": [
        "sophiekilgour"
    ],
    "categories": [
        "Graduate Scheme",
        "Surveying",
        "Valuation",
        "Women in surveying"
    ],
    "pub_date": "2021-10-04T15:38:04+01:00",
    "content": [
        {
            "text": "Following the launch of our 2022 graduate scheme, our latest blog focuses on Ayesha Azar, a recently qualified Chartered Surveyor, who speaks about her journey on the scheme and building her career in the VOA."
        },
        {
            "text": "Ayesha’s story"
        },
        {
            "text": "I was born and brought up in Pakistan in the vibrant city of Lahore. I came to the UK in January 2005 after getting married and joined the VOA in August 2005 as an Administrative Officer."
        },
        {
            "text": "I remember a few days after joining the organisation I was given a file with property information forms to input into a database and at the end of the day I felt a sense of achievement. Who would have thought inputting data could make you feel like this!"
        },
        {
            "text": "Within a few weeks of working on the team, I was asked to help bind some documents for a presentation at the Valuation Tribunal (VT). This was the first time I had heard about the VT and wanted to know more. After speaking to senior colleagues, I found out about the VT process and what it meant to be a Chartered Surveyor. I felt both fascinated and inspired."
        },
        {
            "text": "Later the same day, I saw a story on our intranet about a VOA graduate scheme. Initially, I was unsure if I would be able to cope with the additional studies while working and balancing my family life at the same time. But I made the decision to apply, which was one of the best decisions in my life by far."
        },
        {
            "text": "I started the Diploma in Surveying Practice in 2007. It took me a while to complete, due to the sad loss of one of my parents during my second year but I did not give up."
        },
        {
            "text": "On completion of my Diploma, I started studying for the BSc in Estate Management. During these years I was blessed with my son, now 12 years old and my daughter who turned nine earlier this year. I also suffered a further bereavement, losing my only, and close, sibling. During this incredibly difficult time, the support and encouragement of my wonderful husband and supportive colleagues in the VOA was so important for me – I’m grateful to them for helping me through a hard period while ensuring that I could pick up where I left off when I was ready."
        },
        {
            "text": "In 2015 I had the opportunity to work in Private Office as a Personal Assistant to the Chief Executive. I completed my BSc in Estate Management in 2015 but did not attain the 2:1 grade, which was an essential requirement for RICS APC (assessment of professional competence) - another reason for me to stop dreaming about being a Chartered Surveyor. However, this was when I needed to gather all the confidence within me and seek help to find a way forward."
        },
        {
            "text": "I successfully applied for a promotion to a caseworker position, which gave me the relevant experience I needed for the APC. I then decided to self-fund my APC, by undertaking the MSc in Real Estate with University College of Estate Management which continued my APC progression."
        },
        {
            "text": "I completed MSc in Real Estate in June 2018 but the caseworker role was a temporary promotion, and I returned to my substantive grade."
        },
        {
            "text": "It took me a while to recover from this, but within months I gained a new post on promotion as a manager within our Property Data Unit and soon after a further, temporary, promotion as a caseworker in the District Valuer Services (DVS) team. I joined DVS in September 2018 and in 2019, I was successful in the VO Graduate Surveyor trawl."
        },
        {
            "text": "I have faced so many hurdles on my path to becoming a member of RICS, but the dream of qualifying as a Chartered Surveyor never left my sight."
        },
        {
            "text": "The inspiration which lit a spark of ambition in 2005 finally came to fruition in June 2021, after 16 years. The APC roller coaster is a worthwhile experience, because the end goal is very rewarding and full of opportunities."
        },
        {
            "text": "I have a long list of people who I want to thank for helping me reach my goal, but I will run out of space if I listed them all. To all those amazing and inspirational people including my husband, colleagues, managers, supervisors, and counsellors who helped me through my studies and APC journey, you all deserve more than a thank you."
        },
        {
            "text": "I would like to end my story with one of my favourite quotes."
        },
        {
            "text": "“I learned to always take on things I had never done before. Growth and comfort do not co-exist’’. Ginni Rometty - CEO of IBM from 2012 to 2020"
        },
        {
            "text": "If someone like me, from a completely different background, can attain RICS status while raising a young family, then anyone can. Stay committed, the help and support of the agency is unrivalled. I am so proud to be part of this diverse organisation."
        }
    ]
}