{
    "url": "https://socialcareinspection.blog.gov.uk/2021/07/02/care-leavers-please-give-us-your-views/",
    "title": "Care leavers – please give us your views!",
    "authors": [
        "Dr Donna Brown, Head of Research"
    ],
    "categories": [
        "care experienced",
        "care leavers"
    ],
    "pub_date": "2021-07-02T11:16:47+01:00",
    "content": [
        {
            "text": "Dr Donna Brown, Head of Research, on our care leavers survey and forthcoming research project. "
        },
        {
            "text": "Are you a care leaver, or about to leave care? Please give us your views!"
        },
        {
            "text": "Today we’ve launched a survey on planning and preparation for leaving care. We want to hear from young people who are currently preparing to leave care, and care leavers aged 16 and over. If you’ve already left care, we also want to hear about your experiences, even if you left care a long time ago. As a care-experienced person, I know the support you get when leaving care can have an impact on your life well into the future."
        },
        {
            "text": "We’d love to hear your views about the planning, preparation and support you are getting or were given for a number of things, including relationships, money, housing, employment and education. If you work with care leavers, we’d be very grateful if you could pass on the link."
        },
        {
            "text": "Our questions were co-designed with a group of care leavers and are part of a research project looking at planning and preparation for leaving care. The group helped us to understand what our survey should ask about, as well as how we should ask our questions."
        },
        {
            "text": "We want to understand what’s important to young people as they leave care, and whether planning and preparation focuses on the right things. We also want to hear from adult care leavers about whether the support they received has helped them since they left care."
        },
        {
            "text": "The findings will improve our inspections – we want to make sure we are looking at the right things in the right way. We also hope they will inform the ongoing Care Review, as well as being useful to local authorities and other service providers."
        },
        {
            "text": "You do not have to give us your name and we will not identify you when sharing the results, though we do ask which local authority (LA) is/was supporting you. We will provide summary findings to LAs on request where there is a large enough sample to ensure complete anonymity."
        },
        {
            "text": "You can ask someone else to help you fill in the survey, and we can provide it in a paper format or translated into different languages if needed. The survey will close at midnight on 19 August."
        },
        {
            "text": "Our research findings will be published later this year."
        },
        {
            "text": "If you have any queries about the survey, please contact researchquestion@ofsted.gov.uk"
        }
    ]
}