{
    "url": "https://onlinesafetydata.blog.gov.uk/2021/07/02/cdei-convenes-expert-group-to-advise-on-online-safety-data-initiative-project/",
    "title": "CDEI convenes expert group to advise on Online Safety Data Initiative project",
    "authors": [
        "Damini Satija, Senior Policy Advisor, Centre for Data Ethics and Innovation",
        "Nathan Bookbinder-Ryan, Policy Advisor, Centre for Data Ethics and Innovation"
    ],
    "categories": [
        "Governance"
    ],
    "pub_date": "2021-07-02T16:42:13+01:00",
    "content": [
        {
            "text": "The CDEI is an advisory body, led by a board of specialists, set up by the UK government to investigate and advise on how we maximise the benefits of data-driven technologies. Its goal is to create the conditions in which responsible innovation can thrive: an environment in which the public are confident their values are reflected in the way data-driven technology is developed and deployed; where we can trust that decisions informed by algorithms are fair; and where risks posed by innovation are identified and addressed. "
        },
        {
            "text": "In this blog post, we introduce the Online Harms Expert Group and explain their role in holding the OSDI to account as it continues its work to address barriers to data sharing and support innovation in the detection of online harms."
        },
        {
            "text": "The CDEI has worked across a number of different areas helping government and industry tackle online harms responsibly. Last year, we published a major review of online targeting, and hosted a forum on the role of AI in addressing misinformation, which brought together experts from a range of relevant fields, including platforms, fact-checking organisations, the media, and academia. As set out in the National Data Strategy, the Centre is also progressing a programme of work on privacy enhancing technologies (PETs)."
        },
        {
            "text": "We are supporting the OSDI through establishing and facilitating an Online Harms Expert Group. The expert group’s role is to act as a ‘critical friend’ to the OSDI by providing advice and constructive challenge at key milestones across the project lifecycle. It is composed of members from regulators, industry, civil society and academia, with a range of views and expertise on issues related to online harms and data stewardship. "
        },
        {
            "text": "This project has the potential to make a lasting impact beyond the benefits it will bring to the online harms space and safety technology companies. It could lay the foundations for a new data-sharing structure that enables the private sector, researchers and government to share and use data for public benefit, while respecting citizen rights. This could allow researchers and commercial groups to tackle problems where access to sensitive data is crucial but currently remains an obstacle to innovation. We believe this project has the potential to define a novel and pioneering form of data governance that will be replicable in areas beyond online harms.   "
        },
        {
            "text": "The Online Harms Expert Group, composed of 10 leading experts, has so far provided valuable input on the scope of the project, as well as on how to build technically feasible and impactful solutions. It has encouraged the project team to consider how the solutions will enhance users’ online experience, in addition to how they will address the needs of the safety technology industry. The group has demonstrated a multi-disciplinary skillset, bringing ethical, legal, technical and product-based topics to the table, as well as a cross-sectional view of society and internet users. Moving forward, the expert group will continue to provide feedback and advice on the Online Safety Data Initiative’s programme of work. We look forward to continuing our work with them. "
        }
    ]
}