{
    "url": "https://rpc.blog.gov.uk/2021/07/02/comments-on-the-tigrr-report/",
    "title": "Comments on the Taskforce on Innovation, Growth and Regulatory Reform (TIGRR) report",
    "authors": [
        "Stephen Gibson"
    ],
    "categories": [
        "TIGGR"
    ],
    "pub_date": "2021-07-02T11:17:57+01:00",
    "content": [
        {
            "text": "The government is planning to reform its approach to regulation to ensure that the UK takes advantage of the opportunities offered by our exit from the EU and to ensure that we regulate in a way that is as effective as possible, promoting innovation and growth. The RPC strongly supports these objectives. We see our role as helping the government deliver better regulation through ensuring that policy properly considers the costs, benefits and risks of different regulatory and non-regulatory options."
        },
        {
            "text": "Regulation and the regulatory policy-making process can have a significant impact on individuals and businesses, and it is important to think strategically about how we assess different policy alternatives. The Taskforce on Innovation, Growth and Regulatory Reform (TIGRR) report, published last week, makes a significant contribution to that debate. This blog post covers our response on aspects of that report that relate to regulatory processes and the Better Regulation Framework."
        },
        {
            "text": "In the UK we are considering reform from a position of strength – our current systems are highly regarded internationally – but there is undoubtedly potential for us to improve further in pursuit of regulating in a way that achieves the government’s objectives while minimising the burdens on UK businesses and civil society. We also recognise that government is concerned about more than just the impacts of its policies on business – for example it needs to consider the impact on the environment, our health and safety, and economic growth."
        },
        {
            "heading": 2,
            "text": "The case for enhanced Parliamentary scrutiny"
        },
        {
            "text": "The TIGRR report makes a case for enhanced Parliamentary scrutiny. We see Parliament as a key ‘customer’ for our opinions and would welcome a greater focus on the impact of proposed regulations in Parliament. We would be very pleased to discuss how we might complement any enhanced parliamentary scrutiny role and how we could work with select committees and others to deliver this."
        },
        {
            "heading": 2,
            "text": "Reducing the impacts of regulation on business - ‘One-in, Two-out’"
        },
        {
            "text": "Both the TIGRR report and John Penrose MP’s recent report ‘Power to the People’ make similar recommendations to introduce a ‘one-in, two-out’ regulatory duty on all government departments - that is for each regulation that a department wants to introduce that imposes net costs on business, it would have to introduce a deregulatory measure to reduce net costs on business by twice as much."
        },
        {
            "text": "Such an approach would encourage departments to pay close attention to, and seek to minimise, the costs of regulation on business and assess the continuing need for existing regulations."
        },
        {
            "text": "The detail of such a system needs careful consideration."
        },
        {
            "text": "In our view, a decision on whether such a requirement would help should follow a decision on which metric is used to compare impacts. A metric that is narrowly focussed - for example, only considering the direct impacts on business or netting out gains and losses within a market segment - may conflict with other government objectives such as net zero, levelling-up and new free trade agreements."
        },
        {
            "text": "We would particularly wish to avoid a situation where significant policy areas were carved-out of the scope of the framework because they involve additional costs to business. Therefore, any new mechanism would need to be flexible enough to allow for multiple objectives."
        },
        {
            "heading": 2,
            "text": "Identifying a lead cabinet minister responsible for regulatory reform"
        },
        {
            "text": "While it is clearly for the Prime Minister to decide how this should be managed within his government, we support the proposal that these issues are given appropriate priority and strategic oversight at cabinet-level."
        },
        {
            "heading": 2,
            "text": "Proportionality – recognising the impact of regulations on small businesses"
        },
        {
            "text": "We support the proposal that departments and regulators should assess whether proposed regulations are likely to have disproportionate impacts on small businesses."
        },
        {
            "text": "As part of our independent scrutiny, we are already able to rate impact assessment (IAs) as 'not fit for purpose' if there is insufficient analysis of the impacts on small and micro businesses, or a lack of consideration of whether these businesses should be exempt or benefit from mitigation of the measure. As a direct result of our scrutiny, departments have adjusted some regulatory proposals to exempt small and micro businesses (for example, provision of personal information on consumer bills in machine readable format)."
        },
        {
            "heading": 2,
            "text": "Consideration of wider impacts in impact assessments"
        },
        {
            "text": "The TIGRR report recommends that scrutiny of IAs should include consideration of the wider effects of proposed policies on innovation, competition, the environment and trade. The Competition and Markets Authority (CMA) report on regulation and competition also recommends that we should be able to red-rate IAs as ‘not fit for purpose’ based on their assessment of the impact on competition and innovation, while the Natural Capital Committee believes that we should be able to red-rate on the assessment of natural environment impacts."
        },
        {
            "text": "Our opinions already comment on the quality of evidence and analysis on a range of issues including the impact on competition, the environment/net zero, trade, distributional impacts, consumers and innovation. We have recently started providing an informal assessment of the quality of IAs’ analysis of these factors in our opinions (assessing them as: good, satisfactory, weak or very weak)."
        },
        {
            "text": "However, the Better Regulation Framework does not currently allow us to take account of these wider issues in our formal rating of IAs as green (fit for purpose) or red (not fit for purpose). Given the importance of these wider impacts to government policy, we would welcome a discussion of how the framework could be strengthened and extended."
        },
        {
            "heading": 2,
            "text": "Why is this important now?"
        },
        {
            "text": "We are pleased that the TIGRR report recognises the value of independent scrutiny of regulatory proposals and recognises the role the RPC currently plays; however, our effectiveness is limited by the framework within which we operate."
        },
        {
            "text": "The government is about to launch a review of the Better Regulation Framework. This provides an opportunity to make changes to the way the independent scrutiny process works and to ensure that it is as effective as possible in delivering better policy-making and ultimately better policy. We therefore encourage government to take on board these comments as part of the review and we ask stakeholders to support this approach in their responses to the government’s consultation."
        },
        {
            "text": "Stay up-to-date by signing up for email alerts from this blog."
        }
    ]
}