{
    "url": "https://phescreening.blog.gov.uk/2021/07/02/cruk-informed-choice-health-professionals/",
    "title": "Cancer Research UK’s role in supporting health professionals on informed choice in NHS screening",
    "authors": [
        "Rachael Ogley"
    ],
    "categories": [
        "General information",
        "NHS Bowel Cancer Screening Programme",
        "NHS Breast Screening Programme",
        "NHS Cervical Screening Programme"
    ],
    "pub_date": "2021-07-02T16:18:27+01:00",
    "content": [
        {
            "text": "In this guest blog, Rachael Ogley from Cancer Research UK talks about the role of health professionals in supporting informed choice."
        },
        {
            "text": "Cancer Research UK (CRUK) is committed to promoting informed choice in screening participation. We believe the current national NHS cancer screening programmes are important, but we also believe taking part in screening is an individuals’ choice."
        },
        {
            "text": "Health professionals have an important role to play in supporting people to make an informed choice to access cancer screening."
        },
        {
            "text": "Since COVID-19, improving access to screening is more important than ever as many people have been unable to attend in the last year. The pandemic has created new barriers and reinforced others. We need to address these while still ensuring people can make an informed choice about screening."
        },
        {
            "heading": 2,
            "text": "Addressing barriers and inequalities"
        },
        {
            "text": "Participating in NHS screening is an individual choice, but it must be a choice equally available to all. It is important health professionals understand and can recognise the barriers to participation, so they can support people accordingly. These barriers can include language and literacy, culture, fear, practicalities and hygiene concerns."
        },
        {
            "text": "For some, barriers to participation may be exacerbated by coronavirus (COVID-19) and health professionals may need to consider how they can proactively raise awareness of screening invitations and new practice processes to encourage informed participation. This might include assuring patients about the infection control measures in place and how their experience might differ to what they’re used to."
        },
        {
            "text": "Some people may need extra support so they can make an informed choice. This includes providing or signposting to accessible information in a different language or easy-read format and providing extended appointment times to accommodate people who need additional support."
        },
        {
            "text": "Inequalities in uptake are often a feature of screening programmes, not least in the bowel cancer screening programme, which has the lowest overall uptake of all the NHS cancer screening programmes. Men and people from less privileged communities are less likely to take part."
        },
        {
            "text": "To try and address this, CRUK has developed a bowel cancer screening inequalities resource to support health professionals."
        },
        {
            "heading": 2,
            "text": "Encouraging informed participation"
        },
        {
            "text": "Health professionals can encourage informed participation in NHS cancer screening programmes by:"
        },
        {
            "heading": 2,
            "text": "Tools and resources to support health professionals"
        },
        {
            "text": "CRUK communicates the latest information and evidence on cancer screening, as well as developing practical tools for health professionals to use."
        },
        {
            "text": "We have dedicated webpages and resources for health professionals to provide information on the NHS cancer screening programmes. These include information on the barriers to participation and details of evidence-based interventions that could be used in practice. This will help to encourage participation through informed choice. Studies have shown the positive impact primary care engagement can have on increasing uptake of cancer screening with eligible populations."
        },
        {
            "text": "Health professionals can also:"
        },
        {
            "text": "We also use the CRUK health professional Twitter account and Early Diagnosis newsletter to promote important messages and resources for health professionals."
        },
        {
            "text": "Health professionals have a key role to play in promoting informed uptake of screening, by raising awareness and reducing barriers for their patients. Everyone who wants to take part in screening should be able to do so, and health professionals can play an important part in helping to make this a reality."
        },
        {
            "text": "If you have any specific questions about our resources or work with health professionals, you can email us."
        },
        {
            "heading": 2,
            "text": "PHE Screening blog"
        },
        {
            "text": "The PHE Screening blog provides up to date news from all NHS screening programmes. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new blogs. If you have any questions about this blog article, or about population screening in England, please contact the PHE screening helpdesk."
        }
    ]
}