{
    "url": "https://dvladigital.blog.gov.uk/2021/07/02/dvla-develops-new-fast-online-tachograph-service-for-drivers/",
    "title": "DVLA develops new fast online tachograph service for drivers",
    "authors": [
        "Dudley Ashford"
    ],
    "categories": [
        "DVLA Digital Services"
    ],
    "pub_date": "2021-07-02T12:47:42+01:00",
    "content": [
        {
            "text": "DVLA’s digital services are some of the most used across government. I'm excited to share the latest addition – our recently launched online tachograph service for drivers."
        },
        {
            "text": "Our new online service makes applying for a tachograph card quick and easy. It significantly reduces waiting times by allowing HGV, lorry and bus drivers to apply and pay online. The service is also available to drivers renewing or replacing an existing card."
        },
        {
            "text": "The new tachograph service is part of DVLA’s ‘Evolve’ change programme, which is introducing new and re-designed customer-centric services aligned to our 3-year strategic plan. Evolve is about technological advancement for the benefit of our customers."
        },
        {
            "heading": 2,
            "text": "Building the service"
        },
        {
            "text": "The new online driver service follows the company card service, launched in 2019. This completes the move for our tachograph services from DVLA's existing mainframe system onto our secure cloud-based platform – a significant milestone for our change programme."
        },
        {
            "text": "The success of the new service will pave the way for future services to make the same move. It also means that moving future services onto cloud technology will be easier, as we won’t have to start from the beginning every time."
        },
        {
            "text": "Beth Hammacott, Agile Delivery Manager, discussed the development of the service:"
        },
        {
            "heading": 2,
            "text": "Meeting customer needs"
        },
        {
            "text": "Our aim is to make sure DVLA services are user-friendly. We want customers to have the flexibility to choose how they interact with DVLA. This means providing customers with an online alternative to the traditional paper form."
        },
        {
            "text": "John Hughes, Service Design Support, spoke about meeting customer needs:"
        },
        {
            "text": "You can see a selection of user comments below."
        },
        {
            "heading": 3,
            "text": "What our service users have said"
        },
        {
            "text": "No more fussing about with bits of paper – a few clicks and it’s done! Drivers with a GB photocard licence can now apply for their first driver tachograph card, as well as renew or replace an existing card, without having to complete any forms or obtain passport photos. All the customer needs to use the service is their driving licence number, postcode and date of birth."
        },
        {
            "text": "After the application has been submitted online, customers will receive text and email notifications to update them on its progress."
        },
        {
            "heading": 2,
            "text": "DVLA online: faster and more efficient "
        },
        {
            "text": "The new online service helps customers by reducing the time it takes to apply and receive their card. Drivers should have their new tachograph card issued within 24 hours from applying compared to 10 days or more when posting their paper applications. It’s just one of many online services designed to make things quicker and easier for our customers."
        },
        {
            "text": "It’s an exciting time at DVLA – in the coming years, expect to see many more new and improved online services that benefit millions of customers every day. If you want to be part of a busy digital team bringing transformational change to DVLA, see our latest vacancies. There is an opportunity waiting for you – so get involved!"
        }
    ]
}