{
    "url": "https://companieshouse.blog.gov.uk/2021/07/02/in-conversation-with-insolvency-service/",
    "title": "In conversation with: The Insolvency Service",
    "authors": [
        "Jodie John - Digital Content Designer"
    ],
    "categories": [
        "Companies House transformation"
    ],
    "pub_date": "2021-07-02T11:43:11+01:00",
    "content": [
        {
            "text": "Companies House drives confidence in the economy and helps to make the UK a great place to start and run a business. The data on our registers informs business decisions, supports growth and, something that is less known, plays an important and growing role in combatting economic crime."
        },
        {
            "text": "Economic crime and fraud pose a significant threat to the UK, which is why the UK government set out its Economic Crime Plan to help protect society, citizens and UK businesses from falling victim to criminals."
        },
        {
            "text": "As part of this plan, register reform will give new powers to Companies House which will enable the organisation to improve business transactions and enhance the quality and value of the financial information available on the UK companies register."
        },
        {
            "text": "Here Jane Walters, Senior Intelligence Manager of the Intelligence and Enforcement team at Companies House, and Neil Freebury, Head of Intelligence at The Insolvency Service, discuss the work being carried out within both government organisations to help tackle economic crime and fraud in the UK."
        },
        {
            "text": "Neil: “I manage the Intelligence Team and the Financial Investigation Unit, which is the asset recovery end of The Insolvency Service and is responsible for the proceeds of crime work from the criminal cases. Every day brings something new. Yesterday, my day started by speaking to a Midlands fraud forum about money laundering and coronavirus (COVID-19) crime and the importance of register reform. We talked about shell companies, their use in money laundering and why we need to reform the register.”"
        },
        {
            "text": "“Today I'm doing a witness statement for the police in relation to a group of shell companies. My days are extremely varied, and Companies House plays a large part in what I'm doing."
        },
        {
            "text": "“I work very closely with Jane and the team at Companies House to police the register and to spot fraudulent activity.”"
        },
        {
            "text": "Jane: “My role is relatively new as we’re just starting our economic crime prevention journey. We have not had these types of roles before, simply because we have not had the legislative backing to have them. But things are changing."
        },
        {
            "text": "“Now, the Intelligence and Enforcement team at Companies House is preparing the foundations for the future of our economic crime and fraud prevention activity, so it’s a very exciting time to be one of the people at the forefront of this work."
        },
        {
            "text": "“Neil has been very helpful in working with us, sharing intelligence so that we can shape how things will look in the future.”"
        },
        {
            "text": "Neil: “Before I joined The Insolvency Service 2 years ago, I was a Criminal and Financial Investigator at HMRC. Throughout that role, nearly everything I looked at came down to companies. So, for many years I've benefited from Companies House information and used its data in criminal investigations and asset recovery investigations. Companies House has for many years been a key partner of mine in my career."
        },
        {
            "text": "\"There’s always a lot of criticism about Companies House that it doesn’t police the data on the register, but I was explaining at the forum that it’s not the current role of Companies House. But register reform will help.”"
        },
        {
            "text": "Jane: “Yes, we do not have the legislative backing now to police the register in the way Neil mentions and the way we want to. But register reform will give us more powers to scrutinise the data we hold. In the meantime, we do everything we can to support law enforcement and other government organisations in their investigations into economic crime and fraud. We provide data, respond to data protection requests, write witness statements and so on."
        },
        {
            "text": "“Data sharing is another big thing for us at Companies House and that’s one of the key components of register reform. We are simplifying how data can be shared through government and with law enforcement. There are a lot of things needing to be ironed out when it comes to data sharing and we’re working on that so that we can do things properly and securely.”"
        },
        {
            "text": "Neil: “One of the challenges we have at The Insolvency Service is around technology. We're gradually building better technology into our jobs but it's a slow process. Technology also costs money, and we must make sure we deliver value through efficient use of resources, just like Companies House refers to in its strategy."
        },
        {
            "text": "“Another question we were discussing at the fraud forum was ‘how do we find the balance between the need for people to have companies and for entrepreneurs to be able to set up companies easily and quickly and use them for good purposes, but avoid the situation where criminals can then set up any number of companies to conduct illicit activity?’"
        },
        {
            "text": "“Our future activities are aimed at getting a balance between these 2 things right, so that things are not open to abuse.\""
        },
        {
            "text": "Companies House is no stranger to working with stakeholders and partners in the public and private sectors to achieve its goals. Working with the The Insolvency Service to combat economic crime and fraud is just one of the relationships the organisation has developed to bring criminals to justice."
        },
        {
            "text": "Jane: “We work with many other organisations and The Insolvency Service is one of our main partners, especially the Live Investigations Team. Although we do not have the powers at present to act on something suspicious on the register, we do not ignore it. We raise referrals to The Insolvency Service, share public information and explain our reasons why we think there is activity that needs to be looked into so it can be investigated. They have the power to do that under the part of the Companies Act that covers them, but it does not cover Companies House."
        },
        {
            "text": "Neil: “That’s right, under a gateway that has been opened for us under Section 56 of the Digital Economy Act we can freely share information with Companies House. An example of how we have used this is when we identified an attack on redundancy payments. An organised crime group with what appeared to be shell companies and false identities attempted to steal a large sum in redundancy payments. We went straight to Companies House who helped us get a handle on who was behind it."
        },
        {
            "text": "“There are many ways that we work with Companies House and that’s only going to increase when register reform happens.”"
        },
        {
            "text": "Jane: “The introduction of register reform is happening now because of how life has changed. The Companies Act is an old and long piece of legislation reflective of the business sector in the 1800s. A lot has changed since then - society and technology has dramatically evolved but I do not think you can say the same for the Act. It has not changed that much and is not keeping pace. So now it’s a big wake-up call and pressure from areas of government to say this cannot go on."
        },
        {
            "text": "“Most things globally are verifiable now, you know, you go to a website and put your details in, and it gets verified via text messages and so on. But in the UK the registrar does not have the power to verify business information. Forming a company should not be taken lightly, it is about time that people realise it. We need to keep pace with society and how things have and are continuing to evolve in the business sector.”"
        },
        {
            "text": "Neil: “I agree. I teach about financial crime all over the world for the Organisation for Economic Co-operation and Development (OECD) and it does not matter where I am, people will tell me about fraud happening in their country. I know from personal experience that UK shell companies are used by people in other countries to facilitate fraud."
        },
        {
            "text": "“Money laundering and economic crime happens across the world. It’s an international problem, but we have a crucial role to play here in the UK because so many of the shell companies committing the illegal activities are established within our borders.”"
        }
    ]
}