{
    "url": "https://healthcareleaders.blog.gov.uk/2021/07/02/message-from-sajid-javid-secretary-of-state-for-health-and-social-care-to-nhs-staff/",
    "title": "Message from Sajid Javid, Secretary of State for Health and Social Care, to NHS staff",
    "authors": [
        "Sajid Javid - Secretary of State for Health and Social Care, Department of Health and Social Care"
    ],
    "categories": [
        "Celebrating NHS staff"
    ],
    "pub_date": "2021-07-02T17:04:13+01:00",
    "content": [
        {
            "text": "To my NHS colleagues,"
        },
        {
            "text": "The NHS is an institution that is close to my heart, and the hearts of so many people across the nation. It was there for the birth of my children, and cared for my father in his final days."
        },
        {
            "text": "I feel a deep affection for the NHS, and the brilliant people who work there. As the first Secretary of State for Health from an ethnic minority, it’s a great privilege to be representing this diverse institution that represents the very best of modern Britain."
        },
        {
            "text": "I was determined to get on the frontline and see this for myself. So my first visit as Secretary of State was to St Thomas’ Hospital and vaccination centre, to meet the doctors, nurses, porters, cleaners and volunteers who’ve contributed so much to our fight against this virus, and to our vaccination programme which has given us hope of a brighter future."
        },
        {
            "text": "We’re now on the road to recovery, and just as we start the monumental task of recovering NHS services, I want to give you what you need to recover from this difficult period, and make it as easy as possible for you to do your jobs."
        },
        {
            "text": "Just as we recover we must also reform. We are modernising the Mental Health Act to improve services for the most serious mental illnesses. We’ll also keep bolstering the foundations of our NHS. Primary care will continue to be central to our plans to level up the health of the nation, and we'll continue to build more hospitals and make sure we bring even more people to the front line. Any proposal we bring forward will build on the spirit of integrated working you've embraced so enthusiastically, because we know we're at our best when we work as one."
        },
        {
            "text": "It’s so important to me that we work together to get this right, and I’m looking forward to meeting as many of you as I possibly can, and to hearing your views."
        },
        {
            "text": "You’ve all done so much to support this country through this tough 18 months. I will do everything in my power to support the NHS, as we put this pandemic behind us and look ahead to the next chapter."
        },
        {
            "text": "Sajid Javid, Secretary of State for Health and Social Care"
        }
    ]
}