{
    "url": "https://environmentagency.blog.gov.uk/2021/07/02/taking-decisive-action-on-illegal-vehicle-breakers/",
    "title": "Taking decisive action on illegal vehicle breakers",
    "authors": [
        "elenaholmes"
    ],
    "categories": [
        "Regulated industry",
        "Waste"
    ],
    "pub_date": "2021-07-02T15:17:27+00:00",
    "content": [
        {
            "text": "Delphine Dauba-Pantanacce, Director, Legal Counsel, Global Regulatory at eBay, discusses the work the online marketplace is doing with the Environment Agency to educate sellers of used vehicle parts.  "
        },
        {
            "text": "Now more than ever, customers are looking for affordable but environmentally conscious alternatives when they shop. This means that while the second-hand car parts market is a huge area of potential for the used car trade and circular economy, for us at eBay it also raises a host of regulatory issues."
        },
        {
            "text": "This is why eBay is pleased to have been approached by the Environment Agency to work with them to help educate sellers on our platform. By informing sellers to display their permit numbers, or the name of the site where the parts were sourced from means more transparency while enhancing trust for purchasers. This single collaborative action between us and the Environment Agency has an immediate effect on the level of compliance rates; sellers are not allowed to sell vehicle car parts on our platform without holding an environmental permit."
        },
        {
            "text": "Business sellers can find a section on the Seller’s Hub dedicated to the environmental permit requirements and the importance to display their permit number in their listing. A pop-up message is also displayed once sellers list used vehicle-parts within the listing process. In addition, we have organised a massive sellers’ outreach programme in order to highlight that an environmental permit is needed to break vehicles; sellers are directed to GOV.UK where they can get further information."
        },
        {
            "text": "eBay’s contribution to supporting the Environment Agency’s compliance efforts on the sale of vehicle parts sourced from illegal breakers is significantly impacting those illegal breakers to rethink their business. They are not allowed to trade on our platform without an Environment Agency permit in place."
        },
        {
            "text": "We want to ensure buyers are confident in their purchases, but also that sellers are responsible and aware of the Environmental Permitting Regulations. Our partnership with the Environment Agency has been vital in better protecting the public who may unknowingly purchase parts from illegal traders’."
        },
        {
            "text": "Thanks to Authorised Treatment Facilities, we have seen an increase in buyer confidence, set a benchmark for the vehicle dismantling industry and provided consumers with potential cost savings of up to 80% when buying second-hand vehicle parts."
        },
        {
            "text": "Our work with the Environment Agency is incredibly valuable to us as part of our ongoing collaboration with authorities and public sector agencies around the world and in the UK, including Westminster Trading Standards and Office for Product and Safety Standards."
        },
        {
            "text": "We truly believe that collaboration is key when it comes to keeping marketplaces and other online platforms safe for consumers, and we also applaud the efforts of sellers to ensure that all second-hand car parts have been obtained in compliance with the Environmental Permitting Regulations."
        },
        {
            "text": "We hope that this successful partnership, which is still growing and progressing further in 2021, leads the industry and sets an example of effective collaboration between private companies and the public sector, with everyone working towards a common goal of consumer protection."
        }
    ]
}