{
    "url": "https://nationalscreening.blog.gov.uk/2021/07/02/uk-nsc-bob-steele/",
    "title": "Meet the UK NSC: Bob Steele, chair",
    "authors": [
        "Prof Bob Steele"
    ],
    "categories": [
        "General"
    ],
    "pub_date": "2021-07-02T14:46:35+01:00",
    "content": [
        {
            "text": "It’s hard to believe it’s been 5 years since I was appointed chair of the UK National Screening Committee (UK NSC)."
        },
        {
            "text": "I had previously applied to be a cancer specialist member of the UK NSC but was unsuccessful. A few months later, I applied for the position of chair and was successful!"
        },
        {
            "text": "When I first became chair, I wrote about the challenges ahead and how I was looking forward to learning a great deal and making a difference to the health of the nation."
        },
        {
            "heading": 2,
            "text": "The last 5 years"
        },
        {
            "text": "Looking back, one of the things I’m most proud of from the past 5 years is the way in which the UK NSC has really put evidence at the heart of our recommendations and developed a rigorous process for doing this."
        },
        {
            "text": "I can’t take all the credit for this, though, and I have been very fortunate to work with an incredible executive and evidence team. My fellow committee members have also been a pleasure to work with. They are motivated, principled, intelligent – and a lot of fun!"
        },
        {
            "text": "The past 18 months has been particularly challenging for everyone, in health care and beyond. The COVID-19 pandemic has taught me that I value direct human contact above everything else, as do most of my friends and colleagues. From a public health perspective, I hope our experiences of the past year and a half will make us more proactive in future pandemics."
        },
        {
            "heading": 2,
            "text": "The future of the UK NSC"
        },
        {
            "text": "Looking ahead to the future of screening and the UK NSC, there are several challenges and opportunities over the next few years. The move to considering targeted screening for high-risk groups and stratified screening more tailored to the individual is one example. Similarly, the genomics revolution will also have a profound impact on the way we work in the not-too-distant future."
        },
        {
            "text": "Thanks to our wonderful NHS, I believe our population screening programmes here in the UK are second to none, and long may that continue. Having said that, we must avoid complacency. Screening is an imprecise science and there will always be room for improvement."
        }
    ]
}