{
    "url": "https://mojdigital.blog.gov.uk/2023/01/31/delivery-managers-share-the-advice-that-changed-their-practice-forever/",
    "title": "Delivery Managers share the advice that changed their practice forever",
    "authors": [
        "Laura Payten",
        "Lianne Mellor"
    ],
    "categories": [
        "Our services"
    ],
    "pub_date": "2023-01-31T18:14:50+01:00",
    "content": [
        {
            "heading": 3,
            "text": "Looking backwards propels you forwards"
        },
        {
            "text": "No one in the Delivery Management profession has had the same journey into their careers, but we all started somewhere. We’ve shared the diversity of routes into the profession in blogs from Nic, Amy & Chris. "
        },
        {
            "text": "Famously there isn’t an instruction manual for how to be a delivery manager although there are some great starting points of the skills needed in Emily Webber’s blog, Jonny William’s blog as well as book & DDaT Guidance. There are principles & frameworks that can be learnt in the form of the agile manifesto, Scrum Guide, Kanban etc. But In the words of Nic Macken “you don’t learn to drive a car by reading the manual” - the best way to learn to be a Delivery Manager is by doing it."
        },
        {
            "text": "You can help yourself by trying things out, reflecting, iterating your approach, then trying it again. But in our experience feedback & advice from others is the rocket fuel that propels the development of new skills, the honing of your craft and progression within the profession."
        },
        {
            "heading": 3,
            "text": "Where did this come from?"
        },
        {
            "text": "Each week the delivery profession has Open Doors - opportunities for short 1:1s with Lianne, Head Delivery Management to talk about anything that’s on people’s minds. A theme recently emerged around career moves and progression in digital and the delivery profession. People found constructive feedback and advice very impactful. We thought it would be nice to gather those snippets of wisdom together from the profession as a whole. We started a thread on Slack, and it turned up gold. What follows is a summary of that advice in 7 easily digestible, actionable insights. Enjoy! "
        },
        {
            "heading": 3,
            "text": "Advice "
        },
        {
            "text": "You can’t fix everything for everyone"
        },
        {
            "text": "It feels good to help people out, and Delivery Managers tend to have a predisposition for having a ‘helpers’ mentality. But it’s not your role to fix everything for everyone. You can’t do it all. Prioritise, delegate & create a sense of ownership & empowerment across the team. There will always be areas that are ripe for improvements, but the skill is in choosing which of those are a priority for you to improve right now, and what can be left. "
        },
        {
            "text": "Know when to wear different hats"
        },
        {
            "text": "As a Delivery Manager we often find ourselves helping a team or organisation look ahead to an end goal for ways of working and delivery, however it is important that we don’t get stuck in the theory. We can’t start at the end - the utopia of a self-managing team where the delivery manager is redundant - we have to bring people and teams along on the agile maturity journey with us. The journey is not always linear, teams can go backwards in maturity as well as forwards. It's therefore important to apply the right kind of support at the right moment; whether it be directing, delegating, facilitating or coaching. Switching between these different modes of support, or wearing these different ‘hats’ at the right moment, will help your team navigate the winding path ahead of them.  "
        },
        {
            "text": "Stop finding a way to say ‘yes’ to all"
        },
        {
            "text": "Saying ‘yes’ to people’s ideas or wants feels good in the moment, but it can also lead to diluted ideas, committing to too much work or avoiding difficult conversations or conflict. Instead, flex your facilitation skills to surface where differences of opinion exist. Help find a route forward, and share the rationale behind any decisions. It won’t always be possible to get universal agreement, but you can get to a place of mutual understanding & support of the decision if people understand the ‘why’ behind the ‘what’."
        },
        {
            "text": "You can’t control everything"
        },
        {
            "text": "It can feel like it’s your job to control the space that your team works in. From facilitating meetings and ceremonies, to maintaining emotional equilibrium in the team during conflict. You can spend a lot of time worrying about making sure you have everything under control for the team, rather than creating the environment for the team to be able to handle problems such as conflict or confusion themselves. Identify whether you are truly facilitating, or trying to steer the outcome. Understand that your colleagues are human and will have emotional responses, but trust that you should give each person the space to have those feelings and provide a healthy and constructive space to do so - rather than controlling them away. "
        },
        {
            "text": "Don’t copy paste approaches"
        },
        {
            "text": "There are common frameworks & ways of working that support agile principles. They are a useful starting point for helping teams focus on delivering value and realising the benefits of an agile approach. However a mantra that one of our Lead Delivery Manager’s holds dear is “One for all, not one size fits all”, reflecting the individual nature of teams and the environments they operate in. Nurture meaningful relationships with people. Build trust and create ways of working that help people focus on delivering the things that matter most. This may mean that you need to adapt tried and tested methods to best fit the people in your team and their individual needs. Leave your agile jargon at the door."
        },
        {
            "text": "Complement, don’t compete with your team"
        },
        {
            "text": "We often work in very technical domains on complex challenges. It can raise feelings of insecurity or imposter syndrome when you don’t understand the detail of everything that’s being discussed. However it’s important to know that you don't need to understand all of the technical detail, you need to trust that someone else in the team does and create the environment for them to be heard. This may mean that you need to request a plain english description of the topic at hand so that others in the team can share in the understanding. Your role as a facilitator means that you can ask questions to identify where there are knowledge gaps, but you don’t have to be the one to fill them. "
        },
        {
            "text": "Avoid taking too many words to get your point across, for fear that something might get slightly misunderstood"
        },
        {
            "text": "Be succinct"
        },
        {
            "heading": 3,
            "text": "What the reader can do next "
        },
        {
            "text": "If you’ve made it all the way to this point - congratulations! You’ve reached the part where we now encourage you to reflect on what made this blog possible. This all started from Delivery Managers sharing some of the stand out pieces of advice or feedback they’ve received during their careers so far. Consider giving the gift of feedback to colleagues around you, or sharing this blog if you found it useful. The key to good feedback or advice is about caring personally and challenging directly - but a whole blog could be written on that! Did any of these pieces of advice resonate with you? Perhaps you can reflect on what changes or experiments you’d like to make with how you work to change things up."
        },
        {
            "text": "Finally, think back on meaningful feedback or advice you have received, and consider what’s made an impact on your career or personal development - feel free to share it in the comment box below!"
        },
        {
            "text": " "
        }
    ]
}