{
    "url": "https://environmentagency.blog.gov.uk/2023/01/31/how-carbon-literacy-training-inspired-me-to-trim-more-than-23-tonnes-off-my-personal-carbon-footprint/",
    "title": "How Carbon Literacy training inspired me to trim more than 23 tonnes off my personal carbon footprint",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Environment Agency"
    ],
    "pub_date": "2023-01-31T11:20:51+00:00",
    "content": [
        {
            "text": "Jennifer Howard is an Asset Performance Advisor who has worked in Flood and Coastal Risk Management for the Environment Agency for 18 years. Her work is focussed on flood incident response. Here, she talks about how her background and how carbon literacy training motivated her to take steps to mitigate her environmental footprint."
        },
        {
            "text": "Working patterns are not what they used to be in this new ‘normal’ world, post COVID lockdown."
        },
        {
            "text": "Working from home for many including myself has allowed more flexible working patterns, a welcome change from the stresses of commuting, noisy office working and hotdesking. Home working saves fuel, time and lowers the risk of catching all the usual office colds that go round."
        },
        {
            "text": "It doesn’t come without disadvantages, however."
        },
        {
            "text": "Home energy use is higher due to having the heating on during the winter months, increased cooling in the extreme hot summer months, and increased daily electric usage."
        },
        {
            "text": "The impacts of climate change have been felt more keenly this past year. According to the Met Office, 2022 was the UK’s warmest year ever with annual average temperature being 10°C for the first time, the record of 40.3°C was set at Coningsby, Lincolnshire, just 15 miles away from my home. We’ve also seen drought declared and extreme rainfall conditions leading to flooding. I felt it that the time is now to take action personally to reduce my carbon emissions where possible."
        },
        {
            "text": "I’m a Physical & Environmental Geography graduate, so I’ve been interested in how humans are affecting the status-quo of the planet since I was a teenager. I’m keen to learn about and mitigate the effects of everyday carbon emissions – and our impact through working at the Environment Agency."
        },
        {
            "text": "In 2021, the day after COP26, the Environment Agency launched its Carbon Literacy learning programme. Developed with input from the Carbon Literacy Trust, it supports all colleagues to learn about their work and personal footprints and the impacts of greenhouse gases on climate change."
        },
        {
            "text": "In fact, the EA’s just been granted ‘Gold’ level accreditation by the Trust because 5,000 members of staff have now completed the training! The Environment Agency is the first government body to reach the milestone and aims to be the first to reach Platinum accreditation – the highest level – later this year."
        },
        {
            "text": "Even before I did the training, I’ve already worked hard to make small changes in lifestyle and consumption over many years to reduce my personal footprint. Simple things like taking my own bags to the supermarket (even before the plastic bag ban), using a refillable water bottle and travel mug, and taking my own box for takeaway food supporting the local village community café. I recycle as much as possible within the local council scheme, avoiding excess plastic packaging and taking soft plastics to the local Co-Op for recycling. I have swapped to sustainable products such as reusable water filter cartridges (changing just the active granules) that are delivered in cardboard and use fabric/washable sanitary products."
        },
        {
            "text": "I’ve also started using kinder, plant-based cleaning products, dishwasher tablets, compostable sponges, reusing cleaning spray bottles and concentrates, composting kitchen waste, growing vegetables, and buying local produce including potatoes from the farm 1 mile away."
        },
        {
            "text": "Having appliances repaired locally where possible and buying efficient ones when required, repairing clothes and wearing them for many years, and only buying what I need, helps with the bigger picture. As does really thinking about where I can enjoy a break in the British countryside to relax and enjoy the outdoors sustainably."
        },
        {
            "text": "However, through my carbon literacy training, I realised that doing all these small things are great and will contribute to the lowering of my footprint – but to make a big difference we need to reduce our use of fossil fuels themselves including electricity production, gas use and fuel for the car.  Through the training I learnt that without significant global action to reduce emissions, the world is currently on track for a rise of 3°C rise by the end of the century bringing more frequent extreme weather such as flooding and drought. We as individuals need to take action to meet the UK’s Net Zero target which sounds daunting. However, the training encourages you to do what you can, not focus on what you can’t – eliminate, reduce, focus on the actions that make a big difference, and tell others about it to inspire them to action."
        },
        {
            "text": "Using the World Wildlife Fund carbon footprint calculator, I found out that my main footprint was from my home (44%) but my small changes so far had already lowered my total carbon usage (9.94 tonnes) to less than my regional average  of 13.2 tonnes."
        },
        {
            "text": "So late last summer, I made the decision to go ahead with the ‘big difference’ decision – the installation of 15 solar panels on the roof of my home, along with re-chargeable batteries to provide power during the night and reduced daylight conditions. With the system predicted to generate an estimated 4172kWh per year1, it will generate enough energy enough for my 3-bed home – and more. I’ll be able to export what I don’t use through the Smart Export Guarantee, selling back to the grid. Using the Energy Saving Trust’s Solar Energy Calculator2, the system will potentially save just under 1000kg/year with a lifetime (25 year) saving of more than 23 tonnes worth of CO2, the equivalent of how much CO2 would be locked away by 27 acres (or 13.5 football pitches) of forest in one year3. The system will pay for itself in less than 10 years – perhaps sooner with the current cost of electricity!  The installation has just been completed, in late January 2023, and with Spring nearly upon us, the sun will shine brightly on my little part of the world."
        },
        {
            "text": "Whilst the cost of a personal electric car is still out of reach, I’m using my petrol car less by working from home, and I’ll be considering getting a bike through the Environment Agency’s Cycle to Work scheme to get to the local depot 5 miles away."
        },
        {
            "text": "Still got lots of changes to make overtime, but I feel more confident that I’m doing something for the future of the planet."
        },
        {
            "text": "I feel it’s really important to live more sustainably and to look after, be part of, and respect the natural world. Everyone has a part to play in mitigating our human impact and fight climate change, reducing the impacts of extreme weather and the risk of flooding to all."
        },
        {
            "text": "Find out more about the Environment Agency’s plan to reach net zero at: Environment Agency: reaching net zero by 2030"
        }
    ]
}