{
    "url": "https://hodigital.blog.gov.uk/2023/01/31/how-the-ddat-profession-framework-supports-our-business-analysts/",
    "title": "How the DDaT Profession Framework supports our Business Analysts",
    "authors": [
        "Simon Daly, Head of DDaT Product Profession",
        "Rosie Lyons, Lead Business Analyst"
    ],
    "categories": [
        "Business Analyst",
        "Product"
    ],
    "pub_date": "2023-01-31T14:04:02+00:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "This is the third post in our Digital, Data and Technology (DDaT) Profession series. The series aims to explain how the DDaT Profession Framework provides a clear career and continuous learning structure for our colleagues in digital, data and technology roles."
        },
        {
            "heading": 2,
            "text": "Business Analysts: Part of the DDaT Product and Delivery Profession"
        },
        {
            "text": "The product and delivery job family sits within the DDaT Profession Capability Framework. That framework sets out the skills needed for digital, data and technology roles in government."
        },
        {
            "text": "Several job titles fall within the product and delivery job family:"
        },
        {
            "text": "Let’s look more closely at the role of the Product Profession at Home Office DDaT, and specifically Business Analysts."
        },
        {
            "heading": 2,
            "text": "What do our Business Analysts do?"
        },
        {
            "text": "Business Analysts are embedded right across the Home Office in every major project, programme, product and service. Business Analysts help our teams:"
        },
        {
            "heading": 2,
            "text": "What skills do our Business Analysts use?"
        },
        {
            "text": "Our Business Analysts use their skills, techniques and tools to deliver a wide range of services described in the following diagram:"
        },
        {
            "heading": 2,
            "text": "Various routes into becoming a Business Analyst at the Home Office"
        },
        {
            "text": "There are several entry points to becoming a Business Analyst at the Home Office. Our foundation entry routes are our Apprenticeships (open to all) and Dynamic Development Schemes (open to graduates). Both of these schemes are aimed at people with no or limited business analysis experience."
        },
        {
            "text": "We advertise our roles on Civil Service Jobs for those with varying degrees of business analysis skills and experience."
        },
        {
            "text": "We also support people who want  to start or develop a career as a Business Analyst."
        },
        {
            "text": "We’re very proud of the work our Business Analysts do and the way they support the Home Office in achieving its outcomes. Rosie Lyons, who joined us as a Business Analyst apprentice and has since secured several promotions to Lead Business Analyst, describes her role."
        },
        {
            "heading": 2,
            "text": "‘A day in the life of a Business Analyst at the Home Office’: Meet Rosie"
        },
        {
            "text": "Hi, I’m Rosie. I joined Home Office DDaT in February 2019 as an apprentice Business Analyst."
        },
        {
            "text": "I’d been studying an English degree but quickly realised I’d prefer an apprenticeship so I could learn and become qualified while gaining hands-on experience in a specific profession. I was attracted to the Civil Service because of the supportive working environment."
        },
        {
            "heading": 2,
            "text": "What does my day look like?"
        },
        {
            "text": "On a typical day I’ll work on multiple projects within a multi-disciplinary team. This involves scoping out the work that needs to be completed, agreeing this with the relevant business area and undertaking the business analysis in conjunction with stakeholders and users to drive positive outcomes."
        },
        {
            "text": "I undertake stakeholder analysis, process modelling and requirements engineering. I work in an agile environment and deliver projects and services iteratively to best meet the business and user need."
        },
        {
            "text": "I’ve worked on high-profile cross-government health and safety projects. I’ve also led project phases for the Forensic Science Regulator and Independent Examiner of Complaints."
        },
        {
            "text": "It’s a privilege to play a role in making positive differences to peoples’ lives every day."
        },
        {
            "heading": 2,
            "text": "Continuous professional development"
        },
        {
            "text": "The DDaT Profession Framework encourages us to manage our own continuous professional development. Through on-the-job experience and by taking up lots of opportunities to develop my skills I’ve been able to secure three promotions since my apprenticeship ended."
        },
        {
            "text": "I’ve received encouragement from my managers to complete an International Diploma in Business Analysis and am now working towards the Advanced International Diploma in Business Analysis. I’m also completing the Home Office Advance Talent Programme to support my development as a future leader."
        },
        {
            "text": "Not only am I given scope to develop as a Business Analyst in my role, I’ve also had the opportunity to work in related specialisms such as User Research and Product Management."
        },
        {
            "heading": 2,
            "text": "Contributing to, and being supported by, a community"
        },
        {
            "text": "We have a well-established Business Analyst community in DDaT, supported by a network of Principal Business Analysts and a Head of Role. There are plenty of other community groups to get involved with. For example, some of us are members of a business process modelling working group."
        },
        {
            "text": "One of the highlights of my work as a Business Analyst in DDaT so far has been the opportunity to present at the International Business Analysis Conference in 2020."
        },
        {
            "heading": 2,
            "text": "The value of being mentored and of mentoring"
        },
        {
            "text": "As an apprentice I received mentoring from a colleague in another area of DDaT. Not only did this strengthen my network across the organisation, but it played a vital role in driving my development forward."
        },
        {
            "text": "As this mentoring relationship had such a great impact on my learning I was keen to give something back. After completing my apprenticeship, I initiated monthly mentoring sessions for the newest intake of Business Analyst apprentices and became the first DDaT Apprenticeship Ambassador."
        },
        {
            "text": "Currently, I mentor colleagues who want to make the transition into the business analysis profession."
        }
    ]
}