{
    "url": "https://lifeathmrc.blog.gov.uk/2023/01/31/industrial-placements-at-hmrc/",
    "title": "Industrial Placements at HMRC",
    "authors": [
        "Nicola Barson"
    ],
    "categories": [
        "Digital Skills",
        "Digital workplace",
        "Digital world",
        "General",
        "Graduate",
        "Industrial Placements",
        "Recruitment",
        "University placement"
    ],
    "pub_date": "2023-01-31T15:56:41+00:00",
    "content": [
        {
            "text": "Our industrial placements are a fantastic opportunity for university students to take time out of their studies to gain real experience and develop business skills and knowledge before returning to university to complete their degree."
        },
        {
            "text": "At HMRC, we offer industrial placements for students currently studying a degree in IT, computer science, design/web design or business. These placements are paid and typically last around 9-12 months. "
        },
        {
            "text": "We recently caught up with 3 graduates who shared with us their experiences on placement and how this has helped them in their journey."
        },
        {
            "text": "Matthew"
        },
        {
            "text": "\"A placement year at HMRC is a great chance to experience a hands-on, exciting, and important role in public service (I can assure you; you won’t be making cups of tea here). "
        },
        {
            "text": "In my year in industry, I worked as a Project Support Officer working with incredible colleagues across HMRC and beyond to bring about key IT changes that will benefit our customers for years to come. That’s what makes the industrial placement at HMRC so special, the fact that at the end of the working week you know that you have in some way made a difference to the millions of HMRC customers up and down the country.  "
        },
        {
            "text": "On returning to university, I found that the transferable skills I had developed on the placement year, such as communication, time management, problem solving, helped me to be a better final year student and improved the way I worked in final year. "
        },
        {
            "text": "The opportunities on offer once you have graduated are endless in HMRC, and a placement year is a great stepping-stone to reach those opportunities. I couldn’t recommend enough applying for the industrial placement at HMRC!\""
        },
        {
            "text": "Zulekha"
        },
        {
            "text": "\"I joined HMRC as an Associate Solutions Architect Industrial Placement student in September 2021. Throughout my placement journey, I learnt about solution architecture, tax and HMRC in general; my colleagues showed immense support towards providing me with relevant material and answering all my questions which allowed me to successfully complete the solution architecture activities I was assigned to."
        },
        {
            "text": "I also developed key skills such as confidence, communication and presentation and was able to work in a space full of learning opportunities and great development. Having had such a positive and memorable experience and the best environment I could ever have imagined, I am now looking to pursue a career in solution architecture at HMRC after I graduate.\""
        },
        {
            "text": "James"
        },
        {
            "text": "\"During my penultimate year of university, I found my Industrial Placement within HMRC’s CDIO IT Delivery team, as an IT Project Support Officer. The placement was extremely beneficial to my professional development. I was thrown straight into the deep end, supporting multiple large-scale legislative projects such as introducing a new Student Loan Scheme for Scotland, and Post Graduate Loans. Then, in 2020, I supported my Senior IT Project Manager to deliver the Major Covid Schemes infrastructure at pace. This was a great opportunity to be involved in such important work to ensure the UK public were supported through such a tough time."
        },
        {
            "text": "I have since continued to advance and become an Associate IT Delivery Manager, using my experience from the placement to deliver various projects. The support from my team is great and there are plenty of learning opportunities, such as Industry Standard qualifications and accreditations.\""
        },
        {
            "text": " "
        },
        {
            "text": "Industrial placement applications usually open in the autumn for the following September start. Make sure you check back later in the year for opportunities in September 2024. For more information on careers at HMRC click here. "
        }
    ]
}