{
    "url": "https://ukhsa.blog.gov.uk/2023/01/31/making-progress-on-the-global-mission-to-develop-pandemic-fighting-tools-within-100-days/",
    "title": "Making progress on the global mission to develop pandemic-fighting tools within 100 days",
    "authors": [
        "Isabel Oliver"
    ],
    "categories": [
        "Health security"
    ],
    "pub_date": "2023-01-31T17:19:11+01:00",
    "content": [
        {
            "text": "COVID-19 reinforced to the world that the early days of a pandemic are crucial. It also demonstrated the art of the possible when governments, industry and academic work at pace to translate science into public health action."
        },
        {
            "text": "With this impetus, a global mission began in 2021 to ensure that the best weapons we have to defeat pandemics - diagnostics, therapeutics and vaccines – could be deployed within 100 days of recognising a new threat."
        },
        {
            "text": "This week the International Pandemic Preparedness (IPP) Secretariat published its 2022 Implementation Report on this “100 Days Mission”, building on a previous report published in 2021."
        },
        {
            "text": "This is an important moment to reflect on the world’s progress and also re-state the UK’s commitment to this effort which has the potential to save millions of lives as well as protect our economies and public services in the event of a future pandemic."
        },
        {
            "text": "And though the 100 Days Mission recognises that speed is of the essence in a pandemic, the initiative also has health equity at its heart, ensuring that diagnostics, therapeutics and vaccines are available in a timely manner in low- and middle-income countries."
        },
        {
            "text": "Here in the UK, we’ve made important progress towards this ambition, and I’m delighted that the UK Health Security Agency (UKHSA) has recently taken on the role of the UK’s Secretariat for the 100 Day Mission, with responsibility to co-ordinate and champion our progress."
        },
        {
            "text": "As the nation’s newly formed health security agency, UKHSA is well placed to work with our partners across governments, industry and academia to keep up momentum, as well as driving our own contribution to this essential mission forward."
        },
        {
            "heading": 3,
            "text": "Taking action to achieve the 100 Days Mission"
        },
        {
            "text": "The 100 Days Mission sets out 25 recommendations that the global community should take, which can be split into key themes. The UK has much to offer across all of these. A brief snapshot of some recent UK-led projects includes:"
        },
        {
            "heading": 3,
            "text": "Looking forward"
        },
        {
            "text": "UKHSA continues to strengthen its contribution to the 100 Days Mission."
        },
        {
            "text": "As part of our responsibility for co-ordinating the UK contribution to the Mission, we are looking forward to engaging with a wide array of partners across government, academia and industry to further enhance this collective effort which could save many lives."
        },
        {
            "text": "This includes building on existing and working through new initiatives such as the newly established Centre for Vaccine Development and Evaluation and a new Diagnostics accelerator."
        },
        {
            "text": "At this moment as we reflect on both global and UK progress, I’d like to thank colleagues and partners who’ve contributed to this important collective effort so far. I look forward to making more progress with you during 2023."
        }
    ]
}