{
    "url": "https://ipo.blog.gov.uk/2023/01/31/meet-the-ipo-board-ceo-adam-williams/",
    "title": "Meet the IPO Board: CEO Adam Williams",
    "authors": [
        "Jenny Manders"
    ],
    "categories": [
        "Innovation",
        "IPO",
        "Transformation"
    ],
    "pub_date": "2023-01-31T14:04:52+00:00",
    "content": [
        {
            "text": "In December 2023, Adam Williams was announced as IPO’s new CEO. After 13 years at the IPO, he isn’t a totally unknown quantity, but we talked to Adam to find out more about his background, his IPO journey and his aspirations for IPO’s future."
        },
        {
            "heading": 3,
            "text": "Where did your career journey start?"
        },
        {
            "text": "After university, I joined the Royal Air Force as an RAF Navigator, flying the Tornado fighter bomber. Several years later saw me working for the Ministry of Defence (MOD) in London."
        },
        {
            "text": "It was a really interesting time, working on operations with the UN and the EU alongside Civil Servant colleagues in the MOD, Foreign Office and overseas colleagues from the IPO, as well. It struck me at the time what a really interesting and talented group of people I was working with. There was lots of commitment to ‘do the right thing’."
        },
        {
            "heading": 3,
            "text": "What led you to join the IPO?"
        },
        {
            "text": "When the time came to leave the Air Force, it was at a natural break in my commission. I wanted to do something a bit different. Having previously completed an MBA, I was really interested in the business world: what makes innovation tick and how businesses grow. "
        },
        {
            "text": "My decision to join IPO was as simple as location in the first instance. My family and I wanted to move back to South Wales. A job was advertised with the Intellectual Property Office, and with it being based in Newport, that was a fantastic hook really."
        },
        {
            "text": "I joined the IPO working in copyright policy. I was fortunate to be able to call on my international experience in various countries around the world, working with the UN, the EU Commission and ‘the Council’ as it was at the time."
        },
        {
            "heading": 3,
            "text": "How have your 13 years with IPO shaped your experience of the organisation?"
        },
        {
            "text": "Having worked at the IPO for more than a decade, I've gained quite a lot of experience in what it does. I've worked in a variety of areas, first in copyright policy and then international policy, where I was the director for international and business support areas."
        },
        {
            "text": "I've also worked very closely with our rights-granting, IT and digital teams. I led the development of our Brexit programme in terms of the trade negotiations, Brexit Withdrawal Agreement and our IT project to transfer trade mark and design rights from the EU onto the UK register. As a result, I am fortunate to have received a really great insight into what the whole of the Office does. "
        },
        {
            "heading": 3,
            "text": " What do think the IPO does well?"
        },
        {
            "text": "What's always really impressed me with the Office is the level of diligence. The level of customer service and the commitment to get things right and make sure that the service we provide is the best it possibly can be."
        },
        {
            "text": "That diligence applies across all areas of the office, and I think that's a real credit to us. I know that's what our customers value."
        },
        {
            "text": "Staff numbers have grown considerably since I first joined. That's partly because of the increase in demand for rights, but also because of our transformation programme and the work we're doing there."
        },
        {
            "text": "We've still got more to do, and we've still got more to grow, but we’re building on the resilience we developed during the pandemic to change, adapt, and build for the future."
        },
        {
            "heading": 3,
            "text": "You’ve navigated a Tornado, now you’re leading the IPO. Where will IPO’s future focus be?"
        },
        {
            "text": "There are some parallels. It's about planning. I think it's about being organised, it's about thinking to the future."
        },
        {
            "text": "When you're travelling in a fast aircraft at low level, you're constantly looking far ahead to make sure you're prepared for the next thing you need to do. I think that need for foresight applies to running an organisation of our size, too."
        },
        {
            "text": "There are three main focus areas that stand out to me: our transformation programme, the IP framework, and then our people."
        },
        {
            "heading": 3,
            "text": "Our IPO service transformation"
        },
        {
            "text": "I'm hugely excited about the ongoing transformation of our services and what we know we're going to deliver. There's a real benefit for our customers and for our people in terms of the way we do things. We’re making processes more efficient, making them easier and allowing people to change things more quickly."
        },
        {
            "text": "Actually, for those familiar with the Field of Dreams movie with Kevin Costner, there's a bit of “build it and they will come”. I'm just as excited about what we know our transformation programme will give us, as I am about future benefits it may bring that we may not know about yet. "
        },
        {
            "heading": 3,
            "text": "An IP framework fit for the future"
        },
        {
            "text": "Thinking of the policy arena, we’re absolutely focused on making sure that the UK IP system remains one of the best in the world and is also fit for the future."
        },
        {
            "text": "So, it's that future point again - making sure that we're adapting the framework to trends in digital services such as music streaming, which is obviously a huge focus. It’s important that we know what the future trend for digital commerce is and what the trends for businesses are. We need to make sure that the policy environment enables businesses and doesn't get in the way, ensure that it’s an enabler rather than a blocker."
        },
        {
            "text": "We also need to make sure that the IP system is fair and that it’s fit for purpose. It needs to support businesses using it as a way to protect and monetise their assets, but it also needs to protect consumers, who are really important as well. Consumers that use IP-protected goods need to be able to access them and use them in a really effective way. That's hugely important for our policy teams."
        },
        {
            "heading": 3,
            "text": "Investing in our people"
        },
        {
            "text": "Our people are another major focus area. We need to make sure that we've got the right people in the right places. The organisation will change as we head into the future, there's no point in pretending otherwise, but we need to make sure that we give our people the opportunities to develop along with the organisation. We’ll place talent where it's required and let people learn from each other and transfer that knowledge."
        },
        {
            "text": "Ultimately, what I’m most looking forward to is helping the organisation find its way along that pathway."
        }
    ]
}