{
    "url": "https://aphascience.blog.gov.uk/2023/01/31/nobel-house-prize-winners/",
    "title": "APHA Weybridge team wins Nobel House Prize for avian influenza outbreak response",
    "authors": [
        "Heather O'Sullivan"
    ],
    "categories": [
        "APHA news",
        "Viral diseases"
    ],
    "pub_date": "2023-01-31T10:59:16+00:00",
    "content": [
        {
            "text": "Our APHA Weybridge science team that provided rapid science evidence informing disease control policy for the 2021/22 avian influenza outbreak, which is continuing, has been made joint winner of the Nobel House Prize for 2021, announced late in 2022."
        },
        {
            "heading": 3,
            "text": "Celebrating high quality analysis and science"
        },
        {
            "text": "The annual prize was launched in 2019 to celebrate high quality and impactful analysis and science across the whole Defra group and is named after one of Defra’s main London offices, Nobel House."
        },
        {
            "text": "It recognises the important role of high quality, timely, proportionate and well designed and communicated analysis to help support and steer decision-making."
        },
        {
            "text": "Our winning team is a large team of skilled APHA scientists and diagnosticians primed to respond to incursions of high pathogenicity avian influenza (HPAI). They are trained to work at the highest biosecurity level in the handling of infectious samples."
        },
        {
            "text": "While the prize is awarded for their work during 2021, they are continuing to use their skills and expertise every day to support the current outbreak."
        },
        {
            "heading": 3,
            "text": "Innovative approach"
        },
        {
            "text": "The team developed a novel test to confirm the presence of HPAI, enabling the UK Chief Veterinary Officer to make rapid declarations of HPAI on a premises, saving time in converting temporary control zones into surveillance/protection zones. This enabled field and policy activities to get under way more rapidly, significantly reducing the risk of further spread of disease."
        },
        {
            "text": "The team also tailored their response across England, Wales, Scotland and Northern Ireland to introduce more streamlined processes while still ensuring that the science and diagnostics remains internationally compliant."
        },
        {
            "text": "As pressures on field operations increased, the laboratory assessed sample positivity seen on the different types of swabs taken from animals, usually poultry, during disease investigations. They were able to demonstrate that oropharyngeal (OP) swabbing (swabbing the back of the bird’s throat) was most sensitive for the detection of HPAI within the whole flock. This meant that the team could recommend that only OP swabs needed to be taken from animals in the field for surveillance activities. This has significantly reduced pressures in the field because staff are able to take fewer samples for testing and so can work more quickly and efficiently, and this has enabled financial savings as well."
        },
        {
            "text": "Furthermore, through their knowledge of how the virus affects the animal host, they were able to recommend a refinement of blood sampling to exclude sampling chickens and turkeys. This meant that technical staff could take samples on the majority of premises, enabling field vets to take blood from waterfowl species as necessary, bringing time and cost savings across the full spectrum of outbreak response."
        },
        {
            "text": "Finally, the team based at Weybridge linked rapidly with colleagues at the UK Health Security Agency (UKHSA) in the diagnosis of influenza of avian origin in a human in the UK. This high-profile case led to countless international press releases and global interest. The team used its expertise to investigate and assess the risk of HPAI spreading from animals to humans (zoonotic risk). This work, along with other activities, has been submitted to high profile scientific journals and really demonstrates the value and importance of the APHA team, in their efforts to reduce the One Health impact from HPAI."
        },
        {
            "text": "This science programme of work has been strongly complimented by the independent Defra Science Advisory Council."
        },
        {
            "text": "Well done to all involved!"
        },
        {
            "text": "Due to the strength of nominations for 2021, the prize was shared with the Defra team modelling the spatial implications of land use change. Congratulations also go to our co-winners."
        },
        {
            "heading": 3,
            "text": "Subscribe to our science blog"
        },
        {
            "text": "Throughout the year, we publish blogs which highlight the breadth of scientific work we are involved in as well as sharing our latest news and events we have attended."
        },
        {
            "text": "Subscribing to our blog takes seconds and you will receive instant email alerts as soon as new blogs are published so why not subscribe today!"
        }
    ]
}