{
    "url": "https://defrafarming.blog.gov.uk/2023/01/31/what-the-environmental-improvement-plan-means-for-you/",
    "title": "What the Environmental Improvement Plan means for you ",
    "authors": [
        "Stephen Ayres"
    ],
    "categories": [
        "environmental land management schemes",
        "Payments for research and innovation",
        "Payments to improve soil health",
        "Payments to improve tree health",
        "Payments to make space for nature",
        "Payments to plant trees and manage woodland",
        "Payments to restore landscapes and ecosystems"
    ],
    "pub_date": "2023-01-31T16:39:43+00:00",
    "content": [
        {
            "text": "The Environmental Improvement Plan sets out the actions we must take to help us restore nature, tackle environmental pollution, and increase the prosperity of our country. "
        },
        {
            "text": "Published today on GOV.UK, it builds on both the 25 Year Environment Plan and the Environment Act 2021. The former sets out what we will do to improve the environment, within a generation. The latter sets out our legally-binding, long-term targets to restore nature.  "
        },
        {
            "text": "In this post, I’d like to explain what the Environmental Improvement Plan means in the context of our work and, by extension, what this means for farmers and land managers in England. "
        },
        {
            "text": "I’ll also share an update on the Farming in Protected Landscapes programme which was also announced in the plan.  "
        },
        {
            "text": "We’ve previously said that we are aiming to have around 70% of farmers in our schemes by 2028. "
        },
        {
            "text": "The Environmental Improvement Plan takes that further and says we are aiming for between 65 to 80% of landowners and farmers to adopt nature friendly farming on at least 10-15% of their land by 2030.  "
        },
        {
            "text": "That’s at a high level. Focusing in on specific sections of the plan, we can see just how important these reforms, and therefore farmers are, to improving the environment.  "
        },
        {
            "heading": 2,
            "text": "Habitat restoration and creation  "
        },
        {
            "text": "Farming, through a combination of regulation and public and private schemes, will contribute 80 to 100% of the target to restore or create more than 500,000 hectares of wildlife-rich habitat outside of protected areas by 2042."
        },
        {
            "text": "This reflects the unique role that farmers have — carrying out actions such as restoring peatland and creating biodiverse woodlands. "
        },
        {
            "text": "These changes are needed at scale but the habitats must be in the right place and have the right management. For that reason, many cases will require targeted advice and support to succeed."
        },
        {
            "heading": 3,
            "text": "You can be paid to help achieve these ambitions through:"
        },
        {
            "heading": 2,
            "text": "Species abundance and extinction risk   "
        },
        {
            "text": "We expect farming and land management to contribute at least 50% of our 25 Year Environment Plan goal of bringing 75% of protected sites into favourable condition by 2042.  "
        },
        {
            "text": "This might include activities to reduce the impact of invasive non-native species on sites as well as addressing pressures on what are often sensitive areas. For example nutrient or sediment run-off contributing to poor water quality. "
        },
        {
            "text": "These sites are hugely important for ensuring species have strongholds from which they can expand, through a farmed landscape that is more welcoming for them. "
        },
        {
            "text": "Outside of protected sites, we want to see the continuation of well-managed priority habitats. We also want newly restored or created habitats to be managed through our schemes by 2042."
        },
        {
            "text": "We also want approximately 15% more native woodlands to get into ‘favourable condition’ and 75% of England's woodlands into sustainable management by 2040.  "
        },
        {
            "text": "To create habitats for relevant species and support carbon sequestration we need more trees across the landscape. "
        },
        {
            "text": "We will achieve this in a way that limits the impact on food security by a mixed approach that combines trees as part of food producing systems (agroforestry), creation of smaller woodlands, and larger scale woodland creation where appropriate."
        },
        {
            "text": " By 2050, taken together these measures will achieve approximately 90% of the Environment Act target to increase tree cover to 16.5% of England’s land area by 2050. "
        },
        {
            "text": "That might mean as much as 10% of our arable land being managed for trees and crops by the same timeline. "
        },
        {
            "heading": 3,
            "text": "You can be paid to help achieve these ambitions through: "
        },
        {
            "heading": 2,
            "text": "Water quality and water demand "
        },
        {
            "text": "We expect that our farming reforms, a combination of public and private schemes and regulation will contribute at least 80% of the progress required to deliver our target to reduce nitrogen, phosphorus and sediment pollution from agriculture into the water environment. "
        },
        {
            "text": "We think that remainder can be met through other improvements made by the farming and environmental land management sector, such as developments in soil and nutrient management. "
        },
        {
            "text": "As we adapt to a changing climate, we will work with the farming sector to improve water storage and management, and therefore the resilience of industry. This will also help to meet our target to reduce the use of public water supply.  "
        },
        {
            "text": "We will do this through changes to abstraction and water licensing, as well as through offering grant funding such as the Water Management grant, like we did last year. We aim to increase the percentage of water storage used by the agriculture and horticulture sectors by 66% by 2050.   "
        },
        {
            "text": "Alongside fair, proportionate and effective regulation targeted to high-risk areas and farms, we will support farmers by helping them meet the cost of improved infrastructure and equipment. A short-term period investment to bring the sector up to date, after which we will step up our regulatory activities and enforcement to prevent pollution from poor slurry storage and/or management.  "
        },
        {
            "heading": 3,
            "text": " You can be paid to help achieve these ambitions through: "
        },
        {
            "text": "Finally, farmers across England will have face-to-face help on this journey from the recently expanded Catchment Sensitive Farming partnership. It has already helped farmers on over 21,000 holdings plan to reduce pollution risk and access the right grants and incentives. "
        },
        {
            "heading": 2,
            "text": "Net zero "
        },
        {
            "text": "Changes in farming practice are required if we are to limit emissions. We need to make those changes whilst maintaining agricultural profitability and increasing productivity. "
        },
        {
            "text": "The Plan restates that we will provide incentives and grants to farmers to decarbonise agricultural emissions through adopting sustainable land management approaches, new technology, and innovative practices to improve farm efficiency.  "
        },
        {
            "heading": 3,
            "text": "You can be paid to help achieve these ambitions through:"
        },
        {
            "heading": 2,
            "text": "Farming in Protected Landscapes "
        },
        {
            "text": "As I mentioned earlier in the post, the Farming in Protected Landscapes programme will be extended by a year to March 2025.  "
        },
        {
            "text": "The programme provides funding for farmers and other land managers to work in partnership with National Parks and AONBs (Areas of Outstanding Natural Beauty) in England to deliver projects across 4 themes: climate, nature, people and place. "
        },
        {
            "text": "So far, the programme has supported 1,800 projects and there are nearly 2000 farmers and land managers engaged.  "
        },
        {
            "text": "You can learn more about the programme by watching a short video we posted about the Lake District National Park, just one of the 44 Protected Landscapes in England working closely with farmers to deliver the programme. "
        },
        {
            "text": "The programme is still open to all farmers and land managers within an AONB or National Park in England, or the Broads. "
        },
        {
            "text": "More information on what the programme will pay for and how to apply can be found on the Farming in Protected Landscapes guidance page. "
        },
        {
            "heading": 2,
            "text": "Next Steps "
        },
        {
            "text": "We are improving and expanding our schemes to make them more accessible and attractive. We want to offer farmers and land managers a wide range of options at higher levels of ambition, and to encourage and enable them to take joined-up action across local areas.  "
        },
        {
            "text": "We published further information on the range of actions we will pay for through these schemes earlier this month in the Agricultural Transition Plan Update, which was summarised in this blog post. "
        },
        {
            "text": "We also expect private investment in public goods to continue to expand over the coming years, and we are developing and implementing policy to support this. "
        },
        {
            "text": "We will continue to work with farmers and land managers to ensure we achieve these targets in the most effective way, and in a way that works best for farmers and farm businesses and supports our commitment to maintain domestic food production. If you have any questions about our approach, leave a comment below.  "
        },
        {
            "text": "Finally, if you’re eligible for BPS, you can get free, independent business advice. An adviser in your area will explain the changes to farming in England and help you plan for the future. Visit the page of advisers on GOV.UK. You can make contact with them directly. "
        }
    ]
}