{
    "url": "https://dwpdigital.blog.gov.uk/2023/01/31/why-im-volunteering-as-a-stem-ambassador/",
    "title": "Why I’m volunteering as a STEM Ambassador",
    "authors": [
        "Karl Dickman"
    ],
    "categories": [
        "Inclusion",
        "Product Manager",
        "STEM",
        "Transforming Together",
        "Volunteering/Community"
    ],
    "pub_date": "2023-01-31T15:36:45+00:00",
    "content": [
        {
            "text": "Karl Dickman, senior product manager, DWP Digital "
        },
        {
            "text": "For the last year I’ve been volunteering as a STEM Ambassador for the North East, encouraging young people in the region to consider a future career in digital. Lack of diversity in STEM roles continues to be an issue, and through this volunteering work I hope to make an impact in addressing this within my local community. "
        },
        {
            "text": "Growing up, I’d never have thought I’d end up working in a technology role. It wasn’t something I was told about as an option and was something I thought was only for people who were good at subjects like maths and computer studies.  "
        },
        {
            "text": "However, now that I’m working as a product manager in a digital organisation, I’m passionate about raising awareness of the wide variety of roles that are available, as well as the different routes you can take into a tech career.   "
        },
        {
            "heading": 2,
            "text": "Igniting passion and diversity in STEM "
        },
        {
            "text": "For me, the lack of diversity in STEM goes beyond the nine protected characteristics.  As someone who grew up in a household on benefits, I want to inform and guide young people from all socio-economic backgrounds about the different career paths available within digital. "
        },
        {
            "text": "And now that I’m a dad to a little girl, I want her to have every available opportunity to discover where her passions lie and ensure she has the resources and encouragement to pursue them. Which is why it’s so important to foster that excitement and awareness around STEM subjects.  "
        },
        {
            "text": "As part of the STEM Ambassador role, I go along to schools in the region for careers ‘speed dating’ events. At the events, children between the ages of 8 and 16 get the opportunity to ask me anything and everything about my role as a product manager at DWP Digital. Being quite a new discipline, there’s not a lot of awareness within the schools of what a product manager does. So, I enjoy being able to spark an interest in the children in something that hadn’t ever previously thought about as a future job. "
        },
        {
            "text": "It’s also a great opportunity to educate the younger generation about some of the less techy roles that are available within the digital industry. I deliver workshops that focus on transferrable skills and how, for example, historians make good data analysts as they often start with an idea based on some preliminary research, make some assumptions, doing more research and then refining your analysis or argument along the way. Another example is those involved in sport. Many jobs in STEM - especially digital fields - often require coaches and people who are good leaders. If you’re a team captain for example, then these skills are just as much in demand certainly with emerging roles such as scrum masters and project managers. "
        },
        {
            "text": "I like to try and make things fun for the children with some practical sessions on prototyping on paper as in Product Design we don’t start by sitting down and writing lines of code or even opening a computer programme. So, for this exercise I give the children a sheet of flip chart paper and some pens. I set them the challenge which is usually something like: “Your school is building an app and it has asked you for ideas as to what it will do and look like”. Then we start drawing screens and features with an emphasis on what problems are we solving and why this would be needed. I ask the teams to present back and give the other teams chance to ask questions too. Prototyping on paper is what we do in real product design, so it’s great to see it being done by kids because it shows them that it’s not always technical what we do. "
        },
        {
            "text": "We also do engineering challenges. My two favourites are building the tallest structure they can with four A4 sheets of paper and only three bits of sticky tape, and the other is a Lego challenge. This involves the children sitting back-to-back in chairs. One builds something using the first handful of blocks pulled from the tub and the other gets handed the same individual loose pieces. They have to use effective communication so that the child with the loose pieces builds a replica of the pre-built thing.   "
        },
        {
            "text": "Aside from generating a few laughs, all of these exercises are great at showing some of the skills that we need in STEM fields that aren’t technical at all. It shows that some of them already have the skills that can be built upon too and gives them a great sense that it would be possible to work in the area. "
        },
        {
            "heading": 2,
            "text": "Working with impact in government "
        },
        {
            "text": "Through the STEM Ambassador role, I’ve also been able to raise awareness of Civil Service careers as a whole. In Newcastle, almost everyone knows someone who works at ‘the Ministry’ – the local nickname for the Longbenton site home to DWP and HMRC. But beyond that, there’s not that much awareness of what actually goes on inside this huge iconic building. So, it’s been great speaking to the younger generation about some of the exciting things that we’re working on here and how our work impacts the lives of almost everyone in the country at some point in their lives. "
        },
        {
            "heading": 2,
            "text": "Supporting our communities "
        },
        {
            "text": "At DWP Digital, we’re actively supported to become volunteers, as it’s recognised as something that can bring real benefits to personal development, as well as the communities we serve. This is reflected in our special leave policy which enables colleagues to take paid time off from work to provide voluntary services to the local community.  "
        },
        {
            "text": "I’m proud to work for an organisation that sees the benefits of volunteering and is also taking positive actions to redress the diversity issues within tech. We’ve got many networks and groups that are helping champion diversity and inclusion. "
        }
    ]
}