{
    "url": "https://defrafarming.blog.gov.uk/2022/01/22/agricultural-shows-in-2021-come-and-talk-to-us/",
    "title": "Agricultural shows in 2022",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Things we're doing"
    ],
    "pub_date": "2022-01-22T14:53:55+00:00",
    "content": [
        {
            "text": "Agricultural shows bring people together: to network, to do business, to give the public a glimpse into farming life."
        },
        {
            "text": "For those of us in Defra, ag shows give us the chance to meet people up and down the country from all kinds of farming backgrounds. It’s a valuable opportunity for us to better understand the experiences and views of the farming community who can shape our ideas, ask questions and offer challenge."
        },
        {
            "text": "A team of policy officials, subject matter experts and engagement colleagues will attend each show, ready to take questions and speak to you about the changes ahead."
        },
        {
            "heading": 3,
            "text": "Co-design"
        },
        {
            "text": "The co-design team will be at a number of the agricultural shows. They will have dedicated research areas set up. They'd like members of the farming community to participate in their short and interactive co-design activities."
        },
        {
            "text": "A range of policies, schemes and services across the programme will be explored – these will vary on each day at each show. There will be the opportunity to talk with the wider team too."
        },
        {
            "text": "There’s no need to book or dedicate a set time to participate in our co-design activities. The team will be operating on a walk-in basis, adhering to the current health and safety guidelines."
        },
        {
            "text": "To find out more about our co-design work at the ag shows, email ffcpcodesign@defra.gov.uk"
        },
        {
            "heading": 3,
            "text": "Where we’ll be"
        },
        {
            "text": "We'll be at events all over the country in 2022. Look out for the Future Farming stand."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": "Of course, if the situation changes and the events are cancelled, we’ll update the plan."
        },
        {
            "text": "Look out for us at Defra’s stand. We’re really looking forward to seeing you there."
        }
    ]
}