{
    "url": "https://naturalengland.blog.gov.uk/2023/03/31/changing-seasons-on-the-natural-england-board/",
    "title": "Changing seasons on the Natural England Board",
    "authors": [
        "Tony Juniper"
    ],
    "categories": [
        "Natural England"
    ],
    "pub_date": "2023-03-31T13:11:58+01:00",
    "content": [
        {
            "text": "By Tony Juniper CBE, Chair"
        },
        {
            "text": "This time of year is all about rebirth and renewal and so it is with the Natural England Board, the body that provides our strategic leadership, oversight and assurance."
        },
        {
            "text": "As the Chair, it’s my duty and honour to thank two esteemed and long-standing Board members whose terms are now ending, and to welcome aboard three new members who will build on their predecessors’ achievements and help to drive forward our organisation at an exciting time for Nature."
        },
        {
            "text": "Dr Andy Clements, who along with Prof Michael Winter steps down this month, has served on the Board for nine years and has chaired Natural England’s Science Advisory Committee. His deep knowledge of the science of conservation – and indeed its legal framework – has been instrumental in guiding our deliberations on designating Sites of Special Scientific Interest and moving towards a ban on burning on some designated areas of blanket bog."
        },
        {
            "text": "I know that, as a prominent ornithologist, Andy is particularly proud of the hen harrier brood management trial which has helped these highly threatened birds to breed in record numbers over the last two years. He has also chaired the National Nature Reserve Partnership with great vigour and passion, which has helped to shift our NNRs on from being places that hold on to the fragments Nature we have, towards being places where Nature can recover and thrive under a variety of ownership, as demonstrated by places like Holkham in Norfolk, Lancashire’s Ribble Estuary and Somerset Wetlands."
        },
        {
            "text": "Michael has spent seven years on the Board where his rural policy and social science expertise have been invaluable, particularly in relation to the government policies on Bovine TB and agri-environment schemes."
        },
        {
            "text": "He has also chaired our Social Science Expert Panel, ensuring that Natural England receives high-quality, independent social science advice and challenge and is able to strengthen its relationship with the wider social science community."
        },
        {
            "text": "Michael and Andy have been exceptionally valuable members of our Board; we will all miss them greatly and wish them the very best for the future."
        },
        {
            "text": "I am delighted that Prof Mel Austen, Dr Lynn Dicks and Dame Caroline Spelman are all joining the Board and bringing a range of skills and experience. Mel and Lynn are both prominent in science and conservation, Mel from a marine and society perspective and Lynn from an insect and agriculture viewpoint, while Caroline has a wealth of high-level political experience from her time as an Environment Secretary and MP, not to mention experience of the agriculture industry too."
        },
        {
            "text": "They join the Board at a time when the focus on Nature recovery has never been keener. Government, society and business are increasingly united in their belief that the Nature and climate crisis must be tackled urgently if we are to secure the health of our economy and our future. As a result, we are now locked into targets that we must meet if we are serious about handing over the environment to the next generation in a better state."
        },
        {
            "text": "Natural England, with its partners, has a huge role to play in making sure the science and the relationships are in place to move the country towards those targets in a clear and orderly way. Our new Board members will be a big part of guiding and overseeing the organisation in that vital work."
        },
        {
            "text": "I am also pleased to say that we now have our very first Board apprentice. Kirsten Newble is part of the Boardroom apprentice programme run through the Department for Levelling Up, Communities and Housing. It offers learning, development and placement opportunities to those interested in serving on a public or third sector board, and seeks to enable a wider diversity of individuals to play their part in boardrooms across the country. It is great to have Kirsten attending Board and I look forward to working with her – and our three new Board members - in the future."
        }
    ]
}