{
    "url": "https://dvladigital.blog.gov.uk/2023/03/31/dvlas-top-tips-for-staying-safe-online/",
    "title": "DVLA’s top tips for staying safe online",
    "authors": [
        "Phil Morgan"
    ],
    "categories": [
        "DVLA Digital Services"
    ],
    "pub_date": "2023-03-31T14:29:59+01:00",
    "content": [
        {
            "text": "\n[English] - [Cymraeg]"
        },
        {
            "text": "Our online services are the quickest, easiest and often cheapest way to transact with DVLA. Whether that’s renewing your driving licence, telling us you’ve sold a vehicle or making a SORN, by going online, you can be sure to receive a speedy and efficient service."
        },
        {
            "text": "We regularly remind our customers of the importance of only using GOV.UK, the official government website. We want our customers to feel safe and secure when using our online services, so we’ve asked Phil Morgan, Head of Fraud Policy Investigations, for his top tips in staying safe online and recognising fraudulent activity."
        },
        {
            "heading": 2,
            "text": "1. Make sure you only use GOV.UK, the official government website"
        },
        {
            "text": "The best advice we can provide is to only use GOV.UK for DVLA’s services. Some websites can look like they’re affiliated with DVLA or claim to be part of an official government service when they’re not."
        },
        {
            "text": "These are third-party companies which often charge a premium for passing a driver’s details through to us when it’d be cheaper or free on GOV.UK. For example, our renew your driving licence at 70 service is free on GOV.UK, whereas some customers have been charged a premium by using a third-party website."
        },
        {
            "text": "These sites can appear high up in the results of a Google search, so to avoid being caught out, make sure www.gov.uk is included in the URL."
        },
        {
            "text": "If you’re in doubt, you can also search on GOV.UK to find all our online services."
        },
        {
            "heading": 2,
            "text": "2. Never share your personal details online"
        },
        {
            "text": "Make sure you never give out personal details such as date of birth, National Insurance number or driving licence number on social media. Similarly, if you post pictures of your official documents such as your log book (V5C) or driving licence, scammers can steal your information to commit fraud."
        },
        {
            "text": "It’s also important to remember not to share your V5 document reference number – particularly to a prospective purchaser."
        },
        {
            "heading": 2,
            "text": "3. Be vigilant on social media"
        },
        {
            "text": "There’s been an increase in the number of fake social media accounts that either claim to be DVLA or affiliated with us in some way. These accounts promise to offer driving licence renewals or replacement documents at a speedier rate, however, an application made through a third-party company is not processed any quicker than one received through our official GOV.UK services. We’ve listed DVLA’s official social media channels on GOV.UK, so you can be sure you’re at the right place."
        },
        {
            "heading": 2,
            "text": "What we are doing to prevent fraudulent activity"
        },
        {
            "text": "Aside from regularly reminding our customers of the importance of only using GOV.UK, we also encourage customers to be vigilant and to familiarise themselves with how to recognise fraudulent emails, texts, websites and calls. We actively pursue any scams reported to us and remove the website, or the URL link, where it is appropriate to do so."
        },
        {
            "heading": 2,
            "text": "What you can do"
        },
        {
            "text": "Our online services are completely safe and secure to use, so other than ensuring you’re only using GOV.UK to transact with DVLA, if you come across any suspicious activity, you can play your part in helping us combat fraud by:"
        },
        {
            "text": "You can access our many online services available on GOV.UK. For the latest information about our services, you can sign up to our email alerts."
        },
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "heading": 1,
            "text": "Cynghorion gorau DVLA am gadw'n ddiogel ar-lein"
        },
        {
            "text": "Ein gwasanaethau ar-lein yw’r ffordd gyflymaf, hawsaf ac, yn aml, rataf i drafod â DVLA. P'un a yw hynny'n adnewyddu'ch trwydded yrru, rhoi gwybod inni eich bod wedi gwerthu cerbyd neu wneud HOS, drwy fynd ar-lein, gallwch fod yn sicr o dderbyn gwasanaeth buan ac effeithlon."
        },
        {
            "text": "Rydym yn atgoffa ein cwsmeriaid yn rheolaidd o bwysigrwydd defnyddio GOV.UK yn unig, sef gwefan swyddogol y Llywodraeth. Rydym am i'n cwsmeriaid deimlo'n ddiogel wrth ddefnyddio ein gwasanaethau ar-lein, felly rydym wedi gofyn i Phil Morgan, Pennaeth Ymchwiliadau Polisi Twyll, am ei awgrymiadau gwych o ran cadw'n ddiogel ar-lein a chydnabod gweithgarwch twyllodrus."
        },
        {
            "heading": 2,
            "text": "1. Gwnewch yn siŵr eich bod yn defnyddio GOV.UK yn unig, sef gwefan swyddogol y llywodraeth"
        },
        {
            "text": "Y cyngor gorau y gallwn ei ddarparu yw i ddefnyddio GOV.UK yn unig ar gyfer gwasanaethau DVLA. Gall rhai gwefannau edrych fel eu bod yn gysylltiedig â DVLA neu'n honni eu bod yn rhan o wasanaeth swyddogol gan y llywodraeth pan nad ydyn nhw."
        },
        {
            "text": "Cwmnïau trydydd parti yw'r rhain sy'n aml yn codi premiwm am basio manylion gyrrwr drwodd inni pan fyddai'n rhatach neu'n rhad ac am ddim ar GOV.UK. Er enghraifft, mae ein gwasanaeth i adnewyddu eich trwydded yrru yn 70 am ddim ar GOV.UK, tra bod rhai cwsmeriaid wedi gorfod talu premiwm wrth ddefnyddio gwefan trydydd parti."
        },
        {
            "text": "Gall y gwefannau hyn ymddangos yn uchel yng nghanlyniadau chwiliad Google, felly er mwyn osgoi cael eich dal allan, gwnewch yn siŵr bod www.gov.uk yn cael ei gynnwys yn yr URL."
        },
        {
            "text": "Os oes gennych unrhyw amheuaeth, gallwch hefyd chwilio ar GOV.UK i ddod o hyd i'n holl wasanaethau ar-lein."
        },
        {
            "heading": 2,
            "text": "2. Peidiwch byth â rhannu eich manylion personol ar-lein"
        },
        {
            "text": "Gwnewch yn siŵr nad ydych byth yn rhoi manylion personol fel dyddiad geni, rhif Yswiriant Gwladol na rhif trwydded yrru ar y cyfryngau cymdeithasol. Yn yr un modd, os ydych yn postio lluniau o'ch dogfennau swyddogol fel eich llyfr log (V5CW) neu'ch trwydded yrru, gall sgamwyr ddwyn eich gwybodaeth i gyflawni twyll."
        },
        {
            "text": "Mae'n bwysig cofio hefyd i beidio â rhannu eich cyfeirnod dogfen V5CW - yn enwedig gyda darpar brynwr."
        },
        {
            "heading": 2,
            "text": "3. Byddwch yn wyliadwrus ar y cyfryngau cymdeithasol"
        },
        {
            "text": "Bu cynnydd yn nifer y cyfrifon cyfryngau cymdeithasol ffug naill ai'n honni eu bod yn DVLA neu eu bod yn gysylltiedig â ni mewn rhyw ffordd. Mae'r cyfrifon hyn yn addo cynnig adnewyddiadau trwydded yrru neu ddogfennau amnewid ar raddfa gyflymach, fodd bynnag, nid yw cais a wneir drwy gwmni trydydd parti yn cael ei brosesu'n gynt nag un a dderbynnir drwy ein gwasanaethau GOV.UK swyddogol. Rydym wedi rhestru sianeli cyfryngau cymdeithasol swyddogol DVLA ar GOV.UK, felly gallwch fod yn sicr eich bod yn y lle iawn."
        },
        {
            "heading": 2,
            "text": "Beth rydyn ni'n ei wneud i atal gweithgarwch twyllodrus"
        },
        {
            "text": "Ar wahân i atgoffa ein cwsmeriaid yn rheolaidd o bwysigrwydd defnyddio GOV.UK yn unig, rydym hefyd yn annog cwsmeriaid i fod yn wyliadwrus ac i ymgyfarwyddo â sut i adnabod e-byst, negeseuon testun, gwefannau a galwadau twyllodrus."
        },
        {
            "text": "Rydym yn mynd ati i ddilyn unrhyw sgamiau a adroddwyd inni a dileu'r wefan, neu'r ddolen URL, lle mae'n briodol gwneud hynny."
        },
        {
            "heading": 2,
            "text": "Beth allwch chi ei wneud"
        },
        {
            "text": "Mae ein gwasanaethau ar-lein yn gwbl ddiogel i'w defnyddio, felly ar wahân i sicrhau eich bod ond yn defnyddio GOV.UK i drafod â DVLA, os dewch ar draws unrhyw weithgaredd amheus, gallwch chwarae eich rhan wrth ein helpu i frwydro yn erbyn twyll drwy:"
        },
        {
            "text": "Gallwch gael mynediad at ein llu o wasanaethau ar-lein sydd ar gael ar GOV.UK. I gael y wybodaeth ddiweddaraf am ein gwasanaethau, gallwch gofrestru ar gyfer ein hysbysiadau e-bost."
        }
    ]
}