{
    "url": "https://naturalengland.blog.gov.uk/2023/03/31/natural-englands-nutrient-mitigation-scheme-devised-to-protect-our-waterways-from-pollution-and-enable-home-building-has-now-launched/",
    "title": "Natural England’s Nutrient Mitigation Scheme, devised to protect our waterways from pollution and enable home building, has now launched",
    "authors": [
        "Mike Burke"
    ],
    "categories": [
        "Biodiversity",
        "Protected sites and species",
        "Site of Special Scientific Interest"
    ],
    "pub_date": "2023-03-31T10:07:16+01:00",
    "content": [
        {
            "text": "By Mike Burke, Programme Director – Sustainable Development"
        },
        {
            "text": "Nutrient pollution is an urgent problem for freshwater habitats and estuaries which provide a vital home to many species including wetland birds, fish, and insects. Increased levels of nutrients such as nitrogen and phosphorus can disrupt natural processes and harm wildlife. We know that nature is fundamental to human health and prosperity, so impacts are felt by all of us in society."
        },
        {
            "text": "The government has already taken significant action to tackle this problem. However, in some catchments, pollutant levels in recent years have reached critical levels that require additional intervention to ensure that Local Planning Authorities can have confidence in permitting new housing. 74 Local Planning Authorities have been advised that future development may need to be nutrient neutral. We recognise the challenges this creates for developers in additional costs and delays on development and Natural England is very focussed on working with the sector to find solutions."
        },
        {
            "text": "Since the announcement of a Natural England-led Nutrient Mitigation Scheme by Government in July 2022, Natural England has been working closely with Defra (Department for Environment, Food & Rural Affairs), DLUHC (Department for Levelling Up, Housing and Communities), the Environment Agency, Homes England, the Planning Advisory Service and Local Planning Authorities. Government set us a unique challenge to establish a working scheme within eight months from scratch. I’d like to sincerely thank the amazing Natural England team leading this work as well as the long list of partners and stakeholders who have supported us and enabled us to rapidly to set up a scheme that we can all have confidence in. Defra and DLUHC are investing up to £30 million to fast track the delivery of nutrient mitigation in affected areas through, for example, creating new wetlands to 'soak up’ or mitigate the impacts of unavoidable nutrient pollution."
        },
        {
            "text": "The scheme will facilitate the delivery of thousands of new homes. It forms part of the wider package of support that Government is providing to deliver new homes, promote access to green space, and contribute to nature recovery."
        },
        {
            "text": "This is in addition to the provisions in the Levelling Up and Regeneration Bill that will place a legal duty on water companies in specific areas in England to upgrade wastewater treatment works to the highest technically achievable levels by 1 April 2030. These upgrades will reduce the pollution burden from housing in sensitive areas and reduce the amount of mitigation required by developers."
        },
        {
            "text": "The scheme is now open to all developers in the Tees catchment\nLaunched today (31 March 2023) in the Tees catchment, the credit scheme will provide a quick and simplified mechanism for developers to purchase nutrient credits to discharge their obligations under the Habitats Regulations, as outlined below (click on the image for full size chart):"
        },
        {
            "text": "Nutrient credits will be offered in rounds for which developers can apply. Guidance on how to apply for credits, and an application form is available on GOV.UK. Announcement of further rounds will be made here. The next 3 rounds in the Tees catchment will be open from:"
        },
        {
            "text": "While the scheme has now launched, it will not meet the demand for mitigation in all locations. The Nutrient Mitigation Scheme will work in combination with existing projects already in place or under development including nutrient credit trading schemes, LPA-led mitigation schemes and onsite mitigation solutions integrated into the design of housing developments."
        },
        {
            "text": "To assist:"
        },
        {
            "text": "Next Steps"
        },
        {
            "text": "Natural England is working with partners to identify suitable sites for mitigation in other areas impacted beyond the Tees, focusing first on catchments with the highest housing needs. Our teams are working proactively with developers and Local Planning Authorities to understand where the demand for credits is greatest and using this to target our work with land managers to identify land suitable to provide mitigation."
        },
        {
            "text": "We are also working proactively with land managers, developing feasibility studies in The Broads, River Wensum and Stodmarsh catchments to determine how suitable the land is for delivering mitigation. The outcome of these studies will inform the pipeline of sites that Natural England will invest in to generate the next nutrient credit rounds."
        },
        {
            "text": "Wetlands take time to construct and become functional. Natural England recognise this and have developed a strategy where temporary mitigation solutions are utilised to bridge the gap between when a wetland is commissioned and when it becomes functional, therefore allowing planning permissions to be granted sooner."
        },
        {
            "text": "Credit Pricing"
        },
        {
            "text": "The credit price is determined by calculating the cost of delivering the mitigation solution, its ongoing monitoring and maintenance including inflationary pressures, as well as administrative costs.\nIn the Tees catchment, where land is being purchased/leased to facilitate the delivery of permanent credits, the cost for one credit in the first round has been set at £1,825."
        },
        {
            "text": "And finally...\nTo deliver nature recovery and grow our economy we need to develop and deploy innovative tools. The new Nutrient Mitigation Scheme is a great example of how we can both deliver nature recovery and support sustainable development. With its launch in the Tees, we are at the start of a period of collaboration with partners and customers where we innovate in order to achieve nature recovery and sustainable development.\nDelivering nutrient neutrality can only be an interim solution. Government has taken significant action to tackle pollution at source and restore our protected sites and is committed to going further to meet environmental targets. Government is also providing greater funding, certainty and support to enable developers to meet mitigation requirements in the short term. Natural England will continue to work in partnership with government, farmers, land managers, Local Authorities and business to restore our rivers so that they can play their full part in nature recovery and our own health and prosperity."
        },
        {
            "text": "If you have a query that is not covered by:"
        },
        {
            "text": "Please email the nutrient mitigation team at nutrientmitigation@naturalengland.org.uk"
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}