{
    "url": "https://veteranstoday.blog.gov.uk/2023/03/31/new-move-for-better-deal-for-women-veterans/",
    "title": "New move for better deal for women veterans",
    "authors": [
        "michaelball"
    ],
    "categories": [
        "Armed Forces",
        "Veterans",
        "Veterans Advice",
        "Veterans Support",
        "Veterans Today",
        "Veterans Welfare and Support"
    ],
    "pub_date": "2023-03-31T10:24:14+01:00",
    "content": [
        {
            "text": "Challenges faced by women who leave the services are to be considered as part of the Government’s first Women Veterans’ Strategy."
        },
        {
            "text": "Due to be launched later this year by the Office for Veterans’ Affairs, the strategy will tackle areas where women veterans might be missing out on support, as well as any accessibility issues."
        },
        {
            "text": "More than 235,000 women in England and Wales have served in our Armed Forces, but women veterans reportedly face issues accessing support services, particularly where those services are inadvertently orientated towards men."
        },
        {
            "text": "The OVA will identify what further support may be given to women veterans to meet their specific needs. This will cover areas such as mental health, physical welfare and employment."
        },
        {
            "text": "Johnny Mercer, the Minister for Veterans' Affairs, said: 'Making this country the best place in the world to be a veteran shouldn't just be something we say, but something we do."
        },
        {
            "text": "'In order to deliver this ambition, it’s vital that we listen to women veterans, celebrate their successes and deliver the support they need. That’s what the new Women Veterans’ Strategy will do.'"
        },
        {
            "text": "The launch of the Women Veterans' Strategy comes after the OVA and the Ministry of Defence launched a wider review of veterans’ welfare services, designed to examine their effectiveness and efficiency."
        }
    ]
}