{
    "url": "https://environmentagency.blog.gov.uk/2023/03/31/storm-overflow-spill-data-shows-performance-is-totally-unacceptable/",
    "title": "Storm overflow spill data shows performance is totally unacceptable",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Environment Agency"
    ],
    "pub_date": "2023-03-31T09:18:25+00:00",
    "content": [
        {
            "text": "Storm overflow spill data shows performance is totally unacceptable"
        },
        {
            "text": "Today the Environment Agency has released the water companies’ annual data on storm overflow spills. We publish the official data to help hold the water industry to account following the installation of Event Duration Monitors."
        },
        {
            "text": "This is the third year that we have published this Event Duration Monitoring (EDM) data, which shows how often storm overflows operated and for how long they discharged into the environment."
        },
        {
            "text": "Earlier this week there were incorrect media reports detailing some of the EDM 2022 data. This data did not come from the Environment Agency - it was water companies’ data and is inconsistent with the  regulatory EDM data we published today."
        },
        {
            "text": "Overall the water companies are claiming 96% EDM coverage; however this is also wrong. The official data shows it is in fact 91%. In addition, in this year’s annual returns, there were a number of additional storm overflows reported by some water companies and some monitors are not operating as reliably as we expect."
        },
        {
            "text": "It is the water companies’ responsibility to notify us about any storm overflow, pumping station or wastewater treatment works which does not have an environmental permit. They should apply for the permit as soon as possible after they identify the offending discharge."
        },
        {
            "text": "The 2022 EDM data shows a decrease in spills, which reflects last year’s drier than average weather. Despite claims by water companies and Water UK, the body that represents their interests, there is no evidence to show it is because of water company action. In fact, last year water companies only made improvements to 65 storm overflows – less than 0.5% of the overall total of overflows in the entire system – so we are very confident that water company action has not significantly contributed to the reduction in flows overall. For them to claim otherwise is wilfully misleading."
        },
        {
            "text": "What is very clear from the data they have provided is that the number of spills they are allowing on the sewerage network is far too high and totally unacceptable. We are considering whether any action is required under our Enforcement and Sanctions Policy."
        },
        {
            "text": "The Environment Agency has made water companies monitor their storm overflows to capture information on how they are performing. We have a statutory duty under the Environment Act 2021 to publish EDM data for water and sewerage companies operating wholly or mainly in England before 1 April each year."
        },
        {
            "text": "Doing this has significantly driven up monitoring and transparency from water companies in recent years. The number of overflows monitored across the network has increased from 10% in 2015 to more than 91% in 2022. By the end of the year, 100% of storm overflows should have an Event Duration Monitor installed. This means we can all see the true extent of storm overflow spills, and the Environment Agency and government can direct water company investment to stop it."
        },
        {
            "text": "We know that providing accessible data is an important step in understanding why, where and when storm overflows are used, but disclosure is only ever the beginning."
        },
        {
            "text": "The water companies have rightly been condemned by government, the Environment Agency, campaigners and the public for allowing far too many sewage spills into rivers, and this data helps expose their record on discharges into the environment."
        },
        {
            "text": "EDM data has informed the major criminal investigation into potential widespread non-compliance of water and sewerage companies at wastewater treatment works."
        },
        {
            "text": "Main findings from 2022 data"
        },
        {
            "text": "The data from the 2022 EDM storm overflow annual returns from water and sewerage companies is summarised in the table below.  The full dataset and summary tables can be found at data.gov.uk"
        },
        {
            "text": "Next steps"
        },
        {
            "text": "The evidence from EDM clearly shows where water companies need to improve and where they should focus their investment to carry out improvements."
        },
        {
            "text": "While the water companies acknowledge there is a colossal amount of work to do, we expected to see more pace and innovation in storm overflow maintenance and investment by now. We need to see water companies undertake urgent action, including thorough inspections of those storm overflows with the highest spills, and extensive maintenance programmes of their sewerage networks."
        },
        {
            "text": "We will take action against water and sewerage companies if there are any unauthorised spills - this can range from advice and guidance, to criminal prosecutions for the small proportion of those causing the most polluting incidents. We do whatever will lead to the best outcome for the environment overall."
        },
        {
            "text": "We will also be reviewing each water company return to determine if they are compliant with the EDM monitoring and reporting conditions in their permits. We expect EDM monitors to work reliably and be fixed quickly if it is not accurately reflecting spill count and duration."
        },
        {
            "text": "We will use the data to inform our intelligence for investigations and to highlight the actions water companies need to take through tools such as the Water Industry National Environment Programme (WINEP). The upcoming PR24 is anticipated to see further investment in storm overflows through the WINEP."
        },
        {
            "text": "Further information can be found here - Water Industry National Environment Programme - data.gov.uk"
        },
        {
            "text": "Storm Overflow Reduction Plan"
        },
        {
            "text": "The Government’s Storm Overflow Reduction Plan, launched in September last year, sets targets for water companies to improve all overflows discharging into or near designated bathing waters and to improve 75% of overflows discharging to high priority nature sites by 2035. By 2050 this will apply to all remaining storm overflows, regardless of location."
        },
        {
            "text": "Last month the Secretary of State asked water and sewerage companies to set an action plan on every storm overflow in England, prioritising those that are spilling more than a certain number of times a year, and those spilling into bathing waters and high priority nature sites and announced water companies will face higher penalties that are quicker and easier to enforce."
        }
    ]
}