{
    "url": "https://homeofficemedia.blog.gov.uk/2023/03/31/strike-action-to-affect-his-majestys-passport-office/",
    "title": "Strike action to affect His Majesty’s Passport Office",
    "authors": [
        "Home Office news team"
    ],
    "categories": [
        "Fact sheet"
    ],
    "pub_date": "2023-03-31T09:41:35+01:00",
    "content": [
        {
            "text": "The Public and Commercial Services (PCS) union has announced Civil Service industrial action that will impact staff at His Majesty’s Passport Office."
        },
        {
            "text": "Dates"
        },
        {
            "text": "Locations "
        },
        {
            "text": "The proposed strike action will impact staff at the following locations"
        },
        {
            "text": "His Majesty’s Passport Office role is to issue passports to citizens of the United Kingdom on behalf of the Crown."
        },
        {
            "text": "HM Passport Office has already processed over 2.7million applications this year (as of March 2023) and with the continued introduction of process improvements, the latest figures (as of March 2023) show over 99.7% of standard applications are being processed within 10 weeks, with the majority of those delivered to customers well under this timescale."
        },
        {
            "text": "Advice for people who need to apply for a new passport "
        },
        {
            "text": "Applying online is the easiest and cheapest way to get a passport: Apply online for a UK passport - GOV.UK (www.gov.uk)."
        },
        {
            "text": "There are currently no plans to change our guidance which clearly states that it takes up to 10 weeks to get a passport. Please allow enough time when applying. "
        },
        {
            "text": "We advise all customers not to book travel without a passport that meets their travel needs. "
        },
        {
            "text": "Advice for customers with appointments at these locations during strike dates"
        },
        {
            "text": "We plan to maintain as many appointments as possible."
        },
        {
            "text": "If you do have an existing appointment scheduled during strike action and it needs to be re-arranged, you will be contacted by HM Passport Office."
        },
        {
            "text": "Please do not visit any passport office without a pre-arranged appointment."
        },
        {
            "text": "Do I need a new passport? "
        },
        {
            "text": "Customers should check their passport and ensure it is valid for travel.  How much time you need on your passport depends on the country you are planning to visit. You can check this on Foreign travel advice - GOV.UK (www.gov.uk)"
        },
        {
            "text": "Apply online at  Apply online for a UK passport - GOV.UK (www.gov.uk) - it’s the cheapest and easiest method."
        },
        {
            "text": "If your passport meets your travel needs, you do not need to apply for a new one."
        },
        {
            "text": "Advice for people who need a passport for urgent travel or compassionate reasons"
        },
        {
            "text": "For anyone that requires a passport on compassionate grounds for urgent travel, services will continue to be available."
        },
        {
            "text": "To find out more about the criteria for urgent or compassionate reasons:"
        },
        {
            "text": "Urgent government business or compassionate travel (accessible version) - GOV.UK (www.gov.uk)"
        },
        {
            "text": "What we are doing to avoid disruption during strike action."
        },
        {
            "text": "HM Passport Office is well positioned to manage an extended period of industrial action, with over 2.7million applications processed so far this year. The latest figures showing over 99.7% of standard applications are being processed within 10 weeks. As of March 2023."
        },
        {
            "text": "Processing time guidance is provided to help ensure that people allow sufficient time to get their passport. There are no plans to change this guidance in response to the industrial action."
        },
        {
            "text": "If you do not need a passport for travel within 10 weeks, we strongly advise to continue using the standard service."
        },
        {
            "text": "How to contact HM Passport Office"
        },
        {
            "text": "Anyone who needs advice should contact the passport advice line on 0300 222 0000 which will remain open as usual (Monday to Friday, 8am to 8pm and Saturday, Sunday/UK Bank Holidays, 9am to 5:30pm)."
        },
        {
            "text": "Remember"
        }
    ]
}