{
    "url": "https://competitionandmarkets.blog.gov.uk/2023/03/31/urgency-and-price-reduction-claims-are-your-online-tactics-legal/",
    "title": "Urgency and price reduction claims: are your online tactics legal?",
    "authors": [
        "Jennifer Dinmore"
    ],
    "categories": [
        "Online choice architecture"
    ],
    "pub_date": "2023-03-31T10:01:54+01:00",
    "content": [
        {
            "text": "Countdown clocks. Scarcity claims. Eye-catching discount offers. These and similar sales tactics have become common online."
        },
        {
            "text": "Businesses use them in marketing emails, search and display adverts, home page headlines, pop-ups and plug-ins, etc."
        },
        {
            "text": "Designed fairly, these sales tactics can alert consumers to genuine special offers or give them helpful information about current selling conditions."
        },
        {
            "text": "However, we’re concerned that these tactics may not always be as genuine as they seem, as some may mislead consumers or put unfair pressure on them. If they do, they’re likely to be illegal. We’re therefore opening investigations into online businesses to probe further."
        },
        {
            "text": "We’re now asking all online businesses involved in selling to consumers in the UK to review their practices. To help them, we’ve published an open letter with lots of examples where common claims – for example ‘Ends in X hours Y minutes’, ‘Only X left’, ‘Was £X, Now £Y’ – may be illegal."
        },
        {
            "text": "The letter and examples are aimed at everyone involved in designing, developing and publishing urgency and price reduction claims for businesses, for example:"
        },
        {
            "heading": 2,
            "text": "Here are some practices that concern us."
        },
        {
            "heading": 3,
            "text": "Countdown clocks"
        },
        {
            "text": "Countdown clocks indicate when a sale or special deal will finish, for example ‘midnight Sunday’ or ‘in 2 hours 10 minutes’."
        },
        {
            "text": "Countdowns that are untrue because the sale price rolls on beyond the advertised end point are misleading. Claims that trick people into thinking they must rush to bag the bargain, when in fact the sale price will be offered again very soon (for example, next week), are also likely to mislead."
        },
        {
            "heading": 3,
            "text": "Checkout timers"
        },
        {
            "text": "Checkout timers give consumers a specified amount of time to complete their purchases, for example ‘You have 3 minutes’."
        },
        {
            "text": "Timers that start again when the webpage is refreshed or re-start immediately when the time runs out are misleading. They also put unfair pressure on consumers to hurry their purchases."
        },
        {
            "heading": 3,
            "text": "Scarcity claims"
        },
        {
            "text": "Scarcity claims alert consumers to low stock levels, for example ‘Only 5 left’."
        },
        {
            "text": "Claims that are untrue because the business in fact has plenty of stock are misleading."
        },
        {
            "text": "Claims that give a false impression that consumers must act fast to avoid missing out – for example, saying ‘Only 5 left’ when this has no bearing on any order the consumer may place because new stock is on its way – may also mislead."
        },
        {
            "heading": 3,
            "text": "Price reduction claims"
        },
        {
            "text": "Price reduction claims emphasise the discount or special offer price by referring to a higher comparison price, for example ‘was £30, now £14’, ‘Buy at half-price’ or ‘Was £45, Now £20'."
        },
        {
            "text": "Such claims are misleading where they no longer reflect the item’s usual price. For example, setting a price at launch at £120, cutting it 2 weeks later to £90 and then claiming in the months ahead that this is a price saving (£120 down to £90) would likely mislead. The £30 ‘saving’ has ceased to be a genuine one; £90 has become the normal price."
        },
        {
            "text": "Do you have a business involved in designing, developing and/or publishing urgency and price reduction claims online? Read our open letter to online businesses to find more examples and for advice on what to do to stay on the right side of the law."
        }
    ]
}