{
    "url": "https://aphascience.blog.gov.uk/2025/09/28/aphas-role-in-the-global-fight-against-rabies/",
    "title": "APHA’s role in the global fight against rabies",
    "authors": [
        "Ter Apaa",
        "Tony Fooks",
        "Victoria Gould",
        "Kelly Harty",
        "Dan Horton",
        "Lorraine McElhinney",
        "Leigh Thorne",
        "Harry Wilson",
        "Guanghui Wu"
    ],
    "categories": [
        "Viral diseases"
    ],
    "pub_date": "2025-09-28T09:00:00+01:00",
    "content": [
        {
            "text": "Every nine minutes, someone dies from rabies, a disease that is entirely preventable. There are estimated to be more than 59,000 lives lost to rabies each year, with 99% of these deaths caused by bites from infected domestic dogs. "
        },
        {
            "text": "On World Rabies Day, we are reminded that rabies is a global issue, and we all have a role to play. This year’s theme, “Act Now: You, Me, Community”, calls on individuals, organisations and governments to work together to end rabies deaths."
        },
        {
            "heading": 2,
            "text": "Rabies and UK travellers"
        },
        {
            "text": "In June 2025, a UK traveller died from rabies after being lightly scratched by a stray puppy in Morocco a few months earlier. Medical attention (rabies post exposure prophylaxis) was not received at the time of the scratch and sadly the patient died after being infected with rabies virus. The case highlighted the importance of seeking medical attention following potential exposure to animals in rabies endemic countries even when the contact is minor or the animal looks healthy."
        },
        {
            "text": "Between 2000 and 2024, six UK cases of human rabies were linked to animal exposures abroad. These incidents are a stark reminder that rabies remains a global threat, particularly in regions of Asia and Africa where the virus is still endemic."
        },
        {
            "text": "The UK is rabies free, meaning the virus does not circulate in animals in the UK. However, imported cases of rabies highlights the importance of pre-travel advice, vaccination, and public awareness."
        },
        {
            "heading": 2,
            "text": "What we do at APHA"
        },
        {
            "text": "At the Animal and Plant Health Agency (APHA), we are proud to be leading the UK’s efforts to control rabies through science, surveillance, vigilance and international collaboration."
        },
        {
            "text": "We are the UK’s National Reference Laboratory for rabies, we carry out testing and provide expert advice for both animal and human suspect cases. This includes diagnosing rabies in people and animals suspected of having this notifiable disease, assisting clinicians and veterinarians to make fast and informed decisions."
        },
        {
            "text": "Our field veterinary inspectors respond immediately to investigate clinical suspicion of rabies in animals under the guidance of the veterinary exotic notifiable diseases unit (VENDU)."
        },
        {
            "text": "We help make international pet travel safer, too. Our veterinary inspectors and animal health officers at UK ports check that pets entering the country are healthy, vaccinated and have the right paperwork. More than 400,000 pets (dogs and cats) entered through dedicated UK border points in 2024. In addition, each year, we test around 14,000 pet blood samples to confirm rabies protection after vaccination. This is part of a process called Pet Travel Scheme (PETs) testing, which helps confirm that animals travelling internationally are properly vaccinated against rabies, keeping both animals and people safe."
        },
        {
            "text": "APHA is recognised as International Reference Laboratories (IRL) by the World Health Organization (WHO) and the World Organisation for Animal Health (WOAH), contributing to global standards in rabies diagnosis and control."
        },
        {
            "text": "Our research and development advances our knowledge of rabies and supports diagnosis, prevention and elimination of dog-mediated human rabies. We are collaborating with domestic and global researchers to innovate and enhance rabies vaccine efficacy and applying artificial intelligence for rabies virus detection. In addition, we develop tools to check how well vaccines work (antibody neutralisation detection). For instance, our recent research has focused on engineering rabies viruses to glow under a microscope (express fluorescent proteins), making it quicker and easier to spot protective antibodies. We use bioinformatics for genetic typing of the rabies virus (reading the virus’s genome) to help us understand how, where, and when the virus spreads around the world. "
        },
        {
            "text": "We strengthen rabies control and prevention by working with partners across the globe including China, India, Sierra Leone, Ghana, Jordan, Ethiopia, Nigeria, South Africa, the USA, and several countries in Europe and Central Asia. Through this collaboration, we also train professionals and share trusted tools and advice worldwide."
        },
        {
            "heading": 2,
            "text": "Tracking the threat: what bat passive surveillance tells us"
        },
        {
            "text": "Although the UK is rabies free, related lyssaviruses have been detected in two species of UK bats. Since 1986, APHA has run the Defra-funded Passive Bat Surveillance Programme, testing over 21,000 bats submitted by members of the public, bat groups, bat rehabilitators and conservationists. The programme looks for viruses (lyssaviruses) related to the rabies virus that also cause rabies disease. Through this programme, we have:"
        },
        {
            "text": "As noted here, these viruses can infect other animals and, in rare cases, people. So, it is a known zoonotic threat, which is likely to be under-reported or misdiagnosed."
        },
        {
            "heading": 2,
            "text": "Rabies in real life: global initiatives to help end rabies"
        },
        {
            "text": "Behind every statistic is a real person, a real story, and a real impact. Around the world, individuals and communities continue to face the devastating consequences of rabies and many are working tirelessly to prevent it."
        },
        {
            "text": "Organisations like Mission Rabies are making a real difference. In Cambodia, they vaccinated over 229,000 dogs in just two weeks, reaching the critical 70% coverage needed to stop rabies transmission. Their teams also deliver life-saving education to millions of children and respond rapidly to suspected rabid dog cases – as reported by Mission Rabies."
        },
        {
            "text": "Globally, the United Against Rabies (UAR) Forum, backed by the World Health Organisation (WHO), World Organisation for Animal Health (WOAH), Food and Agriculture Organization (FAO) and Global Alliance for Rabies Control (GARC), is driving the Zero by 30 goal, aiming to end human deaths from dog-mediated rabies by 2030. Their One Health approach brings together governments, researchers, non-governmental organisations and vaccine producers to strengthen rabies control in the world’s most underserved regions − as reported by UAR."
        },
        {
            "text": "Closer to home, APHA has continued to lead global efforts to eliminate the disease. APHA was recently re-designated by WHO as a Collaborating Centre for One Health Operationalisation in rabies. This is in recognition of APHA’s vital role in supporting rabies-endemic countries through laboratory training, technical assistance, and strategic guidance. This re-designation is a true demonstration of APHA’s international impact and long-standing commitment to ending dog-mediated human rabies by 2030."
        },
        {
            "text": "These efforts and many others not mentioned here, show why rabies prevention is important. Rabies can be eliminated, but only if we act together. That means responsible pet ownership, timely vaccination, global teamwork, and volunteering to support control efforts."
        },
        {
            "heading": 2,
            "text": "How you can help"
        },
        {
            "text": "Together, we can end rabies, act now. You, me, community!"
        }
    ]
}