{
    "url": "https://deframedia.blog.gov.uk/2022/03/28/englands-largest-ever-seagrass-restoration-project-reaches-a-new-milestone/",
    "title": "England’s largest ever seagrass restoration project reaches a new milestone",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "marine"
    ],
    "pub_date": "2022-03-28T13:19:52+01:00",
    "content": [
        {
            "text": "On Saturday (26th March 2022), Natural England announced that England’s largest ever seagrass restoration project reached a new milestone."
        },
        {
            "text": "This received coverage in Business Green and The Paradise News. The project has also recently been reported on in Countryfile magazine."
        },
        {
            "text": "The £2.5 million Life Recreation ReMEDIES partnership led by Natural England, has now planted around 70,000 seed bags spanning 3.5 hectares of seabed."
        },
        {
            "text": "Habitats such as seagrass meadows, mangroves and tidal marshes have essential carbon capture abilities. Seagrass can be as effective at absorbing and storing carbon as our woodlands."
        },
        {
            "text": "However, seagrasses and the UK seabed are threatened by a variety of factors, from seagrass wasting disease (SWD) to pollution and physical disturbance from activities such as the anchoring, launching and mooring of leisure boats. Natural England are working in partnership with organisations such as the Ocean Conservation Trust to tackle these pressures, and the project aims to plant eight hectares of seagrass in total."
        },
        {
            "text": "Tony Juniper, Chair of Natural England, said:"
        },
        {
            "text": "Mark Parry, Development Officer at the Ocean Conservation Trust, said:"
        },
        {
            "text": "The project, covering five Special Areas of Conservation in Southern England, involves surveying and mapping seagrass beds to help inform recreational marine users; undertaking studies to better understand how these recreational activities impact seagrass; and introducing voluntary No-Anchor Zones. Advanced Mooring Systems are also being trialled, which are designed to interact less with the seabed."
        },
        {
            "text": "Later this year, sea dives are due to take place at healthy seagrass meadows in the Solent and Cornwall to collect seagrass seeds."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}