{
    "url": "https://educationhub.blog.gov.uk/2022/03/28/how-were-raising-standards-in-our-schools-and-colleges-what-the-schools-white-paper-means-for-you/",
    "title": "How we’re raising standards in our schools and colleges – what the Schools White Paper means for you",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Schools"
    ],
    "pub_date": "2022-03-28T00:01:25+01:00",
    "content": [
        {
            "text": "We’ve launched an ambitious plan to give every child the support they need in education. From targeted support in English and maths to ensuring every child has an excellent teacher."
        },
        {
            "text": "The plan is set out in the Schools White Paper – also known as an Opportunity for all: Strong schools with great teachers for your child. ‘White papers' are formal plans from Government that set out proposals for future legislation before being decided upon by parliament."
        },
        {
            "text": "Our plans are ambitious, wide ranging and affect every stage of school-age education – here we set out what the key proposals will mean for you."
        },
        {
            "text": "Click on the following links to jump to the relevant section of this article:"
        },
        {
            "text": "Better education\nTargeted support\nImproved teacher training and development"
        },
        {
            "text": "Higher standards in terms of curriculum, behaviour and attendance will help every child to reach their potential"
        },
        {
            "text": "Education is the great leveller. Every single child should have access to an education that equips them with the knowledge, skills and experiences needed to fulfil their potential."
        },
        {
            "text": "Primary education is critical to a child’s development and it is where they lay the foundations for their futures."
        },
        {
            "text": "So, our mission for education is that by 2030, 90% of children will leave primary school having achieved the expected standard in reading, writing and maths, up from 65% in 2019."
        },
        {
            "text": "That means more pupils will be equipped to flourish in secondary school where we are also raising our expectations. We have also set an ambition to increase the national GCSE average grade in both English language and in maths from 4.5 in 2019 to 5 by 2030."
        },
        {
            "heading": 3,
            "text": "How will we achieve this?"
        },
        {
            "heading": 4,
            "text": "The school day"
        },
        {
            "text": "It’s unfair that a child who receives 20 minutes per day less teaching time loses out on around two weeks of education and time with their peers and teachers a year."
        },
        {
            "text": "That’s why we plan to introduce a minimum expectation for the length of the school week of 32.5 hours (the current average) for all mainstream state-funded schools."
        },
        {
            "text": "Most schools won’t have to change their opening hours because they already have a week at least this long – but those that don’t, will."
        },
        {
            "text": "This move will help support all children from primary school onwards to have fair access to a high-quality education. We will also encourage schools to explore going further than the minimum expectation if possible to support a broad curriculum and enable access to high-quality extra-curricular provision."
        },
        {
            "heading": 4,
            "text": "Improving behaviour"
        },
        {
            "text": "For children to receive the best possible education, they must be taught in a calm, orderly, safe and supportive school."
        },
        {
            "text": "That is why we are supporting teachers in all state-funded schools to develop their expertise in managing pupil behaviour and wellbeing through a fully funded National Professional Qualification in Behaviour and Culture."
        },
        {
            "text": "We are also continuing to help heads use the full range of powers available to them – like suspensions and exclusions – appropriately where they have to, so they are more confident to take action where necessary."
        },
        {
            "heading": 4,
            "text": "Boosting attendance"
        },
        {
            "text": "Now, more than ever, face-to-face education is of paramount importance for children’s academic, social and emotional wellbeing."
        },
        {
            "text": "We’ve been carrying out a consultation – which means we’ve been speaking to parents, teachers, and others – about how we can help pupils overcome whatever is stopping them from going to school regularly."
        },
        {
            "text": "Subject to the results of this consultation, we will introduce new legislation to create new statutory guidance on attendance, including a requirement for every school to publish a clear attendance policy to improve support. By setting clear expectations for staff, pupils, and parents they will know what processes should be followed in cases of absence and what support should be offered. For parents this should result in greater consistency and improved, earlier support where required."
        },
        {
            "text": "We will also make it easier for schools to understand individual attendance patterns and for trusts, local authorities and DfE to identify problems more quickly.\n"
        },
        {
            "heading": 3,
            "text": "Every child who falls behind in English or maths will get the right support to get back on track"
        },
        {
            "text": "We are pledging to parents that every child who falls behind in English or maths will get targeted, evidence-based support to get back on track."
        },
        {
            "text": "The high quality teaching of an ambitious curriculum is essential for every child to succeed, but some pupils will need additional support to help them to progress when they are falling behind."
        },
        {
            "text": "Many schools already do this but we expect every school to provide the right support for any child that is struggling in English or maths. This includes assessing and monitoring pupils’ progress in English and maths and drawing on high quality evidence-based interventions to help them to catch up when they are behind. Schools will tell parents about their child’s progress and how they can also support their child’s learning at home."
        },
        {
            "text": "We expect tutoring will be a key way schools will deliver targeted support and we have invested £1 billion to establish the National Tutoring Programme, financially incentivising schools to provide tutoring so that tutoring is embedded in every school. We will deliver up to 6 million tutoring courses by 2024, which when combined with our programmes to deliver tutoring for young people aged 16-19 equates to around 100 million hours of tutoring. Over one million courses of tutoring have started through the National Tutoring Programme, with the programme on track to deliver the ambitious target of two million courses this academic year."
        },
        {
            "heading": 3,
            "text": "Reforming the SEND and children’s social care systems "
        },
        {
            "text": "Over 15% of children have an identified special educational need or disability (SEND) and vulnerable children and children with SEND have lower educational attainment than their peers on average."
        },
        {
            "text": "That’s why we are reforming the SEND and Children’s Social Care Systems, so that no child misses out. This will mean all children and young people with SEND are able to access the right support in the right place at the right time."
        },
        {
            "text": "To make sure the right support is in the right places, we will invest £2.6bn in high needs capital investment, providing 34,000 additional specialist or alternative provision places. As part of that we will deliver new special and alternative provision free schools."
        },
        {
            "text": "We will set out more in detail shortly in our SEND Review. We will also be considering the recommendations of the Independent Review of Children’s Social Care, due this spring, as part of our commitment to make a real difference to the needs, experience and outcomes of those supported by children’s social care."
        },
        {
            "heading": 3,
            "text": "We will support schools in delivering all this by ensuring an excellent teacher for every child"
        },
        {
            "text": "We cannot achieve our vision for schools without excellent teachers. That is why we will give every teacher access to world-class training and professional development at every stage of their career."
        },
        {
            "text": "We will deliver 500,000 teacher training and development opportunities across Initial Teaching Training, the Early Career Framework and National Professional Qualifications by 2024, giving them the expertise and support needed to deliver great teaching."
        },
        {
            "text": "Schools will be able to have a trained literacy expert through a new National Professional Qualification for Leading Literacy. And we will make sure every child starts schools with a firm foundation of literacy and numeracy through a new National Professional Qualification for Early Years Leaders, and up to £180m investment in the early years’ workforce, including literacy and numeracy training for early years practitioners."
        },
        {
            "text": "We will make sure every school can access funded training for a senior mental health lead to deliver a whole school approach to health and wellbeing."
        },
        {
            "text": "To ensure we are attracting and retaining the best teachers, teacher starting salaries are set to rise to £30,000, and we will provide further incentives to those who work in schools with the most need. We have also proposed that experienced teachers and leaders receive their highest pay rise in over 15 years."
        },
        {
            "text": "For more information on how we are delivering a leading education system for all, please see the Schools White Paper: Opportunity for all: strong schools with great teachers for your child - GOV.UK (www.gov.uk)."
        }
    ]
}