{
    "url": "https://deframedia.blog.gov.uk/2022/03/28/minister-pow-visits-norfolk-to-announce-coastal-transition-accelerator-project/",
    "title": "Minister Pow visits Norfolk to announce Coastal Transition Accelerator Project",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Weekly stories"
    ],
    "pub_date": "2022-03-28T10:59:01+01:00",
    "content": [
        {
            "text": "There has been coverage over the weekend in The Independent, The Times,  ITV Anglia, Eastern Daily Press and BBC Radio Norfolk on our Coastal Transition Accelerator Project as £36 million is set to be invested to explore innovative approaches of adapting to the effects of coastal erosion."
        },
        {
            "text": "It followed a visit by Floods Minister Rebecca Pow to Happisburgh in North Norfolk where she met with representatives from North Norfolk District Council, one of two local authorities receiving this funding to help communities on areas of the coast that cannot sustainably be defended from coastal erosion."
        },
        {
            "text": "North Norfolk District Council and East Riding of Yorkshire will support residents to prepare and plan for the long term, while also trialling some immediate actions that support the long-term resilience of communities near the coast."
        },
        {
            "text": "Floods Minister Rebecca Pow said: "
        },
        {
            "text": "Emma Howard Boyd, Chair of the Environment Agency, said: "
        },
        {
            "text": "The Environment Agency will manage the programme, supporting both areas as they develop and deliver their local projects. It will also ensure that ongoing learning is shared with other areas facing similar challenges."
        },
        {
            "text": "These two locations were chosen because they are already living with the challenges of coastal erosion and between them include 84% of the properties at risk of coastal erosion in England over the next 20 years."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}