{
    "url": "https://defrafarming.blog.gov.uk/2022/03/28/monitoring-evaluating-and-learning-in-the-future-farming-and-countryside-programme/",
    "title": "Monitoring, evaluating and learning in the Future Farming and Countryside Programme",
    "authors": [
        "Kieron Stanley"
    ],
    "categories": [
        "Future Farming and Countryside Programme"
    ],
    "pub_date": "2022-03-28T12:08:53+01:00",
    "content": [
        {
            "text": "In previous blog posts we’ve written about how we’re adopting a test-and-learn approach across the Future Farming and Countryside Programme. "
        },
        {
            "text": "We’re doing this to make sure our schemes, services and policies work for users before we scale them up."
        },
        {
            "text": "To make sure we’re on track to deliver our ambitions, we have a strategy to help us to monitor, evaluate and learn as we go. "
        },
        {
            "text": "In this blog post, I’ll share a high-level overview of the strategy and some examples of how we’re putting it into effect. But first, here’s what we mean by monitoring, evaluation and learning. "
        },
        {
            "text": "In effect, they form a cycle. "
        },
        {
            "heading": 2,
            "text": "Our strategy in practice"
        },
        {
            "text": "At the start of the year, we published our environmental land management schemes outcomes. Here are some examples of how we’ve been piloting, monitoring and evaluating. "
        },
        {
            "heading": 3,
            "text": "The Sustainable Farming Incentive pilot "
        },
        {
            "text": "The Sustainable Farming Incentive pilot will run until 2025. The team is delivering 2 evaluation projects which will run throughout the pilot, until 2025. Both will inform our understanding of how the pilot works in practice and help inform future scheme design and delivery decisions. It will also reveal the early-stage environmental outcomes farmers and land managers are achieving. "
        },
        {
            "heading": 3,
            "text": "Tests and trials"
        },
        {
            "text": "The land management themes that we’re putting to the test with the help of farmers and land managers are:"
        },
        {
            "text": "Each test and trial group gathers data. Reports are published on GOV.UK and we use the findings to inform the design of our new schemes.  "
        },
        {
            "heading": 3,
            "text": "The first round of Landscape Recovery projects "
        },
        {
            "text": "The Landscape Recovery scheme opened for first round applications on 1 February 2022. The approach to monitoring and evaluation is likely to be undertaken across all of the projects. For example, to help understand the overall impact of Landscape Recovery, and by supporting projects to design their own monitoring and evaluation approach as an integrated part of each project."
        },
        {
            "heading": 3,
            "text": "The Natural Capital and Ecosystem Assessment"
        },
        {
            "text": "This is an England-wide programme involving several parts of Defra. Its purpose is to assess and describe the extent and condition of England’s biodiversity, ecosystems and natural capital assets. The team is assessing how environmental land management schemes could be baselined and monitored through this assessment."
        },
        {
            "heading": 3,
            "text": "The Agri-Environment Scheme Monitoring and Evaluation Programme"
        },
        {
            "text": "Many farmers and land managers are involved with Environmental Stewardship, the English Woodland Grant Scheme and Countryside Stewardship. This monitoring and evaluation programme starts with a yearly selection of projects that focus on evaluating the scheme impacts and delivery, or the factors that affect this – so physical, environmental, socio-economic or even scheme design issues. "
        },
        {
            "text": "The projects use data gathered from agreements, complemented by additional surveying work. Natural England publishes an Annual Evidence Report.  We’re using the evidence from these reports to inform the design of standards for the Sustainable Farming Incentive and options for the Local Nature Recovery scheme."
        },
        {
            "text": "If you have any questions about how we’re monitoring progress or adapting as we go, leave a comment below."
        }
    ]
}