{
    "url": "https://teaching.blog.gov.uk/2022/03/28/providing-effective-school-to-school-support-in-a-strong-collaborative-mat/",
    "title": "Providing effective school-to-school support in a strong, collaborative MAT",
    "authors": [
        "Christabel Shepherd",
        "Helen Jones"
    ],
    "categories": [
        "Teachers' reflections"
    ],
    "pub_date": "2022-03-28T09:31:29+01:00",
    "content": [
        {
            "text": "Christabel Shepherd, Executive Headteacher at Copthorne Primary School, and Helen Jones, Executive Headteacher at Appleton Academy, talk about school-to-school support and the role of Exceed Academies Trust and the Bradford Opportunity Area in supporting this. "
        },
        {
            "text": "Exceed Academies Trust consists of eight Bradford schools, including an all-through school and alternative provision. Each of our schools has their own unique identity and context, ranging from large inner-city schools to smaller ones.  "
        },
        {
            "text": "As a trust, we pride ourselves on our ethical goals, including contributing to system-wide improvements in education and being an employer of choice. Our family of schools and many of its partners train the next generation of teachers for the Bradford region via Exceed school-centred initial teacher training (SCITT). We also offer support through the Exceed Teaching School Hub. "
        },
        {
            "heading": 3,
            "text": "Raising standards as a priority "
        },
        {
            "text": "Since 2017, Bradford has been a DfE Opportunity Area, focused on improving social mobility through improved educational outcomes. Coordinated work in this area is already starting to show good progress with over half of the 62 schools in the city improving by at least one Ofsted grade, resulting in 12,000 more pupils going to a ‘good’ or ‘outstanding’ school. "
        },
        {
            "text": "By using Exceed Trust’s expertise to improve teaching and learning, and working in partnership with the Bradford Opportunity Area, this has led to highly effective school-to-school support. "
        },
        {
            "text": "The trust consists of converter and sponsored academies where raising standards has been a priority. Dozens of schools across Bradford have been supported to raise standards and open the doors of opportunity for Bradford’s young people. Funding from the Bradford Opportunities Area has enabled and supported much of this work.  "
        },
        {
            "text": "Before the pandemic, and despite the high levels of deprivation and challenge faced by a significant number of our schools and the children they serve, many our trust schools secured some of the city’s strongest outcomes for pupils. Others have been on a rapid improvement journey, as such we are ideally placed to support others.  "
        },
        {
            "heading": 3,
            "text": "School-to-school support"
        },
        {
            "text": "Copthorne Primary School is one of the leading schools within Exceed Trust. It has been providing school-to-school support across and beyond the Bradford district. It was judged as ‘outstanding’ by Ofsted in 2007 and - we are delighted to say - once again in November 2021."
        },
        {
            "text": "Appleton Academy has been receiving support from Copthorne using Opportunity Area funding to turn the school around. The academy is an all-through school for children aged 3 to 16, which joined Exceed Academies Trust in 2017. Prior to joining the trust, the school had a long history of Ofsted ‘special measures’ judgements, followed by a ‘requires improvement’ judgement.   "
        },
        {
            "text": "Upon joining Exceed, Appleton Academy was provided with a comprehensive package of support on all aspects of the academy’s work. Copthorne and the trust’s school leaders helped to identify and effectively address key priorities for improvement and their underlying causes, shared high quality evidence-based practice, particularly in terms of English and maths provision, curriculum design, challenge pedagogy, support for more able learners, parental engagement and more recently, COVID-recovery approaches.  "
        },
        {
            "text": "The continued support from Copthorne and the trust, alongside engagement with the Opportunity Area’s funded school-to-school support offer, has resulted in improvements to academy’s quality of education across all curriculum areas.  "
        },
        {
            "text": "In November 2021, Appleton was judged by Ofsted to be ‘good’ in all areas for the first time in its history. The academy’s transformation and strength has meant that it will soon be able to support other schools. This includes acting as the lead organisation of the DfE SAFE Taskforce for Bradford, which helps to keep pupils engaged in education and on track with their studies. "
        },
        {
            "heading": 3,
            "text": "Our tips for providing effective schools-to-school support:"
        }
    ]
}