{
    "url": "https://environmentagency.blog.gov.uk/2022/03/28/reducing-flood-risk-the-maintenance-work-we-do-to-keep-rivers-flowing/",
    "title": "Reducing flood risk – the maintenance work we do to keep rivers flowing",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Flood"
    ],
    "pub_date": "2022-03-28T12:51:07+00:00",
    "content": [
        {
            "text": "The Environment Agency operates and maintains approximately 78,000 flood and coast defence assets in England with a value of £26 billion. This includes: 7,000km of linear river and coast defences such as flood walls, embankments, channels and culverts - twice the length of the UK’s motorway network."
        },
        {
            "text": "The work we do to help keep those channels and culverts clear alongside our work to maintain flood defences is a vital part of our maintenance programme and plays an important part in reducing flood risk particularly in urban areas where the consequences of a culvert or bridge blockage are highest."
        },
        {
            "text": "Conveyance works, as they are known, is the routine maintenance of channels and culverts to make sure that the water flows freely to reduce flood risk.  This includes clearing overgrown vegetation, dredging (link to existing blog), controlling aquatic weed and removing obstructions such as fallen trees and shopping trolleys. We are not responsible for clearing of general debris from rivers, however, we can act where it could pose a flood risk."
        },
        {
            "text": "Over the past 5 years, we have spent between £35million and £55million per year on channel maintenance to help rivers flow freely."
        },
        {
            "text": " "
        },
        {
            "text": "Screens and culverts"
        },
        {
            "text": "Culverts are underground structures that water can flow through. Screens help protect the culvert from being blocked with debris which could lead to serious flooding, and help prevent public access to the culvert to keep people safe."
        },
        {
            "text": "Keeping the screens which protect culverts clear is an important part of our channel maintenance work. The Environment Agency protects approximately 2,000 culverts, with a total length of just over 200km and it maintains around 2,800 screens."
        },
        {
            "text": " "
        },
        {
            "text": "How do we maintain screens? "
        },
        {
            "text": "We carry out routine maintenance of screens to remove debris and vegetation to allow the water to flow freely through the screen. When heavy rain is forecast we check our screens and monitor them throughout a flooding event to make sure they are clear."
        },
        {
            "text": "We’re using the latest technology to carry out our work to make sure it is done as safely and cost-efficiently as possible and to reduce our carbon footprint. This includes using CCTV and telemetry or other sensors on the watercourse, which help us understand where to efficiently direct our efforts so we only go to screens where we’re needed."
        },
        {
            "text": "For example, during a recent flood event in Derbyshire following Storm Eunice our Operations Team was stretched completing key operational actions to protect people and property. We were operating pump stations to maintain conveyance, closing flood gates and installing stop logs to hold water back. All the while we were on patrols 24 hours a day checking our assets."
        },
        {
            "text": "During this period technology helped us to manage our resources efficiently. We were able to remotely monitor our automated debris screens, such as the River Leen syphon, and confirm it was operating as required."
        },
        {
            "text": "We could also use our CCTV images to check for blockages to our screens and direct our Operations teams to clear them only when required. We cleared urban debris from one screen that could have caused a serious blockage. At the same time we could confirm our other screens were clear and didn’t require attendance, which reduces our carbon footprint from driving between sites and allows our team to concentrate on maintaining and operating our key assets."
        },
        {
            "text": " "
        },
        {
            "text": "What you can do to help rivers flow freely and reduce flooding"
        },
        {
            "text": " "
        }
    ]
}