{
    "url": "https://insidedio.blog.gov.uk/2022/03/28/sanctuary-awards-2021-celebrating-30-years-of-achievements-in-conservation-and-sustainability/",
    "title": "Sanctuary Awards 2021: Celebrating 30 years of achievements in conservation and sustainability",
    "authors": [
        "Julia Powell"
    ],
    "categories": [
        "Environment and Ecology",
        "Sanctuary Awards",
        "Sustainability"
    ],
    "pub_date": "2022-03-28T14:39:29+00:00",
    "content": [
        {
            "text": "The Silver Otter Trophy, donated in 1991 by the Commandant of Otterburn Training Area [Crown Copyright/MOD 2017]I’m Julia Powell, Head of Policy, Climate Change and Sustainability within the MOD’s new Climate Change and Sustainability Directorate. This year, I also had the challenging but exciting role of being Chair of Judges for what were the 30th annual Sanctuary Awards."
        },
        {
            "text": "The Sanctuary Awards have been showcasing outstanding sustainability and conservation efforts across the Ministry of Defence (MOD) estate since 1991, celebrating the achievements of teams and individuals in the UK and overseas. This 30th anniversary of the awards marked a significant milestone in showcasing the MOD’s sustained commitment to sustainability and proud record of innovation."
        },
        {
            "heading": 2,
            "text": "MOD’s commitment to the climate change and sustainability challenge"
        },
        {
            "text": "The award categories were recently refreshed to reflect the MOD’s sustainability agenda and further demonstrate MOD’s commitment to its climate change, environmental and sustainability goals. The six award categories this year were: Environmental Enhancement; Net Zero and Resource Efficiency; Heritage: Sustainable Procurement and Construction; Social Value, and Individual Achievement. Every year, the winners of each category are also considered for the prestigious Silver Otter Trophy and the Sustainable Business Award."
        },
        {
            "text": "Judging these awards is a yearly highlight of mine, and it is always a real delight to learn about the fantastic achievements of teams and individuals across Defence. As was reflected in the number of joint winners and highly commended projects this year, it grows increasingly difficult to choose who should win. The bar gets set higher every year!"
        },
        {
            "text": "Nigel Linge was awarded this year's Silver Otter Trophy for his work balancing public access with military training requirements on Salisbury Plain Training Area. [Crown Copyright/MOD 2022]I strongly encourage anyone with a project they’d like to see highlighted to consider entering the next set of awards. The judging panel and I are always looking forward to our next round of deliberations! If you’re keen to submit a nomination, or if you’d just like to find out more, please email the DIO Sanctuary team at dio-sanctuary@mod.gov.uk."
        },
        {
            "heading": 2,
            "text": "This year’s worthy winners"
        },
        {
            "text": "I’m James Clare and I lead the new Directorate of Climate Change and Sustainability."
        },
        {
            "text": "I was privileged to be a guest speaker at this year’s Sanctuary Awards, which showcased an impressive variety of sustainability-focused projects that are taking place across Defence, at home and abroad. The awards also vividly illustrated the passion of colleagues at all levels and across the Defence community – from Project Re-Cycle at RAF Lossiemouth, which has generated around 150 bicycles for recreational use by Service Personnel, to the highly commended Project Giving it Another Shot at HMNB Devenport, through which the Babcock team diverted 4,897 tonnes of metal waste known as ‘shot blast’ from landfill."
        },
        {
            "text": "I wanted to say a big congratulations to Nigel Linge, winner of this year’s Silver Otter Trophy! Since 2006, Nigel has led a team of volunteers on ‘Project Ubique’, helping to balance military training requirements with public access on Salisbury Plain Training Area. Nigel’s efforts continue to make a real difference to those who visit and train on Salisbury Plain, and it was a special moment to see him presented with this well-deserved award in recognition."
        },
        {
            "text": "Operation CORDED received the Sustainable Business Award for helping to tackle the illegal wildlife trade in Sub-Saharan Africa. [Copyright British Army]I was also delighted to see Op CORDED win this year’s Sustainable Business Award. Funded by Defra, the operation has helped to tackle the illegal wildlife trade in Malawi, Sierra Leone, Gabon, and Zambia. It was inspiring to learn how personnel from 1st Battalion, Irish Guards and the Military Intelligence Corps have shared their knowledge and skills to help deliver economic development and empower local communities in Sub-Saharan Africa."
        },
        {
            "text": "In fact, there were so many excellent projects featured this year that it’d be impossible to list them all here! Luckily though, this year’s livestreamed awards ceremony is still available on YouTube. I highly recommend giving it a watch if you’re interested in understanding more about the sustainability work going on across Defence, or if you were unable able to catch the awards live."
        },
        {
            "text": "You can also read the latest issue of Sanctuary Magazine, which is published by DIO every year following the Sanctuary Awards, and features articles and case studies exploring the MOD’s sustainable development and conservation activities."
        }
    ]
}