{
    "url": "https://skillsengland.blog.gov.uk/2025/09/16/an-introduction-to-foundation-apprenticeships-by-jonathan-mitchell/",
    "title": "An introduction to foundation apprenticeships, by Jonathan Mitchell",
    "authors": [
        "Communications Team"
    ],
    "categories": [
        "Foundation Apprenticeships",
        "Industrial Strategy",
        "Insight"
    ],
    "pub_date": "2025-09-16T10:23:47+01:00",
    "content": [
        {
            "text": "Foundation apprenticeships were introduced in May 2025. Below, Jonathan Mitchell from Skills England provides a handy guide to introduce these new jobs with training at level 2."
        },
        {
            "heading": 2,
            "text": "Foundation apprenticeships: an introduction, by Jonathan Mitchell"
        },
        {
            "text": "The apprenticeship system in England already provides an exceptional pathway for individuals entering careers. But not all young people are ready to embark on a full apprenticeship when they leave school or college."
        },
        {
            "text": "Some young learners need to build greater experience of the workplace in order to develop the knowhow and competencies that enhance their own confidence  that a particular occupation and further training within it is right for them. This in turn also develops the confidence of their employers that the learner has the knowhow and competencies needed to embark upon the next level of career or training progression."
        },
        {
            "text": "Foundation apprenticeships are designed to meet those needs. They bridge the gap between formal learning in school or college and the world of work, through a blend of structured learning with authentic on-the-job experience and accountability. This introduces learners to an industry and lays a foundation on which realistic choices about further education or employment can be based."
        },
        {
            "text": "Success for a foundation apprentice is progression – be that into further training or a job."
        },
        {
            "text": "As a former teacher, I can call to mind many learners I encountered in the classroom whose potential needed space to grow through time and support in the workplace, before selecting the best next steps. Through foundation apprenticeships, such young people now have a clear and meaningful pathway to follow."
        },
        {
            "heading": 2,
            "text": "What are foundation apprenticeships?"
        },
        {
            "text": "Foundation apprenticeships are entry-level, paid jobs with structured training."
        },
        {
            "text": "These level 2 apprenticeships combine technical knowledge and skills with workplace learning, helping young people decide their next career steps."
        },
        {
            "heading": 2,
            "text": "Who are foundation apprenticeships for?"
        },
        {
            "text": "Foundation apprenticeships are available for young people aged 16 to 21, and also aged 22 to 24 for learners who:"
        },
        {
            "text": "They are for those looking for a broad grounding in an entry level occupation, leading to opportunities for progression to a more specific or higher-level apprenticeship. "
        },
        {
            "text": "The sectors they are available in are:"
        },
        {
            "heading": 2,
            "text": "How long is a foundation apprenticeship?"
        },
        {
            "text": "A foundation apprenticeship lasts for a minimum duration of 8 months."
        },
        {
            "text": "If individual learner needs require an extension to the length of the foundation apprenticeship, the duration may be extended accordingly."
        },
        {
            "heading": 2,
            "text": "What are the main benefits of foundation apprenticeships?"
        },
        {
            "text": "Foundation apprenticeships:"
        },
        {
            "heading": 2,
            "text": "Why were foundation apprenticeships created?"
        },
        {
            "text": "The Department for Education (DfE) determined the initial 7 foundation apprenticeships based on industrial strategy growth area needs."
        },
        {
            "text": "They have been developed as an alternative route for young people who need extra support with employability skills and the transition to the workplace, including those moving from full-time education and those not currently in education, employment or training. "
        },
        {
            "text": "Undertaking a foundation apprenticeship will help these learners make an informed choice about which specialised occupation they want to progress into.  "
        },
        {
            "text": "Foundation apprenticeships also support employers in key sectors to meet their resource needs. They offer opportunities to engage with younger employees and build sustainable talent pipelines"
        },
        {
            "heading": 2,
            "text": "How have foundation apprenticeships been developed?"
        },
        {
            "text": "The Department for Education (DfE) commissioned The Institute for Apprenticeships and Technical Education (IfATE) to develop foundation apprenticeships. On 1 June 2025 IfATE closed and its functions transferred to Skills England. Skills England will now determine the process for approval and for periodic reviews."
        },
        {
            "text": "To develop foundation apprenticeships, Skills England and DfE seek views from experts such as:"
        },
        {
            "heading": 2,
            "text": "Which foundation apprenticeships are currently available?"
        },
        {
            "text": "At the time of publication, there are 7 foundation apprenticeships available. These are:"
        },
        {
            "text": "Use the Skills England apprenticeship finder to read the occupational standards for these first 7 foundation apprenticeships."
        },
        {
            "heading": 2,
            "text": "Email us your insights"
        },
        {
            "text": "We want to hear from employers, training providers, and awarding organisations about your experiences of foundation apprenticeships."
        },
        {
            "text": "Email us at  skills.england@education.gov.uk with 'Foundation apprenticeship: sector insight' in the subject line."
        },
        {
            "text": "Jonathan Mitchell"
        },
        {
            "text": "Deputy Director, Skills England"
        }
    ]
}