{
    "url": "https://accessibility.blog.gov.uk/2025/09/16/improving-the-dfe-accessibility-and-inclusive-design-manual/",
    "title": "Improving the DfE accessibility and inclusive design manual ",
    "authors": [
        "Kerry Lyons, Senior Content Designer, Department for Education"
    ],
    "categories": [
        "Accessibility"
    ],
    "pub_date": "2025-09-16T08:59:18+01:00",
    "content": [
        {
            "text": "In September 2024 we published the Department for Education (DfE) Accessibility and inclusive design manual. Feedback has been mostly positive, and our data showed people were using the content. But we wanted to understand more, so we did some research with users working in design, product and delivery roles."
        },
        {
            "text": "We focused on 3 main things: "
        },
        {
            "heading": 2,
            "text": "What we changed "
        },
        {
            "heading": 3,
            "text": "We removed the ‘knowledge hub’ section and reorganised content "
        },
        {
            "text": "People liked the content and understood it was valuable, but the 'knowledge hub’ felt cluttered and hard to use. It was seen as a dumping ground.  "
        },
        {
            "text": "We moved the content into parts of the manual that better fit the user journey – based on how people think and search for information.  "
        },
        {
            "text": "Some examples of what we did: "
        },
        {
            "heading": 3,
            "text": "We improved the tools guidance to focus on people’s needs  "
        },
        {
            "text": "Before, the tools section was just a list of tools and how to install them. But users wanted to know: "
        },
        {
            "text": " So we made the content clearer: "
        },
        {
            "heading": 3,
            "text": "We simplified the homepage "
        },
        {
            "text": "The old homepage was too busy - with lots of icons, images, and a long scroll. The top navigation was also unclear. "
        },
        {
            "text": "So we: "
        },
        {
            "text": "The updated manual went live on 21 July 2025. Although it was created for DfE teams, anyone designing or building accessible services and websites can use it. "
        }
    ]
}