{
    "url": "https://naturalengland.blog.gov.uk/2025/09/16/natural-england-hen-harrier-programme-update-to-southern-reintroduction-project/",
    "title": "Natural England Hen Harrier Programme - Update to Southern Reintroduction Project",
    "authors": [
        "Sofía Muñoz"
    ],
    "categories": [
        "Hen Harriers"
    ],
    "pub_date": "2025-09-16T16:39:24+01:00",
    "content": [
        {
            "text": "By Sofía Muñoz, Senior Officer, Hen Harrier Southern Reintroduction"
        },
        {
            "heading": 4,
            "text": "Background"
        },
        {
            "text": "The Hen Harrier Southern Reintroduction Project was set up in 2018 with the aim of establishing a wild, farmland-nesting population of hen harriers (Circus cyaneus) in southern England. "
        },
        {
            "text": "The hen harrier is an iconic species and one of the UK's rarest and most persecuted birds of prey. The combination of its beauty, charisma and rarity make this a highly cherished and valued bird. Hen harriers were once common across the UK but were driven to extinction across most of the British Isles during the 1800s. More recently, Natural England and many organisations have put great effort into helping them recolonise parts of Scotland and northern England. "
        },
        {
            "text": "In England, their numbers are now estimated to have risen to 50 territorial pairs recorded in 2023, from four territorial pairs in 2016 – an increase of 1150%. Despite this increase in numbers, hen harriers remain at risk from illegal killing and disturbance, which is where human activities disrupt nesting sites, which can cause parent birds to abandon their nest and lead to failed eggs or chick deaths. "
        },
        {
            "text": "Increasing hen harrier numbers is a particularly challenging task as they have a strong inclination to return to the same place they have hatched and fledged, meaning they don't spread to new areas easily.  "
        },
        {
            "heading": 4,
            "text": "Project timeline"
        },
        {
            "text": "In 2018, the Hen Harrier Southern Reintroduction project was conceived to encourage recolonisation of hen harriers further south in the UK. The project initially sought to translocate young hen harriers from continental Europe for release in the UK. However, collaboration between EU states and new importation rules for animals following the UK’s exit from the EU meant that translocation of young fledging birds became unfeasible due to extensive quarantine periods.   "
        },
        {
            "text": "Instead, a pioneering captive conservation breeding programme was developed which focussed on releasing offspring bred in the UK from adult birds imported from France and Spain. Beginning in late 2022, this ambitious programme hoped to boost the number of hen harriers in the UK with minimal impact on wild populations. The project sought to release a minimum of 100 juvenile hen harriers over a five-year period to ensure the best chances of success. "
        },
        {
            "text": "In continental Europe, hen harriers nest on farmland which is directly comparable to much of the arable landscape across southern England. As part of the project, release pens were situated among an arable crop and these would be used to introduce chicks to the site from the captive breeding facility several weeks before fledging. It was hoped that this would enable them to familiarise themselves with the habitat and area around the release site, leading to them returning to breed in this same location in subsequent years. "
        },
        {
            "heading": 4,
            "text": "Latest situation"
        },
        {
            "text": "The third breeding season for the captive birds began in 2025.  While the adult birds had not bred successfully in the first two years of the programme, advances in their breeding behaviour over the two years (2023; 2024) had been noted. This meant that the team were optimistic that that things were moving in the right direction to eventually produce chicks for release. However, to the team’s disappointment, the females unfortunately laid infertile eggs in 2025, meaning that no chicks would be released this year.  "
        },
        {
            "heading": 4,
            "text": "Future of the project"
        },
        {
            "text": "The Southern Reintroduction project constitutes one of six components of the Joint action plan for the recovery of the English hen harrier population (2016) being delivered by Natural England, with the support of DEFRA. It has been running in parallel with other activities, such as the long-term monitoring of the species in northern England. "
        },
        {
            "text": "Following a thorough review, it has become clear that Natural England is no longer in a position to provide the long-term funding and resource needed to continue delivering the Hen Harrier Southern Reintroduction project, despite the progress to date. The difficult decision has therefore been made to conclude this project.  "
        },
        {
            "text": "The welfare of the hen harriers held in captivity for the conservation breeding programme remains the priority for the project through its closing phase. A number of options exist for the birds, and these will be explored in full. As they are unsuitable for release into the wild, they will be transferred into the care of a suitable host organisation. Organisations will be considered suitable where they are able to ensure the ongoing welfare of the birds for the remainder of their natural lives. In addition, Natural England would not preclude continuation of the conservation breeding programme under the leadership of the chosen organisation if the priority of welfare is maintained.  "
        },
        {
            "heading": 4,
            "text": "Informing future conservation"
        },
        {
            "text": "Knowledge acquired through the delivery of this project can help to inform other conservation projects and expand our understanding of hen harrier biology. We have, for instance, gained a deeper insight into the health, genetics, and migratory patterns of hen harriers. "
        },
        {
            "text": "We would like to express our gratitude to all our partners, who have contributed their time, expertise, and commitment to this project over the years. "
        }
    ]
}