{
    "url": "https://ipo.blog.gov.uk/2025/09/16/whats-changing-our-future-patent-services/",
    "title": "What’s changing - our future patent services",
    "authors": [
        "Simeon Bowen"
    ],
    "categories": [
        "Design",
        "IPO",
        "Patents",
        "Trade marks",
        "Transformation"
    ],
    "pub_date": "2025-09-16T15:35:10+01:00",
    "content": [
        {
            "text": "Our new ‘One IPO’ patent service is due to launch in the coming months. We will be publishing a series of blogs summarising the big changes you need to know to ensure you have a smooth transition to our new service. "
        },
        {
            "text": "What better place to start than with what services are actually changing? What’s staying, what’s going, and what’s having a few tweaks around the edges? "
        },
        {
            "heading": 3,
            "text": "Why One IPO?"
        },
        {
            "text": "The new digital patent services for patents called 'One IPO’ because our long-term vision is to create one single, integrated service for all intellectual property rights in the UK – patents, trade marks and designs. Instead of having separate systems for each type of IP right, you'll eventually be able to manage everything through one unified platform. "
        },
        {
            "text": "For now, we're starting with patents only to keep the launch simple and focused. Once the patent service is established, we'll gradually add trade marks and designs to create the complete 'One IPO' experience where you truly have one service for all your IP needs. "
        },
        {
            "heading": 3,
            "text": "The new One IPO patent services "
        },
        {
            "text": "The new service will offer: "
        },
        {
            "text": "• an IPO account that will allow you to view, manage and update all of your UK patents online and in one place"
        },
        {
            "text": "• digital services for requesting changes to patents, like changing address, changing representative and transferring ownership of patents"
        },
        {
            "text": "• a digital patent application service that will enable you to save and share draft applications, submit information in the order that suits you and collaborate on applications"
        },
        {
            "text": "• features to reduce errors and save you time, by reusing information stored in your account"
        },
        {
            "text": "• features to help you manage access to your organisation's patents by creating access groups for specific teams or clients. "
        },
        {
            "heading": 3,
            "text": "Where we are"
        },
        {
            "text": "We're currently testing the service with nearly 100 customers who have submitted over 200 transactions. This helps us improve things before the public launch. "
        },
        {
            "text": "A launch date hasn't been confirmed yet, but we are working towards the service going live in early 2026. We must first pass a central government assessment to ensure it meets the highest standards. Once that's complete, we'll announce the launch date. eOLF users can request early access by contacting: information@ipo.gov.uk  "
        },
        {
            "heading": 3,
            "text": "What news is coming? "
        },
        {
            "text": "We will be publishing new blogs each week that will detail some of the key changes you can expect. Each will cover a different aspect of the service, like applying for patents, making changes or updates to patents and payments. "
        },
        {
            "text": " "
        }
    ]
}