{
    "url": "https://mojdigital.blog.gov.uk/2025/09/16/why-justice-digital-feels-like-home/",
    "title": "Why Justice Digital Feels Like Home",
    "authors": [
        "Emma Morgan"
    ],
    "categories": [
        "a great place to work",
        "National Inclusion Week",
        "Our People"
    ],
    "pub_date": "2025-09-16T13:48:33+01:00",
    "content": [
        {
            "text": "Hi, I am Emma Morgan, a Digital Talent Specialist here at Justice Digital. We don’t just talk about inclusion, we live it. It is why so many of us say it feels like home. With our values, culture, and community, it’s no wonder we are one of the best places to work in the Civil Service. "
        },
        {
            "text": "We know that our strength lies in our differences. Diverse teams bring fresh ideas, challenge assumptions, and help us see problems from new angles. That is why we work hard to make sure everyone has a voice, and that those voices are listened to. Innovation doesn’t happen in echo chambers; it happens when we embrace a range of perspectives. "
        },
        {
            "text": "Fairness matters too. Inclusivity is about recognising that people have different needs and making sure those needs are met. Whether it’s flexible working, accessibility, or tailored support, we aim to create a level playing field where everyone has the chance to succeed. "
        },
        {
            "text": "In my role as a Social Mobility Ambassador, I’ve seen first-hand how powerful visibility can be. Visiting schools in underrepresented areas and showing young people that there is a place for them in the Civil Service, it’s one of the most rewarding parts of my job. When someone sees themselves reflected in a space, it opens doors. "
        },
        {
            "text": "I also work to make sure our recruitment and development reflect the communities we serve. That means championing women in engineering, advocating for neurodiverse colleagues, and supporting those with disabilities and other underrepresented groups. "
        },
        {
            "text": "We support over 20  MoJ staff networks, including ABLE (disability), PROUD (people from diverse racial origins), SWIM (menopause), and Spirit (LGBTQ+), which amplify underrepresented voices. In justice Digital we also have targeted initiatives like the Women in Engineering Working Group and Women in Digital and Data Forum that aim to increase female representation in technical roles and leadership.  "
        },
        {
            "text": "Why Now Is the Time to Act "
        },
        {
            "text": "The theme for this year’s National Inclusion Week is #NowIsTheTime which is a reminder that progress doesn’t happen by accident.  "
        },
        {
            "text": "What are you doing now to prioritise inclusion within your teams? Please do share by leaving your comments below. "
        }
    ]
}