{
    "url": "https://prisonjobs.blog.gov.uk/2025/09/16/working-in-greater-manchester-probation/",
    "title": "Working in Greater Manchester Probation",
    "authors": [
        "Ministry of Justice"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2025-09-16T15:49:08+01:00",
    "content": [
        {
            "text": "Bob has worked in the Probation Service since 2013, starting as an agency staff member with only a vague idea of what probation is. His enthusiasm and adaptability saw him progress from operational support to a probation services officer, then fully qualified probation officer. After six years, he moved into his current staff engagement role – his “absolute dream job”."
        },
        {
            "text": "What’s your career journey in the Probation Service been like?I’ve been in my current role for just under three years now, and I can honestly say I couldn’t have a better job. It’s creative, varied and gives me the freedom to try new things. Before this, I spent six years as a probation officer, which was a huge responsibility and a real eye-opener. Making decisions that could impact offender’s lives was daunting but also incredibly rewarding. The journey to get here has been full of opportunities and brilliant colleagues, and I still enjoy coming to work every day."
        },
        {
            "text": "How did you build the confidence to handle decisions about other people’s lives in your role?I quickly realised I wasn’t making decisions alone. We always discussed cases as a team, and my manager was there whenever I needed to talk things through. It was a steep learning curve, but each experience built my confidence and taught me to trust my judgement."
        },
        {
            "text": "What’s the team atmosphere like in probation and how do you support each other?"
        },
        {
            "text": "When I was a probation officer, the team atmosphere was one of the best parts of the job. You see each other most days and everyone’s ready to step in and help if someone is struggling. That support made a high-pressure environment much more manageable. Even now, with larger teams, the culture of looking out for each other is still strong. We often socialise outside work and that bond carries into the workplace. If you have a tough session with an offender, you can always offload to the team and get advice. You are never really working alone."
        },
        {
            "text": "What does resilience mean to you in probation work?For me, resilience isn’t about bottling things up or just pushing through. Early on, I’d work late and keep going no matter what – but that wasn’t healthy. Now I see resilience as recognising when you need support and being open about it. Asking for help actually makes it easier to cope in the long run."
        },
        {
            "text": "What skills are essential for a probation officer?Patience and genuine listening are huge. People don’t always express themselves in the way you expect, so you need to give them space and time. Cutting someone off too quickly can shut them down, especially if they’ve rarely been listened to before. It’s about taking the time to respond thoughtfully, even in a fast-paced job."
        },
        {
            "text": "How do you build trust with the offenders you work with?"
        },
        {
            "text": "You have to be patient and non-judgemental from the start. Sometimes you need to focus on the relationship first. If you jump straight into tough questions, you can create barriers instead of breaking them down."
        },
        {
            "text": "What skills transfer well into probation work?"
        },
        {
            "text": "I think people who have worked as teachers or police officers have the closest skills already to what we do. But really, it’s a broad mix. I’ve even worked with a former priest. It doesn’t really matter what you’ve done before, as long as you have strong communication skills and life experience. Being able to build relationships is essential. You also need a basic level of IT because the job involves a lot of admin work."
        },
        {
            "text": "How does probation work benefit the wider community?"
        },
        {
            "text": "You can see real changes – fewer police call-outs, improved family relationships and offenders gaining pride through community projects. It’s not always visible day to day, but those small wins add up to safer communities and better outcomes for families."
        },
        {
            "text": "What advice would you give to someone considering probation work?"
        },
        {
            "text": "Always remember there’s a person behind the crime. Many people have experienced trauma, and their behaviour often stems from that. Understanding the human story alongside the offence is vital."
        },
        {
            "text": "What do your friends and family think of your job?"
        },
        {
            "text": "Most don’t fully understand what I do, some even mix it up with parole. My parents have never really worried about my safety, and I’ve always felt safe throughout my career, with only one or two tense moments."
        }
    ]
}