{
    "url": "https://teaching.blog.gov.uk/2024/11/14/a-consistent-approach-to-pupil-premium-to-improve-outcomes-for-all/",
    "title": "A Consistent Approach to Pupil Premium to Improve Outcomes for All",
    "authors": [
        "Hannah Smith and Jamie Whiteside"
    ],
    "categories": [
        "Pupil premium & PE premium",
        "Uncategorized"
    ],
    "pub_date": "2024-11-14T16:12:53+00:00",
    "content": [
        {
            "text": "St Clare’s, a Catholic primary school in the seaside town of Clacton on Sea, one of the most deprived areas of the UK. With many students locally based they have a large proportion of pupils eligible for pupil premium. Headteacher Jamie Whiteside and pupil premium lead Hannah Smith tell us how they use pupil premium funding to improve outcomes for all pupils at St Clare’s.  "
        },
        {
            "text": "Our school ethos is to create equity for all pupils regardless of circumstance, and we use pupil premium funding to support this goal.  "
        },
        {
            "text": "Diagnosing the needs of our pupil premium cohort "
        },
        {
            "text": "We take a granular approach to identifying disadvantaged pupils’ barriers early on in their school life. These barriers range from attendance to social and emotional or academic needs, and we strive to identify and try to remove these barriers to enable them to flourish.  "
        },
        {
            "text": "This is achieved through a holistic approach that includes a rigorous cycle of planning, teaching and assessment from an educational and social emotional perspective. We have systems and processes in place to recognise pupils’ needs quickly and identify what steps are needed to enable all pupils to fully access the curriculum. This approach informs our pupil premium strategy planning.  "
        },
        {
            "text": "Our approach to supporting disadvantaged pupils "
        },
        {
            "text": "Once pupils’ needs are identified, children and families have access to a number of specialist staff who help support pupils depending on their individual barriers. Working with families is an essential part of the solution and considering how we best communicate and build strong relationships with them has been an important journey. The Education Endowment Foundation’s (EEF) parental engagement research has helped guide our approach. "
        },
        {
            "text": "Part of our key principles in whatever we do - including our pupil premium strategy - is to be consistent in the approach, monitor accurately and be reflective on the effectiveness. Whatever the problem – we will find a solution. "
        },
        {
            "text": "We take a whole school approach to learning from early years to year six. All the strategies we use are evidence-informed and support sustained progression over time. They include prioritising high-quality teaching through our synthetic phonics scheme, the mastery maths approach and Trauma Perceptive practice. Staff are trained thoroughly, and strategies are embedded to ensure that children are given a consistent, quality offer by all. If, on reflection, initiatives are not well embedded or effective, we will revisit them. "
        },
        {
            "text": "Senior leaders work collaboratively with the pupils, staff, parents/carers and governors to get accurate feedback on our approach, and we welcome external providers or experts into the school to help support new initiatives. When setting up our new nurture provision to support pupils with social, emotional and mental health needs, we collaborated with local schools, visited other settings for advice and requested an inclusion review from the local authority.   "
        },
        {
            "text": "Our results and future plans "
        },
        {
            "text": "Our outcomes are consistently above average when compared against national average expectations. Our phonics screening results are consistently above the national average and 68% of our disadvantaged pupils met the expected standard in reading, writing and maths at the end of Key Stage 2.  "
        },
        {
            "text": "When surveyed, over 90% of families with children at St Clare’s stated that their children liked school, and that teaching was good. Our recent Ofsted inspection stated that the personal development of our pupils was outstanding. "
        },
        {
            "text": "Our nurture provision has enabled pupils with social, emotional and mental health needs to access a bespoke curriculum. This has resulted in the children reintegrating back into class, increased well-being and accessing core learning.   "
        },
        {
            "text": "The EEF research into arts participation is an area that we want to further develop to improve our creative curriculum offer. We are collaborating with other schools to train our staff to become “Cultural champions” who can support and lead this initiative.  "
        },
        {
            "text": "Everyone should be given the opportunity to succeed regardless of their circumstances.  Their circumstances may change over time, and so might our approach and strategies, but our principles will remain the same: be consistent, monitor accurately and be reflective.  "
        },
        {
            "text": "An often used phrase at St Clare’s is ‘find a solution, not a problem’. "
        },
        {
            "text": "Further reading:  "
        },
        {
            "text": "Pupil premium - GOV.UK  "
        },
        {
            "text": "Pupil premium: overview - GOV.UK  "
        },
        {
            "text": "Pupil premium: allocations and conditions of grant 2024 to 2025 - GOV.UK  "
        },
        {
            "text": "Using Pupil Premium: Guidance for School Leaders  "
        },
        {
            "text": "The EEF Guide to the Pupil Premium | EEF  "
        },
        {
            "text": "Teaching and Learning Toolkit | EEF  "
        }
    ]
}