{
    "url": "https://hmlandregistry.blog.gov.uk/2024/11/14/assessing-the-viability-of-housing-development-sites/",
    "title": "Assessing the viability of housing development sites  ",
    "authors": [
        "Henry Mayell, co-founder and Chief Operating Officer, Viability"
    ],
    "categories": [
        "Data"
    ],
    "pub_date": "2024-11-14T09:16:40+00:00",
    "content": [
        {
            "text": "Property technology (PropTech) start-up Viability joined the Geovation Accelerator Programme in October 2023. The programme, backed by HM Land Registry and Ordnance Survey, provides geospatial and PropTech start-ups with grant funding and 12 months of support.  "
        },
        {
            "text": "Viability is a PropTech start up that automates and improves the way property developers assess land for potential development.  "
        },
        {
            "text": "The company was founded to solve two of the biggest challenges in the property industry: the housing crisis and the need for more sustainable building practices. The platform we have developed does this by: "
        },
        {
            "text": "Viability combines data from sources like HM Land Registry (National Polygon Service and price paid data) with the analysis methodologies of industry experts who have been tackling these challenges manually for the last 40+ years. "
        },
        {
            "heading": 2,
            "text": "Tackling the site assessment problem head-on "
        },
        {
            "text": "The idea for Viability came from years spent at the coal face, assessing property development sites manually while working for many of the UK’s leading homebuilders including Barratt Homes. Combining this with detailed customer research highlighted one key issue for the industry – finding good development opportunities is incredibly complicated and time consuming and with new regulations it’s becoming harder and harder. This inefficiency is a key factor in slowing down the pace of housing delivery. "
        },
        {
            "text": "Viability allows developers to appraise multiple sites in minutes, not months. By using data from HM Land Registry, Ordnance Survey and their own datasets, the software offers accurate site appraisals.  "
        },
        {
            "text": "A particularly exciting feature is scenario analysis using Modern Methods of Construction (MMC), which enables users to explore how different construction approaches, like modular or timber frames, impact the cost and feasibility of a project while decarbonising homebuilding."
        },
        {
            "heading": 2,
            "text": "Who we are "
        },
        {
            "text": "I founded Viability with my co-founder Adria Tarrida as part of the Carbon13 venture builder. On our hunt for funding, we met Paul Higgs, an experienced property developer, ex-head of land at Barratt Homes and Founding Director of LandTech, and Paul soon joined us as a third co-founder.  "
        },
        {
            "heading": 2,
            "text": "Our customers"
        },
        {
            "text": "Viability’s customers include property developers, land agents, planners, housing associations and anyone in the homebuilding industry. These stakeholders use Viability to improve the use of development land and speed up the appraisal process of potential sites, reducing time, costs, and risks in the development pipeline to make better deals and deliver more homes. "
        },
        {
            "text": "Viability already has over 100 active users who have carried out over 1000 viability assessments and are significantly improving the efficiency of the way they assess development opportunities."
        },
        {
            "heading": 2,
            "text": "Geovation's role in the journey"
        },
        {
            "text": "Taking part in the Geovation Accelerator Programme was instrumental in accelerating our growth. It connected us with key industry players, offered valuable mentorship, and fast-tracked our development by giving us the tools to refine our platform. The community of start-ups and technical experts at Geovation provided an incredible support network. "
        },
        {
            "heading": 2,
            "text": "Going from strength to strength"
        },
        {
            "text": "Since our time at Geovation, Viability has raised over £500k from notable investors including PropTech, Venture Capitals (VCs), Seed Enterprise Investment Scheme (SEIS) funds and leading angle investors. "
        }
    ]
}