{
    "url": "https://ofsi.blog.gov.uk/2024/11/14/changes-to-sanctions-legislation-introduced-through-the-sanctions-eu-exit-miscellaneous-amendments-no-2-regulations-2024/",
    "title": "Changes to sanctions legislation introduced through the Sanctions (EU Exit) (Miscellaneous Amendments) (No.2) Regulations 2024 ",
    "authors": [
        "OFSI"
    ],
    "categories": [
        "OFSI Blog"
    ],
    "pub_date": "2024-11-14T17:05:33+00:00",
    "content": [
        {
            "text": "On 14 November 2024, the Sanctions (EU Exit) (Miscellaneous Amendments) (No.2) Regulations 2024 was laid in Parliament. This instrument introduces the following changes to sanctions legislation: "
        },
        {
            "text": "Taken together, these changes will collectively improve the ability of HM Treasury’s Office of Financial Sanctions Implementation (OFSI) to implement and enforce financial sanctions. The amendments will improve OFSI’s intelligence on industry’s compliance with UK financial sanctions, strengthen OFSI’s enforcement powers, enable OFSI to deal with licensing applications more efficiently, and will clarify financial sanctions legislation where there is existing uncertainty. "
        },
        {
            "text": "As of today (14 November 2024), OFSI updated its General, Russia, Libya, Reporting Information to OFSI, Enforcement & Monetary Penalties, and High Value Dealer and Art Market Participant guidance documents to reflect these changes to sanctions legislation.   "
        },
        {
            "text": "OFSI has published new guidance in relation to Letting Agents and Insolvency Practitioners, and updated the High Value Dealer and Art Market Participant guidance, to provide further information on upcoming reporting obligations for these sectors.  "
        },
        {
            "text": "All changes except for one (see below) will come into force on 5 December 2024.  "
        },
        {
            "text": "The extension of reporting obligations to high value dealers, art market participants, letting agents and insolvency practitioners will come into force on 14 May 2025. OFSI intends to complete further industry engagement ahead of this measure taking effect.  "
        }
    ]
}