{
    "url": "https://marinedevelopments.blog.gov.uk/2024/11/14/flashy-crabs-turn-up-in-brighton/",
    "title": "Flashy crabs turn up in Brighton!",
    "authors": [
        "Dan Cutler, Communications & Engagement Manager"
    ],
    "categories": [
        "Coastal",
        "fisheries",
        "marine conservation",
        "Marine Science"
    ],
    "pub_date": "2024-11-14T12:48:04+00:00",
    "content": [
        {
            "text": "A colourful crab with white and orange claws and blue legs recently turned up (dead) in Brighton in the summer. After a second one was found this October (alive), the alarm was raised. "
        },
        {
            "text": "These pretty, but out of place crabs have been formally identified as Atlantic Blue Crabs, a non-native species more at home in the waters of the western Atlantic Ocean and the Gulf of Mexico than in English coastal waters. "
        },
        {
            "text": "Non-Native species (NNS) are animals, plants, and other organisms that have been introduced from one region of the world to the other by human activities. Not all NNS become invasive (Invasive Non-Native Species, INNS) but, given the right conditions, some do and they can become a threat to native species and ecosystems. Currently INNS are considered to be the second biggest threat to biodiversity worldwide.  "
        },
        {
            "text": "Defra and other government bodies take the issue very seriously. Enhancing biosecurity to reduce the spread and impacts of INNS is a key component of Defra’s 25 Year Environment Plan. A cross-governmental group has been set up (see the Great Britain Non-Native Species Secretariat website). It is not only government bodies who work to limit harmful INNS getting established in our waters, fishers, boaters, marine biologists and members of the public all play a key role in identifying and reporting suspected cases.  "
        },
        {
            "text": "Any specimens caught, must not be returned or released back into the wild. This is an offence under section 14 of the wildlife and countryside act 1981. Instead   please hand them in to your local MMO office (Contact your local Marine Management Organisation office - GOV.UK). All sightings, ideally with photos, should be reported through the iRecord platform (iRecord). "
        },
        {
            "text": "The presence of NNS may be due to: "
        },
        {
            "text": "We ask you to please keep a look out and report any sightings so we can understand and assess the potential presence of these non-native visitors in our waters.  "
        },
        {
            "text": "For more information on the Atlantic Blue Crab, please see: Information note Update November 2024 Atlantic Blue Crab.docx "
        }
    ]
}