{
    "url": "https://sustainableict.blog.gov.uk/2024/11/14/keeping-ict-sustainability-on-the-agenda/",
    "title": "Keeping ICT Sustainability on the agenda",
    "authors": [
        "Chris Howes - Chief Digital and Information Officer"
    ],
    "categories": [
        "Climate action",
        "Sustainable ICT",
        "UN SDG's"
    ],
    "pub_date": "2024-11-14T08:11:54+00:00",
    "content": [
        {
            "heading": 4,
            "text": "Chris Howes shares his hopes for this year’s COP event and the opportunities it might bring to help us drive digital transformation.    "
        },
        {
            "text": "It’s that time of year again when climate change and sustainability rise to the top of the news agenda, with the Conference of the Parties to the United Nations Framework Convention on Climate Change (better known to many as COP29) getting under way this week in Baku, Azerbaijan."
        },
        {
            "text": "According to a report by the BBC “it is now \"virtually certain\" that 2024 - a year punctuated by intense heatwaves and deadly storms - will be the world's warmest on record, according to projections by the European climate service. Global average temperatures across the year are on track to end up more than 1.5C above pre-industrial levels, which would make 2024 the first calendar year to breach this symbolic mark”."
        },
        {
            "text": "Prime Minister Sir Keir Starmer has this week used his first public address at COP29 to announce a commitment to a new, more ambitious climate goal for the UK - an 81% emissions cut by 2035 (against 1990 levels)."
        },
        {
            "text": "Among the key priorities of COP 29 are securing a new goal on climate finance, ensuring every country has the means to take much stronger climate action, slashing greenhouse gas emissions, and building resilient communities."
        },
        {
            "text": "These events always provide us with opportunities to further our knowledge, through being able to have meaningful conversations with others, whether those be virtual or in person."
        },
        {
            "text": "And while ICT (Information and Communication Technology) Sustainability might not necessarily be at the top of the COP agenda, it’s clear that technology will play a vital role in mitigating, and adapting to, climate change. Equally clear is the need to manage the growth in emissions from the technology sector as this reliance increases."
        },
        {
            "text": "Three years ago, at COP26 in Glasgow, our DDTS Executive Board and I, supported by the then Defra Digital Sustainability Alliance, hosted a Technology for Climate Action session, to generate debate in the tech industry on sustainability."
        },
        {
            "text": "A year later I was in Sharm El Sheikh to formally launch the Government Digital Sustainability Alliance (GDSA), a new forum for bringing together specialists from existing or prospective digital and data suppliers to the UK Government to promote and progress knowledge and capabilities."
        },
        {
            "heading": 2,
            "text": "Tapping into the passion and energy to keep the conversation going, all year round"
        },
        {
            "text": "Although I won’t be at COP in person this time around, what I find exciting about these events is how they show the innovation and passion there is across our supply chain and the international community to both maximise the opportunities for technology to address the climate crisis, and to better manage the impacts that tech has on the environment."
        },
        {
            "text": "As this recent World Bank report acknowledges, the ICT sector finds itself at a pivotal moment, being both part of the solution, through the need to accelerate digital transformation globally, and part of the problem, through its contribution to climate change."
        },
        {
            "text": "I’ve always believed that the climate crisis, and technology’s impacts, go beyond national borders though, and COP is a great opportunity to build on this collaboration at the international level."
        },
        {
            "text": "However, just like certain gifts are for life, and not only for Christmas, so we also need to be discussing these issues continuously. One example of this, for us in Defra, is the regular dialogue I have with the UN Environment Programme’s Digital Transformation team."
        },
        {
            "text": "In addition, we are part of the Circular and Fair IT Pact network. Both these engagements offer opportunities for us to explore and discuss a range of challenging and interesting issues."
        },
        {
            "text": "Closer to home, within the UK we are collaborating with other departments through the Sustainable IT Steering Group, and in particular with our suppliers in our role as lead department for UK Government’s sustainable IT approach."
        },
        {
            "heading": 2,
            "text": "Growing our reach"
        },
        {
            "text": "We’ve been pleased to expand the GDSA recently to widen the expertise and insight we can tap into through this group. I’m looking forward to bringing all our members together for our virtual summit on 18 November, the aim of which is to introduce and welcome our new members, and to bring them into the conversation."
        },
        {
            "text": "In March, following our very first GDSA Summit, I reflected on how our journey towards driving the meeting of IT sustainability commitments was in many ways just beginning."
        },
        {
            "text": "Since then we’ve had a change of Government, and it’s already clear (and reassuringly so) that ICT has a vital role to play in helping Defra to achieve our new priorities, set out by Secretary of State Steve Reed recently.  It’s been great too hearing him talking about the importance of co-designing services with users and unlocking efficiencies to deliver high quality outcomes at lower cost - both are core parts of what we are trying to do with digital transformation in Defra. This includes transforming our own organisation too; becoming a truly digital organisation will fundamentally change how Defra operates and delivers value to customers.  "
        }
    ]
}