{
    "url": "https://insidehmcts.blog.gov.uk/2024/11/14/responding-to-operational-pressures/",
    "title": "Responding to operational pressures   ",
    "authors": [
        "Daniel Flury, Operations Director"
    ],
    "categories": [
        "Civil",
        "General",
        "Working at HMCTS"
    ],
    "pub_date": "2024-11-14T14:00:00+00:00",
    "content": [
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "text": "The criminal justice system has been under pressure for some time, with prisons at capacity and civil unrest over the summer all adding to its challenges. The Government has recently announced short term measures such as SDS40, to ease immediate pressure on the system, as well as longer term solutions such as a sentencing review and a prisons building programme."
        },
        {
            "text": "While prisons have understandably been at the forefront of a lot of the public focus, court colleagues have – for a very long time - been playing a critical role managing this pressure, ensuring that victims, witnesses and defendants have access to justice and that the most serious cases continue to be heard in court."
        },
        {
            "text": "We spoke to a number of our front-line court teams, who were instrumental in our response to Operation Early Dawn (a special measure activated to manage the flow of prisoners in and out of prison) and civil unrest over the summer."
        },
        {
            "heading": 2,
            "text": "A central approach"
        },
        {
            "text": "At the heart of our response was the Gold Command secretariat, which played a crucial role in coordinating efforts across HMCTS and with external partners. The Gold Command secretariat acted as a central hub, ensuring that decisions made at the highest levels were informed by on-the-ground realities and that these decisions were promptly communicated back to operational teams.  Kate Ward and Peter Middleton were key members of this team, working to ensure smooth communication between staff at each of our sites and rapid decision-making."
        },
        {
            "text": "Kate's role was multifaceted, involving early morning assessments, information dissemination, stakeholder co-ordination, and crisis response management. She explained, \"Our job was to assess information and escalate with senior managers if needed.\" Kate was instrumental in setting up and managing communication channels, organising meetings with Gold and Silver Commands, and liaising with external stakeholders."
        },
        {
            "text": "Peter focused on monitoring and reporting disruptions, as well as sharing critical intelligence. He noted, \"We would monitor the Teams channel for disruption reports from regions. We'd record that and use the information to do daily situation reports.\" Peter also played a crucial role in managing the flow of information related to civil unrest cases, coordinating with data analysis teams to track these cases effectively."
        },
        {
            "heading": 2,
            "text": "Early preparation"
        },
        {
            "text": "A typical day during this period started well before dawn, with teams across HMCTS working around the clock to stay ahead of the challenges. As Kate explains, \"The first thing was the half-past five PECS (Prison Escort Service) assessment. When that came in, we'd look at the data and escalate if needed, making sure everybody who needed to know had that information.\""
        },
        {
            "text": "This was then shared with the courts. Karen Turner, Acting Head of Legal Operations manager in the North East, outlined the morning process: \"We would get the first line of information from Gold Command, which would say whether we were red, amber, or green in terms of Early Dawn. If we were green, it was business as usual and prisoners would be produced during the day as normal. If amber, they might deliver some prisoners but not all.\""
        },
        {
            "text": "At 6:30am the teams dealing with overnight cases could then review this information and prepare the courts for the day, as Natalie Riley, a delivery manager in the North West explained:"
        },
        {
            "text": "\"The team dealing with overnight cases started at about half six in the morning. They get the list and make sure all the paperwork's in place, so when decisions are made about CVP ( Cloud Video Platform) versus in-person appearances, everything's ready to go.\""
        },
        {
            "text": "This early preparation was crucial for managing the day's caseload effectively and coordinating with partner agencies."
        },
        {
            "text": "The day would then progress with a series of coordinated activities, meetings and touch points throughout the day to ensure joined up working across central HMCTS, courts and our partners across the justice system."
        },
        {
            "heading": 2,
            "text": "Using technology"
        },
        {
            "text": "The increased use of video technology, particularly the Cloud Video Platform (CVP), was a key strategy in managing cases and overcoming logistical challenges in the magistrates’ courts. Janice Booth, a delivery manager in the North West region, explained how they adapted: \"We set up a Teams channel where Greater Manchester Police agreed to conduct some hearings by CVP from different stations. This meant cases could be dealt with without coming to court, reducing pressure and allowing faster processing.\""
        },
        {
            "text": "To streamline the CVP process, Janice's team created a standardised template: \"We created a CVP-ready template with the defendant's name, date of birth, custody suite, charges, and confirmation that paperwork was in our system and they'd spoken to legal representation. This allowed courts to efficiently call cases, knowing everything was in place.\""
        },
        {
            "text": "Kate noted that additional support was provided where needed: \"We liaised with operations to see what assistance they needed and were able to obtain volunteers from CTSCs and Tribunal Clerks from Scotland to run CVP for regions.\""
        },
        {
            "text": "The use of technology extended beyond just hearings. Teams channels were set up for real-time communication between agencies, allowing for quick decisions and information sharing. Peter highlighted the importance of these channels in managing civil unrest: \"We would receive police intelligence every morning. I would go through that Intelligence Report and identify cities and locations with HMCTS sites, sharing it with the regions as early as possible so they could make decisions around their sites and share it with their staff.\""
        },
        {
            "text": "This approach not only helped manage the caseload but also ensured staff safety during periods of potential unrest."
        },
        {
            "heading": 2,
            "text": "A whole system effort"
        },
        {
            "text": "The crisis demanded unprecedented levels of collaboration between HMCTS and its partners, including the police, Crown Prosecution Service (CPS), prisons, and the Prisoner Escort and Custody Services (PECS). Karen emphasized this point: \"The one real positive that came out of it was how well all the agencies can work together when we need to. It was really difficult, I'm not going to lie, but our staff worked incredibly hard.\""
        },
        {
            "text": "Andrew Morris, Acting Head of Legal Operations in Wales, highlighted the importance of strong community ties: \"We found that their intel, because of our close workings, worked extremely well, because of all the strong community ties that the police and other criminal justice partners have with communities, that may have helped the whole civil unrest scenario within Wales as well.\""
        },
        {
            "text": "The partnership working was not just about managing day-to-day operations, but also about finding innovative solutions to unprecedented challenges. For instance, when dealing with civil unrest cases, Karen described how they adapted their processes: \"We had to kind of relook at that. Once we realised that this was a lot bigger than it looked like initially and then we got direction from the senior judiciary that we could sort of collapse a lot of the time frames.\""
        },
        {
            "text": "These partnerships were crucial in managing the flow of prisoners, ensuring timely hearings, and maintaining public safety during a period of significant strain on the justice system."
        },
        {
            "heading": 2,
            "text": "A resilient court system"
        },
        {
            "text": "The criminal justice pressures over the summer tested our systems and people like never before. However, through early preparation, effective use of technology, and close collaboration with our partners, we were able to maintain access to justice even in the most challenging circumstances. The crisis demanded flexibility, with staff often working extended hours and weekends. As Kate noted, \"We were working on a rota basis in our team throughout this period to make sure we were covered from early in the morning till late evening, and weekends.\""
        },
        {
            "text": "As Kate reflected, \"Some of the relationships we built up with operational colleagues and stakeholders, including HM Prisons and Probation Service, criminal defence solicitors, the police and Crown Prosecution Service - during this time were phenomenal. I don't think we'd have got through this if we hadn't built those relationships. This sentiment was strongly echoed by other members of the team too.”"
        },
        {
            "text": "These experiences and lessons learned will undoubtedly shape our approach to future challenges, ensuring we can continue to deliver justice effectively, no matter the circumstances. The crisis highlighted the resilience, adaptability, and commitment of HMCTS teams and our partners across the justice system, reinforcing the importance of collaboration, technology, and flexible working practices in maintaining a robust and responsive court service."
        },
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "heading": 1,
            "text": "Ymateb i Bwysau Gweithredol"
        },
        {
            "text": "Mae’r system gyfiawnder troseddol wedi bod dan bwysau ers peth amser, gyda charchardai yn llawn ac aflonyddwch sifil dros yr haf i gyd yn ychwanegu at ei heriau. Yn ddiweddar, mae’r Llywodraeth wedi cyhoeddi mesurau tymor byr fel SDS40, i leddfu’r pwysau uniongyrchol ar y system, yn ogystal ag atebion tymor hwy fel adolygiad dedfrydu a rhaglen adeiladu carchardai."
        },
        {
            "text": "Er bod carchardai wedi bod yn ganolbwynt o sylw'r cyhoedd, mae cydweithwyr y llysoedd - ers amser maith - wedi bod yn chwarae rhan hanfodol yn rheoli'r pwysau hwn, gan sicrhau bod dioddefwyr, tystion a diffynyddion yn cael mynediad at gyfiawnder a bod yr achosion mwyaf difrifol yn parhau i gael eu gwrando yn y llys."
        },
        {
            "text": "Buom yn siarad â nifer o’n timau llys rheng flaen, a oedd yn allweddol yn ein hymateb i Ymgyrch Early Dawn (mesur arbennig a weithredwyd i reoli’r llif o garcharorion i mewn ac allan o’r carchar) ac aflonyddwch sifil dros yr haf."
        },
        {
            "heading": 2,
            "text": "Agwedd ganolog"
        },
        {
            "text": "Wrth wraidd ein hymateb roedd ysgrifenyddiaeth y Drefn Rheoli Aur, a chwaraeodd ran hollbwysig wrth gydlynu ymdrechion ar draws GLlTEF a chyda phartneriaid allanol. Roedd ysgrifenyddiaeth y Drefn Rheoli Aur yn gweithredu fel hwb canolog, gan sicrhau bod penderfyniadau a wnaed ar y lefelau uchaf yn cael eu llywio gan realiti ar lawr gwlad a bod y penderfyniadau hyn yn cael eu cyfleu’n brydlon i dimau gweithredol.  Roedd Kate Ward a Peter Middleton yn aelodau allweddol o’r tîm hwn, gan weithio i sicrhau cyfathrebu llyfn a bod penderfyniadau yn cael eu gwneud yn gyflym."
        },
        {
            "text": "Roedd gan rôl Kate sawl agwedd iddi, yn cynnwys asesiadau ben bore, lledaenu gwybodaeth, cydgysylltu rhanddeiliaid, a rheoli ymateb i argyfwng. Esboniodd, “Ein gwaith ni oedd asesu gwybodaeth ac uwchgyfeirio i uwch-reolwyr os oedd angen.” Roedd Kate Ward a Peter Middleton yn aelodau allweddol o’r tîm hwn, rhwng staff ym mhob un o'n safleoedd yn gwneud penderfyniadau cyflymgan weithio i sicrhau cyfathrebu llyfn a bod penderfyniadau yn cael eu gwneud yn gyflym."
        },
        {
            "text": "Canolbwyntiodd Peter ar fonitro ac adrodd am darfu, yn ogystal â rhannu gwybodaeth feirniadol. Dywedodd, “Byddem yn monitro’r sianel Teams ar gyfer adroddiadau o darfu o ranbarthau. Byddem yn cofnodi hynny ac yn defnyddio’r wybodaeth i lunio adroddiadau dyddiol ar y sefyllfa.” Chwaraeodd Peter rôl hanfodol hefyd wrth reoli llif gwybodaeth yn ymwneud ag achosion o aflonyddwch sifil, gan gydlynu â thimau dadansoddi data i olrhain yr achosion hyn yn effeithiol."
        },
        {
            "heading": 2,
            "text": "Paratoi’n gynnar"
        },
        {
            "text": "Dechreuodd diwrnod arferol yn ystod y cyfnod hwn ymhell cyn toriad y wawr, gyda thimau ar draws GLlTEF yn gweithio bob awr o’r dydd a’r nos i aros ar y blaen o’r heriau. Fel yr eglura Kate, “Y peth cyntaf oedd yr asesiad PECS (Gwasanaethau Carcharu a Hebrwng Carcharorion) hanner awr wedi pump. Pan roedd hynny’n dod i law, byddem yn edrych ar y data ac yn uwchgyfeirio os oes angen, gan wneud yn siŵr bod gan bawb oedd angen gwybod yr wybodaeth honno.”"
        },
        {
            "text": "Yna rhannwyd hwn gyda’r llysoedd. Amlinellodd Karen Turner, Pennaeth Dros Dro Rheolwr Gweithrediadau Cyfreithiol Gogledd-ddwyrain Lloegr, broses y bore: “Byddem yn cael y llinell gyntaf o wybodaeth gan Trefn Rheoli Aur, a fyddai’n dweud p’un a oeddem yn goch, yn oren neu’n wyrdd o ran Early Dawn. Pe baem yn wyrdd, roedd pethau’n rhedeg fel busnes fel arfer a byddai carcharorion yn cael ymddangos yn ystod y dydd fel arfer. Os yn oren, efallai y byddan nhw’n danfon rhai carcharorion ond nid pob un.”"
        },
        {
            "text": "Am 6:30am, gallai’r timau sy’n delio ag achosion dros nos wedyn adolygu’r wybodaeth hon a pharatoi’r llysoedd ar gyfer y diwrnod, fel yr esboniodd Natalie Riley, rheolwr cyflawni yng Ngogledd-orllewin Lloegr:"
        },
        {
            "text": "“Dechreuodd y tîm sy’n delio ag achosion dros nos tua hanner awr wedi chwech yn y bore. Maen nhw’n cael y rhestr ac yn sicrhau bod yr holl waith papur yn ei le, felly pan fydd penderfyniadau’n cael eu gwneud ynghylch defnyddio CVP (Cloud Video Platform) neu ymddangosiadau wyneb yn wyneb, mae popeth yn barod i fynd.\""
        },
        {
            "text": "Roedd y paratoi cynnar hwn yn hanfodol ar gyfer rheoli llwyth achosion y dydd yn effeithiol a chydgysylltu ag asiantaethau partner. Byddai’r diwrnod wedyn yn mynd rhagddo gyda chyfres o weithgareddau cydgysylltiedig, cyfarfodydd a phwyntiau cyswllt trwy’r dydd i sicrhau gweithio cydgysylltiedig ar draws GLlTEF canolog, y llysoedd a’n partneriaid ar draws y system gyfiawnder."
        },
        {
            "heading": 2,
            "text": "Defnyddio Technoleg"
        },
        {
            "text": "Roedd y defnydd cynyddol o dechnoleg fideo, yn enwedig Platfform Fideo’r Cwmwl (CVP), yn strategaeth allweddol wrth reoli achosion a goresgyn heriau logistaidd yn y llysoedd ynadon. Eglurodd Janice Booth, rheolwr cyflenwi yn rhanbarth Gogledd-orllewin Lloegr, sut y gwnaethant addasu: “Fe wnaethon ni sefydlu sianel Teams lle cytunodd Heddlu Manceinion Fwyaf i gynnal rhai gwrandawiadau trwy CVP o wahanol orsafoedd. Roedd hyn yn golygu y gellid delio ag achosion heb ddod i’r llys, gan leihau pwysau a chaniatáu prosesu cyflymach.”"
        },
        {
            "text": "Er mwyn symleiddio’r broses CVP, creodd tîm Janice dempled safonol: “Fe wnaethon ni greu templed ar gyfer CVP gydag enw’r diffynnydd, dyddiad geni, ystafell yn y ddalfa, cyhuddiadau, a chadarnhad bod gwaith papur yn ein system a’u bod wedi siarad â chynrychiolaeth gyfreithiol. Roedd hyn yn caniatáu i lysoedd alw achosion yn effeithlon, gan wybod bod popeth ar waith.”"
        },
        {
            "text": "Nododd Kate fod cymorth ychwanegol yn cael ei ddarparu lle bo angen: “Fe wnaethon ni gysylltu â’r adran gweithrediadau i weld pa gymorth oedd ei angen arnyn nhw ac roedden ni’n gallu cael gwirfoddolwyr gan Canolfannau Gwasanaethau’r Llysoedd a’r Tribiwnlysoedd (CTSCs) a Chlercod Tribiwnlysoedd o’r Alban i gynnal CVP ar gyfer rhanbarthau.”"
        },
        {
            "text": "Roedd y defnydd o dechnoleg yn ymestyn y tu hwnt i wrandawiadau yn unig. Sefydlwyd sianeli Teams ar gyfer cyfathrebu amser real rhwng asiantaethau, gan ganiatáu ar gyfer penderfyniadau cyflym a rhannu gwybodaeth. Tynnodd Peter sylw at bwysigrwydd y sianeli hyn wrth reoli aflonyddwch sifil: “Byddem yn derbyn gwybodaeth gan yr heddlu bob bore. Byddwn yn mynd drwy’r Adroddiad Gwybodaeth hwnnw ac yn nodi dinasoedd a lleoliadau gyda safleoedd GLlTEF, gan ei rannu â’r rhanbarthau cyn gynted â phosibl er mwyn iddynt allu gwneud penderfyniadau ynghylch eu safleoedd a’u rhannu â’u staff.”"
        },
        {
            "text": "Roedd y dull hwn nid yn unig yn helpu i reoli’r llwyth achosion ond hefyd yn sicrhau diogelwch staff yn ystod cyfnodau o aflonyddwch posibl."
        },
        {
            "heading": 2,
            "text": "Ymdrech system gyfan"
        },
        {
            "text": "Roedd yr argyfwng yn galw am lefelau digynsail o gydweithio rhwng GLlTEF a’i bartneriaid, gan gynnwys yr heddlu, Gwasanaeth Erlyn y Goron (CPS), carchardai, a’r Gwasanaethau Carcharu a Hebrwng Carcharorion (PECS). Pwysleisiodd Karen y pwynt hwn: “Yr un peth cadarnhaol a ddaeth allan ohono oedd gweld pa mor dda y gall yr holl asiantaethau gydweithio pan fo angen. Roedd yn anodd iawn, dydw i ddim yn mynd i ddweud celwydd, ond fe weithiodd ein staff yn hynod o galed.”"
        },
        {
            "text": "Amlygodd Andrew Morris, Pennaeth Dros Dro Gweithrediadau Cyfreithiol yng Nghymru, bwysigrwydd cysylltiadau cymunedol cryf: “Canfuom fod eu gwybodaeth, oherwydd ein gwaith agos, wedi gweithio’n arbennig o dda, oherwydd yr holl gysylltiadau cymunedol cryf sydd gan yr heddlu a phartneriaid cyfiawnder troseddol eraill â chymunedau, a allai fod wedi helpu’r holl senario aflonyddwch sifil yng Nghymru hefyd.”"
        },
        {
            "text": "Nid oedd y gwaith partneriaeth yn ymwneud â rheoli gweithrediadau o ddydd i ddydd yn unig, ond hefyd â dod o hyd i atebion arloesol i heriau digynsail. Er enghraifft, wrth ymdrin ag achosion o aflonyddwch sifil, disgrifiodd Karen sut y gwnaethant addasu eu prosesau: “Roedd yn rhaid i ni ailedrych ar hynny. Unwaith i ni sylweddoli bod hyn yn llawer mwy nag yr oedd yn edrych fel ar y dechrau yna cawsom gyfarwyddyd gan yr uwch-farnwriaeth y gallem chwalu llawer o'r amserlenni.\""
        },
        {
            "text": "Roedd y partneriaethau hyn yn hollbwysig wrth reoli llif carcharorion, sicrhau gwrandawiadau amserol, a chynnal diogelwch y cyhoedd yn ystod cyfnod o straen sylweddol ar y system gyfiawnder."
        },
        {
            "heading": 2,
            "text": "System llys gydnerth"
        },
        {
            "text": "Fe wnaeth y pwysau cyfiawnder troseddol dros yr haf brofi ein systemau a’n pobl fel nad oeddent erioed wedi cael eu profi o’r blaen. Fodd bynnag, trwy baratoi’n gynnar, defnydd effeithiol o dechnoleg, a chydweithio agos gyda’n partneriaid, roeddem yn gallu cynnal mynediad at gyfiawnder hyd yn oed o dan yr amgylchiadau mwyaf heriol. Roedd yr argyfwng yn gofyn am hyblygrwydd, gyda staff yn aml yn gweithio oriau estynedig ac ar benwythnosau. Fel y nododd Kate, “Roeddem yn gweithio ar sail rota yn ein tîm trwy gydol y cyfnod hwn i wneud yn siŵr bod staff yn cyflenwi o gynnar yn y bore tan hwyr gyda’r nos, ac ar benwythnosau.”"
        },
        {
            "text": "Fel y dywedodd Kate, “Roedd rhai o’r cydberthnasau y gwnaethom eu meithrin gyda chydweithwyr gweithredol a rhanddeiliaid, gan gynnwys Gwasanaeth Carchardai a Phrawf EM, cyfreithwyr amddiffyn troseddol, yr heddlu a'r Gwasanaeth Erlyn y Goron cyfnod hwn yn anhygoel. Nid wyf yn meddwl y byddem wedi dod drwy hyn pe na baem wedi meithrin y cydberthnasau hynny. Roedd aelodau eraill o’r tîm hefyd yn cytuno’n gryf â’r teimlad hwn.”"
        },
        {
            "text": "Heb os, bydd y profiadau a’r gwersi hyn a ddysgir yn llywio ein hymagwedd at heriau’r dyfodol, gan sicrhau y gallwn barhau i ddarparu cyfiawnder yn effeithiol, ni waeth beth fo’r amgylchiadau. Amlygodd yr argyfwng gydnerthedd, addasrwydd, ac ymrwymiad timau GLlTEF a’n partneriaid ar draws y system gyfiawnder, gan ategu pwysigrwydd cydweithio, technoleg ac arferion gweithio hyblyg wrth gynnal gwasanaeth llys cadarn ac ymatebol."
        }
    ]
}