{
    "url": "https://rpc.blog.gov.uk/2024/11/14/rpc-publishes-corporate-report-for-2023-24/",
    "title": "RPC publishes Corporate Report for 2023-24",
    "authors": [
        "Stephen Gibson"
    ],
    "categories": [
        "Better regulation",
        "Evaluation",
        "Independent scrutiny"
    ],
    "pub_date": "2024-11-14T12:34:13+00:00",
    "content": [
        {
            "text": "We have today published the RPC Corporate Report for 2023-24."
        },
        {
            "text": "The report summarises trends in our opinions on Impact Assessments (IAs) and Post Implementation Reviews (PIRs). It highlights a decline in the quality of analysis by government departments – with only 59% of IAs being rated fit for purpose at first submission last year (compared to 82% in 2020-21), and with almost three-quarters (72%) of IAs receiving one or more ‘weak’ or ‘very weak’ quality ratings. It also lists the 10 instances during the year where we had to issue a statement on our website criticising a government department for the lateness or absence of an IA. The report also comments on the continued failure of departments to complete PIRs."
        },
        {
            "text": "The report details our work with what is now Regulation Directorate in the Department for Business and Trade on the development of the revised Better Regulation Framework (BRF). This contains a number of proposals we have long advocated, such as earlier scrutiny of IAs, a greater emphasis on monitoring and evaluation and publishing data on departments’ performance against the BRF. We were proud to hold the successful launch event for the revised BRF at the House of Lords with over 150 guests, as well as having regular engagement with a wide range of stakeholders."
        },
        {
            "text": "We look forward to working with the new Government to achieve improvements to the effectiveness of the BRF in support of their growth agenda and welcome their commitment to the future role and importance of the RPC."
        },
        {
            "text": "If you have any comments on our work and how we might be more effective in future, we would be pleased to hear them."
        },
        {
            "text": "Please either comment below or email: enquiries@rpc.gov.uk"
        }
    ]
}