{
    "url": "https://hmlandregistry.blog.gov.uk/2024/11/14/we-are-simplifying-the-registration-of-personal-covenants/",
    "title": "We are simplifying the registration of personal covenants ",
    "authors": [
        "David Linn, Practice Team Lead"
    ],
    "categories": [
        "Law and practice"
    ],
    "pub_date": "2024-11-14T11:29:11+00:00",
    "content": [
        {
            "text": "We are making the process by which we enter personal covenants in the register more consistent. Customers now see (since 13 November) a new entry in the register in respect of personal covenants:  "
        },
        {
            "text": "We will make this entry regardless of whether the deed refers to vendor’s or purchaser’s covenants or whether the covenants relate to restrictive covenants, charges, rent charges or landlord’s covenants in leases. Previously, the entry we made varied. "
        },
        {
            "text": "We will not update existing registers until an application is lodged that prompts us either to make a new entry, or to consider an existing entry. In the latter scenario, we will make an entry reflecting the new wording above if still required. We will no longer use the wording ‘a former proprietor’. "
        },
        {
            "heading": 2,
            "text": "What has not changed"
        },
        {
            "text": "We will continue to make no reference to personal or indemnity covenants where we are making an entry in the register due to other matters contained in a deed, for example because it contains restrictive covenants or easements. "
        },
        {
            "text": "We will also maintain the concept of the \"chain of indemnity\", which ensures that liability for a positive covenant's breach is transferred with each property sale. "
        },
        {
            "heading": 2,
            "text": "Why we are making this change"
        },
        {
            "text": "The change will simplify and streamline the entry on the register. By specifically referring to the deed in the register, that deed will now be available for immediate download through the portal, making it easier for customers to obtain an official copy of the deed containing full details of the personal covenant. "
        },
        {
            "heading": 2,
            "text": "How this change will affect customers"
        },
        {
            "text": "The main change is in what will be seen in the register. Customers may see a mixture of new and old-style entries or receive a completed register after 13 November that has the old-style entries because it was processed before the new practice took effect, but completion was delayed (for example, whilst we waited for additional information). "
        },
        {
            "text": "We know it has always been necessary for customers to obtain a copy of the deed containing the specific details. Making a copy of the deed available for immediate download means they can interpret the covenant more quickly. "
        }
    ]
}