{
    "url": "https://naturalengland.blog.gov.uk/2024/11/14/west-penwith-moors-and-downs-halow-ha-gonyow-pennwydh-west-sssi-an-update-on-nature-recovery-in-west-cornwall/",
    "title": "West Penwith Moors and Downs (Halow ha Gonyow Pennwydh West) SSSI – an update on nature recovery in West Cornwall",
    "authors": [
        "Julian Donald"
    ],
    "categories": [
        "Natural England",
        "Nature Recovery",
        "Protected sites and species",
        "Site of Special Scientific Interest"
    ],
    "pub_date": "2024-11-14T08:58:14+00:00",
    "content": [
        {
            "text": "By Julian Donald – Natural England Senior Officer for West Penwith Moors and Downs"
        },
        {
            "text": "The prosperity and wellbeing of the people of Cornwall relies on a healthy natural environment with farming, fishing and tourism driving the local economy. This blog provides an update on the establishment of a new Site of Scientific Special Interest (SSSI) in West Cornwall and why we are optimistic that its role in supporting nature recovery will prove beneficial for future generations."
        },
        {
            "text": "SSSIs contain our most precious examples of wildlife and biodiversity. West Penwith Moors and Downs (Halow ha Gonyow Pennwydh West) was confirmed as a SSSI in June 2023, and until notification was one of the most important places for nature in Cornwall and England to remain unprotected. We worked for over a decade to pull together the science and evidence underpinning its designation as a SSSI and its protected status is playing a significant role in contributing to the recovery of nature in West Cornwall."
        },
        {
            "text": "The site was designated because it is home to a mosaic of nationally rare and special habitats and species. It supports lowland heath, wetlands, areas of unimproved acidic grassland and a diversity of species including plants, lichens, invertebrates, and a breeding population of Dartford warbler. Confirmation means that 3,044 hectares of some of the country’s wildest and most dramatic landscape is now protected."
        },
        {
            "text": "The reaction to the decision to designate this special place as a SSSI was mixed with many in the farming community expressing concerns about the implications of designation. They worried about the additional restrictions that could be placed on their farming operations when they are already facing uncertainty and increasing costs."
        },
        {
            "text": "Since that decision we have listened carefully to those concerns and have made significant progress to provide greater certainty and establish a healthier dialogue on which we will build towards a future where nature and farming can thrive across West Penwith."
        },
        {
            "text": "Natural England recognises the critical role farmers and other land managers have played, and will go on to play, in shaping and protecting this SSSI. Improvements can only be made through working together and Natural England is supporting land managers to care for this land in a way that will secure this rich wildlife heritage for the future."
        },
        {
            "text": "Since confirmation of the SSSI, we have worked closely with farmers and landowners, often through one-to-one meetings on their land, to agree any changes to land management, inviting the National Farmer’s Union (NFU) to join these discussions and provide further guidance."
        },
        {
            "text": "We will continue this dialogue and support to farmers over the coming months and beyond. Most recently, members of the Natural England board and executive committee, including our Chair and CEO, met with landowners to hear their concerns during a day of engagements, demonstrating our commitment to dialogue and mutual understanding."
        },
        {
            "text": "What has come through very strongly from farmers and local communities is that Penwith’s history is unique and the way the land has been managed has led to the species and habitats for which the land is now protected. Future management of the land must therefore also be based on the knowledge of those people who know that historic management best."
        },
        {
            "text": "Our experience of working with the farming community on SSSIs up and down the country shows that farmers have benefited from SSSI status through greater access to funding for sustainable farming practices, enabling nature-friendly farming to be a core part of their farming business."
        },
        {
            "text": "In our work with West Penwith farmers we have provided advice and guidance on how to access environmental land management schemes, including supporting farmers to acquire extensions to existing agri-environment agreements and to apply to Countryside Stewardship."
        },
        {
            "text": "There are now 56 agri-environment agreements in place covering 1,480.95 hectares or 49% of the SSSI. It is also hugely encouraging that Cornwall Wildlife Trust, in partnership with local farmers, has been successful in securing a Landscape Recovery pilot scheme which covers a large part of the SSSI."
        },
        {
            "text": "By capturing a shared vision for nature recovery in the area, this project will enable collaboratively tailored solutions to local challenges. Going forward we will continue to support farmers and partners in the development and implementation of the scheme."
        },
        {
            "text": "While over 90% of the SSSI is ‘rough’ land, characterised by the presence of heathland and other semi-natural vegetation, the SSSI also includes areas of enclosed ‘clean’ land that is farmed more intensively. This clean land forms part of the catchment for a number of valley mires (a type of wetland) which are dependent on low nutrient and acidic water draining from the surrounding area."
        },
        {
            "text": "To protect ground water quality, we have indicated that some farming operations may need to adjust and we understand that if farm businesses need to make changes, then this will take time. To support this transition, we have provided five-year consents for most established farming activities and over this transition period we will provide advice on how farming operations impact the quality of surface and ground water in the mire catchments."
        },
        {
            "text": "We have also taken note of the suggestion by several farmers that groundwater quality sampling would help improve our understanding of the local relationship between farming activities and water quality. To this effect, we have begun site visits alongside specialist contractors with the support of farmers and landowners to plan for the establishment of a three-year groundwater quality monitoring programme and the development of restoration plans for the 11 valley mires."
        },
        {
            "text": "We recently spent a day with the South West Peatland Partnership at Bosiliack mire to see how their work with landowners has already made significant steps towards nature recovery through Countryside Stewardship funding."
        },
        {
            "text": "We know that you cannot simply apply national guidelines to such a unique place, and we must devise a way forward that properly reflects the cultures and interests of the people of Penwith. The hard work done by our partners in the Wildlife Trust and Farm Cornwall to bring farmers together is inspiring and we want to help build on this to establish a management plan for West Penwith that is rooted in local culture and properly reflects the character of this unique and stunning landscape."
        },
        {
            "text": "We look forward to continuing this work with the farming community, local people and partners over the coming year to ensure this special place is managed and enhanced in a way that benefits wildlife and people."
        }
    ]
}