{
    "url": "https://aphascience.blog.gov.uk/2024/11/14/what-happened-at-a-canal-in-uxbridge/",
    "title": "What happened at a canal in Uxbridge?",
    "authors": [
        "Hayley Wighton",
        "Samantha Holland"
    ],
    "categories": [
        "Surveillance",
        "Wildlife"
    ],
    "pub_date": "2024-11-14T14:03:25+00:00",
    "content": [
        {
            "heading": 2,
            "text": "BLOG CONTAINS IMAGES OF ILL AND DECEASED BIRDS WHICH SOME READERS MAY FIND DISTRESSING"
        },
        {
            "text": "In early October we were contacted by a concerned member of the Swan Support Group based in Thames Valley. An increasing number of swans had been found dead over part of the Grand Union Canal in the Uxbridge area. Deaths had already been reported to Defra’s online dead wild bird reporting tool, triggering collection of these birds for avian influenza (AI) testing as part of our avian influenza surveillance strategy, however, the situation seemed to be getting worse as the weeks passed. With increasing numbers of swans, and then additional waterfowl including ducks and geese affected, there was widespread concern that this could indeed be highly pathogenic avian influenza (HPAI) rearing its head. "
        },
        {
            "heading": 3,
            "text": "Initial Suspicions  "
        },
        {
            "text": "Swans were described as lying with outstretched wings, unable to lift their heads and, in some instances, gasping. When we saw photos and videos, we suspected that something other than avian influenza could be going on and were keen to get more dead birds in for post-mortem examination (PME) at our closest Veterinary Investigation Centre (VIC) in Bury St Edmunds.  "
        },
        {
            "text": "As avian influenza is a disease which can be passed to and cause disease in humans, we could only progress with examination of internal organs once birds had tested negative for this virus. This process takes several days, and the wait was certainly challenging when further birds were dying, but to protect the health of humans handling these birds, it was a vital step we could not skip.  "
        },
        {
            "text": "We needed to examine birds as soon as possible after death to give us the best chance of learning as much as we could about their general health and potential cause of symptoms and death. The Swan Support Group were extremely helpful in identifying and gathering the best candidates for us to collect and examine. We encouraged them, and anyone else finding dead birds, to continue to report their findings on the Defra dead wild bird online tool. This tool is not only used to detect avian influenza; it provides data of where and when wild birds are dying across Great Britain even if they are not collected. The AI wild bird findings report details where avian influenza has been confirmed in dead wild birds can be found here."
        },
        {
            "text": "Any birds collected which test negative for AI, that are in suitable condition, will be given a full PME and investigated further, where indicated by our Veterinary Investigation Officers.  "
        },
        {
            "heading": 3,
            "text": "The investigation "
        },
        {
            "text": "Once we received birds at the VIC, we awaited results from AI testing conducted by the Virology Department at APHA Weybridge, so we could start internal examinations. Birds reported at the beginning of the incident returned negative HPAI results but, having been in the water, the birds were quite decomposed when they arrived. This unfortunately meant samples were not suitable for most tests and we learnt little about the cause of death of these birds. "
        },
        {
            "text": "However, now that our suspicions of AI were further reduced, we were starting to focus on alternative possible causes of the incident. We had already reported the issue to the Environment Agency and local authorities who thought that pollution was an unlikely source of the problem, and from the photos/videos we were already suspecting that a toxin, for example either lead poisoning or botulism, could be involved. "
        },
        {
            "text": "A total of 11 birds including swans, geese, ducks, and coots tested negative for HPAI. As more negative HPAI results were received, we were able to conduct full PMEs on more recently deceased birds and collect samples to send for lead and botulism testing. The organs were unremarkable to the naked eye and birds seemed to have been in good body condition with ample muscle and fat, but had not eaten well prior to death. These findings did not specifically point to a cause of death but did support our suspicion of a toxin causing the incident, as these can often cause no obvious changes to the organs. "
        },
        {
            "text": "Testing of these birds was a full UK affair with samples sent to Scotland’s Rural College (SRUC) for lead testing, and Agri-Food and BioSciences Institute (AFBI) in Northern Island for botulinum toxin testing.  "
        },
        {
            "heading": 3,
            "text": "An answer at last"
        },
        {
            "text": "Finally, the lead results came back, with the conclusion that it was unlikely that lead poisoning caused mass mortality of these birds. Our money was now on botulism and our first positive result came back from Northern Ireland earlier this month. "
        },
        {
            "text": "We are strongly suspicious that this incident was caused by a toxin from the bacteria Clostridium botulinum. This toxin causes avian botulism, a disease characterised by progressive flaccid paralysis and weakness in affected birds, causing difficulty walking or moving their wings and inability to lift their head to eat or drink. The bacteria grow in environments without oxygen and thrive on the protein from putrefying plant and animal material, and is often found in urban lakes, canals, and reservoirs.  "
        },
        {
            "text": "Outbreaks of avian botulism usually involve waterbirds, can last several weeks, and can result in hundreds of deaths. Outbreaks can recur as once in the environment; the toxin is relatively stable and persistent. In the UK, most avian botulism is likely due to C. botulinum toxin type C which has not been reported to be associated with human disease, however, care should be taken by both people and their pets where dead birds are found as other health hazards may be present in these environments. "
        },
        {
            "text": "Despite our intensive efforts to diagnose the cause of this incident, we were lucky to be able to identify botulinum toxin in our samples. Concentration in the neuro-muscular junctions, possibly in tiny quantities, means the toxin is not readily found in the blood or body tissues and is notoriously challenging to identify. Diagnoses are frequently based solely on clinical signs and the absence of post-mortem evidence. "
        },
        {
            "heading": 3,
            "text": "How you can help"
        },
        {
            "text": "It is a privilege for us to be able to increase our understanding of the threats facing our native wildlife to advocate for them and their environments, especially working in partnership with other invested organisations and local departments.  "
        },
        {
            "text": "We encourage you to also help by reporting any unusual wildlife mortality events to the APHA Diseases of Wildlife Scheme (DoWS). "
        },
        {
            "text": "DoWS conducts national surveillance for diseases of wildlife and we are always keen to be alerted to incidents like these so that we can work to understand diseases and challenges affecting our native species. Overall, the scheme helps us to recognise patterns and incidents as early as possible, allowing us to launch investigations and come to a diagnosis, such as in this case. "
        },
        {
            "heading": 3,
            "text": "Further information"
        },
        {
            "text": "For more information on avian botulism please see the following resources: "
        }
    ]
}