{
    "url": "https://socialcare.blog.gov.uk/2022/11/10/developing-our-care-colleagues-and-keeping-everyone-safe/",
    "title": "Developing our care colleagues and keeping everyone safe",
    "authors": [
        "Terri Spruce"
    ],
    "categories": [
        "Care and support",
        "coronavirus",
        "Workforce"
    ],
    "pub_date": "2022-11-10T16:10:05+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Making connections"
        },
        {
            "text": "My name is Terri Spruce and I’m the Clinical Development Lead at specialist dementia care provider, Vida Healthcare. Working in social care gives me the opportunity to do something different every day and build relationships with incredible people, from colleagues to residents and their families. I’d like to share with you my experience of working in social care and why I believe it can be an aspirational career for many people."
        },
        {
            "text": "I have over 40 years’ experience working as a nurse in the NHS. Since moving to Vida Healthcare, I work closely with the nurses and house managers who form a key part of Vida’s 500-strong team. I’m heavily involved in making sure effective care is provided for each resident through a range of initiatives and interventions. Our ultimate goal is to transform the care available to people living with dementia and provide the best possible care for our residents."
        },
        {
            "text": "Currently, I’m still  coordinating lateral flow tests across staff and residents each morning to limit the spread of Covid-19. I think for people who don’t work with vulnerable people it can be easy to think that Covid-19 has disappeared, but this is not the case."
        },
        {
            "heading": 2,
            "text": "Vaccination, protection and dementia support"
        },
        {
            "text": "We’ve recently been involved in rolling out the latest batch of Covid-19 and flu vaccines to everyone living and working in our three care homes to protect them as we head into the winter months. We are actively promoting the vaccine rollout with our staff, and working hand in hand with our pharmacy supplier to deliver bespoke clinics to enable our staff to access the vaccines."
        },
        {
            "text": "Providing clinical support across Vida’s three care homes is a crucial part of my role. I provide support for staff where requested, for example taking bloods from residents where required, or caring for wounds. I also attend regular meetings with our clinical lead to prioritise training, care and equipment and take part in GP rounds."
        },
        {
            "text": "It’s not just about resident care, however. Educating our staff to become dementia ambassadors and provide the right care for residents is crucial. From phlebotomy (the taking of bloods), to catheterisation and the simulation of real life scenarios, this prepares our staff for any situation which might arise."
        },
        {
            "text": "There are, of course, numerous challenges I experience on a daily basis, but end of life care can be a particularly difficult time for everyone involved. As a resident approaches this point, difficult decisions have to be made. This is of course extremely hard for family members and friends, but can also be upsetting for staff who’ve formed particularly close bonds with individuals. I play a crucial role in working closely with key people to talk about what’s happening and why these decisions must be made, and make sure residents receive the best possible care until the very end."
        }
    ]
}