{
    "url": "https://educationhub.blog.gov.uk/2022/11/everything-you-need-to-know-about-becoming-a-foster-parent/",
    "title": "Everything you need to know about becoming a foster parent",
    "authors": [
        "Media Officer"
    ],
    "categories": [
        "children in care",
        "Foster Carer",
        "Fostering"
    ],
    "pub_date": "2022-11-10T12:33:13+00:00",
    "content": [
        {
            "text": "Around three quarters of looked after children live in foster care."
        },
        {
            "text": "Foster parents provide a stable family environment when a child cannot live with their birth parents."
        },
        {
            "text": "Children in foster care deserve to lead fulfilling lives in nurturing environments that are centred on their needs and views."
        },
        {
            "text": "Here’s what you need to know about becoming a foster carer."
        },
        {
            "heading": 3,
            "text": "What is a foster parent? "
        },
        {
            "text": "Being a foster parent means caring for a child as part of your family."
        },
        {
            "text": "Fostering can be rewarding but also challenging. Foster parents look after some of our most vulnerable children, and it is right that they get the support and recognition they need and deserve."
        },
        {
            "heading": 3,
            "text": "Am I eligible to become a foster parent? "
        },
        {
            "text": "To become a foster parent, you need to be a UK resident or have indefinite leave to remain and be able to take care of a child or young person, often on a full-time basis."
        },
        {
            "text": "You must also be at least 18 years old, though most foster service providers will require you to be at least 21."
        },
        {
            "text": "How long you care for the child depends on the type of foster care. It can range from one night to many years, until the child is an adult."
        },
        {
            "heading": 3,
            "text": "What will I need to do as a foster parent? "
        },
        {
            "text": "If you become a foster parent you’ll need to care for the child as part of a team - this could include a local authority, schools, health professionals and the child’s birth family."
        },
        {
            "text": "You’ll also be required to keep records and write reports about the foster child,  attend meetings and advocate for the child."
        },
        {
            "text": "In addition, you will also be crucial in helping the child manage their behaviour and feelings."
        },
        {
            "heading": 3,
            "text": "Will I receive financial support for fostering a child? "
        },
        {
            "text": "Yes, all foster parents receive a foster care allowance to cover the cost of caring for a child."
        },
        {
            "text": "The minimum is usually between £137 and £240 a week, but some fostering service providers pay more than this. The total amount you get depends on a number of things such as where you live, the child age and if the child has specific needs."
        },
        {
            "text": "The fostering service you apply to will tell you how much you can get."
        },
        {
            "heading": 3,
            "text": "Is there a lengthy process to become a foster carer? "
        },
        {
            "text": "The process starts when you apply to become a foster parent and finishes with a decision from the fostering service."
        },
        {
            "text": "The process can take up to 8 months to complete."
        },
        {
            "heading": 3,
            "text": "Where can I find out more about becoming a foster parent? "
        },
        {
            "text": "You can contact your local authority about fostering."
        },
        {
            "text": "We also fund Fosterline, which offers independent, confidential and impartial advice on fostering, including the application process. Information and recent publications about fostering can be found on the government’s website https://www.gov.uk/becoming-foster-parent or https://www.gov.uk/support-for-foster-parents"
        }
    ]
}