{
    "url": "https://deframedia.blog.gov.uk/2022/11/10/frequently-asked-questions-about-the-current-bird-flu-outbreak/",
    "title": "Frequently Asked Questions about the current bird flu outbreak",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Wildlife"
    ],
    "pub_date": "2022-11-10T10:34:35+00:00",
    "content": [
        {
            "text": "With the UK battling its largest ever outbreak of bird flu, we have developed a Frequently Asked Questions section for journalists and media outlets interested in the current situation."
        },
        {
            "text": " "
        },
        {
            "text": "What is bird flu?"
        },
        {
            "text": "Bird flu is a disease of birds caused by influenza viruses. The viruses are classified according to their ability to cause severe disease in birds as either highly pathogenic or low pathogenic."
        },
        {
            "text": "The highly pathogenic strain currently circulating in the UK is very infectious, a very small amount of virus causes severe disease in birds and is often fatal."
        },
        {
            "text": " "
        },
        {
            "text": "What strain of bird flu is currently circulating? "
        },
        {
            "text": "A Eurasian strain of H5N1 highly pathogenic avian influenza is currently circulating in the UK and Europe. This strain is a very strong and infectious virus to poultry and other birds, but the risk to human health is considered very low."
        },
        {
            "text": " "
        },
        {
            "text": "What are the current measures in place across England?"
        },
        {
            "text": "On Monday 7 November, mandatory housing measures for all poultry and captive birds came into force across England."
        },
        {
            "text": "This means that all bird keepers are legally required to keep their birds housed to protect them from contact with wild birds until further notice, whilst also implementing strict biosecurity measures to help protect their flocks from the threat of bird flu."
        },
        {
            "text": "Following these steps on farm is the most effective way in reducing the risk to flocks – otherwise the disease could kill birds if no action is taken."
        },
        {
            "text": " "
        },
        {
            "text": "Why is this year’s outbreak so bad?"
        },
        {
            "text": "This year we have seen infection levels stay in our wild birds over over the summer months and as they have moved around with the colder autumn weather this has led to more cases of bird flu in our kept birds."
        },
        {
            "text": "This is why we have implemented a national Avian Influenza Prevention Zone which includes housing measures, requiring all bird keepers to house their birds and maintain stringent biosecurity standards to decrease the chances of their flocks coming into contact with infected wild birds."
        },
        {
            "text": " "
        },
        {
            "text": "Is the disease spreading within poultry and captive bird populations?"
        },
        {
            "text": "There is no evidence of the disease spreading between these groups, or onwards to wild birds. Our investigations have found that the main route of infection into our poultry and captive birds has been through direct or indirect contact with wild birds."
        },
        {
            "text": " "
        },
        {
            "text": "Will there be food supply issues in the run up to Christmas, such as turkeys?"
        },
        {
            "text": "We have a highly resilient food supply chain, producing over 11 million turkeys in the United Kingdom every year, with just under two thirds of these consumed over the Christmas period."
        },
        {
            "text": "Working with the Food Standards Agency, an easement to the marketing rules has also been introduced in England. This means that farmers who breed turkeys, geese, ducks or capons for their meat can slaughter their flocks early and freeze them. They can then be defrosted and sold to consumers between 28 November and 31 December 2022. Products will also need to be properly labelled and accompanied by in-store signage and online information for customers. The introduction of this measure will give producers certainty over business planning."
        },
        {
            "text": "This easement, the national Avian Influenza Prevention Zone and housing measures will help ensure the risks posed by avian influenza are avoided and help safeguard turkey and other bird numbers for Christmas."
        },
        {
            "text": " "
        },
        {
            "text": "Where can I find out about confirmed cases in my area?"
        },
        {
            "text": "Our case finder allows users to search for any confirmed bird flu cases in their area, as well as the disease control zones currently in place and the measures that apply in each."
        },
        {
            "text": "We cannot disclose the name or location of any premises affected by bird flu."
        },
        {
            "text": "What are Defra and the Animal and Plant Health Agency doing about dead wild birds found in my area?"
        },
        {
            "text": "Members of the public should call the Defra helpline on 03459 33 55 77 if they find dead wild birds. Currently, in Great Britain, the public are encouraged to report findings of a single dead bird of prey (including owls), three or more dead wild waterfowl (swans, geese or ducks) or gulls, or five or more dead birds of any species."
        },
        {
            "text": "We will then collect some of these birds and test them to help us understand what risk posed to poultry and other captive birds is through understanding how the disease is distributed geographically and in different types of wild bird. Reports to the Defra Helpline of found dead wild birds are triaged and not all birds will be collected."
        },
        {
            "text": "The criteria for which birds are collected are adjusted to increase or decrease the sensitivity of surveillance where appropriate. Wild birds are susceptible to a range of diseases and injuries and not all dead birds will have been infected with avian influenza.  Further information can be found in our Bird flu (avian influenza): how to spot it and report it guide on gov.uk."
        },
        {
            "text": "Where dead birds are not required for surveillance purposes and removal is warranted, it is the landowner’s responsibility to safely dispose of the carcases as animal by-products. Where dead birds are on publicly owned land, and a decision is taken to remove them, it is the local authority’s responsibility to safely dispose of the carcases as animal by-products."
        },
        {
            "text": "We fully appreciate the pressures facing local authorities amid an unprecedented bird flu outbreak, and are providing support and guidance to local authorities on handling wild bird deaths and have offered to support them with the provision of Personal Protective Equipment if necessary."
        },
        {
            "text": " "
        },
        {
            "text": "Does bird flu pose a risk to human health?"
        },
        {
            "text": "The advice from the UK Health Security Agency remains that the risk to public health from the virus is very low. Our advice to the public is not to touch or pick up any dead or visibly sick birds that they find."
        },
        {
            "text": " "
        },
        {
            "text": "Does bird flu pose a risk to food safety?"
        },
        {
            "text": "The Food Standards Agency has said that, on the basis of the current scientific evidence, bird flu poses a very low food safety risk for UK consumers. All thoroughly cooked poultry and poultry products, including eggs, are safe to eat."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}