{
    "url": "https://educationhub.blog.gov.uk/2022/11/10/get-number-confident-and-unlock-your-potential/",
    "title": "Get number-confident and unlock your potential",
    "authors": [
        "Media Officer"
    ],
    "categories": [
        "Adult learning"
    ],
    "pub_date": "2022-11-10T16:13:22+00:00",
    "content": [
        {
            "text": "Numeracy skills are vital for everyday life and work. Adults with a good grasp of numbers have a greater chance of getting a job and having higher wages. "
        },
        {
            "text": "If you need help to improve your confidence with numbers, there is a range of help available, and much of it supported by the government and free of charge. "
        },
        {
            "heading": 3,
            "text": "Why are numeracy skills important? "
        },
        {
            "text": "Being number-confident can help you take control and be better prepared to deal with everyday tasks, including managing personal or work finances, helping children with homework, working out how to split a bill between friends or even baking. "
        },
        {
            "text": "It can also lead to greater access to employment opportunities, higher wages or prepare you for further study. "
        },
        {
            "heading": 3,
            "text": "How can I boost my numeracy skills if I don’t have the right grades? "
        },
        {
            "text": "Adults can get help, including by accessing fully funded maths courses to gain either a GCSE or a Functional Skills Qualification. "
        },
        {
            "text": "If you don’t already have a GCSE or O Level at grade C or above in Maths (a 4 under the new grading system), or an equivalent qualification and you want to improve their numeracy skills, you may be eligible for this support. "
        },
        {
            "heading": 3,
            "text": "What other help is available for numeracy? "
        },
        {
            "text": "We are also rolling out our new Multiply programme to local areas across the country, which offers a range of free, flexible courses and activities designed to fit around people’s lives. "
        },
        {
            "text": "The free courses and activities are available on a part time or intensive basis. They boost opportunities for people to take the first steps into maths learning.  "
        },
        {
            "text": "This allows people to take a formal qualification that will open doors for them and help them to progress and secure well-paid jobs. "
        },
        {
            "text": "Shaunna 30, completed a free Maths course at her local college funded by the government and has never looked back, she said:"
        },
        {
            "heading": 3,
            "text": "How do I sign up? "
        },
        {
            "text": "If you’re interested in accessing free support with maths and boosting your earning potential, you can take our Multiply quick quiz or have a look at what math courses available near you here. "
        }
    ]
}