{
    "url": "https://traderemedies.blog.gov.uk/2022/11/10/its-all-about-transparency-what-information-we-publish-when-and-why/",
    "title": "It’s all about TRAnsparency: what information we publish, when and why",
    "authors": [
        "John Kirkpatrick, Investigations Delivery Director"
    ],
    "categories": [
        "Investigations"
    ],
    "pub_date": "2022-11-10T11:03:34+00:00",
    "content": [
        {
            "text": "We’ve previously looked at what data we gather as part of our investigations and what we do with it – what analyses, what calculations and what conclusions this information supports.  Below, I focus on what we share or publish in pursuit of our ambition of transparency. "
        },
        {
            "heading": 2,
            "text": "Transparency and our evidence base "
        },
        {
            "text": "Transparency is one of the TRA’s values. It contributes to us running a fair process. Whenever we ask parties for information, we seek a non-confidential version of the evidence and publish it as soon as we can to the public file. This is important because everyone can then see the evidence on which we base our decisions. Both natural justice and WTO rules require that.  "
        },
        {
            "text": "Transparency also means that other parties to any case can comment on the evidence, including telling us if they think it is wrong, incomplete or misleading. When companies send us detailed evidence – transaction-level sales data and detailed breakdowns of production costs – we have to verify that we can rely on it for the purpose of our calculations. When we have verified data, we share a draft of our verification report with the company whose data we have verified before publishing it to the public file. This ensures they can correct any misapprehensions we may have formed, and that no confidential material is accidentally published. Additionally, they are forewarned of what we are going to say publicly about their data. Transparency makes for both fairness and effectiveness. "
        },
        {
            "heading": 2,
            "text": "Transparency in analysis and conclusions "
        },
        {
            "text": "Once we have verified all the data we need to, we analyse and start to reach conclusions. As the WTO treaties and our law require, we publish a Statement of Essential Facts describing the evidence we have used in reaching our judgements, and our provisional conclusions. By publishing our evidence and our provisional conclusions, we again ensure that anyone can provide additional evidence that may not have been considered before we finalise our thinking.  "
        },
        {
            "text": "As an example, our recent publication of a Statement of Essential Facts in the HFP Rebar transition review prompted plenty of comments and additional material which has caused us to review our provisional findings. "
        },
        {
            "text": "People also take the opportunity to tell us that they agree or disagree with our provisional conclusion, and why. It is important for people to have the opportunity to say their piece and to know that their view has been heard even when they do not get the outcome they seek; that provides some reassurance that a fair process was followed, which can reinforce faith in decision making. At the same time as sharing our provisional conclusions, where we have done detailed calculations to assess a specific dumping margin for a particular exporter, we will have shared those calculations with that exporter. There’s no risk of compromising confidentiality because all the data is theirs. The exporter has the opportunity to check that we have both interpreted their data and done our calculations correctly. Often they are better placed than we are to spot any misunderstanding of the data they have provided. For example, as a result of our sharing of calculations in the aluminium extrusions case recently, we revised some of our dumping margin conclusions.   "
        },
        {
            "heading": 2,
            "text": "It's all about TRAnsparency "
        },
        {
            "text": "So this form of sharing not only gives parties reasons to trust what we have done (or, when we make mistakes, the assurance that we correct them), but also gives us greater confidence that the conclusions we have reached can be relied on. "
        },
        {
            "text": "That principle underpins everything we do in the name of transparency. Not only does it promote fairness and demonstrate that we run a proper process, but it also improves the quality of what we do and so gives our decisions and recommendations credibility. That benefits us and everyone we deal with. "
        }
    ]
}