{
    "url": "https://socialcare.blog.gov.uk/2022/11/10/nursing-time-awards-2022-with-added-social-care/",
    "title": "Nursing Time Awards 2022 with added social care!",
    "authors": [
        "Deborah Sturdy"
    ],
    "categories": [
        "Care and support",
        "Events",
        "Recognition",
        "Workforce"
    ],
    "pub_date": "2022-11-10T11:06:33+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Our time to shine (we always have)"
        },
        {
            "text": "To some ears it may sound glib, but it really isn’t. Awards matter. Recognition matters. Why? Because it proves the social care nursing profession matters."
        },
        {
            "text": "We know how good we are, the value we add and the lives we transform, but to hear it from our peers and those beyond the walls of care homes, clinics and community centres means so much. It means we’re making a positive impact – and getting noticed."
        },
        {
            "text": "That’s why I was delighted when, earlier this year, the prestigious Nursing Times Awards announced the introduction of a dedicated category for social care nursing."
        },
        {
            "text": "Whether or not you feel such recognition is long overdue, I believe the shared adversity of the pandemic – and the closer cooperation and support it encouraged between care and clinical services – made it inevitable social care nursing would take its place alongside the many other highly prized nursing categories."
        },
        {
            "text": "So, it was an absolute privilege to join colleagues from across health social care and at the Nursing Times Awards 2022, which took place at the Grosvenor House Hotel in London at the end of October."
        },
        {
            "heading": 2,
            "text": "The Oakleaf Group make history"
        },
        {
            "text": "We were there to celebrate the success of individual nurses and teams in all health and care settings, but it was a particular joy to join colleagues from The Oakleaf Group on stage as they received the very first ‘Nursing in social care’ award, sponsored by the Department of Health and Social Care."
        },
        {
            "text": "Kat Mackmin, Quality Manager and Luci Partridge, Physical Healthcare Nurse, were the driving force behind Oakleaf’s successful weight management programme for residents, an innovative project developed with residents and families during lockdown."
        },
        {
            "text": "Initiatives like these, born in a period of restricted movement for staff, residents and visitors, have proven to be as timely as they were innovative. It was even more impressive to know this programme was created to solve an issue Oakleaf colleagues identified themselves. Critically, it was person-centred, takes participants on a journey of self-improvement, and can be easily replicated across different services and settings, which is brilliant."
        },
        {
            "text": "I am so proud of Oakleaf colleagues and of all the other social care nursing awards nominees. There can only be one winner for awards like these but that doesn’t mean the work underway by other individuals and teams is any less important or valued."
        },
        {
            "text": "Don’t forget, my Chief Nurse for Adult Social Care Awards run all year round, so there is always an opportunity to nominate and celebrate the work of your peers. Thanks once again for everything you do to support people to live happier, healthier lives for longer."
        }
    ]
}