{
    "url": "https://earlyyears.blog.gov.uk/2022/11/10/ofsted-registered-nannies-what-you-need-to-know/",
    "title": "Ofsted-registered nannies – What you need to know",
    "authors": [
        "Alex Magloire, Deputy Director, Early Years Regulatory Practice"
    ],
    "categories": [
        "Early years"
    ],
    "pub_date": "2022-11-10T09:45:57+00:00",
    "content": [
        {
            "text": "This blog post explains a bit more about how and why nannies might think about registering with Ofsted and what that can mean for parents who employ a nanny."
        },
        {
            "text": "Did you know that nannies do not have to register with Ofsted?"
        },
        {
            "text": "Nannies do not legally have to register with Ofsted. However, lots of nannies do register with us. This is because parents need to use a registered service in order to claim support towards the cost of childcare. If you’re a parent reading this and you are thinking of employing a nanny, the Childcare Choices website explains everything you need to know about how to save money on childcare."
        },
        {
            "text": "As of June 2022, 8,820 nannies were registered with Ofsted. There are even more unregistered nannies out there supporting the childcare sector. Given these numbers, nannies are clearly a popular childcare option for parents. So they are important in helping parents to work!"
        },
        {
            "text": "Our guidance is aimed at nannies. It must be the nanny themselves who registers with us, not the parents. This means that, because of data protection and privacy laws, we cannot discuss a nanny’s application with parents or other individuals. Understandably, this can be frustrating but please bear with us as we try to process the applications as quickly as possible. Currently, this takes an average of 10 weeks."
        },
        {
            "text": "The legislation is clear when it comes to how many children a nanny can look after and where they can do this. If you become an Ofsted-registered nanny, you can look after the children from 1 or 2 families at the same time in one of those families’ homes."
        },
        {
            "text": "Childminders can register as nannies"
        },
        {
            "text": "If you’re already registered as a childminder with Ofsted, you can also operate as a nanny using your current registration. All you need to do is contact us to let us know you want to start providing this type of care and we will send you an updated certificate. You can email us from the email address we have on record. As of June 2022, 2,360 registered childminders had already done this!"
        },
        {
            "text": "Nannies became very popular during the COVID-19 pandemic as the early years workforce adapted quickly to immense change, and lots of childminders started to work as nannies. This sector is constantly growing and changing."
        },
        {
            "text": "If you have further questions, we’ve recently republished the requirements for ongoing registration for nannies, to help parents and providers understand the expectations of registered nannies and to make it clearer what is required."
        },
        {
            "text": "More information"
        },
        {
            "text": "Did you know:"
        },
        {
            "text": "We have a collection of guidance documents for Ofsted-registered nannies. We’ve done this so that everything is easier to understand and all available in one place."
        },
        {
            "text": "We are always looking at ways in which we can improve our guidance for providers so if you want to subscribe to updates you can do so here."
        }
    ]
}