{
    "url": "https://insolvencyservice.blog.gov.uk/2022/11/10/speak-up-week-at-the-insolvency-service/",
    "title": "Speak Up Week at the Insolvency Service",
    "authors": [
        "Steven Fifer"
    ],
    "categories": [
        "People and culture",
        "Uncategorized"
    ],
    "pub_date": "2022-11-10T12:12:31+00:00",
    "content": [
        {
            "text": "During the week of 7 November 2022, the Insolvency Service marked Speak Up Week."
        },
        {
            "text": "Championed by Alex Chisholm, the Civil Service Chief Operating Officer, Speak Up Week is all about empowering colleagues to speak up should they ever be uncomfortable or concerned about anything at work."
        },
        {
            "heading": 2,
            "text": "Speak up if you’re concerned"
        },
        {
            "text": "Speak Up Week provided the opportunity for the Insolvency Service to remind colleagues that they should speak out if they are uncomfortable. It also afforded the agency to remind colleagues of the routes available to them should they want to raise concerns."
        },
        {
            "text": "Debra Cheers, Head of Inclusion and Employee Experience for the Insolvency Service, said that we all have the right to work in a safe and comfortable environment."
        },
        {
            "text": "“There are a range of situations where you may feel uncomfortable or even concerned about something happening at work, whether that’s a situation or something impacting another colleague,” said Debra. “These can be things like concerns about someone’s wellbeing, or uncertainty about poor working practices, or something you’ve experienced or witnessed."
        },
        {
            "text": "“During Speak Up Week, we wanted to let colleagues know that if they ever feel uncomfortable or unsafe in the workplace, then they should feel comfortable to talk to someone. Having a chat can help quickly resolve a situation before it escalates, while also helping someone understand the things that make you feel uncomfortable, or indeed address a situation.”"
        },
        {
            "heading": 2,
            "text": "Speak Up Week at the Insolvency Service"
        },
        {
            "text": "During Speak Up Week, the Insolvency Service held a series of events, as well as sharing articles, digital images and videos, and other resources with colleagues, all with a focus on helping staff understand how to speak up and when."
        },
        {
            "text": "Rob Peck, Director of Official Receiver Services, kicked things off and led an interactive virtual Speak Up session. Open to all colleagues, Rob spoke about how speaking up has a unique value as it contributes towards making the Insolvency Service a safer and more positive place. Rob also explained to colleagues about the different routes for raising a concern."
        },
        {
            "text": "This was followed by Chief Executive, Dean Beale, making himself available during a day of Speak Up Week for colleagues to ask questions and discuss any concerns they may have."
        },
        {
            "text": "Dean told Insolvency Service colleagues that he fully supports Speak Up Week and wants the Insolvency Service to be a place where people can feel confident and comfortable about raising a concern."
        },
        {
            "heading": 2,
            "text": "Time for reflection"
        },
        {
            "text": "Heather Mathers, Inclusion and Employee Experience Manager for the Insolvency Service, said that Speak Up Week has been a success and gave the agency some valuable insight into how to improve cultures at the agency."
        },
        {
            "text": "“It was great to see so many people take part in the activities we held during Speak Up Week,” said Heather. “But it's important that we take on-board what people were saying, and we continually assess colleagues’ wellbeing and that they are given the opportunities to comfortably raise concerns in a safe environment.”"
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Further information"
        }
    ]
}