{
    "url": "https://mojdigital.blog.gov.uk/2022/11/10/want-to-meet-a-robot-dog/",
    "title": "Want to meet a robot dog?",
    "authors": [
        "Gina Gill"
    ],
    "categories": [
        "digital strategy",
        "Justice Digital Strategy",
        "Our services"
    ],
    "pub_date": "2022-11-10T14:41:41+01:00",
    "content": [
        {
            "text": "I had been in the MoJ for about two weeks when I was sent to a meeting to stand in for my then boss. It was an Investment Committee meeting and the subject was new prison builds. Somebody asked if we should be building new prisons in 2018 or instead thinking about different, innovative, digital solutions."
        },
        {
            "text": "I went into panic mode. I was the only digital person in the room and knew nothing about prisons and certainly didn’t have a clever alternative solution! Between thinking “please don’t ask me”, my mind went to something I’d recently seen on TV where armed robot guard dogs had basically taken over the world. Once this was in my mind, there wasn’t space for anything sensible."
        },
        {
            "text": "Thankfully, I wasn’t asked for my views, and obviously I don’t really think armed robots are an alternative to prisons. But I do think that as an organisation we collectively need to be thinking outside the box about different approaches and solutions to some of the very real and complex problems that we must contend with."
        },
        {
            "text": "We live in a world in which rapidly evolving technology provides us with many opportunities and has fundamentally changed the way in which we consume services. We stream TV rather than watching channels through an aerial, we have an app to order taxis or food, we bank online rather than going into a branch, we even get most of our junk mail via our email rather than the post-box."
        },
        {
            "text": "And then we come into our place of work and we check those expectations of the way that we operate in the outside world at the door. We work with scanning machines that are bigger than cars, we cart paper from one place to another, and we input information from one system into another. All of which means we are less efficient than we could be. And we have less time to do the things that really matter and will make a difference to users of our services, whether they be applying for legal aid, guardianship or compensation, or someone who wants to rehabilitate and reintegrate into society."
        },
        {
            "text": "I hope you’d agree that we can do better. I believe that changing the way we work, whether it involves technology or not, needs to be a collaborative effort. And so, I’m delighted to launch our first Digital Innovation month ."
        },
        {
            "text": "Over the coming weeks, there will be an opportunity for you to learn about digital (not just technology, but about digital ways of working), and how it can help us to explore the art of the possible and be more innovative in the way we approach our roles."
        },
        {
            "text": "Follow us on Twitter or email me (Gina.Gill@justice.gov.uk) to find out more and to get involved."
        }
    ]
}