{
    "url": "https://competitionandmarkets.blog.gov.uk/2022/11/10/web-3-0-and-distributed-ledger-technologies-a-regulatory-perspective/",
    "title": "Web 3.0 and distributed ledger technologies – A regulatory perspective",
    "authors": [
        "Jane Howe"
    ],
    "categories": [
        "DRCF"
    ],
    "pub_date": "2022-11-10T13:47:24+00:00",
    "content": [
        {
            "text": "Web 3.0. Is it a scam? Or the promise of fairer, more equitable internet?"
        },
        {
            "text": "The debate is highly polarised – and muddied by a lack of agreement over the meaning of the term."
        },
        {
            "text": "Broadly, “Web 3.0” is used to point to visions of a future internet. At times, such visions are conflated with aspirations for a ubiquitous virtual world, experienced synchronously by an unlimited number of users (i.e. the “Metaverse”)."
        },
        {
            "text": "More commonly, however, proponents of Web 3.0 invoke the aim of giving individuals greater control over their data through the replacement of intermediary digital platforms with peer-to-peer exchanges (see example). Associated definitions for Web 3.0 include: a “user-owned internet”, a “structure for collaboration”, a “high frequency democracy”, and “a technology, a movement and a philosophy”. (1)"
        },
        {
            "text": "Critics, meanwhile, point to inflated claims associated with Web 3.0. They highlight the absence of beneficial use cases for and prevalence of fraud and scams within applications of the underlying technology as well as its energy consumption. (2)"
        },
        {
            "text": "An ill-defined concept that attracts controversy, Web 3.0 is on the one hand associated with innovative technologies and bold visions to re-empower individuals. On the other, the technologies behind these visions are linked to existing consumer harms and potential wider societal risks."
        },
        {
            "text": "Notwithstanding the highly uncertain status of Web 3.0 and associated technologies, they undoubtedly raise key questions for policymakers and regulators."
        },
        {
            "heading": 2,
            "text": "The DRCF Web 3.0 Symposium"
        },
        {
            "text": "The Digital Regulation Cooperation Forum’s (DRCF) new technology horizon scanning programme aims to ensure that its member regulators -  Ofcom, the Information Commissioner’s Office (ICO), the Competition and Markets Authority (CMA) and the Financial Conduct Authority (FCA) - share a coherent view of emerging technologies from which to consider future regulatory opportunities and challenges."
        },
        {
            "text": "In October 2022, the DRCF brought together representatives from academia, industry, government and regulators at its Web 3.0 Symposium held in partnership with the UCL Centre for Blockchain Technologies and with contributions from the Imperial College London Centre for Financial Technology and Digital Catapult."
        },
        {
            "text": "The aim of the event was to separate hype from reality by understanding how the Web 3.0 ecosystem is evolving and unpacking the regulatory opportunities and challenges facing both firms and public authorities. With expert speakers and over 200 participants, the day involved:"
        },
        {
            "text": "This blog summarises the main themes arising from the event. The DRCF intends to subsequently publish an Insights Paper reflecting on Web 3.0 and associated technologies."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Two key distinctions – the central concept and the technology"
        },
        {
            "text": "Setting aside questions of the viability or desirability of the assorted aspirations for Web 3.0, the panellists shared a common view of 2 important distinctions"
        },
        {
            "heading": 2,
            "text": "The central concept – decentralisation"
        },
        {
            "text": "Our keynote speaker, Jean-Phillipe Vergne, challenged participants to consider what is really meant by “decentralisation”."
        },
        {
            "text": "His thesis is that decentralisation can be understood as the dispersion of authority, made up of 2 aspects – the dispersion of information and the dispersion of decision-making. Against these measures, he suggested that DLT applications were often less decentralised than claimed, seeing the dispersion of either information or decision-making but rarely both. (3)"
        },
        {
            "heading": 2,
            "text": "The technology – DLTs"
        },
        {
            "text": "Our panellists exchanged views on DLT opportunities for Web 3.0."
        },
        {
            "text": "Products and services derived from DLTs include digital assets, such as non-fungible token (“NFTs), and decentralised finance (“DeFi”) applications. Other DLT applications include self-executing “smart contracts” as well as decentralised autonomous organisations (“DAOs”) and decentralised applications (“dApps”) governed or operated by those smart contracts."
        },
        {
            "text": "The use cases proposed by panellists illustrated the range of DLT applications as well as the uncertainty surrounding them. These included:"
        },
        {
            "text": "How ideas such as these might shape the web of tomorrow is as sharply debated as the meaning of Web 3.0 itself. Indeed, having reviewed this list, you may very well wonder, “where is the web in all of this?”"
        },
        {
            "heading": 2,
            "text": "Questions for regulators"
        },
        {
            "text": "Ideas such as these as well as the opportunities and challenges associated with them raise important questions for policymakers and regulators."
        },
        {
            "heading": 2,
            "text": "Next steps"
        },
        {
            "text": "Reflecting on the questions arising from the symposium, the DRCF intends to publish an Insights Paper reflecting on Web 3.0 and associated technologies."
        },
        {
            "text": "For the DRCF, this is only the beginning of journey. We will continue to work together to collectively learn about the technologies behind visions for a Web 3.0 and their impact on financial services, privacy and data protection, competition and online communications."
        },
        {
            "text": "As with our Metaverse Symposium, the DRCF’s Web 3.0 Symposium highlighted the importance of continued communication between industry, analysts, academics, government and regulators. We would like to share a huge thank you to all who participated in the symposium and collectively ensured an interesting and informative event."
        },
        {
            "text": "The DRCF’s next event in its new technology horizon scanning programme will consider the implications of quantum technologies."
        },
        {
            "text": "Should you have any further suggestions of technologies or topics relevant to the DRCF’s new technology horizon scanning programme, please do get in touch via our mailbox:"
        },
        {
            "text": "JoiningUpOnFutureTech@ofcom.org.uk."
        },
        {
            "text": "This blog is intended to reflect on views shared at the DRCF’s Web 3.0 Symposium and should not be taken as an indication of current or future policy by any of the DRCF member regulators."
        },
        {
            "text": "(1) Definitions provided by panellists at the DRCF Web 3.0 Symposium"
        },
        {
            "text": "(2) See, for example, “People were sucked into schemes”: Inside Molly White’s campaign against crypto, Protocol, October 2022, the National Cyber Security Centre (NCSC) position on distributed ledger technology, April 2021 and The Energy Footprint of Blockchain Consensus Mechanisms Beyond Proof-of-Work, UCL Centre for Blockchain Technologies, April 2022"
        },
        {
            "text": "(3) Underlying Jean-Phillipe Vergne’s observations was recognition that DLTs can be used to create both decentralised and centralised decision-making and information-sharing structures, depending on the design of their implementation. Ultimately, it is a human rather than technological question of what decision-making and information sharing structures are appropriate for a given DLT (or indeed any technology) application or use case (for more on this theme, see the Bank of England’s Financial Policy Committee member Carolyn Wilkins’ speech on the Governance of “Decentralised” Finance)."
        },
        {
            "text": "(4) For more on ICOs, see ICOs - The Good, The Bad And The Ugly, Forbes, May 2018 – and do read advice from the UK Financial Conduct Authority (FCA) and U.S. Securities and Exchange Commission (SEC) on risks to investors"
        },
        {
            "text": "(5) For more see, eWATERservices: Smart and sustainable water for Africa, Smart Water Magazine, April 2022"
        },
        {
            "text": "(6) For a discussion on digital identity solutions for travel see, for example, Accelerating the Transition to Digital Credentials for Travel: Lessons from KTDI – a Public-Private Collaboration for Secure and Seamless Travel, World Economic Forum, October 2021"
        }
    ]
}