{
    "url": "https://educationhub.blog.gov.uk/2022/11/10/what-is-the-national-education-nature-park-and-how-are-we-working-with-the-natural-history-museum-to-teach-children-about-climate-change-your-questions-answered/",
    "title": "What is the National Education Nature Park? And how are we working with the Natural History Museum to teach children about climate change? Your questions answered",
    "authors": [
        "Media Officer"
    ],
    "categories": [
        "climate change",
        "Schools"
    ],
    "pub_date": "2022-11-10T12:28:36+00:00",
    "content": [
        {
            "text": "Education is one of the key tools we have in the fight against climate change."
        },
        {
            "text": "Here’s what you need to know about how we are working with the Natural History Museum to deliver the National Education Nature Park and climate action award scheme."
        },
        {
            "text": "These are two key initiatives that will enable young people to learn more about the natural world around them and understand how they can play a part in making sure future generations can enjoy a cleaner, safer, greener world."
        },
        {
            "text": "What is the National Education Nature Park?"
        },
        {
            "text": "The National Education Nature Park is a project that will drive and increase engagement with nature for all children and young people. It will encourage the whole of the education estate to work with them to improve the biodiversity of their grounds."
        },
        {
            "text": "From creating pollinator-friendly habitats where biodiversity can thrive, to digging ponds, the concept will showcase how the education estate will create an environment that supports climate resilience."
        },
        {
            "text": "The Nature Park will also provide opportunities for young people to take part in community science, and in biodiversity monitoring and data analysis - learning important/key skills for the future."
        },
        {
            "text": "What is the climate action award scheme? "
        },
        {
            "text": "The climate action award scheme, which will be co designed in collaboration with children and young people, will help them develop their skills and knowledge in biodiversity and sustainability. It will also celebrate and recognise their work in protecting the local environment."
        },
        {
            "text": "For example, young people may choose to undertake a project that delivers change in their local community, such as increasing the biodiversity of a neighbourhood piece of land or helping to deliver experiences for younger children to explore nature and local woodland."
        },
        {
            "text": "The ambition is for the climate action award scheme to be recognised by employers and universities as a significant achievement. It will act as a demonstration that those children and young people have developed skills and knowledge about climate change and sustainability that will benefit their future studies and careers."
        },
        {
            "text": "How do you plan to deliver the National Education Nature Park?"
        },
        {
            "text": "A partnership, led by Esri UK and the Natural History Museum, working with the Royal Horticultural Society, the Royal Society, Royal Geographical Society (with IBG)), Learning through Landscapes, Manchester Metropolitan University and additional supporting partners, will work with the education sector to help them to map, manage and enhance all the land across the education estate, creating one, vast, virtual, nature park. This could play an important part in increasing biodiversity across the education estate and have a real impact on halting the decline of nature in England."
        },
        {
            "text": "Dr Doug Gurr, Director of the Natural History Museum said,"
        },
        {
            "text": "“We applaud the Department for Education’s initiative in encouraging a love for nature and are absolutely delighted to be the lead partner on the National Education Nature Park and climate action award scheme. "
        },
        {
            "text": "Biodiversity loss is as catastrophic as climate change and our own research has shown the UK to be one of the most nature-depleted countries in the world. "
        },
        {
            "text": "Combatting biodiversity loss by supporting children and young people in England to transform their education space for wildlife will be a significant step in addressing the planetary emergency as well as empowering young people to take action, connect with nature and become Advocates for the Planet.” "
        },
        {
            "text": "Director General of the RHS, Clare Matterson, said:"
        },
        {
            "text": "“Schools across England collectively sit on a vast estate – thought to be double the size of Birmingham – providing an exciting opportunity to engage every young person in growing, nurturing and protecting nature in their school grounds. "
        },
        {
            "text": "“We know from our work with teachers that there is a strong desire from children and young people to do more to take action for nature, creating green spaces that also provide benefits for health, social cohesion and learning.  "
        },
        {
            "text": "“This new partnership project will help supercharge school gardening that will empower the next generation to make a real difference for nature and for their future.”"
        },
        {
            "text": "They will be working with Esri UK, a well-known provider of digital mapping tools, to devise tools for use by children and young people to enable them to map the biodiversity of their estate and its improvement over time."
        },
        {
            "text": "Managing Director of Esri UK, Stuart Bonthrone, said:"
        },
        {
            "text": "“We are delighted to be working with the Department for Education on the National Education Nature Park initiative. Biodiversity and environmental sustainability are at the heart of much of the work that Esri UK and our customers are involved in globally and we have a long-standing commitment to Education, providing our software free to schools in the UK and around the world. "
        },
        {
            "text": "We are therefore particularly proud to be part of this initiative which closely reflects the core nature and values of our business.”"
        },
        {
            "text": "The Museum will also create an online hub where a wealth of information and teaching resources will empower teachers in delivering climate education and help them bring lessons outdoors, supporting the curriculum as well as improving pupil’s mental and physical wellbeing."
        },
        {
            "text": "The Museum’s online hub will also start to share guidance that teachers can access alongside suggestions of seasonal activities they can engage with to inspire and support children and young people’s learning."
        },
        {
            "text": "Where can I find out more about these initiatives? "
        },
        {
            "text": "The National Education Nature Park formed part of plans, announced at COP26, detailing how the UK education sector is to become a world leader in climate change by 2030."
        },
        {
            "text": "To find out more and keep up to date, please visit the Natural History Museum website here."
        },
        {
            "text": "You can read more about the government’s flagship Sustainability and Climate Change Strategy for Education here."
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}