{
    "url": "https://ukhsa.blog.gov.uk/2025/03/07/behind-the-scenes-at-ripl-protecting-the-uk-from-deadly-diseases/",
    "title": "Behind the Scenes at RIPL: Protecting the UK from deadly diseases",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Health security",
        "Protecting the country's health",
        "Zoonoses"
    ],
    "pub_date": "2025-03-07T18:18:33+01:00",
    "content": [
        {
            "text": "In this blog post we take a behind-the-scenes look at the Rare and Imported Pathogens Laboratory (RIPL), where our scientists work to safeguard public health from rare and deadly diseases."
        },
        {
            "heading": 2,
            "text": "Our laboratories"
        },
        {
            "text": "RIPL is the UK’s frontline clinical diagnostic laboratory for unusual, rare, and hazardous infections, particularly those imported from abroad. Every day, our scientists receive clinical samples from healthcare providers across the UK. Using diagnostic techniques like serology and polymerase chain reaction (PCR) assays, our teams work to quickly identify diseases that might be difficult to diagnose in hospital laboratories."
        },
        {
            "text": "Our specialist laboratories are equipped to detect and contain high-risk viruses such as Marburg, Ebola, and Lassa fever. These infections may be imported into the UK by returning travellers and, although extremely rare it is important to provide 24/7 access to testing to make sure proper infection control and public health measures are put in place.  We receive about one sample per week for testing for possible imported viral haemorrhagic fevers. And our rigorous containment and safety measures ensure that no pathogen slips through the cracks."
        },
        {
            "heading": 2,
            "text": "Specialised services for complex cases"
        },
        {
            "text": "Our scientists and clinicians have developed tailored diagnostic panels based on patient travel history and symptoms. These panels cover 10 world regions, allowing us to look for a number of infections in a single sample as quickly as possible, rather than ruling out possibilities one by one. From imported viruses to bacterial diseases like anthrax and Q fever, our expertise spans a wide range of infectious threats."
        },
        {
            "text": "Beyond testing hospital samples, RIPL is involved in other public health protection and surveillance work. For example, we provide testing for anthrax for samples from potentially contaminated old buildings or suspected animal infections. We are also involved in a wide range of surveillance work, including testing samples from blood donors and healthy volunteers to assess the risk of vector-borne disease in the UK. "
        },
        {
            "heading": 2,
            "text": "The Imported Fever Service"
        },
        {
            "text": "The Imported Fever Service (IFS) is the clinical face of RIPL. Our doctors support frontline NHS clinicians by providing an around-the-clock service for:"
        },
        {
            "text": "We aim to deliver fast answers and support in the diagnosis and management of patients with a fever, ensuring appropriate infection prevention and control measures, and activating public health interventions if needed."
        },
        {
            "heading": 2,
            "text": "Our role in global public health"
        },
        {
            "text": "We live in a global world, and when people travel frequently across borders, it means disease can too. Early detection is crucial to responding quickly with the appropriate public health interventions, preventing or mitigating outbreaks and saving lives."
        },
        {
            "text": "Every sample we handle represents a potential threat which means our team’s expertise and unique capability to handle dangerous diseases in our high containment laboratories and cutting-edge diagnostic facilities ensures we are timely and accurate in delivering test results."
        },
        {
            "text": "While we don’t work directly with patients, our impact is felt nationwide, from hospitals to public health responses carried out locally, and our scientists ensure the UK can remain a step ahead of emerging health threats."
        },
        {
            "text": "Read our other blog posts on rare and hazardous infections:"
        }
    ]
}