{
    "url": "https://nda.blog.gov.uk/from-reactors-to-a-role-model-lauras-journey-through-the-nda-group/",
    "title": "From reactors to a role model: Laura’s journey through the NDA group",
    "authors": [
        "Laura Hogg"
    ],
    "categories": [
        "Mission delivery",
        "Science",
        "Waste management"
    ],
    "pub_date": "2025-03-07T14:24:44+00:00",
    "content": [
        {
            "text": "To mark International Women’s Day, Laura Hogg shares her story of entering the nuclear sector at 18 and her subsequent itinerant career around the NDA group:"
        },
        {
            "text": "Throughout my career, I have been inspired, motivated and supported by some exceptional people and leaders and have benefited from their collective experience. Whilst at times I have found myself in the minority as a female professional on sites, I have seen a change in this over my 22 years in NDA group. I am encouraged to be part of an organisation that is committed to shifting the dial on gender balance in the nuclear industry and I am proud to be a woman in nuclear on International Women’s Day.  "
        },
        {
            "text": "My career with the NDA group has taken me to nearly every corner of the UK. I started as a scientific apprentice at Sellafield in 2003 after finishing school. I had made the decision to go to work at 18 instead of going to university and I wanted to pursue a career in nuclear - the industry that is the heartbeat of the community I was born and raised in."
        },
        {
            "text": "I spent my first 5 years in the environmental analytical laboratories at Sellafield analysing a range of samples for radioactivity to demonstrate Sellafield’s work was safe and compliant with its permit. The work was rewarding and felt really connected to our core purpose of creating a clean and safe environment for the future, but I was keen to gain broader experience in the industry. I took a bit of a leap, which was daunting at a young age, and moved to another NDA group site over 400 miles away in Caithness, Scotland. Dounreay - the site of the UK's fast breeder reactor research and development. That’s where my career in waste management began."
        },
        {
            "text": "The safe and secure management and disposal of radioactive waste is really the cornerstone of the NDA’s mission to decommission the UK’s earliest nuclear sites and leave a positive legacy for future generations."
        },
        {
            "text": "I gained invaluable experience from my time at Dounreay, learning about all aspects of the nuclear lifecycle through supporting the management of radioactive waste generated from the site’s oldest facilities and working to solve some first of a kind decommissioning challenges."
        },
        {
            "text": "I then moved to Nuclear Restoration Services (formerly Magnox) which is a subsidiary of the NDA. At the time NRS were responsible for decommissioning twelve sites across the UK which gave me a unique opportunity to work in a diverse range of roles. I spent time at Bradwell in Essex, Trawsfynydd in Wales and Chapelcross in Scotland before being appointed to oversee waste operations across all twelve sites allowing me to travel and work across them all."
        },
        {
            "text": "The diversity I experienced and knowledge I gained, understanding not only the technical challenges faced on our sites but also the differing communities and cultures that exist cross the NDA estate, gave me the best foundation I could have for my current role in the NDA."
        },
        {
            "text": "After 16 years in site facing roles, I relocated back home to West Cumbria and joined the NDA as a strategy manager, setting group level strategy for radioactive waste disposal. It’s a role that makes the most of my cross-estate experience and the relationships I’ve built."
        },
        {
            "text": "Disposal of radioactive waste is highly regulated and complex, so in this role one of my focus areas is enabling our operating companies to implement the strategy effectively and efficiently on the ground, supporting us to deliver our collective mission."
        },
        {
            "text": "The NDA group is committed to fostering an inclusive workplace and investing in their employees and during my time in NDA, I’ve been given a variety of opportunities to learn and develop. This includes participating in the Whitehall and Industry Group Women’s Leadership Programme and a secondment into Scottish Government providing strategic and technical leadership as they developed the programme of work to underpin the upcoming Scottish Higher Activity Waste (HAW) policy."
        },
        {
            "text": "I’ve also had the opportunity to participate in international cooperations across Japan, America and Canada. As part of this work, I was able to visit the Nuclear Power Demonstration (NPD) Closure Project in Ontario, an initiative to safely decommission Canada's first nuclear power reactor. Sharing learning and expertise with our international counterparts helps the NDA develop robust strategies and implementation approaches to decommissioning and waste management challenges in the UK."
        },
        {
            "text": "During my career, I have had the privilege of being part of many exciting projects. It’s impossible to choose a single highlight but a couple of specific memorable milestones have been being part of the team that consigned the first Low Level Waste into the new LLW disposal facility adjacent to the Dounreay site, and supporting UK Government on the development of the UK policy framework for managing radioactive substances and nuclear decommissioning, published in 2024.   "
        },
        {
            "text": "I have thoroughly enjoyed my career to date. I believe that are some extraordinary, first of a kind challenges to tackle as part of the NDA mission and I am excited to be part of it. Working across the NDA group has given me some amazing opportunities and I am looking forward to seeing what comes next."
        }
    ]
}