{
    "url": "https://giaa.blog.gov.uk/2025/03/07/government-internal-audit-knowledge-hub-network-site-how-did-we-ever-manage-without-it/",
    "title": "Government Internal Audit Knowledge Hub network site – how did we ever manage without it?",
    "authors": [
        "glynellishughes",
        "John Furley"
    ],
    "categories": [
        "Innovation",
        "People"
    ],
    "pub_date": "2025-03-07T10:33:56+00:00",
    "content": [
        {
            "text": "Do you ever feel like you're missing out on valuable internal audit related information and resources?"
        },
        {
            "text": "Before I joined the GIAA, I was a head of internal audit elsewhere. I would often think how helpful it’d be if there was a centralised platform where I could get access to all the professional and technical information that I needed, all in one place. It seemed like something of a pipe dream at the time, but the good news is that it’s finally here. Our Government Internal Audit Knowledge Hub network site is your new go-to place for everything that you need to know about internal audit in government."
        },
        {
            "text": "The hub site is a game-changing resource where we can store, organise, and share a wealth of information for users from across the UK government internal audit function. In even better news, our one-stop shop is completely free. It's like having your own personal internal audit library at your fingertips."
        },
        {
            "text": "One of the best things about our new site is its ability to help you overcome two major barriers - the unknown unknowns and not knowing who to ask for help or for information. By joining our new Knowledge Hub network for government internal audit, you can easily discover what information and resources are available to you AND you can connect with other colleagues in our function to take part in constructive discussions and share ideas."
        },
        {
            "text": "The hub site is accessible to everyone in the government internal audit function who wants to tap into the wealth of resources we have on offer, so please do tell any relevant colleagues who aren’t yet aware of it so that they can join us too."
        },
        {
            "text": "I used our GIAA AI writing engine to help me start drafting this blog and it suggested that I should say ‘Let Knowledge Hub be your go-to tool for success and watch your potential soar to new heights!’. So I won’t argue with that – there’s, nothing more to say other than let’s soar together. See you soon at the hub!"
        }
    ]
}