{
    "url": "https://insidedio.blog.gov.uk/2025/03/07/international-womens-day-celebrating-female-project-managers/",
    "title": "International Women's Day: Celebrating female Project Managers",
    "authors": [
        "Venus Tingzon"
    ],
    "categories": [
        "Construction",
        "Project Management",
        "Working at DIO"
    ],
    "pub_date": "2025-03-07T16:09:38+00:00",
    "content": [
        {
            "text": "My name is Venus Tingzon and I’m a Senior Project Manager within DIO, a role I have been in since 2020, after joining DIO as a Project Support Officer in 2017. I joined the civil service in 2004, working as a Marketing and Event Manager. It was my transferable skillset of organising and engagement that led me to my current role. My first year consisted of shadowing and supporting my current line manager and I learnt all about project management at various sites across the south of England."
        },
        {
            "text": "At this time, there were not many female project managers, so it was very common to find myself surrounded by men when attending meetings. Being new into this environment, with little knowledge and experience, I secretly felt very intimidated – not because the people I worked with, but because I was female, I felt like I didn’t fit in."
        },
        {
            "text": "However, after working closely with my team, I gained a deep insight into project management and I really enjoyed the learning and experiences I was exposed to. I have to thank my current line manager, George Liu, because I learnt so much from him when I first joined, and continue to do so now."
        },
        {
            "heading": 2,
            "text": "Leading high-profile projects"
        },
        {
            "text": "I have been involved in many high-profile projects, including an extensive refurbishment of infrastructure to support the capability of 2 Military Intelligence Battalion at Trenchard Lines, Upavon. The project involved remodelling an aircraft hangar, built in the 1930s, to provide Light Aid Detachment workshops. Refurbishment to the Battalion headquarters and Junior Ranks’ dining space, and a new extension to the armoury and ammunition store. This project was officially handed over in December 2024."
        },
        {
            "text": "In 2020, I was made the Lead Project Manager for the Soldiers’ Centre at Pirbright. The new build project which was officially handed over in January 2025 is one of the first full glulam construction on MOD estates. The building is approximately 2,000m2 and meets NET Zero requirements."
        },
        {
            "text": "Alongside various project management projects, I have also been given the opportunity to complete formal qualifications, including the Association for Project Management Qualification and a Level 4 HNC in Construction. I have been able to apply my learnings from these qualifications to my job and I now lead and mentor Assistant Project Managers through various projects."
        },
        {
            "text": "It's now nearly 8 years since I joined DIO and I’ve seen a real growth in the number of women working in DIO Major Programmes and Projects, which has been really nice. I work with some incredibly talented women (and men, of course!) and I feel proud to work for DIO, where diversity is celebrated and encouraged, even when it goes against the ‘typical’ idea of who would do that job."
        },
        {
            "text": "Outside of work, I’m also a mum to an 11-year-old girl and I hope she recognise that whilst it can be a juggling act you can be a working mum and she is fortunate as me to have a job that she enjoys."
        }
    ]
}