{
    "url": "https://food.blog.gov.uk/2025/03/07/international-womens-day-2025-celebrating-women-in-science-at-the-fsa/",
    "title": "International Women’s Day 2025: Celebrating Women in Science at the FSA",
    "authors": [
        "Dr Erin Lewis, Research Engagement and Partnerships Coordinator"
    ],
    "categories": [
        "People",
        "Science"
    ],
    "pub_date": "2025-03-07T15:23:35+00:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "The Food Standards Agency (FSA) is kicking off British Science Week 2025 by celebrating International Women’s Day, and our 2025 award-winning MHI and Vet of the Year. See what else we have planned for British Science Week at the bottom of this post."
        },
        {
            "heading": 2,
            "text": "Rio Ollerhead"
        },
        {
            "text": "What is your current team and job title?"
        },
        {
            "text": "I am an Official Auxiliary working in the North West of England in the FSA’s Field Operations division. I work as part of a team of 10 meat hygiene inspectors in my base plant."
        },
        {
            "text": "How long have you been at the FSA? "
        },
        {
            "text": "It will be 6 years in June this year when I joined the FSA. Time really does fly."
        },
        {
            "text": "How would you describe what you do, in the simplest terms?"
        },
        {
            "text": "In a nutshell, I am employed to carry out official controls, performing postmortem inspections on red and white meat carcasses and their associated offal."
        },
        {
            "text": "As meat inspectors, it’s our job to make the ultimate decision whether the meat we are inspecting is fit or unfit for human consumption and is free from any pathology, parasites and contamination."
        },
        {
            "text": "Once we have carried out our inspection, we must decide whether to apply our health mark onto the carcasses that we have inspected to show that the meat is safe to eat. We carry out our inspections by visually inspecting, incising, palpating and using smell."
        },
        {
            "text": "Alongside meat inspection, we do checks on the slaughtering process to ensure that the animals coming into the abattoirs are slaughtered humanely in accordance with legislation."
        },
        {
            "text": "We are also there to monitor the hygiene standards within the slaughterhouse, ensuring the food business operators are complying with all relevant food safety regulations."
        },
        {
            "text": "Our role is vital for protecting public health by ensuring food is safe to eat. "
        },
        {
            "text": "Tell us about a woman in science who you admire?"
        },
        {
            "text": "I really admire Dr. Temple Grandin who is a professor of Animal Science at Colorado State University. Grandin redesigned livestock handling practices by designing more humane systems, which are used worldwide to reduce the stress and suffering of animals. I was very lucky to attend one of her seminars a few years back. I really admired her unique ability to understand animal behaviour as she thinks in pictures. Grandin is also a great role model for people with autism working in science. Her success proves that people with autism can achieve great things.  "
        },
        {
            "text": "How does science feed into your current role?  "
        },
        {
            "text": "Having a strong foundation in science is essential for my role as a meat inspector. When carrying out meat inspection we need to have background knowledge on bacteria, viruses, parasites, chemical contaminants and an awareness of animal diseases and how they show up in meat. Science informs us what to look out for in the carcasses and offal and to have an understanding in anatomy and physiology is very important. You need this knowledge to effectively examine carcasses to detect any abnormalities and to prevent foodborne illnesses entering the food chain."
        },
        {
            "text": " What did you work on before joining the FSA?  "
        },
        {
            "text": "Leaving culinary college, I started my career out as a chef. I worked in pubs, cafes, restaurants, hotels and even a nursing home. I loved my time as a chef but due to the unsocial hours, I decided to make a huge career change and ended up working at a telecommunications company. I started out on the phones and ended up moving my way up to become a call centre trainer. I trained new employees on customer service and technical support in a classroom environment.  "
        },
        {
            "text": "I knew that wasn’t my forever job and always wanted to dip my toe back into the food industry again someway, somehow.  "
        },
        {
            "text": "So I decided to go and study Food Safety and Legislation at The University of Birmingham, where I graduated in 2019. I then ended up joining the Food Standards Agency whilst I was still studying and I have been with the agency ever since.  "
        },
        {
            "text": "What was your childhood dream job?   "
        },
        {
            "text": "I don’t ever remember having a specific dream job, but I do remember going into the career office at high school with my three career options to discuss, which were:  "
        },
        {
            "text": "But I’ve always had a particular interest in food, so I am happy I got to accomplish one of my three career options. Any my wanderlust has led me to so many different parts of this world.   "
        },
        {
            "text": "What is the best piece of career advice you have ever received?  "
        },
        {
            "text": "Take advantage of the all the opportunities that come your way and roll with it.  "
        },
        {
            "text": "If you could give one piece of advice to people about engaging with science, what would it be? "
        },
        {
            "text": "Be open minded and stay curious!  "
        },
        {
            "heading": 2,
            "text": "Monica Racero-Baena"
        },
        {
            "text": "What is your current team and job title?"
        },
        {
            "text": "I am the Audit Veterinary Lead for the East of England in the FSA’s Operational Assurance and Excellence Directorate. I lead a team of seven veterinarians auditing food safety management systems in approved meat establishments to ensure their compliance with legal requirements."
        },
        {
            "text": "How long have you been at the FSA?  "
        },
        {
            "text": "I joined the FSA in May 2012, so I have been here over 12 years now! "
        },
        {
            "text": "How would you describe what you do, in the simplest terms? "
        },
        {
            "text": "I provide leadership, management and technical support to the FSA team of Veterinary Auditors in the East of England. I ensure that audits in meat-approved establishments in this area are undertaken at the required frequency, using a risk-based approach and to the required quality standards. "
        },
        {
            "text": "I also participate in technical projects within the FSA, contributing to the improvement of the delivery of official controls. As an example, I lead on the Pig Portfolio that provides professional advice to ensure the coordinated provision of effective guidance, instructions, training and direction to authorised officers and associated managers responsible for implementing relevant official controls across the agency. "
        },
        {
            "text": "Tell us about a woman in science who you admire? "
        },
        {
            "text": "I really admire the courage of Elena Maseras who was the first Spanish woman to enrol in a Spanish university in 1872 at the Faculty of Medicine in Barcelona, when access was only permitted to men. She obtained a royal dispensation from King Amadeo I to complete the course, but she had no right to attend classes and had to study privately. She graduated in 1878 but was not allowed to take the final exam until 1882. She later worked as a teacher promoting the importance of hygiene in schools.  "
        },
        {
            "text": "How does science feed into your current role? "
        },
        {
            "text": "The scientific expertise of veterinarians is essential to maintaining high standards in food production and safeguarding public health. Some key areas where science is essential in my current role include the protection of animal welfare, the detection of animal diseases and contaminants that could lead to foodborne illnesses, surveillance of zoonotic diseases, control of antimicrobial resistance, verification of protocols for cleaning and disinfection in meat producing establishments and ensuring that approved meat premises adhere to legal requirements regarding animal health, public health and food safety. "
        },
        {
            "text": "What did you work on before joining the FSA? "
        },
        {
            "text": "I started my career working for the Spanish government in eradication programmes for notifiable diseases, including African horse sickness, rabies and African swine fever. When I moved to England I started working as Official Veterinarian, delivering official controls in slaughterhouses and approved meat premises. When I joined the FSA, I worked with the Enforcement and Local Authority delivery team in the development of guidance such as the E. coli O157 control of cross-contamination and several industry guides endorsed by the FSA."
        },
        {
            "text": "What was your childhood dream job?  "
        },
        {
            "text": "I loved playing being a shop manager with my sister. We sold each other everything, from our dolls’ dresses to every ornament in my mum’s lounge. I have always loved animals, but I did not consider becoming a vet until the last minute. "
        },
        {
            "text": "What is the best piece of career advice you have ever received? "
        },
        {
            "text": "Always surround yourself with the best people! Having a network of supportive, talented and inspiring individuals has always had an impact on my personal and professional growth. "
        },
        {
            "text": "If you could give one piece of advice to people about engaging with science, what would it be?  "
        },
        {
            "text": "Engaging with science will always be rewarding as you will never stop learning and discovering new things."
        },
        {
            "text": "British Science Week is a 10-day celebration of science, technology, engineering and maths. Every year has a different theme, and for 2025 the theme is “change and adapt”. This year, watch out for our: "
        },
        {
            "text": "British Science Week is a fantastic opportunity to celebrate the contributions of science to our society and inspire the next generation of scientists. We look forward to your participation and to a week filled with learning and inspiration. "
        },
        {
            "heading": 1,
            "text": "Diwrnod Rhyngwladol y Menywod 2025: dathlu menywod mewn gwyddoniaeth yn yr ASB"
        },
        {
            "text": "Mae’r Asiantaeth Safonau Bwyd (ASB) yn rhoi cychwyn ar Wythnos Wyddoniaeth Prydain 2025 drwy ddathlu Diwrnod Rhyngwladol y Menywod, a’r ddwy fenyw sydd wedi ennill ein gwobrau ar gyfer Arolygydd Hylendid Cig a Milfeddyg y Flwyddyn 2025. Gallwch chi weld beth arall sydd gennym ar y gweill ar gyfer Wythnos Wyddoniaeth Prydain ar waelod y blog hwn."
        },
        {
            "heading": 2,
            "text": "Rio Ollerhead"
        },
        {
            "text": "Ym mha dîm rydych chi’n gweithio ar hyn o bryd a beth yw teitl eich swydd?  "
        },
        {
            "text": "Rwy’n Swyddog Cynorthwyol Swyddogol, ac rwy’n gweithio yng Ngogledd-orllewin Lloegr yn is-adran Gweithrediadau Maes yr ASB. Rwy’n gweithio fel rhan o dîm o 10 o arolygwyr hylendid cig yn y ffatri lle rwy’ wedi fy lleoli."
        },
        {
            "text": "Ers pryd rydych chi wedi bod yn yr ASB?  "
        },
        {
            "text": "Bydd hi’n 6 mlynedd ym mis Mehefin eleni ers i mi ymuno â’r ASB. Mae amser wir yn mynd heibio’n gyflym."
        },
        {
            "text": "Sut byddech chi’n disgrifio eich gwaith yn syml iawn? "
        },
        {
            "text": "Yn gryno iawn, rwy’n cael fy nghyflogi i gynnal rheolaethau swyddogol, gan gynnal arolygiadau ar ôl lladd ar garcasau cig coch a gwyn a’r offal cysylltiedig."
        },
        {
            "text": "Fel arolygwyr cig, ein gwaith ni yw gwneud y penderfyniad terfynol ynghylch a yw’r cig rydyn ni’n ei archwilio yn addas neu’n anaddas i’w fwyta gan bobl ac yn rhydd o unrhyw batholeg, parasitiaid a halogiad. "
        },
        {
            "text": "Ar ôl i ni gynnal ein harolygiad, mae’n rhaid i ni benderfynu a ddylid gosod ein nod iechyd ar y carcasau rydyn ni wedi’u harolygu i ddangos bod y cig yn ddiogel i’w fwyta. Rydyn ni’n cynnal ein harolygiadau trwy archwilio’r cig yn weledol, ei endorri, ei ddylofi a’i arogli."
        },
        {
            "text": "Ochr yn ochr ag arolygu cig, rydyn ni’n gwirio’r broses ladd i sicrhau bod yr anifeiliaid sy’n dod i mewn i’r lladd-dai yn cael eu lladd heb greulondeb yn unol â deddfwriaeth."
        },
        {
            "text": "Rydyn ni yno hefyd i fonitro safonau hylendid y lladd-dy, gan sicrhau bod y gweithredwyr busnesau bwyd yn cydymffurfio â’r holl reoliadau diogelwch bwyd perthnasol."
        },
        {
            "text": "Mae ein rôl yn hanfodol ar gyfer diogelu iechyd y cyhoedd trwy sicrhau bod bwyd yn ddiogel i’w fwyta."
        },
        {
            "text": "Dywedwch wrthym am fenyw mewn gwyddoniaeth rydych chi’n ei hedmygu? "
        },
        {
            "text": "Rwy’ i wir yn edmygu Dr. Temple Grandin, sy’n Athro Gwyddor Anifeiliaid ym Mhrifysgol Talaith Colorado. Ailgynlluniodd Grandin arferion trin da byw trwy ddylunio systemau mwy trugarog, a ddefnyddir ledled y byd i leihau straen a dioddefaint anifeiliaid. Roeddwn i’n ffodus iawn o gael mynd i un o’i seminarau ychydig flynyddoedd yn ôl. Roeddwn i wir yn edmygu ei gallu unigryw i ddeall ymddygiad anifeiliaid, oherwydd ei bod hi’n meddwl ar ffurf lluniau. Mae Grandin hefyd yn fodel rôl gwych i bobl ag awtistiaeth sy’n gweithio ym maes gwyddoniaeth. Mae ei llwyddiant yn profi y gall pobl ag awtistiaeth gyflawni pethau mawr."
        },
        {
            "text": "Sut mae gwyddoniaeth yn rhan o’ch rôl bresennol? "
        },
        {
            "text": "Mae meddu ar sylfaen gref mewn gwyddoniaeth yn hanfodol ar gyfer fy rôl fel arolygydd cig. Wrth gynnal arolygiad cig, mae angen i ni fod â gwybodaeth gefndirol am facteria, feirysau, parasitiaid, halogion cemegol ac ymwybyddiaeth o glefydau anifeiliaid a sut maen nhw’n ymddangos mewn cig. Mae gwyddoniaeth yn rhoi gwybod i ni’r hyn dylen ni fod yn chwilio amdano yn y carcasau a’r offal, ac mae’n bwysig iawn meddu ar ddealltwriaeth o anatomeg a ffisioleg. Mae angen yr wybodaeth hon arnoch chi i archwilio carcasau yn effeithiol i ganfod unrhyw annormaleddau ac i atal salwch a gludir gan fwyd rhag dod i mewn i’r gadwyn fwyd."
        },
        {
            "text": "Beth oedd eich gwaith cyn ymuno â’r ASB? "
        },
        {
            "text": "Ar ôl gadael y coleg arlwyo, dechreuais i fy ngyrfa fel cogydd. Bues i’n gweithio mewn tafarndai, caffis, bwytai, gwestai a hyd yn oed mewn cartref nyrsio. Roeddwn i wrth fy modd yn gweithio fel cogydd ond oherwydd yr oriau anghymdeithasol, penderfynais i wneud newid mawr yn fy ngyrfa a chefais fy hun yn gweithio mewn cwmni telathrebu. Dechreuais i weithio ar y ffonau cyn dod yn hyfforddwr canolfan alwadau. Hyfforddais i weithwyr newydd ar wasanaeth i gwsmeriaid a chymorth technegol mewn ystafell ddosbarth."
        },
        {
            "text": "Roeddwn i’n gwybod nad dyna oedd fy swydd i am byth, ac roeddwn i bob amser eisiau darganfod fy ffordd yn ôl i’r diwydiant bwyd eto rywsut."
        },
        {
            "text": "Felly penderfynais i fynd i astudio Diogelwch Bwyd a Deddfwriaeth ym Mhrifysgol Birmingham, lle graddiais i yn 2019. Yna ymunais i â’r Asiantaeth Safonau Bwyd tra roeddwn i’n dal i astudio ac rwy’ wedi bod gyda’r asiantaeth ers hynny."
        },
        {
            "text": "Pa swydd roeddech chi’n breuddwydio am ei gwneud pan oeddech chi’n blentyn?  "
        },
        {
            "text": "Dydw i ddim yn cofio breuddwydio am swydd ddelfrydol benodol, ond rwy’n cofio mynd i mewn i’r swyddfa gyrfaoedd yn yr ysgol uwchradd gyda fy nhri opsiwn gyrfa i’w trafod, sef:"
        },
        {
            "text": "Ond rwy’ bob amser wedi bod â diddordeb arbennig mewn bwyd, felly rwy’n hapus fy mod i wedi gallu cyflawni un o’m tri opsiwn gyrfa. Ac mae fy ysfa i grwydro wedi fy arwain i gynifer o wahanol rannau o’r byd hwn. "
        },
        {
            "text": "Beth yw’r darn gorau o gyngor ar eich gyrfa a gawsoch chi erioed? "
        },
        {
            "text": "Manteisiwch ar yr holl gyfleoedd a ddaw i’ch rhan ac ewch amdani."
        },
        {
            "text": "Wrth feddwl am ymgysylltu â gwyddoniaeth, pa un darn o gyngor byddech chi’n ei roi i bobl?  "
        },
        {
            "text": "Cadwch feddwl agored a byddwch yn chwilfrydig!"
        },
        {
            "heading": 2,
            "text": "Monica Racero-Baena"
        },
        {
            "text": "Ym mha dîm rydych chi’n gweithio ar hyn o bryd a beth yw teitl eich swydd?"
        },
        {
            "text": "Fi yw’r Arweinydd Archwilio Milfeddygol ar gyfer Dwyrain Lloegr yng Nghyfarwyddiaeth Sicrwydd Gweithredol a Rhagoriaeth yr ASB. Dw i’n arwain tîm o saith milfeddyg yn archwilio systemau rheoli diogelwch bwyd mewn sefydliadau cig cymeradwy i sicrhau eu bod nhw’n cydymffurfio â gofynion cyfreithiol."
        },
        {
            "text": "Ers pryd rydych chi wedi bod yn yr ASB?"
        },
        {
            "text": "Ymunais i â’r ASB ym mis Mai 2012, felly dw i wedi bod yma dros 12 mlynedd bellach!"
        },
        {
            "text": "Sut byddech chi’n disgrifio eich gwaith yn syml iawn?"
        },
        {
            "text": "Dw i’n darparu arweinyddiaeth, rheolaeth a chymorth technegol i dîm Archwilwyr Milfeddygol yr ASB yn Nwyrain Lloegr. Dw i’n sicrhau bod archwiliadau mewn sefydliadau cig cymeradwy yn yr ardal hon hwn yn cael eu cynnal yn ôl yr amlder gofynnol, gan ddefnyddio dull sy’n seiliedig ar risg ac yn unol â’r safonau ansawdd gofynnol."
        },
        {
            "text": "Dw i hefyd yn cymryd rhan mewn prosiectau technegol o fewn yr ASB, gan gyfrannu at wella’r modd y cynhelir rheolaethau swyddogol. Er enghraifft, dw i’n arwain ar y Portffolio Moch sy’n darparu cyngor proffesiynol i sicrhau darpariaeth gydgysylltiedig o ganllawiau, cyfarwyddiadau, hyfforddiant a chyfarwyddyd effeithiol i swyddogion awdurdodedig a rheolwyr cysylltiedig sy’n gyfrifol am gynnal rheolaethau swyddogol perthnasol ar draws yr asiantaeth."
        },
        {
            "text": "Dywedwch wrthym am fenyw mewn gwyddoniaeth rydych chi’n ei hedmygu?"
        },
        {
            "text": "Rwy’n edmygu’n fawr ddewrder Elena Maseras. Hi oedd y fenyw gyntaf o Sbaen i gofrestru mewn prifysgol yn Sbaen ym 1872; gwnaeth hynny yn y Gyfadran Feddygaeth yn Barcelona, pan mai dim ond dynion a oedd yn cael astudio yno. Cafodd ollyngiad brenhinol gan y Brenin Amadeo I i gwblhau’r cwrs, ond nid oedd ganddi hawl i fynychu dosbarthiadau, ac roedd yn rhaid iddi astudio’n breifat. Graddiodd yn 1878, ond ni chaniatawyd iddi sefyll yr arholiad terfynol tan 1882. Yn ddiweddarach, bu’n gweithio fel athrawes yn hyrwyddo pwysigrwydd hylendid mewn ysgolion."
        },
        {
            "text": "Sut mae gwyddoniaeth yn rhan o’ch rôl bresennol?"
        },
        {
            "text": "Mae arbenigedd gwyddonol milfeddygon yn hanfodol i gynnal safonau uchel ym maes cynhyrchu bwyd ac wrth ddiogelu iechyd y cyhoedd. Mae rhai meysydd allweddol lle mae gwyddoniaeth yn hanfodol yn fy rôl bresennol yn cynnwys diogelu lles anifeiliaid, canfod clefydau anifeiliaid a halogion a allai arwain at salwch a gludir gan fwyd, gwyliadwriaeth o glefydau milheintiol, rheoli ymwrthedd gwrthficrobaidd, gwirio protocolau ar gyfer glanhau a diheintio mewn sefydliadau cynhyrchu cig, a sicrhau bod safleoedd cig cymeradwy yn cadw at ofynion cyfreithiol o ran iechyd anifeiliaid, iechyd y cyhoedd a diogelwch bwyd."
        },
        {
            "text": "Beth oedd eich gwaith cyn ymuno â’r ASB?"
        },
        {
            "text": "Dechreuais i fy ngyrfa yn gweithio i lywodraeth Sbaen mewn rhaglenni dileu ar gyfer clefydau hysbysadwy, gan gynnwys clefyd Affricanaidd y ceffylau, y gynddaredd a chlwy Affricanaidd y moch. Pan symudais i i Loegr, dechreuais i weithio fel Milfeddyg Swyddogol, yn cynnal rheolaethau swyddogol mewn lladd-dai a safleoedd cig cymeradwy. Pan ymunais i â’r ASB, bues i’n gweithio gyda’r tîm Gorfodi a Gwaith Gweithredu Awdurdodau Lleol i ddatblygu canllawiau fel y  canllawiau ar reoli croeshalogi E. coli O157 a nifer o ganllawiau i’r diwydiant a gymeradwywyd gan yr ASB."
        },
        {
            "text": "Pa swydd roeddech chi’n breuddwydio am ei gwneud pan oeddech chi’n blentyn?"
        },
        {
            "text": "Roeddwn i wrth fy modd yn chwarae bod yn rheolwr siop gyda fy chwaer. Gwerthon ni bopeth i’n gilydd, o ffrogiau ein dolis i bob un o’r addurniadau yn lolfa fy mam. Dw i bob amser wedi caru anifeiliaid, ond doeddwn i ddim yn ystyried dod yn filfeddyg tan y funud olaf."
        },
        {
            "text": "Beth yw’r darn gorau o gyngor ar eich gyrfa a gawsoch chi erioed?"
        },
        {
            "text": "Gwnewch yn siŵr eich bod chi’n cadw’r bobl orau o’ch cwmpas bob amser! Mae bod â rhwydwaith o unigolion cefnogol, dawnus ac ysbrydoledig bob amser wedi cael effaith ar fy nhwf personol a phroffesiynol."
        },
        {
            "text": "Wrth feddwl am ymgysylltu â gwyddoniaeth, pa un darn o gyngor byddech chi’n ei roi i bobl?"
        },
        {
            "text": "Bydd ymgysylltu â gwyddoniaeth bob amser yn werth chweil, gan na fyddwch chi byth yn rhoi’r gorau i ddysgu a darganfod pethau newydd."
        },
        {
            "text": "Mae Wythnos Wyddoniaeth Prydain yn dathlu gwyddoniaeth, technoleg, peirianneg a mathemateg dros 10 diwrnod. Mae thema wahanol bob blwyddyn, a’r thema ar gyfer 2025 yw “newid ac addasu”. Eleni, cadwch lygad allan am y canlynol:"
        },
        {
            "text": "Mae Wythnos Wyddoniaeth Prydain yn gyfle gwych i ddathlu cyfraniadau gwyddoniaeth i’n cymdeithas ac ysbrydoli’r genhedlaeth nesaf o wyddonwyr. Edrychwn ymlaen at eich cyfranogiad ac at wythnos a fydd yn llawn dysgu ac ysbrydoliaeth."
        }
    ]
}