{
    "url": "https://opss.blog.gov.uk/2025/03/07/research-to-consider-this-international-womens-day-supporting-womens-economic-empowerment-through-regulatory-reform/",
    "title": "Research to consider this International Women’s Day: supporting women’s economic empowerment through regulatory reform  ",
    "authors": [
        "The Research Strategy and Delivery Unit and The International Delivery Team"
    ],
    "categories": [
        "Careers at OPSS"
    ],
    "pub_date": "2025-03-07T10:08:50+00:00",
    "content": [
        {
            "text": "This International Women’s Day, we consider how to #AccelerateAction to empower women globally. Read our recent research aligned with this theme. "
        },
        {
            "text": "Women’s economic empowerment is vital for economic growth and sustainable development. Each year International Women’s Day celebrates the growing contributions of female entrepreneurs around the world and this year’s theme ‘accelerate action’, provides a global call to deliver strategies to advance women's equality.  Despite significant progress, the United Nations reports that women are less likely to be entrepreneurs and face more disadvantages when starting businesses, and globally women remain less likely to participate in the labour market than men."
        },
        {
            "text": "This #InternationalWomensDay, we invite you to read our recently published research, commissioned to inform the development of gender-inclusive regulatory reforms across Member States of the Association of Southeast Asian Nations (ASEAN).  "
        },
        {
            "text": "The research was commissioned by the Office for Product Safety and Standards (OPSS) to guide the design of interventions for the Regulatory Reform Pillar of the four-year ASEAN-UK Economic Integration Programme. OPSS is the lead delivery partner of this pillar, which is focussed on working, largely government-to-government with ASEAN countries towards inclusive growth by supporting, through capability building and technical support, improvements in their regulatory and standards systems."
        },
        {
            "text": "The research explored how regulatory reform could support gender equality and women’s economic empowerment, using meta-analysis to assess the existing literature and case studies on regulatory reforms. In addition, this research featured an interview programme, followed by a workshop, to discuss and validate the findings with a wide range of relevant ASEAN stakeholders."
        },
        {
            "text": "The research found that despite government initiatives to support women in businesses, women’s work continues to be dominated by informal employment, characterised by a lack of taxation, absence of social protection and job insecurity. Several key barriers to women’s economic empowerment were identified:"
        },
        {
            "text": "1) Balancing paid employment with unpaid domestic work: While female employment is rising in the ASEAN region, care and household duties have not been redistributed to men or service providers, creating a double burden for women."
        },
        {
            "text": "2) Digital skills: Women have access to basic digital technologies but are limited by their inability to access to more advanced digital skills."
        },
        {
            "text": "3) Credit access: Schemes have enhanced women’s access to credit; however many still struggle to access collateral."
        },
        {
            "text": "For the Regulatory Reform work programme, the report recommends focusing on harnessing the power of innovation and technology, capitalising on ASEAN commitments and providing training to support women’s participation in business value chains, from product design through to marketing and distribution. The report also recommends improvements to the framework within which regulations are made. This includes ensuring that when new regulations are created, gender impacts are considered, and women are consulted on the regulatory reform decisions that impact them most, to take into account socio-cultural norms and avoid unintended negative consequences."
        },
        {
            "text": "To increase the impact of this work, the findings have been discussed by relevant ASEAN stakeholders at a launch event for the research in Jakarta on 6 March.  Key topics covered include ensuring consumer product safety compliance for women entrepreneurs, examining the role of regulations on their operations and growth, and providing tailored regulatory recommendations."
        },
        {
            "text": "Findings from the research are helping to steer the UK’s design of a gender inclusive regulatory reform pillar, which aims to foster positive regulatory practices and strengthen the consumer product safety landscape in the ASEAN countries the UK works with."
        },
        {
            "text": "More broadly, gender inclusivity is important in the Department for Business and Trade’s policy space. The Comprehensive and Progressive Agreement for Trans-Pacific Partnership (CPTPP) includes the UK and several ASEAN economies and incorporates an article on Women and Economic Growth, enabling the CPTPP parties to collaboratively support women employees and business owners. The UK looks forward to working with CPTPP members to promote women’s access to the benefits and opportunities created by this agreement.  "
        },
        {
            "text": "This study shows the ongoing commitment of OPSS to research. To find out more about a career in OPSS, visit: Vacancies - OPSS"
        },
        {
            "text": "Read the full report here: Regulatory reform for businesses and consumers in ASEAN countries - GOV.UK"
        }
    ]
}