{
    "url": "https://naturalengland.blog.gov.uk/2025/03/07/the-north-can-be-a-powerhouse-for-nature-and-growth/",
    "title": "The North can be a powerhouse for Nature and growth",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Development",
        "Green Infrastructure",
        "Growth",
        "Natural Capital",
        "Natural England",
        "Nature Recovery"
    ],
    "pub_date": "2025-03-07T12:06:21+00:00",
    "content": [
        {
            "text": "\"Nature is vital to our economy our health and our security. The North has the natural assets that can help create the places people want to live, work and invest in and that will keep them happy and healthy, as well as providing green careers of the future. "
        },
        {
            "text": "\"It can be a powerhouse for Nature as well as for the economy and thanks to Nature North is well placed to make the right decisions and secure investment in nature.\"  "
        },
        {
            "text": "- Marian Spain, Chief Executive, Natural England. "
        },
        {
            "text": "Prosper and thrive"
        },
        {
            "text": "The North is truly unique. From its geography, creativity and industry to its long-established history as a region that pioneers and embraces change."
        },
        {
            "text": "Since 2018 Northern leaders from across the public, private and third sectors have come together each year to talk about the opportunities and challenges that the North faces and how collectively the North can prosper and thrive."
        },
        {
            "text": "This has been a call to action and a way to influence Government thinking. As devolution has progressed, the Convention has become the place where elected mayors and other leaders have collaborated."
        },
        {
            "text": "Natural England has been working with partners to help position the role of Nature, the environment, heritage, and culture strongly within this agenda, and this year’s Convention has demonstrated how far we have come in achieving this."
        },
        {
            "text": "Nature and net zero are now a recognised priority sitting alongside other key sectors such as place, culture, transport, trade and investment, and innovation and skills."
        },
        {
            "text": "Nature is a 'Gamechanger'"
        },
        {
            "text": "Speaking at Convention of the North, on behalf of Natural England and the Nature North partnership, Chief Executive Marian Spain pitched Nature as part of the ‘Gamechangers for the North’, five transformative opportunities that will make the North the place to drive UK growth.  "
        },
        {
            "text": "The five gamechangers have been developed through policy collaboration between northern strategic authorities, business leaders, universities and civil society representatives, and will see investment in the North’s place, culture, and natural assets."
        },
        {
            "text": "The North is well connected through its regional partnership of political, business, academic and civil society leaders. Mayors and Leaders have committed to continuing this partnership. The group published the Manifesto for the North in 2024, setting an ambition to grow the economy by £118 billion per annum by 2050, via trade and investment, net zero, transport, people and places, and including leveraging private finance to enhance nature."
        },
        {
            "text": "North's natural assets"
        },
        {
            "text": "The North covers just under a third of England’s land area, yet has:"
        },
        {
            "text": "Sadly, not all of this is in good condition (yet), but provides significant benefits for our society and economy, worth more than £6 billion per year to the North."
        },
        {
            "text": "Northern leaders are already supporting ground-breaking nature initiatives, such as the Greater Manchester Environment Fund and the North East Carbon Marketplace, and are driving partnerships for nature-based solutions, such as the Connected by Water alliance in South Yorkshire. "
        },
        {
            "text": "Pioneering initiatives"
        },
        {
            "text": "The North's pioneering approach to nature recovery is creating a blueprint for the UK's sustainable future."
        },
        {
            "text": "The Nature North partnership is leading the way, working across sectors and with our northern leaders to drive change and take a new approach to nature recovery at a regional scale."
        },
        {
            "text": "Launched by Nature North on the 25 February ‘Investing in Nature for the North’ is a clear strategic plan to scale up green investment across the region and sets out the actions, guiding principles and what the Nature North collaboration will be doing to help drive change."
        },
        {
            "text": "Speaking at the conference, David Renwick, Natural England Regional Director for the North, said:"
        },
        {
            "text": "\"The strategic investment plan sets out the ambition and actions needed for the North to become the first nature positive regional economy. "
        },
        {
            "text": "\"We have the opportunity to join up our nature recovery work across the North, and influence across sectors through tools like the Local Nature Recovery Strategies, that provide a framework for nature decision-making that can underpin spatial  planning, transport, growth priorities and resilience, and deliver significant benefits for our people and places.\""
        },
        {
            "text": "Nature is a gamechanger for the North and at Natural England we stand ready to work with partners across the region to support this growth."
        }
    ]
}