{
    "url": "https://gds.blog.gov.uk/2025/03/07/visualising-modern-digital-government/",
    "title": "Visualising modern digital government",
    "authors": [
        "Helena Trippe, Head of UCD GOV.UK One Login",
        "Tim Paul - Head of Interaction Design, Government Digital Service"
    ],
    "categories": [
        "Digital Centre",
        "Digital strategy"
    ],
    "pub_date": "2025-03-07T10:00:00+00:00",
    "content": [
        {
            "text": "The recently published blueprint for a modern digital government was the result of many weeks of researching, sketching and prototyping, by teams working as part of the Digital Centre Design team in GDS. We were keen to explore what the ideas in the blueprint might look and behave like, when they inevitably bump up against the rough edges of the real world. We spent some time thinking through not only a vision of the future, but what making that vision true would require of us, and colleagues in the public sector."
        },
        {
            "heading": 3,
            "text": "Pragmatism, not pipe dreams"
        },
        {
            "text": "We wanted to understand what a modern digital government would feel like if you were a citizen, a public servant, front line worker or a business owner. We looked at the joins between services. We came up with the idea of making them more like furrows and less like obstacles. We spent as much time thinking about trust and transparency of services, as we did about technology. "
        },
        {
            "text": "In traditional GDS fashion, this was best done by thinking and working as openly as possible, using a wall, and taking people through our thinking as much as possible. We took temporary ownership of a tiny ‘pod’ in one corner of the GDS office in Whitechapel, and began covering its walls with assumptions, principles, sketches, case studies and concepts. "
        },
        {
            "text": "The beauty of working on walls is that they instantly turn into presentations when you need them to. So when colleagues passed by, or when helpful visitors turned up, we were able to talk through our thinking, and literally point at thoughts and the connections between them. Even though we’re big supporters of remote and flexible working, it was, we have to admit, a refreshing reminder of the benefits of working together in the same space at the same time."
        },
        {
            "text": "We were lucky to have guidance from the digital centre's advisory panel, convened to support its thinking. They checked in our early thinking, helping to keep us honest, refine the messages, and join the dots. They pushed us to be ambitious and to keep people at the heart of the vision. "
        },
        {
            "heading": 3,
            "text": "Being bold"
        },
        {
            "text": "The more we showed early versions of our thinking to teams in other departments and the wider public sector, the more we found that in many cases, they were already thinking along the same lines, and even had examples of exploratory work which pointed broadly towards the same direction. That helped us feel more confident that we were going in the right direction."
        },
        {
            "text": "We began to develop what we ended up calling “the materials of digital government” - the various parts that get used to assemble a service. That’s not a new concept - GDS was thinking similar thoughts a decade ago - but we were trying to make use of everything that’s been learned in those intervening years. "
        },
        {
            "text": "We know more now than we did then. We know that the things that join the component parts together are as important as the parts themselves. (Digital credentials - ways of proving facts about things - are an essential part of this, and still very much in their infancy in UK digital government services.) We know we need a downward flow of permission, from the highest levels, to assure colleagues that the big changes necessary are changes they’re allowed to make. And we know that the scale of the task is enormous, stretching out far beyond the remit of central government - which in turn adds more complexity, and needs more courage from teams and their leaders. This is bold stuff. "
        },
        {
            "heading": 3,
            "text": "Showing things to think out loud"
        },
        {
            "text": "Throughout this process, we were showing things we’d come up with to all those advisors, helpers and colleagues. We made simple scenarios with words and pictures, which morphed over time into slides we used to help us explain our thinking to ministers and civil servants. We discussed ways that services could ‘do more’ for users, by making inferences and suggestions. What might that look like? "
        },
        {
            "text": "The plan for the future is “test and learn”, and that’s exactly the approach we used while researching and writing the blueprint. We began thinking about how some of these scenarios might play out in reality - and we built a handful of very rough digital prototypes, to just check our thinking and show it to others:"
        },
        {
            "text": "At one stage, we tried turning the materials we’d started working with into a set of models, and assembled them on a mini website to share case studies internally: "
        },
        {
            "text": "These are just a few snippets, snapshots of something much more detailed. There will no doubt be much more to share as the plans from the blueprint for a modern digital government start to take shape. We’re looking forward to many more conversations and input from colleagues in central and local government, the NHS, and other public sector institutions. "
        }
    ]
}