{
    "url": "https://ukhsa.blog.gov.uk/2025/03/07/what-are-the-symptoms-of-lassa-fever-and-how-is-it-spread/",
    "title": "What are the symptoms of Lassa fever and how is it spread?",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Health security"
    ],
    "pub_date": "2025-03-07T15:00:50+01:00",
    "content": [
        {
            "text": "You may have seen media reports about a person who travelled to the UK who was ill with Lassa fever while in the country."
        },
        {
            "text": "While Lassa fever is rare in the UK, we have previous experience with a small number of cases in the UK, most recently in 2022. We are well equipped to identify people who have Lassa fever and work to limit the spread of infection, for example, through contact tracing activities. We are now working at speed to identify people who may have had contact with the person who had Lassa fever."
        },
        {
            "text": "This blog post summarises the key points about Lassa fever and what UKHSA does when a case of an infectious disease such as Lassa fever is identified in the UK."
        },
        {
            "heading": 2,
            "text": "How Lassa fever is spread"
        },
        {
            "text": "Lassa fever, the disease caused by Lassa virus, was first described in the 1950s. The virus was identified in 1969 after 2 missionary nurses died from the disease in the Nigerian town of Lassa. Lassa fever is endemic (meaning it is regularly found) in parts of West Africa, particularly Guinea, Liberia, Nigeria and Sierra Leone. Lassa virus is carried by a particular type of rodent, the Mastomys rodent, which occurs in high numbers in these countries."
        },
        {
            "text": "The most common way for people to catch Lassa virus in these affected countries is through eating contaminated food or breathing in the virus. People can also be infected from the droppings of infected rodents, for example on floors, home surfaces, or in food or water. Some people eat Mastomys, and they may catch Lassa virus when catching and preparing these rodents for eating."
        },
        {
            "text": "Lassa virus does not spread easily between people. It can be spread from one person to another if they have contact with the body fluids of someone who has Lassa fever, such as blood, saliva, urine or semen."
        },
        {
            "heading": 2,
            "text": "Symptoms of Lassa fever"
        },
        {
            "text": "Most people who get Lassa fever have mild symptoms and make a full recovery. However, in some cases the virus can cause more severe illness and death."
        },
        {
            "text": "Mild symptoms of Lassa fever include:"
        },
        {
            "text": "More serious symptoms include:"
        },
        {
            "text": "Symptoms usually occur between 1 and 3 weeks after having contact with Lassa virus."
        },
        {
            "text": "Pregnant women are at higher risk of getting seriously ill if they catch Lassa fever, particularly in the third trimester. Catching the virus in pregnancy increases the chance of stillbirth and miscarriage, as well as serious complications and a higher chance of death for pregnant women."
        },
        {
            "heading": 2,
            "text": "Responding to Lassa fever in the UK"
        },
        {
            "text": "People who are found to have Lassa fever will receive supportive treatment, meaning that they will be provided with fluids, monitored for their symptoms, and treated with medications depending on which symptoms they have. There is not currently an effective single treatment for Lassa fever."
        },
        {
            "text": "In the UK, Lassa fever is considered a high consequence infectious disease. Such diseases are more likely to cause death than other diseases, and do not always have an effective treatment or way of preventing the illness, like a vaccine."
        },
        {
            "text": "Any cases of such diseases identified in the UK are contact traced, meaning we work quickly to identify people who have had contact with the person who has the disease. We then give these contacts public health advice on what they should do now, including steps they should take to avoid passing the infection on to other people. This helps to reduce the onward spread of disease."
        }
    ]
}