{
    "url": "https://space.blog.gov.uk/2024/12/30/nsip-funding-is-catalysing-investment-and-creating-jobs/",
    "title": "NSIP funding is catalysing investment and creating jobs ",
    "authors": [
        "UK Space Agency"
    ],
    "categories": [
        "Funding"
    ],
    "pub_date": "2024-12-30T09:55:34+00:00",
    "content": [
        {
            "text": "NSIP funding offers early-stage support for the UK space sector, accelerating the development of new space technologies, while creating jobs and driving further investment. "
        },
        {
            "heading": 2,
            "text": "Empowering early-stage space innovations "
        },
        {
            "text": "The UK Space Agency's  National Space Innovation Programme (NSIP) supports high-risk, high-reward projects designed by British organisations with the potential to accelerate the development of new space technologies, satellite applications, and services.  "
        },
        {
            "text": "The programme provides an opportunity for the UK space sector to develop novel and valuable commercial innovations with vast social and economic benefits, for example, using satellite data to help combat the challenge of climate change or developing services that make in-orbit capabilities more sustainable. "
        },
        {
            "text": "Two former NSIP recipients exemplify the potential benefits of investing in early-stage space technology.  "
        },
        {
            "heading": 2,
            "text": "SatVu - Development of Novel High Resolution Infrared Sensor Payload for Heat Detection   "
        },
        {
            "text": "SatVu is a UK SME creating an innovative satellite-based remote monitoring system using infrared cameras. This groundbreaking solution offers high-resolution thermal imaging for the commercial sector, with versatile applications across multiple industries. "
        },
        {
            "text": "The company received £5.9 million NSIP funding along with partners SSTL and KISPE, for the development of a novel high-resolution infrared constellation for heat loss detection. "
        },
        {
            "text": "Existing methods for finding energy leaks are often slow, limited, and costly. This new capability will aid the UK and others in reaching our Net Zero ambitions by 2050.   "
        },
        {
            "text": "Founded to capture the highest resolution thermal data from space for a safer and more sustainable Earth, SatVu uses infrared technology to monitor locations in near real-time to measure the impact of human activity. SatVu’s technology brings a new layer of data that augments our understanding of the planet, providing valuable insights for a range of applications: from economic monitoring and national security to climate resilience, including urban heat monitoring.  "
        },
        {
            "text": "SatVu’s first satellite, HotSat-1, launched in June 2023 and finished commissioning in Oct-2023, completing thousands of orbits and capturing hundreds of high-resolution thermal images for paying customers before an anomaly was detected in December 2023. "
        },
        {
            "text": "HotSat-2 and HotSat-3 are currently in build with HotSat-2 due to launch in 2025, and a further seven satellites planned to complete the constellation by the end of 2028, enabling 10-20 revisits per day. The first two will be in a sun-synchronous orbit, with future satellites in different orbits for better coverage. These new orbits require advanced design changes to the platform. "
        },
        {
            "text": "For every £1 received in grant funding, SatVu generated £4 in investment, totaling over £42.7million in private investment.  "
        },
        {
            "text": "The NSIP funding also enabled the company to elevate the Technology Readiness Level (TRL) of the processing pipeline from 3 to 9, the ground and operations from 1 to 9, and the satellite from 2/3 to 9. Essentially taking the technology from a proof of concept to a space proven capability ready for deployment at scale. "
        },
        {
            "text": "The funding from NSIP has seen SatVu rapidly grow from 3 to 44 people. Notably, over 20% of their technical team possesses advanced training and PhD-level qualifications, underscoring the depth of expertise within its business. SatVu’s team contains 100+ years combined experience in Earth Observation and Remote Sensing. "
        },
        {
            "heading": 2,
            "text": "Northumbria University - Laser Optical Communications for CubeSats "
        },
        {
            "text": "Researchers from Northumbria’s Solar and Space Physics research group have been leading a consortium whose goal is to develop the world’s first commercially available system that allows small satellites (CubeSats) to communicate with each other in low Earth orbit via lasers rather than radio frequencies. "
        },
        {
            "text": "Satellites currently use radio frequencies to transmit data, but this has limited capacity and is more vulnerable to disruption. Lasers, by comparison, can transmit at least 1,000 times more data per second, and can do so much more securely. "
        },
        {
            "text": "Northumbria’s laser-based device, FOCUS (Free-Space Optical Communications Unit for Satellites), could potentially become the predominant communications mechanism for mega constellations of satellites in the future.  "
        },
        {
            "text": "The UK Space Agency’s £4.98 million award through NSIP will allow the consortium to design, test and build pairs of CubeSats with laser optical communications technology, with plans to launch in late 2027.  "
        },
        {
            "text": "The NSIP funding has since generated £14.2 million in additional revenue and led to the creation of 37 jobs, directly attributable to this project. "
        },
        {
            "text": "NSIP funding played a critical role in the expansion in scale and scope of space research in the region and beyond.  "
        },
        {
            "text": "A £2 million capital funding award from the Office for Students (OfS) enabled investment into engineering facilities for research and teaching at Northumbria, including a new Satellite Engineering Laboratory equipped with advanced facilities for CubeSat testing and laser technology.  "
        },
        {
            "text": "Closely following this, Lockheed Martin UK Space invested £630,000 into collaborations with the University on a number of trailblazing projects, including working together to create machine learning algorithms to detect and record nanojets, as well as joining forces to accelerate the use of space-based solar power and sponsoring two PhDs . They also supported the advancement of the NSIP Phase 3 project and the establishment of a mission design suite on campus.  "
        },
        {
            "text": "The NSIP funding also facilitated a successful bid for the UK Space Agency’s Space Clusters Infrastructure Fund (SCIF), resulting in a £10 million allocation towards the construction costs of the North East Space Skills and Technology Centre (NESST). Described as a “game-changer” for the UK space economy, the £50 million NESST Centre, which is also supported by Lockheed Martin UK Space, will be home to world-class laboratory, testing, teaching, collaboration and office spaces, supporting the creation of over 350 jobs and injecting over £260 million into the North East economy over the next 30 years.  "
        },
        {
            "text": "Additionally, the ‘SAT-Guard' (Satellite-Aided Technologies for advancing resilience - Guarding energy services under climate hazards, risks, and disasters) project, funded by UK Research and Innovation with over £1 million (including £240,000 for Northumbria), will start in January 2025. This two-year project aims to improve disaster resilience in the UK power grid using Northumbria’s expertise in smart energy systems and satellite communications, supported by a postdoctoral research associate.  "
        },
        {
            "text": "Links: "
        },
        {
            "text": "For more information about NSIP funding, please visit: https://www.gov.uk/government/nsip "
        },
        {
            "text": "To create opportunities for you and your business to engage with new customers, collaborators and investors within the UK space industry and its supply chain attend the Ignite Space Conference: https://www.ignite-space.co.uk/"
        },
        {
            "text": "  "
        }
    ]
}