{
    "url": "https://educationhub.blog.gov.uk/2024/12/30/the-kings-new-year-honours-list-2025-honours-for-contributions-to-education-skills-and-childrens-social-care/",
    "title": "The King’s New Year Honours list 2025: honours for contributions to education, skills and children’s social care",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Honours",
        "Uncategorized"
    ],
    "pub_date": "2024-12-30T23:04:09+00:00",
    "content": [
        {
            "text": "Over 100 Brits who have made outstanding contributions to education, skills and children’s social care in the UK have been recognised by the King in his New Year Honours. "
        },
        {
            "text": "The nominees in the King’s New Year’s Honours List 2025 represent those working to improve lives through education at every stage – from early years workers to the individuals shaping higher education – as well as those striving to give more opportunities to disadvantaged families. "
        },
        {
            "heading": 2,
            "text": "Who is named in the honours list for education?"
        },
        {
            "text": "Amongst those who took top honours for services to education were Professor Julia Buckingham, vice-chancellor of Brunel University and president of Universities UK and Professor Alison Fuller from University College London. Both will be made Dames Commander of the Order of the British Empire.  "
        },
        {
            "text": "Stuart Carlton, corporate director of Children’s Services at North Yorkshire County Council, is to be knighted. "
        },
        {
            "text": "There are also dozens of unsung heroes who have been honoured with an OBE, MBE, DBE, CBE or BEM from the King for their work making a positive difference to the lives of families and people in education. We spoke to a few of them to find out what this honour means to them: "
        },
        {
            "heading": 3,
            "text": "Alastair Da Costa, CBE "
        },
        {
            "text": "Alastair, former chair of Capital City College Group, shaped further education at a national level as lead commissioner for further education and adult skills on the government's Social Mobility Commission between 2018 and 2021.   In 2014 he became the first Chief Executive of the Princes Trust International, successfully establishing the charity which focuses on addressing youth unemployment around the world, improving the lives of over 10,000 young people annually across 19 different countries.  "
        },
        {
            "text": "Alastair, said: “I was honoured to have the recognition, humbled that people had gone out of their way to make the recommendation but also really pleased further education gets this recognition too. Further education is seeing social mobility in action, it’s about providing opportunities for 16-year-olds through to adults to help them through their lives. "
        },
        {
            "text": "“If you’ve got passion and commitment you can succeed, and in further education there is a lot of passion and commitment shown by many, often unheralded, that allows the sector to succeed in providing great opportunities for learners.”"
        },
        {
            "heading": 3,
            "text": "Tracey Hemming, BEM  "
        },
        {
            "text": "Tracey is the director of Freedom Day Centre for children, young people and adults with special educational needs (SEND) in Worcestershire. When receiving her nomination letter, Tracey joked that she was so shocked she had to read it twice. "
        },
        {
            "text": "Tracey says her personal experiences caring for family with extra needs has inspired her and given her the passion to care and look after others.  "
        },
        {
            "text": "She said: “The best part of my career is being able to make a difference to not only the service users but the families and parents. Purchasing Freedom Forever home has enabled all service users to have a permanent place where they can come and be themselves with no judgement. They are surrounded by people and happiness and love.” "
        },
        {
            "text": "Remembering everyone is an individual and “acting in a person-centred way” is what Tracey says she and her team strive to do daily. Her plans for next year include setting up supported living accommodation with respite care. "
        },
        {
            "heading": 3,
            "text": "Florence Kroll, CBE  "
        },
        {
            "text": "Florence is the director of Children Services, Royal Borough of Greenwich London. She is the adolescent safeguarding lead for London Directors of Children’s Services and chairs the London Adolescent Safeguarding Overview Board. She leads and champions Greenwich Council’s equality, diversity and inclusion work. "
        },
        {
            "text": "Florence said: “I was absolutely delighted when I found out about my nomination for services to education. I am proud to accept this reward on behalf of all those colleagues I have worked with in the past and present. None of what we do is possible without the hard work of others. I have loved working with amazing, talented and dedicated people who strive for excellence with unwavering determination. "
        },
        {
            "text": "\"Having the opportunity to repair difficult and traumatic children's experiences and doing all that we can to have make positive lasting memories for children is one of the greatest gifts and privileges. Whenever I have felt frustrated by something at work, a visit to a school or children's home lifts my spirits.  "
        },
        {
            "text": "“I am proud of the progress that has been made in Greenwich and being relentlessly interested in people, being curious about them, listening to their stories, making sense of their life experiences, the adversity they face and always putting children’s experiences and their developments first is at the heart of it all”. "
        },
        {
            "heading": 3,
            "text": "Purnima Tanuku CBE "
        },
        {
            "text": "Purnima is an advocate for early education and childcare and has been instrumental at Kirklees Council in the development of its National Early Years Enterprise Centre which enables early years practitioners to meet and share best practice.  "
        },
        {
            "text": "She said: “When I first found out I was going to be receiving the CBE it was quite a shock. I really wasn’t expecting anything like this, and I went through several emotions, and it still hasn’t sunk in yet. In the early years sector, people work so hard education very young children, and their childhood experiences really shape their lives for the future. "
        },
        {
            "text": "“I’m always in awe of the wonderful work that they do, and the passion and commitment they demonstrate day-in-day-out in caring for young children – and that’s really what drives me. I feel very proud and honoured to be representing such a wonderful sector.”  "
        },
        {
            "heading": 3,
            "text": "Susan Dawson, OBE "
        },
        {
            "text": "Susan works as a schools commercial and operations director for the Department for Education. She has contributed to and overseen work to support schools make billions of pounds in savings. "
        },
        {
            "text": "She said: “I was surprised, thrilled and extremely proud to receive the news that I had been awarded the Order of the British Empire in the New Years Honours list.  "
        },
        {
            "text": "\"I would never have imaged when I joined the civil service as an admin assistant exactly 35 years ago today that I would be given this recognition. This means more than words can express, but I could not have achieved this without the support of my colleagues, family, and friends throughout my career. I am incredibly proud of the work we do in the civil service and in particular the positive impact we make in Department for Education and across the Government Commercial Function.  "
        },
        {
            "text": "“As a proud Yorkshire woman, I have been privileged to progress my career in the region, and I hope that this recognition inspires others to believe they can do the same.” "
        },
        {
            "heading": 3,
            "text": "Timothy ‘Beech’ Williamson, BEM"
        },
        {
            "text": "The Department for Education pays special tribute to Beech Williamson, who tragically died shortly after finding out about his honours nomination."
        },
        {
            "text": "Beech, an architect in the department’s Design, Operations and Infrastructure group, was known to those in the wider education building world for his forensic knowledge and early adoption of technology in design. He joined the department in 1986 as an architectural assistant and was instrumental in cross-government work around standardisation, modern methods of construction, and net zero carbon. More recently, Beech worked to get better outdoor spaces on school sites and improve the standard of building provision to benefit children with special educational needs (SEND)."
        },
        {
            "text": "A devoted father and husband, Beech died over the festive period after a period of illness, surrounded by his family."
        },
        {
            "heading": 2,
            "text": "Who else is on the honours list?"
        },
        {
            "text": "The importance of literature and reading was celebrated with this year’s highest honours including a Companion of Honour to author Sir Kazuo Ishiguro and a Dame Grand Cross of the Order of the British Empire for author Dame Jacqueline Wilson.  "
        },
        {
            "text": "The Companion of Honour has only 65 members at any one time and is reserved for those who have made a major contribution to their field over a long period.  "
        },
        {
            "text": "The Knight or Dame Grand Cross is rarely awarded and is the highest rank in the Order of the British Empire and is usually awarded to those who were previously knighted or made a Dame at a lower level. "
        },
        {
            "text": "You can read more about Education Secretary Bridget Phillipson’s mission to get more children reading for pleasure here. "
        }
    ]
}