{
    "url": "https://digitaltrade.blog.gov.uk/2023/05/11/celebrating-success-at-ddat-fest/",
    "title": "Celebrating success at DDaT Fest",
    "authors": [
        "Matt Jukes, Head of Product",
        "Sian Thomas, Chief Data Officer",
        "Hannah Horn, Senior Engagement and Strategic Adoption Manager"
    ],
    "categories": [
        "People"
    ],
    "pub_date": "2023-05-11T10:35:22+01:00",
    "content": [
        {
            "heading": 2,
            "text": "What is DDaT Fest?"
        },
        {
            "text": "DDaT Fest was the Digital, Data and Technology (DDaT) directorate’s first all-team in-person away day. We had 3 ambitious objectives in mind that we wanted to achieve in DDaT Fest. "
        },
        {
            "text": "These were: "
        },
        {
            "text": "This presented several hurdles to overcome. How could we design an exciting and engaging calendar of events for an away day that didn’t feel too ‘corporate’? How could we encourage all DDaT staff, dispersed around the department’s many UK offices, to travel to London for an away day, and how could we fit them all in one space? Despite the many challenges we faced (including a rail strike 3 weeks before the original planned event date!), DDaT Fest was a huge success. Here’s how we made it an away day worth attending. "
        },
        {
            "heading": 3,
            "text": "An events calendar to suit everyone "
        },
        {
            "text": "A large part of the success of the day came down to the willingness of different teams to lead on events. DDaT’s Engagement and Strategic Adoption team worked with teams across the directorate to build a calendar of events where staff could pick which they attended based on their interests. "
        },
        {
            "text": "The itinerary was a mix of 12 different workshops, with staff encouraged to choose 4 to attend based on their own interests. From ‘Storytelling and how to celebrate success’ to ‘Data visualisation’ and ‘Working in the open with blogging’, the mix of events suited a range of interests and working styles. "
        },
        {
            "heading": 3,
            "text": "Matt Jukes led the ‘Working in the open with blogging’ workshop:  "
        },
        {
            "text": "My session was the latest instalment of a decade-long campaign to encourage public servants to embrace working in the open more through the medium of blogging. I focused very much on the ‘why’ and the ‘how’ while acknowledging some of the common fears and concerns (real and imagined) that prevent people operating in the open more. This was all from the perspective of sharing an individual experience rather than that of a team or an organisation – through the lens of my own blogging over the years.  The power of writing I rather than we. "
        },
        {
            "text": "I’m not sure what people expected coming into the talk, but it was an engaged audience who participated throughout with thoughtful questions and comments. The challenge has been maintaining momentum beyond DDaT Fest. Even the most enthusiastic attendees on the day would have needed ongoing support to encourage them to get over the fear of that first blog post. If I had my time again, I would have had a better long-term plan.  However, there is still time and I am never short of ideas on this topic! "
        },
        {
            "heading": 3,
            "text": "Sian Thomas ran wellbeing sessions in the afternoon along with other members of the Senior Management Team (SMT)"
        },
        {
            "text": "I was keen to make sure that we took the opportunity of being together to design some sessions to help people feel supported. I also wanted to ensure that the importance of wellbeing was highlighted. As a high performing team individuals often push themselves to deliver, even when the department is not pushing so much. I was fortunate enough to have a wellbeing team to rely on to help me scope appropriate sessions. "
        },
        {
            "text": "In the end we ran group online Management sessions, one on resilience and one on burnout. People voted with their feet and the mix across sessions was not what I expected. Feedback was mostly positive and included specific examples of how people being supported in decisions improved their personal wellbeing. Miranda, Anais and I led the sessions. For the burnout one I was pleased to have significant input from Don (in Cyber with first-hand experience) and Michal (our Lead Data Architect who does lots of volunteering in the health space). "
        },
        {
            "text": "At the next DDaT fest, I would like to include another wellbeing session. Maybe next time, we will take a different approach and be a bit more participant led. "
        },
        {
            "heading": 3,
            "text": "Celebrating success "
        },
        {
            "text": "Many attendees commented on the ‘electric’ atmosphere on the day.  This was in part due to such a large number of people all in one place at one time, many meeting for the first time. The event also allowed us to celebrate our successes together in a way that we never have before."
        },
        {
            "text": " One of the final parts of the day was an awards ceremony for staff to be recognised for all that they had achieved, individually and as teams over the past year. Whether this was for launching a product under pressure that ultimately contributed to UK prosperity, or for being recognised just for being a great person to work with, all winners received a medal and a huge round of applause and cheers from over 200 people.  "
        },
        {
            "heading": 2,
            "text": "Looking ahead to DDaT Fest 2.0"
        },
        {
            "text": "There are a few areas that will be changed when we run the next DDaT Fest in a year’s time. We will allow more time in between workshops for breaks and more protected time for networking and getting to know colleagues and an even bigger venue. But overall, the event was a resounding success.  "
        },
        {
            "text": "‘One word to sum up the day MAGIC. The culture in this team is amazing and something I had never experienced in a previous role. A huge thank you to [SMT] for the Resilience session - they created such a safe environment for everyone to be open and honest and share experiences which was helpful to be able to take away and reflect on. I enjoyed the breakout sessions to understand the different roles in DDaT a lot more - the only downside is not being able to attend all of them! Thank you to everyone who made this happen, DDaT is such a special team!’ – Quote from attendee "
        },
        {
            "text": "It gave DDaT the opportunity to bring all staff together for the first time from every corner of the UK to take part in an innovative experience with lots of chances to learn something new. It gave us lots of new things to work on and areas to improve, as well as the chance to build new connections and create more familiar faces in the office. "
        },
        {
            "text": "We are proud of what we achieved but in typical DDaT agile fashion, we are already looking forward to what we will do differently for the next one!  "
        },
        {
            "text": " "
        }
    ]
}