{
    "url": "https://aphascience.blog.gov.uk/2023/05/11/climate-change-plants-and-plant-pests/",
    "title": "Climate change, plants and plant pests",
    "authors": [
        "Dominic Eyre"
    ],
    "categories": [
        "Plant health"
    ],
    "pub_date": "2023-05-11T08:59:31+01:00",
    "content": [
        {
            "text": "Learn more about how climate change is responsible for changes in nature’s calendar, the rise of plant pathogens and pests and what APHA are doing to protect the UK border, from one of Defra’s Plant Health Scientists, Dominic Eyre."
        },
        {
            "text": "The dramatic impacts of extreme weather conditions and the international negotiations on how to reduce emissions of greenhouse gases keep climate change at the forefront of the news. There seems to have been a shift in the way we discuss climate change, from talking about it as something that will happen a long way in the future to something that has happened already and is happening now. "
        },
        {
            "text": "The latest report from the International Panel on Climate Change states that based on the 2010s, global temperature has already increased by 1.1°C since the pre-industrial period. We are, therefore, already most of the way to reaching the global warming limit of 1.5°C, a level that many scientists consider a dangerous climate threshold. "
        },
        {
            "heading": 3,
            "text": "Could soya be grown in Scotland?"
        },
        {
            "text": "Changes in temperature and other climatic factors have a direct influence on all types of plants in managed and unmanaged environments. One well known example of changes in crop distribution linked to climate change is the increasing area of grapevines in the UK, which doubled between 2014-2022. "
        },
        {
            "text": "Most of the soya eaten by people and livestock in the United Kingdom (UK) is grown in South America, but over recent years it has started to be grown by farmers in southern England, which is linked to a warming climate and the use of cold tolerant varieties. With further climate change, it has been predicted that there will be potential to grow soya in southern Scotland in the next 60 to 80 years."
        },
        {
            "heading": 3,
            "text": "The impact of climate change on the plant life cycle"
        },
        {
            "text": "As well as influencing where plants survive, climate change affects the phenology of plants, that is, the time of year at which different life stages occur such as the first leaves opening or flowering. "
        },
        {
            "text": "The Woodland Trust manages a database of phenological observations taken by volunteer recorders across the UK called Nature’s Calendar. An analysis of these records has shown that the date of flowering of plants in the UK advanced by almost a month between the pre-1986 records (going back to 1753) and the post-1986 records."
        },
        {
            "heading": 3,
            "text": "The rise of plant pathogens and invertebrate pests"
        },
        {
            "text": "Weather and climate also affect the health of plants by influencing plant pathogens and invertebrate pests."
        },
        {
            "text": "One strain of the bacterial plant pathogen, Xylella fastidiosa, is responsible for the devasting disease called Olive Quick Decline Syndrome which has damaged tens of thousands of hectares of olive groves in the south of Italy. Some strains of Xylella are known to be vulnerable to cold conditions in winter via a process called ‘winter curing’ and this can restrict their distribution. However, increasingly mild winters are shifting the area where winter curing is effective further north. "
        },
        {
            "text": "With a few exceptions, insects are nearly all ectothermic. This means they are reliant on external environmental factors, especially temperature, in order to regulate their internal temperature. Their internal temperature has a direct link with their rate of development, reproduction and activity. The climate warming that has happened already has aided the establishment or re-establishment of some insect species in the UK. "
        },
        {
            "text": "As a group, dragonflies and damselflies have become more widespread in the UK and Ireland as a result of climate change, although some species associated with upland habitats, small bodies of water, or those restricted to northern areas have declined."
        },
        {
            "text": "Increasing populations of some other insects are less welcome. Diamondback moths are pests of brassica crops. They arrive in the UK as migrants during warmer months and subsequent generations can cause widespread damage to crops. There is evidence that this moth has overwintered in the UK and with increasingly milder winters there is potential for greater populations and damage in the future."
        },
        {
            "heading": 3,
            "text": "Horizon scanning"
        },
        {
            "text": "My team provides technical advice on plant pests and pathogens to colleagues responsible for policy and surveillance so that measures can be put in place to prevent the introduction and establishment of new pests in the UK. To do this, we need to identify the pest species and the plants or plant products that present the greatest risk. Restricting the movement of all plants and plant products could not be justified from a technical perspective and it would be a barrier to trade."
        },
        {
            "text": "Understanding the relationship between climate and pest threat is a key element of determining which pests pose the greatest risk now and in the future. For some pests it is very simple to make this judgement. For example, if a pest is only known to attack bananas, it is very unlikely to be a threat to the UK because bananas are not grown commercially in the UK. However, the situation is often not so clear cut which is especially the case when the distribution or biology of the pest under assessment has not been researched in any depth."
        },
        {
            "text": "One of the most important factors that limits the potential of non-native invertebrates to establish in the UK is our maritime climate. We have relatively cool summers and mild winters in comparison to more continental climates, such as large areas of North America, central Europe and Asia."
        },
        {
            "text": "Scientists at the Met Office, working with the University of Exeter, Warwick University and our team in Defra, have developed an interactive web tool that allows us to make rapid assessments of the potential life cycle of pests. This is information is valuable for evaluating the risk posed by non-native pests and for tackling invasive populations. This tool is open access and available at this website."
        },
        {
            "text": "The Met Office have plans to develop this tool by including the facility to assess the establishment potential for pests and pathogens under future climate change.  This facility will help our team assess future plant pest and pathogen risks."
        },
        {
            "text": "The impact of one element of climate change, the increase in CO2 levels, is being examined at an ecosystem level in a long-term study in Staffordshire run by Birmingham University. In this study, CO2 is being pumped into an area of mature broadleaved woodland to replicate the levels of gas predicted for the 2050s. The potential impact of CO2 levels on plants and the invertebrates that feed on them, illustrates the complexity and great uncertainties inherent in making predictions of future pest threats."
        },
        {
            "heading": 3,
            "text": "National Adaptation Plans for climate change"
        },
        {
            "text": "Countries around the world, including the UK, are developing, or refreshing their National Adaptation Plans for climate change. These plans aim to initiate actions that will reduce the impact of climate change on people and the environment. The consideration of plants and plant health, including impacts on trees and forests are an integral part of this process and part of the plans is to provide advice to the public and industry."
        },
        {
            "text": "Forest Research have created the Climate Change Hub to advise on how to plant and manage trees and forests to increase their resilience to a changing climate and the associated threats such as pests and diseases."
        },
        {
            "text": "Plant health and invasive species are an inherently international rather than national issue as plant pests do not respect international boundaries. The International Plant Protection Convention and the body that supports it were created to address these challenges. It has listed the assessment and management of the risks of climate change as one of the 10 elements of its 2020 to 2030 development agenda."
        },
        {
            "text": "By contributing to this activity, we are able to reduce the risks to plant health in the UK and other countries around the world at a time when plant health is crucial for food security, environmental sustainability and for mitigating greenhouse gas emissions."
        }
    ]
}