{
    "url": "https://beisdigital.blog.gov.uk/2023/05/11/digital-assurance-making-digital-services-better/",
    "title": "Digital Assurance – making digital services better ",
    "authors": [
        "Mark Merifield",
        "Paul Howlett"
    ],
    "categories": [
        "Business analysis",
        "Service design"
    ],
    "pub_date": "2023-05-11T15:44:24+00:00",
    "content": [
        {
            "heading": 2,
            "text": "\"I am a servant of the Service Manual, wielder of the flame of the Technology Code of Practice. You cannot pass…\""
        },
        {
            "text": "To be honest, I’ve never seen our team go full Gandalf on a Product Owner. But if you want to be a gatekeeper to quality, if you really want to improve government digital services, there’s no better place to be than in Digital’s Assurance team."
        },
        {
            "heading": 2,
            "text": "What is digital assurance?"
        },
        {
            "text": "Being an Assurance Manager means being at the heart of every digital activity in the department, every bit of money spent on technology."
        },
        {
            "text": "Our role is to help the department deliver better digital services and improve the way we use technology internally. We do this by assessing projects or purchases under the Cabinet Office digital and technology spend controls. And if you don’t get the approvals, you can’t go ahead."
        },
        {
            "text": "Spend controls are one of the ways the government ensures value for money and improves the quality of what it delivers - both for civil servants, and for all citizens."
        },
        {
            "text": "The Service Manual sets out how digital services are expected to be delivered and the Service Standard and Technology Code of Practice are the standards against which we measure success."
        },
        {
            "heading": 2,
            "text": "What makes a successful service?"
        },
        {
            "text": "At the core of everything we do in Digital is taking a user-centred approach or putting user needs first. You’ll see this in almost every government digital blog or story."
        },
        {
            "text": "And rightly so. A successful service is one that solves a problem: it does what we need it to quickly and easily."
        },
        {
            "text": "We make sure that when a policy team sets off on their digital journey, clutching a batch of great ideas, they are set up to succeed. We ensure their approach is sensible, proportionate, realistic and meets their user’s needs."
        },
        {
            "text": "And yes, sometimes that means having to tell a team to stop, to rethink, to replan, to not let them proceed to the next step."
        },
        {
            "heading": 2,
            "text": "What does a day look like in digital assurance?"
        },
        {
            "text": "A typical day might start by looking at tool a used by our own teams, making sure it has the right security features and is accessible to all staff."
        },
        {
            "text": "This could be followed by sitting on an approvals board for one of our partner organisations, approving spend for computing contracts with colleagues from Cabinet Office’s Central Digital and Data Office (CDDO)."
        },
        {
            "text": "In the afternoon you’ll be reviewing the delivery plans for a high-profile energy security service."
        },
        {
            "text": "Then tomorrow you’re on an evaluation panel for a discovery team looking at a new Net Zero initiative and helping a team plan for their beta service assessment."
        },
        {
            "heading": 2,
            "text": "Sounds good! What makes a great Assurance Manager?"
        },
        {
            "text": "You don’t need a set of complicated qualifications to be an assurance manager, we all come from very different backgrounds and professions. A good understanding of government digital helps, as does an unshakeable belief in wanting to make things better. So, if you like:"
        },
        {
            "text": "...then you could be a great Assurance Manager and get out there and help make a difference. Although you do need to bring your own pointy hat and staff."
        }
    ]
}