{
    "url": "https://educationhub.blog.gov.uk/2023/05/11/fines-for-parents-for-taking-children-out-of-school-what-you-need-to-know/",
    "title": "Fines for parents for taking children out of school: What you need to know",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Attendance",
        "Schools"
    ],
    "pub_date": "2023-05-11T17:13:45+01:00",
    "content": [
        {
            "text": "Every moment in school counts and days missed add up quickly. Evidence shows that pupils who have good attendance at school perform better than those who don’t.  "
        },
        {
            "text": "There are only a few circumstances where a child is allowed to miss school, such as illness or where the school has given permission because of an exceptional circumstance. "
        },
        {
            "text": "However, if your child misses school without a good reason, local councils and schools can intervene. In some cases, this might mean that parents receive a fine.  "
        },
        {
            "heading": 3,
            "text": "How much could I be fined if my child misses school?  "
        },
        {
            "text": "Parents who take their child out of school without permission may face paying a fine.  "
        },
        {
            "text": "It is the responsibility of the local authority to issue fines to parents and the process can vary from council to council.  "
        },
        {
            "text": "Fines for school absences start at £60, rising to £120 if you fail to pay within 21 days. Some councils charge this fine per child, while others fine each parent for each child.   "
        },
        {
            "text": "If you’re prosecuted and attend court because your child hasn’t been attending school, you could get a fine of up to £2,500. "
        },
        {
            "text": "Councils must draw up a Code of Conduct and are expected to publish it on their website to explain their process for issuing fines. Check your local rules here. "
        },
        {
            "text": "Money raised via fines is only used by the local authority to cover the costs of administering the system. Any extra money is returned to the government. "
        },
        {
            "heading": 3,
            "text": "What if my child needs to miss school? "
        },
        {
            "text": "Your child must attend every day that the school is open, unless:  "
        },
        {
            "heading": 3,
            "text": "What happens if my child misses school without a good reason? "
        },
        {
            "text": "If your child is absent and you haven’t received advance permission from the headteacher to take your child out of school, the school and local council may take action. "
        },
        {
            "text": "Before that, your child’s school and your local council are expected to support you to improve their child’s attendance before any measures are put in place. "
        },
        {
            "text": "These measures can include: "
        },
        {
            "heading": 3,
            "text": "Why is attendance important? "
        },
        {
            "text": "Our research shows that pupils who perform better at the end of both primary and  secondary school missed fewer days than those who didn’t perform as well.  "
        },
        {
            "text": "Evidence  also shows that students with the highest attendance throughout their time in school gain the best GCSE and A level results. This is why parents have a legal duty to make sure their child is in school, unless they are absent with permission from the school or receiving a suitable home education. "
        },
        {
            "text": "We’re working with schools and local councils to improve attendance, including by introducing a new data visualisation tool to make it easier to analyse attendance, spot issues and intervene more quickly. Read more about what we’re doing to help schools improve attendance here. "
        }
    ]
}