{
    "url": "https://food.blog.gov.uk/2023/05/11/fsa-update-to-stakeholders-on-imports/",
    "title": "FSA update to stakeholders on imports",
    "authors": [
        "Professor Susan Jebb, FSA Chair"
    ],
    "categories": [
        "Our mission"
    ],
    "pub_date": "2023-05-11T13:19:30+01:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "We were pleased to see the government’s recent publication of the draft Border Target Operating Model (BTOM), which sets out proposals for a new regime for imported food and feed products entering Great Britain."
        },
        {
            "text": "The proposals address a gap in consumer protection which the FSA highlighted last year in our annual report on food standards. We warned that the delay in establishing full UK imports controls for higher risk EU imported food meant we were less confident we could rapidly respond to food safety incidents. The EU remains the UK’s largest supplier of imported food, supplying more than 90% of all beef, dairy, eggs and pork products imported into the UK and 65% of all food and feed not of animal origin*."
        },
        {
            "text": "The Government’s proposals will help the FSA in its work to respond to food incidents both nationally and globally. The broad principle is to take a data and intelligence led approach that targets the risks posed by imported food and feed in a more proportionate way. These checks will apply to whole world, not just EU, and will help to ensure that the requirements on business are necessary and reflect the risks to food safety. We are proud to have played our part in developing a more proportionate intelligence led system."
        },
        {
            "text": "The GB model health certificates have also been streamlined to make them more straightforward to complete, while maintaining all of the existing food safety standards. The EU and European Free Trade Association (EFTA) BTOM risk categorisations and streamlined certificates have now been published on the Defra website."
        },
        {
            "text": "If you have any thoughts on the government’s proposals on imports, you still have a week to share feedback via GOV.UK."
        },
        {
            "text": "*Our Food 2021: An annual review of food standards across the UK"
        },
        {
            "heading": 1,
            "text": "Diweddariad gan yr Asiantaeth Safonau Bwyd i randdeiliaid ar fewnforion"
        },
        {
            "text": "Yr Athro Susan Jebb, Cadeirydd yr Asiantaeth Safonau Bwyd"
        },
        {
            "text": "Roeddem yn falch o weld drafft o’r Model Gweithredu Targed ar gyfer Ffiniau (BTOM) a gyhoeddwyd yn ddiweddar gan y llywodraeth. Mae’n nodi cynigion ar gyfer trefn newydd ar gyfer cynhyrchion bwyd a bwyd anifeiliaid wedi’u mewnforio sy’n dod i mewn i Brydain Fawr."
        },
        {
            "text": "Mae’r cynigion yn mynd i’r afael â bwlch o ran diogelu defnyddwyr a amlygwyd gan yr Asiantaeth Safonau Bwyd (ASB) y llynedd yn ein hadroddiad blynyddol ar safonau bwyd. Gwnaethom rybuddio bod yr oedi wrth sefydlu rheolaethau mewnforio llawn i’r DU ar gyfer bwyd risg uwch a fewnforir o’r UE yn golygu ein bod yn llai hyderus y gallem ymateb yn gyflym i ddigwyddiadau diogelwch bwyd. Yr UE yw cyflenwr mwyaf y DU o fwyd wedi’i fewnforio o hyd, gan gyflenwi mwy na 90% o’r holl gynhyrchion cig eidion, llaeth, wyau a phorc a fewnforir i’r DU a 65% o’r holl fwyd a bwyd anifeiliaid nad ydynt yn dod o anifeiliaid*."
        },
        {
            "text": "Bydd cynigion y llywodraeth yn helpu’r ASB wrth iddi ymateb i ddigwyddiadau bwyd ar lefel genedlaethol a byd-eang. Yr egwyddor gyffredinol yw mabwysiadu dull a arweinir gan ddata a gwybodaeth sy’n targedu’r risgiau a berir gan fwyd a bwyd anifeiliaid wedi’u mewnforio mewn modd mwy cymesur. Bydd y gwiriadau hyn yn berthnasol i’r byd i gyd, nid yr UE yn unig, a byddant yn helpu i sicrhau bod y gofynion ar fusnesau yn angenrheidiol ac yn adlewyrchu’r risgiau i ddiogelwch bwyd. Rydym yn falch o fod wedi chwarae rhan wrth ddatblygu system fwy cymesur a arweinir gan wybodaeth."
        },
        {
            "text": "Mae tystysgrifau iechyd model Prydain Fawr hefyd wedi’u symleiddio i’w gwneud yn haws i’w cwblhau, gan barhau i gynnal yr holl safonau diogelwch bwyd presennol. Mae categorïau risg yr UE a’r Gymdeithas Fasnach Rydd Ewropeaidd (EFTA) ar gyfer BTOM a’r tystysgrifau symlach bellach wedi’u cyhoeddi ar wefan Defra."
        },
        {
            "text": "Os oes gennych unrhyw sylwadau am gynigion y llywodraeth ar fewnforion, mae gennych wythnos o hyd i rannu eich adborth trwy GOV.UK."
        },
        {
            "text": "* Ein Bwyd 2021: Adolygiad blynyddol o safonau bwyd ledled y DU"
        }
    ]
}