{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2023/05/11/learn-new-skills-by-signing-up-to-gse-science-and-engineering-courses/",
    "title": "Learn new skills by signing up to GSE Science and Engineering courses",
    "authors": [
        "gseprofession"
    ],
    "categories": [
        "Blog Series",
        "GSE Opportunities",
        "GSE Profession Updates"
    ],
    "pub_date": "2023-05-11T16:36:02+01:00",
    "content": [
        {
            "text": "Launching Spring/Summer 2023 Registration for our new introductory science and engineering courses is now open. By registering early, you can be the first to know when the courses have launched, gain access to special teach-in sessions and sneak peaks at content from Senior Civil Servants."
        },
        {
            "text": "Use the GSE Courses Registration form today."
        },
        {
            "text": "About the courses"
        },
        {
            "text": "GSE supports the wider government ambition to increase scientific literacy across government. These two courses will be available in Summer 2023 and will be delivered in an interactive, online format."
        },
        {
            "text": "The two courses are:"
        },
        {
            "text": "Both courses use a variety of learning techniques and present activities in the form of:"
        },
        {
            "text": "The courses will be open to all civil, public and crown servants. If you are not yet a GSE profession member you can use the GSE Sign Up form to become a member and find out more about the range of support that we offer."
        },
        {
            "text": "How you can help"
        },
        {
            "text": "Get in touch with us through gse@go-science.gov.uk with details of your organisation or network if you would like:"
        },
        {
            "text": "To champion GSE learning and development more broadly, why not think about becoming a GSE L&D Champion? We’d love to hear from you and you can contact us through gse@go-science.gov.uk."
        },
        {
            "text": "What do people think so far?"
        },
        {
            "text": "\"A fantastic suite of tools that will really help further bring together scientists from across Government. \" - UKHSA"
        },
        {
            "text": "\"The course is really helpful in highlighting the key points for consideration. As a scientist who writes reports for non-technical audiences on a regular basis, I am going to recommend this to my whole team. The references are also helpful if further detail is required!\" - MOD"
        },
        {
            "text": "\"Great tool for non-GSE members/new starters to get a better understanding of processes in Government.\" - DEFRA"
        },
        {
            "text": "The courses in detail"
        },
        {
            "text": "Understanding and Accessing Science and Engineering Advice "
        },
        {
            "text": "Science and engineering can be found in almost every area of policy. The course is for civil, crown and public servants working in non-technical roles such as policy and decision making. No prior science and engineering knowledge is required. The course will empower you to use and access science and engineering advice in your work."
        },
        {
            "text": "The course covers:"
        },
        {
            "text": "Communicating Science and Engineering Advice"
        },
        {
            "text": "This course is for civil, public and crown servants who communicate science and engineering advice to non-technical audiences. It provides you with the confidence to effectively communicate science and engineering advice to a range of audiences."
        },
        {
            "text": "The course covers:"
        },
        {
            "text": "Ready to learn more?"
        },
        {
            "text": "Don’t miss your chance to maximise the way you use or communicate science and engineering advice in your work."
        },
        {
            "text": "Use the GSE Course Registration form to register interest in the courses as your next learning and development opportunity."
        },
        {
            "text": "Not already part of Government Science and Engineering (GSE) Profession? Use the GSE Sign Up form to learn more!"
        }
    ]
}