{
    "url": "https://lifeathmrc.blog.gov.uk/2023/05/11/shared-parental-leave-at-hmrc-sams-story/",
    "title": "Shared parental leave at HMRC: Sam's story",
    "authors": [
        "Sam"
    ],
    "categories": [
        "Culture & Values",
        "General",
        "Guest blog"
    ],
    "pub_date": "2023-05-11T12:04:32+00:00",
    "content": [
        {
            "heading": 2,
            "text": "About me "
        },
        {
            "text": "I’m Sam and I work in HR at HMRC. My role is in our employment policy team working with a fantastic set of colleagues to ensure our employment framework is up to date so the department can do its vital work in administering tax, customs and financial support for the UK through our 66,000-strong workforce. I’ve been doing this job since March having joined the team following a period of shared parental leave (SPL). "
        },
        {
            "heading": 2,
            "text": "Preparing for shared parental leave "
        },
        {
            "text": "I have long been interested in doing SPL as my wife and I are both passionate about our careers and both want to be active parents. When our first child, a little boy called William, arrived last March, we were very excited to explore how SPL could work for us. We agreed a pattern between us and with our employers: 6 months parental leave each, with my wife taking the first 6 and me the latter.  "
        },
        {
            "text": "In preparing to make the request, I was inspired by several leaders I’d worked with in my Civil Service career who had taken the same step. I’ll always remember a Deputy Director in the Home Office taking SPL as particularly inspiring to me, as he did it at a time when it wasn’t as common, and role modelled building a career whilst spending time with his young family  "
        },
        {
            "text": "I was a little nervous making the initial request, but my manager was hugely supportive. When sharing my news with colleagues in the department, I received two main responses. Firstly, colleagues were hugely excited to hear I was doing this and very positive about the experience I’d have. Secondly, it was pleasantly surprising that for many colleagues this was a fairly normal occurrence and not something out of the ordinary or novel anymore. It sounds odd, but that really comforted me as it showed how much progress this policy has made since 2015.  "
        },
        {
            "heading": 2,
            "text": "Time off with William "
        },
        {
            "text": "As I prepared for my SPL, I went through the challenges I am sure a lot of new parents do – the worry about becoming the principal carer for a little human, fear of being forgotten in the workplace and concerned about my skills eroding whilst I was away.   "
        },
        {
            "text": "To be perfectly honest, it was tricky at first as moving from working in a busy job into full-time childcare is a huge change – and not one I had fully appreciated. It was also difficult for William seeing less of his mother and having to deal with me!   "
        },
        {
            "text": "We soon got into a good rhythm and the change he underwent in those 6 months was magical to see. I am truly grateful to have spent that time with him developing our bond. On the work front, my manager did a great job keeping me in the loop via a series of “keep in touch” meetings. It also meant a lot to me how much of an interest he took in my parental leave and how I was finding it.   "
        },
        {
            "heading": 2,
            "text": "Returning to work "
        },
        {
            "text": "As the time came to start to think about my return to work, I realised that it was probably time for a new challenge and role for me. After some discussions, I was thrilled to join the employment policy team (not least as the team is responsible for SPL in HMRC).   "
        },
        {
            "text": "In joining the new team, I received a really warm welcome. My new manager has been equally supportive helping me both adjust back to work and adjust to working as a parent managing nursery and childcare. For example, I can work flexibly to do the nursery run 2 days a week.  "
        },
        {
            "text": "Part of that has been allowing me the time and space to get back up to speed, with several colleagues taking the time to update and upskill me on the key changes that had happened while I had been away.   "
        },
        {
            "text": "I feel really lucky to have been incredibly well supported through my first year as a parent and encouraged to explore the options and flexibility available to me. It’s one of the best things about working for HMRC and the Civil Service and has allowed me and my wife to continue to advance our careers as working parents. I would wholeheartedly recommend it to prospective parents.   "
        },
        {
            "heading": 2,
            "text": "Discover more about Life at HMRC"
        },
        {
            "text": "For more information about what it’s like to work at HMRC, visit our pages on the Civil Service Careers website."
        },
        {
            "text": "To discover our latest job vacancies, search ‘HMRC’ on Civil Service Jobs."
        }
    ]
}