{
    "url": "https://defrafarming.blog.gov.uk/2023/05/11/tree-health-pilot-improvements-and-progress-on-the-ash-dieback-offer/",
    "title": "Tree Health Pilot: improvements and progress on the ash dieback offer",
    "authors": [
        "Joe Harrison"
    ],
    "categories": [
        "Payments to improve tree health"
    ],
    "pub_date": "2023-05-11T10:07:05+01:00",
    "content": [
        {
            "text": "The Tree Health Pilot tests different ways of slowing the spread of tree pests and diseases as well as building the resilience of trees across England. "
        },
        {
            "text": "One of these diseases is ash dieback (Hymenoscyphus fraxineus). Caused by a fungus, it is highly destructive. It affects woodland biodiversity and ecology, and has implications for the hardwood industries."
        },
        {
            "text": "In this post, I’ll update you on the work to improve the Pilot’s ash dieback grant offer. Changes have been made to eligibility, guidance and the application process. "
        },
        {
            "text": "These changes were informed by feedback gained through a series of workshops run with local authorities, as part of a research partnership with The Tree Council and Forest Research. "
        },
        {
            "heading": 2,
            "text": "Ash dieback grant "
        },
        {
            "text": "This grant pays for actions related to ash trees with ash dieback that are growing: "
        },
        {
            "text": "You can only apply as part of a group application. The groups can be led by a facilitator. They could be from a local authority, environmental or charitable organisation, or local landowner. "
        },
        {
            "text": "The table below shows the different grant options available within the ash offer. You can use this to work out which ones you want to apply for."
        },
        {
            "heading": 2,
            "text": "Changes to eligibility"
        },
        {
            "text": "There has been a change to eligibility. Lower tier local authorities, such as parish councils, are now considered eligible group member. This means that a group can be formed with a minimum of two individuals that can be a mix of private landowners and lower tier local authorities, while higher tier authorities can apply to facilitate these groups.  "
        },
        {
            "text": "If trees are removed, we want to ensure restocking happens in as many places as possible. The eligibility for restocking has been widened to allow local authorities acting as a facilitator of a group to also apply for restocking funding, where they have removed ash trees adjacent to those in the group.  "
        },
        {
            "heading": 2,
            "text": "Improvements to the application form "
        },
        {
            "text": "The application process has been simplified for the ash dieback offer. It's now faster to apply meaning that agreements can be issued more quickly."
        },
        {
            "text": "New guidance is available for lead facilitators and local authorities to help them understand how to apply to the Tree Health Pilot. It sets out what the grant pays for, who is eligible and features a case study to illustrate how an ash dieback grant agreement can be formed. "
        },
        {
            "heading": 2,
            "text": "Learn more"
        },
        {
            "text": "If you think you might be eligible for the ash dieback grant offer, we’d love to hear from you. Check your eligibility and apply on GOV.UK "
        },
        {
            "text": "The ash dieback offer is only one part of the Tree Health Pilot scheme. Take a look at the full offer. The guidance is available on GOV.UK  "
        }
    ]
}