{
    "url": "https://civilservice.blog.gov.uk/2022/07/18/civil-service-live-such-a-motivating-inspiring-day/",
    "title": "Civil Service Live - “Such a motivating, inspiring day!”",
    "authors": [
        "Lorraine McBride, Editor of the Civil Service Blog Channel"
    ],
    "categories": [
        "A great place to work",
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Ambitious Civil Service"
    ],
    "pub_date": "2022-07-18T08:20:06+00:00",
    "content": [
        {
            "heading": 3,
            "text": "But don’t take our word for it. Civil Service Live (CSL) is the world’s biggest staff learning and discovery event. Through June and July, CSL spanned five cities, six dates and welcomed more than 15,000 delegates through its doors, but what did you think of it? We found out! "
        },
        {
            "text": "Margaret Duncan, DWP, Glasgow"
        },
        {
            "text": "Civil Service Live has been inspiring, engaging and an opportunity to network. It’s fascinating with everything going on in government at the moment. The talk with Chief Operating Officer Alex Chisholm on funding and finance had a real focus and purpose, along with reinforcement that we’re doing a fantastic job. There’s a real range of jobs in the Civil Service but it takes a bit of everything to make it work. I signed up to the Civil Service Languages Network. For anyone who hasn’t been, you should attend [next year]. There’s real variety for everyone to get involved - and you can’t help but take some sort of learning away."
        },
        {
            "text": "Hugo Griffin, Civil Service Languages Network, Cabinet Office"
        },
        {
            "text": "It’s an amazing place to get to know other people and hear about the amazing things going on across the Civil Service. The Languages Network stand created such a buzz! We’re really celebrating other languages and cultures; we’ve got 8,000 members in the Civil Service. "
        },
        {
            "text": "You can sign up and learn about languages and hear great talks. We often invite ambassadors and academics to speak how they use their language skills and celebrate the language skills we have. A lot of people came up to the stall and said, “I speak Japanese,” or “I speak Mandarin’ to a really high level.” We don’t know anything about them, yet the government could make great use of them. Linguists are very valuable people! "
        },
        {
            "text": "Candida Fianko, Insolvency Service"
        },
        {
            "text": "I’ve really enjoyed it. I learned so much in Alex Aiken’s Presenting With Impact session about confidence and planning when you present a speech. It was packed with tips on engaging your audience and if you hit a lull, just turn it on the audience and ask, ‘What have you learned?’ or ‘How do you feel?’ and take two minutes to discuss this. "
        },
        {
            "text": "I heard a great session from the Cabinet Office’s GREAT campaign [showcasing the best of the UK] using innovative campaign ideas to bring it all to life. In previous departments, I’d always seen CSL advertised but never taken time out of my working day - yet you get so much out of it. I’ve met civil servants across different departments and found out what they do. A lot of the volunteers on my stand had loads of experience so I learned about my own department. It’s a good day out!"
        },
        {
            "text": "Michael Eccleshall, COBR, Cabinet Office"
        },
        {
            "text": "It’s the first time COBR has stepped out from the shadows. We talked to civil servants across government to demystify what COBR [Cabinet Office Briefing Room] is, running through the principles of crisis management and exploring examples where we may - or may not - activate a COBR meeting. We’re trying to lift the lid a bit and had a really positive response with great feedback. It’s an awful lot to cover and a real whistle-stop tour about the very high-level principles of crisis management, when in reality, the devil is in the detail. Feedback told us it’s a really useful way of demonstrating how valuable it is, and the role every civil servant might have to play."
        },
        {
            "text": "Donna Bremner, HMRC, and daughter, Charlotte Hamlett, HMRC"
        },
        {
            "text": "It’s my 20th year in the Civil Service so I always find these events interesting. My favourite session was on leadership - a really interesting and diverse panel. Even though I’ve been in the Civil Service 20 years, I still feel I have a leadership career within me. I asked the panel what advice they’d give my daughter and they said, there’ll always be a good career in the Civil Service with lots to do and good prospects."
        },
        {
            "text": "Charlotte: It’s been such a motivating, inspiring day. I’ve heard lots of speakers and it’s interesting hearing about people’s different career paths as I’m at a stage where I want to start progressing. I’ve been in the Civil Service less than a year so it’s great seeing what’s out there."
        },
        {
            "text": "Gabriel Olorun-Rinu, Ministry of Justice"
        },
        {
            "text": "After the two years we’ve all been through, it’s great networking and meeting people again. I loved the variety of people and seeing what other departments are doing. My highlight was the session about the differences between artificial intelligence and automation. They broke it all down and it really got my mind thinking. I’d recommend CSL to any civil servant curious to know how the other half live. "
        },
        {
            "text": "Rob Walker, Civil Service Pensions"
        },
        {
            "text": "It’s my first CSL and it’s lovely hearing from the members we talk about so much in the office, and to meet them in the flesh! It feels like everybody’s got a really positive vibe. What do most people want to know? It’s interesting - the most popular question is what can they do to increase their pension and secure a better future for themselves."
        },
        {
            "text": "Gavin Pettit, Fraud Office"
        },
        {
            "text": "Coming here and seeing the expanse of what’s on offer has been fantastic. The talk on national security was absolutely brilliant. I’d definitely recommend coming. With all the pressures and stresses, you can get jaded or work in silos in your department. Coming here, you can meet people with similar experiences but from different perspectives; it allows you to evolve."
        },
        {
            "text": "Frances Thompson, Cabinet Office"
        },
        {
            "text": "This is my first time as a visitor, as opposed to being on a stand. It’s great to walk around and I’ve really enjoyed the sessions such as leadership, and thinking about the challenges in the environment we’re operating in over the next six to 12 months. For me, it’s a really good time to go to CSL and take away some top tips, thoughts and reflections about how I operate."
        }
    ]
}