{
    "url": "https://homeofficemedia.blog.gov.uk/2022/07/18/factsheet-passport-processing-times-and-unprecedented-levels-of-demand/",
    "title": "Factsheet: Passport processing times and unprecedented levels of demand",
    "authors": [
        "HO News Team"
    ],
    "categories": [
        "Fact sheet"
    ],
    "pub_date": "2022-07-18T10:27:26+01:00",
    "content": [
        {
            "text": "There has recently been considerable press coverage of people facing holiday cancellations or travel disruption due to waiting times for passports."
        },
        {
            "text": "We are seeing unprecedented demand, following more than five million people delaying their application for a passport during the pandemic because of restrictions in international travel. Her Majesty’s Passport Office anticipates that 9.5 million British passport applications will be made this year (2022)."
        },
        {
            "text": "HM Passport Office is processing more applications than ever before, with the processing of approximately one million applications being completed every month."
        },
        {
            "text": "Since April 2021, HM Passport Office has been advising people to allow up to ten weeks when applying for their British passport. In the first six months of 2022, 97.7% of applications from the UK were completed within 10 weeks."
        },
        {
            "text": "A passport can only be issued once all the checks have been completed satisfactorily and will take longer if applications are submitted with missing or incomplete information."
        },
        {
            "text": "What is HM Passport Office doing to meet this increased demand?"
        },
        {
            "text": "HM Passport Office has prepared extensively for this surge in demand and has increased capacity – people and systems – across all elements of the production process. The priority is to ensure we can continue to process as many passport applications as possible."
        },
        {
            "text": "To do this:"
        },
        {
            "text": "What can customers do to ensure there are no delays?"
        },
        {
            "text": "We urge people who need a new passport to apply for one as soon as possible to ensure their passport arrives in good time."
        },
        {
            "text": "Customers can help to ensure there are no delays with their application, such as applying online, and submitting a digital photo using a photo code from a shop or booth."
        },
        {
            "text": "And it is important to stress, you should not book travel until you have a passport that meets your travel needs."
        },
        {
            "text": "Where can you go for more help?"
        },
        {
            "text": " *Factsheet updated on 18/07/2022"
        }
    ]
}