{
    "url": "https://ruralpayments.blog.gov.uk/2022/07/18/farm-safety-week-making-farms-safer-places-to-live-and-work/",
    "title": "Farm Safety Week: making farms safer places to live and work",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Farm Safety"
    ],
    "pub_date": "2022-07-18T16:14:01+01:00",
    "content": [
        {
            "text": "RPA is supporting Farm Safety Week run by the Farm Safety Foundation – or Yellow Wellies as they’re known. Farm Safety Week, starting on 18 July, is the ten-year anniversary of the campaign, which brings together five countries over five days with one simple goal - to encourage everyone in the industry to make our farms safer places to live and to work."
        },
        {
            "text": "This year’s campaign will highlight the causes and consequences of life-changing and life-ending incidents on farms, the hidden dangers of farming and what the industry and individuals are doing to address."
        },
        {
            "text": "The aim of Farm Safety Week is to raise awareness of the importance of working safely in farming, promote good safety practices and share positive stories about the use of innovation and education to improve safety."
        },
        {
            "text": "It also aims to engage the farming community, to challenge and change attitudes and behaviours and make our farms safer places to live and work, as well as encourage everyone working in the industry to prioritise their physical and mental wellbeing every day."
        },
        {
            "text": "Carrie Smith, External Affairs Manager from RPA said:"
        },
        {
            "text": "Sadly, agriculture still has the poorest safety record of any occupation in the UK and Ireland. To mark the start of this year’s campaign, the Health & Safety Executive (HSE) will share their annual Fatal Injuries in Agriculture, Forestry and Fishing in GB report 2021/22 on 18 July. Yellow Wellies will use these figures to reflect on what’s been achieved over the past decade and highlight how much there is still to do to improve the safety record of our industry."
        },
        {
            "text": "A decade on, we are starting to see safety improvements in some areas, but behavioural change moves slow – far too slow for the 22 families that lost a loved one over the past year."
        },
        {
            "text": "On 19 July, which is the second day of the Royal Welsh Show, Yellow Wellies will be hosting a special panel discussion in partnership with Wales Farm Safety Partnership, from 1.30pm to 2.30pm at the NFU Mutual stand marquee."
        },
        {
            "text": "For more information on ‘Farm Safety Week’ visit www.yellowwellies.org or follow @yellowwelliesUK on Twitter, Facebook and Instagram."
        }
    ]
}