{
    "url": "https://despatch.blog.gov.uk/2022/07/18/how-can-adis-support-the-ready-to-pass-campaign/",
    "title": "How driving instructors can support the ‘Ready to Pass? campaign",
    "authors": [
        "Abigail Britten"
    ],
    "categories": [
        "Driving instructors",
        "Ready to Pass?"
    ],
    "pub_date": "2022-07-18T08:34:01+01:00",
    "content": [
        {
            "text": "In May, we updated you on our plans to launch our campaign this summer to improve your pupils’ understanding of what it means to be test ready and how they can assess their readiness. If they are not ready, we will encourage them to delay their test."
        },
        {
            "text": "Today (18 July 2022) the campaign, ‘Ready to Pass?’ was launched."
        },
        {
            "text": "We know 89% of learners say that you have the biggest influence over your pupils when it comes to them assessing their test readiness. So, in this blog I will share with you a new toolkit we’ve put together to help you."
        },
        {
            "text": "We’ve created some materials for you to use to help your pupils and their parents better understand what it means to be test ready and how they can work with you to assess their readiness."
        },
        {
            "text": "The toolkit includes information about the campaign, and some key messages which you can use to start a conversation with your pupils and their parents. There is also draft content and graphics for social media, customer emails, blog posts and your website."
        },
        {
            "text": "The Driver and Vehicle Standards Agency (DVSA) will be taking part too – we’ll be messaging learners with a practical and theory test booked, and we’ll encourage them to check out the new GOV.UK ‘Ready to Pass?’ campaign page."
        },
        {
            "text": "By working together, we can improve the driving test pass rate, help more new drivers on the road and reduce driving test waiting times"
        },
        {
            "text": "We hope this is useful to you. Of course, you don’t have to use the materials we’ve drafted if you’d prefer to create your own. We just wanted to provide some material to help you and your pupils."
        },
        {
            "heading": 2,
            "text": "3 easy steps to get involved with the ‘Ready to Pass?’ campaign"
        },
        {
            "text": "Visit the Ready to Pass? - ADI communications toolkit."
        }
    ]
}