{
    "url": "https://teaching.blog.gov.uk/2022/07/18/how-schools-are-supporting-attendance-ahead-of-the-new-academic-year/",
    "title": "How schools are supporting attendance ahead of the new academic year",
    "authors": [
        "Diane Henson",
        "Michelle O’Dell",
        "Matt Rooney"
    ],
    "categories": [
        "Attendance",
        "Primary schools",
        "Pupil wellbeing and behaviour",
        "Secondary schools",
        "SEND"
    ],
    "pub_date": "2022-07-18T15:28:59+01:00",
    "content": [
        {
            "text": "In this blog post, schools across the country share a range of their approaches to increase attendance levels amongst their pupils, with a focus on the transition between classes, year groups, and support when moving to a new school.   "
        },
        {
            "text": "Diane Henson, Headteacher - Wheelers Lane Technology College"
        },
        {
            "text": "We have various strategies to keep children engaged over the summer and to be ready for school in September. We think it is important to build the best foundation possible over this period, in order to maintain high attendance over the year. Some of these approaches include:"
        },
        {
            "text": "Michelle O’Dell, Attendance Intervention Manager - John Taylor Multi Academy Trust "
        },
        {
            "text": "We have a programme of managing attendance for those making the transition from year 6 to year 7:"
        },
        {
            "text": "Matt Rooney, Principal - St Giles Special Educational School"
        },
        {
            "text": "Learners at our school have a broad range of needs, and all have an Education Health and Care Plan (EHCP). We believe that ‘no dreams are out of reach’ and to help pupils reach their dreams they must attend school as much as they are possibly able. Our support includes:"
        },
        {
            "text": "Read guidance on working together to improve school attendance"
        },
        {
            "text": "Access resources for children, young people and schools to support attendance"
        }
    ]
}