{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2022/07/18/intellectual-property-office-green-channel-accelerates-environment-friendly-patents/",
    "title": "Intellectual Property Office Green Channel accelerates environment-friendly patents",
    "authors": [
        "Imogen Percival",
        "Robin Newman"
    ],
    "categories": [
        "Guest Blog",
        "Latest Stories",
        "Our People & Deep Dives"
    ],
    "pub_date": "2022-07-18T14:58:04+01:00",
    "content": [
        {
            "text": "Did you know that businesses with an environmental benefit can request accelerated processing of their patent applications?"
        },
        {
            "text": "GSE Patent Examiners, selected for their science and engineering backgrounds, are excited to see the speed of innovation in fuel cell technologies."
        },
        {
            "text": "Intelligent Energy is a UK-based, world-leading fuel cell engineering business, focused on the development of lightweight, high-efficiency fuel cell technologies. They are just one of the companies who have made use of IPO’s Green Channel – a fast track patent application process. We spoke to Head of Intellectual Property (IP), Dan Ninan to find out more."
        },
        {
            "text": " "
        },
        {
            "text": "IE-SOAR 2.4kW fuel cell module powering a Gryphon drone."
        },
        {
            "text": "Their business has a large patent portfolio centring on fuel cell technology."
        },
        {
            "text": " "
        },
        {
            "text": "Definition"
        },
        {
            "text": "Fuel cell: A fuel cell uses the chemical energy of hydrogen or other fuels to cleanly and efficiently produce electricity. Fuel cells work like batteries, but they do not run down or need recharging. They produce electricity and heat as long as fuel is supplied.\nSource: Energy.Gov"
        },
        {
            "text": " "
        },
        {
            "text": "Who is Intelligent Energy? "
        },
        {
            "text": "Intelligent Energy is headquartered in Loughborough, with sites in the US, Japan, South Korea and China."
        },
        {
            "text": "They have more than 20 years’ experience in the development and manufacturing of zero-emission fuel cells. Their systems provide power for applications across many industries, these include automotive, stationary power, aerospace, materials handling and Uncrewed Aerial Vehicles (UAVs). They have a large portfolio of patents."
        },
        {
            "text": "This fuel cell module improves performance for materials handling such as forklifts."
        },
        {
            "text": " "
        },
        {
            "text": "“Our vision was to commercialise innovative fuel cell technology”  "
        },
        {
            "text": "The company started in 2001 when it acquired by Advanced Power Sources Ltd, a spinout company from Loughborough University."
        },
        {
            "text": "Dan Ninan explains: “our vision was to commercialise innovative fuel cell technology in a number of industries. Fuel cells provide zero-emission power. This allows decarbonisation for industries that have a significant carbon dioxide output, like aviation and automotive."
        },
        {
            "text": "“Refuelling with hydrogen takes just a few minutes and is much faster than battery recharging or even quicker than swapping battery packs in some cases. Hydrogen fuel cell solutions have a higher energy density than the battery equivalent.”"
        },
        {
            "text": "Dan went on to tell us that a large drone or aircraft powered by fuel cells can fly further and for longer than one powered by a battery- pretty amazing we think."
        },
        {
            "text": " "
        },
        {
            "text": "Developing a fuel cell system for the world’s first manned hydrogen fuel cell aircraft"
        },
        {
            "text": "Intelligent Energy has grown significantly since the early days, expanding to explore fuel cell technology in different industries. We asked Dan about their notable achievements:"
        },
        {
            "text": "“One of our highlights was developing, integrating, and commissioning a fuel cell system for the world’s first manned hydrogen fuel cell aircraft in collaboration with Boeing.”"
        },
        {
            "text": "Currently they are working on the H2GEAR programme led by GKN Aerospace, which is UK government funded via the Aerospace Technology Institute. This will develop fuel cell technology for commercial aircraft applications."
        },
        {
            "text": "Click this video to learn more"
        },
        {
            "text": " "
        },
        {
            "text": "Protecting all aspects of our business "
        },
        {
            "text": "Intelligent Energy places great importance on IP. “We protect our company and product names, and logos, with trademarks in all of our major markets. When dealing with new stakeholders, we use non-disclosure agreements (NDAs) to ensure key information and trade secrets remain confidential for both parties.”"
        },
        {
            "text": "Find out about the different types of intellectual property protection available on the IPO’s website."
        },
        {
            "text": " "
        },
        {
            "text": "“Patents and licensing have underpinned our successful commercial engagement” "
        },
        {
            "text": "The business has more than 100 patent families globally which has supported  successful commercial engagement with several blue-chip companies over the years."
        },
        {
            "text": "“We’ve worked with Suzuki in Japan, where we’ve realised revenues through licensing and technology transfer over many years,” said Dan ."
        },
        {
            "text": "“Our patents also protect the innovation within our products. They underpin our sales revenues.”"
        },
        {
            "text": "This fuel cell module has passenger and commercial use in trucks, buses, rail and marine."
        },
        {
            "text": " "
        },
        {
            "text": "“The IPO’s Green Channel has accelerated our patent applications and gave us reassurance before filing abroad”"
        },
        {
            "text": "Dan told us that Intelligent Energy files its patents first in the UK, largely because of the IPO’s Green Channel. They tend to use it for all their UK applications."
        },
        {
            "text": "We wondered how helpful Intelligent Energy finds the service."
        },
        {
            "text": "“The accelerated search and examination are extremely useful for us” said Dan. “The faster search means any concepts with adverse search reports can be identified before we look at filing an international PCT application."
        },
        {
            "text": "“The accelerated examination means that we are often able have our patent granted in the UK within the priority year. So, we can then apply to other jurisdictions with a GB grant which can be used as the basis of a Patent Prosecution Highway request.”"
        },
        {
            "text": "Dan explained that this gives the business certainty on the patent scope and helps us manage their foreign filing decisions and costs accordingly."
        },
        {
            "text": "Click this video to learn more"
        },
        {
            "text": " "
        },
        {
            "text": "“It is really gratifying to see the positive impact of the Green Channel”"
        },
        {
            "text": "Steven Chadwell, Heading and Senior Patent Examiner at the Intellectual Property Office, explained how it’s great to see the positive impact of the Green Channel:"
        },
        {
            "text": "“It can be easy sometimes to fall into the trap of examining patents as an ‘academic exercise’, so it is always nice to see some direct feedback on the benefits of our work for UK business."
        },
        {
            "text": "I work in the area of batteries and fuel cells, a subject that is very much focussed on green technology. Many of our applicants make use of the ‘Green Channel’ to get accelerated processing so that they can get to market quicker or secure funding for their ideas. This can make balancing my workloads really tricky at times!"
        },
        {
            "text": "However, it is really gratifying to see the positive impact of this work, direct from the horse’s mouth, from one of my main ‘customers’."
        },
        {
            "text": "I have also had opportunities to talk to people from Intelligent Energy and other companies using the patent system when attending conferences as part of my technical training and development, and I am often told then how much they value the work done by us at the IPO.”"
        },
        {
            "text": "Intelligent Energy's lightweight fuel cell stacks."
        },
        {
            "text": " "
        },
        {
            "text": "“Don’t just use one type of IP protection, have a balance of patents and trade secrets”  "
        },
        {
            "text": "We asked Dan what advice he would give to other businesses for protecting their IP."
        },
        {
            "text": "“We would advise others to:"
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "So what does the future hold for Intelligent Energy?"
        },
        {
            "text": "“As Intelligent Energy continues to grow, we will carry on commercialising and productionising our technology. This includes creating a Gigafactory to help us meet demand and strengthen our position in our key markets."
        },
        {
            "text": "“Fuel cells and hydrogen will have a significant role in the path to net zero and decarbonisation of many market sectors, and our IP will underpin our future success.”"
        },
        {
            "text": " "
        }
    ]
}