{
    "url": "https://traderemedies.blog.gov.uk/2022/11/16/around-the-world-in-eighty-ways/",
    "title": "Around the World in Eighty Ways",
    "authors": [
        "Ben Woden, Head of Evaluation and Research"
    ],
    "categories": [
        "Analysis"
    ],
    "pub_date": "2022-11-16T13:26:39+00:00",
    "content": [
        {
            "text": "Today, we published a report developed for us by Frontier Economics on the topic of circumvention. But what is circumvention, and why do we care about it? "
        },
        {
            "text": "Imagine a countervailing duty on Prussian telegraph keys has just come into force. Imports dry up in the coming months, but imports from the dual monarchy of Austria-Hungary start rising. It turns out that these are the very same telegraph keys that were the focus of the countervailing duty, just shipped via Vienna and stamped with a new insignia! "
        },
        {
            "text": "This would be a classic example of circumvention, specifically known as trans-shipment: moving a product through a third country to avoid duties. Though this case would likely be open and shut, circumvention can in practice be very difficult to prove and in fact there is no consensus even on what should be called circumvention in principle. That’s why in autumn 2021, we commissioned Frontier Economics to carry out extensive research and produce a thorough analysis of the topic. "
        },
        {
            "text": "The final report explores differing views around the world as to what constitutes circumvention, how to identify it, and what to do about it. It reflects in-depth interviews with the European Commission, Australia’s Anti-Dumping Commission, the US Department of Commerce, and the Canada Border Services Agency, to whom we are grateful for their sharing of expertise. It dives into real examples that demonstrate the difficulties involved, and proposes a way forward for assessing evidence regarding circumvention of our own duties. "
        },
        {
            "text": "The report pays special attention to the role analysis of trade flow data can play in demonstrating circumvention, but also highlights how complicated using this data is in practice. Our telegraph key example would certainly show up in such a dataset. However, it would be hard to differentiate on that evidence alone between circumvention and a case in which Prussian exporters were looking for new buyers, and UK importers were looking for new sellers, and chose the same market. "
        },
        {
            "text": "On the other side of the same coin, circumvention might not show up in such datasets at all, perhaps due to incomplete or even fraudulent reporting, so making a definitive judgement purely on the basis of such data would be very difficult. Furthermore, traders can often see which way the wind is blowing, and “react” to a trade remedies measure before it is even imposed, further complicating matters. "
        },
        {
            "text": "Trade data analysis will form a key plank of the TRA’s approach to monitoring for circumvention going forward, but it can’t fully replace the need for investigations to dig deeply into this issue when considering individual cases. Circumvention reviews will need to combine data on trade flows and the analytical skills needed to interpret it with the expertise of legal, policy, verification, and investigations teams, just like the rest of our case work. "
        },
        {
            "text": "This and many other issues, including other forms of circumvention such as assembly from kits imported as separate pieces, and simple mal-classification of goods, are explored in depth in the full report. "
        },
        {
            "text": "You can find out more about the TRA’s investigations on our public file.  "
        }
    ]
}