{
    "url": "https://apprenticeships.blog.gov.uk/2022/11/16/cop27-update-employers-prioritising-green-skills-training/",
    "title": "COP27 Update: employers prioritising green skills training",
    "authors": [
        "Institute for Apprenticeships"
    ],
    "categories": [
        "COP27",
        "Employers",
        "Green apprenticeship advisory panel"
    ],
    "pub_date": "2022-11-16T12:06:15+00:00",
    "content": [
        {
            "text": "November is the United Nations Climate Change summit COP27."
        },
        {
            "text": "With the conference in its second week, we want to highlight some of the brilliant employers working hard to provide green skills training to their apprentices, with a total of 70 apprenticeships now supportive of green or net zero goals."
        },
        {
            "heading": 2,
            "text": "Steve Fowkes, head of green economy and skills at the Forestry Commission:"
        },
        {
            "text": "Steve has over 13 years of experience working for the forestry commission, influencing policy and specifically the skills agenda. He also sits on IfATE's Green Advisory Panel (GAD) helping to implement strategies that will make existing apprenticeships greener."
        },
        {
            "text": "Steve enjoys working on the panel:"
        },
        {
            "text": "Steve worked on the development of the first-of-its-kind professional forester apprenticeship and its one of his proudest achievements to date:"
        },
        {
            "text": "For the ideal candidate looking to undergo a forestry apprenticeship Steve encourages them to be passionate about the long-term difference they are making to society:"
        },
        {
            "heading": 2,
            "text": "Louise Cairns, CEO at National Skills Academy for Food and Drink (NSAFD):"
        },
        {
            "text": "NSAFD is a non-profit organization that supports UK Food and Drink manufacturers to develop and strengthen the skills of their workforce and attract future talent."
        },
        {
            "text": "With over 30 years in this industry, Louise notes it is not one often associated with sustainability. However, more brands are becoming consciously aware of their carbon footprint and taking steps to reduce this:"
        },
        {
            "text": "Packaging remains one of the biggest environmental concerns for the food and drinks industry but apprenticeships such as the Level 6 packaging professional apprenticeship have risen to overcome this challenge."
        }
    ]
}