{
    "url": "https://teaching.blog.gov.uk/2022/11/16/create-a-flexible-tutoring-model-to-maximise-the-academic-impact-of-tuition/",
    "title": "Create a flexible tutoring model to maximise the academic impact of tuition",
    "authors": [
        "Neil Wilkinson"
    ],
    "categories": [
        "COVID-19 support",
        "Secondary schools",
        "Teachers' reflections"
    ],
    "pub_date": "2022-11-16T11:54:21+00:00",
    "content": [
        {
            "text": "The Bemrose School in Derby has pupils aged 3-19. They started delivering tutoring in October 2020 to compensate for lost learning during the pandemic. Executive headteacher, Neil Wilkinson encourages other schools to develop a flexible tutoring model that is responsive to the needs of pupils and parents. "
        },
        {
            "text": "In the current academic year, we're delivering tutoring to 600 pupils at primary and secondary level using all three subsidised routes of the National Tutoring Programme (NTP): academic mentors, tuition partners and school-led tutoring. This has allowed us to reach a greater number of pupils and to match the right tutors with pupils, responding to their specific needs. Having a high level of flexibility and choice allows us to maximise the academic impact of tutoring and fully utilise available funding.  "
        },
        {
            "text": "Here is my advice for other schools already using or thinking of using the NTP: "
        },
        {
            "text": "Flexibility in scheduling tutoring sessions "
        },
        {
            "text": "Using all three routes provides flexibility when scheduling tuition. We’re able to use our academic mentor or external tutors to run sessions outside of formal school hours, at times that are more suitable to pupils and their families. We also take the learning preferences of our pupils into account. Some children prefer learning on a Saturday morning, rather than after school. We cater for this through a Saturday school. This maximises pupil engagement during the tutoring sessions. It also benefits those pupils who only have online access at the weekend.  "
        },
        {
            "text": "To accommodate pupils who prefer tutoring to take place immediately after the school day, we have incorporated an extra period (period six) into the school timetable. This takes place from 3-4pm each day. We’ve tried to frame this as being part of the school day, to encourage pupil engagement.  "
        },
        {
            "text": "Having this flexibility means parents are more likely to engage, as we’re making it as easy as possible for them to fit tutoring into their child’s schedule.  "
        },
        {
            "text": "Flexibility when matching tutors and pupils  "
        },
        {
            "text": "Matching pupils with the right tutors maximises the positive impact of tutoring on attainment. Some pupils prefer working with a new member of staff, such as an academic mentor or an external tutor. This gives them the opportunity to start afresh, if they have felt stagnated for a long period of time. Whereas pupils with Special Educational Needs and Disabilities (SEND) may prefer working with a tutor who is someone they already know and trust. So having the option of using current staff who they already have an existing relationship with, through the school-led tutoring route, is hugely beneficial for these pupils. "
        },
        {
            "text": "Flexibility in subjects covered by tutoring "
        },
        {
            "text": "We are keen to make sure that tutoring aids the academic progress of as many pupils as possible. Whilst our focus is on core subjects such as English and Maths, we don’t want to neglect those pupils who need support in other subjects, such as humanities. At secondary level, tutoring is delivered in a range of GCSE subjects. We’re able to access a pool of tutors with specialist knowledge through our tuition partners. The organisations we work with are based locally, so they know the community and understand the challenges we face. Another real benefit of working with tuition partners, is that they create a plan to respond to the specific needs of your school. "
        },
        {
            "text": "Flexibility when hiring academic mentors "
        },
        {
            "text": "We currently have one academic mentor working at our school at primary level, focusing on literacy. We’ve had an overwhelmingly positive experience and are recruiting more academic mentors, to reach more pupils. They can hit the ground running and need very little support, so quickly become part of school life. We have the flexibility and choice to direct them into different spaces, including in the classroom, working alongside teachers, without taking children out of their classes and out of their routine. They can also work outside of formal school hours, including during holiday periods. For example, if an academic mentor works on a Saturday morning, they can have the Monday morning off in lieu.   "
        },
        {
            "text": "Since we started delivering tutoring via the NTP, our GCSE exam results are now in line with what they were in 2019 and pupils now see it as a normal part of the school day. I would encourage schools to make the most of funding whilst it’s available and to think outside the box. You have the flexibility to make the NTP work for you. Be creative and think beyond the guidance, this will make it work for your institution. "
        }
    ]
}