{
    "url": "https://dcmslibraries.blog.gov.uk/2022/11/16/health-on-the-high-street-the-role-of-public-libraries/",
    "title": "Health on the High Street: The Role of Public Libraries",
    "authors": [
        "Darren Smart, Service Manager, Libraries Development, Somerset Libraries"
    ],
    "categories": [
        "Case study",
        "Outcome: wellbeing"
    ],
    "pub_date": "2022-11-16T13:05:11+00:00",
    "content": [
        {
            "text": "The COVID-19 pandemic was an opportunity to radically re-think which NHS services could be made more effective and accessible by delivering them in communities, in ways that make our high streets more economically and socially sustainable.  You can read more about this in 'Health on the high street' article by the NHS Federation."
        },
        {
            "text": "Local authorities have an important role in developing and embedding this initiative, with public libraries well placed to support this as they are:"
        },
        {
            "text": "Somerset, like most of the country, had seen a significant drop in access to GPs throughout the pandemic so opted to explore the Health on the Hight Street model. Taunton Library was selected as the pilot site and a small amount of funding from Public Health was used to address any stock gaps and optimise the layout of the library, gathering all the existing health and wellbeing resources into a distinct, branded Wellbeing Zone."
        },
        {
            "text": "The Wellbeing Zone also incorporated space for various partners, e.g. Public Health Nursing, Health Visitors and Health Coaches, to hold drop-ins and activities, as well as have more confidential conversations with customers in an adjacent room."
        },
        {
            "text": "Public Health also funded a healthcare M8 dual function automatic monitor (affectionally nicknamed FRED) which allows customers to accurately measure their height, weight, BMI, heart rate and blood pressure without supervision. They get a printout of the results and the data is also sent to their GP automatically if the customer consents to do so."
        },
        {
            "text": "The pilot was soft launched through local advertising via social media and by library staff and partners talking to their customers. Since then 215 people have used FRED 337 times, with women twice as likely as men to use the service. Similarly, more BAME customers seem to be using the service than predicted."
        },
        {
            "text": "So far FRED has identified previously undiagnosed high blood pressure in 10% of the users, with 2 being in the ‘dangerously high’ category."
        },
        {
            "text": "Anyone who raised concerns about their results in the library were signposted to the onsite health teams for additional advice and support, and all who were clinically impacted were flagged directly to their GP directly for follow up."
        },
        {
            "text": "Based on the success so far we are now seeking to rollout the pilot to 6 other libraries across the county. We have also rolled out 200 blood pressure monitors for loaning via libraries to support people who need to monitor their blood pressure over a period of weeks. It is early days but 15% are currently on loan, without any significant promotion."
        },
        {
            "text": "In conclusion, libraries are well placed to support Health on the High Street make a difference to their community’s health and wellbeing and thus help ease pressure on local GPs."
        },
        {
            "text": " "
        }
    ]
}