{
    "url": "https://dluhcdigital.blog.gov.uk/2022/11/16/the-planning-software-improvement-fund-is-open-for-applications/",
    "title": "The Planning Software Improvement Fund is open for applications",
    "authors": [
        "Digital Planning"
    ],
    "categories": [
        "Digital Planning"
    ],
    "pub_date": "2022-11-16T11:00:40+00:00",
    "content": [
        {
            "text": "The Department for Levelling Up, Housing and Communities (DLUHC)'s ambition to improve local authority planning services is an important part of the Levelling Up and Regeneration agenda. Our new Planning Software Improvement Fund is making £5 million available to 25 councils in England to improve the planning services they use for the submission and assessment of planning applications."
        },
        {
            "heading": 2,
            "text": "Our ambition to improve software used for planning applications"
        },
        {
            "text": "DLUHC has stated an ambition for a new, more modular, software landscape to encourage digital innovation and provide access to underlying data. This will help automate routine processes, which will support faster and more certain decision-making. "
        },
        {
            "text": "Many councils are currently using different technology products that do not easily integrate or share data with each other, which can cause friction in the planning system. Our funded projects have indicated that on average 50% of planning applications are invalid when received by councils; often because of avoidable errors. Information is frequently locked away in documents, and rich data can be difficult to access that could otherwise simplify the acts of making and processing a planning application.   "
        },
        {
            "text": "Through the Planning Software Improvement Fund, we are supporting Local Government to improve the software being used for development management, the part of the planning process where decisions are made on applications."
        },
        {
            "heading": 2,
            "text": "Our work to date"
        },
        {
            "text": "We have been supporting Local Planning Authorities (LPAs) through two approaches:"
        },
        {
            "heading": 2,
            "text": "Three tracks of funding available for councils"
        },
        {
            "text": "Our new funding makes £5 million available for 25 Local Planning Authorities in England to focus on specific service improvements, which have been targeted based on what we have learned through funded project work and insights from conversations with council staff and existing service providers."
        },
        {
            "text": "So that councils are not limited to a choice between ‘new’ and ‘existing’ technology, we are also introducing the opportunity for councils to adopt one of the Open Digital Planning services to work alongside their current software."
        },
        {
            "text": "Local Planning Authorities are invited to apply for funding via one of three tracks:"
        },
        {
            "text": "Track 1: Adopt and design new services with councils"
        },
        {
            "text": "Join the Open Digital Planning project to adopt and work with other Local Planning Authorities to design the PlanX and BOPS services for submitting and processing planning applications. The project has a dedicated website where councils interested in joining can find out more about the work done to date and the expected commitments of new partners."
        },
        {
            "text": "Track 2: Adopt new services and integrate with existing software"
        },
        {
            "text": "Adopt one of the Open Digital Planning software products [PlanX or BOPS] and work with an existing service provider on targeted service improvements and technical integrations."
        },
        {
            "text": "Track 3: Improve existing software products and integrations with service providers"
        },
        {
            "text": "Work with existing service providers on targeted service improvements and technical integrations in line with DLUHC’s ambition for digital planning."
        },
        {
            "text": "The emphasis of tracks two and three is on the development of Application Programming Interfaces (APIs) that make it easier to share data between different systems, and on improvements such as using a simple automatic data check for any planning constraints that affect a property. "
        },
        {
            "text": "The application deadline is 23 December 2022, and our team will be running Q&A sessions between now and then, registration is essential so please follow the Digital Planning Eventbrite page for updates."
        },
        {
            "text": "You can find out more about the fund on our Planning Software Improvement Fund webpage."
        }
    ]
}