{
    "url": "https://designnotes.blog.gov.uk/2022/11/16/using-design-principles-to-make-our-work-simple/",
    "title": "Using design principles to make our work simple",
    "authors": [
        "Laurence Berry – Senior service designer, GDS"
    ],
    "categories": [
        "Design"
    ],
    "pub_date": "2022-11-16T14:00:58+00:00",
    "content": [
        {
            "text": "From school we are trained to prove we are doing the most, for example reaching word counts for essays. We carry this mindset that quantity is equal to quality into adulthood, whether we’re drafting a report or presenting at a Show and Tell. This can be felt most in our places of work, and the public sector is no exception. "
        },
        {
            "text": "How might we apply the design principles, ‘do less’ and ‘do the hard work to make it simple’ to how we work and communicate?"
        },
        {
            "text": "There are many examples of how the principles are applied to products or services. "
        },
        {
            "heading": 3,
            "text": "Do less"
        },
        {
            "text": "The Design principle 'Do less’ says: "
        },
        {
            "text": "The NHS service manual is an example of “doing less”. They adapted and built upon the GOV.UK service manual rather than starting from scratch (nod to another principle here; make things open, it makes them better)."
        },
        {
            "heading": 3,
            "text": "Do the hard work to make it simple"
        },
        {
            "text": "The Design principle 'Do the hard work to make it simple' says:"
        },
        {
            "text": "The GOV.UK step-by-step pattern is an example of doing the hard work to make a service simple. We know users face challenges carrying out tasks. There’s a lot of information to find, there might be appointments to book, all at the right time in the right order. The hard work here is to bring all parts of government together to provide one end-to-end service."
        },
        {
            "heading": 2,
            "text": "Applying the principles to the way we work with each other"
        },
        {
            "text": "We are inundated with calls, documents and presentations. The principles, can be applied not just to the services we deliver or the way we work but also to the way we present information, reducing the cognitive load for our colleagues and stakeholders."
        },
        {
            "heading": 3,
            "text": "Presenting"
        },
        {
            "text": "We could challenge ourselves to use the principles to make more engaging presentations by reducing the content rather than the font size, making clear points, setting a limit of 20 slides or using images rather than words."
        },
        {
            "text": "Pecha Kucha style presentations are an example of a constraint based format designed for engaging presentations, pechakucha, it's a Japanese onomatopoeic word for chit chat, 20 slides, 20 seconds each, no text or video, don't be boring."
        },
        {
            "text": "Setting constraints like these force us to improve the quality of our communication. Remember, you are telling a story and people should be listening to you."
        },
        {
            "heading": 3,
            "text": "Writing"
        },
        {
            "text": "Perhaps we’re just as likely to be communicating through documents. In the image above I’ve received a document (left), it is very important. You can tell the first paragraph is important because it’s bold, but the even more important information is in red. If you look at the redesigned document (right) you’ll see the same information but it’s much easier to understand. "
        },
        {
            "text": "I simplified the document in 3 steps:"
        },
        {
            "heading": 2,
            "text": "Your challenge"
        },
        {
            "text": "We are well known for how we apply the design principles, ‘do less’ and ‘do the hard work to make it simple’ to our services but there are opportunities to be bold and use the principles in everything we do: at standup, in emails, reports and presentations. "
        },
        {
            "text": "Whatever you're working on there is an opportunity to simplify it. "
        },
        {
            "text": " "
        }
    ]
}