{
    "url": "https://prisonjobs.blog.gov.uk/2022/10/17/a-day-in-the-life-of-a-community-payback-supervisor/",
    "title": "A day in the life of a Community Payback supervisor",
    "authors": [
        "Ministry of Justice"
    ],
    "categories": [
        "Community Payback",
        "Personal stories",
        "Probation",
        "Ways of working"
    ],
    "pub_date": "2022-10-17T15:27:15+01:00",
    "content": [
        {
            "text": "Community Payback (CP) supervisors supervise groups of people on probation to do unpaid work to improve local communities and get their lives back on track. If, like Jennifer, you’re ‘not an office person’ and you’re looking for rewarding work, read what she has to say about her job and see if it’s for you. "
        },
        {
            "text": "You can find more information about working in Community Payback and our current vacancies on our website."
        },
        {
            "text": "I’ve worked as a CP supervisor for 12 years now – initially alongside another job, and full-time for the last 3 years. I work in the South Central region, which covers Berkshire, Buckinghamshire, Oxfordshire, Hampshire, and the Isle of Wight. Most of the time, I work in Oxfordshire, but I also cover other areas if needed. I work 4 days a week, including one day every weekend – paid at a higher rate. I also work extra days when overtime is available."
        },
        {
            "text": "A typical day?"
        },
        {
            "text": "Because we work with a wide range of people on probation, and across a number of different unpaid work sites, no 2 days as a CP supervisor are the same. But there is a structure to every day and key tasks that need to be done."
        },
        {
            "text": "I start by picking up the CP minibus from our depot. Whenever I can, I’ll load up any tools and equipment when I drop off the minibus the previous day. So, after a quick check in the morning, I drive to the site I’ll be working at. If there are people on probation who can’t make their own way there, I’ll take them in the minibus too."
        },
        {
            "text": "When I arrive, I check the welfare facilities – the toilets, sink, tea and coffee making facilities  – then set up my computer ready to start checking people in when they get there at 9am."
        },
        {
            "text": "Briefing and assigning tasks"
        },
        {
            "text": "We start with a briefing so everyone is clear on what needs to be done, how to safely use any equipment, and who’s doing what. The group will then unload the minibus, put on their high viz jackets and toe protector work boots, and start work. I do a lot of work on allotments, so there’s lots of weeding, planting and tending to fruit and veg to be done."
        },
        {
            "text": "You quickly see what people like doing or are good at, and spot those who need a bit more encouragement or coaching. So, once everyone’s set up, I’ll go and have a chat with anyone I spot who is struggling."
        },
        {
            "text": "Because we spend all day and a number of weeks with people on probation doing their unpaid work, CP supervisors have an opportunity to build a rapport with them. Chatting to people gives me more of a sense of what’s going on in their lives and to identify any additional support they might need to turn their lives around. This helps me signpost them to helpful services such as a local food bank or training opportunity, for example."
        },
        {
            "text": "Consistency and structure"
        },
        {
            "text": "People on probation often have quite chaotic lives, so I like to make sure they have some consistency when they’re on CP. Simple things like sticking to regular break and lunch times, and making sure rules around not using mobiles while on site are consistently enforced."
        },
        {
            "text": "We all eat lunch together, and usually end up having some sort of group chat. Whether it’s about something light-hearted such as what everyone’s favourite doughnut is, or something more serious such as mental health, it’s a good opportunity for people to see things from others’ perspectives. And that can help them to think differently about how they come across and react in different situations."
        },
        {
            "text": "Multi-tasking is key"
        },
        {
            "text": "To be a good CP supervisor, you need to be able to multi-task and be aware of what’s going on around you at all times. One minute, I could be showing a group how to dig and line a pond. The next, I’ll be on a call to a probation officer (PO) about something I’ve picked up during a one-to-one conversation with someone that I think their PO should know about. Then I might have to deal with someone who’s anxious, upset, or angry – which is often because they’re not confident about doing the task they’ve been set."
        },
        {
            "text": "The day goes quickly. And, before we finish at around 4pm, the group and I pack up all the equipment and I complete the necessary paperwork. Then I drive the minibus back to the depot and make sure I’ve got everything I need for the following day."
        }
    ]
}