{
    "url": "https://socialcare.blog.gov.uk/2022/10/17/apprenticeship-power/",
    "title": "Apprenticeship power",
    "authors": [
        "Suzanne Smith"
    ],
    "categories": [
        "Care and support",
        "Mental health",
        "Workforce"
    ],
    "pub_date": "2022-10-17T15:35:05+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Never underestimate the value of social care apprenticeships"
        },
        {
            "text": "As Apprenticeship Manager for care provider, Cygnet Health Care, I have seen the truth of this statement first hand. We recently celebrated our first ‘home grown’ cohort of nurses to qualify as Registered Mental Health Nurses, through our apprenticeship pathway and I am so proud of them."
        },
        {
            "text": "The Cygnet Health Care Nursing Pathway Apprentice Programme addresses an industry-wide shortage of nurses, as recruitment and retention of staff remains a major concern for the sector."
        },
        {
            "text": "21 different pathways have been offered since our apprenticeship programme began and we’re looking to increase our portfolio to include more. We also offer more than 850 apprenticeship opportunities and have seen many applicants earn promotions and progress within the organisation."
        },
        {
            "text": "We wanted to offer a complete apprenticeship route to help colleagues progress from support worker, nursing associate, student nurse, all the way to registered mental health nurse. Not only would this help us recruit and retain high quality staff at a time of national shortage, it would also provide an amazing opportunity for colleagues to thrive, progress and diversify within their careers."
        },
        {
            "text": "Our staff know we actively support career progression, giving them the power and tools to forge their own path and take every opportunity to grow in skills and experience along the way."
        },
        {
            "heading": 2,
            "text": "Boosting our specialisms"
        },
        {
            "text": "Our employment of nurse associates, and the development of nurse apprenticeships, are helping us overcome the challenges of providing high quality care for people living with these conditions."
        },
        {
            "text": "Staff can take two apprenticeship pathways to become a nurse associate. Upon completion of the two-year course, the participants can take a final tier to continue studying and working for a further 18 months to become registered nurses."
        },
        {
            "text": "Three members of staff have become the first registered mental health Nurses as a result of this pathway, with a further 19 expected to qualify by 2023. To date, we have offered 125 staff the opportunity to become nurse associates or nurses."
        },
        {
            "text": "The passion and drive to succeed exhibited by our apprentices has been awe inspiring. They have flowered and grown and now we have our first registered nurses in post as a result of this programme. I couldn’t be prouder to see them take their places in our services, using their expertise and skills to support our service users."
        },
        {
            "heading": 2,
            "text": "Meet Chris Longshaw"
        },
        {
            "text": "Chris Longshaw is one of our nurses who graduated through the apprenticeship pathway. He started working at Cygnet St Augustine’s, a specialist high dependency inpatient rehabilitation for men in Staffordshire, several years ago as a Support Worker."
        },
        {
            "text": "With our support, Chris began his apprenticeship programme to become a Nurse Associate in April 2018 with the University of Wolverhampton."
        },
        {
            "text": "The training was free to apprentices because Cygnet Health Care funded the programme through a levy, introduced by the Government in 2017. Not placing financial burdens on participants demonstrates our commitment to this programme and to the career aspirations of our staff."
        },
        {
            "text": "Despite the pandemic, we have continued to support apprentices through the most challenging of times. Seeing qualified Registered Nurses come through the pathway successfully can only be good for them, for our business and for all those working in or receiving care services. Everybody wins."
        }
    ]
}