{
    "url": "https://rpc.blog.gov.uk/2022/10/17/house-of-lords-committee-report-on-government-impact-assessments/",
    "title": "House of Lords committee report on Government impact assessments",
    "authors": [
        "Stephen Gibson"
    ],
    "categories": [
        "Better regulation",
        "Evaluation",
        "Independent scrutiny"
    ],
    "pub_date": "2022-10-17T18:54:55+01:00",
    "content": [
        {
            "text": "Stephen Gibson (RPC Chair) and Andrew Williams-Fry (RPC Member) gave evidence to the House of Lords Secondary Legislation Scrutiny Committee (SLSC) for its inquiry into the Government’s use of regulatory impact assessments (IAs)."
        },
        {
            "text": "The committee’s final report Losing Impact: Why the Government’s impact assessment system is failing Parliament and the public makes eleven recommendations for improvements."
        },
        {
            "text": "The RPC welcomes the report and recommendations, which align with our evidence to the committee and our contributions to the Government’s review of the Better Regulation Framework."
        },
        {
            "heading": 2,
            "text": "Retaining independent scrutiny of IAs at final stage"
        },
        {
            "text": "The SLSC recognise and support the value of independent scrutiny of IAs at the final stage of development of regulation to support ministerial decision-making and Parliamentary scrutiny – as they say: “If Parliament is to perform its critical function of holding the Government to account, it is of paramount importance that the two Houses are given compete and comprehensive information about the basis on which policy choices are made and the reasons why alternative options have been rejected.”"
        },
        {
            "text": "Independent RPC scrutiny has a significant impact on the quality of the IAs that are laid in Parliament. As we commented recently, the figures in our recent corporate report show that around 23% of final stage IAs are NOT fit-for-purpose as initially submitted and 56% have a WEAK or VERY WEAK quality rating implying inadequate support for decision-making. However following our scrutiny, only a handful have remained not fit-for-purpose. This demonstrates a real value added from independent scrutiny of Final Stage IAs and we are therefore pleased that the SLSC recommends that “Given the improvements to IAs by RPC scrutiny it may be premature to remove validation from Final Stage IAs as the BRE review proposes”. This recommendation is echoed by business and civil society organisations in the value they attach to independent scrutiny of Final Stage IAs."
        },
        {
            "heading": 2,
            "text": "Better enforcement of the better regulation system"
        },
        {
            "text": "We also support the committee’s recommendation that the Government should enforce the Better Regulation Framework. As the SLSC point out, IAs and RPC opinions are meant to be produced in time to inform both ministerial decisions and parliamentary scrutiny. As Stephen and Andrew reported in their evidence, we are seeing too many cases where IAs are being submitted after ministerial and parliamentary decisions have been made."
        },
        {
            "text": "We hope the Government will accept these recommendations in the design of the new Better Regulation Framework."
        },
        {
            "heading": 2,
            "text": "Recommendation for the RPC to publish all opinions on Final Stage IAs as soon as they are ready"
        },
        {
            "text": "The SLSC challenged the RPC to be bolder in the publication of our opinions, even if the department delays the publication of the IA, so that Parliament can always have access to the RPC’s assessment when it starts its scrutiny. They also recommend that we do more to communicate to Parliament when an IA has been ‘red-rated’."
        },
        {
            "text": "We recognise the value of our opinions to Parliament and the wider stakeholder community. We would certainly prefer that both the IA and the RPC opinion are published together and before the relevant Bill or Statutory Instrument is introduced to Parliament. Clearly, the Government should announce its own policies, rather than the RPC, through our opinions; but after the legislation is introduced to Parliament, we will consider publishing our opinions even in the absence of the associated IA. We also want to do more to highlight red-rated IAs. We will formally respond to this recommendation following consultation with our stakeholders."
        }
    ]
}