{
    "url": "https://educationhub.blog.gov.uk/2022/10/17/how-we-are-supporting-families-who-chose-to-adopt/",
    "title": "How we are supporting families who chose to adopt",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Adoption"
    ],
    "pub_date": "2022-10-17T15:38:29+01:00",
    "content": [
        {
            "text": "People who decide to adopt are making a life changing decision, not only for themselves and their families but for the children they adopt. 70% of children leaving care through adoption have entered care due to abuse or neglect."
        },
        {
            "text": "We recognise that children leaving care into adoptive and special guardianship families are likely to have experienced trauma prior to coming into care and will need therapeutic support to help them and their new families thrive."
        },
        {
            "text": "That’s why we introduced the Adoption Support Fund in 2015 to help children who have experienced abuse and neglect to get the support they need."
        },
        {
            "text": "We’ve also invested a further £144 million into the Adoption Support Fund for the next 3 years, allowing us to provide all adopted children and their families with the support and guidance they need"
        },
        {
            "text": "Here’s what you need to know."
        },
        {
            "heading": 3,
            "text": "What is the Adoption Support Fund? "
        },
        {
            "text": "The Adoption Support Fund (ASF) helps to pay for essential therapy services for adoptive families and families whose children left care immediately prior to being cared for under a special guardianship order."
        },
        {
            "text": "It aims to reduce the gap between these families needing therapeutic services and receiving them and ultimately to improve the outcomes for young people and families."
        },
        {
            "text": "The ASF has provided nearly £275m, supporting around 40,000 children across England since May 2015."
        },
        {
            "heading": 3,
            "text": "Who can get support from Adoption Support Fund? "
        },
        {
            "text": "To be eligible for funding, the appropriate local authority or regional adoption agency must apply to the ASF within 3 months of assessing a family’s support needs."
        },
        {
            "heading": 3,
            "text": "What therapy can the fund be used for? "
        },
        {
            "text": "A wide range of therapeutic support has been accessed including creative therapies and multi-disciplinary packages."
        },
        {
            "text": "The kind of support most ‎frequently provided are therapeutic parenting, psychotherapy, and creative therapies."
        },
        {
            "heading": 3,
            "text": "Where can I find out more about the ASF and adoption in general? "
        },
        {
            "text": "For more information on the ASF and other issues relating to adoption you can visit the first4adoption or Adoption UK websites."
        }
    ]
}