{
    "url": "https://ipa.blog.gov.uk/2022/10/17/marking-black-history-month-in-project-delivery-we-need-to-recruit-against-stereotypes/",
    "title": "Marking Black History Month in project delivery: “We need to recruit against stereotypes.”",
    "authors": [
        "jaychauhan",
        "Lorraine Thomas"
    ],
    "categories": [
        "Project Delivery Profession"
    ],
    "pub_date": "2022-10-17T08:58:02+01:00",
    "content": [
        {
            "text": "Lorraine Thomas is Head of Risk & Benefits at BEIS and has been in the role for six months after roles in both the public and private sectors. Her portfolio is one of the largest and most diverse in government, covering vaccine manufacture and Domestic Energy Support Schemes. "
        },
        {
            "text": "Career to date"
        },
        {
            "text": "I have worked in and out of the civil service for years, so getting to where I am now was a conscious decision. I enjoy the fluidity of working in project delivery in the civil service, and the opportunity to deliver on some of the country’s biggest challenges. It also helps that bringing learning from other environments and experiences is welcomed as part of a general commitment to diversity."
        },
        {
            "text": "Black representation in project delivery"
        },
        {
            "text": "Things have improved in terms of Black representation in project delivery, but it is still slow in terms of progression. There undoubtedly remain barriers which manifest in different ways in different organisations, so understanding exactly what they are and removing them is the challenge we must honestly address. There is also a bit of a pattern in the public sector where a relatively high proportion of Black and other ethnic minority project professionals leave to pursue their careers as freelance contractors. "
        },
        {
            "text": "Improving diversity and inclusion"
        },
        {
            "text": "To improve diversity in the project profession, we need to recruit against stereotypes. Even in 2022, I have been on panels where people have said “…he looks like a project manager”, whilst I am sitting there guessing I do not! We cannot relax and think we’ve got it right, we have to ensure the right people are recruiting to clear standards and encourage potential applicants through allyship, and sponsorship. In government, the profession has serious resourcing challenges, so it is in all our interest to help build a more resilient, diverse profession. "
        },
        {
            "text": "Having strong career networks is one way of doing that, so I am excited that the Project Inclusion Network will shortly launch. This will provide an important forum for learning from each other across the diversity characteristics. Working together in this way will help make project delivery the best career choice for everyone. The network is in its infancy but has so much potential for learning from and supporting each other as allies, sponsors, and collaborators. It will not replace any of the valuable staff networks, it is very much profession-focused and allows us to bring our capabilities to building a brilliant profession for all. "
        },
        {
            "text": "Reflecting on Black History Month "
        },
        {
            "text": "On a personal level, it is the time of year that I reconnect, learn, and reflect on the challenges still ahead. So at the moment, my thoughts have turned to how we need to be bolder in taking action to encourage and keep Black and other minority groups in the profession. This can be done by acting as sponsors and mentors, showing up and supporting. The theme of Black History Month 2022 fits with the project delivery profession ‘Time for Change – Actions not Words’. It speaks to me and hopefully those who are looking for a great profession that offers fantastic opportunities in an increasingly diverse environment. "
        }
    ]
}