{
    "url": "https://dwpdigital.blog.gov.uk/2022/10/17/menopause-awareness-day-2022-lisas-story/",
    "title": "Menopause Awareness Day 2022: Lisa's story",
    "authors": [
        "Lisa Payne, product manager, DWP Digital"
    ],
    "categories": [
        "Digital Voices",
        "Product Manager",
        "Wellbeing",
        "Women in Digital",
        "Women in Technology"
    ],
    "pub_date": "2022-10-17T17:02:36+01:00",
    "content": [
        {
            "text": "Tuesday 18 October marks Menopause Awareness Day in the UK and this years’ theme focuses on brain fog and memory loss in menopause. We sat down with Lisa Payne a product manager at DWP Digital to talk about the affect brain fog and memory loss has had on her.  "
        },
        {
            "heading": 2,
            "text": "Lisa’s story "
        },
        {
            "text": "I joined DWP in 1990 and have been in the organisation for more than 30 years in a range of different roles and locations. I joined DWP Digital about 6 years ago. In my latest role I am a product manager within the Shared Channels Experience team working on cross cutting services that are all about joining up the customer experience.  "
        },
        {
            "text": "I first started to notice signs of brain fog and memory loss about five years ago. My mum had just been diagnosed with Alzheimer's and I was caring for her and I noticed that I was just forgetting stuff all the time. People would tell me things or even in social situations where people would tell me about their kids and I just couldn't remember their kids names. And so at that point, I genuinely thought my mum's got Alzheimer's and I think I'm getting Alzheimer's too. "
        },
        {
            "heading": 2,
            "text": "Understanding what menopause meant for me "
        },
        {
            "text": "I didn't really think it was anything to do with the menopause because to me, menopause was just hot flushes. A colleague at the time bravely hosted a talk about the menopause to a group of women in DWP Digital and I realised that a lot of what I was experiencing were menopause symptoms.  "
        },
        {
            "text": "It all just became overwhelming. There was a lot going on in my life at the time and I just felt like I couldn't cope with it all. I felt like at work I was losing credibility. Nobody said this to me. Nobody made me feel uncomfortable. I just felt it myself because I could not go anywhere without a notepad. As soon as someone spoke to me, I had to write it down. I had my own tricks for coping at work but after reaching out to a colleague I’d spoken to in the office one day, I decided to start doing some research and reach out for help. "
        },
        {
            "heading": 2,
            "text": "Accessing support in the workplace "
        },
        {
            "text": "I recently went for an internal interview, and I was worried that my brain fog would hinder my chances of getting the role. I asked for amendments to the interview to aid me in remembering the questions I was being asked. The recruitment panel were extremely supportive and the questions for the interview were added to the teams chat.  "
        },
        {
            "text": "My line manager and the Women in Digital network have both been extremely helpful in supporting me and listening. I think the hardest thing is asking for help. I’ve found it reassuring that nobody thinks that you're stupid and nobody thinks that you should just get on with it. It just sometimes takes a lot of courage to say I'm struggling with this thing and it's because of the menopause. "
        },
        {
            "text": "Before I didn’t want to talk about the menopause because I felt ashamed and old but after hearing other women in DWP Digital talk about their experiences, I decided to join the conversation becoming a Digital Voice and being part of the wider Women in Digital network.  "
        },
        {
            "heading": 2,
            "text": "Building a community "
        },
        {
            "text": "I am part of the Menopause Network at DWP. Since it began the network has presented to over 10,000 colleagues in menopause cafes, All Staff calls and various sessions held across Directorates.  "
        },
        {
            "text": "DWP now has 160 Menopause Ambassadors, and counting, who provide invaluable help to their colleagues locally by signposting to various resources that support colleagues experiencing menopausal symptoms and their line managers. "
        },
        {
            "text": "Alongside the Menopause Network, DWP Digital have recently launched a Menopause Policy. The policy is intended to raise awareness of menopause amongst all employees and managers, helping to promote and create a fully inclusive organisational environment that is supportive of all employees affected by the menopause. "
        }
    ]
}