{
    "url": "https://ofsi.blog.gov.uk/2022/10/17/ofac-ofsi-enhanced-partnership/",
    "title": "OFAC-OFSI Enhanced Partnership",
    "authors": [
        "OFSI"
    ],
    "categories": [
        "Financial sanctions",
        "Implementation",
        "OFAC",
        "UK"
    ],
    "pub_date": "2022-10-17T15:58:19+01:00",
    "content": [
        {
            "text": "As Directors of two of the world’s leading financial sanctions implementation authorities, we are committed to our close working relationship. As a testament to this ongoing commitment, on Thursday, 13 October, OFAC and OFSI concluded a multi-day technical exchange in London between our two offices. This will bring significant benefits to both our organisations and reinforce our coordination and collaboration in the years to come."
        },
        {
            "text": "OFAC and OFSI have much in common and therefore significant ground for advancing our collaboration to a new level. The two units are amongst the largest in the world, with similar corresponding functions and tools, such as the ability to issue general licences and civil monetary penalties with comparable legal thresholds. As such, we have decided to deepen OFSI-OFAC co-operation further, to enhance both our own capabilities and the support we provide to those at the forefront of effective sanctions implementation. Doing so will further build on the aims of the U.S. Department of the Treasury’s 2021 Sanctions Review, and support OFSI’s move to a larger and more proactive organisation."
        },
        {
            "text": "In practice, this means that over the coming months, OFAC and OFSI officials working on implementation and enforcement will be further exchanging best practices and strengthening working relationships at all levels. We will identify opportunities to pool expertise, to think creatively about the challenges we face, to explore opportunities to align the way we implement sanctions, and to assist our stakeholders either through joint products or by providing guidance resulting from collaboration behind the scenes. The beginnings of this work are already underway, as OFAC and OFSI work together to develop approaches to address shared priorities like cyber threats and the misuse of virtual assets, improving information sharing, and ensuring that our sanctions do not prevent humanitarian trade and assistance from reaching those in need."
        },
        {
            "text": "This year, together with allies and partners, the United States and the United Kingdom have imposed unprecedented costs on Russia in response to the Kremlin’s unprovoked, premeditated war against Ukraine. Owing to the efforts of governments, industry, and other stakeholders who are at the forefront of implementing these sanctions, we know that these efforts are having a material impact on the Russian economy. Putin himself has acknowledged the “problems and difficulties” caused by sanctions, and we have had a significant impact on Russia’s military-industrial complex and its ability to wage its unjust war."
        },
        {
            "text": "Financial sanctions will continue to be a vital tool in supporting the United States’ and United Kingdom’s respective foreign policy and national security aims. They also help to protect the integrity of our financial systems as part of wider efforts to tackle corruption, kleptocracy, and other forms of economic crime."
        },
        {
            "text": "Financial sanctions work best when implemented multilaterally. This maximises their impact, minimises unintended consequences, and eases the burden of compliance for business. Throughout the current crisis, the United Kingdom and United States have made efforts to design, communicate, and implement new sanctions in close coordination with each other as well as with other key allies and partners."
        },
        {
            "text": "But we also recognise that the growing scale of sanctions has increased the complexities of their implementation. The commitment and willingness of stakeholders to constructively engage with us has been very welcome. We will of course continue, in close co-ordination with one another, to assist stakeholders via our outreach, by maintaining and updating sanctions-related products to provide useful information and guidance, and by making timely decisions regarding licences. This year alone, in administering Russia-related sanctions, OFAC has issued over 100 Frequently Asked Questions, two humanitarian-related fact sheets, over 2,000 responses to specific license and interpretive guidance requests, and over 50 General Licenses, and engages regularly with stakeholders including private sector entities, financial institutions, and non-government organizations. Meanwhile, OFSI has updated its Russia, Monetary Penalty and General guidance, engaged extensively with industry through webinars, round-tables and bespoke meetings, issued over 30 General Licences, and is increasing its resource to over 100 staff members by the end of the financial year."
        },
        {
            "text": "Over time, we expect to realize the benefits of our collaboration not only in relation to the sanctions imposed in response to Russia’s invasion of Ukraine, but also across other common sanctions regimes. The United Kingdom and the United States have enjoyed a special relationship for many decades, and our collaboration with respect to economic sanctions is no exception. Our common values and combined role in the global financial system make our partnership incredibly potent. And as we embark on this new chapter, we will of course continue to seek and welcome opportunities to work closely with additional allies and partners around the world to ensure that sanctions make the fullest contribution to the policy aims they seek to achieve."
        },
        {
            "text": " "
        },
        {
            "text": "Andrea Gacki, Director, Office of Foreign Assets Control, U.S. Department of the Treasury"
        },
        {
            "text": "Giles Thomson, Director, The Office of Financial Sanctions Implementation, HM Treasury"
        }
    ]
}