{
    "url": "https://naturalengland.blog.gov.uk/2022/10/17/reflections-on-a-summer-festival-of-national-nature-reserves/",
    "title": "Reflections on a Summer Festival of National Nature Reserves",
    "authors": [
        "Oliver Harmar"
    ],
    "categories": [
        "National Nature Reserve",
        "Natural England",
        "Parks, trails and nature reserves"
    ],
    "pub_date": "2022-10-17T17:05:37+01:00",
    "content": [
        {
            "text": "By Oliver Harmar, Chief Operating Officer, Natural England"
        },
        {
            "text": "Twelve months ago, I was lucky enough to be standing overlooking the fabulous wetlands of the Flashes of Wigan and Leigh, listening to the inspirational words of Clare Shaw, a local poet:"
        },
        {
            "text": " "
        },
        {
            "text": "Because this is a story and you are in it"
        },
        {
            "text": "Perhaps you’re a wall, stone-silent, perhaps you’re a ranger."
        },
        {
            "text": "You might suddenly appear as a hare."
        },
        {
            "text": "Your part could be small but it could be pivotal"
        },
        {
            "text": "Maybe you are a rare insect, a bird."
        },
        {
            "text": "Maybe someone will save you, perhaps you are a treasure, or spider –"
        },
        {
            "text": "Perhaps you are peat.  Maybe you have been exploited"
        },
        {
            "text": "Perhaps you will be restored."
        },
        {
            "text": " "
        },
        {
            "text": "Words that, for me, capture the very essence of the 220 National Nature Reserves (NNR’s) across the country, special places for nature, and each with their own story that celebrate our heritage, our communities, and everything that nature does for us."
        },
        {
            "text": "Fast forward to today and we’ve been holding 70th anniversary celebrations since the first NNR was declared in 1952.  Indeed, as part of those celebrations, I am so pleased that alongside over 70 partners and members of the local community, we have just declared The Flashes of Wigan and Leigh as our newest NNR.  It is a celebration of the incredible transformation of what was once a centre for coalmining into a wetland landscape thriving with life.  A fantastic “jewel in the crown” of the north west."
        },
        {
            "text": "It was back in 1952 that 7 NNRs were first declared in England. These were products of the Nature Reserve Investigations Committee in 1941 & 1942.  Simply remarkable to think that even through a time of war, the importance of nature was understood, laying a legacy for future generations."
        },
        {
            "text": "In the early 1950s, Max Nicholson, a pioneering leader in Nature Conservancy (and indeed Nature Recovery) took this a stage further by describing the importance of science and particularly ecology, to bridging the gap between human needs and the health of the environment."
        },
        {
            "text": "In the 70 years since then, NNRs have evolved from places for ‘preservation’ and as ‘outdoor laboratories’ into a vital piece of the developing national Nature Recovery Network, aiming for recovery that is bigger, better and more connected than ever before.  Indeed, it is great to see that land declared as NNR has increased by 12% in the past 3 years alone."
        },
        {
            "text": "This is so important because we know that nature faces major challenges.  Together, our NNRs can catalyse positive change for nature to thrive once again across the wider landscape, in essence our “North Star” for Nature Recovery.  This means demonstrating what is possible if we think big around a national Nature Recovery Network and value NNRs as centres for pioneering science and learning, and crucially use their stories to inspire a nation of nature champions."
        },
        {
            "text": "To celebrate, we’ve held 220 NNR events this year with partner organisations, communities, and many volunteers.  In the north west there have been lots of inspiring arts based events including the ‘Once Upon a Planet’ exhibition at Tullie House Museum and Gallery in Carlisle, developed alongside partners, local artists and young people to raise awareness of climate change, citizenship, and Cumbria’s rich biodiversity."
        },
        {
            "text": "We’ve offered new ways to experience our geological heritage, including an event linking Barnack Hills and Holes NNR to Peterborough Cathedral exploring the 800 year connection between these two places.  We’ve also been celebrated our NNRs after dark, with bat nights at the Stiperstones and at Castle Eden Dene, creatures of the night walks at Burnham Beeches, and even a 24 hour ‘bioblitz’ at Ham Street Woods NNR in Kent.  National Nature Reserves are such fabulous places to unlock many hidden secrets and experience nature in different ways."
        },
        {
            "text": "The passion and drive we have seen throughout the festival will be critical as we start the next 70 years, and there is no let up in ambition. With the help of our partners and fantastic volunteers, our NNRs will tackle the big twin challenges of our time: nature recovery and climate change.  In doing so, they will enhance the many benefits for us – our enjoyment, our health and wellbeing, our understanding of the natural world, and benefits to the local economy."
        },
        {
            "text": "Many of our NNRs are at the heart of even larger scale collaborative Nature Recovery Projects (NRPs) – designed to recover nature beyond protected sites to restore entire ecosystems. Looking ahead, Defra and Natural England are investing over £2.4million in 12 landscape-scale NRPs across the country.  These will all large partnerships, focussing on delivering nature recovery and resilience to climate change, enabling wildlife to recover and thrive, and improving livelihoods and local economies.  At their heart, they will provide natural solutions to reduce carbon emissions, manage flood risk and enable people to enjoy and connect with nature where they live, work and play."
        },
        {
            "text": "There is still time to enjoy the festival programme, with more events taking place through to the end of October- you can find out more at www.NNRfestival.com."
        },
        {
            "text": "I want to end by paying special thanks to those early pioneers who’s shoulders we all still stand on, and to our army of pioneers today who are looking after our NNRs, and building for future generations."
        }
    ]
}