{
    "url": "https://educationhub.blog.gov.uk/2023/08/09/4-myths-about-university-places-busted/",
    "title": "4 myths about university places busted",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Exams and qualifications"
    ],
    "pub_date": "2023-08-09T15:24:21+01:00",
    "content": [
        {
            "text": "It’s nearly that time of year again when thousands of students find out whether they’ve been accepted into their top choice university to study for a degree."
        },
        {
            "text": "With grading returning to how it was before the pandemic, there has been speculation around what it means for university places."
        },
        {
            "text": "As students await their results, we bust some of the myths around university places, from availability to competition."
        },
        {
            "heading": 3,
            "text": "Myth: Thousands of students will miss out on university this year if fewer top grades are awarded"
        },
        {
            "text": "False. The number of top grades awarded has no bearing on the number of university places available."
        },
        {
            "text": "Universities are independent from government and decide their own business models. This means they set the number of spaces available, entry requirements, staff recruitment and pay."
        },
        {
            "text": "Exams and grading return to normal this year with protection in built to recognise the impact of the pandemic."
        },
        {
            "text": "This means students will be just as likely to achieve a particular grade this year as they would have been before the pandemic."
        },
        {
            "text": "Grades are determined by the number of marks achieved in your assessments."
        },
        {
            "text": "Grades are expected to be in line with pre-pandemic results, so they will be lower than last year, but universities have made sure that the way they set entry requirements and made offers reflects this."
        },
        {
            "heading": 3,
            "text": "Myth: A return to pre-pandemic grading means there are fewer university places available this year"
        },
        {
            "text": "False. While it is true that grades are expected to be lower this year as grading returns to pre-pandemic levels, this doesn’t have an impact on the number of university places available. There will be plenty of high-quality options for students and grading arrangements will not affect this."
        },
        {
            "text": "We have been working with the exams regulator, Ofqual to communicate with schools, colleges and universities as part of this year’s grading plans."
        },
        {
            "text": "They are all aware that grades may be lower, and universities have made offers in line with the return to pre-pandemic grading."
        },
        {
            "heading": 3,
            "text": "Myth: The majority of Russell Group university places are given to international students"
        },
        {
            "text": "False. Home students make up over three-quarters of undergraduates who go on to study at a Russell Group university. Meanwhile, the percentage of international undergraduate entrants has declined since the academic year 2019/20."
        },
        {
            "text": "In fact, international students made up just 15 percent of all undergraduate entrants at UK universities in 2021/22."
        },
        {
            "text": "International students make a significant contribution to the UK’s higher education sector, from providing significant economic growth to expertise for our international research."
        },
        {
            "text": "Allowing foreign nationals to study in the UK helps to increase the nation’s ‘soft-power’ around the world. Did you know, 55 of the world's current and recent leaders were educated here?"
        },
        {
            "text": "It’s for all of these overwhelmingly positive reasons that we want to encourage the brightest students from around the world to study in the UK."
        },
        {
            "heading": 3,
            "text": "Myth: Competition for university places is tougher this year"
        },
        {
            "text": "It has always been the case that there is stiffer competition for the most selective universities. It’s also worth remembering that universities set their own entry requirements."
        },
        {
            "text": "Students can feel confident that getting into higher education is a fair process this year, as it is every year. Universities have made sure the way they set entry requirements and make offers to students reflects the grades students receive this summer."
        },
        {
            "text": "In any year, it’s not uncommon for people to miss out on their predicted grades but a significant portion of these students will still go on to study at higher education."
        },
        {
            "text": "If this happens to you, don’t worry there are plenty of alternative, exciting options. You can find some great tips in our results day post here."
        },
        {
            "text": "For example, you may be able to apply for a similar course at a different university – or a different course altogether – by going through clearing."
        },
        {
            "text": "Alternatively, you could consider a high-level apprenticeship where you can study for a degree alongside earning a wage, for example, in nursing, engineering, law and science."
        },
        {
            "text": "The first ever NHS doctor apprenticeship will also start from September 2024, and we’ve just announced a brand-new degree apprenticeship in space systems engineering also launching next year."
        },
        {
            "text": "If you’re not sure about your next steps, you can speak to a National Careers Service adviser to talk through your options."
        }
    ]
}