{
    "url": "https://supportingfamilies.blog.gov.uk/2023/08/09/birmingham-children-trust-working-with-barnardos-providing-an-early-help-autism-service-offer/",
    "title": "Birmingham Children Trust working with Barnardo’s providing an Early help Autism Service Offer",
    "authors": [
        "ballypahal"
    ],
    "categories": [
        "Data Sharing",
        "Early Help",
        "Education",
        "Evaluation",
        "Health",
        "Multidisciplinary Teams",
        "News",
        "Reducing Parental Conflict",
        "Transformation"
    ],
    "pub_date": "2023-08-09T14:43:53+01:00",
    "content": [
        {
            "text": "The Barnardo’s Early Help Autism Service provides a joint working model within the Birmingham Children’s Trust. The service provides direct interventions to children and young people with autism and their families. The specialist interventions are specifically related to support with the child’s autism. This also includes upskilling practitioners within the Early Help service, as well as offering advice, guidance, and training on autism, enabling practitioners to respond effectively to families. "
        },
        {
            "text": "By working alongside families in this way, the service has been helping families to understand both the communication and sensory needs of their autistic child more clearly. Through being supported with accessible information and good practice guidance around autism, families are given the knowledge and the skills they need to help foster a more inclusive and empathic environment for their children. The service is quite unique in that they are supporting families while they are waiting for their diagnosis as they identified this as a gap in service and often the process can be quite lengthy.   "
        },
        {
            "text": "One parent who attended the Cygnet programme (a parenting support programme for parents and carers of autistic children and young people aged 5-18) found it beneficial in terms of awareness and understanding her son’s needs. As a result, she has shared “I have been able to implement strategies that have consequently improved my son’s behaviour, attitude and happiness, resulting in less anxiety, frustration and meltdowns”.  Also added that “Jessica’s (the early help autism worker) delivery was exceptional”, and she really appreciated the worker’s time in answering questions, supporting with queries and just generally being highly supportive. "
        },
        {
            "text": "The parent had been experiencing issues with the process of moving her son into specialist provision and even though it was outside of her remit; but she said that “Jessica has been invaluable and offered me some good advice as well as tools and approaches that have assisted in me being able to move the process forward”. "
        },
        {
            "text": "Another parent fed back: ‘It has really opened my eyes and helped me realise my son isn’t doing things on purpose. Julie (early help autism worker) helped my daughter understand her brother’s behaviours. Julie was so kind, compassionate, understanding, patient and professional I can’t thank her enough for her support’. "
        },
        {
            "text": "Set out below are the objectives, performance, and targets of the service. "
        },
        {
            "text": "Birmingham Children’s Trust Early Help Autism Service Objectives:\n "
        },
        {
            "text": "1.Work Collaboratively Together with Early Help workers, deliver on the actions of the family’s Early Help plan, with a specific focus on autism.  "
        },
        {
            "text": "2 Prevention Support families with an autistic child at an early intervention and preventative level; ensuring their development and wellbeing are supported.  "
        },
        {
            "text": "3 Group Work To offer group work programmes to parents with autistic children. Direct face to face work with children/young people, siblings and their parent/carers is completed within the family home, schools, or community settings. Workers provide weekly sessions for a maximum of 12 weeks, unless agreed through the EHA. "
        },
        {
            "text": "4 Knowledge & Skills Support the development of knowledge and skills in the workforce on issues related to autistic children and their families.  "
        },
        {
            "text": "5 Guidance Support the Early Help service with engaging families in early intervention and preventative work, offering good practice guidance related to autism. "
        },
        {
            "text": "6 Advice Attend EH meetings to support with advice and guidance on cases that are coming into the localities and provide specialist advice where autism is a need. "
        },
        {
            "text": " "
        },
        {
            "text": "Early Help Service Performance (Nov 2021- Sept 2022) "
        },
        {
            "text": "Future Targets: "
        },
        {
            "text": "Conclusion:  "
        },
        {
            "text": "By working alongside the families of children with autism, the Early Help Autism Service is aiming to empower parents, by giving them the access they need to specialist knowledge and skills around autism. As they become more able to understand and meet the needs of their autistic child, this in turn improves the mental and emotional wellbeing of the family. "
        }
    ]
}