{
    "url": "https://dluhcdigital.blog.gov.uk/2023/08/09/join-the-spatial-data-unit-and-make-exciting-things-happen/",
    "title": "Join the Spatial Data Unit and make exciting things happen",
    "authors": [
        "Fiona Clowes"
    ],
    "categories": [
        "Data",
        "DDAT Careers"
    ],
    "pub_date": "2023-08-09T13:48:52+01:00",
    "content": [
        {
            "text": "Hi, I’m Fiona, Head of Data Capability and Infrastructure for the Spatial Data Unit at the Department for Levelling Up, Housing and Communities (DLUHC).  "
        },
        {
            "text": "Now is an exciting time to be joining DLUHC. Data is at the heart of the Levelling Up agenda and we are passionate about using data innovatively to help create opportunities for everyone across the UK. "
        },
        {
            "text": "In this post, I’ll share more about what our team does, how we work and the opportunities on offer. "
        },
        {
            "heading": 3,
            "text": "What is the Spatial Data Unit?"
        },
        {
            "text": "Established 12 months ago, the Spatial Data Unit (SDU) supports place-based decision-making and Levelling Up delivery through better local data, new data tooling and insights, and innovative modelling. "
        },
        {
            "text": "With a vision to drive forward data transformation in government and the department, our team is working to continuously improve the delivery of better data, and expand data capability and data science expertise to enable innovative and rapid place-based insight, visualisation, prototyping and modelling in order to help shape and monitor policy outcomes.  "
        },
        {
            "text": "We want to empower users to self-serve data and analysis outputs. We are deploying new cloud capability and exploring interesting new technology and techniques. This will help us realise a Civil Service reform ambition, ensuring DLUHC can harness the power of data, digital and technology to make better decisions, improve service delivery and enhance user experience. "
        },
        {
            "heading": 3,
            "text": "Join the team"
        },
        {
            "text": "Building on a foundation of analytical capability, we are expanding expertise across data disciplines including data engineering, data architecture, data science, data management and geospatial to empower policy and decision makers. "
        },
        {
            "text": "We have new opportunities to join our team in the following roles:"
        },
        {
            "text": "Data Architect"
        },
        {
            "text": "Data Governance Manager"
        },
        {
            "text": "Senior Data Engineer"
        },
        {
            "heading": 3,
            "text": "How we work"
        },
        {
            "text": "The SDU is still new and there is immense energy, creativity and passion to make a difference with data. "
        },
        {
            "text": "We are an agile team of enthusiastic and highly-skilled data and digital specialists geographically dispersed across the UK. "
        },
        {
            "text": "Hybrid working gives us the flexibility to meet in the office or collaborate online wherever we are in the country. Many of us have flexible working patterns to achieve a healthy work/life balance and accommodate commitments outside of work. "
        },
        {
            "text": "Data expertise is embedded across teams at DLUHC to ensure it remains closely aligned with delivery. The SDU is a good example of this working in practice. We work collaboratively with policy makers, digital colleagues and external partners, forming multi-disciplinary teams to deliver a wide range of interesting work, ensure data is used effectively for public good and continuously improve what we do. "
        },
        {
            "text": "We value each opinion and understand that we need a diverse range of skills and viewpoints to ensure we represent the communities we serve.  "
        },
        {
            "text": "There are plenty of opportunities to try out ideas and explore new techniques to help change the role of data in decision-making. "
        },
        {
            "heading": 3,
            "text": "Our tools and technology "
        },
        {
            "text": "The world of data moves fast. The SDU keeps pace through the adoption of new data tooling and techniques. "
        },
        {
            "text": "We use a wide range of out of the box and open technology and products. Alongside technology trends, we are always keen to explore new avenues, from data analytics and machine learning that find potential opportunities or correlations that were previously unquantified to designing innovative, interactive data visualisations. "
        },
        {
            "text": "We have an extensive programme of data delivery and improvement to achieve, and the team has a wide range of skills and expertise from Python programming to data pipelining, from geospatial analysis to delivering a data strategy.  "
        },
        {
            "heading": 3,
            "text": "Learning and progression "
        },
        {
            "text": "Every day provides an opportunity to learn something new! DLUHC is a fascinating organisation at the heart of the UK government working on high profile projects supporting people, places and communities. "
        },
        {
            "text": "In addition to regular opportunities to share knowledge with colleagues and join show and tell sessions, DLUHC has an extensive programme of training available to everyone through the learning hub. "
        },
        {
            "text": "We are also developing a tailored training offering to support the different data career pathways through the Digital, Data and Technology (DDaT) Profession Capability Framework. In addition, there are opportunities to work across government to share knowledge and expertise with the wider public sector data and analytics community.  "
        },
        {
            "text": "There is something for everyone wherever you are and wherever you want to be in your career."
        },
        {
            "text": "This combined with regular conversations about personal development and career direction helps to ensure each of us has a chance to reach our full potential. "
        },
        {
            "text": "I believe in the motto ‘be the change you wish to see’. For me, every day at work is a chance to fulfil that aspiration and make exciting things happen."
        },
        {
            "text": "Find out more about all our vacancies on our job portal."
        },
        {
            "text": "Don't forget to subscribe to this blog for the latest updates from the team. "
        }
    ]
}