{
    "url": "https://cyberandspecialistoperationscommand.blog.gov.uk/2023/08/09/pte-salmon-achieves-best-student-award/",
    "title": "Pte Salmon achieves Best Student award",
    "authors": [
        "blythevictor"
    ],
    "categories": [
        "Careers",
        "Gibraltar",
        "Overseas Bases",
        "Training"
    ],
    "pub_date": "2023-08-09T12:03:00+01:00",
    "content": [
        {
            "text": "Private Dominic Salmon, a Class 3 Chef in the Junior Ranks Mess, recently completed his introductory training as a chef and received the Best Student award. A 14-week course called \"Chef Class 3\" included an eight-week kitchen component where he acquired a variety of technical skills like butchery, pastry, vegetables, sauces, and seafood."
        },
        {
            "text": "Week 4 was test week, during which the chefs demonstrated their knowledge of the material and produced meals to a high standard."
        },
        {
            "text": "Pte Salmon chose his menu and managed the tasks with a team of chefs, providing a 3-course dinner within a week in a real work environment. After completing the kitchen phase, he moved on to the field phase, where Pte Salmon gained skills like putting up an Operational Food Catering System and working in an operational environment."
        },
        {
            "text": "During this phase, which lasted for five weeks with one week devoted to exercise, he learned how to set up a 12-by-12-foot tent with a camouflage net, discovered the various components of a fully functional cook set, and then cooked and served a three-course meal in the field using fresh rations and 10-man ration packs."
        },
        {
            "text": "Once on exercise, although the instructors were there to assist, if necessary, Pte Salmon took the initiative and showed that he could excel with the duties at hand and exercise leadership from the lowest level."
        },
        {
            "text": "A soldier can be deployed to any unit worldwide to advance in their career when the field phase is finished, upon successful completion of their first training as a Class 3 Chef. They have a Production Apprenticeship to complete within a 2-year time frame. With several credentials available along the way, from fundamental cooking skills to management degrees, Pte Salmon's new position as a chef inside the Army presents avenues for him to advance his career.     "
        },
        {
            "text": "In addition to career advancement opportunities, Pte Salmon's new position also offers him the chance to develop valuable leadership skills. As he progresses through his training and apprenticeship, he will have the opportunity to take on supervisory roles and lead a team of fellow soldiers in the kitchen. This will not only enhance his culinary expertise but also prepare him for future leadership positions within the military."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}