{
    "url": "https://educationhub.blog.gov.uk/2023/08/09/teacher-recruitment-and-retention-how-were-helping-former-teachers-return-to-education/",
    "title": "Teacher recruitment and retention: How we’re helping former teachers return to education",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Teacher recruitment"
    ],
    "pub_date": "2023-08-09T12:36:02+01:00",
    "content": [
        {
            "text": "Schools in England now have more teachers than ever before, but we know there’s even more we can do to make sure we’re recruiting the best and brightest educators for our young people.  "
        },
        {
            "text": "Alongside other initiatives, encouraging former teachers to rejoin the profession is a key way to strengthen the teacher workforce – around 17,000 teachers return to the profession every year and make up around a third of all new teachers in the classroom."
        },
        {
            "text": " There are many reasons that ex-teachers re-enter the classroom, such as returning from parental leave, a career break, or time spent living abroad. "
        },
        {
            "text": "Here’s what you need to know about our returners policy. "
        },
        {
            "heading": 3,
            "text": "How are you encouraging former teachers to return to the classroom? "
        },
        {
            "text": "Former teachers who want to return to or stay in the profession can access one-to-one tailored support through our Return to Teaching Advisory (RTTA) service. "
        },
        {
            "text": "Prospective returner teachers are matched with a specialist advisor and given targeted support in working towards a successful application. This could include: "
        },
        {
            "text": "Returners can also access courses to improve subject knowledge and teaching practices, such as National Professional Qualifications (NPQs) and useful resources such as the Early Career Framework (ECF).  "
        },
        {
            "heading": 3,
            "text": "Who is eligible to use the RTTA? "
        },
        {
            "text": "This service is open to: "
        },
        {
            "heading": 3,
            "text": "What else are you doing to improve teacher recruitment?  "
        },
        {
            "text": "In some key subjects we offer tax-free bursaries worth up to £27,000 and tax-free scholarships worth up to £29,000. We provide funding for programmes to boost subject knowledge, and we are developing a new physics Initial Teacher Training course for engineers. "
        },
        {
            "text": "We are also supporting recruitment and retention of specialists in areas where they are most needed through the Levelling Up Premium. "
        },
        {
            "text": "The Levelling Up Premium is worth up to £3,000 tax-free annually for maths, physics, chemistry and computing teachers in the first five years of their careers who choose to work in disadvantaged schools, including in Education Investment Areas. "
        },
        {
            "text": "And this September, we will be increasing teacher starting salaries to a minimum of £30,000 in all regions of the country. "
        },
        {
            "heading": 3,
            "text": "What are you doing to make sure teachers stay in the profession? "
        },
        {
            "text": "Teacher retention is key to ensuring effective teacher supply and quality, and we are taking action to support teachers to stay in the profession and thrive. "
        },
        {
            "text": "We have published a range of resources to help address teacher workload and wellbeing and support schools to introduce flexible working practices. We’re also putting together a workload reduction taskforce to explore how we can go further to support school and trust leaders to minimise workload.   "
        },
        {
            "text": "This will help us meet our ambition to reduce working hours by five hours per week within three years for teachers and leaders. "
        },
        {
            "text": "We know that offering high quality continuing professional development improves teacher retention. That’s why we’ve developed the biggest teaching reform in a generation – the Early Career Framework (ECF) – which provides the solid foundations for a successful career in teaching, backed by over £130 million a year in funding when fully rolled out. "
        },
        {
            "text": "The ECF reforms aim to support teachers and school leaders to feel more confident and in control of their careers. It sets out what all early career teachers should learn about and learn how to do during the first two years of their careers. "
        }
    ]
}