{
    "url": "https://defradigital.blog.gov.uk/2022/12/03/my-experience-with-technology-and-being-autistic/",
    "title": "My experience with technology and being autistic",
    "authors": [
        "Christopher Cotmore"
    ],
    "categories": [
        "Smarter working"
    ],
    "pub_date": "2022-12-03T07:30:44+00:00",
    "content": [
        {
            "text": "On International Day of Persons with Disabilities Christopher Cotmore reflects on his autism spectrum diagnosis and the impact of technology on the way he works."
        },
        {
            "text": "\"If you've met one person with autism, you've met one person with autism.\" – Dr Stephen Shore."
        },
        {
            "text": "The above quote has stuck with me since I heard it in a recent presentation. It gives me comfort in knowing that my experiences of being autistic are genuine, but it is also a reminder that what works well for me won’t be the same for others."
        },
        {
            "text": "My hope with writing this blog is that I can raise awareness and spark conversations with colleagues and others outside of Defra. My views, and the examples I discuss, are unique to me, and should not be used as a template to apply to others."
        },
        {
            "heading": 2,
            "text": "Hidden Disabilities"
        },
        {
            "text": "I am autistic. This is something I have only recently learned. After years of trying to tackle anxiety, depression, and symptoms like obsessive compulsive disorder, I have a full diagnosis and can approach things with a greater understanding."
        },
        {
            "text": "My journey to a diagnosis was almost completely accidental. During one of the lockdowns, I was struggling with my mental health and reached out to my local NHS services for support. I met with a therapist, who listened to what I was going through and suggested a referral for an autism assessment."
        },
        {
            "text": "Where others had looked my experiences in isolation, this therapist had taken in the whole picture. There was a long wait, but at the end of it was a diagnosis. I still struggle with some things but have a much clearer perspective and understanding, which has been a huge help."
        },
        {
            "text": "Technology has been a mixed blessing for me, particularly with the changes we have all seen working with Covid. As a civil servant I used to work in the office five days a week. Currently, it is typically two days a week."
        },
        {
            "text": "Flexible working has reduced the amount I travel, which has been a benefit to my mental health overall. I have found that a meeting overrunning at home is far easier to deal with. At the same time, communication can be challenging, with a lot more potential for misunderstandings."
        },
        {
            "text": "The increased reliance on emails and chats removes key elements of communication. Beyond the lack of face-to-face interaction, these approaches can appear more direct, and it can be more difficult to clarify the intent behind a request. To give a specific example. Microsoft Teams has been both a huge benefit, as well as source of significant stress and pressure."
        },
        {
            "text": "Looking at the positives, I can keep in more regular contact with colleagues, across the UK. On more difficult days, I can remain present, even if face-to-face or video calls are too much. Meetings with clear etiquette, for example ‘muted unless speaking’ and ‘raise hands to speak’, are a lot more structured, helping me to follow and participate in conversations. The status function means that I can see when others are online and if they are available to talk."
        },
        {
            "text": "On the negative side, people’s expectations for responses are or feel much greater than before. Meetings lacking clear etiquette are difficult to follow and almost impossible to participate in. There can be a lot more happening at the same time and it isn’t always possible to show that you are trying to participate in several conversations."
        },
        {
            "text": "The balance between benefits and challenges varies from day-to-day. The days with a lot of meetings tend to be the hardest, but this is especially the case when the chair is not coordinating the conversation or there is a lot of background noise."
        },
        {
            "heading": 2,
            "text": "The Bigger Picture"
        },
        {
            "text": "I attended an informative presentation by the Cross Government Autism Network on supporting autistic colleagues recently. It revealed the shocking figure that only 29% of autistic people are employed."
        },
        {
            "text": "This was much lower than I expected, particularly when compared to the figures for all disabled people (53.5% in employment) and non-disabled people (81.6% in employment)."
        },
        {
            "heading": 2,
            "text": "No Panacea"
        },
        {
            "text": "Technology has the potential to be transformative and support people in many aspects of life, but it can also be exclusionary. The actual impact is often determined by how new technology is used and applied. It’s therefore essential to consider approaches that can be more inclusive and for all of us to be open and responsive to receiving requests for adjustments from those impacted."
        },
        {
            "text": "I would like to encourage everyone to think about the approaches they are taking to work and consider whether there are any changes that could help improve accessibility and inclusion for those around them."
        },
        {
            "text": "One final reflection; it’s important to remember that the experience and adjustments people require vary. The examples I’ve shared here are based on my own experiences and are not intended to be representative of anyone else. My hope is that my experiences can contribute to an increased understanding and mobilise support for improving accessibility and inclusion."
        }
    ]
}