{
    "url": "https://mhclgdigital.blog.gov.uk/2022/04/21/building-confidence-and-expertise-in-local-government-for-successful-digital-transformation/",
    "title": "Building confidence and expertise in local government for successful digital transformation",
    "authors": [
        "The Local Digital team"
    ],
    "categories": [
        "Local Digital",
        "Local Digital Declaration",
        "Local Digital Fund",
        "Local Digital Team",
        "Local Digital Training"
    ],
    "pub_date": "2022-04-21T12:49:57+01:00",
    "content": [
        {
            "text": "In the Local Digital Declaration, we outline our commitment to ‘creating the conditions for genuine organisational transformation to happen’. A key element of this is ensuring there are the training courses, knowledge sharing, and communities of practice, needed to create thriving digital ways of working within local government."
        },
        {
            "text": "In March this year, we teamed up with the Amazon Web Services (AWS) Institute to jointly deliver a virtual programme for local government at no cost. The Executive Education Programme in Digital Transformation for UK Local Government is designed to equip senior local government officers with the confidence and expertise they need to lead the successful digital transformation of public services, so that they can better meet the needs of their residents. The goal is to build a global community of transformative leaders to embed this modernisation agenda in government leadership teams."
        },
        {
            "text": "The programme was delivered by 14 speakers from DLUHC and AWS as well as recognised academic, industry, and public service leaders, from both within government and further afield. We were joined by 98 attendees from 70 local authorities across the country."
        },
        {
            "heading": 2,
            "text": "How the programme came about"
        },
        {
            "text": "After Paul Maltby (Chief Digital Officer at DLUHC) presented at a public sector transformation programme run by AWS last year, we approached AWS to discuss working together to deliver a similar programme for our local government audience. We were also looking for a programme that supported peer-to-peer learning—something that was requested following training we delivered previously. "
        },
        {
            "text": "Over a period of several months, we worked with AWS to design a programme that would embed the principles of the Local Digital Declaration at the most senior levels of local government, by providing council executives with the insight and tools to help them lead transformation and solve common digital and data problems in their organisations."
        },
        {
            "text": "We took learnings from our 2019 Local Leaders Digital Accelerator programme—a 2-day residential course where we collaborated with the Government Digital Service (GDS) to drive new approaches to service design, procurement and technology to deliver the best services to residents—and adjusted our approach to suit remote working. "
        },
        {
            "text": "We also approached key figures in local government who represent a broad range of views and experiences to contribute to panel sessions for each module."
        },
        {
            "heading": 2,
            "text": "The ‘why, how and what’ of digital transformation"
        },
        {
            "text": "The programme was made up of three half-day modules delivered through a combination of live interactive sessions and workshops. The first module focused on the ‘why’ of digital transformation, the second on the ‘how’ (namely skills, capabilities, policy, digital and data) and the third on the ‘what’—the real experience of transformation."
        },
        {
            "text": "Module 1: Why Digital Transformation"
        },
        {
            "text": "The first module began with an introduction and welcome from DLUHC’s May-N Leow and Paul Maltby, who shared his advice on digital transformation in local government:"
        },
        {
            "text": "“Some of the really big strategic insights here are about the business models of the internet age and about the methodologies of how digital teams get stuff done. What do I mean by that? First, a ruthless prioritisation of user needs…second, an Agile approach to delivery - and I mean Agile with a capital A…third, new business models driven by data and platforms…the fourth is about horizontal shifts in power…these movements of people working together to do a thing rather than hierarchical organisations. That’s what Local Digital is doing here”."
        },
        {
            "text": "Liam Maxwell (Director of Government Transformation at AWS) then delivered a keynote talk on ‘Building resilience in a new normal’, where he examined recent global case studies in innovation and digitalisation, sharing success stories and lessons learnt."
        },
        {
            "text": "Liam was followed by Professor Mark Thompson (Professor of Digital Economy in INDEX at the University of Exeter), who delivered a keynote on a government \"LEGO block\" approach to building public services. He explained how, by adopting \"plug and play\" parts, as internet businesses have done, governments can save money and make use of shared components and processes before building bespoke products."
        },
        {
            "heading": 3,
            "text": "Module 2: Skills, capabilities, policy, digital and data"
        },
        {
            "text": "We kicked off the second module with an interactive Design Thinking workshop. Mike Beaven (Government Transformation Leader EMEA, AWS) used UK government case studies to explore how Design Thinking enables public sector leaders to reframe assumptions and address the needs of those they serve."
        },
        {
            "text": "This was followed by a panel discussion on the ‘Art of the possible’, led by May-N. Panellists from across the sector explored what is possible in digital transformation, with the aim of inspiring participants to think creatively about how they can deliver digital transformation across their organisation, overcoming challenges such as limited resource and technical skills."
        },
        {
            "heading": 3,
            "text": "Module 3: The real experience of transformation"
        },
        {
            "text": "The third and final module saw May-N lead another panel discussion on the ‘Real experience of transformation’. This session asked:"
        },
        {
            "text": "A particularly thought-provoking conversation explored the work that local authorities need to do to improve processes and pre-procurement efforts to get the best value from suppliers. This flowed on nicely from a discussion from Module 1 about how digital transformation is more than just technology; it’s ways of thinking."
        },
        {
            "text": "Image caption: The panellists from Module 3 of the programme"
        },
        {
            "heading": 2,
            "text": "What we heard from you"
        },
        {
            "text": "The panel discussions in particular generated interesting conversations and comments from the programme participants. "
        },
        {
            "text": "These included discussions of common blockers to transformation, such as legacy technology and procurement: "
        },
        {
            "text": "“A lot of the time it is the incumbent/legacy systems that slow down the drivers of transformation too. I would love to see more market providers help the LAs to assess our 'digital transformation readiness' before they start pushing products to our tech and/or business leaders.”"
        },
        {
            "text": "“Procurement really should be (and has the capacity to be) an enabler of innovation and social value. We also need to better connect procurement with commissioners and contract managers.”"
        },
        {
            "text": "Risk and accepting failure were also common themes:"
        },
        {
            "text": "“To enable innovation and change the dependence on monolithic 'safe' systems, authorities have to be better at accepting risk, failure and agility.”"
        },
        {
            "text": "“We are not doing enough to put the 'design blueprint' in the sandbox (i.e. test and play; break it, and test again) because most LA's Procurement Framework doesn't allow for this approach.”"
        },
        {
            "text": "Getting buy-in from teams and realising the value of digital transformation was an area of concern:"
        },
        {
            "text": "“We need to get ALL teams to be speaking the same language when talking about digital transformation and the methodologies involved. The main way is always to listen more than you talk.” "
        },
        {
            "text": "“We should never be afraid to step back and look how far we've come. All organisations are transforming all the time – some faster than others – but taking time to acknowledge that as a team makes people feel more comfortable with the idea of 'transformation'.”"
        },
        {
            "text": "As well as the challenges facing local government, we also heard celebrations of the fantastic work being done within local authorities—particularly during challenging times:"
        },
        {
            "text": "“The things we're collaborating on for the Local Digital Fund with local authorities, and exemplars like Adur and Worthing, are world-leading in local government. So we should be super proud because local authorities have been able to do these things as well as continue with keeping the lights on and dealing with big disruptive events such as COVID-19.” - May-N Leow"
        },
        {
            "text": "It was great to hear so many of your experiences and ideas, which will help to inform our ambitions to support the local government sector by:"
        },
        {
            "text": "The feedback will also be useful in helping us to improve future training and events, including making sure that online programmes allow for greater interactivity and provide breakout room capabilities."
        },
        {
            "heading": 2,
            "text": "Looking ahead"
        },
        {
            "text": "We’re grateful to everyone who gave us their time during such a busy period for local government. If you were not able to join the programme but would like to be the first to hear about future events and training opportunities, you can register your interest using this online form."
        },
        {
            "text": "Earlier this year we announced exciting new steps as a result of £85m of multi-year funding. One of our objectives for this new programme of work is to ‘ensure councils have the skills, knowledge and tools they need to design and deliver modern digital public services.’ We will continue to develop our training offer based on feedback from our local government colleagues, and will be building more training opportunities into our future programmes of work."
        },
        {
            "text": "We’re looking forward to sharing more on our plans soon, but in the meantime why not visit our library of online digital skills training courses?"
        }
    ]
}