{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2022/04/21/collaboration-in-the-space-sector-uk-space-agency-the-national-physical-laboratory/",
    "title": "Collaboration in the Space Sector – UK Space Agency & the National Physical Laboratory",
    "authors": [
        "Selina Khan"
    ],
    "categories": [
        "Guest Blog",
        "Our People & Deep Dives",
        "Outreach"
    ],
    "pub_date": "2022-04-21T17:28:43+01:00",
    "content": [
        {
            "text": "Collaboration in the Space Sector – UK Space Agency & the National Physical Laboratory"
        },
        {
            "text": "The National Physical Laboratory (NPL) is the UK’s National Metrology Institute, specialising in measurement science. We are delighted to be supporting the UK Space Agency in a variety of projects within the UK space sector. In March, NPL welcomed Dr Paul Bate and his team to our Teddington laboratories, to meet some of our scientists working on these exciting collaborations."
        },
        {
            "text": "In the UK Space Agency video, you can get a taste of some of the science and engineering innovation that is taking place at NPL that supports the UK Space Sector."
        },
        {
            "text": "Resilient Timing"
        },
        {
            "text": "In the UK, NPL provides the UK timescale and is working to make our timing infrastructure more resilient through the National Timing Centre Programme (NTC). NTC will provide the UK with a precise and reliable source of time that is independent of GNSS."
        },
        {
            "text": "Space Optical Clocks"
        },
        {
            "text": "We are also working with the UK Space Agency and the European Space Agency on ultra-stable lasers and space optical clocks that make use of our patented  ultra-stable optical reference cavities. These developments will feed into global telecommunications, future GNSS systems, Earth observation and space-based fundamental physics."
        },
        {
            "text": "TRUTHS"
        },
        {
            "text": "Traceable Radiometry Underpinning Terrestrial and Helio Studies (TRUTHS) is a climate mission to improve the quality of earth observation data and the decisions made using it, it is led by the UK Space Agency and delivered through the European Space Agency (ESA)."
        },
        {
            "text": "TRUTHS will enable anchored calibration of other earth observation satellites whilst they are in orbit, back to a primary measurement reference standard. TRUTHS is providing a benchmark that can reduce uncertainties in the earth observation data, increasing our confidence in the data being collected and used to inform our understanding of climate change."
        },
        {
            "text": "MicroCarb"
        },
        {
            "text": "The MicroCarb mission is the first European mission for mapping greenhouse gas fluxes on the Earth’s surface. NPL is contributing to the mission in two ways, both building the facility used to characterise and calibrate the instrument performance before flight and applying metrological principles to the downloaded data to understand the best interpretation for its use."
        },
        {
            "text": "Thermal Imaging"
        },
        {
            "text": "Quantitative thermal imaging can be used to provide detailed surface temperature measurements across a wide range of sectors from medicine to energy, including thermal vacuum testing and earth observation within the space sector."
        },
        {
            "text": " "
        },
        {
            "text": "NPL is currently developing 3D thermal imaging with a focus on satellites undergoing thermal balance testing. We are also developing our own vacuum hardware, including an NPL calibrated thermal imager that will be able to work across a range of vacuum conditions."
        },
        {
            "text": "See for yourself!"
        },
        {
            "text": "If you would like to find out more about this work and see inside some of the NPL labs yourself – you can register to join us for our Open Day on World Metrology Day 20th May 2022 at NPL open day"
        }
    ]
}