{
    "url": "https://civilservice.blog.gov.uk/2022/04/21/from-tiny-acorns-mighty-oaks-will-grow/",
    "title": "From tiny acorns mighty oaks will grow",
    "authors": [
        "Emma Latham"
    ],
    "categories": [
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Ambitious Civil Service",
        "An Innovative Civil Service",
        "Uncategorized"
    ],
    "pub_date": "2022-04-21T08:01:47+00:00",
    "content": [
        {
            "heading": 3,
            "text": "When the Civil Service Languages Network (CSLN) began in October 2020, Matt Brown and Hugo Griffin had no idea the network would become the success it is today."
        },
        {
            "text": "The Spanish Network began with just five colleagues in DWP eating lunch together chatting in Spanish. When the first lockdown was announced, Fast Streamers Matt Brown and Hugo Griffin wanted to provide continuity for this small group and shifted activity online."
        },
        {
            "heading": 4,
            "text": "Rapid growth"
        },
        {
            "text": "Word quickly spread about the group. Matt and Hugo contacted colleagues in other departments to speak about their experiences using languages at weekly talks. In Summer 2020, the Spanish Network swelled to 400 members across government. At this point, the network was no longer a Fast Stream one but a Civil Service-wide one. "
        },
        {
            "text": "By Autumn 2020, Matt and Hugo established the Civil Service Languages Network to cater for more languages and the broad appeal for interactive, intercultural talks. Alongside volunteers, they promoted the new language groups widely. Little did they know where all of this would take them!"
        },
        {
            "heading": 4,
            "text": "Seismic interest"
        },
        {
            "text": "Since October 2020, we’ve established 34 language groups from Arabic to Urdu, Bengali to Swedish and everything in between, as well as a Bilingual Parenting group. We now have more than 7,000 members across government, throughout the UK and overseas - comparable to a small department. To achieve this in under two years, all at home due to COVID-19, is no mean feat."
        },
        {
            "text": "Our language groups are the main reason people get involved. Each group has dedicated language leads who are passionate about the language and facilitate the group’s activity. Each group runs speaker events, language tandems (coffee-roulette meetings with colleagues who speak that language to a similar standard) and informal conversation groups."
        },
        {
            "heading": 4,
            "text": "High-profile speakers"
        },
        {
            "text": "The CSLN team also organises wider network opportunities, such as cross-cutting talks which are always very well attended. Members hear regularly from civil servants and high-profile speakers about their experience of using language at work or their area of languages expertise. "
        },
        {
            "text": "Past guests have included Deborah Bronnert, Sir Laurie Bristow KCMG, and Daniel Pruce. These events offer ways for our members to learn about international careers in the Civil Service and build their professional networks. Since COVID-19 restrictions have eased, CSLN has been organising popular in-person socials."
        },
        {
            "heading": 4,
            "text": "Strategic support"
        },
        {
            "text": "Being such a rich and active network, we’ve tapped into the linguistic and cultural expertise of our members to provide bespoke resources to departments and teams that need language skills."
        },
        {
            "text": "In December 2021, we supported NHS England on the COVID-19 vaccine booster drive. Over 150 network volunteers provided video content and translations in 32 languages. We produced 50 videos in total, as well as a video montage which you can watch here. "
        },
        {
            "text": "CSLN recently supported the design and promotion of the Government Skills and Curriculum Unit’s Language Capability Survey to map language skills across government and examine how these skills can be recognised, developed and deployed. Thanks to CSLN, the survey drew a huge response from more than 20 departments and ALBs."
        },
        {
            "heading": 4,
            "text": "Levelling up"
        },
        {
            "text": "Alongside other departments, the CSLN team and its enthusiastic volunteers visit schools and universities to run themed workshops encouraging students to learn languages and promoting their uptake at GCSE and A-Level. This work also supports the Prime Minister’s priority of Levelling Up."
        },
        {
            "heading": 4,
            "text": "Award-winning"
        },
        {
            "text": "In March 2022, we won the prestigious Threlford Cup from the Chartered Institute of Linguists, presented by patron Prince Michael of Kent (left). "
        },
        {
            "text": "The accolade is awarded for fostering the learning of languages and intercultural dialogue with significant reach. This recognition marks the huge efforts of volunteers and members over the past two years to build an active, growing community around languages within the Civil Service of such a scale."
        },
        {
            "text": "With all this success in mind, we’re not resting on our laurels. We plan to launch our new Bulgarian and Czech language groups in the next few months. More schools and university outreach events are in the calendar. We now offer nine languages on our inter-language tandems (where both partners are proficient in a language the other would like to practise). We’ll continue to provide an excellent network for our members and aim to reach 10,000 members this year - it would be a real milestone for us! "
        },
        {
            "heading": 4,
            "text": "Unique community"
        },
        {
            "text": "We’ll also continue to channel our unique community to support projects in government which require language skills and intercultural expertise. "
        },
        {
            "text": "As Professor Wendy Ayres-Bennett said at one of our events, “Languages are everywhere and nowhere in government’. Thanks to our work, government is starting to realise just how many civil servants have language skills and how it could better utilise this asset. Watch this space! "
        }
    ]
}