{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2022/04/21/heo-technical-advisor/",
    "title": "HEO Technical Advisor",
    "authors": [
        "Selina Khan"
    ],
    "categories": [
        "GSE Opportunities"
    ],
    "pub_date": "2022-04-21T16:25:34+01:00",
    "content": [
        {
            "text": "Are you passionate about the environment?"
        },
        {
            "text": "Would you like the opportunity to work in an exciting, innovative work environment where no two days are the same?"
        },
        {
            "text": "If so, this role is perfect for you!"
        },
        {
            "text": "This role sits within the Vehicle Environmental Standards (VES) team in the Department for Transport (DfT) and is an exciting opportunity for an enthusiastic scientist or engineer. As the successful candidate, you will drive forward the development and delivery of policy for cleaner road vehicles, and shape future environmental standards for vehicles alongside a dedicated team of scientists, engineers and policymakers."
        },
        {
            "text": "You will be proactive while working to develop new technical standards to ensure that future vehicles are the cleanest ever, minimising their impact on air quality, public health and the environment."
        },
        {
            "text": "This role affords you the opportunity to play a key part in ensuring the UK’s interests are represented at international meetings (including at the United Nations) and provide support, leadership and innovation in the improvement of environmental standards for vehicles."
        },
        {
            "text": "This is an exciting role which sits in a supportive and enthusiastic team. You will be given the opportunity to broaden your skills and knowledge and develop your career, should you wish. Prior experience or knowledge of road transport and the environmental impact of vehicles is not required for this role. We welcome anyone with a degree or equivalent qualification in Science or Engineering fields to apply."
        },
        {
            "text": "We would like you to meet some of our team, so we have arranged three online recruitment events for interested applicants who would like to find out more about this post and the important role that the Vehicle Environmental Standards Team plays in the work of DfT. These events will take place on Tue 26th Apr 12:00-12:30, Wed 27th Apr 16:00-16:30, Thu 28th Apr 19:00-19:30. To book your place at this event via Eventbrite: Click here"
        },
        {
            "text": "You can find the job description here. "
        }
    ]
}