{
    "url": "https://marinedevelopments.blog.gov.uk/2022/04/21/i-vms-behind-the-scenes-2/",
    "title": "I-VMS Behind the Scenes 2",
    "authors": [
        "Sean Douglas, Head of Enforcement, Intelligence and Investigations"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2022-04-21T16:11:11+01:00",
    "content": [
        {
            "text": "As we approach the first I-VMS installation deadlines of the rollout, with all 8m – 11.9m vessels in the English inshore fleet expected to have one of the four type approved devices available installed by the week beginning May 16th, we can look back at some of the progress made on the project so far and look forward to meeting the challenges ahead."
        },
        {
            "text": "We appreciate there was a minor delay when type approval for one of the devices was temporarily suspended after questions were raised about technical specifications, but these were quickly resolved with the supplier which is testament to the continual quality assurance and close collaborative partnership working of the project."
        },
        {
            "text": "Our coastal teams working at fishing ports, harbours and markets along the English coastline, and our support and engagement team back at national headquarters Lancaster House have listened and talked to fishers throughout, and tried to explain and re-assure people how the I-VMS devices which are all small enough to hold in your hand, can help us transform the inshore fishing industry."
        },
        {
            "text": " "
        },
        {
            "text": "Hundreds have already been ordered by fishers from all four tranches of vessel length groups within the fleet and there are pictures and details of each of the four type approved devices on to help people make their choice of which to buy and install, but we realise we can still do even more to help and encourage those who are still undecided."
        },
        {
            "text": "As part of our continual engagement process we have set up a dedicated email address ivms@marinemanagement.org.uk  for all I-VMS enquiries.  In addition, our teams are planning a series of roadshows in the months ahead at various coastal locations, so even more people have the opportunity to ask questions, seek advice and raise any concerns with us directly.   A dedicated phone number to deal with any questions or queries related to the I-VMS roll out and for assistance with grant applications is due to be open very soon.  We will let you know when this is ready to receive enquiries."
        },
        {
            "text": "One concern we’ve hopefully already managed to address is about how the data transmitted from individual vessels will be stored and shared. Data Protection Regulations are in place which include privacy notice agreements between the MMO and individual fishers. This ensures that the potentially commercially sensitive information provided about fishing patterns/practices remain confidential and not publicly available to other fishers."
        },
        {
            "text": "We can also assure everybody that strict internal guidelines also make sure that data is only shared with a small number of designated partners such as the IFCA (Inshore Fisheries and Conservation Authority) and HM Coastguard for specific reasons such as fisheries protection or maritime safety reasons, and not with any third party organisation.  All of this is detailed online in our guidance pages."
        },
        {
            "text": "Everyone at MMO involved with the I-VMS project is here to provide explanation and re-assurance to every fisher throughout this roll-out, and with everyone’s continued help and support we’ll work in partnership to ensure that we are all Improving Fishing Together."
        }
    ]
}