{
    "url": "https://actuaries.blog.gov.uk/2022/04/21/inflation-its-personal/",
    "title": "Inflation, it's personal",
    "authors": [
        "Christophor Ward - Actuary"
    ],
    "categories": [
        "Actuary",
        "Finance"
    ],
    "pub_date": "2022-04-21T14:01:35+01:00",
    "content": [
        {
            "text": "We are in a period of high inflation of prices for goods and services. The Office for National Statistics (ONS) shows one of the inflation indices has increased by 6.2% in the 12 months to March 2022."
        },
        {
            "text": "This is the highest that CPIH (Consumer Prices Index including owner occupiers' housing costs) has been since 1992. Among the main components of this increase are transport costs, such as petrol and diesel and the price of second-hand cars."
        },
        {
            "text": " "
        },
        {
            "text": "During the pandemic prices for some goods and services fell, such as for eating out and holidays abroad. This reflected a rapid fall in demand which quickly shifted with demand gradually returning and supply then becoming challenging. Lockdown and workforce availability were key causes, but another factor was the reliance of so many products on semiconductors."
        },
        {
            "text": "They feature in ever more numbers of products such as computers, cars and even kettles. The demand for semiconductors has been increasing faster than the supply can keep up with."
        },
        {
            "text": "This has been compounded by other factors, such as the surge in early retirements during the pandemic and increasing energy prices due to the geopolitical situation."
        },
        {
            "text": "These factors and increasing semiconductor production can be managed with a view to bringing prices back down again. However, solutions such as building new semiconductor manufacturing facilities take time, so until then, prices increase."
        },
        {
            "heading": 2,
            "text": "Choosing the right measure of inflation"
        },
        {
            "text": "In its February 2022 Monetary Policy Report (page 7), the Bank of England forecast inflation to peak over quarter two and get back towards its 2% target by the end of 2024. The UK has 3 main types of a price inflation index. These aim to give an indication of how prices have risen for a typical consumer. The table shows the increase in these indices in the 12 months to the end of March 2022."
        },
        {
            "heading": 2,
            "text": "Different measures"
        },
        {
            "text": "The main driver for the difference between the CPIH and CPI inflation rates is the owner occupiers’ housing costs. These relate to costs associated with owning, maintaining, and living in one’s own home. These costs account for around 17% of the constituents of the CPIH index."
        },
        {
            "text": "While owner occupiers’ housing costs increased over the year to March 2022, these were to a lesser extent than the other components of CPIH. Owner occupiers’ housing costs increased by 2.7% to March 2022. That is why CPIH was lower than CPI."
        },
        {
            "text": "Both CPIH and RPI monitor similar baskets of goods and services, though they always tend to differ and at present do so by a large margin. This is because, when compiling the costs of goods and services, RPI uses a different calculation method to CPIH. RPI also measures owner occupiers’ housing costs differently. CPIH is generally accepted to be a more appropriate measure of inflation now than RPI."
        },
        {
            "heading": 2,
            "text": "Market view"
        },
        {
            "text": "As well as the Bank of England forecasts of inflation, we can look at what financial markets are implying might happen to inflation in the future. This is done by looking at the yields on government bonds, which are linked to RPI."
        },
        {
            "text": "Current market conditions suggest a slower reduction to inflation than the Bank of England forecast. In addition, markets expect inflation will not reach the Bank of England’s 2% target."
        },
        {
            "text": "One reason for this difference in views will be the measure of inflation that’s used. We know the market is pricing in RPI (not CPI) up to 2030. Beyond 2030 the UK Statistics Authority has announced plans to bring the RPI methodology into line with CPIH. However, there is currently a judicial review of these plans so the market may be allowing for the possibility that the published  changes are altered."
        },
        {
            "text": "Market implied inflation can be skewed by the supply and demand for inflation protecting assets. Such assets are in high demand by institutions such as life insurers and pension schemes."
        },
        {
            "heading": 2,
            "text": "Inflation, it’s personal"
        },
        {
            "text": "We will be able to relate to instances of our own expenditure where prices have increased. It’s likely that it will affect our friends and family too, but exact effects will be unique to individual financial circumstances."
        },
        {
            "text": "The same is true across government and industry. As such, inflation indices provide useful benchmarks, but specific inflationary pressures to certain users or industries should also be considered. So, as an example, car insurers may consider the costs from car accidents. This is because the inflation on the price of car parts and medical treatment will be key factors in pricing an annual insurance policy."
        },
        {
            "text": "The 3 inflation indices we viewed are reporting on what general inflation has been. The Bank of England, financial markets and many commentators will have views on what future inflation will  be."
        },
        {
            "heading": 2,
            "text": "Industry and government"
        },
        {
            "text": "Inflation poses a risk for business and financial institutions (such as pension funds and insurance companies) as we do not know how it will evolve. There will be scenarios, which may seem unlikely but nonetheless plausible and which could lead to financial difficulties."
        },
        {
            "text": "Mitigations may be available but will usually come at a cost. This could be purely financial, such as buying insurance. Or it could be more complex, like carefully balancing how much inflation can be passed onto consumers in the form of higher prices."
        },
        {
            "text": "Specialists can give views on inflation and look at its impact, and this is what actuaries do for pension schemes, insurance products and asset owners. These specialists will work best when working with their clients, to better understand their clients’ products, services, business, and customers."
        },
        {
            "heading": 2,
            "text": "Impact of inflation"
        },
        {
            "text": "Inflation levels are currently high. Having gone through significant price volatility during the pandemic and now into a period of high energy prices, it’s clear the impact of inflation changes is far-reaching. It’s important to consider the impact of inflation in the base case, best case, and worst-case scenarios and to ask:"
        },
        {
            "text": "Actuaries are experienced in considering inflation. This would apply in our traditional fields of pensions and insurance or more generally, to any problem where there is financial uncertainty and risk needs to be understood and managed."
        },
        {
            "heading": 3,
            "text": "Disclaimer"
        },
        {
            "text": "The opinions in this blog post are not intended to provide specific advice. For our full disclaimer, please see the About this blog page."
        }
    ]
}