{
    "url": "https://ipa.blog.gov.uk/2023/04/14/1231/",
    "title": "Drive a step change in infrastructure: TIP Live 2023",
    "authors": [
        "Luke Cryan"
    ],
    "categories": [
        "Construction",
        "Transforming Infrastructure Performance"
    ],
    "pub_date": "2023-04-14T14:15:21+01:00",
    "content": [
        {
            "text": "There is less than one week to go until the Transforming Infrastructure Performance (TIP) Live conference, where leaders from both industry and government will be exploring how we can deliver a step change in the way we plan, design, construct and operate infrastructure. "
        },
        {
            "text": "TIP is the Infrastructure and Project Authority’s (IPA) flagship programme in leading system change in the built environment. It describes a vision for the future in which we collectively prioritise the societal outcomes we need, in order to drive transformation in infrastructure performance."
        },
        {
            "text": "The TIP Live conference will highlight some of the vital ways in which we are driving this change, including how we deliver regional based regeneration, use modern digital approaches and drive sustainability."
        },
        {
            "text": "On the day, inspirational speakers at the forefront of their fields will be discussing some of the crucial areas of their work that will make this happen. The following blog highlights three TIP Live speakers and their area of expertise that they will explore further as part of their sessions."
        },
        {
            "text": "Jaimie Johnston, Head of Global Systems at Bryden Wood - automated design and platform approaches."
        },
        {
            "text": "Jaimie Johnston is the Head of Global Systems at Bryden Wood, and also the Design Lead for the Construction Innovation Hub (CIH). Jamie has worked on a manufacturing-led approach to design and construction on many major global projects, including those at DHSC, MoJ and the NHS - as well as with clients like GSK and Heathrow Airport."
        },
        {
            "text": "In his session, Jaimie Johnston will talk through unlocking manufacturing approaches to construction through the application of automated design and platform methods."
        },
        {
            "text": "Using a platform approach is one of the key ‘focus areas’ of the TIP Roadmap to 2030, with its vision describing the built environment becoming harmonised through a common rule set and a broad supply chain that manufactures products to address demand. These products would be offered via a machine-readable catalogue with competition based on performance and sustainability. Automation would enable a greater focus on value-led design, while assembly of assets would employ digital workflows and innovative machinery."
        },
        {
            "text": "Trudi Sully, Impact Lead for Mott MacDonald- Delivering value through the Platform Approach."
        },
        {
            "text": "Trudi Sully is the Impact Lead for Mott MacDonald, and was previously the Impact Director at the CIH. Trudi has worked across both the private and public sector, and has vast experience working together with key parts of the industry and government."
        },
        {
            "text": "Trudi also played a key role in the development of the Product Platform Rulebook, an open-access guide to support industry in building capability and capacity to develop and deploy product platforms to meet demand."
        },
        {
            "text": "In the session, Trudi will talk about the pivotal role she played in the development of the Product Platform Rulebook, after it was updated in March following receiving UK Research and Innovation funding for the CIH. Specifically, the sessions will explore what this means for industry and how adopting a platform approach will support delivering value."
        },
        {
            "text": "Keith Waller, Programme Director for the CIH - TIP 2030 Roadmap, progress on bringing about fundamental reform of infrastructure delivery and encouraging rapid industry action on TIP."
        },
        {
            "text": "Keith Waller is the Programme Director for the CIH - a collaborative effort between over 600 construction sector adjacent professionals to collectively guide the transformation of the UK construction industry. Keith is a fellow of ICE and has over 30-years experience in construction and infrastructure projects, even being seconded to government in 2010 to Infrastructure UK, which was the predecessor to the IPA."
        },
        {
            "text": "During this session, Keith Waller will take the conference through the good progress that has been made on reforming infrastructure delivery, through the lens of the TIP Roadmap to 2030. "
        },
        {
            "text": "The TIP Roadmap to 2030 sets out the progress made since 2017, when the original TIP document was published. It sets out the steps taken in areas such as benchmarking for better performance, alignment and integration, and procurement for growth and smarter infrastructure. It also notes issues such as a methodology on benchmarking (published by the IPA), the development of the new Government Project Delivery Framework to drive alignment, work on ‘boilerplate’ clauses for use on commercial construction frameworks, and a construction sector deal where government has provided funding to the CIH, which is supporting the aggregation of demand."
        },
        {
            "text": "To be in the room on the day and listen to how you can play your part in driving real change, click the link below to register. "
        },
        {
            "text": "Use code TIP: "
        },
        {
            "text": "https://lnkd.in/ezzrX9FZ"
        },
        {
            "text": "Read the full programme here:"
        },
        {
            "text": "https://lnkd.in/e2Rpiv2F"
        },
        {
            "text": "And to read the TIP Roadmap to 2030:"
        },
        {
            "text": "Click here"
        }
    ]
}