{
    "url": "https://educationhub.blog.gov.uk/2023/04/can-i-appeal-a-primary-school-offer-place-everything-you-need-to-know/",
    "title": "Can I appeal a primary school offer place? Everything you need to know",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Schools"
    ],
    "pub_date": "2023-04-14T12:55:41+01:00",
    "content": [
        {
            "text": "On Monday 17 April, parents and carers of three and four-year-olds will find out where their child will be starting school in September 2023. The vast majority will receive an offer from their preferred school."
        },
        {
            "text": "However, those who have not got a place at their top-choice can still appeal the decision. Here we tell you how the process works and when you can expect to find out whether your appeal has been successful."
        },
        {
            "heading": 3,
            "text": "Can anyone appeal a primary school offer place?"
        },
        {
            "text": "Yes, anyone can appeal the decision if you applied to a school and it didn’t offer your child a place."
        },
        {
            "text": "However, we recommend you only appeal if you believe you have valid grounds, which we talk you through below."
        },
        {
            "text": "With only very rare exceptions, Reception, Year 1 and Year 2 class sizes are limited to a maximum of 30 pupils. This means that places are restricted, and appeals are not usually successful."
        },
        {
            "heading": 3,
            "text": "What grounds do I have to appeal a primary school offer?"
        },
        {
            "text": "For an appeal to be successful, the appeal panel must decide that:"
        },
        {
            "text": "or"
        },
        {
            "text": "or"
        },
        {
            "text": "or"
        },
        {
            "heading": 3,
            "text": "How do I appeal a primary school offer?"
        },
        {
            "text": "Local authorities set their own deadlines for appeals, but they must allow you at least 20 school days from the day the offer was given to submit an appeal. Visit your local council’s website to find out how long you have to submit an appeal. Find your local council - GOV.UK."
        },
        {
            "text": "The letter you received about your child’s school place will include details of the appeals process and any deadlines."
        },
        {
            "text": "Usually, you’ll need to complete an appeal form before being invited to a hearing with an independent admissions panel."
        },
        {
            "text": "You’ll be given at least 10 school days’ notice of the hearing and appeals must be heard within 40 school days of the deadline for submitting an appeal."
        },
        {
            "text": "To find out more about what to include in your appeal letter and what to expect from a hearing, visit this page. Hearings for primary school places are likely to be similar to those for secondary places."
        },
        {
            "heading": 3,
            "text": "Can you accept a primary school place even if you’re appealing an offer?"
        },
        {
            "text": "Yes, we recommend accepting the place you’ve been offered straightaway, even if you’re making an appeal."
        },
        {
            "text": "By accepting the offer, you can be sure your child will have a guaranteed school place for September. This won’t affect the outcome of your appeal or limit your options."
        },
        {
            "heading": 3,
            "text": "When will I find out if my appeal has been successful?"
        },
        {
            "text": "Normally, you should find out the outcome of your appeal within five days of your hearing. However, there may be delays if there have been a greater number of appeals than normal."
        },
        {
            "heading": 3,
            "text": "Can I join a waiting list for my preferred primary school?"
        },
        {
            "text": "Yes, you can join the waiting list for any school you’ve applied to, even if you accept the offer you received."
        },
        {
            "text": "Schools must keep a waiting list for at least one term (until 31 December). The waiting list will be ordered by the school’s oversubscription criteria."
        },
        {
            "text": "This means some children may move down the waiting list when new applicants are added."
        },
        {
            "text": "As you might be added to waiting lists automatically in some areas, check the school admissions section of your local authority website to find out how it works for you."
        }
    ]
}