{
    "url": "https://onsdigital.blog.gov.uk/2023/04/14/collecting-the-data-that-makes-headlines-the-collection-and-ingestion-service-at-the-ons/",
    "title": "Collecting the data that makes headlines: the Collection and Ingestion service at the ONS",
    "authors": [
        "jacobstarling"
    ],
    "categories": [
        "ONS digital people",
        "Recruitment",
        "Service Owner"
    ],
    "pub_date": "2023-04-14T12:51:33+01:00",
    "content": [
        {
            "text": "We're currently recruiting a Service Owner to join the Collection and Ingestion service (C&I) at the Office for National Statistics (ONS).  It's an important role with great scope to make an impact.  I thought I'd take the opportunity to interview Martin O'Brian to find out more about what they do and how the Service Owner fits in."
        },
        {
            "heading": 2,
            "text": "First of all, give us a brief introduction."
        },
        {
            "text": "I’m Martin O’Brian, Deputy Director of Digital Delivery here at the ONS and responsible for the C&I service within the Digital Services and Technology Directorate (DST)."
        },
        {
            "heading": 2,
            "text": "What is Collection and Ingestion and how do you fit into the wider DST/ONS?"
        },
        {
            "text": "We’re essentially responsible for the digital products that people use to complete a survey on-line, and we provide the products to collect the data for business surveys, social surveys, and health surveys.  We take great pride in researching, designing, and developing our products so that our users get a great service, and we get timely and accurate data."
        },
        {
            "text": "Some examples of the surveys we publish using our products are"
        },
        {
            "text": "The data we collect is then organised and sent on for processing, analysis, and publication.  You might then see a news headline sharing the latest insight and analysis.  The data we collect are very important as in many cases, it goes on to inform Government policy-making decisions and helps to monitor the economy and the population."
        },
        {
            "heading": 2,
            "text": "What kind of projects do C&I work on?"
        },
        {
            "text": "We’ve set ourselves up to be “product-centric” and project work and continuous improvement work flows through the product teams.  Each product is just as important as the others, and they are in different stages of their life cycle."
        },
        {
            "text": "We’ve got projects that are moving surveys off legacy technology onto new platforms, projects that are involved in renewing surveys, projects that are moving paper surveys on-line (requiring us to build new capabilities and features) and projects that are improving our ability to respond quickly when new surveys are required."
        },
        {
            "text": "Alongside this we also run discoveries to see what new things need to be built, and our product teams have continuous improvement backlogs with things ranging from underlying infrastructure improvements to ensuring our services continue to be as accessible as possible."
        },
        {
            "text": "I would also say that some of the technologies we’re using are probably at the forefront of those being used in Government.  It’s a great mix really – great people and great technology running surveys that inform some really big decisions for the public good."
        },
        {
            "heading": 2,
            "text": "How big is the team?"
        },
        {
            "text": "There are 10 product teams delivering the C&I service with about 100 of us who design, develop and operate the digital products.  We’re also based far and wide, with colleagues in Belfast, Manchester, South Wales and on the south coast around Portsmouth.  So hybrid working and flexibility is really important to ensure we keep communication flowing and work progressing with people working from home and in offices right across the country."
        },
        {
            "heading": 2,
            "text": "How does the Service Owner fit in?"
        },
        {
            "text": "As we deliver more and more surveys on-line, develop new features in our products and strive to meet the expectations of our users flexibly and quickly, orchestration of our products and operation of the C&I service will become even more demanding.  The service owner will work closely with our service design team, product managers, programme managers and delivery managers.  The service owner will be responsible for ensuring our service is reliable, joined up across all channels, iterated and improved regularly whilst protecting users’ privacy and making sure that everyone can use it."
        },
        {
            "heading": 2,
            "text": "Why would you recommend someone work in C&I for the ONS?"
        },
        {
            "text": "I’m extremely biased of course, but it really is a great place to work – great technology, great service, great people, great culture, and a great mission.  (We also have some great benefits too which are listed in the job advert.)"
        }
    ]
}