{
    "url": "https://environmentagency.blog.gov.uk/2023/04/14/how-we-carry-out-maintenance-on-the-somerset-levels-and-moors/",
    "title": "How we carry out maintenance on the Somerset Levels and Moors",
    "authors": [
        "defrablogs",
        "Environment Agency"
    ],
    "categories": [
        "Environment Agency"
    ],
    "pub_date": "2023-04-14T10:50:21+00:00",
    "content": [
        {
            "text": "The Somerset Levels and Moors have long been shaped both by human history and natural processes. This means the landscape needs careful management to reduce the risk of flooding to properties within it and ensure the species that have come to call it home continue to thrive."
        },
        {
            "text": "One method of management used throughout the levels and moors is summer weed cutting. Weed cutting is the removal of excess vegetation from watercourses using various hand tools, weed boats or driven machinery like tracked excavators with specialist attachments."
        },
        {
            "text": "The main purpose of the summer weed cut is to reduce flood risk by increasing the conveyance of water in the channel. This allows more water to move through the river networks during times of higher flows. Managing aquatic vegetation is an important part of managing the water levels across the Somerset Levels and Moors all year. The control of the water levels allows pre-agreed, desired summer levels to be maintained, which not only provides drinking water and wet fencing for livestock, but also ensures the habitat for fish and aquatic invertebrates is protected."
        },
        {
            "text": "Managing aquatic vegetation also helps to improve the water quality of these channels by maintaining stable oxygen levels as more fresh water can pass through the system."
        },
        {
            "text": "How do we carry out the weed cut?"
        },
        {
            "text": "The first thing we ask ourselves is ‘what’s the most effective and safest way to remove the vegetation from this watercourse?’"
        },
        {
            "text": "Where there is access parallel to the channel and enough room for a machine to sit safely away from the edge, then an excavator with a specialised weed bucket will be used to cut the vegetation and remove it from the channel."
        },
        {
            "text": "The front of the bucket has reciprocating blades on the leading edge which cuts through the vegetation. And the back of the bucket sieves water so only the cut vegetation is collected."
        },
        {
            "text": "For this method to be used, the working bank is mowed using a flail, allowing the bank edge to be easily identified and a clear line of vision of the channel for the machine operator. When flail mowing, a marginal fringe of bankside vegetation is left on the edge of the watercourse as an important habitat for wildlife."
        },
        {
            "text": "The excavator usually works with the flow of water, removing weed and placing it on the flailed bank to protect the untouched habitat on the alternate bank."
        },
        {
            "text": "If the watercourse is too wide to allow an excavator to reach across or there is no access for the machine, we use weed boats instead. These single-person vessels travel slowly along the watercourse, cutting vegetation. Weed boats do not collect the cut vegetation, instead, the cut vegetation floats downstream and is gathered by booms across the watercourse where an excavator can safely remove the vegetation."
        },
        {
            "text": "A battery of checks to make sure we help, not harm"
        },
        {
            "text": "Our in-house ecologists check the planned work is within the parameters of wildlife law and provide recommendations to better protect specific species or improve the biodiversity of the location where we are carrying out the work."
        },
        {
            "text": "In some locations further permission is needed from Natural England if the location falls within a SSSI (Site of Special Scientific interest)."
        },
        {
            "text": "When our operatives arrive on site to carry out the work, they begin by conducting a habitat sweep, creating check sheets to record the exact work location for the day and noting any signs of nesting birds. If there are suspected birds nesting in a section that is due to be cut, a 20m buffer is left around the suspected nesting area and work continues downstream."
        },
        {
            "text": "Cutting aquatic vegetation can affect dissolved oxygen levels in the watercourse. To monitor this, readings are taken every two hours to make sure there is no adverse effect. If there is, work is paused to allow freshwater to flow through until oxygen levels stabilise."
        },
        {
            "text": "While these measures provide a great deal of protection for the biodiversity within the Somerset Levels and Moors, we continually look to improve how we work and create a better place for people and wildlife."
        }
    ]
}