{
    "url": "https://defradigital.blog.gov.uk/2023/04/14/how-to-improve-civil-service-job-applications-and-ace-your-interviews/",
    "title": "How to improve Civil Service job applications and ace your interviews",
    "authors": [
        "Polly Whitworth"
    ],
    "categories": [
        "Defra digital"
    ],
    "pub_date": "2023-04-14T07:00:56+01:00",
    "content": [
        {
            "text": "As recruiters around the world have been celebrating International Recruiter’s Day, Polly Whitworth shares her tips for those thinking of applying for a job in the Civil Service, including how to avoid some of the common pitfalls in the written application process and the interview."
        },
        {
            "text": "I’m a huge cat lover (I expect you can tell from the picture)! I think I like cats so much because they are independent, and they “choose” their human."
        },
        {
            "text": "Like many people, I didn’t know what I wanted to do when I graduated. I studied International Relations and Mandarin Chinese, with a year spent abroad in Wuhan."
        },
        {
            "text": "I had the best time; however, I didn’t know what I wanted to do when I graduated. I sort of fell into Civil Service recruitment (as I know that I enjoy connecting people) and I have loved it ever since."
        },
        {
            "text": "Working in central government has many benefits including hybrid and flexible working, learning and development budget, diverse staff networks. up to 27% pension contribution, a generous cycle to work scheme, minimum of 25 days annual leave rising to 30 after five years’ service and a privilege day off to mark the King’s birthday."
        },
        {
            "text": "I work in a truly diverse and inclusive environment at Defra Digital data and technology; an environment that encourages ideas, new ways of working and supports my development as a recruiter."
        },
        {
            "text": "One of my academic interests was in gender, and I’ve been able use my knowledge of both recruitment and gender disparity in technology roles to implement a job advert text analyser that eliminates bias from our job descriptions."
        },
        {
            "text": "We’ve really seen a difference too; more women are now applying to our digital data and technology jobs than ever before, with an increase every year."
        },
        {
            "text": " "
        },
        {
            "text": "Working in Defra is not your typical ‘9 to 5’ either; there is also an opportunity to take up to three days off a year for volunteer leave. I take one of my volunteer days to go back to the University of Portsmouth and talk to the students about careers in the Civil Service, as well as providing them with hints and tips on how to apply."
        },
        {
            "heading": 2,
            "text": "Understanding the Civil Service recruitment process"
        },
        {
            "text": "Civil Service jobs use Success Profiles to assess candidates. This includes the need to demonstrate their experience, ability, technical skills, behaviours and strengths."
        },
        {
            "text": "We mark on a merit basis and use a Civil Service rating scale between 1 and 7 to score each assessment on the job advert. To pass to the next stage, you will require to score a 4 or more on each assessment."
        },
        {
            "text": "This means it’s very important to tailor your application specifically to what is required on the job advert. A standard job advert would normally require a CV and personal statement."
        },
        {
            "text": "Let’s go through the top elements you normally see on one of our Digital, Data and Technology Civil Service Job adverts."
        },
        {
            "heading": 2,
            "text": "Application: CV writing"
        },
        {
            "text": "You’ll find that most Civil Service Jobs adverts ask for CVs. Ensure you carefully read the Job Description and Person Specification, so you are clear what skills and experience are required for the role."
        },
        {
            "text": "Write your CV and provide examples on how you meet the criteria of the Person Specification. Try and write your examples using the STAR format."
        },
        {
            "heading": 2,
            "text": "Application: Writing your Personal Statement "
        },
        {
            "text": "Typically, the Personal Statement is 250-1,000 words long and the question will ask the following:"
        },
        {
            "text": "“'Referring to the \"Responsibilities and Skills and Experience' sections of the job advert, please demonstrate how you are suitable for the role by providing relevant examples.\""
        },
        {
            "text": "You should answer by providing evidence on how you have the relevant or transferable skills that match the requirements under the Person Specification section. Use the STAR format again here. Try to avoid including information that is not relevant to the role as this can eat up your word count. And do check out some of the various websites that provide Personal Statement writing tips."
        },
        {
            "heading": 2,
            "text": "Interview: Behaviours"
        },
        {
            "text": "When it comes to the interview, assessors will be looking for you to demonstrate evidence against the behaviours that were outlined in the original job advert."
        },
        {
            "text": "Behaviours are the actions and activities that you do which result in effective performance at a job. They may start with ‘Tell me about a time when…’. I’d recommend you really practice your STAR examples before the interview."
        },
        {
            "text": "Assessors may ask you follow-up questions from your example, which is great! They want you to give the best answer possible."
        },
        {
            "text": "You may find this hints and tips document helpful for deciding which examples to use at your Interview. There are some useful videos, for example this one by Jac Williams, and this one by CareerVidz, which help explain how to answer Behaviours questions."
        },
        {
            "heading": 2,
            "text": "Interview: Technical"
        },
        {
            "text": "Technical skills focus more on specific professional skills. The assessor could ask you to do a scenario-based exercise, test, or a presentation."
        },
        {
            "text": "You should prepare for this by understanding what is required of the technical skill and make sure you have prepared examples of you demonstrating that skill."
        },
        {
            "text": "We have a digital, data and technology framework that looks at some of the Technical skills that may be assessed at your interview if you are applying for a DDaT role."
        },
        {
            "heading": 2,
            "text": "Interview: Strengths"
        },
        {
            "text": "Strengths are things we do regularly, do well and that motivate us. Now is your time to shine!"
        },
        {
            "text": "These questions will require shorter answers, typically two minutes at the most. Examples of questions you might be asked include ‘What motivates you to get up in the morning?’ or ‘Would others describe you as an analytical person?’"
        },
        {
            "text": "You don’t need to apply the STAR format here. Don’t rehearse your answers either as we’re looking for a natural response."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Final Step: Perseverance"
        },
        {
            "text": "A final few words of wisdom. I feel that Civil Service jobs are in high demand because of the benefits we offer such as the unbeatable pension scheme and flexible working."
        },
        {
            "text": "If at first, you don’t succeed… try again! I applied for several Civil Service Jobs before I landed my current Resourcing Partner role at Defra. So don’t give up."
        }
    ]
}