{
    "url": "https://cddo.blog.gov.uk/2023/04/14/making-government-services-more-efficient/",
    "title": "Making government services more efficient",
    "authors": [
        "Ed Mack, Lead Analyst for Services, CDDO"
    ],
    "categories": [
        "CDDO",
        "Cross-government strategy",
        "Digital strategy",
        "Digital transformation"
    ],
    "pub_date": "2023-04-14T10:38:26+01:00",
    "content": [
        {
            "text": "The Central Digital and Data Office (CDDO) works with central government departments to support digital, data and technology transformation at scale."
        },
        {
            "text": "In the recently published cross government digital strategy, Transforming for a Digital Future, we committed to at least 50 of the government's top 75 identified services being at ‘great’ standard by 2025. As part of this, it’s important that services are of the highest possible quality to better improve outcomes for users whilst also representing the best value for money for the taxpayer."
        },
        {
            "text": "Initial estimates predict that digital transformation in government could enhance service quality and unlock over £1 billion of savings. The scale of opportunity then is huge. Some key opportunity areas include:"
        },
        {
            "heading": 4,
            "text": "Channel shift"
        },
        {
            "text": "As more and more of our daily interactions have become possible online (e.g. ordering our food shop or booking a trip), our research indicates that users expect more of their interactions with the government to also use digital channels. "
        },
        {
            "text": "There are many different potential channels: face-to-face, written, postal, telephone and finally, fully online, ‘digital’ interactions."
        },
        {
            "text": "Typically digital channels are the most efficient to run. Paper letters and forms involve a mix of planning, printing, packaging, posting, storing and scanning costs."
        },
        {
            "text": "However, it’s really important that all of our services are inclusive. Channel shift is about helping users choose the channel that meets their needs, to optimise both user needs and efficiencies. "
        },
        {
            "text": "For many services today, the majority of users are willing and able to use online services, but there are still many instances where users who do want to, cannot. Even when users can start a journey online, for a number of reasons they may later choose, or need to use offline channels."
        },
        {
            "text": "Departments can help empower more users to use digital channels by:"
        },
        {
            "text": "There will always be some cases where offline routes are important, but it’s important that when people want to interact with government services digitally they can do so easily, inclusively and effectively."
        },
        {
            "heading": 4,
            "text": "Failure demand "
        },
        {
            "text": "Failure demand occurs where users are unable to progress through a service journey without support. CDDO has researched some of the most common causes of this and we think there are opportunities for all of us to reduce their frequency. "
        },
        {
            "text": "Expanding the use of automated progress tracking features could help this. Many of us will be familiar with texts and emails we receive telling us about the status of parcels from online purchases."
        },
        {
            "text": "Knowing the application status in a service journey could be really important, for example, if a user needs to know if a payment will arrive before entering an overdraft, or if an important document will arrive before a holiday. "
        },
        {
            "text": "Getting the balance right with notification updates (or alternatively, access to updates via portals) so that people feel informed but not overwhelmed, can enable services to meet user needs and also reduce demand on customer support teams."
        },
        {
            "text": "There are opportunities to reduce failure demand by reviewing eligibility. This means making it as clear as possible for users to self determine whether they should apply for a service, an alternate service, or none at all. We’ve seen excellent examples of this where service teams have: "
        },
        {
            "text": "These methods can all help to reduce instances of failure demand. This is good for users who become able to self-serve and it also unlocks efficiency opportunities, helping customer support teams to focus resources on those who most need their help."
        }
    ]
}