{
    "url": "https://nationalscreening.blog.gov.uk/2023/08/04/progress-and-next-steps-in-the-uk-nsc-assessment-of-newborn-screening-for-sma/",
    "title": "Progress and next steps in the UK NSC assessment of newborn screening for SMA",
    "authors": [
        "Professor Anne Mackie"
    ],
    "categories": [
        "General"
    ],
    "pub_date": "2023-08-04T09:29:15+01:00",
    "content": [
        {
            "text": "Last November, we blogged about the start of a substantial piece of work to assess the case for newborn screening for spinal muscular atrophy (SMA)."
        },
        {
            "text": "Progress on this work was reported to the June 2023 UK NSC meeting and committee members endorsed a 2-fold recommendation for the project’s next steps – to simultaneously:"
        },
        {
            "heading": 2,
            "text": "About SMA"
        },
        {
            "text": "SMA is an inherited condition that can causes the nerves in the spinal cord to deteriorate. These nerves transmit instructions from the brain to the muscles that control a person’s ability to move, speak, swallow and breathe. Their loss causes gradual muscular weakening and muscle loss.  "
        },
        {
            "text": "SMA does not affect all individuals in the same way. Some babies have extra copies of a gene that can make up for some of the nerve and muscle problems. Some babies are affected very badly: their problems start from birth and this is sadly the most common type of the illness. Others might have a milder form of the illness and not get symptoms until they are an adult. "
        },
        {
            "text": "It is estimated that SMA affects 1 in every 10,000 babies, or approximately 70 babies born every year in the UK."
        },
        {
            "heading": 2,
            "text": "Recent developments "
        },
        {
            "text": "When the UK NSC reviewed the case for screening in 2018 it found there was still work to be done to determine if SMA screening and treatment met its criteria for what is a viable, effective and appropriate screening programme. See UK NSC evidence review criteria."
        },
        {
            "text": "Since then, treatments for SMA have been introduced in the NHS following recommendations from the National Institute for Health and Care Excellence (NICE) and the Scottish Medicines Consortium."
        },
        {
            "text": "These developments helped pave the way for the UK NSC to commission the School of Health and Related Research (ScHARR) at the University of Sheffield to carry out an in-depth analysis of the evidence."
        },
        {
            "text": "Reviewing the case for screening for very rare conditions can be difficult due to a lack of good quality evidence. The UK NSC has started to use disease, clinical effectiveness and cost effectiveness modelling to estimate the effects of screening and inform its recommendations, including its recent recommendation to introduce newborn screening for tyrosinaemia."
        },
        {
            "text": "Models combine existing published evidence, where available, with expert clinical and user views. This expert input can assist with understanding the screening pathway and the choices which affected families might wish to make."
        },
        {
            "text": "There are some published SMA screening models, but each takes a slightly different approach and uses different evidence. The UK NSC therefore asked ScHARR to examine these studies, including those by pharmaceutical companies, to see if any of them could be reused."
        },
        {
            "text": "ScHARR concluded that there should be a new, independent, modelling study for the UK screening context to address uncertainties and unanswered questions."
        },
        {
            "heading": 2,
            "text": "UK NSC recommendation"
        },
        {
            "text": "At its June 2023 meeting, the UK NSC recommended that a new independent modelling study on screening for SMA in the UK should be commissioned."
        },
        {
            "text": "Members also supported a proposal from the UK NSC’s fetal, maternal and child health (FMCH) expert group that work should start, in tandem, on planning for an in-service evaluation of SMA screening in NHS services in the UK. In-service evaluations are used to test proposed new screening programmes by implementing them in NHS services."
        },
        {
            "text": "The new model will help define important issues for the in-service evaluation while the evaluation will be used to collect data to feed into the model and test its assumptions. The findings of the evaluation will provide specific evidence on how newborn screening for SMA might work safely in the UK."
        },
        {
            "text": "The model and in-service evaluation will then inform the final UK NSC recommendation to ministers in all 4 UK countries on whether to recommend that SMA should be added to the UK’s newborn blood spot screening programmes."
        },
        {
            "heading": 2,
            "text": "Stakeholder engagement approach "
        },
        {
            "text": "The UK NSC’s approach to working with a range of stakeholders is described in the UK NSC’s stakeholder engagement strategy."
        },
        {
            "text": "Stakeholder engagement is a continuous and evolving process which has many elements, including careful management and awareness of potential conflicts of interest."
        },
        {
            "text": "The Secretariat has been working closely with the UK SMA Newborn Screening Alliance, which brings together clinicians, academics and patient organisations with a shared interest in newborn screening for SMA. Members of the Alliance have been playing an active role in workshops as part of the model scoping stage of the project."
        },
        {
            "text": "This collaboration has facilitated expert information sharing and transparent communication, helping the UK NSC and ScHARR develop a deeper understanding of the evidence and of the SMA community."
        },
        {
            "text": "The UK SMA Newborn Screening Alliance project manager said:"
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK National Screening Committee. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, email screeninginformation@dhsc.gov.uk."
        }
    ]
}