{
    "url": "https://ruralpayments.blog.gov.uk/2023/08/04/the-rpa-podcast-episode-6-transcript/",
    "title": "The RPA Podcast – Episode 6: Transcript",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "RPA podcast"
    ],
    "pub_date": "2023-08-04T10:38:04+01:00",
    "content": [
        {
            "text": "Executive Summary"
        },
        {
            "text": "Item 1: Sustainable Farming Incentive 2023: Expanded offer to rollout from August"
        },
        {
            "text": " "
        },
        {
            "text": "Item 2: Mapping (RLE1 and PLCD) – linked to CS (and SFI)"
        },
        {
            "text": " "
        },
        {
            "text": "Item 3: Farm Visits form improvement"
        },
        {
            "text": " "
        },
        {
            "text": "****Intro music to fade****"
        },
        {
            "text": "Beth: Hello and welcome to the sixth episode of The RPA Podcast. I’m Beth McAdam, and in today’s programme, we revisit the topic of mapping, and discuss why making accurate and timely updates to your land parcels is now more important than ever. We also discuss the Sustainable Farming 2023 standards and look at the great reasons to apply for them, and finally, we’ll be hearing about educational farm visits and how feedback from one farmer helped to significantly improve the Farm Visit Declaration Form."
        },
        {
            "text": "Xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx"
        },
        {
            "text": "****Music – leading to next segment ****"
        },
        {
            "text": "Item 1: Sustainable Farming Incentive 2023: Expanded offer to rollout from August"
        },
        {
            "text": " "
        },
        {
            "text": "Beth:  If you’re an existing Basic Payment Scheme, or BPS, recipient, you may wish to consider applying to the Sustainable Farming Incentive, which provides quarterly payments to help farmers manage land, in a way that supports food production and improves farm productivity and resilience, while also protecting and improving the environment. The SFI 23 offer was launched last month and here to talk about it is Ali Johnson, RPA’s Engagement and Operational Readiness Director. Thanks for joining us Ali"
        },
        {
            "text": "Ali: It’s good to be here."
        },
        {
            "text": "Beth:  I believe that the new and improved Sustainable Farming Incentive 2023 will be rolled out from August this year and will offer farmers additional actions and more flexibility to choose the actions they want to get paid for?"
        },
        {
            "text": "Ali: That’s right. Farmers will get paid for taking actions that deliver vital benefits and support food production. Additional actions under SFI 2023 which will help ensure there’s an offer that’s attractive and workable for all types of farms. There going to be 23 actions to choose from, which cover existing themes including soil health and moorland, as well as new actions on hedgerows, integrated pest management, nutrient management, farmland wildlife, buffer strips, and low input grassland."
        },
        {
            "text": "Beth:  And what are the benefits of being in SFI 2023?"
        },
        {
            "text": "Ali: There are a lot of benefits. There are more than twice as many new SFI actions as originally planned. You can combine as many actions to your agreement as you like with no minimum area of land required. You’ll also be able to add more actions and eligible land to your agreement each year."
        },
        {
            "text": "SFI 23 offers a reliable income – If you complete the actions, you’ll receive payment every 3 months. There’s a management payment of £20 per hectare for the first 50 hectares to cover participation costs. There are the same payment rates for farms in upland and lowland areas and an additional annual payment for common land."
        },
        {
            "text": "Farmers can decide how best to achieve each action’s aim, rather than prescriptive one-size-fits-all rules on how you carry out actions.  How you do that is up to you and we’ll work with you to fix things if they go wrong."
        },
        {
            "text": "For tenant farmers, there are shorter agreement lengths that don’t require landlord consent, making it much more accessible to those on short-term agreements, and includes a range of new actions not previously available in schemes."
        },
        {
            "text": "We want farmers to be able to access a package that works best for them. SFI will remain flexible to allow for the changing needs and requirements of both farmers and their markets to ensure the best outcome for food production and the natural environment.”"
        },
        {
            "text": "Beth: And how easy is it to apply for?"
        },
        {
            "text": "Ali: The scheme is straightforward to apply for online – farmers will be shown the options available to their farm. It’s less prescriptive than before, so farmers can choose their own combination of actions in a new ‘pick and mix’, if you like, structure. There’s no minimum or maximum land area or hedgerow length, so farmers can choose how much land to cover with their SFI agreement. You don’t need the permission of your landlord to apply for an agreement if you're a tenant farmer, and tenants can have an SFI agreement even if they’re on a shorter, rolling tenancy contract."
        },
        {
            "text": "Beth: Can you also apply for SFI if you’re in Countryside Stewardship?"
        },
        {
            "text": "Ali: Yes, you can have a Countryside Stewardship or Environmental Stewardship  agreement and an SFI agreement at the same time. SFI actions and Countryside Stewardship options can be combined in the same parcels, and on the same areas of land within the parcels, if the land is eligible for both schemes and importantly if the actions are compatible. We of course won’t pay you twice if you carry out the same action on the same piece of land."
        },
        {
            "text": "Beth: And it opens in August?"
        },
        {
            "text": "Ali: Yes, applications will start to be accepted through a controlled rollout beginning in August."
        },
        {
            "text": "SFI 2022 has now closed for applications to enable a smooth transition to the 2023 offer, and recognising that the 23 offer is structured quite differently. We’ve already been in touch with all farmers signed up to the 22 scheme, as well as those who had submitted applications to the 22 scheme but perhaps not yet had an agreement,  We’ve explained how they can access the new scheme,  when that will be, the benefits and improvements in the that offer."
        },
        {
            "text": "In short, if you’re already in SFI, you will be able to access the full 2023 offer. You won’t be at any disadvantage because you entered the earlier version of the scheme and we’ll work with you to make the transition as seamless as possible for you."
        },
        {
            "text": "Beth: And where can people find more information?"
        },
        {
            "text": "Ali: We’ve published a new SFI Handbook giving farmers all the detail they need in a single document. on GOV.UK. We’ve also made it easier for farmers to quickly see what’s on offer for their farm type by producing sector-specific guides. You can read about eligibility, payment rates, actions and the application process on the Sustainable Farming Incentive guidance page on GOV.UK. There is also a great blog about it, and a more detailed podcast with more information available on the Defra Farming Blog."
        },
        {
            "text": "Beth: So finally, Ali, to sum up, why should people apply for SFI? "
        },
        {
            "text": "Ali: There are a number of very good reasons to apply. We’ve listened to the great feedback we’ve had from farmers, and done a huge amount to streamline and improve the Sustainable Farming Incentive, making it as simple and flexible as possible for farmers to engage with and apply for. We’ve been working with farmers to make sure that the application process is clear and straightforward.  If your land is eligible and the actions you pick are compatible, you’ll get an agreement. It's as simple as that. There’s no competitive to the scheme. The agreement will start the month after you accept it."
        },
        {
            "text": "You get paid for actions that support your business, food production and the environment. Farmers doing these activities tell us they benefit their farm business by helping reduce costs and get an income from less productive areas of land. It’s also straightforward to apply and manage your agreement. You can apply online and your agreement will start the month after you accept it. We’ve changed the way we check delivery of the agreement to make it more flexible and pragmatic - we don’t apply penalties and where things don’t go as planned, we’ll work with you to help you  fix it.  There is no lower limit on the amount of land you can enter into SFI or the actions you can take. Once you’re in SFI, you can on an annual basis add more land and actions to your agreement. And finally, regarding payments, you’ll be paid quickly and payments are made quarterly and it’s also worth mentioning again that you can be in SFI and Countryside Stewardship at the same time as long as the actions are compatible and we’re not already paying you for the action under CS."
        },
        {
            "text": "Beth: Ali thank you."
        },
        {
            "text": "****Music – leading to next segment ****"
        },
        {
            "text": "Item 2: Mapping (RLE1 and PLCD) – linked to CS (and SFI)"
        },
        {
            "text": "Beth: It’s vital that farmers provide timely land mapping updates when applying for agri-environment schemes, as this will ensure they receive timely and accurate payments. Joining us today to talk more about this is Anne-Marie Rafter from RPA’s Geospatial Services."
        },
        {
            "text": "Anne-Marie, thank you for joining us today to talk about how important it is that farmers ensure their land details are accurate before applying for schemes."
        },
        {
            "text": "Anne-Marie:  Hi, Beth, yes indeed. Your land information must be current and complete before you begin the application process, so if you have any land updates, changes or corrections, it’s important to notify RPA of any changes as the land data is needed by us to ensure that we can make accurate payments."
        },
        {
            "text": "We want to ensure farmers update their land details as soon as there’s any change, as, unlike the Basic Payment Scheme, you’re unable to apply for schemes like Countryside Stewardship Mid Tier or the Sustainable Farming Incentive if there’s any outstanding mapping work. Land details shown on your digital maps in the Rural Payments service are used for several of the land-based schemes and that’s why it’s important to keep your mapping up to date."
        },
        {
            "text": "Beth: And this must be actioned first by submitting an RLE1 form?"
        },
        {
            "text": "Anne-Marie:  That’s right. The RPA RLE1 form enables you to make changes to your digital maps, register new land and transfer land."
        },
        {
            "text": "We’ve also published a blog giving detailed RLE1 guidance to support you through the process, so look out for that on the RPA blog, along with a number of other blogs about the importance of updating your mapping details. But generally, farmers can help us by making sure all the required fields are completed within the RLE1 form, and by providing clearly annotated maps, as this helps to reduce the time taken to process mapping changes and may reduce the need for further clarification conversations, as well as following the guidance when emailing forms."
        },
        {
            "text": "Beth: So how many land parcels does RPA keep track of and how?"
        },
        {
            "text": "Anne-Marie:  We keep track of a lot of land parcels. RPA maps and tracks 2.6million land parcels, using a range of intelligence and technology to keep these as accurate as possible and we receive over 20,000 RLE1 forms each year requesting mapping changes. Providing a timely turnaround is reliant on us receiving that accurate information from farmers and land managers."
        },
        {
            "text": "You can see the digital maps of all the land parcels registered to your holding using the Rural Payments service on GOV.UK."
        },
        {
            "text": "Beth: And I believe you’ve been doing work to make the process simpler over the last couple of years?"
        },
        {
            "text": "Anne-Marie:  Yes, we’ve also increased the use of geospatial data to reduce the visit burden on farmers. Geospatial data is geographical data which includes legal boundaries, reference features, land cover types, linear features and background imagery. We use this information to monitor any issues with scheme controls, concerns from farmers, and areas where advice is being requested. This helps us to support farmers and land managers to meet outcomes before a Field Officer visits."
        },
        {
            "text": "We’re also currently exploring digital options that can be accessed online, but at the same time ensuring we maintain accessibility for all. We’re exploring options to allow farmers and land managers to amend their land details online, which aims to reduce the amount of time to submit land changes and improve processing times. We’re reviewing options and will outline these at a later date. This builds on the RLE1 improvements we made in 2020, when a new process was launched, which gave the option of completing a digital RLE1 form. This has proven to be a very popular submission route, with over 75% of the forms now being received via email."
        },
        {
            "text": "We’re also looking to improve our online guidance, and also to improve understanding about what we do and why, so do check out the RPA blog as there’s more information on there."
        },
        {
            "text": "One of the most recent improvements to the mapping process was for SFI. We delivered an online functionality that allows farmers to tell us about simple land cover changes without the need to contact the helpline or send in an RLE1 form. We’re hoping to develop this further and make it available to all this year."
        },
        {
            "text": "Beth: Anne-Marie, thank you so much."
        },
        {
            "text": "****Music – leading to next segment ****"
        },
        {
            "text": "Item 3: Farm Visits form improvement"
        },
        {
            "text": "Beth: As part of Countryside Stewardship, educational access allows for school pupils to visit farms -to learn, understand and become engaged with farming and the environment. We recently spoke to Helen, from New Hall Farm in South Yorkshire, about her farm visits and their benefits, along with how her recommendations helped to improve the Farm Visit Declaration Form, which is completed by agreement holders before and during each visit."
        },
        {
            "text": "Helen: We've been doing educational visits for a long time now, and over the years, particularly since COVID, we've seen an even bigger benefit from them. So, the visits we have, we have a general layout where in the morning we do a farm walk, have a look at some of the farming we do, the crops we grow, maybe how much seed we need to buy, do a bit of maths, have a look at the growing crop at whatever stage it's at. We'll have a look at the margins and the hedges and talk about why they are important on the farm. And at the end of that we'll have some sort of hands-on activity. Might be digging for worms. It could be doing a bug hunt in one of the pollen and nectar margins, or it could be in the autumn, could be collecting leaves."
        },
        {
            "text": "And then in the afternoon we do quite often it's milling wheat into flower, going to look at the sheep. We've got a few sheep and then we've got all sorts of different skulls. So looking at dentition and teeth and, and how different animals have got different teeth and yeah, a bit of all sorts maybe sitting on a tractor. And from, from what I see, the benefits that children get is just astounding. Yeah, you've got children, particularly if for working with a country trust where they're coming out of sort of any city schools, they've never even seen a nettle, never mind anything else and just the space. And it's marvellous. And one teacher said to me, yeah, we can go to a petting farm and we get back at the end of the day and say, well, we stroked a rabbit, we stroked a guinea pig. We come here, there's endless extra sort of work that they can build on from the visit."
        },
        {
            "text": "My biggest issue with the form previously, I think it was five or six pages long. So we'd have a group of maybe 30 children with maybe four adults, and we would have to ask them to fill a form in at lunchtime, halfway through the day, because by the time you're going home, there just isn't time. So by the yeah, you've taking up more or less the lunch break for some of the teachers when they're supposed to be supervising the children."
        },
        {
            "text": "In terms of contacting the RPA to discuss it, they actually came to me first. So that was, you know, a nice, nice surprise. And yeah, that actually sort of putting ideas in, yeah, definitely, I felt listened to. Kind of dumbfounded to see it so brief. Yeah, delighted. Yes, I want to get feedback from schools but you know, I can do that by talking to them, I mean I just do ours orally. But that is just fabulous. I can fill in most of the front of it, which is the factual when they’re coming, who they are. That leaves just one box and a signature really, for the school to do. Fantastic."
        },
        {
            "text": "Beth: Thanks to Helen for sharing her experiences, and also for her fantastic feedback and suggestions, which have had a huge impact in simplifying the Farm Visit Declaration form."
        },
        {
            "text": " "
        },
        {
            "text": "****Music – leading to next segment ****"
        },
        {
            "text": "Beth: So, that’s all we’ve got time for today. Thank you to Ali, Anne-Marie and Helen - and thank you, once again, for listening. We’ve covered a range of topics again today, but we’re always happy to receive your questions and suggestions. So, if you’d like us to cover a particular topic or issue with our subject experts, please get in touch. You can e-mail us at External.Affairs@rpa.gov.uk, or you can follow us on Twitter - @Ruralpay - or follow the Rural Payments Agency on Facebook. We’ll be back soon with the seventh episode of the RPA podcast, as we keep you updated on developments at the RPA and support you through the agricultural transition process. Goodbye."
        },
        {
            "text": " "
        },
        {
            "text": "****Close music to fade****"
        }
    ]
}