{
    "url": "https://ruralpayments.blog.gov.uk/2023/08/04/the-rural-payments-agency-podcast-episode-6/",
    "title": "The Rural Payments Agency Podcast: Episode 6",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "RPA podcast"
    ],
    "pub_date": "2023-08-04T10:39:17+01:00",
    "content": [
        {
            "text": "Welcome to the sixth episode of The RPA Podcast."
        },
        {
            "text": "In our latest episode, Ali Johnson, RPA’s Engagement and Operational Readiness Director, discusses the 2023 Sustainable Farming Incentive and highlights the greater flexibility available in SFI23. We also discuss the roll out date, application process and transition from other schemes."
        },
        {
            "text": "Later in the episode, Anne-Marie Rafter, from RPA’s Geospatial Services, talks us through how to update land details and why it is essential to do so as soon as possible, to ensure there are no delays to receiving agri-environmental grants. We also discuss how the process of updating land data has been simplified and how it will soon be possible to amend land details online."
        },
        {
            "text": "Finally, we hear from Helen, from New Hall Farm in South Yorkshire, about her educational farm visits and their benefits, along with how her recommendations helped to improve the Farm Visit Declaration Form, which is completed by agreement holders before and during each visit."
        },
        {
            "text": "You can also read the transcript for this episode here."
        },
        {
            "text": "The RPA Podcast is an opportunity to engage with farmers and land managers in a new way, and we encourage you to reach out to us with suggestions of particular topics that you’d like us to cover with our subject experts. You can e-mail us at External.Affairs@rpa.gov.uk."
        },
        {
            "text": "You can listen to episode 6 of The RPA Podcast, as well as earlier episodes, on Apple and Spotify, or through Buzzsprout."
        },
        {
            "text": "Follow us on social media for the latest updates and information on the following accounts."
        },
        {
            "text": "By following and subscribing to our social channels and blog, you’ll be able to see the latest updates about important information."
        },
        {
            "text": " "
        }
    ]
}