{
    "url": "https://civilservicelocal.blog.gov.uk/2021/09/23/black-history-month-2021-black-women-in-public-life-our-stories-have-power/",
    "title": "Black History Month 2021: Black Women in Public Life - 'Our stories have power'",
    "authors": [
        "Jonathan Agard"
    ],
    "categories": [
        "A National Spotlight",
        "East, South East & London"
    ],
    "pub_date": "2021-09-23T12:32:21+00:00",
    "content": [
        {
            "text": "Civil Service Local East, South-East and London (ESEL) and the Department for Levelling up, Housing and Communities (DLUHC) Race network - BAMEnet, are proud to invite you to their first ever cross-departmental Black History Month (BHM) national event."
        },
        {
            "text": "Join us online on 7 October 2021, as we acknowledge the hard work, sacrifices and the amazing and inspiring contribution of dedicated pioneers who have helped to shape and contribute to our society as well as the many dedicated individuals who have continued the great work set by their predecessors."
        },
        {
            "heading": 3,
            "text": "What is BHM?"
        },
        {
            "text": "BHM is an annual global event observed in the UK in October to celebrate the culture, history and achievements of African Caribbean communities and it is vital in bringing communities together."
        },
        {
            "text": "BHM is a milestone period for the Civil Service as it spotlights and celebrates the contributions of great Black British achievers and highlights the experiences and voices from the Black community. This event is a civil service cross-departmental effort which demonstrates unity amongst Government race networks and departments, and which reflects positively the Civil Service’s desire to strengthen its resolve in promoting and facilitating diversity and inclusion at all levels, enabling this to read across to the work that we do for citizens. "
        },
        {
            "heading": 3,
            "text": "Our theme is Black women in public life  – ‘Our stories have power’"
        },
        {
            "text": "Focusing on the achievements, lived experiences and issues facing the black community (including those from African, Caribbean and mixed ethnicity and those born abroad), this event will highlight the work and positive contributions of black people to British society. "
        },
        {
            "heading": 3,
            "text": "Our speakers:"
        },
        {
            "text": "You will hear ‘real’ stories of inspiration from an array of high profile guest speakers, talking about what BHM means to them, including:"
        }
    ]
}