{
    "url": "https://aphascience.blog.gov.uk/2021/09/23/international-global-coronavirus-network/",
    "title": "APHA Virologist co-directing the new UK - International Global Coronavirus Network (UK-ICN)",
    "authors": [
        "Jane Tennant"
    ],
    "categories": [
        "APHA news",
        "COVID-19",
        "Viral diseases"
    ],
    "pub_date": "2021-09-23T11:04:24+01:00",
    "content": [
        {
            "text": "This exciting new 4-year initiative, just announced, is jointly funded by the Biotechnology and Biological Sciences Research Council (BBSRC) and Department for Environment, Food and Rural Affairs (Defra)."
        },
        {
            "text": "The UK-ICN is linked to the expanding Coronavirus programme at APHA funded by Defra surveillance and diagnostics, and Research and Development, EU OHEJP-COVRIN, COVID-19 National Core Studies (HDRUK), MedVetNet Association and including delivering on our the first UKRI directly funded project as a Public Sector Research Establishment (PSRE) ‘SLIDE’ SARS-CoV-2 Longevity of Infection dynamics and evolution (animal-human interface)."
        },
        {
            "text": "APHA, along with the director and other co-directors (Figure 1) of the network, will be able to provide crucial advice via other Network-of-Networks (Figure 2), to stakeholders and policy makers, as well as more widely to key international bodies such as the STAR-IDAZ, OIE, WHO and FAO."
        },
        {
            "heading": 3,
            "text": "Who is in our network?"
        },
        {
            "text": "University of Liverpool and other co-directors at key UK institutions including Roslin, The Pirbright Institute, University of Cambridge and APHA."
        },
        {
            "text": "From APHA, Sharon Brookes, our Lead Scientist for Animal and Zoonotic Viral Diseases Portfolio (AZVDP), is a co-director of the UK-ICN, and will be drawing on the extensive expertise across APHA. Sharon is a world-renowned virologist with oversight for AZVDP science strategy and delivery in the areas of Virology and related disciplines including SARS-CoV-2 and other Coronaviruses."
        },
        {
            "text": "Sharon is a member of several of the UK-ICN Network partnerships, she is also on the Microbiology Society Council, a Royal Society of Biology ambassador, and part of the EPIZONE - European Research Group and International Veterinary Vaccinology Network (IVVN)."
        },
        {
            "text": "This single international network will bring together researchers and stakeholders from across the globe and will enhance knowledge of animal, human and zoonotic coronaviruses to help us all to better prepare for, respond and/or hopefully prevent, any future outbreaks. This really is a hugely important and exciting network!"
        },
        {
            "text": "Defra’s Chief Scientific Adviser, Gideon Henderson, commented on this excellent new network saying:"
        },
        {
            "heading": 3,
            "text": "Why do we need this Global network?"
        },
        {
            "text": "The COVID-19 pandemic has definitely stressed how urgent it is to advance and develop our knowledge and understanding of the biology of coronaviruses that can infect both animals and humans.  Diseases like this shine a light on the importance of embracing an integrated One Health approach with connectivity between environment, animal and human research areas."
        },
        {
            "text": "This Global network will help to better understand coronavirus infections and promote links between researchers of different scientific and behavioural disciplines."
        },
        {
            "text": "Sharon Brookes explains that we have brought together key people in the UK, stakeholder institutions, industry, international partners and other networks.  There is a particular focus on coronaviruses that cause diseases relevant to food security (livestock), wildlife, companion animals or humans and those at the zoonotic interface; in simple terms diseases caused by viruses that can transfer from animals to humans or human to animals."
        },
        {
            "heading": 3,
            "text": "How will the network help us tackle COVID?"
        },
        {
            "text": "Animal coronaviruses cause substantial disease and economic loss in many countries. In the last two decades we have seen three coronaviruses (SARS, MERS, SARS-CoV-2) emerge from animal reservoirs with devastating effects on human health and society. Of course, the most recent, SARS-CoV-2 which causes COVID-19, has resulted in a global pandemic that has killed over 2 million people so far, destroyed livelihoods and caused a degree of upheaval not seen since World War 2. We are all more than familiar with this pandemic and its global effects unfortunately!"
        },
        {
            "text": "Establishing this broad-based international network which is centred in a research-intensive country like the UK will ensure that lessons in coronavirus control and treatment that have been learned globally will be rapidly shared within the international research community."
        },
        {
            "text": "APHA’s excellent science breadth in coronaviruses at the zoonotic interface and diseases of both animals and humans is a key part of this complementary skills and knowledge-based network, and Sharon is a driving force within the network."
        },
        {
            "text": "Sharon explains that the network will provide an excellent opportunity to enable junior scientists, the scientific leaders of the future, to participate virtually and face-to-face developing their own contacts and research beyond this initiative."
        },
        {
            "text": "Part of the goals of this network is to ensure that coronavirus research is firmly embedded in our science and policy for the future. APHA’s involvement, and the funding provided by Defra and BBSRC-UKRI, will also help to identify gaps in our research knowledge for global advisory bodies OIE, WHO, FAO."
        },
        {
            "text": "This is vital because it has been clearly demonstrated to all that the spread of human and animal coronaviruses (and other infectious diseases) do not respect political, country or continent borders."
        },
        {
            "heading": 3,
            "text": "What is the purpose of the network?"
        },
        {
            "text": "Sharon highlights that developing a holistic One Health (environment, animal and human) science and behaviours approach to understanding how this class of viruses is managed remains a key network goal now and beyond our four year stewardship."
        },
        {
            "text": "The project will cement longer lasting ties, bringing together researchers and social scientists, developing the next generation of expertise and ensuring long-term continuity, funding and sharing of resources to ensure we mitigate the next veterinary-human medical zoonotic coronavirus event."
        },
        {
            "text": "Everyone in the network will share knowledge to speed progress and ensure that lessons learnt in one area are passed on and adapted for others. This will include strategies for effective surveillance and detection of pathogens and disease intervention or mitigation tactics for animals and humans."
        },
        {
            "heading": 3,
            "text": "Our science blog"
        },
        {
            "text": "Important achievements are published regularly on the APHA science blog with the aim to improve the communication of our science to a wider audience. It covers a range of scientific highlights from special interest stories on our scientists through to more detailed reports on the excellent science we do."
        },
        {
            "text": "You can subscribe to the blog or follow the work of APHA via our official social media platforms: Facebook, Twitter and LinkedIn. These are regularly updated with news stories, calls to action and notification of the publication of new science blogs."
        },
        {
            "text": " "
        }
    ]
}