{
    "url": "https://educationhub.blog.gov.uk/2021/09/national-eye-health-week-how-might-my-child-benefit-from-the-glasses-in-classes-pilot/",
    "title": "National Eye Health Week: How might my child benefit from the ‘Glasses in Classes’ pilot?",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Schools"
    ],
    "pub_date": "2021-09-23T12:39:41+01:00",
    "content": [
        {
            "text": "Good eyesight in children can have a huge effect on literacy and academic attainment. If a child cannot see the board properly or read their book it can affect their progress at school. Reading is key to unlocking the rest of the curriculum for children and we know those who struggle to read will struggle in all subjects not just English. Even more significantly, research shows that children from disadvantaged backgrounds who read habitually for pleasure can overcome their circumstances and even outperform more affluent pupils."
        },
        {
            "text": "That is why during National Eye Health Week this month (21-27th September) the department is extending its ‘Glasses in Classes’ initiative. Here’s what you need to know about the programme and what it means for your child."
        },
        {
            "heading": 3,
            "text": "What is ‘Glasses in Classes’? "
        },
        {
            "text": "‘Glasses in Classes’ is a trial which tests the impact of providing an additional free pair of glasses to pupils who need them in class."
        },
        {
            "text": "It was launched in 2018 in Bradford after figures showed that 30% of pupils who need glasses haven’t been to an optician to get them and disadvantaged children are more likely to not get or wear them."
        },
        {
            "text": "Schools were given the results of the vision screening tests their pupils take in reception class so they knew who to support."
        },
        {
            "text": "Children are already entitled to free NHS sight tests and vouchers to help with the cost of glasses. The Bradford trial provided a second pair to be kept in school and a trained vision co-ordinator, usually a teaching assistant, worked with the child, family and teacher to provide the support needed and make sure they wear them in class."
        },
        {
            "heading": 3,
            "text": "How is the scheme being extended? "
        },
        {
            "text": "The trial is being extended to five new regions in a bid to help narrow the attainment gap in literacy. Pupils in Derby, Doncaster, Durham, Norwich and Breckland, and the North Yorkshire Coast will benefit from extending this project. Children in these areas will receive two pairs of glasses, one for home and one for school, and staff will be trained to ensure they are wearing them in class to help level up literacy outcomes for children."
        },
        {
            "text": "The expansion marks National Eye Health Week (20 to 26 September) which is also a reminder of the importance of regular eye tests and good eye health for everyone. Catching problems early with children’s vision will help improve their life chances and prevent more intrusive health interventions in the long term."
        },
        {
            "heading": 3,
            "text": "What else is the department doing to ensure all children can read and write fluently? "
        },
        {
            "text": "We have strengthened the national curriculum and since 2013 explicitly required schools to teach reading using systematic phonics. The Phonics Screening Check introduced in 2012 ensures every six-year-old is on track in learning to read providing indisputable evidence phonics works: in 2019, 82 per cent of pupils in Year 1 met the expected standard in the Phonics Screening Check, compared with just 58 per cent when the check was introduced in 2012. For disadvantaged pupils, this figure rose from 45 per cent to 71 per cent."
        },
        {
            "text": "A new Reading Framework highlights the most effective ways schools have taught children to read and cultivate a life-long love of reading. To support schools further, in 2018 we also launched our £43 million English Hubs programme, comprising 34 primary schools that are outstanding at teaching reading. To date, the programme has helped more than 5,000 other primary schools in England deliver excellent phonics teaching."
        },
        {
            "heading": 3,
            "text": "How can I find out more about ‘Glasses in Classes’ and what’s happening in my area?"
        },
        {
            "text": "There’s more information about ‘Glasses in Classes’ in this health and education guide, also featuring other projects funded by the department’s Opportunity Area programme, so we can share what we’ve learnt to help even more young people fulfil their potential."
        },
        {
            "text": "NHS sight tests are free for a large proportion of the population, including children, people aged 60 and over and those on income related benefits. Optical vouchers are also available for eligible groups, including children, to help with the cost of glasses."
        },
        {
            "text": "The UK National Screening Committee recommends vision screening for four to five-year-olds and local authorities are responsible for this as part of the healthy child programme. There’s more information about vision screening with advice and resources from Public Health England to help those providing high quality local screening services."
        }
    ]
}