{
    "url": "https://civilservice.blog.gov.uk/2021/09/23/new-beginnings-in-the-civil-service-world-of-wellbeing/",
    "title": "New beginnings in the Civil Service world of wellbeing",
    "authors": [
        "Sarah Healey, DCMS Permanent Secretary and CS Disability Champion"
    ],
    "categories": [
        "A great place to work",
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Ambitious Civil Service"
    ],
    "pub_date": "2021-09-23T08:21:12+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Wellbeing is at the heart of Civil Service culture, and post-pandemic, it has never been more important. Sarah Healey, the new Health and Wellbeing Champion, lauds our recent achievements and looks ahead to new priorities including the upcoming Civil Service Mental Health and Wellbeing Conference."
        },
        {
            "text": "Our wellbeing is vital to every aspect of our lives so I’m very pleased to take up the role of Civil Service Wellbeing Champion. This is in addition to my role as Disability Champion, which has been very fulfilling over the last year, but on which there remains much more to do. I’ve learned so much from meeting disabled colleagues, champions, and networks, and am looking forward to doing the same on health and wellbeing. "
        },
        {
            "text": "We all have different ways of looking after our wellbeing - some of which have been quite hard to keep up over the last 18 months. Everything I do to maintain my own are things which I find a lot of fun, but when it comes to making sure they happen, I take it very seriously indeed! "
        },
        {
            "text": "That’s because when we feel our best, we’re able to achieve more and feel more fulfilled and purposeful. This is about both our physical and mental health and wellbeing - both are important to be at our best. "
        },
        {
            "text": "One of my favourite ways to maintain my wellbeing is exercise, which helpfully is two for the price of one, because it improves both my physical and mental health. If you’ve never exercised before, or let it slide in lockdown, it’s worth trying to find something you enjoy and can take part in.  "
        },
        {
            "text": "I was one of those people who intensely disliked sport at school so didn’t take part in any physical activities right through my twenties. Then in my early thirties, after I had my three children, I joined some friends at a fitness class in the park on a Saturday morning. "
        },
        {
            "text": "I progressed from that to working out at least five times a week now. I often don’t feel like it - but I always love it afterwards. I maintain my enthusiasm by trying new sports - my latest is hot yoga. I am truly terrible at yoga, but that’s no reason not to do it! Exercise makes me feel happier, makes me feel like I can accomplish hard things and makes me resilient. "
        },
        {
            "heading": 4,
            "text": "Enjoying big lunch"
        },
        {
            "text": "I also love to spend time with friends - nothing makes me happier than enjoying a big lunch with my friends and family on a weekend stretching into early evening. I missed that so much during the pandemic. "
        },
        {
            "text": "I replaced it with long walks with a single friend as permitted during this endless January to April. Whilst it wasn’t quite the same, I discovered a walk is a good way to properly catch up, fulfils a bit of my exercise needs, and is a great way to discover beautiful local places which you may not otherwise have explored."
        },
        {
            "text": "Plus it turns out every parent who takes their children out for some ‘fresh air’ is absolutely right - fresh air does do you good. I think we’ve probably all had to seek pleasure in small things over the last 18 months and this was definitely one of mine."
        },
        {
            "heading": 4,
            "text": "Healthy and happy"
        },
        {
            "text": "That’s how I try to keep healthy and happy. But sometimes no amount of exercise or positive activities can prevent people experiencing anxiety or ill health, physical or mental. I have experience in my family of severe anxiety, for instance, and the fact that it can happen to anyone at any time. When it does, it’s important people can get the help they need."
        },
        {
            "text": "So what is the role of the Civil Service in supporting your health and wellbeing? Well, for a long time now, employers have recognised that they get the best from their people when they care about their health and wellbeing in the round. "
        },
        {
            "text": "People who feel well and healthy get the most out of life and out of work - that’s got to be good for everyone. And it’s sometimes the case that work leads to negative consequences for health and wellbeing which employers need to be mindful of. Stress can affect mental and physical health, for instance, and we need to be aware of, and mitigate, harmful  effects."
        },
        {
            "text": "In my new role as Wellbeing Champion I will be meeting senior representatives from departments soon to discuss what our priorities for 2022/23 should be to make us a healthier, happier Civil Service. An area of continued focus will tackle mental health and working through the anxiety experienced by many following the events and challenges over the last 18 months. "
        },
        {
            "text": "I will also be taking part in this year’s Mental Health and Wellbeing Conference, taking place 4 to 15 October, spanning World Mental Health day on 10 October. It looks to be a fantastic conference with some excellent speakers Anxiety UK, Channel 4, Sir Anthony Seldon from Action for Happiness and Ruby Wax (left) along with civil servants sharing their own experiences."
        },
        {
            "text": "Lastly, thank you everyone for your continued hard work and perseverance during the pandemic. I would also like to highlight the very successful collaboration between CSHR and the Charity for Civil Servants to launch the hubs for the current priorities of Burnout, Smarter Working and Bereavement and Loss. I encourage you all to click on these links and to get involved with the initiatives happening in your own departments."
        }
    ]
}