{
    "url": "https://phescreening.blog.gov.uk/2021/09/23/new-guidance-to-help-nhs-breast-screening-providers-and-commissioners-tackle-inequalities/",
    "title": "New guidance to help NHS breast screening providers and commissioners tackle inequalities",
    "authors": [
        "Emma O'Sullivan"
    ],
    "categories": [
        "NHS Breast Screening Programme"
    ],
    "pub_date": "2021-09-23T09:33:08+01:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "The NHS population screening inequalities strategy sets out how PHE and our partners aim to tackle screening inequalities."
        },
        {
            "text": "The strategy emphasises the importance of making sure there is equitable access to screening services and of supporting people to make a personal informed choice about participating in screening."
        },
        {
            "text": "In support of that aim, we have published a wide range of national guidance and resources for local screening providers and commissioners on GOV.UK."
        },
        {
            "text": "We have now added to this suite of resources by publishing new national guidance to support providers and commissioners in addressing inequalities throughout the NHS breast screening programme pathway."
        },
        {
            "text": "The new guidance includes a wealth of information, resources and signposting related to:"
        },
        {
            "heading": 2,
            "text": "Thanks to all who helped develop these recommendations"
        },
        {
            "text": "The guidance includes recommendations from a research project, funded by the Department of Health and Social Care through the Health and Wellbeing Alliance. The project aimed to identify:"
        },
        {
            "text": "Many thanks to the following groups, who worked with us on the project:"
        },
        {
            "heading": 2,
            "text": "PHE Screening blog"
        },
        {
            "text": "The PHE Screening blog provides up to date news from all NHS screening programmes. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new blogs. If you have any questions about this blog article, or about population screening in England, please contact the PHE screening helpdesk."
        }
    ]
}