{
    "url": "https://phescreening.blog.gov.uk/2021/09/23/nhs-newborn-hearing-screening-11-million-babies-and-counting/",
    "title": "NHS newborn hearing screening: 11 million babies and counting",
    "authors": [
        "Julie Tucker",
        "Catherine Magee"
    ],
    "categories": [
        "NHS Newborn Hearing Screening Programme"
    ],
    "pub_date": "2021-09-23T15:43:54+01:00",
    "content": [
        {
            "text": "The NHS Newborn Hearing Screening Programme (NHSP) has reached another major milestone, having now screened 11 million babies."
        },
        {
            "text": "The programme has played a major role in identifying moderate to profound hearing loss in newborn babies in England. One to two babies in every 1,000 are born with permanent hearing loss in one or both ears, which can significantly affect a baby’s development."
        },
        {
            "text": "Before the introduction of the programme, half of children with moderate to profound hearing loss were not identified until they were 18 months old and a quarter were not identified by three and a half years of age. Early identification provides a better chance of children developing language, speech, and communication skills. It gives these babies the opportunity to make the most of social and emotional interaction with their family and has a positive effect on their social and emotional development."
        },
        {
            "text": "More than 22,000 babies have been diagnosed with a moderate or worse hearing loss thanks to the screening programme."
        },
        {
            "heading": 2,
            "text": "Praise and recognition for local providers"
        },
        {
            "text": "Local screening services continue to look at ways to build upon a high-quality service with a family-friendly approach. The views of parents, along with staff training and development, are fundamental in achieving this."
        },
        {
            "text": "Jane Leggett, manager of the newborn hearing screening service in Crewe, recently undertook a confidential parent satisfaction survey relating to their hearing screening experience, to monitor the quality of the service. A total of 146 parents responded from the 200 contacted."
        },
        {
            "text": "The findings were very positive. Overall parents rated their experience very good. Comments included:"
        },
        {
            "text": "Another high quality local newborn hearing screening service is the one in Leicester, where a ‘back to basics’ approach saw it win the ‘Driving improvement, delivering results’ category at the national Advancing Healthcare Awards."
        },
        {
            "text": "Leicester programme manager Donna Riley said:"
        },
        {
            "heading": 2,
            "text": "PHE Screening blog"
        },
        {
            "text": "The PHE Screening blog provides up to date news from all NHS screening programmes. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new blogs. If you have any questions about this blog article, or about population screening in England, please contact the PHE screening helpdesk."
        }
    ]
}