{
    "url": "https://childrenssocialcare.blog.gov.uk/2021/09/23/using-my-identity-and-areas-of-difference-to-drive-authentic-community-led-social-work/",
    "title": "Using my identity and areas of difference to drive authentic, community-led social work",
    "authors": [
        "Patriche Bentick"
    ],
    "categories": [
        "Anti-racism",
        "Leadership",
        "Wellbeing"
    ],
    "pub_date": "2021-09-23T10:58:40+01:00",
    "content": [
        {
            "heading": 4,
            "text": "Patriche Bentick has been working with children and families for 15 years. Before qualifying as a social worker, she gained experience at after-school clubs, summer camps abroad, mother and baby units in hospitals, and as an advocate for tackling substance misuse. Now, as a co-founder of the non-for-profit, PinPoint Incorporated, Patriche along with her fellow directors focus on developing positive change for underprivileged children and young people within inner city communities."
        },
        {
            "heading": 4,
            "text": "Here, she discusses her journey to become a Senior Practitioner in Camden Council’s Looked After Children and Care Leaver’s Team, making tangible change for Black and Ethnic Minority social workers, communities and children in her local authority (LA) and beyond."
        },
        {
            "text": "Growing up I didn’t know anything about social work. When I went to school in East London, I started to witness and experience racism and inequality. It really stuck with me that young people were going through terrible things without any support around them. As a young adult I was lucky enough to have access to personal development courses which helped develop my self-esteem and confidence. I used the skills I learnt to help my friends when they were struggling and started to see that supporting people was something that I was passionate about. This led me to think that maybe I could offer young people something that was clearly missing throughout my teenage years."
        },
        {
            "text": "Once I was in the car with my dad, when we stopped at a junction, and I saw a child being physically assaulted by their mum. After I’d reported the incident to an LA, I tried to follow up with them, but understandably, they wouldn’t tell me what had happened. The experience left me feeling powerless. Wanting to make a difference in situations like this led me to study a degree in social work at Goldsmiths College, University of London."
        },
        {
            "heading": 2,
            "text": "Authentically community-led social work "
        },
        {
            "text": "Having qualified as a social worker in 2013, I’m now working at Camden Council as a Senior Practitioner. I believe social work should be authentically community-led and I find all the different parts of the role encompass different aspects of myself.  The profession should have the space to focus on what we are here for; supporting families and helping children to feel happy, fulfilled and live life in a beautiful way. I’ve seen children as young as 2 years old lose their spark and innocence. I want them to hold on to that for as long as possible. All of my senses and my interests are engaged when working with the community and I know I’m in a privileged position to have the confidence to assert myself to help others."
        },
        {
            "text": "When you’re facing distrust from the community you serve, it’s not uncommon to be treated as a ‘snitch’. As a Black female social worker spending time within the community, for example in a hair salon, barber shop or market during non-working days, I might see things going on around children that make me pause, but I’d never say I was a child and family social worker in that space. Many Black social workers feel the need to protect their identity within and outside of the community because of the weight ‘social graces’ may hold. It takes a lot of courage to put yourself out there; I hold on to an element of hope that some Black and Ethnic Minority children will see my journey and know there is more than one path open to them."
        },
        {
            "heading": 2,
            "text": "Focusing on tangible, positive change"
        },
        {
            "text": "We are seeing a disproportionate amount of Black and Ethnic Minority social workers failing to complete the Assessed and Supported Year in Employment (ASYE), spending long stretches in junior roles and even being investigated. Black staff are often more readily blamed when what they need is support. Personally, I know it can feel like a lot of pressure being a Black, female social worker. I have often felt more responsibility to progress further, faced higher expectations from white professionals and held a different relationship and level of responsibility when supporting Black and Ethnic Minority families. Too often, Black practitioners are undervalued in comparison to their white counterparts who are delivering the same quality of work. Black professionals are often expected to achieve more in order to be acknowledged or progress in their career."
        },
        {
            "text": "In Camden, we work hard to be more reflective and systemic. With an intimate group of people, I’ve set up two practice spaces called ‘Reflect, Reclaim, Rebuild’. One space is for Black and Ethnic Minority professionals within Camden’s Children’s Services to think about our workforce and what action is needed to encourage an anti-racist workplace. The second space is for all practitioners within Camden’s Children’s Services to come together to focus on how we can continue to develop anti-oppressive and anti-discriminatory practice holistically. We discuss our experiences and concerns, but we are also very focused on actions and making a tangible, positive change for our work force and our communities. With support, I have also set up Black safe spaces within the Looked After Children and Care Leaver's Team, and we are in the process of creating Black safe spaces within the Child in Need and Child Protection service."
        },
        {
            "text": "These are small, intimate spaces but more widely, Camden Children’s Services has an anti-racist work plan which all teams feed in to. We consider how we can ensure we practice in anti-racist way. I am also part of a catalyst group where myself and others, including managers from different services, share their voices and advocate the needs of front line to create authentic change. The group acts as an advisory function to the service, ensuring our anti-racist work plan is systemic and not just a ‘tick box’ exercise."
        },
        {
            "heading": 2,
            "text": "Keeping momentum and not slowing down"
        },
        {
            "text": "Outside of Camden Council, I was recently a panellist for British Association of Social Worker’s (BASW) yearly conference and gave a talk on intersectionality and ‘Social GRACES’. We spoke about ethics, values and human rights. I also attend BASW’s Annual General Meeting and have been named equality and diversity lead for BASW’s steering group for the Independent Review of Children’s Social Care. I provide steers to support the chair and co-chair, ensuring that there is an ethical lens."
        },
        {
            "text": "I am also part of the BASW Black and Ethnic Professionals Symposium (BPS). It’s a small, closed group of social workers who sit at multiple frontline, managerial and educational levels asking what we can do to support Black and Ethnic Minority social workers and communities. We’re full of energy and creativity, including Shabnam Ahmed who has started the brilliant School of Shabs on YouTube. She uses this platform to share honest advice to social workers at all levels about connection, reflection and growth."
        },
        {
            "text": "I’m excited to celebrate the BPS 1-year anniversary event this month. All of us in involved in this work look forward to seeing to our plans for anti-racist practice come to fruition and demonstrating that we are not slowing down. Anti-racism is not a fad."
        }
    ]
}