{
    "url": "https://deframedia.blog.gov.uk/2021/09/23/who-updates-guideline-levels-for-air-pollutants/",
    "title": "WHO updates guideline levels for air pollutants",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Weekly stories"
    ],
    "pub_date": "2021-09-23T11:44:51+01:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "There has been coverage in the Times, Guardian, Telegraph, Independent and PA about the World Health Organization’s updated guidelines for ambient air pollutants. These are advisory levels that countries are encouraged to aim for to protect human health."
        },
        {
            "text": "The annual guideline level for fine particulate matter (PM2.5) – the air pollutant most harmful to human health – was lowered from 10 µg/m3 to 5 µg/m3  and the guideline level for nitrogen dioxide was reduced from 40 µg/m3  to 10 µg/m3 ."
        },
        {
            "text": "We know that air pollution poses the single greatest environmental risk to human health. That’s why are driving forward tangible and long-lasting improvements to the air we breathe, including stretching and ambitious targets on air quality through our Environment Bill."
        },
        {
            "text": "And as part of the development process for these targets, we will consider the updated WHO guidelines alongside independent expert advice and analysis on a range of factors."
        },
        {
            "text": "But we must not underestimate the challenges involved and the impact of the choices which we need to make, which is why we will be running a public consultation on the proposed targets early next year to help inform this process."
        },
        {
            "text": "A Defra spokesperson said:"
        },
        {
            "text": " "
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}