{
    "url": "https://onlinesafetydata.blog.gov.uk/2021/09/23/working-with-an-independent-evaluator/",
    "title": "Working with an Independent Evaluator",
    "authors": [
        "Fiona Hallett, Project Delivery Lead, Online Safety Data Initiative"
    ],
    "categories": [
        "Governance"
    ],
    "pub_date": "2021-09-23T12:33:11+01:00",
    "content": [
        {
            "text": "An independent evaluator has been brought on board to assure the end-to-end delivery of the Online Safety Data Initiative (OSDI). This is to help ensure that the OSDI is a success in both delivering positive outcomes for the detection of online harms content, and improving overall ways of working across Government and industry. In engaging an independent evaluator we are ensuring that the project has a high level of scrutiny, and that we are delivering efficient and effective services to the public."
        },
        {
            "heading": 3,
            "text": "Why are we bringing in an independent evaluator?"
        },
        {
            "text": "The OSDI is a Shared Outcomes Fund project, funded by Her Majesty’s Treasury. As such, throughout the OSDI we are championing new and innovative approaches to cross-sector collaboration and ways of working, and are committed to openness and transparency in thought, decision making and action."
        },
        {
            "text": "As a Shared Outcomes Fund project, robust evaluation of the activities that test these innovative ways of working is crucial. This evaluation is to be done in a way that informs future public policy development and programmes, and ensures best value for the public. To support us with this, we are inviting external challenge to our work."
        },
        {
            "text": "DCMS has appointed an independent, expert evaluator to ensure that we have the relevant scrutiny appropriate for this high-level project. Through visibility of the end-to-end delivery of the project, the evaluator will be able to help ensure we are taking the best approach to the OSDI, and that the project is delivering best value for the taxpayer."
        },
        {
            "text": "PA Consulting have been appointed as the independent evaluator for the OSDI. They are an external partner who are working closely with both ourselves and our supplier, the consortium between Faculty and PUBLIC."
        },
        {
            "heading": 3,
            "text": "What will be the key role of the independent evaluator?"
        },
        {
            "text": "The role of the independent evaluator will be to assure the end-to-end delivery of the OSDI. This will involve evaluation of a number of aspects of the project:"
        },
        {
            "text": "Overall, the independent evaluator will be responsible for providing expert independent assurance of project spend, processes, quality, and for recommending areas for continued improvement."
        },
        {
            "heading": 3,
            "text": "How are we running the relationship with the evaluator?"
        },
        {
            "text": "The contract was awarded to PA Consulting after an open competition in line with the Public Contract Regulations 2015. Once the team from PA Consulting were on board, we agreed together the responsibilities and priorities of the evaluator, in collaboration with our supplier."
        },
        {
            "text": "The evaluator will continue to work closely with DCMS and the supplier to ensure best practice is being followed at every stage of our work."
        },
        {
            "heading": 3,
            "text": "How do we think this structure will shape future work?"
        },
        {
            "text": "Our work with the independent evaluator will inform governance structures - including sharing lessons learned on cross-governmental ways of working, how we work with external delivery partners, and working in the open. These lessons learned will help to inform our own reflections on government standards, such as the Open Government Playbook."
        },
        {
            "text": "We will also be able to share rigorous lessons learned on digital project delivery processes. As part of this, we will share reflections on the principles of open standards and open sources, as described in the Government Technology Code of Practice."
        }
    ]
}