{
    "url": "https://educationhub.blog.gov.uk/2023/01/16/everything-you-need-to-know-about-strike-action-in-schools-and-colleges/",
    "title": "Teacher strikes: Everything you need to know about strike action in schools",
    "authors": [
        "Media Officer"
    ],
    "categories": [
        "Colleges",
        "Schools",
        "strikes"
    ],
    "pub_date": "2023-01-16T19:47:14+00:00",
    "content": [
        {
            "text": "On 16 January the National Education Union (NEU), one of the trade unions representing the teaching profession, announced its intention to strike. Not enough members of two other unions - the National Association of Schoolmasters/Union of Women Teachers (NASUWT) and the National Association of Headteachers - voted in favour of taking industrial action."
        },
        {
            "text": "The NEU trade union has taken this step after the government announced a record funding increase for schools in the Autumn Statement. The Education Secretary and officials from the Department for Education (DfE) continue to meet the trades unions to try to prevent strike action. We are also working to support schools and their leaders to avoid children missing education and causing disruption to parents and families."
        },
        {
            "text": "However, in the event of strikes taking place, there will be impacts on the delivery of education and we have a duty to help parents and families understand how this will affect them. Here’s what you need to know."
        },
        {
            "heading": 3,
            "text": "When are strikes happening in schools?"
        },
        {
            "text": "The NEU has announced it has met the threshold required in a ballot of its teacher members to strike in schools across England."
        },
        {
            "text": "The NEU has said it will hold strikes on:"
        },
        {
            "text": "After two years of disrupted education due to the pandemic, every single day spent in school with experienced teachers who know their students makes a difference to a child’s development. The NEU’s decision to call strike action puts children’s education and wellbeing at risk at a time when teachers are working hard to support them in recovering from the pandemic."
        },
        {
            "heading": 3,
            "text": "So, what do teacher strikes mean for pupils and parents?"
        },
        {
            "text": "In the event of strike action at a school, the school leaders or local authority that manages the school will take all reasonable steps to keep the school open for as many pupils as possible. We have produced updated guidance to help them do this and to minimise disruption to children and families."
        },
        {
            "text": "In some schools there may be little or no impact from strike action but in others it may mean that changes are made to the way they operate."
        },
        {
            "text": "For example, lessons might be taught by other members of staff or classes might be brought together. If large numbers of staff strike, schools may need to restrict attendance for some pupils."
        },
        {
            "text": "If schools need to restrict attendance, we have asked that those schools prioritise vulnerable children, children of critical workers and pupils who are due to take public examinations (like GCSEs) and other formal assessments. Where schools are not able to provide face-to-face education for all pupils, we encourage them to provide remote education to ensure every child has access to learning."
        },
        {
            "heading": 3,
            "text": "I am a parent of a vulnerable child/ a critical worker/ my child is taking exams this year, will my child be guaranteed a place?"
        },
        {
            "text": "It will be at the discretion of school leaders as to how many pupils they can provide for depending on the numbers of staff available. A definition of vulnerable children and critical workers can be found at Annex B of guidance for Emergency planning and response for education, childcare and children’s social care settings. Schools will decide on prioritisation of pupils depending on staff availability and will communicate this to parents."
        },
        {
            "heading": 3,
            "text": "Do I need to send my children to school on strike days?"
        },
        {
            "text": "Unless school leaders inform you that the school is closed or cannot provide a place, then you still have a legal duty to send your children to school unless they are unwell."
        },
        {
            "heading": 3,
            "text": "What are you doing to prevent teacher strikes?"
        },
        {
            "text": "We understand the pressures many teachers, like the rest of society, are facing now due to the challenge of high inflation."
        },
        {
            "text": "Teachers do a job that is essential to our society and they do it brilliantly. We’re clear that their pay should reflect that which is why the pay rise teachers are receiving this year is the highest in a generation."
        },
        {
            "text": "Teachers will see pay rises of 5 to 8.9%, with new teachers receiving the highest uplift. This will take teacher starting salaries to £28,000, which is significant progress towards this government’s 2019 manifesto commitment of a £30,000 starting salary. You can read more about why teaching is a rewarding career here."
        },
        {
            "text": "Education Secretary Gillian Keegan held a constructive meeting with union leaders on Monday, 9 January. She expressed the importance of working together to avoid strike action especially given the significant disruption due to the pandemic over recent years. She and her ministers have committed to further meetings."
        },
        {
            "text": "These discussions built on previous meetings and correspondence, including where unions called for an extra £2 billion uplift for schools next year and the year after, which the Government delivered in the Autumn Statement."
        },
        {
            "text": "This will be the highest real terms spending on schools in history totalling £58.8 billion by 2024-25."
        },
        {
            "text": "We continue to work with the sector to reduce teacher workload and improve teacher wellbeing, and work with the profession to understand and address longstanding issues around marking, planning and data management. The school workload reduction toolkit, developed alongside school leaders, is a helpful resource for schools that can enable them to reduce workload."
        },
        {
            "heading": 3,
            "text": "How much do teachers earn?"
        },
        {
            "text": "The starting salary for a newly qualified teacher is at least £28,000 and this is set to rise to £30,000. In Inner London the starting salary is more; at least £34,500. Teachers receive annual pay rises through an independent pay review process, and many teachers also see greater uplifts by progressing up the pay scales."
        },
        {
            "text": "We’re helping to make sure teachers can do this by continuing to develop once they’re established in their careers. Last year, almost 30,000 teachers and leaders started a fully funded National Professional Qualification (NPQ). NPQs are designed by education experts to build classroom expertise or develop leadership confidence and are flexible to fit around teachers’ personal and professional responsibilities. You can find out more about NPQs in the NPQ Prospectus."
        },
        {
            "text": "Teachers’ pensions are among the best and safest available – and they come with a 23.6% employer pension contribution. By contrast, in the private sector 48% of employees receive an employer contribution of less than 4%. Teacher contributions start from as little as 7.4% and a maximum of 11.7%."
        }
    ]
}