{
    "url": "https://companieshouse.blog.gov.uk/2023/01/16/how-leading-football-finance-expert-kieran-maguire-uses-companies-house-data/",
    "title": "How leading football finance expert Kieran Maguire uses Companies House data",
    "authors": [
        "David Higgs - Media and PR Lead"
    ],
    "categories": [
        "Business stories"
    ],
    "pub_date": "2023-01-16T14:13:44+00:00",
    "content": [
        {
            "text": "When it comes to explaining the complex world of money in football, few do it better than lecturer, author, podcaster, and media commentator Kieran Maguire. Here he shares some rare insight into how Companies House services help him do his job."
        },
        {
            "heading": 2,
            "text": "Tell us about your background and how you first came across Companies House."
        },
        {
            "text": "I’m a lecturer in football finance at the University of Liverpool. I used Companies House services in the past when it was a paid-for service to occasionally provide examples of financial statements to students. Now the service has moved to an online and free resource, I’m able to use it on a much more regular basis.  "
        },
        {
            "heading": 2,
            "text": "Which Companies House services do you find most useful, and how often do you use them?  "
        },
        {
            "text": "I’ve signed up to the Companies House follow service, so I receive email notification alerts when company filings are registered. I have them set up for every professional football club in the UK, as well as companies associated with major stakeholders in the game. I get a lot of alerts, but these help me to stay on top of all the major (and minor!) financial developments across the club game in the UK. "
        },
        {
            "heading": 2,
            "text": "How does our freely available data help inform your work?  "
        },
        {
            "text": "It is essential. I’m often asked by the media to comment on big stories in the world of football finance and the financial statements and other documents submitted to Companies House form an integral element of my ability to summarise the financial performance, position, risks, and governance of companies in the industry. Quite simply, it would be very difficult to do my job without it! "
        },
        {
            "heading": 2,
            "text": "Do you think more people in the football world could make use of our data? "
        },
        {
            "text": "Yes, awareness has certainly increased, with many media and fan-based organisations now taking advantage of the easy access to information at Companies House. The transparency and accessibility of this information can only be a positive thing for football fans. "
        },
        {
            "heading": 2,
            "text": "What would you say to encourage more football fans to use our services?  "
        },
        {
            "text": "Fans have a huge emotional investment and bond with the clubs they support. The information at Companies House allows them to access the finances of the club they love, and the potential financial opportunities and threats that exist. Being better informed also allows fans to speak truth to those in charge of clubs and hold them to account.  "
        },
        {
            "heading": 2,
            "text": "What’s the most significant update you’ve found through using our services? "
        },
        {
            "text": "Finding out that 2 Premier League clubs made the highest losses of any clubs in the UK, at a total of £1.5 billion between them. It’s amazing how much information you can find out just by knowing where to look! "
        }
    ]
}