{
    "url": "https://insidedio.blog.gov.uk/2023/01/16/revolutionising-our-management-of-heritage-on-the-defence-estate/",
    "title": "Revolutionising our management of heritage on the Defence estate",
    "authors": [
        "Guy Salkeld"
    ],
    "categories": [
        "Archaeology",
        "Defence Estate",
        "Historic environment"
    ],
    "pub_date": "2023-01-16T16:03:51+00:00",
    "content": [
        {
            "text": "Guy Salkeld pictured on the excavation site at Flower's Barrow, Lulworth Training Area, where an Iron Age hillfort once stood [Crown Copyright / MOD 2022]The MOD has a rich and diverse historic environment on its UK and overseas estate, containing many thousands of historic buildings and archaeological sites. As the guardian of these valuable heritage assets, DIO is responsible for their stewardship, a key part of which involves developing effective data strategies."
        },
        {
            "text": "It’s been a vision of mine to have a ‘Historic Environment Record’ (HER) for the MOD since I first joined the department, so I’m delighted to share that we now have not only a fully functioning and accessible HER, but the world’s first online database of its kind!"
        },
        {
            "text": "Our new HER will revolutionise how we manage and preserve heritage across the Defence estate. It’s a powerful tool providing comprehensive access to mapping data, heritage records and condition surveys, and will bring greater efficiency to the management of over 800 listed buildings, 700 scheduled monuments and tens of thousands of archaeological monuments."
        },
        {
            "heading": 2,
            "text": "Journeying through time on the MOD estate"
        },
        {
            "text": "The MOD estate is home to a wide range of heritage spanning from prehistory to the present day. Salisbury Plain Training Area in Wiltshire has produced a palaeolithic bifaced axe, an Early Iron Age to Late Bronze Age midden with feasting debris up to 3m deep, a collection of Roman villages in the artillery impact area and is the site of a Battle of Britain Spitfire crash. Otterburn Training Area in Northumberland is home to a shrine to the Romano-British God Cocidius, which is carved into a rock high above a vale. A WW1 Anti-Aircraft Battery at DM Crombie, West Fife is one of only a handful of similar sites across the UK and the St Kilda historic landscape in the Outer Hebrides dates from prehistory to the 1930s, with mixed natural and cultural World Heritage Site designations."
        },
        {
            "text": "A Saxon skeleton found during an excavation at Barrow Clump on Salisbury Plain Training Area [Crown Copyright / MOD 2018]There is a Norman church on Stanford Training Area, Norfolk and Thor Cold War Missile sites at North Luffenham, East midlands. Prehistoric ‘cup and ring’ marks swirl over rocks at Feldom Ranges, North Yorkshire, while RAF Spadeadam in Cumbria contains a historic Blue Streak Rocket. Gosport Oil Fuel Depot, Hampshire dates to 1907 and is an early example of the storage of fuel oil, and the Atomic Weapons Research establishment storage area at MOD Shoeburyness, Essex bears the marks of hands that built the first British nuclear weapon, leaving their patina on surviving door handles, presses, tools and instruments. The smallest monument is a War Department boundary marker, also in Gosport which got lost in long grass!"
        },
        {
            "text": "The historic environment on our overseas estate is equally diverse, encompassing classical remains at RAF Akrotiri in Cyprus, Gibraltar Naval Base, and even Mayan Temples on the British Army’s training area in Belize."
        },
        {
            "heading": 2,
            "text": "Protecting and preserving our historic environment"
        },
        {
            "text": "The DIO Historic Environment Team (HET) provides expertise to help the MOD fulfil its responsibility in managing this impressive assortment of historic environment assets, which account for a valuable proportion of our national heritage."
        },
        {
            "text": "An excavation of Roman buildings at Dreamer's Bay, an ancient port complex in Akrotiri, Cyprus [Crown Copyright / MOD 2018]The team is small, but using the new HER will be able to support military training and operations across the entire Defence estate, as well as providing expert advice on any aspect of Defence which has an impact on heritage. This includes development control, infrastructure projects, environmental stewardship, sustainability appraisals, grounds and facilities maintenance, site disposals, climate change, natural capital and recreation, and much more besides."
        },
        {
            "text": "We based the creation of the MOD HER on the Historic Buildings, Sites and Monuments Record database developed by Idox Software Ltd. The powerful database combines text records with a 3-D mapping system and a digital library, and features a global coordinate system which, in capturing MOD’s heritage responsibilities overseas, represents the world’s first global HER!"
        },
        {
            "text": "A suspected World War One observation post at Barry Buddon Training Camp in Scotland [Crown Copyright / MOD 2017]Records are held for activities such as condition surveys or excavations and the archive they produce, for example photographs and reports. The records are compatible with existing data tools, enabling reporting into other MOD systems and dashboards. The HER also records consultations and their outcomes, helping to recycle information from project to project."
        },
        {
            "text": "Gathering and using this intelligence, detective style, will enable the right decisions to be made to secure the MOD’s incredible heritage for future generations, while supporting those who live, work and train on the Defence estate."
        }
    ]
}