{
    "url": "https://civilservice.blog.gov.uk/2023/01/16/salute-to-empowering-military-womens-health/",
    "title": "Salute to empowering military women’s health",
    "authors": [
        "Civil Service Blog Team"
    ],
    "categories": [
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Ambitious Civil Service"
    ],
    "pub_date": "2023-01-16T08:54:21+00:00",
    "content": [
        {
            "heading": 3,
            "text": "How one small MOD team smashed the taboo over women’s health in the armed forces through popular blogs and an educational booklets to raise awareness"
        },
        {
            "text": "Your mission should you choose to accept it: ensure a section of our talented armed forces operate in the best conditions possible. This mission was accepted by the Servicewomen’s Health Improvement Focus Team (SHIFT) in the Ministry of Defence. Their  dedication saw them drive improvements for servicewomen in recognition of the importance of  their health and wellbeing, particularly the menopause through lively online blogs, open conversations and issuing a free educational booklet to spread awareness."
        },
        {
            "text": "Ambitious project"
        },
        {
            "text": "Demystifying women’s health can often be a challenge, but it was no match for the SHIFT heroes. Their ‘whole force’ approach united the best brains and ideas across healthcare, human performance research, training and communications to deliver an ambitious project - enabling servicewomen to deliver to their full potential."
        },
        {
            "text": "SHIFT has been instrumental in educating and raising awareness of women’s health matters, smashing taboos and their  vital work will  improve retention and recruitment of military women and achieve  operational effectiveness across Defence."
        },
        {
            "text": "Can-do approach"
        },
        {
            "text": "It was that can-do  approach that snatched the Diversity and Inclusion Award trophy for the  excited MoD team at the recent Civil Service Awards ceremony. Despite stiff  competition from the Home Office and the Department for Work and Pensions, SHIFT emerged  as the category winner and presented with their trophy at Lancaster House."
        },
        {
            "text": "“It’s absolutely fantastic [to win],” said  Lisa Horder, Project Lead for SHIFT. “We’re really thrilled. It’s most unexpected, but I’m  delighted.”  And ’s great to be appreciated for a really hard project.”"
        },
        {
            "text": "The House of Commons Defence Committee Women in the Armed Forces Inquiry highlighted the health and wellbeing issues faced by servicewomen over decades, such as menopause and taboos over women's health which had resulted in severe dehydration, as well as inadequate facilities and policy. The task of education, accountability, and developing the policies needed to tackle these problems wasn’t straightforward  - and SHIFT had just six months on top of their regular duties to deliver it."
        },
        {
            "text": "“My driving factor was to make sure our servicewomen have a level playing field to do their job properly and support them with everything they need,” said Lisa."
        },
        {
            "text": "“It was about kick-starting the conversation. Getting everyone to feel comfortable to talk about issues that society doesn’t like to talk about.”"
        },
        {
            "text": "When SHIFT hosted  a series of blogs online… that quickly captivated thousands of people and got them talking, and that’s when we knew it was a big deal and we caught people’s attention.”"
        },
        {
            "text": "To date their blogs have drawn nearly 30,000 views, underlining their need for awareness. SHIFT also developed a health and wellbeing education booklet for Servicewomen and Commanders."
        },
        {
            "text": "“I’m so grateful for the tireless determination of the SHIFT to demystify women’s health matters and deliver real change that will improve the day-to-day experience of servicewomen across our Armed Forces.” praised Baroness Goldie. “Their contribution has been tremendous. These vital changes due to be implemented in the coming months will go a long way to improving inclusivity and operational effectiveness in MOD. I hope they will transform service life for women, bring about a positive, meaningful and enduring cultural change.”"
        },
        {
            "text": "The awards celebrate teams like SHIFT, who demonstrate excellence in the  Civil Service. All the nominations recognised the breadth and impact of work by civil servants across the country, delivering for citizens and the organisation. "
        },
        {
            "text": "“It’s that opportunity to come together and recognise what’s gone into the project.” The team said, “It’s just a great opportunity to be appreciated.”"
        },
        {
            "text": "Find out more about the awards at www.civilserviceawards.com."
        }
    ]
}