{
    "url": "https://actuaries.blog.gov.uk/2023/01/16/seeking-a-better-way-for-local-government-insurance/",
    "title": "Seeking a better way for local government insurance",
    "authors": [
        "Ian Rogers - Head of Business Development"
    ],
    "categories": [
        "Analysis",
        "Finance",
        "Insurance"
    ],
    "pub_date": "2023-01-16T09:09:06+00:00",
    "content": [
        {
            "text": "Every year, local government authorities spend hundreds of millions of pounds buying insurance. In contrast, central government departments spend next to nothing, retaining their risks instead."
        },
        {
            "text": "Why this mixed approach to insurance across the UK public sector? And is there a better way?"
        },
        {
            "text": "In this blog, I set out to answer these questions. I’ll draw on my own experience as a director of the Local Government Mutual (LGM), an initiative from the Local Government Association."
        },
        {
            "text": "LGM was established to provide local authorities with an alternative to conventional insurance. Although it made an impact on the market, it has yet to deliver."
        },
        {
            "text": "I’ll explore some of the challenges faced and consider how these might be overcome."
        },
        {
            "heading": 2,
            "text": "Central government doesn’t need insurance"
        },
        {
            "text": "HM Treasury sets out the central government approach to insurance in its guidance Managing Public Money. This states that “central government organisations should not generally take out commercial insurance because it is better value for money for the taxpayer to cover its own risks”."
        },
        {
            "text": "Paragraph 4.4.1 explains why:"
        },
        {
            "text": "“In the private sector risk is often managed by taking out insurance. In central government it is generally not good value for money to do so. This is because the public sector has a wide and diverse asset portfolio; a reliable income through its ability to raise revenue through taxation; and access to borrowed funds more cheaply than any in the private sector. In addition, commercial providers of insurance also have to meet their own costs and profit margins."
        },
        {
            "text": "\"Hence the public purse is uniquely able to finance restitution of damaged assets or deal with other risks, even very large ones. If the government insured risk, public services would cost more.”"
        },
        {
            "text": "This guidance applies to departments and their arm’s-length bodies. It is followed with limited exceptions."
        },
        {
            "text": "Buying insurance can help organisations manage their risks. For example, paying premiums according to the risk incentivises best practice risk management, by offering an immediate saving for reducing risks. And the existence of an insurance contract also makes the cost of risk more transparent."
        },
        {
            "text": "However, instead of relying on insurance, government organisations can realise better value for money by retaining their risks and paying for their own claims. But only if they are confident that they can manage the cost of these risks."
        },
        {
            "text": "This is where central government has the advantage. Its balance sheet is large enough to pool and absorb the risks it retains. So, it doesn’t need to buy insurance."
        },
        {
            "heading": 2,
            "text": "Local government relies on commercial insurance"
        },
        {
            "text": "Local government is part of the public sector, so in theory the same rationale as set out in Managing Public Money could apply. However, in practice, local government is naturally fragmented into hundreds of local authorities. These authorities are all legal entities in their own right, and all smaller than central government."
        },
        {
            "text": "There are many types of local authority, including district councils, county councils, London boroughs, metropolitan districts, and unitary authorities. They vary by size and in remit. But operating individually, their risk appetite and financial resources are limited, and they cannot afford to retain their risks."
        },
        {
            "text": "That’s why local authorities buy commercial insurance. Of course, they enjoy the benefits that commercial insurance brings, such as professional claims management. But the key point is that unlike central government, they need insurance because individually they haven’t any alternative."
        },
        {
            "heading": 2,
            "text": "Local Government Mutual (LGM)"
        },
        {
            "text": "In 2018, the Local Government Association announced the establishment of a new Local Government Mutual. Recognising that councils spend hundreds of millions of pounds on insurance nationally, the aim was to develop a cost-effective alternative to conventional insurance. The mutual would be owned and controlled by its members, and improve the sharing of best practice in risk management across the sector."
        },
        {
            "text": "I was privileged to be involved in this project and to be appointed as a director of LGM. In GAD I’d been involved in a range of risk pooling schemes and government interventions in the insurance market. And prior to GAD I’d played a key role in a couple of insurance start-ups. So, this new local government initiative seemed a natural fit."
        },
        {
            "text": "The model chosen for LGM was a hybrid discretionary mutual. That meant it would offer discretionary protection backed by supporting insurance, under the control of its members. This is the same model as successfully used by the Fire & Rescue Indemnity Company (see case study below)."
        },
        {
            "text": "The first job was to procure a professional service manager to launch the mutual, onboard new members, and run the day-to-day operations. The mutual opened for business in 2019."
        },
        {
            "heading": 2,
            "text": "Challenges faced by LGM"
        },
        {
            "text": "Yet despite the explicit support of 14 councils and the Local Government Association, LGM struggled to establish a foothold in the market. There are many reasons for this. The overarching challenge was to create and align supply and demand. Let me explain."
        },
        {
            "text": "To start with, LGM was reliant on the commercial insurance market to get up and running. That’s because it wasn’t set up with its own financial support, such as seed capital or a parental guarantee. So, it wouldn’t be capable of paying out for excessive claims in the short-term. To get around this, LGM appointed a panel of insurers to help cover the risk."
        },
        {
            "text": "The logic was that LGM’s finances would strengthen over time as more councils joined. This would enable LGM to retain a larger share of the risk, and to scale back the use of commercial insurance. So, LGM’s ultimate success would reduce local government’s need for buying commercial insurance. This would suggest that LGM was a threat to the insurance market, and so might not get the wholehearted support of insurers."
        },
        {
            "text": "And so it played out. As LGM prepared to onboard its first tranche of local authorities, support from the insurance panel evaporated. The supply (of insurance through LGM) was no longer there to meet the demand. This meant that LGM no longer had a viable proposition and had to go back to the drawing board."
        },
        {
            "text": "LGM still needed insurance, so sought out willing insurers to collaborate. At one stage we had an insurer ready to accept the risk of one of the larger unitary authorities. This enabled LGM to offer a substantial reduction on the previous year’s premium. However, the local authority’s incumbent insurer responded with a further reduction, and the authority was obliged to take the cheapest option. So, this time it was the demand (for insurance through LGM) that fell away."
        },
        {
            "text": "Then along came COVID-19."
        },
        {
            "text": "The immediate impact was that local authorities were faced with far more pressing issues than pursuing alternatives to their existing insurance arrangements. The pandemic also changed the nature of the risks faced by local authorities and their dealings with insurers. In 2020, GAD published a report on the impact of COVID-19 on the public sector’s insurance risks."
        },
        {
            "text": "Even as the UK began to recover from the pandemic, the setbacks for the mutual continued. Local authorities preferred safety in numbers, wanting to join the mutual as part of a set rather than be the first. Insurance partners also wanted multiple authorities to sign up, to diversify the risk profile. But many local authorities were tied into multi-year insurance contracts. Along with different renewal dates, this made it trickier to line up that critical mass."
        },
        {
            "text": "LGM’s professional service manager was effectively required to be a matchmaker between the insurance market (supply) and local authorities (demand). And unfortunately the stars did not align."
        },
        {
            "heading": 2,
            "text": "A history of local government insurance"
        },
        {
            "text": "The present is shaped by the past, so it is instructive to consider some history."
        },
        {
            "text": "For much of the last century, local authorities could insure with Municipal Mutual Insurance (MMI). Established by local authorities in 1903, MMI was a response to what was seen as an expensive and ineffective insurance market. It served as the sector’s insurance supplier until 1992, when it went into run-off, caused in part by expanding beyond its core business."
        },
        {
            "text": "The demise of MMI was caused by 2 years of heavy losses and damaged the reputation of mutual insurance in the eyes of local authorities. The business was bought by Zurich Insurance, which is still known as a key player in local authority insurance and has the largest market share."
        },
        {
            "text": "There was renewed interest in establishing mutual alternatives at the start of this century."
        },
        {
            "text": "In 2004, Scottish local authorities established an insurance ‘captive’ in the Isle of Man. However, this mutual initiative failed to get off the ground when the incumbent insurers offered extremely favourable renewal terms to larger authorities. Without critical mass the proposal was uneconomic."
        },
        {
            "text": "In 2007, 10 London local authorities set up the London Authorities Mutual Limited, intending to deliver significant efficiency savings in response to a lack of competition in the local authority insurance market. It was aborted after Risk Management Partners took court action against Brent council, which determined that local authorities do not have powers to undertake mutual insurance arrangements."
        },
        {
            "text": "The Fire and Rescue Authorities Mutual (a precursor to FRIC) also commenced operation in 2007. However, it stopped shortly after, when the powers of fire authorities were deemed inadequate."
        },
        {
            "text": "Following this, the Department for Communities and Local Government (as it then was) produced an impact assessment on providing powers to participate in mutual insurance arrangements. It notes how these mutual initiatives were offering savings of around 15% to 20%."
        },
        {
            "text": "The 2012 Localism Act subsequently eliminated the issue of inadequate powers."
        },
        {
            "heading": 2,
            "text": "Risk pooling: strength in numbers"
        },
        {
            "text": "HM Treasury published ‘Government as insurer of last resort: managing contingent liabilities in the public sector’ in 2020. This paper articulates the benefits of risk pooling schemes and proposes that their coverage should be expanded where appropriate. Sharing the risk exposure over a large pool usually results in savings on the cost of insurance and more stability on expected losses."
        },
        {
            "text": "Perhaps the most pertinent example of such a scheme is the Department for Education’s risk protection arrangement. It was established in 2014 as a cheaper alternative to commercial insurance. It immediately halved the average cost of insurance. This scheme was originally for academy trusts in England but was extended to local authority maintained schools in 2020."
        },
        {
            "text": "I explained earlier that central government doesn’t need to buy insurance. For the same reason, this scheme (in contrast to LGM) can operate without the need for commercial insurance. Thanks to government backing it offers a clear and compelling proposition to schools."
        },
        {
            "heading": 2,
            "text": "Conclusion: a better way for local government insurance"
        },
        {
            "text": "There is an appetite among local authorities for an alternative to commercial insurance. A risk pooling arrangement for the sector is entirely feasible. As with the examples mentioned in this blog, it has the potential to realise significant cost savings for the public purse."
        },
        {
            "text": "There is evidence that the threat of a new mutual sharpens competitive pricing. But the threat alone is not a sustainable solution."
        },
        {
            "text": "The biggest obstacle to LGM’s success has been a lack of financial support to shore up its balance sheet. At least for the short-term until it becomes fully established. In theory this could be provided by the insurance industry, but in practice that’s proved elusive."
        },
        {
            "text": "Instead, I believe a partnership with central government could provide a win-win solution: The ability to offer a compelling proposition to local authorities. One that will deliver cost savings for local government and taxpayers. Leveraging the strength of the entire public sector balance sheet and providing a commensurate return to central government."
        },
        {
            "heading": 3,
            "text": "Disclaimer"
        },
        {
            "text": "The opinions in this blog post are not intended to provide specific advice. For our full disclaimer, please see the About this blog page."
        }
    ]
}