{
    "url": "https://deframedia.blog.gov.uk/2023/01/16/single-use-plastics-ban-coverage/",
    "title": "Single-use plastics ban coverage",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "waste"
    ],
    "pub_date": "2023-01-16T15:29:22+00:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "There has been widespread coverage including in BBC News Online, Sky News, Bloomberg, Reuters, Telegraph, Times, Independent, Sun, i, Daily Star, Daily Express, Daily Mirror and Independent of our plans to introduce a ban on a range of single-use plastics in England from October 2023."
        },
        {
            "text": "Our announcement on Saturday confirmed the ban will include single-use plastic plates, trays, bowls, cutlery, balloon sticks, and certain types of polystyrene cups and food containers."
        },
        {
            "text": "BBC Breakfast, Sky News and ITV News all ran packages which featured an interview with Environment Minister Rebecca Pow on the ban as well as the Government’s wider ambitions to tackle plastic pollution under Extended Producer Responsibility (EPR) and Deposit Return Schemes (DRS)."
        },
        {
            "text": "According to estimates, England uses 2.7 billion items of single-use cutlery — most of which are plastic — and 721 million single-use plates per year, but only 10% are recycled."
        },
        {
            "text": "From October, people won’t be able to buy these products from any business - this includes retailers, takeaways, food vendors and the hospitality industry."
        },
        {
            "text": "Environment Secretary Thérèse Coffey said: "
        },
        {
            "text": "“We all know the absolutely devastating impacts that plastic can have on our environment and wildlife. We have listened to the public and these new single-use plastics bans will continue our vital work to protect the environment for future generations."
        },
        {
            "text": "“I am proud of our efforts in this area: we have banned microbeads, restricted the use of straws, stirrers and cotton buds and our carrier bag charge has successfully cut sales by over 97% in the main supermarkets.”"
        },
        {
            "text": "Environment Minister Rebecca Pow said: "
        },
        {
            "text": "“Plastic is a scourge which blights our streets and beautiful countryside and I am determined that we shift away from a single-use culture."
        },
        {
            "text": "By introducing a ban later this year we are doubling down on our commitment to eliminate all avoidable plastic waste. We will also be pressing ahead with our ambitious plans for a deposit return scheme for drinks containers and consistent recycling collections in England.”"
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}