{
    "url": "https://userresearch.blog.gov.uk/2023/01/16/tips-for-communicating-across-a-language-barrier/",
    "title": "Tips for communicating across a language barrier",
    "authors": [
        "Paloma Jain"
    ],
    "categories": [
        "Research stories",
        "Tips and techniques",
        "User research"
    ],
    "pub_date": "2023-01-16T10:22:33+00:00",
    "content": [
        {
            "text": "Being able to communicate easily with your participants is a foundation of effective user research. So much of the job relies on being able to interpret behaviour, social context and intonation. That’s why we like working closely with participants, where we can communicate freely. "
        },
        {
            "text": "However, there are times in every user researcher's career where seamless communication isn't so straightforward. One example of this scenario is when the researcher and participant speak different languages. As daunting as it can feel, there is no need to worry, and all is not lost. You can still get highly robust and meaningful insights from the research. In fact, I’ve found that  when I can’t rely on understanding what the participants have said to me, I’ve been able to draw  more actively on my other research skills. This is my story of how I approached that very scenario. "
        },
        {
            "text": "The team I was part of worked with governments globally to help with various aspects of service transformation and user centred design. In March 2022, I was working on a project in partnership with the Thai government. For this Thai agency, user centred design and user research were new practices for governmental work. They were interested in seeing how other international governments use user research to inform their work and improve designs by directly involving users. "
        },
        {
            "text": "And so, for this purpose, I was asked to do in-person user research on a procurement based Thai  web service. "
        },
        {
            "text": "This research itself was to be based in Thailand, primarily using the Thai language - a language not known to me. And so, these factors meant the project involved a daunting combination of: "
        },
        {
            "text": "At the outset, this all was a little frightening. In hindsight, it was hugely motivating.\n"
        },
        {
            "text": "Here are my reflections on what made this unusual circumstance a smooth experience. "
        },
        {
            "heading": 2,
            "text": "You don’t need to be a professional juggler "
        },
        {
            "text": "In research projects like this, there can be many moving parts. As the researcher you juggle trying to:"
        },
        {
            "text": "It’s ok to not have full control or get everything perfect. My role was to have general oversight of all the moving parts and see that they were in balance. By setting up each research session so that the team clearly knew their roles, ie. who was greeting the participants at the venue, facilitating the session, note-taking, translating, observing, and even taking a break, meant that everybody knew what to expect and the research was stronger for it. This made the juggling act much easier."
        },
        {
            "heading": 2,
            "text": "Creating trust with participants is key "
        },
        {
            "text": "Generally speaking, user research can be weird for participants. They often don’t know what to expect, wonder if they are doing it ‘right’, or might feel ‘watched’. User researchers work hard to inform participants every step of the way, create trust and help the participant feel safe and comfortable throughout. "
        },
        {
            "text": "Added  to this, in this Thai-based project, there was an extra element of participating in research facilitated by an ‘outsider’, ie. me. And I was very conscious of this.  "
        },
        {
            "text": "Ahead of each session, I made sure to re-iterate with the translator that they would be the first to greet the participant upon entry, welcome the participant and introduce their role as  translator. I felt it was important to do this before introducing me and my role to the participant. "
        },
        {
            "text": "This worked well for several reasons: "
        },
        {
            "text": "And don’t forget to amp up your soft skills! Being extra attentive to the participant goes a long way; showing that you are listening, eye contact, nodding, smiling and being receptive to the participants’ emotional responses always helps. But only If it’s culturally appropriate of course."
        },
        {
            "heading": 2,
            "text": "Before the research, know just enough"
        },
        {
            "text": "I also learned that it’s ok to do research on subject matter or in languages you are not familiar with."
        },
        {
            "text": "You don’t need to know every pathway or every user scenario ahead of the research. I started by making sure I was familiar with the core flow that the research is looking to investigate. In this case, the core flow was the pathway to search for relevant governmental contracts."
        },
        {
            "text": "Usability testing then showed if users diverted from the ‘ideal’ flow, and at what step the diversion happened. Even without knowing what the content described, it was clear that the flow wasn’t intuitive. I then looked to understand their thought processes with follow-up questions via the translator.  "
        },
        {
            "text": "The users were showing me directly the steps they took, their behaviours and their reactions. I was able to get very valuable qualitative insights even when I didn't necessarily understand what was being said. "
        },
        {
            "heading": 2,
            "text": "Embrace going back to basics"
        },
        {
            "text": "In not sharing a common language with participants or the subject matter, in a way, observation became the purest form of usability testing. When users got stuck, I couldn’t unconsciously bias them in any way. The users genuinely knew more than me about the site being tested and the language used. "
        },
        {
            "text": "By embracing my naivety, I could approach the sessions from a place of genuine curiosity. In this way, participants understood that I was truly there to learn from them and their experiences. This helped build greater rapport between the participants and me, especially seen when they would confidently take the laptop and say ‘here, let me show you’.  "
        },
        {
            "text": "In the end, not knowing how to speak or read Thai was in fact valuable for getting insightful findings for this project. It also reminded me of the amazing power of observing behavioural cues in qualitative user research - the shaking leg that hints at restlessness, for example. "
        },
        {
            "text": "I hope you have found this blog helpful. We’d also love to hear from you! \nAre there times when you had to consider very carefully how to build rapport with your participants? Please leave a comment below to share your tips and experiences."
        }
    ]
}