{
    "url": "https://environmentagency.blog.gov.uk/2023/01/16/waste-criminals-targeted-on-environment-agency-day-of-action/",
    "title": "Waste criminals targeted on Environment Agency day of action",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Waste"
    ],
    "pub_date": "2023-01-16T11:53:51+00:00",
    "content": [
        {
            "text": "Officers from the Environment Agency and the Joint Unit for Waste Crime visited a number of sites across England on Thursday 12 January as part of Operations Lyceum and Iris, cracking down on waste criminals."
        },
        {
            "text": "The proactive operation checked lorries outside waste sites, aiming to stop the movement of misdescribed waste, and prevent it from being incorrectly and unsafely disposed of."
        },
        {
            "text": "Officers spoke with 30 lorry drivers regarding the cargoes they were transporting, and tested nine lorries for hazardous waste. Police also seized a stolen generator worth £15,000, and flushed out lorry drivers who attempted to evade inspection."
        },
        {
            "text": "Working with partners including the police, HM Revenue and Customs and the Driver and Vehicle Standards Agency, vehicles and drivers were checked for other offences, such as tax evasion and vehicle defects."
        },
        {
            "text": "Phil Davies, head of the Joint Unit for Waste Crime, said:"
        },
        {
            "text": "Waste crime costs the economy in England an estimated £1 billion per year – that’s the same as the combined starting salary of over 38,000 newly-qualified nurses. We are continuing to work with the police, HMRC and other environmental regulators to catch waste criminals."
        },
        {
            "text": "Between 2017 and 2020, the EA stopped illegal waste activity at 2,700 sites and initiated 191 prosecutions for illegal waste sites, with 39 prison sentences handed down. It also issued fines of over £1.1m for illegal waste sites, plus £5.5m in Proceeds of Crime Act (PoCA) confiscation orders."
        },
        {
            "text": "In 2019/20, the EA prosecuted nearly 100 individuals and companies for waste crime offences, with fines exceeding £900,000, 28 custodial sentences and £1m of confiscation orders."
        },
        {
            "text": "We want to support the best operators in the waste sector, who create jobs, pay taxes, manage waste in accordance with the rules and ensure the environment is protected from harm."
        },
        {
            "text": "Let’s stop waste criminals together: if you know or suspect illegal waste activity, report it anonymously to Crimestoppers: Give information | Crimestoppers (crimestoppers-uk.org)  or call 0800 555 111."
        },
        {
            "text": "If you work in waste disposal, check you have the right permits in place: Waste: environmental permits - GOV.UK (www.gov.uk)"
        },
        {
            "text": " "
        }
    ]
}