{
    "url": "https://actuaries.blog.gov.uk/2023/03/20/attracting-recruiting-and-retaining-staff/",
    "title": "Attracting, recruiting and retaining staff",
    "authors": [
        "Garry Swann - Actuary"
    ],
    "categories": [
        "Careers"
    ],
    "pub_date": "2023-03-20T17:44:46+00:00",
    "content": [
        {
            "text": "How can government departments demonstrate the wider reward packages they offer their employees? The Government Actuary’s Department (GAD) hosted a cross-government event to discuss employee value propositions."
        },
        {
            "text": "Civil Service Human Resources (HR), the Department for Environment, Food and and Rural Affairs (Defra), NHS England, and GAD shared their approaches and discussed opportunities as how to engage better with employees."
        },
        {
            "heading": 2,
            "text": "Employee value propositions"
        },
        {
            "text": "The Civil Service HR team defined an organisation’s employee value proposition (EVP) as: “…the heart, mind and soul of what it’s like to work for, and be part of, your department.”"
        },
        {
            "text": "It will form part of an organisation’s reward and recognition programme. It goes beyond the reward elements of pay and benefits, and includes elements such as the:"
        },
        {
            "text": "An authentic and accurate employee value proposition will attract and retain great talent and ensure you get the best out of staff."
        },
        {
            "heading": 2,
            "text": "EVPs in practice"
        },
        {
            "text": "At the event, government and public organisations shared the way they create EVPs as a way of attracting and retaining people."
        },
        {
            "heading": 3,
            "text": "Civil Service HR"
        },
        {
            "text": "Civil Service HR has developed a toolkit to help government departments create exceptional EVPs."
        },
        {
            "text": "The toolkit includes helpful insights, tips and templates, supporting departments in articulating their employee offer and the values and cultures within their organisation. This is useful for communicating with existing employees and the wider labour market."
        },
        {
            "text": "Civil Service HR highlighted financial wellbeing offerings as an example of an attractive aspect of the EVP. Benefits like this go further and include aspects such as financial education, departmental loans and signposting to sources of advice and support."
        },
        {
            "heading": 3,
            "text": "Defra"
        },
        {
            "text": "The team from Defra noted that the consolidation of their employee value proposition on their intranet coincided with significant increases in staff engagement scoring. The supporting ‘Employee Offer’ roadshows have since increased employee awareness of what’s available through various providers."
        },
        {
            "text": "Feedback from the roadshows indicated that financial concerns and overall wellbeing are top priorities for Defra employees. In recognition of this, Defra has:"
        },
        {
            "heading": 3,
            "text": "NHS England"
        },
        {
            "text": "NHS England’s EVP communication framework helps them identify the different staff communication and engagement activities undertaken at different stages of a person’s career journey."
        },
        {
            "text": "This helps the HR team target inventions at the right time, and for the right reasons. These interventions recognise and reward staff and support them in making informed decisions which are right for them. As part of developing its EVP, NHS England has developed its People Promise."
        },
        {
            "heading": 2,
            "text": "GAD's expertise"
        },
        {
            "text": "GAD noted that direct financial elements, such as overtime, allowances and pension scheme benefits can be quantified. The team uses visual presentations to help people appreciate the benefits."
        },
        {
            "text": "Wider, less tangible, elements of reward offerings, such as flexible working and study support require clear communication to emphasise their value and GAD provided some examples of this."
        },
        {
            "text": "GAD’s expertise lies in demonstrating the value, and range, of benefits provided by the public service pension schemes as well as the wider benefits package."
        },
        {
            "text": "We provided the illustration below showing how pension benefits can constitute a significant proportion of an employee’s overall financial package, as well as the importance of letting them know."
        },
        {
            "text": "GAD provided examples of wider scheme provisions. These can include benefits provided to support members suffering from ill-health and options around partial retirement."
        },
        {
            "text": "The HR team in GAD noted that people are not always aware of the full range of benefits provided, as well as the substantial contributions made by their employers to provide these benefits. The team suggested this information should be promoted to staff."
        },
        {
            "heading": 2,
            "text": "Conclusion"
        },
        {
            "text": "This event was a great opportunity to bring together a diverse group of colleagues from across the public sector to share current thinking and best practice in recruitment and retention."
        },
        {
            "text": "It demonstrated the benefits of a comprehensive EVP for articulating public sector employers’ offerings."
        },
        {
            "text": "GAD looks forward to hearing how departments develop their own propositions. We would be very happy to support departments in communicating the value of pension, and other financial, benefits to their employees."
        },
        {
            "text": "Disclaimer"
        },
        {
            "text": "The opinions in this blog post are not intended to provide specific advice. For our full disclaimer, please see the About this blog page."
        }
    ]
}