{
    "url": "https://buyingforschools.blog.gov.uk/2023/03/20/helping-schools-and-trusts-to-buy-goods-and-services/",
    "title": "Helping schools and trusts to buy goods and services",
    "authors": [
        "Kevin Draisey, Head of Procurement Operations"
    ],
    "categories": [
        "Services"
    ],
    "pub_date": "2023-03-20T14:30:48+00:00",
    "content": [
        {
            "text": "Kevin Draisey, Head of Procurement Operations, updates us on Get help buying for schools, and how state-funded schools and trusts can get the most out of this free service."
        },
        {
            "text": "What is Get help buying for schools?"
        },
        {
            "text": "Get help buying for schools is a service delivered by the Department for Education, which helps schools to buy goods and services. Our aim is to support schools and trusts to buy well, and have peace of mind that they are getting good value in terms of cost, quality and time."
        },
        {
            "text": "We are here to support schools and trusts to buy everything from energy, ICT and catering, to transport, legal services and furniture – and much more. In fact, we have over 60 DfE-approved frameworks which can be accessed via the Find a Framework tool on GOV.UK. We also have our own team of in-house procurement experts, who are able to recommend bespoke solutions if a school or trust has a specific need."
        },
        {
            "text": "We offer different levels of service. We have online advice and guidance, we signpost to DfE-approved frameworks which offer a massive range of good and services for schools, and we provide a more hands on service to help schools or trusts with more complex procurements. The service is free of charge to state funded schools."
        },
        {
            "text": "We understand that not all schools or trusts currently employ a procurement specialist and that buying is often undertaken by someone who is wearing many hats, and that for many schools, buying the high cost/high risk goods and services is a complex and resource intensive process. Schools tell us they are inundated with marketing materials, calls and emails, day in day out, and in many cases tend to stick with incumbent suppliers because it sometimes feels like the safest option, even if it doesn’t always deliver the best value. We want to give schools the support and confidence to look at other alternatives that could either save them money, time or deliver them a better service – that’s what Get help buying for schools is about."
        },
        {
            "text": "The service is centred around a desire to drive the best procurement outcomes for schools. Being able to help schools buy goods and services better gives me and my team a great sense of satisfaction. Every time we save money and time for a school, we know this directly supports improved educational outcomes, and that’s what motivates us."
        },
        {
            "text": "We’ve now been up and running for just over a year and we are still learning all the time. We are very focused on meeting the needs of schools. User research and feedback are vital to how we develop and improve our service. What is clear, even so early on, is how much schools value the time we save them, not just the money. We have that at the front of our minds as we continue to develop the service."
        },
        {
            "text": "Tell us a bit about yourself Kevin"
        },
        {
            "text": "I’m relatively new to the DfE. I have spent most of my career in procurement, most recently as Head of Procurement and Contract Management at North Yorkshire County Council. I also chaired the Yorkshire and Humber Local Authority Heads of Procurement Group (SPG) and sat on the LGA National Advisory Group for Procurement."
        },
        {
            "text": "I have three children, two are in school and my eldest recently embarked on her career working in a primary school. I’m also a passionate school governor. The chance to bring my skills and experience to this new service which has been set up to support schools, was just too good an opportunity to pass up."
        },
        {
            "text": "How many schools have benefitted from the service so far?"
        },
        {
            "text": "Since February 2022, we have supported over 1,000 schools and MATs across many different categories of spend - everything from stationery and MFDs to more complex cases like transport, catering, and of course energy."
        },
        {
            "text": "We are very keen to develop stronger relationships with our supply chains and partners. DfE have a range of approved frameworks we can utilise with many of the well know public sector buying organisations. We meet monthly as a rule, and more often if required due to particular issues in the market. Energy is the obvious example, where due to market pressures it is really important to stay close with our supply chain partners to make sure we have the best options, guidance and solutions available. Supply chain resilience is important, and we want schools to feel confident that when they work with us, we are offering the best long-term solutions and suppliers. Bringing together our knowledge and that of our partners helps us to do this."
        },
        {
            "text": "What do schools who use the service have to say?"
        },
        {
            "text": "We’re really grateful to those school business professionals who have taken the time to give us their feedback and share their experiences, both good and bad. We need feedback to continually improve and evolve the service."
        },
        {
            "text": "You can read about experiences of using the service from Kieren Done from St Ambrose College and Emma Foulkes from the Holy Family of Nazareth Catholic Academy Trust who kindly wrote blog posts for us."
        },
        {
            "text": "How can schools and trusts get the most out of the service?"
        },
        {
            "text": "We’ve worked with a wide range of schools and trusts so far. One of the best ways school buyers can help us to help them is to get in early and plan ahead, because complex procurements can take months rather than weeks. Schools and trusts will have their own internal approval processes that also need factoring in to the timescales, so you really can’t start planning too early. The more time we have to work through options for new contracts, the better the outcomes will be."
        },
        {
            "text": "Detail is also important. The more detail we have in terms of specifics up front, the easier it is to advise on the best route to market and the process to deliver what the school or trust needs. Having a clear and detailed specification of your requirements will help us advise you on your best options."
        },
        {
            "text": "We have frameworks we can utilise but we can also run bespoke, standalone procurements if it is the best fit for a school or trust. A lot of school business professionals are put off by frameworks, they can seem complicated and clunky if you’ve not used them before. But schools can save a lot of time using a framework. They are a legally compliant route to market, there is no need to shop around to get three quotes and you have peace of mind you are meeting the relevant procurement regulations. Plus, they can deliver good value for money."
        },
        {
            "text": "What next for the service?"
        },
        {
            "text": "We are continuing to develop a suite of digital tools to support schools with procurement. We hope this powerful combination of digital support and working directly with schools will increase our capacity to deliver support to more schools."
        },
        {
            "text": "The service is still relatively new, but we are already seeing financial and time savings for schools, and that is something we are proud of. In the future, I’d also like to see us calculating social value benefits from our procurements, so that schools can get a real sense of the whole value they get from working with us. I’m really excited by the ‘whole value’ proposition that we can create for schools."
        },
        {
            "text": "How can schools and trusts access the service?"
        },
        {
            "text": "You can access our service direct through GOV.UK"
        },
        {
            "text": "If you have a contract that you are planning to retender later this year and want to book a 1 to 1 conversation with one of our engagement team to find out how we can support your school or trust, email us at schools.commercial@education.gov.uk and one of the team will get back to you to arrange a conversation."
        },
        {
            "text": "And finally, we have a LinkedIn page which provides daily updates about all the webinars we run, events school buyers might find useful, and new frameworks as they become available. It really is a useful resource for anyone who is buying for a school or a trust."
        }
    ]
}