{
    "url": "https://insidehmcts.blog.gov.uk/2023/03/20/hmcts-reform-achievements-challenges-and-next-steps/",
    "title": "HMCTS reform: achievements, challenges and next steps",
    "authors": [
        "Nick Goodwin - Chief Executive, HMCTS"
    ],
    "categories": [
        "Court and tribunal reform",
        "Digital services",
        "General"
    ],
    "pub_date": "2023-03-20T16:00:22+00:00",
    "content": [
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "text": "Back in 2016 we started work on one of the most comprehensive court and tribunal reform programmes in the world."
        },
        {
            "text": "Our vision for Reform was to modernise and redesign simplified services, such as civil money claims, divorce, probate applications - all built around the needs of the end user."
        },
        {
            "text": "Reform aimed to better manage cases by taking out of court those that do not need to be there. Using more virtual working meant physical attendance would be required only for the more difficult or sensitive cases."
        },
        {
            "heading": 2,
            "text": "Celebrating achievements"
        },
        {
            "text": "We’ve achieved a huge amount already. Reform is having a significant impact for the public with our digital services used over 2.1 million times so far."
        },
        {
            "text": "We’ve made courts and tribunals services easier to use and more efficient to run. Our services are faster. Cases submitted digitally through our social security and child support service took a third of the time to complete compared to those submitted on paper."
        },
        {
            "text": "They’re also simpler. We settled over a quarter of online immigration and asylum appeals early in the process without the need for a hearing."
        },
        {
            "text": "Our modernised services are more accurate. We returned less than 1% of online divorce applications because of user error, compared to 40% on the paper-based system."
        },
        {
            "text": "And they’re better joined up. Common Platform, our criminal case management system, is now live in 76% of criminal courts. Although we still have some refinements to make, we’re already realising huge benefits by allowing all parties involved in a case to access information on a single system for the first time."
        },
        {
            "text": "Our reformed services are essential to provide the best access to justice for every victim, witness, defendant, claimant, business and family that needs the courts and tribunals, to protect the vulnerable and hold the powerful to account."
        },
        {
            "text": "I’m immensely proud and grateful to all those who have played their part in transforming those services."
        },
        {
            "heading": 2,
            "text": "Overcoming challenge"
        },
        {
            "text": "In spite of the various achievements, none of us could have predicted the extraordinary challenges we’ve faced. The impacts of the coronavirus (COVID-19) pandemic have been significant and far-reaching for HMCTS."
        },
        {
            "text": "Our staff and justice partners have been under pressure to deal with the high number of outstanding cases across our courts and tribunals. At the same time, they’re implementing a demanding rate of change to ways of working as we deliver the final stages of the reform programme (which are also integral to our recovery work)."
        },
        {
            "text": "I know that the twin demands of reform and recovery have been immensely challenging for everyone working within the justice system."
        },
        {
            "heading": 2,
            "text": "Taking stock"
        },
        {
            "text": "We remain committed to fulfilling the vision of our reform programme, but there are some things we need to address. We’ve looked at the difficulties and identified where barriers exist and have reviewed our options accordingly to relieve pressure wherever we can."
        },
        {
            "text": "We know that trying to change too much, too quickly has undermined confidence at times. But I want to assure you that we’re continuing to learn from our experiences and feedback, and I’m confident we can do better."
        },
        {
            "text": "So we’ve taken stock and looked realistically at what we can achieve and by when. As a result we’ve adjusted certain elements of the reform programme. Our revised schedule minimises overlap and allows more preparation time. We have the full support of the Lord Chancellor, the Lord Chief Justice and the Senior President of Tribunals in making these adjustments."
        },
        {
            "text": "Our focus now is still on tackling outstanding cases, but also to better prepare courts and tribunals - and everybody who works with them - for the remaining changes we’ll deliver over the coming year."
        },
        {
            "heading": 2,
            "text": "Impact on projects"
        },
        {
            "text": "In the crime jurisdiction, we’ll continue introducing Common Platform into remaining Crown and magistrates’ courts by the summer. This will allow more time for our staff and partners to develop, adapt to and embed the system."
        },
        {
            "text": "We will continue to develop further functionality on the Common Platform to enable all case types to be processed on the system, reducing the dual running of systems, particularly in magistrates’ courts which can make things more complicated."
        },
        {
            "text": "The integration with our scheduling and listing tool - List Assist - and enhanced case progression functionality will follow, after they’ve been tested for longer in early adopter courts. This may take a little longer but means the end result will be better, with more time to prepare and support all of our users."
        },
        {
            "text": "Away from the criminal jurisdiction, we’re prioritising the work to improve and embed the family public law service, before we introduce the new private law functionality. Similarly, we’ll take more time in early adopter courts to ensure processes are right for all users, including our partner agencies."
        },
        {
            "text": "In civil, we are making really good progress in extending functionality to our newly reformed systems. We’ll take a measured approach, delivering the remaining services in online civil money claims, civil enforcement, bulk claims and damages over the next year."
        },
        {
            "text": "We’ll also be completing the reform of employment, immigration and social security and child support tribunals."
        },
        {
            "text": "We’ll integrate our new scheduling and listing tool with each of the reformed civil, family and tribunal case management systems, and continue to develop the Video Hearing Service."
        },
        {
            "text": "To complete these prioritised projects, we’ll pause digital reform work on adoption and possession for now. We also plan to deliver the new service for the Criminal Injuries Compensation Tribunal but then pause work on all other Special Tribunals."
        },
        {
            "text": "We’ll implement all remaining civil, family and tribunal services by March 2024."
        },
        {
            "text": "In making this decision we have listened to feedback, acted on it, and prioritised the experience of all court users: our partners, our staff and the people we collectively serve."
        },
        {
            "heading": 2,
            "text": "A positive start"
        },
        {
            "text": "Although there’s lots of detail still to work through, I hope this adjustment for the year ahead provides reassurance."
        },
        {
            "text": "I’m confident that by seeking out constant improvements and testing the boundaries of our capabilities, while continuing to work effectively alongside our partners, we can deliver a world-class justice system."
        },
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "heading": 1,
            "text": "Rhaglen Ddiwygio GLlTEF: cyflawniadau, heriau a'r camau nesaf "
        },
        {
            "text": "Yn ôl yn 2016 fe ddechreuon ni weithio ar un o raglenni diwygio'r llysoedd a'r tribiwnlysoedd mwyaf cynhwysfawr yn y byd."
        },
        {
            "text": "Ein gweledigaeth ar gyfer y rhaglen Ddiwygio oedd moderneiddio ac ailgynllunio gwasanaethau symlach, megis hawliadau am arian sifil, ysgariad, ceisiadau am brofiant - y cyfan wedi'u cynllunio o amgylch anghenion y defnyddiwr terfynol."
        },
        {
            "text": "Nod diwygio oedd rheoli achosion yn well trwy gael gwared ar yr achosion llys nad oes angen bod yn y llys o’r cychwyn. Roedd y gallu i weithio mwy o bell yn golygu mai dim ond ar gyfer achosion difrifol neu sensitif y byddai angen presenoldeb corfforol yn y llys."
        },
        {
            "heading": 2,
            "text": "Dathlu llwyddiannau"
        },
        {
            "text": "Rydym wedi cyflawni cymaint yn barod. Mae diwygio yn cael effaith sylweddol ar y cyhoedd gyda'n gwasanaethau digidol yn cael eu defnyddio dros 2.1 miliwn o weithiau hyd yma."
        },
        {
            "text": "Rydym wedi gwneud gwasanaethau llysoedd a thribiwnlysoedd yn haws i'w defnyddio ac yn fwy effeithlon i'w cynnal. Mae ein gwasanaethau yn gyflymach. Fe wnaeth achosion a gyflwynwyd yn ddigidol drwy ein gwasanaeth nawdd cymdeithasol a chynnal plant gymryd traean o'r amser i'w gwblhau o'i gymharu â'r rhai a gyflwynwyd ar bapur."
        },
        {
            "text": "Maen nhw hefyd yn symlach. Fe wnaethon ni setlo dros chwarter o apeliadau mewnfudo a lloches ar-lein yn gynnar yn y broses heb fod angen gwrandawiad."
        },
        {
            "text": "Mae ein gwasanaethau wedi'u moderneiddio yn fwy cywir. Fe wnaethon ni ddychwelyd llai na 1% o geisiadau ysgariad ar-lein oherwydd gwall defnyddwyr, o'i gymharu â 40% ar y system bapur."
        },
        {
            "text": "Maen nhw wedi’u cysylltu’n well hefyd. Mae’r Platfform Cyffredin, ein system rheoli achosion troseddol, bellach yn weithredol mewn 76% o lysoedd troseddol. Er bod gennym rywfaint o fanion i’w gorffen o hyd, rydym eisoes yn sylweddoli’r manteision enfawr trwy ganiatáu i'r holl bartïon sy'n rhan o achos gael mynediad at wybodaeth ar un system, am y tro cyntaf erioed."
        },
        {
            "text": "Mae ein gwasanaethau diwygiedig yn hanfodol er mwyn darparu'r mynediad gorau at gyfiawnder i bob dioddefwr, tyst, diffynnydd, hawlydd, busnes a theulu sydd angen y llysoedd a'r tribiwnlysoedd, i amddiffyn y rhai sy'n agored i niwed a dwyn y pwerus i gyfrif."
        },
        {
            "text": "Rwy'n hynod falch ac yn ddiolchgar i bawb sydd wedi chwarae eu rhan wrth drawsnewid y gwasanaethau hynny."
        },
        {
            "heading": 2,
            "text": "Goresgyn her"
        },
        {
            "text": "Er gwaethaf y gwahanol gyflawniadau, ni allai'r un ohonon ni fod wedi rhagweld yr heriau rhyfeddol rydyn ni wedi'u hwynebu. Bu effeithiau pandemig y coronafeirws (COVID-19) yn sylweddol a phellgyrhaeddol i GLlTEF."
        },
        {
            "text": "Mae ein staff a'n partneriaid wedi bod o dan bwysau i ddelio â'r nifer uchel o achosion ar draws ein llysoedd a'n tribiwnlysoedd. Ar yr un pryd, maen nhw'n gweithredu cyfradd heriol o newid i ffyrdd o weithio wrth i ni gyflawni camau olaf y rhaglen ddiwygio (sydd hefyd yn rhan annatod o'n gwaith adfer)."
        },
        {
            "text": "Gwn fod gofynion diwygio ac adfer wedi bod yn hynod heriol i bawb sy'n gweithio o fewn y system gyfiawnder."
        },
        {
            "heading": 2,
            "text": "Pwyso a mesur"
        },
        {
            "text": "Rydym yn dal i fod yn ymrwymedig i gyflawni gweledigaeth ein rhaglen ddiwygio, ond mae rhai pethau y mae angen i ni fynd i'r afael â nhw. Rydym wedi edrych ar yr anawsterau ac wedi nodi lle mae rhwystrau'n bodoli ac wedi adolygu ein hopsiynau yn unol â lleddfu pwysau lle bynnag y gallwn."
        },
        {
            "text": "Rydym yn gwybod bod ceisio newid gormod, yn rhy gyflym wedi tanseilio hyder ar adegau. Ond rwyf am eich sicrhau ein bod yn parhau i ddysgu o'n profiadau a'ch adborth, ac rwy'n hyderus y gallwn wneud yn well."
        },
        {
            "text": "Felly rydyn ni wedi pwyso a mesur ac edrych yn realistig ar beth allwn ni ei gyflawni ac erbyn pryd. O ganlyniad rydym wedi addasu rhai elfennau o'r rhaglen ddiwygio. Mae ein hamserlen ddiwygiedig yn lleihau gorgyffwrdd ac yn caniatáu mwy o amser paratoi. Mae gennym gefnogaeth lawn yr Arglwydd Ganghellor, yr Arglwydd Brif Ustus ac Uwch Lywydd y Tribiwnlysoedd wrth wneud yr addasiadau hyn."
        },
        {
            "text": "Ein ffocws nawr yn dal i fynd i'r afael ag achosion sydd heb eu datrys, ond hefyd i baratoi llysoedd a thribiwnlysoedd yn well - a phawb sy'n gweithio ynddynt - ar gyfer y newidiadau y byddwn yn eu cyflawni dros y flwyddyn i ddod."
        },
        {
            "heading": 2,
            "text": "Effaith ar brosiectau"
        },
        {
            "text": "Yn yr awdurdodaeth droseddol, byddwn yn parhau i gyflwyno'r Platfform Cyffredin i weddill Llysoedd y Goron a'r Llysoedd Ynadon erbyn yr haf. Bydd hyn yn rhoi mwy o amser i'n staff a'n partneriaid ddatblygu, addasu a rhoi’r system ar waith."
        },
        {
            "text": "Byddwn ni'n dal i ddatblygu ymarferoldeb pellach ar y Platfform Cyffredin er mwyn galluogi i bob math o achosion gael eu prosesu ar y system, gan leihau'r broses ddeuol o gynnal systemau, yn enwedig mewn llysoedd ynadon a all wneud pethau'n fwy cymhleth."
        },
        {
            "text": "Bydd y broses integreiddio â'n hadnodd amserlennu a rhestru - List Assist - a gwell ymarferoldeb o ran symud achosion yn eu baenau, ar ôl iddynt gael eu profi am fwy o amser mewn llysoedd mabwysiadu cynnar. Efallai y bydd hyn yn cymryd ychydig mwy o amser ond mae'n golygu y bydd y canlyniad terfynol yn well, gyda mwy o amser i baratoi a chefnogi ein holl ddefnyddwyr."
        },
        {
            "text": "I ffwrdd o'r awdurdodaeth droseddol, rydym yn blaenoriaethu'r gwaith i wella ac ymgorffori'r gwasanaeth cyfraith deulu gyhoeddus, cyn i ni gyflwyno'r swyddogaeth cyfraith breifat newydd. Yn yr un modd, byddwn yn cymryd mwy o amser mewn llysoedd mabwysiadu cynnar i sicrhau bod prosesau'n iawn i'r holl ddefnyddwyr, gan gynnwys ein hasiantaethau partner."
        },
        {
            "text": "Yn yr awdurdodaeth sifil, rydym yn gwneud cynnydd da iawn o ran ymestyn ymarferoldeb i'n systemau sydd newydd eu diwygio. Byddwn yn cymryd agwedd bwyllog, gan ddarparu'r gwasanaethau sy'n weddill sef hawliadau arian sifil ar-lein, gorfodi sifil, hawliadau swmp a iawndal dros y flwyddyn nesaf."
        },
        {
            "text": "Byddwn ni hefyd yn cwblhau’r broses o ddiwygio’r tribiwnlysoedd cyflogaeth, tribiwnlysoedd mewnfudo a thribiwnlysoedd nawdd cymdeithasol a chynnal plant."
        },
        {
            "text": "Byddwn yn integreiddio ein hadnodd amserlennu a rhestru newydd gyda phob un o'r systemau rheoli achosion sifil, teulu a thribiwnlysoedd diwygiedig, ac yn parhau i ddatblygu'r Gwasanaeth Gwrandawiadau Fideo."
        },
        {
            "text": "I gwblhau'r prosiectau hyn, byddwn yn rhoi’r gorau i waith diwygio digidol ar fabwysiadu a meddiant am y tro. Rydym hefyd yn bwriadu darparu gwasanaeth newydd ar gyfer y Tribiwnlys Digolledu am Anafiadau Troseddol ond rhoi’r gorau i’r gwaith ar bob Tribiwnlys Arbennig arall."
        },
        {
            "text": "Byddwn yn gweithredu gwasanaethau sifil, teulu a thribiwnlysoedd sy'n weddill erbyn mis Mawrth 2024."
        },
        {
            "text": "Wrth wneud y penderfyniad hwn rydym wedi gwrando ar adborth, wedi gweithredu arno, ac wedi blaenoriaethu profiad holl ddefnyddwyr y llys: ein partneriaid, ein staff a'r bobl yr ydym yn eu gwasanaethu."
        },
        {
            "heading": 2,
            "text": "Dechrau positif"
        },
        {
            "text": "Er bod llawer o fanylion eto i weithio drwyddynt, rwy'n gobeithio bod yr addasiad hwn ar gyfer y flwyddyn i ddod yn rhoi sicrwydd."
        },
        {
            "text": "Rwy'n hyderus, drwy chwilio am welliannau cyson a phrofi ffiniau ein galluoedd, wrth barhau i weithio'n effeithiol ochr yn ochr â'n partneriaid, y gallwn ddarparu system gyfiawnder o'r radd flaenaf."
        }
    ]
}