{
    "url": "https://cddo.blog.gov.uk/2023/03/20/the-civil-service-data-challenge-final-is-coming-soon/",
    "title": "The Civil Service Data Challenge Final is coming soon",
    "authors": [
        "Central Digital and Data Office"
    ],
    "categories": [
        "Data",
        "DDaT community",
        "DDaT events",
        "Digital transformation"
    ],
    "pub_date": "2023-03-20T12:39:22+00:00",
    "content": [
        {
            "text": "The Data Challenge seeks ideas from civil servants on how government can improve its use of data. The competition is open to all Civil Servants, regardless of grade, department or role, and truly recognises the value, and importance of data in transforming government. "
        },
        {
            "text": "The Challenge is a collaboration between Cabinet Office, Global Government Forum, NTT DATA and the Office for National Statistics (ONS). The winning idea will receive £50,000 cash funding, as well as both technical advice and development support from NTT DATA UK, and the backing of top Civil Servants to bring the idea to life."
        },
        {
            "text": "The grand final is coming soon on Thursday 23 March where the finalists will present their ideas for the last time. The winner will be awarded by Alex Chisholm, the Cabinet Office's Permanent Secretary. You can read all about the semi final in our previous blog."
        },
        {
            "text": "The finalists this year range from using HMRC data to make child maintenance payments more efficient, to detecting modern slavery through a modern data-driven approach to machine learning at HMRC to LabSpace providing a service that enables policy makers and researchers to work together to quickly conduct policy experiments online at a low cost."
        },
        {
            "text": "The winning idea from last year’s challenge - the use of AI to identify and deliver restoration of peat bogs - is now being implemented by DEFRA. 20 million tonnes of CO2 are lost a year through peat bogs drying out, and it is difficult and labour-intensive to restore them. Using innovative AI to rapidly identify sites to remediate is reducing the cost of protecting these important environments and enabling more carbon savings at a much lower cost."
        },
        {
            "text": "This year’s challenge received 119 ideas and 168 requests to become part of one of the project teams, from departments across the Civil Service."
        },
        {
            "text": "Here in the lead up to the final - we’ll be sharing the finalists’ stories. Subscribe to the CDDO blog."
        }
    ]
}