{
    "url": "https://competitionandmarkets.blog.gov.uk/2023/04/28/calling-economists-returners-programme-at-the-cma/",
    "title": "Calling Economists: Returners Programme at the CMA",
    "authors": [
        "Martina Prosperetti"
    ],
    "categories": [
        "Life at the CMA"
    ],
    "pub_date": "2023-04-28T10:35:09+01:00",
    "content": [
        {
            "text": "Are you an economist who's taken a career break from working as a professional economist and would like to get back into the swing of things?"
        },
        {
            "text": "If so, the Econ Returners Programme, a new initiative from the Competition and Markets Authority (CMA), is the right place for you to start. We have exciting opportunities for professionals who have taken a career break and are keen to contribute with their knowledge, technical skills, and experience to a diverse and inclusive organisation dedicated to promoting competition for the benefit of consumers."
        },
        {
            "heading": 2,
            "text": "The programme"
        },
        {
            "text": "The programme offers successful applicants a flexible fixed-term contract (minimum of 6 months and maximum of 12 months to be discussed at the offer stage) with the possibility of transitioning into a permanent role."
        },
        {
            "text": "With the opportunity to work flexibly across the full range of our projects, or to specialise in certain areas, you will be the lead economist on some cases, or lead on a particular area of analysis in more complex cases. You will be responsible for carrying out and/or supervising economic analysis relevant to the project, including presenting results and providing economic advice to colleagues across different professions and decision makers. You will have opportunities to manage and develop others, and to contribute to the development of the CMA’s economics capability. You will be working in an environment with autonomy, responsibility and direct access to key decision makers."
        },
        {
            "heading": 2,
            "text": "Our training opportunities"
        },
        {
            "text": "One of the key features of the programme is the dedicated additional time you will have to carry out the extensive training we offer. You will have the initial and ongoing support of an experienced mentor and some dedicated time to pursue training opportunities to support your successful transition into the workplace. These include internal and external training courses, lunchtime seminars, practical skills sessions, career development talks, and reading and discussion groups. You will also be encouraged to access wider learning and development opportunities on ‘soft skills’ such as communication and leadership skills, and technology and digital skills (Stata and other programming software)."
        },
        {
            "text": "This means you'll have plenty of opportunities to learn and grow, and you'll be able to build your confidence as you refresh your skills and stay up to date with the latest developments in the field."
        },
        {
            "heading": 2,
            "text": "Flexibility"
        },
        {
            "text": "At the CMA we work flexibly in many ways. You will have the freedom and technology to enable you to work outside of the office for 60% of your contracted hours and you can choose to work from any of our offices (Belfast, Cardiff, Edinburgh, London or Manchester) for the remaining of your hours."
        },
        {
            "text": "You will also be able to choose among different working patterns (including part-time, compressed hours and flexible patterns) to allow you to work around any non-work commitments you may have. Many people in the economist team, and the wider CMA, have working patterns different from full-time."
        },
        {
            "text": "For example, Martina says:"
        },
        {
            "text": "Michal says:"
        },
        {
            "heading": 2,
            "text": "Inclusivity and culture"
        },
        {
            "text": "The CMA is a great place to work, and we thrive to create an inclusive and diverse environment where we value the contribution that everyone brings. We have a number of staff networks which support this culture, such as the Carers’ network, Women network, Race network and VisAbility network. We also have a working parent buddy scheme, where working parents support new parents recently returned to work."
        },
        {
            "heading": 2,
            "text": "Come and join us"
        },
        {
            "text": "If you are interested in the programme, find out more by visiting Civil Service Jobs and apply by 11.55pm on Tuesday 30th May 2023."
        },
        {
            "text": "If you have questions or want more details, we are planning an online event where you will have the opportunity to hear from CMA staff who was hired through previous CMA returners programme, and other colleagues with current and previous flexible working arrangements about their experience of working at the CMA. At the event, we will also give some useful information on the recruitment and interview process, and you will have opportunity to ask questions."
        },
        {
            "text": "Sign up to the online event on the Eventbrite website. The event will be recorded and be available on the CMA’s YouTube channel."
        }
    ]
}