{
    "url": "https://medregs.blog.gov.uk/2023/04/28/ensuring-child-vaccine-safety-at-every-step/",
    "title": "Ensuring Child Vaccine Safety at Every Step",
    "authors": [
        "Shiva Ramroop"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2023-04-28T13:06:00+01:00",
    "content": [
        {
            "text": "Shiva Ramroop, Medical Assessor at the Medicines and Healthcare products Regulatory Agency (MHRA), and paediatric specialist, discusses how we ensure the safety of vaccines for children in the UK as new survey data reported by Meningitis Now shows the majority of parents trust that vaccines are safe and effective."
        },
        {
            "text": "Following the COVID-19 pandemic, health systems have made great progress in developing safe and effective vaccines and delivering them to people across the world. However, while the world was focused on COVID, other viruses did not go away. This World Immunisation Week, the World Health Organisation (WHO) is collaborating with global partners for ‘The Big Catch-up’ to address what they estimate to be 30 years of vaccination progress lost due to the COVID-19 pandemic."
        },
        {
            "text": "In the UK, NHS data for the year 2021/22 showed that, for the first time since 2010/11, the 95% national vaccine coverage target for children under the age of five was not met. And this week, UKHSA’s latest update showed an equally concerning drop of 7% in uptake for adolescents receiving the vaccine protecting against tetanus, diphtheria and polio in 2021/22 compared with the previous year."
        },
        {
            "text": "We are therefore encouraged by the findings from a recent survey reported by the Meningitis Now, finding that over 90% of parents of under-fives trust vaccines and believe they are safe and effective and three quarters of parents surveyed said they had heard or seen something that made them feel it was important to have their child vaccinated."
        },
        {
            "text": "From smallpox and flu to meningitis and HPV, vaccines have been the most effective way to boost immunity and fight viruses for generations."
        },
        {
            "text": "At the MHRA, we are committed to helping all parents and healthcare professionals have confidence that the vaccines being delivered in the UK are effective against disease and safe for use by the general public and the most vulnerable, including our children."
        },
        {
            "text": "We also know that children have unique needs that must be considered when assessing the safety of vaccines, such as whether the dose and route of administration are appropriate."
        },
        {
            "text": "Therefore, long before a vaccine reaches a child or is added to the routine childhood immunisation schedule, we are involved in testing and monitoring a vaccine’s development."
        },
        {
            "text": "This starts when researchers apply to us for authorisation of their clinical trial, where we review how it will be conducted, whether it will provide useful information and whether we think it is safe to conduct. Over the past 5 years, we have assessed and authorised over 4,000 clinical trials in the UK, supporting innovation and ensuring the safety of the public is always front of mind."
        },
        {
            "text": "Throughout clinical trials, all side effects must be reported so we can assess the benefits and risks before making a recommendation for how the trial should proceed, if at all."
        },
        {
            "text": "At completion, we thoroughly review all the data from the lab and clinical trial results as well as manufacturing and quality controls. Once reviewed, we then seek advice from the independent Commission on Human Medicines, who also assess the data before advising the government on the safety, quality and effectiveness of any potential vaccine."
        },
        {
            "text": "Following these assessments, we provide reports including a Summary of Product Characteristics, giving healthcare professionals a description of a vaccine’s properties and the conditions attached to its use. We also provide a Patient Information Leaflet on using the medicine safely and share a Public Assessment Report explaining how each product was assessed and authorised."
        },
        {
            "text": "After we approve a vaccine for children, we continue to monitor it. We test every single batch of vaccines in the UK to ensure that each one is exactly the same as the one we approved before it can go to the health centres that immunise your child."
        },
        {
            "text": "Our role doesn’t stop there. We constantly collaborate with healthcare authorities around the world, sharing information to monitor a vaccine’s effectiveness and remain vigilant for any potential safety concerns. Our most important partner in that, is you."
        },
        {
            "text": "The Yellow Card Reporting Scheme is our system that allows you to flag any suspected side effects with a medicine, vaccine or medical device. We encourage everyone to monitor any side effects and report them immediately to us. Reports are reviewed by our safety experts who analyse the risks and then make a recommendation for any necessary updates to the safety information or how the vaccine is used in children."
        },
        {
            "text": "Reporting by parents and adolescents through the Yellow Card Reporting Scheme, combined with reports from healthcare professionals and other data sources, means we are able to continuously monitor and review vaccine safety and act quickly to protect public health."
        },
        {
            "text": "As the WHO aims to deliver ‘The Big Catch-up’, the MHRA will continue working with researchers, healthcare authorities and the public to make sure safety and quality standards are met from trials to clinics, to ensure vaccine safety for our children at every step."
        }
    ]
}