{
    "url": "https://educationhub.blog.gov.uk/2023/04/28/exams-in-2023-everything-you-need-to-know/",
    "title": "Exams in 2023 – everything you need to know",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Exams and qualifications"
    ],
    "pub_date": "2023-04-28T11:45:51+01:00",
    "content": [
        {
            "text": "This article was originally published on 29 September 2022 and has been updated to reflect the latest information."
        },
        {
            "text": "Exams and formal assessments in England, including GCSE, AS level, A level and T Level, are going ahead as normal this summer."
        },
        {
            "text": "This is important to prepare students for college, university or employment in the best possible way, and to help them make choices about their future."
        },
        {
            "text": "In recognition of the disruption that students have experienced, support has been put in place for students taking GCSE and A level exams and assessments"
        },
        {
            "text": "Here’s what you need to know about exams in 2023."
        },
        {
            "heading": 3,
            "text": "When are exams in 2023?"
        },
        {
            "text": "GCSE, AS level and A level exams will start on 15 May 2023 with the final exam due to take place on 27 June 2023."
        },
        {
            "text": "VTQ (vocational technical qualifications) exams and formal assessments have been taking place throughout the year and continue this term."
        },
        {
            "text": "T Level assessments began in February and will continue throughout this term."
        },
        {
            "heading": 3,
            "text": "When are 2023 results days? "
        },
        {
            "text": "AS level, A level and T Level results day will be on 17 August 2023."
        },
        {
            "text": "GCSE students will be able to find out their results on 24 August 2023."
        },
        {
            "text": "Students will receive results for level 3 VTQs on or before 17 August and will receive results for level 2 VTQs on or before 24 August 2023."
        },
        {
            "heading": 3,
            "text": "What is the latest on exam arrangements for 2023?"
        },
        {
            "text": "AS level, A level and VTQ exams and assessments in England will return to pre-pandemic arrangements this summer. Most GCSE exams are also returning to normal."
        },
        {
            "text": "To acknowledge that students may still have experienced some disruption they will continue to be supported in GCSE maths, physics and combined science with formulae and equation sheets during exams."
        },
        {
            "text": "There will also be protection for students taking GCSEs, AS levels and A levels when it comes to grading, which we explain below."
        },
        {
            "text": "The GCSE, AS level and A level exam timetable has also been designed to space out exam papers in the same subject to give students more time to revise between papers than before the pandemic."
        },
        {
            "text": "Normal assessment arrangements remain in place for T Levels, for both core assessments and occupational specialism assessments."
        },
        {
            "text": "More information on what support is available, how to prepare for exams and who marks your work is available on Gov.uk and through the Joint Council for Qualifications."
        },
        {
            "text": "We are also ensuring that students continue to have access to high-quality tutoring, through the National Tutoring Programme and 16-19 Tuition Fund."
        },
        {
            "heading": 3,
            "text": "How will exams be graded?"
        },
        {
            "text": "In September 2021, when students began studying their GCSE and A level course, Ofqual set out a two year plan for grading."
        },
        {
            "text": "Last September, Ofqual confirmed a return to pre-pandemic grading in 2023, with protection in place for GCSEs, AS and A levels against the impact of disruption, including from the COVID-19 pandemic."
        },
        {
            "text": "This year grading will include an allowance for disruption so that overall results will be similar to those of 2019. So where national performance is found to be lower than it was prior to the pandemic, senior examiners will make allowances when setting grade boundaries."
        },
        {
            "text": "Broadly speaking, this means that a student should be just as likely to achieve a particular grade this year as they would have been before the pandemic."
        },
        {
            "text": "It’s important to remember there is no limit or cap on the number of students who can achieve each grade. Students will be awarded a grade that reflects their performance."
        },
        {
            "text": "As always, exams will be marked by independent examiners, using the published mark schemes. Grading happens after marking, and to ensure fairness is done year by year because the papers change from one year to the next."
        },
        {
            "text": "Ofqual makes sure it is no easier or harder to get a grade in a subject between one board and another."
        },
        {
            "text": "For more on grading and how it works see Ofqual's website."
        },
        {
            "text": "As VTQs use a range of different assessment approaches, awarding organisations will use suitable grading arrangements for the qualifications they offer. They will take into account the grading approach used in GCSE, AS level and A levels where appropriate."
        },
        {
            "text": "For T Levels, Ofqual has asked awarding organisations to be generous in the first years of awards for the Technical Qualification component. This is to reflect that they are new qualifications."
        },
        {
            "text": "This year will be the first year that Technical Qualifications in T Levels are based fully on exams, whereas some previously included teacher assessed grades in 2021. This means that the profile of results may look different in some subjects, and it will be important not to compare them with last year’s results."
        },
        {
            "heading": 3,
            "text": "Will this affect my university application?"
        },
        {
            "text": "Universities make sure their entry requirements and offers reflect the grades students are likely to receive in the summer."
        },
        {
            "text": "This is something they do every year and 2023 is no different. It means there will be plenty of high-quality options for students, and grading does not affect the number of places available."
        },
        {
            "text": "While grades play a big part in university applications, admissions teams also consider a broad range of information about a student, including their predicted grades, personal statement, teacher references or other assessments and interviews."
        },
        {
            "text": "Of course, every year there is competition for the top places or on the most popular courses but there will always be plenty of options for students at another university, through clearing."
        },
        {
            "text": "While higher education opens many doors for those who study at this level, it is by no means the right option for everyone, including those who achieve the highest grades."
        },
        {
            "text": "There are now many exciting options outside of a three-year degree, including technical and vocational courses, and degree apprenticeships."
        },
        {
            "text": "You can find out more about what options are available to you here."
        }
    ]
}