{
    "url": "https://aphascience.blog.gov.uk/2023/04/28/his-majesty-the-king-visits-apha-weybridge/",
    "title": "Welcoming His Majesty The King to APHA Weybridge",
    "authors": [
        "Heather O'Sullivan"
    ],
    "categories": [
        "APHA news"
    ],
    "pub_date": "2023-04-28T09:53:10+01:00",
    "content": [
        {
            "text": "We were delighted to welcome His Majesty King Charles III to APHA Weybridge on 9 March. His Majesty The King met with scientists and staff to learn more about their contribution to protecting animal, plant and bee health, including their work associated with the largest-ever outbreak of avian influenza in the UK."
        },
        {
            "text": "APHA’s world-leading scientists and staff have played a vital role in supporting avian influenza diagnostics and disease control. Their work to tackle the outbreak helps protect animal and public health but also supports our international trading relationships."
        },
        {
            "text": "His Majesty The King undertook a full tour of Weybridge joined by Geraint Richards from the Duchy of Cornwall estate, Edward Parsons from the Sandringham estate, and Paul Sedgewick from the Crown estate."
        },
        {
            "text": "Also in attendance were Lord Benyon, Minister for Biosecurity, Marine and Rural Affairs, David Holdsworth, our Chief Executive and Professor Ian Brown, our Director of Scientific Services."
        },
        {
            "text": "The tour involved briefings on some of most difficult animal health diseases the world faces including avian influenza and bovine TB as well as plant health challenges including invasive non-native species."
        },
        {
            "text": "His Majesty The King also visited dedicated specialist research laboratories to see genome mapping and a mosquito laboratory where he was shown APHA’s vector-borne disease (VBD) programme."
        },
        {
            "text": "His Majesty The King spent a generous amount of time meeting and speaking with a wide range of staff from across the network of GB sites, including those working on the import of pets from Ukraine, before personally addressing all in attendance and via a live video link."
        },
        {
            "heading": 3,
            "text": "Staff have shared their reflections on the historic visit:"
        },
        {
            "text": "We issued a press release to mark the announcement – read more here."
        }
    ]
}