{
    "url": "https://teaching.blog.gov.uk/2026/02/23/building-a-culture-of-inclusion/",
    "title": "Building a culture of inclusion",
    "authors": [
        "Katrin Lehmann"
    ],
    "categories": [
        "Curriculum best practice",
        "Inspiring teachers",
        "SEND"
    ],
    "pub_date": "2026-02-23T11:46:36+00:00",
    "content": [
        {
            "text": "At West Thames College, we’re driven by a shared belief that every young person should be inspired, supported and enabled to achieve their ambitions, whatever their starting point. "
        },
        {
            "text": "That commitment to unlocking opportunity for all students underpins everything we do. Students with high needs are a visible, valued and integral part of everyday college life.  "
        },
        {
            "heading": 2,
            "text": "Enterprise and enrichment "
        },
        {
            "text": "Our busy enterprise pop-up shops sell plants grown in gardening lessons, cakes baked in catering classes, and handmade cards created during enrichment sessions. These activities help students build confidence, communication, teamwork and pride. "
        },
        {
            "text": "Students on our pathway for young people with profound and multiple learning disabilities also lead social action projects. Their lunch club food service and vintage fashion jumble sale have raised more than £3,000 for charity.  "
        },
        {
            "text": "Students with high needs regularly take part in performances in our theatre, sessions in our dance studios, workouts in the gym and activities on our sports fields. These shared experiences build friendships, broaden horizons and help all students learn from one another.  "
        },
        {
            "heading": 2,
            "text": "How students are empowered to have a voice "
        },
        {
            "text": "Our students with high needs are supported to develop self-advocacy and citizenship. They make meaningful contributions that influence decision-making across the college. "
        },
        {
            "text": "Many act as course representatives, gathering views from their peers and presenting feedback. They also attend Executive Team Student Voice meetings, speaking directly with senior leaders about their experiences, ideas and priorities. "
        },
        {
            "heading": 2,
            "text": "Shaping local provision "
        },
        {
            "text": "Our local authority regularly works directly with our students through focus groups, helping shape the SEND local offer in Hounslow. Their insights have influenced local planning and provision, demonstrating the trust placed in them and the confidence they gain as active, valued citizens. "
        },
        {
            "text": "Students with high needs also act as college ambassadors at key events, representing their pathways and the wider West Thames community. "
        },
        {
            "heading": 2,
            "text": "Partnerships and pathways into employment "
        },
        {
            "text": "Transforming futures for young people with support needs through employment is a key priority.  "
        },
        {
            "text": "Our curriculum is designed around clear, planned pathways that help students build skills, confidence and independence, preparing them for their next steps in education, training or work. "
        },
        {
            "heading": 2,
            "text": "Working with partners "
        },
        {
            "text": "We’re an active partner in Hounslow’s Youth Skills Employment Guarantee and the Supported Employment Forum, working collaboratively to remove barriers to opportunity.  "
        },
        {
            "text": "Through our Preparing for Adulthood events, families meet organisations including local charities and the Department for Work and Pensions. "
        },
        {
            "heading": 2,
            "text": "Supported internships and employment success "
        },
        {
            "text": "Our Project SEARCH supported internships deliver exceptional outcomes, with around 70% of interns moving into paid employment each year. Recent successes include roles at Channel 4, Heathrow Airport, Thorpe Park and the London Borough of Hounslow.  "
        },
        {
            "text": "Other students have progressed into apprenticeships at Great Oaks School and Kew Gardens, or secured positions with DHL, Cineworld, local libraries and community partners. "
        },
        {
            "heading": 2,
            "text": "Our Independence Hub "
        },
        {
            "text": "Hounslow Council has named West Thames College as its first-choice provider of post-16 SEN education. "
        },
        {
            "text": "During 2024–25, we worked closely with the Hounslow SEND team to co-design and co-fund a new Independence Hub, created in response to increasing demand for local places for young people with profound and multiple learning disabilities.  "
        },
        {
            "text": "The hub opened in September, welcoming eight local students, and will grow to around forty students over the next three years.  "
        },
        {
            "heading": 2,
            "text": "A closing reflection "
        },
        {
            "text": "What makes inclusion at West Thames College work is not any single programme or facility, it’s a culture. A culture where students with high needs are not on the margins, but at the heart of college life. "
        }
    ]
}