{
    "url": "https://defrafmp.blog.gov.uk/2026/02/23/cuttlefish-action-plan-progress-and-upcoming-engagement/",
    "title": "Cuttlefish Action Plan: progress and upcoming engagement",
    "authors": [
        "Fisheries Management Team, Marine Management Organisation"
    ],
    "categories": [
        "- Defra led FMPs",
        "Implementation"
    ],
    "pub_date": "2026-02-23T14:30:00+00:00",
    "content": [
        {
            "text": "The Marine Management Organisation (MMO) is working hard to improve its knowledge and build a collaborative approach to managing the cuttlefish fishery as part of the Channel demersal non-quota species fisheries management plan (FMP)."
        },
        {
            "text": "Several major milestones were achieved in 2025 for the FMP including the publication of the first ever Cuttlefish Action Plan. Several actions from the plan have been completed including cuttlefish market sampling to explore the presence of the species."
        },
        {
            "heading": 2,
            "text": "Research at markets"
        },
        {
            "text": "Between November 2024 and April 2025, MMO visited markets in Newlyn, Brixham, and Hastings. They took samples to test the effectiveness of three new cuttlefish species ID cards and gather biological data."
        },
        {
            "heading": 3,
            "text": "Highlights include:"
        },
        {
            "text": "These findings highlight the importance for fishermen to record different species and to keep gathering and monitoring spatial and biometric data."
        },
        {
            "text": "This data is useful for making management choices based on facts, such as determining a potential maximum sustainable yield (MSY) or proxy - MSY levels are the largest catch that can be removed from the stock while, without reducing its ability to replenish itself."
        },
        {
            "text": "You can find the Cuttlefish Market Sampling Report 2025 report on GOV.UK."
        },
        {
            "heading": 2,
            "text": "Why correct species identification matters"
        },
        {
            "text": "Correctly identifying cuttlefish species is important for managing them sustainably and gathering credible data."
        },
        {
            "text": "Fishermen need to make every effort to avoid using the generic landing code CTL, as this hides species-level trends that are crucial for stock assessments."
        },
        {
            "text": "To help with this, get our cuttlefish species ID cards online, or pick up a copy from your local MMO office."
        },
        {
            "heading": 2,
            "text": "Cuttlefish Action Plan progress"
        },
        {
            "text": "A recent review shows that good progress has been made. In addition to the research and ID cards, completed actions include:"
        },
        {
            "text": "Ongoing work:"
        },
        {
            "heading": 2,
            "text": "Get involved"
        },
        {
            "text": "We’re heading out across the South and South West to speak directly with the people who know these fisheries best. These informal drop-in ‑in sessions are a chance to:"
        },
        {
            "text": "Whether you're a skipper, crew member, producer organisation, Inshore Fisheries and Conservation Authorities (IFCA) officer, processor, or from an environmental non-governmental organisation (eNGOs), your insight is essential. The more we hear from you, the better we can ensure management measures are practical, evidence ‑based, and support both a healthy stock and a healthy industry."
        },
        {
            "heading": 3,
            "text": "📍 Where you will find us"
        },
        {
            "text": "Monday 2 March 2026        "
        },
        {
            "text": "Tuesday 3 March 2026        "
        },
        {
            "text": "Wednesday 4 March 2026"
        },
        {
            "text": "Thursday 5 March 2026"
        },
        {
            "text": "Friday 6 March 2026"
        },
        {
            "text": "For more information contact fmp@marinemanagement.org.uk"
        }
    ]
}