{
    "url": "https://defrafmp.blog.gov.uk/2026/02/23/drop-in-with-your-views-on-future-plans-for-the-whelk-fishery/",
    "title": "Drop-in with your views on future plans for the whelk fishery",
    "authors": [
        "Fisheries Management Team, Marine Management Organisation"
    ],
    "categories": [
        "- Defra led FMPs",
        "Implementation"
    ],
    "pub_date": "2026-02-23T14:31:00+00:00",
    "content": [
        {
            "text": "The Marine Management Organisation (MMO) is working hard to improve its knowledge and build a collaborative approach to managing the English whelk fishery as part of the whelk fisheries management plan (FMP) for English waters."
        },
        {
            "heading": 2,
            "text": "Improving data collection and understanding"
        },
        {
            "text": "We still have a lot to learn about English whelk stocks. To meet the requirements of the whelk FMP to improve our understanding of the English whelk fishery and its stocks, the MMO is working hard to understand fishing effort, mainly by looking at the number of pots used. This information will help with stock assessments."
        },
        {
            "heading": 2,
            "text": "Permit scheme"
        },
        {
            "text": "The FMP proposes the introduction of a permit scheme to fish whelks in English waters. We need stakeholder input on views for the scheme to develop potential options.  "
        },
        {
            "heading": 2,
            "text": "Get involved"
        },
        {
            "text": "We’re heading out across the South and South West to speak directly with the people who know the fishery. These informal drop‑in sessions are a chance to talk face‑to‑face about what’s really happening on the water and what would work for the fleet."
        },
        {
            "text": "Here’s what we’re looking to do together:"
        },
        {
            "text": "Come along, have a chat, and help make sure the decisions being made reflect the reality of the fishery."
        },
        {
            "heading": 3,
            "text": "📍 Where you will find us"
        },
        {
            "text": "Monday 2 March 2026        "
        },
        {
            "text": "Tuesday 3 March 2026        "
        },
        {
            "text": "Wednesday 4 March 2026"
        },
        {
            "text": "Thursday 5 March 2026"
        },
        {
            "text": "Friday 6 March 2026"
        },
        {
            "text": "For more information contact fmp@marinemanagement.org.uk"
        }
    ]
}