{
    "url": "https://sustainableict.blog.gov.uk/2026/02/23/gdsa-summit-returns-building-on-our-progress/",
    "title": "GDSA Summit returns: building on our progress",
    "authors": [
        "Lydia Tabbron"
    ],
    "categories": [
        "GDSA",
        "Sustainable ICT"
    ],
    "pub_date": "2026-02-23T08:00:00+00:00",
    "content": [
        {
            "text": "Lydia Tabbron reflects on the progress of the Government Digital Sustainability Alliance (GDSA)  as we prepare for our forthcoming summit."
        },
        {
            "text": "Over the past 18 months the GDSA has taken on a new form. It’s transitioned from a group of 40 government suppliers to a blossoming and bustling community of digital sustainability experts, representing more than 94 organisations from industry, academia and the third sector. "
        },
        {
            "text": "Since our inaugural summit at the London Science Museum in 2024, which brought together partners from across sectors to share knowledge and spark new ideas, we’ve made a conscious effort to draw on the expertise in our alliance in different ways."
        },
        {
            "text": "Aware government doesn’t possess all the knowledge and insight in this ever growing and complex topic, the GDSA has been critical to informing emerging thinking and priorities for government in this area."
        },
        {
            "text": "Regular lunch and learn sessions, visits and working group meetings for our alliance have enabled us in government to enrich our own understanding. We’ve been able to weave this knowledge into strategy documents, guidance and policy to set out how and why sustainability should be embedded into government digital services. This will help to ensure efficiency and resilience alongside environmental and social benefits."
        },
        {
            "heading": 2,
            "text": "Shaping the government’s digital sustainability strategy"
        },
        {
            "text": "This work is shaping the development of the upcoming government digital sustainability strategy. The following themes have emerged as key priorities for government, thanks to the enhancement of our knowledge from the GDSA:"
        },
        {
            "text": "Alongside the strategy, the GDSA has also helped to inform the new government buying standards for information and communications technology (ICT), Defra’s sustainable AI position statement and the Greener Service Principles."
        },
        {
            "heading": 2,
            "text": "This year’s summit"
        },
        {
            "text": "This is why I am delighted to host our next summit. It’s a chance for those in our GDSA and colleagues from across government to discuss these topics which we care deeply about and to celebrate how far we have come."
        },
        {
            "text": "During the summit, scheduled for the end of February, we will hear from speakers across sectors on topics aligned to the digital sustainability strategy and why it’s crucial we act now, for the sake of our own digital security and resilience. The day will also give industry and government leaders in the room the opportunity to hear how others have transformed their digital services to be more sustainable, as well as the challenges and opportunities they’ve faced."
        },
        {
            "heading": 2,
            "text": "Why this matters"
        },
        {
            "text": "Driving sustainability is a priority across government. Integrating it into our digital services is no longer optional. It's expected. The government already asks suppliers to demonstrate their commitment to net zero, and sustainable digital practices will remain a core principle in the years ahead."
        },
        {
            "text": "As we launch our upcoming strategy, it will further cement government’s requirement for digital services and technology which are good for people and planet. And it's something which Defra is proud to lead on."
        },
        {
            "heading": 2,
            "text": "What Defra is doing"
        },
        {
            "text": "Defra was the first government department to publish a digital sustainability strategy, setting out how we'll achieve long-term environmental, economic and social sustainability across our digital work."
        },
        {
            "text": "Our new contract with Atos for end-user services shows how we're embedding sustainability into everyday operations. There's a practical benefit, too. Sustainable digital practices often save money, whether through reduced energy use, making devices last longer, or smarter buying decisions. And by creating demand for sustainable technology, we're helping to support a growing digital sustainability sector in the UK."
        },
        {
            "heading": 2,
            "text": "More information"
        },
        {
            "text": "Lydia Tabbron is the Digital Sustainability Lead for Defra and co-ordinates the GDSA on behalf of government. She has organised the summit with the support of Think Digital Partners."
        },
        {
            "text": "The GDSA brings together UK government, ICT and digital supply chain, academics and third sector organisations to drive progress on the sustainability of the UK government’s ICT and digital estate."
        },
        {
            "text": "If you're interested in finding out more about what we do or would like to know more about becoming a member of the alliance, please get in touch."
        },
        {
            "text": "Check out our LinkedIn page for all the latest news, stories and job openings. While you're there, why not give us a follow?"
        }
    ]
}