{
    "url": "https://teaching.blog.gov.uk/2026/02/23/how-our-adaptive-teaching-supports-every-learner/",
    "title": "How our adaptive teaching supports every learner",
    "authors": [
        "Ross Colley"
    ],
    "categories": [
        "Inspiring teachers",
        "Primary schools",
        "Professional Development",
        "Pupil wellbeing and behaviour",
        "SEND",
        "Teaching profession"
    ],
    "pub_date": "2026-02-23T11:58:12+00:00",
    "content": [
        {
            "text": "At Winyates, we follow a graduated approach to SEND that’s part of everyday teaching. "
        },
        {
            "text": "Here’s how we do it: "
        },
        {
            "heading": 3,
            "text": "1.) Assess "
        },
        {
            "text": "It all starts with finding gaps and looking for barriers to learning. Before children start, we do home visits, create stay and play opportunities, and get to know them. "
        },
        {
            "text": "When they arrive, we keep a close eye on progress through quality first teaching, formative assessment, observations, and conversations with children and parents."
        },
        {
            "text": "If a pupil isn’t making progress, we dig deeper into what might be getting in the way. "
        },
        {
            "heading": 3,
            "text": "2.) Plan "
        },
        {
            "text": "The class teacher, the SENCo, support staff and families work together to agree clear, achievable outcomes and decide what additional support might help. "
        },
        {
            "text": "Options include forest schools, sports mentoring, enhanced ordinarily available provision, foundational interventions, Thrive, drawing and talking, art therapy and Lego therapy. Plans are tailored to the pupil and focus on removing barriers."
        },
        {
            "heading": 3,
            "text": "3.) Do "
        },
        {
            "text": "Support is put in place, whether that’s targeted interventions, reasonable adjustments in class or specialist input. "
        },
        {
            "text": "The class teacher remains responsible for the pupil’s progress, with support staff working alongside them. Families are involved at every stage. "
        },
        {
            "heading": 3,
            "text": "4.) Review "
        },
        {
            "text": "We regularly check how well support is working by looking at progress, gathering pupil voices and feedback from staff and families. If something isn’t working, we adapt it.  "
        },
        {
            "heading": 2,
            "text": "Our approach to inclusion "
        },
        {
            "text": "Inclusion and adaptive teaching aren’t add-ons – they’re part of the classroom."
        },
        {
            "text": "We believe that all pupils belong in the room and that good teaching for SEND pupils is just good teaching for everyone. Lessons are planned with different needs in mind from the outset, so we’re not constantly reacting. "
        },
        {
            "heading": 2,
            "text": "Adaptive strategies "
        },
        {
            "text": "Teachers use a range of adaptive strategies, like flexible grouping, clear modelling, chunking instructions, and checking for understanding throughout lessons - ‘show me boards’ and ‘think pair share’ strike the balance between academic demand and children feeling safe to share their ideas.  "
        },
        {
            "heading": 2,
            "text": "Knowing our pupils "
        },
        {
            "text": "We’re big on knowing our pupils well. Regular assessment, low stakes quizzes, observation, and pupil voice help us spot barriers early and adapt teaching before gaps widen. "
        },
        {
            "text": "Support staff work purposefully to promote independence, and reasonable adjustments ensure pupils can access learning alongside their peers. "
        },
        {
            "heading": 2,
            "text": "A shared responsibility "
        },
        {
            "text": "Early identification of need is everyone’s responsibility, not just the SENCo’s. Teachers know their pupils well and pick up on small signs through day-to-day teaching – gaps in understanding, changes in behaviour, slow progress or pupils finding things harder than their peers. Half termly inclusion panels bring key people together to discuss next steps for children. "
        },
        {
            "heading": 2,
            "text": "Acting early "
        },
        {
            "text": "When a concern is spotted, we don’t wait. Teachers talk it through with the SENCo and parents early on, so we can put support in place before difficulties become bigger barriers. This might mean short, targeted interventions, pre-teaching key concepts, extra practice, or adapting the curriculum. "
        },
        {
            "text": "Often, small tweaks – like additional scaffolding, visuals, or adjusted tasks – make a big difference. "
        },
        {
            "heading": 2,
            "text": "Professional judgement "
        },
        {
            "text": "We use data sensibly to back up what we’re seeing in class, but professional judgement is key. Interventions are closely monitored, and if something isn’t working, we change it rather than sticking with it for the sake of it. "
        },
        {
            "text": "The focus is always on early action, flexibility, and giving pupils the right support at the right time."
        }
    ]
}