{
    "url": "https://forestrycommission.blog.gov.uk/2026/02/23/making-the-most-of-your-trees-discover-the-medium-value-timber-products-from-your-woodland/",
    "title": "Making the most of your trees: discover the medium-value timber products from your woodland",
    "authors": [
        "Chris Watson"
    ],
    "categories": [
        "Woodland management"
    ],
    "pub_date": "2026-02-23T09:00:00+00:00",
    "content": [
        {
            "text": "When we harvest trees from our woodlands, how they are used and what products they can make is highly dependent on the tree species’ natural properties and form."
        },
        {
            "text": "In our previous wood products blog, we looked at wood products that get the most out of trees regardless of their form and species, such as woodfuel and biomass. However, many trees are suitable for use in a much wider range of applications and markets."
        },
        {
            "text": "We will explore some of the common uses for medium-value timber products that are all around us – they include fencing, landscaping and pallets."
        },
        {
            "heading": 2,
            "text": "Exploring local markets"
        },
        {
            "text": "In addition to the physical properties of trees, your tree’s intended end use will also be decided by available local markets. Unprocessed timber is a bulky material and can be costly to transport. Therefore, most markets are based around wood processors who are set up to use local wood resources."
        },
        {
            "text": "In the south of England for example, sweet chestnut coppice is very common and markets exist for products such as chestnut fencing. Whereas in the north of England and southern Scotland, many sawmills are set up to work almost exclusively with Sitka spruce."
        },
        {
            "text": "Understanding what markets exist locally to you, the value of your timber and how cost-effective it is to produce different products from your timber can be a skilled job. It often requires regular contact with sawmills, processors and buyers, which is why seeking professional advice can be helpful."
        },
        {
            "heading": 2,
            "text": "Coppice wood products"
        },
        {
            "text": "Coppicing is a traditional way to manage broadleaf woodland in England and can really benefit wildlife. Species such as hazel, oak, willow and sweet chestnut can be repeatedly cut back to their base when dormant, to encourage the regrowth of multiple straight stems. This can be done on rotation every 7 to 20 years. We will explore some common, large-scale markets which coppice products can be readily sold into."
        },
        {
            "text": "The market for coppice products to support hedge laying is significant. England has 390,000km of hedgerows,1 thousands of meters of which are laid every year, creating a steady demand for stakes and binders."
        },
        {
            "heading": 2,
            "text": "Stakes and binders"
        },
        {
            "text": "The size of coppice material is largely controlled by the rotation length – the longer the rotations, the larger the diameter. However, longer rotations and larger diameters do not necessarily mean they are more valuable."
        },
        {
            "text": "Hazel coppice for example, is ideal for managing on short 7 to 12-year rotations, producing lots of long, thin poles that are suitable for things like thatching spars, woven hurdles and stakes and binders for hedging. All these uses are due to the pliability of hazel and its ability to be woven and twisted into place."
        },
        {
            "text": "When hazel coppice is harvested, each stem is visually graded and cut to length to suit their intended end use. Hedging stakes can be shorter, and thick stakes used to form a physical barrier in hedgerows around which the pleachers (the living, cut and bent stems of a hedge woven together for hedgelaying) can be laid."
        },
        {
            "text": "Stakes can be cut from the base of a coppice pole and can utilise shorter clean lengths. Binders are long, thin, flexible stems, somewhere between an inch and two inches in diameter at their base. Binders are typically used more regionally to weave along the top of a laid hedge to hold down the pleachers and provide strength to the hedge."
        },
        {
            "heading": 2,
            "text": "Fence posts and split fencing rails"
        },
        {
            "text": "Nearly every field, woodland and garden in the country is surrounded by a fence. In 2024, 224,000 green tonnes of softwood were used in the UK as fence posts.2 Whilst official statistics don’t exist for hardwood fencing, this is still a significant market which makes good use of coppice products."
        },
        {
            "text": "Fence posts are produced in different sizes, both height and diameter, with their dimensions designed for their end use. The main requirements for fence posts are straightness, uniformity and that the dimensions (diameter at the top and bottom of logs being cut) match the requirements of the finished fence post. For softwood posts, the ability to be treated to increase its life span is also important."
        },
        {
            "text": "In softwoods, fence posts provide a good market for early thinnings, when tree diameters are still quite small, or from higher up the tree after one or two sawlogs have been cut from its base."
        },
        {
            "text": "Durability is another important wood property to consider. Some tree species are naturally more durable than others. Species like oak, sweet chestnut and some ‘redwood’ conifers such as larch are naturally long-lasting. They are suitable for outside use without the need for treatment to protect them from rot. However, many softwood species such as spruce will require treatment."
        },
        {
            "text": "Another property of hardwood species, such as oak and sweet chestnut, is their ability to be split along the grain to make strong, hard-wearing rails which do not require sawing. This is a trait which can be harnessed to make strong, long-lasting post and rail fences."
        },
        {
            "heading": 2,
            "text": "Pallets for transportation and storage"
        },
        {
            "text": "Pallets and wooden packaging materials are essential to our everyday lives. They are central to the transportation and storage of many products we consume. The UK construction sector alone is estimated to use 20 million pallets.3 In 2023, TIMCON – the UK timber packaging and pallet confederation, estimated that 41.7 million pallets were manufactured in the UK, with a further 54.1 million being reused and repaired."
        },
        {
            "text": "Pallets can be made from both softwood and hardwood, though in the UK softwoods are predominantly used. Produced from sawn wood, pallets can make use of the lower grade timber from trees, perhaps the slightly knottier or less uniform logs."
        },
        {
            "text": "They provide a great output for sawlogs that won’t meet the needs of more structurally or aesthetically demanding uses, such as construction or landscaping timber. Not only do they provide a great use for lower grade logs, but they can also be recycled and used and repaired repeatedly."
        },
        {
            "heading": 2,
            "text": "Sawn products for landscaping"
        },
        {
            "text": "Wood is a defining feature of modern gardens and housing developments. Fences, decking, sheds, sleepers and raised beds all rely on a steady supply of sawn timber, making landscaping one of the most visible and important markets for woodland products."
        },
        {
            "text": "These materials are produced from sawlogs – the larger, higher-quality logs found at the base of trees. In a sawmill, logs are cut into posts, rails, boards and sleepers before being dried and treated."
        },
        {
            "text": "Most timber used outdoors in landscaping is treated with preservatives in a pressure process often known as tanalisation. This forces preservative deep into the wood fibres, protecting it from decay, insects and fungal attack."
        },
        {
            "text": "Treated timber is graded using use classes (UC), which indicate where it can be used safely:"
        },
        {
            "text": "Understanding use classes helps ensure timber is matched to the right job, improving safety, longevity and value for money."
        },
        {
            "heading": 2,
            "text": "Making woodland management work for you"
        },
        {
            "text": "Medium-value timber products may not attract the headlines of construction timber or fine furniture, but they are central to sustainable woodland management. They offer reliable markets for a wide range of tree sizes, species and quality. They help woodland owners to generate an income while managing woods for wildlife, the local landscape and for long-term resilience."
        },
        {
            "text": "From hedges and fences to pallets and gardens, these everyday products connect our woodlands to daily life, often in ways we barely notice but depend on."
        }
    ]
}