{
    "url": "https://marinedevelopments.blog.gov.uk/2026/02/23/marine-management-organisation-outlines-next-engagement-point-in-developing-englands-new-east-marine-plan/",
    "title": "Marine Management Organisation outlines next engagement point in developing England’s new East Marine Plan",
    "authors": [
        "Amy Hodgson, Marine Planner"
    ],
    "categories": [
        "marine planning"
    ],
    "pub_date": "2026-02-23T14:03:31+00:00",
    "content": [
        {
            "text": "The Marine Planning Team at the Marine Management Organisation are inviting all interested parties in the development of the East Marine Plan to participate in an online engagement session as part of the plans ongoing development. There will be two sessions available to attend online. To sign up to one of these sessions, please follow the relevant link below.   "
        },
        {
            "text": "Tuesday 17 March 13:00 – 15:00 "
        },
        {
            "text": "Wednesday 18 March 13:00 – 15:00 "
        },
        {
            "text": "Please note that the content will be the same across both sessions."
        },
        {
            "text": "Drafting the East Marine Plan: Where are we now?"
        },
        {
            "text": "Work on the East Marine Plan continues to progress with policy development well underway, drawing on evidence, analysis and the extensive feedback gathered during the Autumn 2025 engagement period. "
        },
        {
            "text": "The East Marine Plan is currently in the fifth stage of the marine planning cycle: drafting the new East Marine Plan and its policies.  This includes revising policy wording, developing supporting text, and ensuring the plan is practical for decision makers and stakeholders. "
        },
        {
            "text": "The upcoming March 2026 online events will give stakeholders an update on drafting progress and provide insight on the direction of the plan. There will also be opportunity for attendees to contribute their views in the session."
        },
        {
            "text": "Why Stakeholder Participation Matters "
        },
        {
            "text": "Stakeholder engagement has been fundamental in shaping the direction of the East Marine Plans and we remain committed to transparent and inclusive engagement with all interested parties.  The March sessions offer another opportunity to explore how the plan is developing ahead of the consultation while ensuring continued participation from all sectors."
        },
        {
            "text": " The Marine Planning Team encourages organisations and individuals to share this information within their networks across the east marine plan areas, and nationally where appropriate, to support broad and inclusive participation. "
        },
        {
            "text": "What Stakeholders Will Gain from Attending "
        },
        {
            "text": " More information about the purpose of the plan replacement and the extent of the east marine plan areas is available on the MMO’s GOV.UK page. "
        },
        {
            "text": "For any questions on the upcoming engagement activities, please contact: planning@marinemanagement.org.uk. "
        }
    ]
}