{
    "url": "https://teaching.blog.gov.uk/2026/02/23/the-value-of-transition/",
    "title": "The value of transition",
    "authors": [
        "Sarah Douglas"
    ],
    "categories": [
        "Inspiring teachers",
        "Pupil wellbeing and behaviour",
        "Secondary schools",
        "SEND"
    ],
    "pub_date": "2026-02-23T11:52:29+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Why transition matters "
        },
        {
            "text": "At Tanfield School, we recognise the value of transition. "
        },
        {
            "text": "Our Transition Model supports Year 6 students to prepare for a strong start in Year 7. Secondary school is a significant milestone in a young person's life, and a smooth transition sets the tone for school life and beyond. "
        },
        {
            "heading": 2,
            "text": "Building relationships early "
        },
        {
            "text": "Parents and carers begin to consider secondary school places as early as infancy. We welcome families to our open events from Year 4, which helps build essential relationships as we look forward to working together with the child at the centre. "
        },
        {
            "text": "Open events are enhanced by summer camps which develop familiarity. We have an open-door policy welcoming families to visit at any time and see it in ‘action’... and why not a Friday afternoon? Standards remain high no matter the day of the week!  "
        },
        {
            "heading": 2,
            "text": "Tailored support for individual needs  "
        },
        {
            "text": "Early transition is common, especially for students with additional needs and whose anxiety is heightened by change. We set up the first visit and build upon this at the pace that suits the individual child. "
        },
        {
            "text": "These visits are bespoke and either the Year Manager or I facilitate them. We’ll also attend Year 6 students’ EHCP annual reviews before the end of the autumn term. "
        },
        {
            "heading": 2,
            "text": "A familiar face for the journey "
        },
        {
            "text": "The Year Manager plays a significant role in our pastoral support programme. They’re non-teaching staff who are dedicated to following the students throughout their school journey.  "
        },
        {
            "heading": 2,
            "text": "How we do it: "
        },
        {
            "text": "Students often build an imagined picture of secondary school. This is rarely a realistic one. Our Transition Model supports students to gain first-hand experience of school life. "
        },
        {
            "heading": 2,
            "text": "Learning from primary partners "
        },
        {
            "text": "As Transition Lead, I visit all our partner primary schools to speak with headteachers, SENDCos and Year 6 teachers. We recognise that the primary staff are the experts who have worked with the children for seven years.  "
        },
        {
            "heading": 2,
            "text": "Getting the details right "
        },
        {
            "text": "I build a picture of each student who may require an ‘Individual Transition Plan’. This information is shared with colleagues back at Tanfield. "
        },
        {
            "text": "An Individual Transition Plan captures a student's needs. This can include the organisation of focus tools, sharing a student's likes and dislikes, a need for a Chromebook and/or coloured paper, dietary requirements, medical needs, SATs concessions and additional literacy and numeracy interventions through access to our nurture class. "
        },
        {
            "heading": 2,
            "text": "Small adaptations, big difference  "
        },
        {
            "text": "Successful transition is a team effort. I know that our partner primary headteachers really appreciate our transition programme and feel confident about their students moving on. "
        },
        {
            "text": "We are successful because we are invested in the future of our students. As our mission statement affirms - ‘we want all students to attend the best universities or real alternatives and thrive in all aspects of their life’. "
        },
        {
            "text": "Does it take a lot of time and dedication? Yes.  "
        },
        {
            "text": "Is it worth it? Absolutely. "
        }
    ]
}