{
    "url": "https://socialworkwithadults.blog.gov.uk/2026/02/23/why-social-work-identity-matters-reflections-from-professional-leads-in-north-east-and-yorkshire-nhs-trusts/",
    "title": "Why Social Work Identity Matters - reflections from Professional Leads in North East and Yorkshire NHS Trusts",
    "authors": [
        "Robert Lewis",
        "Soyeb Aswat",
        "Paula Swift",
        "Jacqui Hooley",
        "Fran Ashton",
        "Simon Owens"
    ],
    "categories": [
        "Care and support",
        "Mental health",
        "Our profession",
        "Recognition",
        "Viewpoint"
    ],
    "pub_date": "2026-02-23T12:22:40+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Introduction by Robert Lewis"
        },
        {
            "text": "In this guest blog we hear from a group of mental health social work leaders from the vibrant North East and Yorkshire NHS Trusts’ Social Work Community of Practice. "
        },
        {
            "text": "Many remain unaware that social workers are an increasing presence in NHS mental health services. With their values and rights-based approaches, social workers bring their specific knowledge, expertise and skills into effect and contribute greatly to the care, support and treatment of those who draw on services. As explored here, it is not without challenge. Social workers undertake many of the roles traditionally held by other professionals, as well as those unique to themselves. This can lead to issues around the clarity of the social work identity, can leave social workers ‘hidden’ in teams, or not viewed as a key and distinct part of the workforce.  "
        },
        {
            "text": "As we move our services models to ones that prioritise prevention and community and neighbourhood approaches, social work is absolutely crucial to securing these aims and has a valid and essential place in the mental health system.   "
        },
        {
            "heading": 2,
            "text": "Why social work identity matters - reflections from Professional Leads in North East and Yorkshire NHS Trusts "
        },
        {
            "text": "Social Work Professional Leads in the North East and Yorkshire NHS Trusts have formally developed a community of practice over the last three years, which facilitates opportunities to share learning and good practice. Between us we employ approximately 600 social workers."
        },
        {
            "text": "The collaboration reflects and promotes the role of social work within mental health trusts, so that the needs of social workers within the NHS are understood and supported. It also ensures that there are opportunities to co-produce pathways where continued professional development remains at the centre of social work career progression."
        },
        {
            "text": "Many of the learning opportunities available for social workers have been developed over the years to support the careers of those working within local authorities as they have traditionally been the recognised employer with fewer opportunities within the NHS."
        },
        {
            "text": "With the increasing number of social workers now employed in both social work specific and multi professional roles within the NHS, the need for leadership and recognition for these social workers is essential."
        },
        {
            "heading": 2,
            "text": "Aims and objectives "
        },
        {
            "text": "Social work identity is essential and is even more important in the current climate and also for social workers who may not be working within local authorities (the general perception is that this is where social work roles are undertaken)."
        },
        {
            "text": "The Guidance on the support of Mental Health Social Workers and Approved Mental Health Professionals working in NHS, independent or integrated services has helped highlight social work across other sectors but further work is needed to continue recognising social work as a profession across all sectors."
        },
        {
            "text": "Social work’s identity is deeply linked to its ethical framework, which guides practice decisions."
        },
        {
            "text": "Some of the core values that shape social work identity include:"
        },
        {
            "text": "The International Federation of Social Workers (2014) defines social work as a profession that “promotes social change, problem-solving, empowerment, and liberation to enhance well-being.”"
        },
        {
            "text": "These values are not optional — they define the identity of a social worker and differentiate it from other helping roles."
        },
        {
            "text": "Social work theories and models give identity a knowledge base and structure. For example:"
        },
        {
            "text": "Social work identity can be challenged or diluted by external pressures, political and social. It can be misunderstood within the care sector, as much as it is by those who do not come into contact with it in society. "
        },
        {
            "text": "Like many other professions, organisational and financial pressures can impact and impede social workers and their identity.  "
        },
        {
            "text": "Generally there has been a refocus on what social work identity is. In the 21st century, social work identity has become increasingly global, inclusive, and justice-oriented."
        },
        {
            "text": "Modern practitioners work with:"
        },
        {
            "text": "This evolving identity reflects a profession that needs to adapt while staying rooted in ethics and empathy."
        },
        {
            "heading": 2,
            "text": "Why Identity Matters in Practice"
        },
        {
            "text": "For Practitioners"
        },
        {
            "text": "For People We Support"
        },
        {
            "text": "For Society"
        },
        {
            "text": "Within the NHS and as a Community Of Practice we have emphasised that social work identity is the foundation of ethical, reflective, and effective practice."
        },
        {
            "text": "It defines who social workers are, what they stand for, and how they make change happen."
        },
        {
            "text": "Without a clear sense of identity, the profession risks losing its purpose, ethics, and distinct social justice mission."
        }
    ]
}