{
    "url": "https://civilservicelocal.blog.gov.uk/2021/06/16/boundaryless-leadership-through-role-modelling-2021-an-online-event/",
    "title": "Boundaryless leadership through role modelling 2021 - an online event",
    "authors": [
        "Funke Oham"
    ],
    "categories": [
        "A National Spotlight",
        "Cymru Wales",
        "East, South East & London",
        "Midlands",
        "North East, Yorkshire and the Humber",
        "North West England",
        "Northern Ireland",
        "Scotland",
        "South West England"
    ],
    "pub_date": "2021-06-16T08:30:20+00:00",
    "content": [
        {
            "text": "In a time of dramatic changes across the UK and around the globe we look to our peers and senior leaders for support, encouragement, advice and above all role models. We are all leaders and role models and we must learn to think and act beyond the norm in these changing times."
        },
        {
            "text": "Join us on 30 June to explore boundaryless leadership, driving inclusion through positive role modelling and mentoring, featuring an interview with Bernadette Thompson OBE and top tips for career progression."
        },
        {
            "heading": 4,
            "text": "Join us for this summertime Leadership event"
        },
        {
            "text": "This online event is a collaboration between Civil Service Local: East, South-East and London (ESEL), its Junior Leaders Networking Event (JLNE) and Civil Service Race Forum (CSRF) and is open to all UK civil servants."
        },
        {
            "text": "Our aim is to encourage all civil servants, and especially those from a black, asian and minority ethnic heritage, on their leadership journey. We want to help motivate and empower all civil servants wherever you work."
        },
        {
            "text": "The Civil Service aim is to be the most inclusive UK employer and supporting career progression and senior ethnic diversity is a key part of this."
        },
        {
            "heading": 4,
            "text": "Date: 30 June 2021"
        },
        {
            "heading": 4,
            "text": "Time: 10:00am to 4:30pm (with breaks)"
        },
        {
            "text": "There are a number of sessions that you can join. Details about these and how to register are shown below."
        },
        {
            "heading": 4,
            "text": "Boundaryless Leadership"
        },
        {
            "text": "Join hosts Tola Ayoola and Ian Barton and others who will be speaking about their leadership journeys, including top tips and memorable role models."
        },
        {
            "heading": 4,
            "text": "Leadership: The power of mentoring - Award winning leadership story with Abigail Agyei and Bernadette Thompson OBE"
        },
        {
            "text": "This session focuses on the personal story of an award-winning civil servant. discussing the benefits of a mentor who can open doors, inspire, support, encourage mentees to realise their potential and to achieve their dreams."
        },
        {
            "heading": 4,
            "text": "The Rise and Rise of Bernadette Thompson OBE:   1-2-1 Interview with Justin Placide"
        },
        {
            "text": " "
        },
        {
            "text": "This is your unique chance to hear Justin Placide (Assistant Director at Business, Energy and Industrial Strategy and Co-Chair of The Civil Service Race Forum) in interview with award-winning Leader Bernadette Thompson OBE, (Deputy Director at Ministry of Housing, Communities and Local Government)."
        },
        {
            "text": "Bernadette will be talking about her career journey, reflecting on diversity and inclusion, and summarising key priorities for the future."
        },
        {
            "text": "Find what makes Bernadette tick, who has inspired her, her life lessons, how she overcomes challenges, and why she is passionate about diversity."
        },
        {
            "text": "There will also be an opportunity to talk to Bernadette!"
        },
        {
            "heading": 3,
            "text": "A day for your diary"
        },
        {
            "text": "We do hope you can join us for a diverse celebratory day, full of inspiring stories, tips for career progression and lots of positive, motivational role models from across the Civil Service."
        },
        {
            "heading": 3,
            "text": "Online access requirements"
        },
        {
            "text": "Please note that you must be able to access Microsoft Teams via the app or browser to join this online event. Please use your work email address to register on Eventbrite. If you are unable to access Microsoft Teams on your work device you may wish to join using a personal device. All links will be sent at least 24 hours prior to the event."
        }
    ]
}