{
    "url": "https://deframedia.blog.gov.uk/2021/06/16/ccc-independent-assessment-of-uk-climate-risk/",
    "title": "CCC Independent Assessment of UK Climate Risk",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2021-06-16T15:44:00+01:00",
    "content": [
        {
            "text": "There’s been extensive coverage of the Climate Change Committee’s Climate Change Risk Assessment (CCRA3) report out today, which suggests the nation’s efforts to adapt to climate change is not keeping pace with the impacts of a warming planet and the increased range of climate risks this brings to the UK. The report has been picked up by the Financial Times, the BBC, the Daily Mail, The Independent, I News, & Business Green."
        },
        {
            "text": "The UK was among the first countries to legislate for climate adaptation. The Climate Change Act provides a strong framework for the UK Government. Under the Act, we track the diverse and dynamic set of climate risks our country faces. And we develop a coordinated response to the challenges."
        },
        {
            "text": "The UK’s action to adapt to the effects of climate change is integrated across government departments, covering the natural environment, infrastructure, people and the built environment, business and industry, and local government."
        },
        {
            "text": "As we work to eliminate the UK’s contribution to climate change and build back greener after the pandemic we will increase biodiversity, protect and restore our peatlands, clean up our country’s air and help protect our waterways through our landmark Environment Bill."
        },
        {
            "text": "Examples include:"
        },
        {
            "text": "The UK has already demonstrated leadership on mitigation, being the first major world economy to set a target of net zero greenhouse gas emissions by 2050. Our plan to further reduce emissions in 2035 by at least 78% compared to 1990 levels is the highest reduction target by a major economy to date. "
        },
        {
            "text": "We are already seeing the impacts of climate change across the UK. We recognise the urgency outlined in the Climate Change Committee’s Independent Assessment. We will carefully consider and respond to the CCC’s findings and recommendations, with a full and formal response to the CCC’s findings laid in Parliament in January 2022 that will set out a forward look for adaptation in the UK."
        },
        {
            "text": "In particular, we will pay close attention to the eight priority risk areas flagged by this report. Our next National Adaptation Programme will address these risks, and build a more resilient United Kingdom."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}