{
    "url": "https://marinescience.blog.gov.uk/2021/06/16/enhancing-understanding-and-protection-st-helena-and-the-global-ocean-wildlife-analysis-network/",
    "title": "Enhancing knowledge and protection: St Helena and the Global Ocean Wildlife Analysis Network",
    "authors": [
        "Joe Wells",
        "Rhys Hobbs",
        "Elizabeth Clingham"
    ],
    "categories": [
        "Monitoring",
        "Science",
        "Technology",
        "Vulnerable species"
    ],
    "pub_date": "2021-06-16T04:00:59+01:00",
    "content": [
        {
            "text": "St Helena is an oceanic island located in the tropical South Atlantic. Home to a fantastic array of marine biodiversity, it is one of the ten UK Overseas Territories that are part of the new Global Ocean Wildlife Analysis Network."
        },
        {
            "text": "The new underwater network of Baited Remote Underwater Video Systems (BRUVS) is being delivered as part of the Blue Belt Programme, in partnership with Blue Abacus."
        },
        {
            "text": "Below the Environmental Management Team on St Helena detail how they plan to use the new underwater cameras, the species they hope to record, and how the data they will collect will ultimately help better protect them."
        },
        {
            "text": "Rhys Hobbs and Elizabeth Clingham, Environmental Management Team, St Helena"
        },
        {
            "text": "The marine environment of St Helena is the pride and joy of the island.  Every day, we look out over our ocean and the first thing anyone observes is how clean and nice it looks.  It is a picture of health, tranquillity and wonder.  Subconsciously, we’re reassured of its health because we know that a lot of energy and resources is directed at understanding it."
        },
        {
            "text": "For those of us on St Helena who are privileged to undertake marine science we have other forms of validating experiences. Watching the science influence and be translated into management measures that will better conserve and protect our marine environment embodies our pride even more. But there is still that wonder – what do we really know about these environments?"
        },
        {
            "text": "For years we’ve undertaken underwater dive surveys, habitat surveys, biomass and biodiversity studies, we’ve conducted bathymetric data collection and much more (which the Blue Belt Programme is now helping us to analyse).  Yet, every so often something ‘new’ comes to light and that need to validate previous assumptions, or the need to know more is intensified."
        },
        {
            "text": "As a result, St Helena is tremendously excited to enhance our knowledge and be a part of the new Global Ocean Wildlife Analysis Network.  This new and cutting edge technological based science removes a number of variables from previous data collection techniques."
        },
        {
            "text": "Life studies, as well as biomass and distribution work on species like grouper, moray eel, glass-eyed snapper, tuna and whale sharks can all be recorded. Further identification and behavioural observations on elasmobranchs (such as sharks and other large predators) and other charismatic megafauna will also further our existing protection strategies for these species. These BRUVS also remove the need for a physical human presence, which opens up a whole new level of science preciously not afforded to the island."
        },
        {
            "text": "Around St Helena we’ll have six BRUVS, which once deployed will allow us to gather more data for the management and conservation of our wide-ranging species and habitats. This data crucially will be collected in a way that is consistent, comparable and statistically robust both locally and internationally. The ability to repeat recording again and again enables us to build on and monitor our baselines. Sharing this information internationally also provides an incredible opportunity to learn more about the same or similar species found elsewhere in the world."
        },
        {
            "text": "During the preparatory work associated with operating and undertaking deployment of the BRUVS, local staff will once again be exposed to new forms of training and capacity building which is not person dependant. Partnering with other on island organisations such as the St Helena National Trust to deploy the BRUVS will increase the amount of information that can be captured, and also helps ensure the protection of the islands marine environment is a community effort."
        },
        {
            "text": "It is going to be very cool to watch the different types of marine life under the water, all undisturbed by us, allowing them to just “do their thing” – who knows what amazing sites or animals we’ll capture to be able to share with Saints."
        },
        {
            "text": "Evidence based informed management and protection strategies underpin our IUCN Category IV Marine Protected Area (MPA).  Being in a position to be able to corroborate dedicated management strategy decisions with confidence and proof validates the benefits of the Blue Belt programme, and the support it has given the island to date. The BRUVS are a great addition to our scientific toolkit, and we can’t wait to get them in the water and hit record."
        },
        {
            "text": "For more information about the Global Ocean Wildlife Analysis Network, click here."
        }
    ]
}