{
    "url": "https://phescreening.blog.gov.uk/2021/06/16/inequalities-consistently-addressed-in-quality-assurance-visits-to-local-nhs-screening-services/",
    "title": "Inequalities consistently addressed in quality assurance visits to local NHS screening services",
    "authors": [
        "Val Armstrong",
        "Helen Smith"
    ],
    "categories": [
        "General information",
        "Screening Quality Assurance Service"
    ],
    "pub_date": "2021-06-16T09:43:38+01:00",
    "content": [
        {
            "text": "The PHE screening inequalities strategy sets out our objectives to provide:"
        },
        {
            "text": "All national NHS screening programmes participate in regular quality assurance (QA) activities, led by the PHE screening quality assurance service (SQAS). These activities maintain national standards and promote continuous improvement in screening."
        },
        {
            "text": "SQAS has a goal of contributing to the reduction of health inequalities across screening programmes. One way of measuring this contribution is to look at whether inequalities are addressed in reports of QA visits to local screening services."
        },
        {
            "text": "The national PHE SQAS team carried out an audit of these QA visit reports between 1 April 2019 and 31 March 2020 to look for recommendations that include inequalities or ‘considerations to address inequalities’. Considerations to address inequalities are recorded when providers, as part of a QA visit, present evidence that they are addressing inequalities which mean a specific recommendation may not be needed."
        },
        {
            "text": "We used certain words from the Equality Act 2010 and national service specifications when searching through the reports. Examples of words and phrases searched for included ‘equity audit’, ‘learning disability’ and ‘prisons’."
        },
        {
            "heading": 2,
            "text": "RAG rating method"
        },
        {
            "text": "To carry out the audit, we developed a series of questions and applied a simple red/amber/green (RAG) rating to the possible answers before then producing a summary RAG rating for each visit report."
        },
        {
            "text": "Most questions required simple yes/no answers and were easily rated. Questions relating to service specifications required a judgment, and comments were added if required."
        },
        {
            "text": "The questions relating to the search terms were:"
        },
        {
            "text": "RAG rating:"
        },
        {
            "text": "The audit findings suggested that SQAS teams are consistently addressing inequalities in visits across all screening programmes."
        },
        {
            "text": "The audit covers a total of 94 QA visit reports. It rated 1 red, 56 amber and 37 green. It found specific recommendations in relation to inequalities in 46 (49%) of the 94 reports. Although one report was rated red, this does not necessarily mean inequalities were not assessed at all at that visit."
        },
        {
            "text": "The QA visits found numerous examples of regional initiatives to reduce inequalities. It is likely that the increased focus on inequalities found in the visit reports is linked to:"
        },
        {
            "heading": 2,
            "text": "Next steps"
        },
        {
            "text": "The national SQAS team is planning a number of actions based on the audit findings. These include:"
        },
        {
            "text": "QA visit cycles are, at most, once every 4 years, so the national SQAS team is looking to develop processes to address and monitor inequalities regularly with providers and commissioners outside this visit cycle."
        },
        {
            "text": "Work is already under way to address these recommendations where possible."
        },
        {
            "heading": 2,
            "text": "Thank you"
        },
        {
            "text": "A big thank you to SQAS teams, commissioners and providers for their work in tackling inequalities. The coronavirus pandemic has reinforced that it is more important than ever for us to continue to focus on reducing barriers to screening."
        },
        {
            "heading": 2,
            "text": "PHE Screening blog"
        },
        {
            "text": "The PHE Screening blog provides up to date news from all NHS screening programmes. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new blogs. If you have any questions about this blog article, or about population screening in England, please contact the PHE screening helpdesk."
        }
    ]
}