{
    "url": "https://civilservice.blog.gov.uk/2021/06/16/lessons-in-leadership/",
    "title": "Lessons in Leadership",
    "authors": [
        "Chris Atkinson, UK Deputy Joint Secretary, Independent Reporting Commission, Northern Ireland Office"
    ],
    "categories": [
        "Civil Service Leaders",
        "Civil Service Learning"
    ],
    "pub_date": "2021-06-16T11:46:37+00:00",
    "content": [
        {
            "text": "Civil Service award winner Chris Atkinson topped the category for Inspirational Leadership. Below, Chris shares the secrets of his success."
        },
        {
            "text": "When I was asked to write a blog about leadership, I immediately found the spectre of self-doubt raising its ugly head. “Sure what could I say about that?” “Others would do that better,” “I’m not perfect” etc. But when I stopped to think about it, I realised that actually I’ve learnt a huge amount about leadership from others over the years and that it’s OK to still be a work in progress. In fact, surely it’s better to be aware of that."
        },
        {
            "text": "So I thought I’d approach this blog by sharing some of my most valuable leadership lessons from people over my career to date. I’m sure others should be here – so why don’t we get a conversation going in the comments section about what you’ve learned about leading well?"
        },
        {
            "text": "Put people at ease and listen\nGerardine (one of my really early bosses) taught me the importance of putting people at ease, and listening actively to their concerns and thoughts. Empathy goes a long way, as does getting people comfortable. It sets you up for a much better conversation, and can help diffuse a tense, tricky one."
        },
        {
            "text": "Manage information\nGillian taught me to manage information well, so you had it when you needed it, and because it’s the right thing to do. I’m still working on that one, but haven’t forgotten [squirming] the day I had to explain to my boss, why I’d left some loose forms in files. I was much better prepared for a routine audit because of it."
        },
        {
            "text": "Have a laugh\nGillian also taught me the value of having a laugh at work. She had a great capacity for storytelling, and made sure we all took time away from our desks, knowing that all work, all day wasn’t good for anyone."
        },
        {
            "text": "Establish the facts\nLiz taught me the importance of establishing facts – not taking actions based on assumptions or overreacting. She imbued the importance of measuring performance well and planning improvements."
        },
        {
            "text": "We can only know how we’re doing if we measure success appropriately and ask for feedback, and then challenge ourselves: ‘How can I/we do that better?’ Sometimes that means carving out space despite the urgent stuff clambering for attention to really dig into these questions."
        },
        {
            "text": "Liz empowered me to take that time, to crowd-source ideas, to explore improvements and to take risks, and I’ll never forget the difference that made both for me and my team."
        },
        {
            "text": "Take a break\nHolly taught me that taking a break can often be the best way of getting reinvigorated to deal with a knotty problem. Taking a Boxer from Animal Farm “I will work harder” approach often doesn’t produce the best result (or do much for your wellbeing). Instead, teams generally work better together to solve issues."
        },
        {
            "text": "Holly was also a master in making sure the right people in Whitehall knew what was going on – something that can make life much easier at crunch points, and so valuable because we’ve so much to gain from others’ experience."
        },
        {
            "text": "Express yourself well\nChristine taught me that taking time to express things really clearly in reports and documents was an investment worth making. I still fire off emails that are clear to me though not to others, and I’m perhaps too fond of tracked changes, but I am committed to expressing myself well."
        },
        {
            "text": "After all, if we can help people understand problems, issues, evidence, risks, analysis and possible solutions through our written communication, then we’re much more likely to have a productive conversation about ways forward and deliver the right result."
        },
        {
            "text": "Who are you helping?\nPatricia and Roy (two tutors at college) taught me the value of asking: who am I trying to help and why? It’s easy to overlook, but actually, when we’ve got that clear in our heads, we take a much better approach to decision making, and it’s a massive motivator."
        },
        {
            "text": "Big picture\nEd showed me the value of pausing to consider the bigger picture, and carefully thinking through implications of decisions for others. Ed read people so well; always happy to let you have your say, he took time to mull something over, asked the right probing questions, and then worked with you on an answer that was so much richer."
        },
        {
            "text": "Let me get back to you…\nChris and Ruth taught me a really significant one: It’s OK to say, “I’ll find out and let you know.” It’s tough to say when put on the spot, and yet is by far the best strategy rather than a partial or woolly attempt. Ruth is also the clearest draftsperson I know, and pushed me to express myself really clearly. Everyone needs a Ruth in their lives at some point."
        },
        {
            "text": "Look out for people\nColin wasn’t a direct line manager, but taught me the huge importance of looking out for people. I’m sure parents, teachers and youth leaders taught me that too, yet Colin exemplified it so well. He was never too busy to ask how someone was, even juggling 10 different people needing his attention. I’m still blown away by that ability, and aspire to learn from it."
        },
        {
            "text": "These are just some of my most important leadership lessons. Who am I trying to help, what’s the best way to understand the problem, how do I build a solution with others, what might be motivating someone and how can I level with them, how can I call out the best in other people, all without losing myself along the way. But leadership’s a journey; I know I’ll learn more in future, and I’m sure you’ve loads to say on the subject too – so I’m all ears."
        },
        {
            "text": "What’s the most important leadership lesson someone has ever taught you?"
        }
    ]
}