{
    "url": "https://insidedvla.blog.gov.uk/2021/06/16/shaping-the-future-of-our-facilities-management/",
    "title": "Shaping the future of our facilities management",
    "authors": [
        "Julia Ashford"
    ],
    "categories": [
        "Features"
    ],
    "pub_date": "2021-06-16T15:48:49+01:00",
    "content": [
        {
            "text": "There will be big changes made by DVLA as we come to the end of our Private Finance Initiative (PFI) contract in 2025 and with this there are opportunities to learn and grow. This exciting programme of change means we've been recruiting people to help us, with more new roles emerging over the life of the programme. These roles are critical in helping us shape the way we'll manage our site and services as we exit the current PFI contract."
        },
        {
            "text": "Back in 2005, DVLA awarded the integrated PFI contract to Telereal Trillium. Their goal was to refurbish our main site, provide a full range of facility management (FM) services and conduct some additional building work around our estates."
        },
        {
            "text": "We’re now in the final 4 years of the contract, so we’re looking at our next steps."
        },
        {
            "text": "How our services are currently managed"
        },
        {
            "text": "There are many different facilities, vital to DVLA’s everyday operations, which are split into soft and hard services. Soft services are cleaning, bus services and catering with hard services covering building maintenance and the provision of furniture."
        },
        {
            "text": "Why our services are changing"
        },
        {
            "text": "In the 2018 autumn budget, the Chancellor of the Exchequer announced that government would no longer use the current model of PFI for new government projects. DVLA will be one of the first to exit a PFI contract following closely behind DWP and HMRC, the first two central government bodies to go through the expiry process. We'll be working with the Infrastructure and Projects Authority, the government’s centre of expertise for infrastructure and major projects, to take forward any lessons learned from the exit of the PFI contracts."
        },
        {
            "text": "Our facilities management team has started to look at ending some of our soft services contracts early, by March 2023. This includes cleaning, waste management, pest control, catering and transport services. One of the first changes has been the removal of the lease of our staff minibuses which happened in March 2021."
        },
        {
            "text": "Next steps"
        },
        {
            "text": "My team’s role will be to ensure a seamless transition from old to new service providers. We’ll make sure the services are tendered and procured correctly and continue the safe, secure running of the agency."
        },
        {
            "text": "When the PFI contract expires, we can manage our services differently. We’ll look for improvements in value for money and quality through a more distributed approach. It allows us to look at smaller contracts, enabling us to work with a varied range of smaller businesses, specialist suppliers and service providers."
        },
        {
            "text": "We are currently working with some expert consultants to review our current practices and consider in detail all the potential options. We’re exploring all possibilities available from a fully in-house service provision managed by DVLA, to a total facility managed service through a new supplier contract."
        },
        {
            "text": "Roles and recruitment "
        },
        {
            "text": "The programme will involve multiple projects to manage the exit and expiry of current service provisions. This will include the development of a new operating model and finding suitable new service providers."
        },
        {
            "text": "If you have a background in facilities management, we're currently looking for senior FM governance and project managers and would love to hear from you. You can register for vacancy alerts through Civil Service Jobs."
        }
    ]
}