{
    "url": "https://competitionandmarkets.blog.gov.uk/2021/06/16/why-the-cma-is-making-changes-to-the-funerals-sector/",
    "title": "Why the CMA is making changes to the funerals sector",
    "authors": [
        "Colin Garland"
    ],
    "categories": [
        "Consumer protection",
        "Markets"
    ],
    "pub_date": "2021-06-16T09:55:53+01:00",
    "content": [
        {
            "text": "Funerals provide an important function in the grieving process; they are an opportunity for us to come together and pay tribute to our loved one and, for many, they have a religious significance. They are, however also one of the most expensive purchases many people will make. Given their significance and cost, it is important that those who purchase funeral services clearly understand what they are purchasing and are confident that what they are being charged is reasonable."
        },
        {
            "text": "Last year, the Competition and Markets Authority (CMA) completed an in-depth market investigation into the funerals sector after concerns were raised that funeral directors were not treating customers fairly. Concerns centred around the lack of price transparency within the sector which made it hard for bereaved families to compare costs between providers and choose the right service for their loved ones."
        },
        {
            "text": "Like many services, funerals come with different options to choose from, and these options and their costs vary between providers. When purchasing something of this significance, most people will usually research the different prices and options available to them. However, as our investigation has shown, this is often not what happens when it comes to purchasing a funeral because of the unique circumstances in which they take place."
        },
        {
            "text": "When a person is organising a funeral, they are often grieving and may be in a distressed state. So instead of comparing options many people will look to simplify the process and will choose a funeral or cremation service based on a recommendation, or simply return to the provider that their family has used before, even though that may have been some time ago and the ownership of the business may have changed."
        },
        {
            "text": "Our investigation also showed that during the planning process, people often rely heavily on the funeral director to help them navigate the various options and trust them to recommend the most suitable ones for them. During this time, they may also be under additional pressures that further inhibit their ability to make an informed choice. This could include social or family pressures as well as pressure to make decisions quickly. As a result, the entire process can seem overwhelming and the final cost surprising."
        },
        {
            "text": "To address these concerns and help consumers during what is often a difficult time, the CMA has issued a legal Order to funeral directors and crematorium operators. The obligations arising from this will come into effect over the next three months, with all required to be implemented by 16 September 2021."
        },
        {
            "text": "One of the key requirements of the Order is that funeral directors and crematorium operators will need to be clearer about their prices so people can more easily compare and choose what’s right for them. All funeral directors will be required to display a Standardised Price List at their premises and on their website. The Standardised Price List must include:"
        },
        {
            "text": "All crematorium operators will similarly be required to display their prices at their premises and on their websites."
        },
        {
            "text": "The Order also requires funeral directors to provide customers with details of any deposit requirement, payment options and additional charges that they may apply to late payments. The CMA is also making wider changes to the sector, including prohibiting funeral directors from some practices, such as making payments to incentivise hospitals or hospices to refer customers to a particular funeral director and solicitating for business through coroner and police contracts."
        },
        {
            "text": "Further, to enable the CMA to continue to actively monitor price trends in the funerals sector, the Order requires information to be provided by funeral directors and crematorium operators on the numbers of funerals and cremations and associated revenues."
        },
        {
            "text": "These are just some of the changes that the Order will bring to the funeral sector. We encourage all funeral directors and crematorium operators to familiarise themselves with the full requirements in the Order, to ensure that they fully comply. To further assist funeral directors and crematorium operators, we have published an Explanatory Note alongside the Order."
        },
        {
            "text": "It is the CMA’s intention that these changes will help bereaved families make the right choices for them and their loved one during difficult times."
        },
        {
            "text": "Read the full text of the Order."
        },
        {
            "text": "Read the full text of the Explanatory Note."
        }
    ]
}