{
    "url": "https://forestrycommission.blog.gov.uk/2025/01/14/5-tips-for-environmental-land-management-in-field-agroforestry-applications/",
    "title": "5 tips for Environmental Land Management in-field agroforestry applications",
    "authors": [
        "James Ramskir-Gardiner"
    ],
    "categories": [
        "Tree planting",
        "Woodland creation"
    ],
    "pub_date": "2025-01-14T09:00:00+00:00",
    "content": [
        {
            "text": "There is an old adage that says the best time to plant a tree was 20 years ago, the second-best time is now. In 2024 Defra launched the ELM in-field agroforestry offer, providing more support for creating and managing agroforestry than there has ever been."
        },
        {
            "text": "There are agroforestry actions across various tree densities to encourage more trees in the farmed landscape. Find out more about funding and grants for agroforestry on GOV.UK."
        },
        {
            "text": "If you are a farmer interested in applying for an in-field agroforestry offer to harness the positive benefits from integrating trees into your farm, here are 5 tips for making a successful application."
        },
        {
            "text": "And if you're unsure whether agroforestry is right for you, have a read of our blog Is agroforestry right for your farm? New funding to help plan and establish agroforestry systems."
        },
        {
            "heading": 2,
            "text": "1. Check whether you're in a sensitive area for tree planting"
        },
        {
            "text": "After you have identified which field parcels you would like to consider for your application, the first thing you need to check is whether they are in a less sensitive area for tree planting. You can easily check this using the Forestry Commission’s Sustainable Farming Incentive (SFI) Agroforestry map."
        },
        {
            "text": "If your field parcels are on more sensitive land, Countryside Stewardship Higher Tier options will be available to you to create and manage agroforestry on your land. In these options, you will be supported and guided by either a Forestry Commission or Natural England advisor to ensure your application limits any negative environmental impacts whilst maximising the benefits for your farm and farm business."
        },
        {
            "text": "Higher tier will be rolled out in a controlled way by invitation, and more details will be provided in February. Invited applicants will be able to submit their applications from summer 2025. Find out more by reading the Higher Tier preview guidance on GOV.UK."
        },
        {
            "heading": 2,
            "text": "2. Make use of the agroforestry plan (PA4) capital item"
        },
        {
            "text": "Introducing trees into the farming system can bring an additional layer of complexity to managing the land. The funded agroforestry plan can help support the healthy establishment and management of an in-field agroforestry system, which supports agricultural output and can improve the farm’s overall resilience to climate change."
        },
        {
            "text": "The funded plan will help you decide what agroforestry system might be a good fit with your farm business and identify potential considerations across the farm for planting trees. It also supports the creation of an individual field parcel management document for easy and accessible management of new or existing agroforestry systems."
        },
        {
            "text": "This can help you, or your contractor, to easily achieve the management requirements of both the SFI and Higher Tier revenue options. The plan will be approved by either your Forestry Commission or Natural England advisor, who can help you with determining the relevant features and management interventions for your system."
        },
        {
            "text": "The Agroforestry Plan is a requirement for any Higher Tier applications and it is an optional extra for any SFI applications. Due to the additional support you receive, we strongly recommend you make use of it regardless which ELM grants, or other financing, you use."
        },
        {
            "heading": 2,
            "text": "3. Think about tree species suitability"
        },
        {
            "text": "Picking the right trees for your in-field agroforestry system is one of the most important considerations you need to make. A great place to start is with the Forest Research Tree Species Guide for UK Agroforestry Systems which can help you decide on the type of trees that will be best suited for your farm and objectives, as well as how best to manage those trees."
        },
        {
            "text": "Checking with your local Forestry Commission officer can help you consider any tree health issues you may need to consider."
        },
        {
            "heading": 2,
            "text": "4. Consider whether you need an Environmental Impact Assessment (EIA)"
        },
        {
            "text": "Depending on your tree species choices, spatial arrangements and the location of your land, you may require a forestry EIA. The newly updated Definition of trees and woodland is a really helpful resource to help you determine whether you need to apply for an EIA screening."
        },
        {
            "text": "If no forestry EIA is required, you may require an agricultural EIA assessment screening from Natural England."
        },
        {
            "heading": 2,
            "text": "5. Choose the right tree guard"
        },
        {
            "text": "When planting any trees, the protection of them is an important consideration. When using capital items AF1: Plant an agroforestry woodland tree and AF2: Plant an agroforestry fruit tree, you must ensure they are planted with basic protection (such as individual tree shelters)."
        },
        {
            "text": "There are additional capital items available that can be used in conjunction with AF1 and AF2 to protect the trees from pests and grazing animals:"
        },
        {
            "text": "There are also standalone fencing capital items available for both livestock and deer fencing for use on the farm to protect newly planted trees, natural features and habitats such as buffer strips and field corners taken out of management."
        },
        {
            "heading": 2,
            "text": "Capital grants currently unavailable"
        },
        {
            "text": "As announced by Defra in November, due to unprecedented demand, some capital grant items are temporarily closed to new applications including:"
        },
        {
            "text": "Agreements that have already been signed are not affected and you should continue with the work set out in your agreement. The Rural Payments Agency will continue to process the applications already received. The PA4: Agroforestry plan is still available for application."
        }
    ]
}