{
    "url": "https://prisonjobs.blog.gov.uk/2025/01/14/celebrating-diversity-award-nominated-black-history-month-initiatives-led-by-a-trainee-probation-officer-and-case-administrators/",
    "title": "Celebrating Diversity: award-nominated Black History Month initiatives led by a trainee probation officer and case administrators  ",
    "authors": [
        "Ministry of Justice"
    ],
    "categories": [
        "Black History Month",
        "Personal stories",
        "Probation",
        "Recruitment advice"
    ],
    "pub_date": "2025-01-14T15:29:51+00:00",
    "content": [
        {
            "text": "We sat down with three Probation Service team members: trainee probation officer Chenaii, and case administrators Mai and Erin, to discuss their experiences working for HM Prison and Probation Service and their contributions to the celebration of Black History Month at their Probation Delivery Unit (PDU)."
        },
        {
            "text": "How long have you worked in your current role and why did you join? "
        },
        {
            "text": "Chenaii: I've been in the Probation Service since March, so about seven months. Before joining, I worked in hospitality for ten years and then at Warner Brothers Harry Potter studio tour, which I enjoyed as a massive Harry Potter fan. However, this job truly feels like it has a purpose, which I haven’t experienced before. I studied criminology and sociology, so I’ve always had an interest in this type of work, and I had a mentor at university who encouraged me to do the interview. "
        },
        {
            "text": "Mai: I've been in the Service for about a year. Before this, I was an estate agent. I originally wanted to become a police officer, but I saw the case administrator role on the justice jobs website, and it sounded like a good fit for me. "
        },
        {
            "text": "Erin: I've been in the service for a year too. Before joining, I studied fashion design at university. I was looking for a job and came across this one on Indeed. It seemed flexible in terms of hours, so I applied. "
        },
        {
            "text": "You are being nominated for an award for the events you organised in celebration of Black History Month at your Probation Delivery Unit. What inspired you to host these? "
        },
        {
            "text": "Chenaii: I’m part of Southwark’s people board, and I raised the idea of celebrating Black history. My dad is a genealogist and has traced our family history back to Ghana, teaching me a lot about my heritage. I know a lot about Black history and culture, and our PDU is very diverse, so I wanted to celebrate our cultures. I had support from the Head of the PDU, and we started planning. "
        },
        {
            "text": "Mai: I got involved because I wanted to help organise something that would make a lasting impression on the entire office. It’s been great to see how well it has been received because I've never worked anywhere before that celebrated or commemorated Black history. I also saw it as an opportunity to educate others and myself. "
        },
        {
            "text": "Erin: They both came up to me and asked, ‘Do you have scissors? Can you cut?’ I was like, ‘Sure, of course I can cut.’ Next thing I know, I’m helping create a gallery celebrating Black musicians and Ghanaian symbolism in one of our conference rooms, and writing a quiz. But in all seriousness, I’m honoured to have been involved because it’s something that’s quite close to me. While my mum has highlighted it, I hadn’t really been taught or celebrated Black history before, and it was nice to see others interested in it. It was a real moment for me when we finished the gallery and took a step back to look at what we had created. "
        },
        {
            "text": "So, you’ve mentioned the gallery and the quiz, what other events did you all put on? "
        },
        {
            "text": "Mai: We hosted a panel discussion. Our PDU is so diverse, and we thought it would be nice to hear everyone’s experiences. We’ve had some practitioners who have been in the Service for twenty years, and it was great to hear their journey into probation, what has stuck with them, and what sort of legacy they would like to leave behind. We also had our lunch event, and people went all out and made so much food. People sat, ate, and talked, and it was great to see it bringing everyone together. I’ll never forget that day and everything we’ve done this month. Being able to have the space to celebrate Black history has been so special. "
        },
        {
            "text": "What did this year’s Black History Month ‘reclaiming narratives’ theme mean to you and why was it so important? "
        },
        {
            "text": "Erin: This is the first time we’ve celebrated Black History Month at our PDU, and what we’ve done feels like reclaiming the narrative itself. Everyone has really enjoyed celebrating it, and we’re proud of what we’ve accomplished.  "
        },
        {
            "text": "Chenaii: Reclaiming narratives means empowerment to me. It's about changing the stories that have been told about us and taking control of our own narratives. As someone raising a young Black boy, it's important for me to empower him and others to be better and do better. "
        },
        {
            "text": "Mai: I’m able to learn about and bring my own take on what it is to be a Black woman of mixed heritage. It’s also a confidence thing. Through helping to organise these events, I wanted to show myself that I can put myself out there and be part of something where I’m going to have to speak and be seen. "
        },
        {
            "text": "What role does cultural competence play in your work and what could HMPPS do to improve the promotion of diversity and inclusion? "
        },
        {
            "text": "Chenaii: Cultural competence can be fostered to help protect the public and do what we do as Probation staff. I think it's important to have regular events and initiatives that celebrate different cultures and backgrounds. It shouldn't be limited to just one month. We should have ongoing efforts to promote diversity and inclusion. "
        },
        {
            "text": "What would you say to someone considering a career in the Probation Service? "
        },
        {
            "text": "Mai: I believe it's a great career opportunity, and I feel very blessed to be part of this PDU because of its diversity. I've never worked in a place as diverse as this, and it makes me feel included and that I can relate. "
        },
        {
            "text": "Erin: Don’t let any sort of fear or doubt hold you back from applying. I find if you read the job specification, it sounds quite intimidating, but even if you don't think you could do it, still apply for it. The team here is really friendly, and they made me feel very supported throughout. "
        },
        {
            "text": "Chenaii: I would advise to not to let preconceived notions about the justice system deter them from joining. If the role aligns with your values and aspirations, you should pursue it. Personally, I had some negative views about certain parts of the justice system, but I found that probation aligns with who I am and where I want to go in life in terms of my future career. This has been an ideal starting point for me, and I would encourage others not to let anything hold them back if it feels right to them. "
        }
    ]
}