{
    "url": "https://space.blog.gov.uk/2025/01/14/ignite-space-2025-is-set-to-launch-uk-businesses-into-the-space-sector/",
    "title": "Ignite Space 2025 is set to launch UK businesses into the space sector",
    "authors": [
        "UK Space Agency"
    ],
    "categories": [
        "Catalysing Investment",
        "Events"
    ],
    "pub_date": "2025-01-14T14:58:44+00:00",
    "content": [
        {
            "text": "Ignite Space returns for its fourth year to fuel the next wave of collaboration and innovation in the UK space industry. "
        },
        {
            "text": "The SME-focused conference, brought to you by the UK Space Agency and delivered by business support organisation UMi, will serve as a vital platform to showcase emerging opportunities in the UK space sector as well as the extensive support available to all businesses looking to enter the sector."
        },
        {
            "text": "Having tripled in size over the past decade, the UK space sector now generates an impressive £18.9 billion in annual income, providing employment for more than 52,000 people. From Shetland to Cornwall, the space industry remains a robust engine for growth across the UK."
        },
        {
            "text": "Ignite Space is a free-to-attend, two-day conference designed for anyone involved in or seeking opportunities in the UK space sector. The event will be held at the National Space Centre in Leicester on 5 and 6 February 2025. From SMEs already in the space sector to businesses with space-applicable technologies, all are encouraged to attend."
        },
        {
            "text": "The conference boasts a diverse lineup of speakers representing the full space ecosystem from academia to government and start-ups to established space businesses."
        },
        {
            "text": "The agenda will feature keynotes from industry leaders including the UK Space Agency’s Deputy CEO’s Annelies Look and Chris White-Horne, as well as Suzie Imber, Professor of Planetary Science at the University of Leicester and Mark Dumville, CEO of GMV NSL."
        },
        {
            "text": "With support from industry leading partners including Astro Agency, Leicester Space Park, Photonics, and Technia, Ignite Space is well-equipped to support the diverse needs of businesses in the sector, with engaging panel sessions covering topics such as innovation, skills, investment, emerging technology, sustainability and more."
        },
        {
            "text": "Ignite Space aims to engage over 500 businesses across two days, showcasing support ecosystems, and providing practical insights and tools for growth."
        },
        {
            "text": "Portia Bircher, Business Support and Growth Manager at UK Space Agency, said: "
        },
        {
            "text": "Suzanne McCreedy, Chief Commercial Offer at UMi, said:"
        },
        {
            "text": "In addition to the industry-specific support on the day, attendees will receive six months free access to UMi Sat Nav, a digital platform offering tools and resources, access to funding, and a monthly adviser check-in designed to help businesses do more and go further."
        },
        {
            "text": "Join industry colleagues to drive innovation, foster partnerships, and support the achievement of the UK's space ambitions by registering at www.ignite-space.co.uk"
        }
    ]
}