{
    "url": "https://defraenvironment.blog.gov.uk/2025/01/14/nature-and-farming-friendly-solutions-drive-agricultural-transformation-in-the-peak-district/",
    "title": "Nature and farming friendly solutions drive agricultural transformation in the Peak District",
    "authors": [
        "Ben Rodgers"
    ],
    "categories": [
        "Community",
        "Farming",
        "Land use",
        "Nature"
    ],
    "pub_date": "2025-01-14T13:43:25+00:00",
    "content": [
        {
            "text": "The Peak District, Britain's first national park, is renowned for its stunning scenery, abundant nature, and ecological importance."
        },
        {
            "text": "It is also home to farms that cover 87% of the national park, including some highly productive dairy and livestock businesses."
        },
        {
            "text": "The relationship between farming and the environment is central to the work of Natural England's Catchment Sensitive Farming  team in the Peak District."
        },
        {
            "text": "I’m Ben Rodgers, a Catchment Sensitive Farming Adviser in the Peak District. "
        },
        {
            "text": "In this post, I’m going to tell you about one example of our innovative approach to sustainable agriculture, designed to balance intensive livestock farming with environmental conservation."
        },
        {
            "text": "Challenges of the White Peak landscape"
        },
        {
            "text": "The White Peak presents a unique landscape where internationally important biodiversity sites exist alongside intensively managed farmland. Often, only a limestone wall separates these contrasting areas. This proximity has long posed challenges for integrating conservation efforts with farming practices."
        },
        {
            "text": "Key environmental concerns include nutrient enrichment of watercourses, ammonia emissions and biodiversity constraints. Traditional agri-environment schemes were not well-suited to address these issues in intensive grassland landscapes, necessitating new approaches."
        },
        {
            "text": "We needed a solution that addressed both environmental concerns and farmers' needs. Herbal leys go a long way towards meeting this requirements, so we started a project to research the best ways for farmers to implement herbal leys."
        },
        {
            "text": "Herbal leys and their benefits"
        },
        {
            "text": "Herbal leys are diverse mixtures of grasses, legumes, and herbs. They offer a sustainable alternative to traditional grass monocultures, providing benefits for both the environment and farmers. "
        },
        {
            "text": "These benefits include:"
        },
        {
            "text": "All of these benefits do not come at a cost to farm productivity. Yields from herbal leys often match or exceed those of fertilised grasslands."
        },
        {
            "text": "Plus, the herbal ley approach aligns with the Sustainable Farming Incentive. This scheme supports farmers to transition to environmentally friendly practices, while maintaining productivity and sustainable food production."
        },
        {
            "text": "Overcoming obstacles"
        },
        {
            "text": "The transition to herbal leys has not been without challenges. A significant issue was the prevalence of dock seeds in intensively farmed grassland. When farmers first tried herbal leys, these docks would often overwhelm the crop."
        },
        {
            "text": "To address this, the Catchment Sensitive Farming team have been supporting farmers to carry out extensive trials since 2019."
        },
        {
            "text": "These trials have developed effective strategies, such as direct drilling and the use of break crops, to manage weeds and avoid infestations. We now share these solutions with farmers across the region."
        },
        {
            "text": "Collaboration and knowledge sharing is key"
        },
        {
            "text": "The success of the herbal ley  project stems from collaboration, which ensures that solutions are practical, effective, and widely adopted."
        },
        {
            "text": "The team works closely with farmers, agents, and organisations including the Agriculture and Horticulture Development Board, Severn Trent Water and the Peak District National Park Authority. Funding from the latter primed the project in the early days. "
        },
        {
            "text": "A network of over 20 farmers are actively involved in trials and knowledge-sharing through a dedicated WhatsApp group, fostering a community of practice around herbal leys."
        },
        {
            "text": "A key aspect of the project is the summer 'Herbal leys in the White Peak' farm walks. These events showcase successful herbal ley establishment and management methods across three farms within one day. Last year over 100 farmers and their agents were in attendance."
        },
        {
            "text": "Local farmer Andrew Ardern commented: \"We attended one of the farm walks back in 2021 and found it really useful seeing different establishment methods. We especially liked the look of the min-till approach after grass and have used this successfully for our herbal leys ever since.\""
        },
        {
            "text": "Ongoing research and development"
        },
        {
            "text": "The herbal ley initiative in the Peak District demonstrates how innovative farming techniques can benefit both the environment and agriculture."
        },
        {
            "text": "As a team, we continue to support farmers in overcoming barriers to the adoption of such approaches. For example, we’re currently working together to try and identify the best ways of preserving protein-rich silage made from the herbal leys. "
        },
        {
            "text": "Moving forward, we are also expanding our focus to include diverse whole-crop cereal and legume mixes in rotation with herbal leys. They provide additional high-value livestock feed and further enhance the sustainability of local farming practices."
        },
        {
            "text": "We have also been collaborating with dairy consultants, who are helping farmers to adapt their systems to herbal ley-based platforms."
        },
        {
            "text": "This work on herbal leys showcases our commitment to developing sustainable solutions that support both flourishing ecosystems and thriving farms."
        },
        {
            "text": "If you’re interested in reading more stories like these, please subscribe to the blog to receive a notification when a new post is released."
        }
    ]
}