{
    "url": "https://actuaries.blog.gov.uk/2025/01/14/navigating-the-future-of-pensions-administration/",
    "title": "Navigating the future of pensions administration",
    "authors": [
        "Jemma Byrne - Senior Pensions Consultant",
        "Taylor Brightwell-Smith - Senior Pensions Consultant"
    ],
    "categories": [
        "Pensions"
    ],
    "pub_date": "2025-01-14T14:26:29+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Introduction"
        },
        {
            "text": "As we look back on 2024 and forward to 2025, it’s clear that the pensions administration industry is facing significant changes and challenges. With those, come opportunities. "
        },
        {
            "text": "Each scheme and administration provider faces a unique set of circumstances, yet certain overarching trends are shaping the industry. Understanding these trends is crucial for staying ahead of the curve. "
        },
        {
            "text": "Here, we reflect on the current state of play and outline 3 areas impacting pensions administration today, before looking ahead to 2025."
        },
        {
            "heading": 2,
            "text": "Current state of play"
        },
        {
            "heading": 3,
            "text": "Increasing complexity in pensions administration"
        },
        {
            "text": "The pensions landscape is in a state of constant flux, presenting ongoing challenges for administrators. Evolving regulations, diverse plan structures, and heightened member expectations all have their impact. "
        },
        {
            "text": "This complexity demands more robust systems and processes to ensure compliance and efficiency. Organisations are now tasked with integrating these requirements into their existing frameworks, often leading to operational strain. "
        },
        {
            "text": "The Pensions Regulator’s (TPR) 2023 to 2024 survey of pension scheme administrators ('the survey') found that 58% of administrators identified the complexity of legislative and regulatory changes as one of the top 3 challenges in delivering high-quality administration. "
        },
        {
            "heading": 3,
            "text": "Technical debt due to underinvestment in technology"
        },
        {
            "text": "Most administrators are actively investing in technology to help them combat the operational impacts of such complexity, and looking at how they can reduce risk and improve member experiences. 65% of respondents to the survey had increased their investment in administration technology or automation over the last 2 years. "
        },
        {
            "text": "In 2024 we saw some of the advancements which administrators were making in this space. Fully online retirement journeys, portals designed to simplify the transfer out process and much more. "
        },
        {
            "text": "There is much to celebrate but also work still to be done. Many organisations continue to grapple with technical debt caused by years of underinvestment in technology. Legacy systems, which were once sufficient, are now outdated and incapable of handling the evolving demands. They may still rely on quick fixes and manual adjustments to address immediate priorities, often at the expense of future-proofing. "
        },
        {
            "text": "This places increased pressure on administrators, especially as experienced staff numbers decline."
        },
        {
            "heading": 3,
            "text": "Talent shortages and the challenge of recruitment"
        },
        {
            "text": "It’s recognised that the industry is experiencing a shortage of skilled talent, making it difficult to recruit and retain the necessary expertise. Again, TPR’s survey found that 80% of administrators felt that recruiting skilled and experienced administration personnel was a challenge. 59% also saw the retention of these staff as a challenge. "
        },
        {
            "text": "This talent gap impacts the quality of service and the ability to innovate. "
        },
        {
            "text": "Organisations are now looking at innovative solutions for attracting new staff and leveraging technology to automate routine tasks. For example, over the last few years we’ve seen an increasing number of firms launching pensions administration academies and apprenticeships to foster a new generation of talent. Multi-national organisations are also making greater use of their teams overseas."
        },
        {
            "heading": 2,
            "text": "Opportunities and challenges"
        },
        {
            "text": "As we look ahead to 2025, several opportunities and challenges stand out in the pensions administration space."
        },
        {
            "heading": 3,
            "text": "Pensions dashboards"
        },
        {
            "text": "Pensions dashboards are on the horizon, promising to revolutionise how members access and manage their pension information. Dashboards aim to provide members with a comprehensive view of their pensions, enhancing transparency and engagement. This will enable individuals to see their total pension savings and forecast their retirement income more effectively, thereby assisting in better financial planning. By making pension information more accessible and understandable, the dashboards encourage individuals to take a more active role in managing their retirement savings. "
        },
        {
            "text": "Pension schemes must prepare for the additional operational demands that will arise when the dashboards become available to the public. However, successful implementation can result in better-informed members and more efficient pension administration, ultimately benefiting both individuals and pension providers. "
        },
        {
            "text": "Implementing these dashboards necessitates substantial data management efforts, as ensuring data accuracy, security, and interoperability across various systems is a considerable challenge."
        },
        {
            "heading": 3,
            "text": "Data management"
        },
        {
            "text": "Is your data enhancing decision-making, or is poor quality dictating actions?"
        },
        {
            "text": "All schemes grapple with data uncertainty, incompleteness, or even inaccuracy. For too long, as an industry we’ve been ensnared in a cycle of panic, cleanse, repeat. We approach a project or significant task only to find our data lacking. We panic, devise a costly plan to address the immediate data needs, and cleanse. And when the next major change arises, the cycle repeats. Yet, there is light at the end of the tunnel. "
        },
        {
            "text": "Recent collaborations with clients on data audits and strategy development have revealed a shift away from project-driven cleansing. Instead, there’s a renewed focus on validation improvements and on ensuring data accuracy from the outset. This is coupled with a commitment to continuous review and improvement as part of business as usual. This then positions schemes to respond to changes, maintain performance, and gain a competitive edge."
        },
        {
            "text": "Ambition is key and leveraging tools like artificial intelligence (AI) could be a game changer in data management."
        },
        {
            "heading": 3,
            "text": "The role of AI in enhancing efficiency and member experience"
        },
        {
            "text": "AI holds great potential in transforming pensions administration. AI can help automate routine tasks, provide predictive analytics, and enhance member interactions through chatbots and personalised communication. "
        },
        {
            "text": "A degree of caution when it comes to discussions of AI is sensible. But we are seeing early developments, and as it’s adopted more widely, it also becomes another thing we need to make sure we understand, govern and challenge. The possibilities are endless, but the practicalities are complex. "
        },
        {
            "text": "At GAD, we have begun exploring AI to convert actuarial guidance into code for calculation development, with potential extensions to pensions legislation. Such developments could bridge skills or knowledge gaps within administrators and support the industry's future growth."
        },
        {
            "heading": 2,
            "text": "Actionable insights"
        },
        {
            "text": "Consider your strategy for implementing new technologies and enhancing operational efficiency when planning your future budgets. Along with asking where your administration provider/system is on this journey; it would be worth:"
        },
        {
            "heading": 2,
            "text": "Summary"
        },
        {
            "text": "So, as we reflect on 2024’s trends and anticipate the challenges and opportunities of 2025, it’s evident the pensions administration industry must continue to adapt and innovate. The dedication and resilience of pensions administrators remain at the heart of driving these advancements."
        },
        {
            "heading": 4,
            "text": "Disclaimer"
        },
        {
            "text": "The views expressed are the authors' own and the opinions in this blog post are not intended to provide specific advice. For our full disclaimer, please see the About this blog page."
        }
    ]
}