{
    "url": "https://competitionandmarkets.blog.gov.uk/2025/01/14/secondment-opportunities-for-competition-and-consumer-lawyers-3/",
    "title": "Secondment opportunities for competition and consumer lawyers",
    "authors": [
        "Victoria Agu"
    ],
    "categories": [
        "Life at the CMA"
    ],
    "pub_date": "2025-01-14T12:33:31+00:00",
    "content": [
        {
            "text": "We are launching a new round of secondment opportunities for lawyers, to start on 7 April 2025."
        },
        {
            "text": "Since its launch in June 2018, almost 60 secondees from over 20 law firms have taken part in the programme and we are now accepting applications for the next round."
        },
        {
            "text": "We invite you to consider whether your firm and any of your associates wish to participate."
        },
        {
            "text": "The deadline for applications is 31 January 2025."
        },
        {
            "text": "Our programme offers an exciting opportunity for competition and consumer lawyers:"
        },
        {
            "heading": 2,
            "text": "Comments from previous secondees:"
        },
        {
            "heading": 2,
            "text": "Application details:"
        },
        {
            "text": "Secondments are open to qualified lawyers currently employed in a law firm in the UK and with previous experience working on competition and/or consumer law matters. While secondees to date have been based in our London office, we are open to consider requests for secondments to be based in CMA offices in Belfast, Edinburgh or Manchester. "
        },
        {
            "text": "Additionally:"
        },
        {
            "text": "Firms that would like to put candidates forward should email a CV and covering letter for each candidate by 31 January 2025 to Simon Harms, Rebecca Saunders, John Kwan and Victoria Agu (contact details below)."
        },
        {
            "text": "As part of their covering letter, candidates should confirm that they are able to start their secondment from 7 April 2025 for a 6-month period."
        },
        {
            "text": "Candidates should also express any preference for particular types of work within the CMA which we will do our best to accommodate, including with a view to maximising a firm’s exposure to different CMA tools among their associates seconded over time."
        },
        {
            "text": "Candidates should be available to have a meeting or call with the CMA during the weeks of either 3 February 2025 or 10 February 2025 to discuss the secondment."
        },
        {
            "text": "Please note we will not consider applications via agencies."
        },
        {
            "text": "Please also note that secondees will have to satisfy the Civil Service nationality rules."
        },
        {
            "text": "If you have any questions or would like to discuss the benefits of the programme, please contact any of Simon Harms, Rebecca Saunders, John Kwan or Victoria Agu."
        },
        {
            "text": "For more information on the CMA's updated strategic framework and areas of focus for 2025 to 2026, read our draft annual plan."
        },
        {
            "heading": 2,
            "text": "Contact details for secondment programme queries:"
        },
        {
            "text": "Simon Harms, Legal Director Simon.Harms@cma.gov.uk "
        },
        {
            "text": "Rebecca Saunders, Legal Director Rebecca.Saunders@cma.gov.uk"
        },
        {
            "text": "John Kwan, Assistant Legal Director John.Kwan@cma.gov.uk"
        },
        {
            "text": "Victoria Agu, Legal Adviser Victoria.Agu@cma.gov.uk"
        }
    ]
}