{
    "url": "https://defrafmp.blog.gov.uk/2025/01/14/the-scottish-governments-fmps-update-on-timelines-and-engagement/",
    "title": "The Scottish Government's FMPs: update on timelines and engagement",
    "authors": [
        "FMP Team"
    ],
    "categories": [
        "- Scotland led FMPs"
    ],
    "pub_date": "2025-01-14T09:09:09+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Have your say on Scottish led joint UK fisheries management plans"
        },
        {
            "text": "The Scottish Government’s Marine Directorate is keen to talk to all interested parties on the fisheries management plans (FMPs) they are developing. These may be of interest to stakeholders in England, Northern Ireland, and Wales."
        },
        {
            "text": "This is a chance to get involved and share your views and input to help shape these FMPs whilst the plans are being developed, and before they move to the formal public consultation stage."
        },
        {
            "heading": 3,
            "text": "What FMPs are Scotland leading on?"
        },
        {
            "text": "The Scottish Government is the coordinating, or leading, authority responsible for developing and publishing 21 joint UK FMPs. These plans cover key demersal and pelagic quota stocks of interest to stakeholders across the UK."
        },
        {
            "text": "These plans fall under three broad categories:"
        },
        {
            "text": "For full details see Annex A: List and publication dates of FMPs (amended December 2024)"
        },
        {
            "heading": 3,
            "text": "How to get involved"
        },
        {
            "text": "Gathering stakeholder views is important to the overall process of developing all FMPs."
        },
        {
            "text": "If you are interested in contributing to any of the plans listed above, make sure you get involved by sharing your views on the FMPs that matter to you. Every input counts!"
        },
        {
            "text": "Please email FMPs@gov.scot to register your interest:  by the end of January 2025 for demersal and nephrops FMPs, and by 2 June 2025 for pelagic FMPs"
        },
        {
            "heading": 3,
            "text": "What are Joint UK Fisheries Management Plans?"
        },
        {
            "text": "Many stocks and fisheries are shared between two or more countries in the UK.  Defra and the devolved nations are working closely together to develop a number of joint UK FMPs to help deliver our shared commitment to secure sustainable fish stocks, a vibrant fishing sector and a healthy marine environment."
        },
        {
            "heading": 3,
            "text": "Progress so far"
        },
        {
            "text": "The Marine Directorate of the Scottish Government has been working closely with the other UK authorities and, their delivery bodies to prepare draft plans, which, following stakeholder engagement and public consultation, are due for publication by the end of 2026."
        },
        {
            "text": "They have set out an initial timeline:"
        }
    ]
}