{
    "url": "https://digitaltrade.blog.gov.uk/2022/04/29/physical-wellbeing-what-it-is-and-why-it-matters/",
    "title": "Physical wellbeing: what it is and why it matters",
    "authors": [
        "Billy Glover, Lead Product Manager",
        "Natalia Rowles, Product Engagement Manager"
    ],
    "categories": [
        "Culture",
        "Diversity and Inclusion",
        "Flexible working",
        "People and Skills"
    ],
    "pub_date": "2022-04-29T10:28:08+01:00",
    "content": [
        {
            "text": "At the Department for International Trade (DIT), we know that our physical health plays an important role in our overall wellbeing, energy and motivation levels. Having a healthy body means you are better equipped to fight off illnesses and deal with the challenges of everyday life."
        },
        {
            "text": "Did you know that:"
        },
        {
            "heading": 2,
            "text": "Celebrating Active Wellbeing week"
        },
        {
            "text": "In January, DIT celebrated Active Wellbeing week to encourage colleagues to adopt an active and healthy lifestyle, both inside and outside of the workplace. In the Digital, Data and Technology (DDaT) team, we held the inaugural “DDaT Dash”. Billy Glover, Lead Product Manager in our CRM data team, organised the event, taking inspiration from a similar initiative his partner ran in the Foreign Office."
        },
        {
            "text": "Starting from 9am, participants actively travelled a distance they were comfortable with, the suggestion being one mile, in any way they wanted to. With the move to remote working, this was a real chance to do something together whilst being apart. Between us, we travelled more than a marathon by walking, cycling and even rowing! However, the highlight was the supporting thread that ran in Microsoft Teams. Colleagues posted photos, left encouraging comments and decided that they would also like to join in."
        },
        {
            "text": "Kathy Gribbin, a Project Support Officer based in our Darlington office, enjoyed her walk around a community farm in her local area."
        },
        {
            "text": "Kathy said, “I love the fact that DDaT champion both physical and mental fitness and organise events to encourage both of these things. It was great fun being involved in the DDaT dash. It was wonderful that I was able to take my dogs out and get some fresh air too!”"
        },
        {
            "text": "Sarah Livermore, a Senior Data Scientist, impressed us all by rowing down the River Thames."
        },
        {
            "text": "She reflected, “It was great to share a fun experience with colleagues, especially since we don’t get to see each other in person as regularly as we used to. I really appreciate working in a team that values physical and mental wellbeing and encourages us to take time out during the day to get outdoors and do a bit of exercise”."
        },
        {
            "text": "Although the DDaT Dash was only a small idea, it allowed the team to show a different side of themselves. It created connections between our colleagues around the country, strengthening our community within DDaT. Through only an online form and   Teams thread (as well as the enthusiasm of our colleagues!) we managed to brighten up a Wednesday in January. More importantly, we created an event that brought people together."
        },
        {
            "text": "In the DDaT Engagement and Strategic Adoption team, we held our own step challenge. However, instead of competing to see who could do the most steps, we committed to our own personal step goals. This was to be inclusive of different working patterns and circumstances in the team. We encouraged each other to walk during meetings that we did not need to actively contribute towards, so we were more consistently mobile throughout the day. Afterwards, we reflected on whether we had met our personal targets in our team meeting."
        },
        {
            "heading": 2,
            "text": "Part of our strategy"
        },
        {
            "text": "DIT knows the value of great people, listing this as one of our strategic enablers for delivering our priority outcomes, and provides wellbeing guidance and support to colleagues all year round. For example, we have an Employee Assistance Programme (EAP) offering free, confidential and independently-run support for DIT colleagues. The EAP is available 24 hours a day, 365 days a year."
        },
        {
            "text": "As part of our new DDaT strategy, we place extra emphasis on people development and support. This is because we recognise there are specific needs and challenges in the DDaT professions. Additional focus and resource will be allocated to physical and mental wellbeing between now and 2026, alongside other people-related topics such as Diversity and Inclusion."
        },
        {
            "text": "We are always keen to hear how other government departments keep their teams healthy and motivated. Look out for our blog on Mental Wellbeing for Mental Health Awareness week in May."
        }
    ]
}