{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2022/04/29/the-government-science-engineering-gse-profession-conference-is-taking-place-on-the-9-may-register-now-to-avoid-missing-out/",
    "title": "The Government Science & Engineering (GSE) Profession Conference is taking place on the 9 May – register now to avoid missing out!",
    "authors": [
        "Jamal Arabi"
    ],
    "categories": [
        "Collaborating & Networking",
        "GSE Opportunities",
        "Latest Stories"
    ],
    "pub_date": "2022-04-29T16:37:57+01:00",
    "content": [
        {
            "text": "The Government Science & Engineering (GSE) Profession is hosting a hybrid conference on Monday 9 May. Headed up by Sir Patrick Vallance, the GSE Profession is an active group of people with one goal in common: to give back to the communities they serve by weaving science and engineering into government. Whether you are a scientist/engineer, or just interested in these areas – the profession is inclusive of all backgrounds and abilities."
        },
        {
            "text": "Scientists and engineers play an essential role in improving the quality of government decisions. From ensuring that scientific evidence strengthens policy, to effectively communicating advice, which has been highlighted throughout the COVID-19 pandemic. The conference will serve as a way to showcase and celebrate the breadth of work that is taking place in science & engineering across government, from delivering solutions to large-scale challenges such as climate change, to work in exciting areas such as Artificial Intelligence. The conference also serves as a unique opportunity for science & engineering policy professionals to connect with other professionals."
        },
        {
            "text": "Civil Servants are encouraged to attend to experience the following:"
        },
        {
            "text": " "
        },
        {
            "text": "The detailed agenda is available here, but the overview is as follows:\n10:30 – Keynote speech from Sir Patrick Vallance"
        },
        {
            "text": "Session One: 11:45-12:45\nBreakout Room One: Deep Dive into Sustainable Cities\nBreakout Room Two: The GSE Offer: Diversity & Inclusion / The GSE Offer: Learning & Development\nBreakout Room Three: Achieving Impact from Science & Engineering"
        },
        {
            "text": "Session Two: 13:45-14:15\nBreakout Room One: Science & Engineering: Career Paths in Government\nBreakout Room Two: The GSE Offer: Leadership & Inspiring Talent\nBreakout Room Three: Women in STEM"
        },
        {
            "text": "Session Three: 14:40-15:10\nBreakout Room One: Advancements in AI: What does this mean for government?\nBreakout Room Two: The GSE Offer: Expertise & Interchange\nBreakout Room Three: Engineering in Policy"
        },
        {
            "text": "15:30 – Close and awards ceremony for the top voted posters"
        },
        {
            "text": "If you are interested in attending and would like to secure your place to the conference, register here. Contact gse@go-science.gov.uk for any other queries!"
        },
        {
            "text": " "
        }
    ]
}