{
    "url": "https://publicpolicydesign.blog.gov.uk/2021/08/05/are-you-making-a-bid-for-design/",
    "title": "Are you making a bid for design?",
    "authors": [
        "Andrew Knight",
        "Alice Whitehead",
        "Amanda Smith",
        "Ben Tate",
        "Faye Churchill",
        "Helena Trippe",
        "Juliet Mountford",
        "Kameshvari Flynn",
        "Sally Halls",
        "Anna Whicher",
        "Jonathan Nicholls"
    ],
    "categories": [
        "Thought leadership"
    ],
    "pub_date": "2021-08-05T12:30:09+01:00",
    "content": [
        {
            "text": "Many organisations within the UK’s government are currently making plans for how to invest their money in the coming years. We want to state the case for investing in innovative public design to make it clear that it is not ‘a nice to have’, but instead a fundamental tool for driving down investment cost and driving up public value."
        },
        {
            "heading": 2,
            "text": "What is innovative public design?"
        },
        {
            "text": "Design gives people who make public policy and services better evidence for making decisions so they can be sure that what they deliver meets the needs of other people and will have the effect that they expect. This ensures the investment choices that we make as a nation are of the highest quality possible and that they maximise public value and give citizens meaningful outcomes."
        },
        {
            "text": "Innovate UK says, “if innovation is the process of converting novel ideas into goods or services that create value, then design is an approach or methodology that puts people at the heart of that process, delivering greater value by making sure that the outputs are desirable and fit-for-purpose.” "
        },
        {
            "text": "Innovative public design is the process of systematically looking for and understanding evidence about what the government intends, what people need, and what is deliverable, and then iteratively making policies and services that best respond in that context."
        },
        {
            "text": "Public design and commercial design are related, but they are not the same. Commercial innovation and design approaches, much lauded in MBAs and tech start ups, are developed to extract value from markets and drive to the bottom line. They are tuned to create highly effective mechanisms for solving problems like persuading you to spend money. In contrast, the government addresses the great challenges of our time. These are complex or wicked problems that feature ever-changing public interests and infrastructure, and deep ethical dilemmas. Public design teams give the government the tools for navigating complexity and reducing uncertainty. Their work helps the government to safeguard the equity share that we choose as a society by ensuring that everyone who should have access to decent public services, does have access. Public design teams don’t extract value, they make value."
        },
        {
            "text": "Public organisations have differing states of maturity for using design when making public policy and services. The government would deliver more public value if its organisations used design as strategy."
        },
        {
            "text": "Design teams take a multidisciplinary approach to making public policy and services. They incorporate subject matter experts who have deep domain knowledge on issues of national importance with technical experts who have skills like research, design and delivery. It is essential to create a feedback loop between policymakers and people that use public services, and the operational delivery professionals, who work on the frontline of government, are key to making this happen. Design teams  collaborate using techniques like systems thinking, people centred design, behavioural science, agile project management, participative co-design and experimentation. The Institute for Government says, “more multi-disciplinary teams are needed to improve decisions and services ...specialists need to be better incorporated into policy making at each stage of the process, to ensure that a wide range of skills inform policy design from the start.”"
        },
        {
            "heading": 2,
            "text": "Delivering government ambition"
        },
        {
            "text": "Innovative public design directly supports a number of government ambitions. "
        },
        {
            "text": "In his Declaration on Government Reform, the Prime Minister’s headline ambition for Civil Service and Ministers is “improving real-world outcomes on the ground”. Policy and service design teams are government’s experts in understanding the everyday needs of people and what they will respond to. The Prime Minister also stated that “we will champion innovation …[and] encourage considered risk taking to find new ways to solve challenges, expanding our use of experimentation and randomised controlled trials, and increase the procurement and adoption of innovation.” Design teams are the government's centres of expertise on innovative and experimental design, both of which provide rigorous evidence about what works and what doesn’t, and therefore are critical to informing decisions about where to invest public funds. "
        },
        {
            "text": "HM Treasury’s Public Value Framework puts design considerations front and centre of national investments. It challenges officials to think about the intent of their work, what they prioritise for investment, whether it will deliver meaningful outcomes for citizens, and how to join up policy and delivery into end-to-end services. Design teams are the government’s experts on these issues and support HM Treasury's ambition to make the most of what we have already by finding the most impactful way to leverage the government's existing assets and resources."
        },
        {
            "text": "The government’s Levelling Up agenda emphasises the importance of investing in local people and places to ensure fairer outcomes across different areas of the nation. Design teams are government’s specialists in working with citizens to co-create public policies and services. To do this design teams build infrastructure and find ways to work with citizens on their terms in local places where they live and work."
        },
        {
            "heading": 2,
            "text": "Return on investment for the public"
        },
        {
            "text": "The government is spending the public’s money on their behalf, so they rightfully have high expectations of experiencing meaningful outcomes and great public services when they need them. Those high expectations are pegged against the experience of services that they encounter in other walks of day-to-day life like shopping, banking, communications and entertainment. "
        },
        {
            "text": "The cost of a public service is not limited to how much your department spends: there is a cost for citizens and organisations to participate too and our designs must include these. People expect as little friction as possible when engaging with the government. Where services are too complex to understand and navigate, a common human response is to avoid them. For some people, this reduces fair access to public services and consequently reduces the efficacy of government’s levers for affecting change in the world. So it is crucial for us to reduce the cost of citizens and the government working together to develop and use public services, whether those are financial, time or opportunity costs."
        },
        {
            "text": "Addressing those costs might be at a very transactional level like only having to ‘sign-in’ to a government website or app or service once, not many times with many usernames. But it might also mean us gaining a deeper understanding of what people need and how different people in society experience public services, so that we can design them in a way that safeguards fair access for everyone. The National Audit Office emphasises the importance of design for stewarding value for citizens and notes that more than two-thirds of public services do not know precisely what their users need. "
        },
        {
            "text": "Finally, there is a broad, less tangible benefit that is nonetheless important. It is about social contract in society. Nesta and IDEO say that although citizens sometimes have declining trust in their government, design thinking can put this relationship “back in balance”. The more that policymakers and citizens work together to make public policies and services, the more transparency and trust there is in society, which improves everyone’s wellbeing and delivers on this social contract. What Works Wellbeing say, “Personal agency, power, responsibility and control are a part of our wellbeing: freedom to choose what we do in our life is the second biggest driver of wellbeing. How organisations work with people to feel control and agency over their lives and communities can make a difference. Joint decision-making encompasses or overlaps with concepts like democracy, devolution, open policy making, community empowerment, co-creation, co-production, inclusion and diversity, voice and accountability, rights, power and responsibilities, agency and control.”"
        },
        {
            "text": "If you want to build a credible case for investment in your public service then a focus on driving up value for citizens has to be a priority. Design teams are the best and most efficient way to make that case."
        },
        {
            "heading": 2,
            "text": "Cost and rewards for organisations"
        },
        {
            "text": "The prize for organisations that invest in design are tangible and real. The case is strongly made by Innovate UK, and the McKinsey Design Index shows businesses that invest in design outperform their industry counterparts by 200%. We believe the same is true for the public sector, but instead of revenue and shareholder returns, we are delivering public value."
        },
        {
            "text": "Earlier this year we wrote about the typical costs of setting up a multidisciplinary policy design team. These costs are small compared to the potential rewards for public organisations that invest in design."
        },
        {
            "text": "The headline, high cost of public policy and services that fail should also be noted (for a list of failures that were made without design expertise see The Blunders of Our Governments)."
        },
        {
            "text": "The weakest initial policy ideas are often based on assumption and bias. Some might try to use the blunt force of fact to counter these. But design provides a more sophisticated and constructive dialogue where policy ideas are built on evidence and are iterated collaboratively so that everyone feels that they have reached a right answer that is both needed and deliverable. "
        },
        {
            "text": "The rigour of the design process creates a deep, rounded evidence base that systematically draws together all types of existing research whether it’s scientific, academic, data analysis, operational research, social research, user research, behavioural science or from further afield, and then plugs gaps in the evidence base by generating rich, new evidence in diverse ways from ethnography to Randomised Control Trials. This evidence base is used to design interventions that respond to the deep context that is revealed, and understanding is further enhanced  by testing and iterating the policy or service with the people that will use it. Citizen engagement with policy and service design deepens understanding of how effective our interventions will be."
        },
        {
            "text": "Public officials are operating in increasingly difficult circumstances. Our work is more complex and uncertain than ever before. The scale of the challenges are immense like coronavirus, brexit and net zero. Design teams specialise in understanding the landscape around policies and services using systems thinking, and then designing end-to-end services around the needs of the people who will use them. "
        },
        {
            "text": "In addition, the heightened cadence of public and political life drives demand for increasingly rapid responses by Civil Service. This presents a clear risk that the government’s responses might be poorer quality. Multidisciplinary design teams mitigate this risk by working rapidly to underpin policy formulation with robust evidence, in effect shrinking the time from policy inception to successful service delivery. "
        },
        {
            "text": "Altogether this acts to supercharge your policymaking powers. By deploying design people and techniques you are frontloading delivery risk. That means that when you ask for investment, you can provide maximum assurance that it is needed and is deliverable. In the long run, that not only saves your organisation money, but it is more frugal for the public purse."
        },
        {
            "text": "Our role as civil servants requires us to provide the highest quality advice to ministers. For us to have an informed dialogue with them, we must immerse ourselves in rich evidence and know how to ask the right kind of questions that build a collegiate partnership for finding the best ways to deliver their intent. Design provides that framework and it should be a core capability within the teams of all senior public leaders. Ultimately it is ministers who front public policy and services and having access to high quality research and design can underpin their credibility and reputation."
        },
        {
            "heading": 2,
            "text": "Building design practice in government"
        },
        {
            "text": "Design is a young government community but we are codifying and systemising ways of working that civil service has always just muddled through. As we invest more in design and innovation (both by organisations hiring multidisciplinary design teams and central government investing in the community of practice), we will increase the footprint of design and incrementally reach an economy of scale. We are heading toward a future where it will be difficult to justify developing public services without design because of the assurance that it provides on doing the right thing to drive up public value."
        },
        {
            "heading": 2,
            "text": "Do you want to co-sign our statement on innovative public design?"
        },
        {
            "text": "If you agree with this statement on innovative public design and want to add your support and advocate its use in government, then comment below by writing “I support this statement” and saying who you are and what you do."
        }
    ]
}