{
    "url": "https://environmentagency.blog.gov.uk/2021/08/05/better-bathing-water-quality-better-health-and-wellbeing/",
    "title": "Better bathing water quality; better health and wellbeing",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Cleaner Seas"
    ],
    "pub_date": "2021-08-05T10:33:13+00:00",
    "content": [
        {
            "text": "It’s been a year where many more of us have come to appreciate our local environment and value the nature around us. That’s why it’s great to work for the Environment Agency on projects and partnerships that are helping to improve our local environment for both wildlife and for people."
        },
        {
            "text": "One of the partnerships we’re involved in is called Turning Tides, which is working to improve and unlock the potential of bathing waters and beaches across the North West. It’s a regional partnership that was set up in 2012 and has had major success in meeting the standards of the Bathing Waters Directive, with all bathing waters along the North West coast, from the border with Wales to the border with Scotland, achieving at least the minimum standard of Sufficient since 2016. There are a number of organisations involved including the Environment Agency, United Utilities, Natural England, local authorities, beach operators, British Destinations, NFU and the North West Coastal Forum, each bringing their own unique contribution to the partnership."
        },
        {
            "text": "Meeting the bathing water standards requires continuous investment and effort from all, so there are a number of strands of work involved. One great example is a project led by Keep Britain Tidy and Morecambe Bay Partnership which brings together stakeholders from across the North West to work towards the collective ambition delivered under the LOVEmyBEACH campaign."
        },
        {
            "text": "The idea behind LOVEmyBEACH is to actively engage people in improving their local coastal environment by getting involved in work to improve water quality and beach cleanliness. It’s all about inspiring and engaging the public in taking positive steps to care for their beaches and coastal environments through campaigns, targeted action and events."
        },
        {
            "text": "The Turning Tides partnership received a boost to its capacity via the EU-funded LIFE Integrated Project: Natural Course. This has really helped the partnership to evolve and broaden out ambitions where previously the focus was on striving to meet the bathing water standards. The benefits of peoples’ health and wellbeing, as well as the boost for tourism, go hand in hand with a high-quality natural resource and these are now reflected in the partnership’s 10-year action plan. The ultimate goal of the action plan is to have a ‘Blue Flag Coast’ (with Blue Flags flying at many of the North West’s Bathing Waters) and to set the partnership as a leader in bathing water improvements and engagement regionally, nationally and across Europe."
        },
        {
            "text": "To do this, three waves of work were identified:"
        },
        {
            "text": "WAVE 1: Environment improvements – improving bathing water quality and beach cleanliness"
        },
        {
            "text": "WAVE 2: Using our bathing waters to improve public health and wellbeing"
        },
        {
            "text": "WAVE 3: Improved bathing water quality to boost tourism and the coastal economy"
        },
        {
            "text": "The focus has been mainly on WAVEs 1 and 2, but with COVID impacts including increasing beach usage and more staycations this year, WAVE 3 aspects are becoming more obvious."
        },
        {
            "text": "The WAVE 1 Action Plan includes a wider remit across the partnership, enhancing opportunities for work and practical action, and developing collaborations with businesses and Catchment Partnerships to realise the Blue Flag coastline ambition."
        },
        {
            "text": "A recent example of work undertaken is a leaflet developed for motorhome users to encourage the responsible disposal of waste water. This initiative is being supported by many local authorities and LOVEmyBEACH is now exploring opportunities for more chemical disposal points for motorhome users."
        },
        {
            "text": "There’s also a wealth of ways that everyone can LOVEmyBEACH on the ‘What can I do?’ section of the webpage, with resources for householders, dog owners, local businesses and educators."
        },
        {
            "text": "Wave 2 has developed the ‘Active Coast’ programme which includes ways to use beaches for health and wellbeing. Under the categories of sports, environment, community action, walk and relaxation, and arts and culture, a whole range of activities were organised to encourage people to get out and have fun on the coast."
        },
        {
            "text": "So now, with thoughts about life returning to normal (or the new normal), it’s important that we don’t forget how nature and the environment has been there for us. Be a #WaterWarrior this summer and consider how we can all keep on doing our bit to repay that favour."
        },
        {
            "text": "Find out more at LOVEmyBEACH"
        }
    ]
}