{
    "url": "https://aphascience.blog.gov.uk/2021/08/05/bovine-tuberculosis/",
    "title": "The need to eradicate bovine tuberculosis (bTB)",
    "authors": [
        "APHA science blog team"
    ],
    "categories": [
        "Bovine Tuberculosis",
        "Diagnostics & testing"
    ],
    "pub_date": "2021-08-05T16:15:55+01:00",
    "content": [
        {
            "text": "Bovine Tuberculosis (bTB) is an infectious disease of cattle. It is one of the most significant animal health challenges that England faces today, costing taxpayers more than £100 million each year. In 2020 alone, more than 27,000 cattle had to be slaughtered to curb its spread."
        },
        {
            "text": "It is caused by a bacterium which can also infect and cause disease in badgers, deer, goats, pigs and camelids (llamas and alpacas), as well as many other mammals."
        },
        {
            "text": "In cattle, TB is primarily a chronic respiratory disease but clinical signs are rare. Bovine TB is a zoonotic disease, which means that it can be naturally transmitted from animals to humans under certain conditions. Due to the comprehensive TB eradication plan in place in the UK, human cases of TB have been significantly reduced over recent decades."
        },
        {
            "text": "The UK enjoys a hard-won international reputation for biosecurity and our standards are second to none. Our strict animal disease control strategies are central to this. Restrictions on livestock movements are taken to reduce the risk of the spread of diseases which can have damaging effects on farmers’ livelihoods and income and even affect the UK’s ability to trade in certain products."
        },
        {
            "text": "Alongside strong biosecurity measures, routine TB testing of cattle herds is a key tool in our approach to stopping this disease. The primary testing method is the tuberculin skin test, which is widely used around the world to detect the disease in animals. The test has a specificity of 99.98%, meaning on average there is one false positive result for every 5,000 uninfected cattle tested."
        },
        {
            "text": "bTB causes devastation and distress for families across the country, impacting their livelihoods, trade and wellbeing. Therefore, while nobody wants to have to cull animals, it is necessary to reduce the risk of the disease spreading further and causing ever more disease."
        },
        {
            "text": "To find out more about the Government’s strategy to eradicate bovine TB and research leading to the development of a cattle vaccine and associated DIVA skin test (DST-F) please follow the links below:"
        }
    ]
}