{
    "url": "https://ukhsa.blog.gov.uk/2021/08/05/ensuring-every-child-gets-the-best-start-in-life-starting-with-vaccine-protection/",
    "title": "Ensuring every child gets the best start in life – starting  with vaccine protection",
    "authors": [
        "Jenny Harries"
    ],
    "categories": [
        "Coronavirus (COVID-19)",
        "Immunisation and vaccination"
    ],
    "pub_date": "2021-08-05T14:45:01+01:00",
    "content": [
        {
            "text": "The pandemic has reminded us how brilliant our scientists are and how effective the NHS is at running life-saving vaccination programmes."
        },
        {
            "text": "I welcome the Joint Committee on Vaccination and Immunisation’s (JCVI) advice that 16 and 17 year olds be routinely offered the COVID-19 vaccine. We should also be proud and very grateful that, unlike many parts of the world, all children in the UK can get free vaccines to protect them against a host of other serious diseases, from measles to polio."
        },
        {
            "text": "Since the measles vaccine was first introduced in 1968 it is estimated to have prevented more than 20 million cases and 4,500 deaths in the UK alone."
        },
        {
            "text": "But in the last few years, the data shows a decline in the number of children getting their jabs."
        },
        {
            "text": "This is hugely concerning because it means that more children are potentially vulnerable to serious illness, increasing the chance of outbreaks."
        },
        {
            "text": "The most recent data shows that as of March 2020, approximately 37,500 children did not receive any dose of MMR by age 5, with a further 53,500 not receiving a second dose."
        },
        {
            "text": "There has also been a decline in the number of children getting their 3-dose course of the Hexavalent vaccine by 6 months of age, which protects against six serious diseases including Tetanus, Diptheria and Hepatitis B."
        },
        {
            "text": "Our latest surveillance suggests that each year there are around 40,000 children unprotected with their 3-dose course by the time they are 6 months old."
        },
        {
            "text": "These declines in vaccine uptake began before the COVID-19 pandemic struck. Exactly why this happened is not entirely clear and there will have been a number of factors at play, including access to health services. Some parents however will simply not be aware of the vaccinations their child is entitled to."
        },
        {
            "text": "On top of these challenges, lockdown restrictions have caused a further decline. This is despite GP clinics remaining open throughout and working hard to deliver this vital service."
        },
        {
            "text": "These illnesses can still affect children and cause severe illness. It is absolutely vital that parents bring their children to all their routine vaccination appointments and catch up on any vaccinations they have missed. Vaccinations can be rescheduled and every child is still entitled to their jab, even if they have missed an appointment."
        },
        {
            "text": "Other infectious diseases beyond COVID-19 have not gone away and it’s essential we maintain the highest possible uptake to prevent a resurgence of serious and sometimes life-threatening diseases, particularly as restrictions lift, we socialise together more and people get back to more normal ways of life."
        },
        {
            "text": "Our necessary response to COVID-19 and the disruption to education and children’s social development has had a devastating impact on young people."
        },
        {
            "text": "We can start to put some of that right by ensuring that no child is left behind in our protection of their health and that every child gets the best start in life – and that starts with their vaccine protection against these unpleasant and sometimes serious diseases."
        },
        {
            "text": "All children who have missed out on their routine vaccinations during the COVID-19 pandemic remain eligible for their vaccines. Parents can speak to their GP to find out about any vaccines that they may have missed."
        },
        {
            "text": "As chief executive officer of the UK Health Security Agency, I can assure you that we will be working flat out with the NHS to lead our routine and seasonal vaccination programmes from strength to strength – to prevent outbreaks of serious disease and save lives."
        }
    ]
}