{
    "url": "https://phescreening.blog.gov.uk/2021/08/05/find-the-screening-information-you-need-on-gov-uk/",
    "title": "Find the screening information you need on GOV.UK",
    "authors": [
        "Jonny Fertray"
    ],
    "categories": [
        "General information"
    ],
    "pub_date": "2021-08-05T09:58:10+01:00",
    "content": [
        {
            "text": "For a website that provides hundreds of thousands of documents to millions of people, the challenge for GOV.UK is to make things easy to find. The Government Digital Service (GDS) is constantly working on improvements to how you can search and find your way round the site."
        },
        {
            "text": "But some users tell us that screening content is sometimes still tricky to find. We update publications regularly, so it's important for you to have access to the latest information on GOV.UK."
        },
        {
            "text": "We thought we’d put together some hints and tips to help you find that publication you really need."
        },
        {
            "heading": 2,
            "text": "Finding your way around GOV.UK"
        },
        {
            "text": "Each NHS screening programme has its own page on GOV.UK. There are also pages for some cross-programme topics."
        },
        {
            "text": "You can find a list of the screening topic pages here. They are:"
        },
        {
            "text": "Each of these pages contains links which group together types of publications, such as ‘professional guidance’ and ‘supporting publications’. They include professional guidance and information leaflets."
        },
        {
            "heading": 2,
            "text": "Finding a publication"
        },
        {
            "text": "If you are ever still struggling to find what you need using either the pages above or the GOV.UK search function, searching on an internet search engine may give you quick and useful results."
        },
        {
            "heading": 2,
            "text": "Finding a word or section in a publication"
        },
        {
            "text": "Your internet browser has a built-in search function (usually called ‘find’ or ‘find on page’). You can use this to find a word or phrase on most webpages and documents, apart from PDFs."
        },
        {
            "text": "If you’re comfortable using keyboard shortcuts, you just need to press <Ctrl> + <F> to open the ‘find’ panel. Otherwise, you can open it from the 'options' or 'settings' section, as in the images below."
        },
        {
            "text": "The find function will tell you how many times the word appears on the page (for example, ‘1/6’ would mean it is currently showing you the first instance out of 6 which are on the page). You can scroll through each instance of the word by using the arrows to the right. The word will be highlighted – the current selection in orange, and other instances in yellow."
        },
        {
            "heading": 2,
            "text": "Finding what has changed in a publication"
        },
        {
            "text": "We use ‘change notes’ to explain the important changes to our publications. This means you do not miss changes and you do not need to waste time reading through an entire document to find small changes or changes that are not relevant to your work. These change notes are built into GOV.UK publication pages."
        },
        {
            "text": "To see a publication’s change notes:"
        },
        {
            "text": "The changes are listed in order, from most to least recent. They are relatively brief but will point you to the sections to check."
        },
        {
            "heading": 2,
            "text": "Getting email updates when something has changed"
        },
        {
            "text": "You can sign up to receive emails telling you about major changes to pages relating to one of the screening topics on GOV.UK."
        },
        {
            "text": "To do this, just go to the page for the topic you’re interested in and click ‘Get emails for this topic’."
        },
        {
            "text": "You’ll only get emails about changes which we think you need to know about – you will not get emails about minor corrections. You can choose how often you’d like to receive these emails – at most once a week, at most once a day or every time there’s a major change."
        },
        {
            "heading": 2,
            "text": "PHE Screening blog"
        },
        {
            "text": "The PHE Screening blog provides up to date news from all NHS screening programmes. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new blogs. If you have any questions about this blog article, or about population screening in England, please contact the PHE screening helpdesk."
        }
    ]
}