{
    "url": "https://defrafarming.blog.gov.uk/2021/08/05/learn-more-about-the-landscape-recovery-scheme/",
    "title": "Learn more about the Landscape Recovery scheme",
    "authors": [
        "Sam Burford"
    ],
    "categories": [
        "Payments to restore landscapes and ecosystems"
    ],
    "pub_date": "2021-08-05T12:11:22+01:00",
    "content": [
        {
            "text": "I’m excited to share an invitation to farmers and other land managers to join one of our online introductory sessions about the Landscape Recovery pilot."
        },
        {
            "text": "The sessions will be a chance to learn more about the upcoming pilot, ask questions and share your ideas for its development. Your feedback and questions will help us develop and finalise the details of the scheme."
        },
        {
            "heading": 4,
            "text": "The scheme"
        },
        {
            "text": "Landscape Recovery is 1 of our 3 new environmental land management schemes, alongside the Sustainable Farming Incentive and Local Nature Recovery."
        },
        {
            "text": "Through the Landscape Recovery scheme, we aim to put in place bespoke agreements to deliver long-term, large-scale, landscape and ecosystem recovery projects."
        },
        {
            "text": "These projects will deliver a wide variety of environmental outcomes and support local environmental priorities. They will also make an important contribution to national targets, like the 25 Year Environment Plan ambitions and achieving net zero carbon emissions."
        },
        {
            "heading": 4,
            "text": "Scheme timings"
        },
        {
            "text": "We’ll launch at least 10 pilot projects between 2022 and 2024, to deliver over 20,000 hectares of wildlife-rich habitat. We aim to invite bids for the first wave of pilot projects in the autumn."
        },
        {
            "text": "Our plan is that those projects successful at this initial application phase will be supported to undertake project development starting in early 2022."
        },
        {
            "text": "Projects that meet our requirements at the end of the project development phase will then be awarded a long-term funding agreement, allowing them to begin."
        },
        {
            "text": "We aim to scale-up delivery of the scheme from 2024."
        },
        {
            "heading": 4,
            "text": "Proposed pilot eligibility"
        },
        {
            "text": "We’re currently planning to open applications to sites between 500 to 5,000 connected hectares.  Applications can be made by any landowner or land manager, including individuals, organisations and collaborative groups."
        },
        {
            "text": "Projects that have received or are receiving funding from other government schemes will be able to apply (though you will not be paid twice for the same activity)."
        },
        {
            "text": "We will assess bids to identify those that are best able to deliver our objectives and most suitable for the scheme."
        },
        {
            "text": "We look forward to discussing proposals in more detail with those interested in the scheme at our online sessions."
        },
        {
            "heading": 4,
            "text": "Themes of the first pilots"
        },
        {
            "text": "The first wave of pilot projects are likely to focus on 2 themes:"
        },
        {
            "text": "We will also expect the projects to deliver other benefits, such as carbon savings to help achieve net zero."
        },
        {
            "heading": 4,
            "text": "Sign up for a session"
        },
        {
            "text": "The information sessions will take place on the following days. To attend, just follow the links below."
        },
        {
            "text": "These 3 sessions will be the same, so attend whichever one is most convenient for you. We will record the sessions, so you will be able to catch up later if you’re not able to attend. Do let others know about these sessions too."
        },
        {
            "text": "If the Landscape Recovery scheme isn’t right for you, don’t worry – there are other schemes for which you might be eligible. Read our How Farming is Changing page which gives a summary of the other schemes."
        }
    ]
}