{
    "url": "https://defradigital.blog.gov.uk/2021/08/05/radar-more-than-just-wave-detection/",
    "title": "Radar – more than just wave detection",
    "authors": [
        "Tony Riggs"
    ],
    "categories": [
        "Data Transformation",
        "Digital transformation",
        "Open data",
        "Software tools",
        "Strategy"
    ],
    "pub_date": "2021-08-05T10:07:37+01:00",
    "content": [
        {
            "text": "My technology innovation team produces an Emerging Technology Radar for Defra group each year, with a quarterly update. The radar identifies the emerging digital and information technologies that have the greatest potential impact and provide the biggest opportunities for transforming the Defra group."
        },
        {
            "text": "Each version of the radar is unique, providing a specific view of emerging technology for our Defra business. This differentiates it from all other externally available, generic, horizon-scanning, and emerging technologies research."
        },
        {
            "text": "The process of producing this radar begins with the identification of Defra’s key strategic goals and operational challenges, and directly maps those to over 1800 emerging technologies.  The radar recognises and links those technologies that have the potential to directly impact our core strategic goals and challenges."
        },
        {
            "text": "Around fifty of the most promising technologies make it onto the radar each year, with their potential for business impact rated from moderate to transformational. The technologies are also categorised on their maturity, from embryonic to mainstream, enabling the reader to know how far away a technology is from being ‘here today’."
        },
        {
            "heading": 2,
            "text": "Why the Emerging Technology Radar matters to Defra group"
        },
        {
            "text": "The history of radar (or Radio Detection and Ranging to give it its full title) actually dates back to the 19th century when German physicist Heinrich Hertz proved that radio waves were reflected by metallic objects. The term radar has since entered the common language, and is probably most commonly associated nowadays with being a device for determining the presence and location of an object by measuring the time for the echo of a radio wave to return from it and the direction from which it returns."
        },
        {
            "text": "Our Emerging Technology Radar doesn’t quite do that, but it is our most important guide in shaping the emerging technologies Defra chooses to explore. There are thousands of them too, pushed by hundreds of suppliers on the market. Our radar enables Defra to be strategically selective in focusing on the emerging technologies that have the potential for the largest positive impacts on the business - allowing the department to make smart technology decisions at the right time."
        },
        {
            "text": "Outside of Defra, my team collaborate with many different suppliers and partners and the radar is a key driver in this work. The radar allows our partners to better understand Defra’s challenges and opportunities and the emerging technologies that could impact on these, enabling them to approach the business with more targeted solutions."
        },
        {
            "heading": 2,
            "text": "Using a business-driven approach"
        },
        {
            "text": "The Emerging Technology Radar takes a business-first approach - it focuses on the key themes across the department before considering any emerging technologies, ensuring all ideas are business-focused. Using many different business artefacts, including the Defra group Outcome Delivery Plan, the radar identifies six key business themes:"
        },
        {
            "text": "After identifying these six themes, a small number of emerging technologies have been identified as being crucial to these areas. Those include Internet of Things, Low Earth Orbit Satellites and a technology family called Smart Automation (including Machine Learning, Virtual Assistants and Conversational User Interfaces). The Technology Innovation team are already working on the further research, exploration, and introduction of these emerging technologies across the Defra group."
        },
        {
            "heading": 2,
            "text": "Here comes the ‘so what’ factor"
        },
        {
            "text": "An obvious question you might be wanting to ask me right now might be ‘How has the Emerging Technology Radar produced positive outcomes for Defra in the past’? It’s a reasonable challenge and so, yes, why are we doing all of this work?"
        },
        {
            "text": "Well the radar is shared with all our regular partners, not only across our own function within Defra, but further out into the wider department and its Arm’s Length Bodies. This often results in a wave of ideas and proposals as readers begin to connect challenges in their own business areas with emerging technologies. As a small team, we rely a lot on the business expertise of colleagues coming forward and sharing their challenges and opportunities. The radar enables a starting point for this to happen each year, driving a continuous engagement."
        },
        {
            "text": "As a result of the radar, the Technology Innovation team have consistently delivered explorations in the emerging technology areas deemed most transformational – right from its first publication in 2017. These explorations include using the Internet of Things, 5G, Virtual Reality and Natural Language Processing in genuine Defra contexts."
        },
        {
            "text": "Not many government departments are producing their own regular, business-focused emerging technology radars, although scanning the horizon for emerging technologies is becoming more common across Whitehall now. We regularly communicate with other departments to both learn and share our own findings, and a ‘emerging technology community’ is beginning to take shape with cross-government groups and initiatives being formed. Maybe that’ll be a subject for a future Blog post……."
        }
    ]
}