{
    "url": "https://civilservice.blog.gov.uk/2021/08/05/the-fight-against-fraud-and-covid-vaccine-scammers/",
    "title": "The Fight Against Fraud and Covid Vaccine Scammers",
    "authors": [
        "Laura Eshelby, Deputy Director Public Sector Fraud, Counter Fraud Function"
    ],
    "categories": [
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Ambitious Civil Service",
        "Uncategorized"
    ],
    "pub_date": "2021-08-05T09:03:16+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Even a pandemic couldn’t prevent criminals targeting public services and people vulnerable to fraud in an audacious attempt to con them. Report: Laura Eshelby."
        },
        {
            "text": "COVID-19 forced us across the UK to work virtually, and for many of us, from our own homes. The pandemic impacted everyone on a global scale, with demand for certain products and services at a premium, most notably in healthcare to source adequate supplies of personal protective equipment (PPE). "
        },
        {
            "text": "Criminals were quick to take advantage of the health crisis and adapted their practices to establish methods to target the public, predominantly through cyber-enabled means, online, via text messages and social media, always using C-19 as a hook to target and con vulnerable and elderly people from their savings. "
        },
        {
            "text": "The sham tactics deployed included the development of fake websites, designed  to sell C-19 test kits, vaccines, and early in the pandemic even COVID-19 ‘cures.’ Using technology, there were attempts to spoof genuine messages from public service sites, such as Test and Trace and government departments. "
        },
        {
            "text": "It can be hard for members of the public to distinguish  between legitimate and fake sites. The City of London Police, which houses the National Fraud Intelligence Bureau (NFIB), have received reports this year to date totalling losses of £16m from victims of fraud, showing the extent of the problem. "
        },
        {
            "text": "Fighting back and warning the public"
        },
        {
            "text": "By February 2020, it was clear that the COVID-19 criminals were behind organised crime on a rapidly growing scale."
        },
        {
            "text": "The government has a dedicated function across its 18 departments, which leads the fight against fraud. Last year in March the central team switched from policy, to a more operational C-19 Fraud Response Team."
        },
        {
            "text": "A key plank of this work was focused on intelligence sharing and stepping up communications to stamp out fraud, the perpetrators behind it and to protect the public. During this time, as Deputy Director, Government Counter Fraud Function, I headed up the Intelligence arm of the COVID-19 Fraud Response Team, housed in the Cabinet Office. "
        },
        {
            "text": "The team worked closely with partners in policing, the National Cyber Security Centre in London and with private sector partners to help generate messaging at pace. Their goal was to warn the public of the dangers of criminals targeting them at this vulnerable time, and how to take preventative steps to protect themselves, including this advice regarding COVID-19 vaccines. "
        },
        {
            "text": "Over the next few weeks with the support of multiple agencies, we were able to get messages out across the country and beyond, raising awareness of the variety  of scams and fraud attempts out there. We worked with Matt Alwright, of BBC’s Watchdog and Rogue Traders fame, to launch the hotline and amplify the messages to the public."
        },
        {
            "text": "The agencies worked together with the Crimestoppers charity to get the messages out on social media such as LinkedIn, Facebook, and Instagram to alert the public. The National Crime Agency and City of London police helped amplify the messages on their websites, and used TV and radio news programs too. The COVID-19 Fraud Response team provided expert advice on the types of scams that were being identified through the intelligence  and analysis of the threats coming in. "
        },
        {
            "text": "Working at pace"
        },
        {
            "text": "The next step in the fight against fraud was to understand how criminals were targeting our businesses and the public sector. The COVID-19 Fraud Response Team worked at pace to unlock intelligence flows to gain the understanding needed. "
        },
        {
            "text": "We focussed attention on those areas of highest identified risk, such as C-19 grant and loan support schemes and the procurement of high value PPE and health service contracts. "
        },
        {
            "text": "We worked in partnership with the National Crime Agency, Department of Health and Social Care (DHSC), and Commercial colleagues, to unlock the intelligence needed to enable checking contracts pre-award. And if this wasn’t possible, we scrutinised post-award to identify risks of fraud occurring. This and wider efforts by the DHSC fraud team led to hundreds of millions of pounds being saved for the taxpayer. "
        },
        {
            "text": "This example shows how different departments and sectors can collaborate effectively and have a positive impact for the public sector and ultimately the citizen. "
        },
        {
            "text": "Creating a tool for the public to share concerns"
        },
        {
            "text": "We identified early on a gap in how members of the public could share their suspicions about fraud against the public sector."
        },
        {
            "text": "We considered how we could open up reporting channels and teamed up with the crime reporting charity Crimestoppers, creating a dedicated COVID-19 reporting Hotline. This launched in October 2020, and the UK public can now call free (0800 587 5030) and anonymously.  The intelligence gathered helps the Fraud Response Team in the Cabinet Office target information to those fighting fraud across the public sector, and beyond. "
        },
        {
            "text": "Measuring the impact of C-19"
        },
        {
            "text": "It will take time to measure and understand the true extent of COVID-19 fraud loss, across all sectors.  In the Government Counter Fraud Function pre COVID-19, we estimated loss against the public sector to be £29-52bn per year, but COVID-19 could increase these losses by a significant amount. "
        },
        {
            "text": "In the public sector the Counter Fraud Function are working hard to utilise the structures and established methodologies developed by their experts to:"
        },
        {
            "text": "Key lessons"
        },
        {
            "text": "One of the key lessons we have learned is that there will always be fraud in an emergency situation. This is demonstrated by other disasters worldwide, from the Australian Bushfires, Hurricane Katrina and now COVID-19.  "
        },
        {
            "text": "Following the Bushfires, we worked with international partners to develop some guidance on managing fraud in an emergency. This was just before COVID-19 hit, and became a timely source of information to drive our strategy in the months ahead and ensure we did all we could to understand and where possible fight against the criminals intent on targeting public services, intended to support those most vulnerable and in need during the pandemic. "
        },
        {
            "text": "You can learn more here. "
        }
    ]
}