{
    "url": "https://stratcommand.blog.gov.uk/2022/05/27/how-do-we-train-for-the-modern-threats-we-face/",
    "title": "How do we train for the modern threats we face?",
    "authors": [
        "Conrad Beckett"
    ],
    "categories": [
        "Integration",
        "Multi Domain Integration",
        "Training"
    ],
    "pub_date": "2022-05-27T07:00:06+01:00",
    "content": [
        {
            "text": "We face a vast, interconnected web of threats. And if we are to remain competitive with our constantly strengthening 21st century adversaries, an integrated response is the only way forward."
        },
        {
            "text": "Strategic Command is responsible for implementing Multi-Domain Integration (find out what this means here). But how do we go about doing that?"
        },
        {
            "text": "One crucial way is to train and rehearse in a unified and collaborative way."
        },
        {
            "text": "In May 2021, HMS Queen Elizabeth, one of the UK’s aircraft carriers, led a group of ten ships on a 50,000 mile seven-and-a-half-month round trip to the Pacific Ocean."
        },
        {
            "text": "The deployment was a valuable opportunity to test sophisticated integration with the space and cyberspace domains, and ensure all the digital networks work seamlessly together."
        },
        {
            "text": "Technical integration was also exercised with over 40 international partners. This included operating our partner nations’ aircraft on and off HMS Queen Elizabeth, refuelling and restocking from allied ships and ports, and testing our communications systems to ensure they work well with those of our partners."
        },
        {
            "text": "This training was achieved through many exercises during the deployment, both those led by HMS Queen Elizabeth, and those supported by her."
        },
        {
            "text": "Exercise Khanjar Oman was a UK-Oman land-based exercise that was supported by F-35 fighter aircraft from the carrier. Joint manoeuvres with the Omani Army took place in the desert, and attack and reconnaissance aviation were integrated into the exercise, along with autonomous systems and drones."
        },
        {
            "text": "The exercise also rehearsed information operations, where UK experts worked with local forces to influence the region. Crucially, everything was connected through the space domain."
        },
        {
            "text": "Exercises like Khanjar Oman help Strategic Command learn about where we are already well integrated, and where we can continue to develop."
        },
        {
            "text": "The British Army’s 1st Division Exercise Rhino Charge took this a step further and featured deliberate interventions to prompt cross-government collaboration."
        },
        {
            "text": "Exercise Rhino Charge simulated a sub-threshold, or ‘grey zone’, scenario in Africa (you can read more about the grey zone here)."
        },
        {
            "text": "This forced the 1st Division staff officers to decide how they would deal with rapidly changing situations, manage relationships with local partners and forces, collaborate with other government departments, and rehearse influence and information operations."
        },
        {
            "text": "Despite being an Army-led exercise, Rhino Charge incorporated experts from Air Command and Space Command, as well as civilian expertise from our government partners."
        },
        {
            "text": "If we are to effectively respond to current and future threats, we need to keep exercising with other parts of Defence, our Government partners, and our allies."
        },
        {
            "text": "Personnel from across Strategic Command are working resolutely to improve integration across defence."
        }
    ]
}