{
    "url": "https://forestrycommission.blog.gov.uk/2022/05/27/keepers-of-time-how-government-are-protecting-and-improving-ancient-and-native-woodland-and-ancient-and-veteran-trees/",
    "title": "Keepers of Time: How Government are protecting and improving ancient and native woodland and ancient and veteran trees.",
    "authors": [
        "Defra, Forestry Commission, Natural England and the Woodland Trust"
    ],
    "categories": [
        "Ancient Woodland"
    ],
    "pub_date": "2022-05-27T11:55:14+01:00",
    "content": [
        {
            "text": "The revised Keepers of Time Policy for ancient and native woodland and ancient and veteran trees has been launched."
        },
        {
            "text": "England’s ancient woodlands and ancient and veteran trees are a special part of our history and legacy, they are the jewels in the crown of England’s treescape."
        },
        {
            "text": "England is home to some of the best examples of ancient woodlands, ancient wood pastures and parkland and ancient and veteran trees. These irreplaceable habitats must be protected. Their long-standing presence, species and form serve as a rich cultural record of past management practices. They support high levels of biodiversity and are home to a quarter of England’s priority species."
        },
        {
            "text": "These trees and habitats are important in so many ways and we must protect and improve them for people, nature, climate and the economy. They deliver many ecosystem services from tourism to cleaning our air while also providing timber and non-timber products."
        },
        {
            "heading": 2,
            "text": "What is Keepers of Time and why has the Government committed to updating it?"
        },
        {
            "text": "In the England Trees Action Plan the Government committed to review and update Keepers of Time, using the latest evidence and information available and focussing on the most important issues faced today."
        },
        {
            "text": "The Keepers of Time policy outlines the value of England’s ancient and native woodlands and ancient and veteran trees. It states Government’s commitment to evaluate the threats facing these habitats and sets out England’s updated principles and objectives to protect and improve these habitats for future generations."
        },
        {
            "text": "This policy provides an overarching statement for decision makers to protect and improve ancient and native woodland and ancient and veteran trees which will be delivered through other current and future policy."
        },
        {
            "heading": 2,
            "text": "What’s new?"
        },
        {
            "text": "Defra have refreshed the whole policy to reflect the importance of ancient and native woodlands and ancient and veteran trees, some of the key updates include:"
        },
        {
            "text": "There is also a series of actions that government is taking to better protect and improve our ancient and native woodlands and trees over the coming years."
        },
        {
            "heading": 2,
            "text": "Working together to protect and improve these valuable habitats"
        },
        {
            "text": "Keepers of Time has always been a policy statement which holds great value to key partners, stakeholders and policy makers alike. It was important that as part of this revision, Defra and Forestry Commission continued to work closely with these groups to make sure that value was retained. While the Forestry Commission led the review, they worked hand in hand with colleagues in Defra and Natural England, across other government departments and engaged closely with others including the Woodland Trust."
        },
        {
            "text": "A spokesperson for Natural England said"
        },
        {
            "text": "A spokesperson for the Woodland Trust said"
        },
        {
            "heading": 2,
            "text": "The Queen’s Green Canopy"
        },
        {
            "text": "Our commitment to protect and improve these important trees and woodlands was showcased recently as part of The Queen’s Green Canopy (QGC). His Royal Highness The Prince of Wales unveiled a nationwide network of 70 Ancient Woodlands and 70 Ancient Trees to be dedicated to Her Majesty in celebration of the Platinum Jubilee."
        },
        {
            "text": "By sharing the stories behind the ancient woodlands and trees, as well as the incredible efforts that are made to protect them, The Queen’s Green Canopy aims to raise awareness of these treasured habitats and the importance of conserving them for future generations."
        },
        {
            "text": "Included in the 70 ancient woodland and trees dedicated to Her Majesty are the following sites:"
        }
    ]
}