{
    "url": "https://defrafarming.blog.gov.uk/2022/05/27/local-nature-recovery-in-2022/",
    "title": "Local Nature Recovery in 2022",
    "authors": [
        "Robert Munroe"
    ],
    "categories": [
        "Countryside Stewardship"
    ],
    "pub_date": "2022-05-27T13:06:48+01:00",
    "content": [
        {
            "text": "Local Nature Recovery is the improved and more ambitious successor to the Countryside Stewardship scheme in England."
        },
        {
            "text": "It will pay for locally-targeted actions to make space for nature in the farmed landscape and the wider countryside, alongside food production. These could be done, for example, on parts of the farm that are not suitable for production, less productive or difficult to work."
        },
        {
            "text": "Farmers will be able to have agreements that include options from Local Nature Recovery on top of standards in the Sustainable Farming Incentive. SFI will pay you for actions that you can take in the course of your farming – actions which will result in farmers collectively making a real difference to air quality, water quality, climate emissions and biodiversity; LNR is about making space for nature alongside food production."
        },
        {
            "text": "If you are interested in finding out how the Sustainable Farming Incentive will pay farmers and growers, read our post on how we designed the Sustainable Farming Incentive standards that are being released this year. On January 6 we provided an overview of the Local Nature Recovery scheme."
        },
        {
            "text": "In this post, we’ll provide further detail on what Local Nature Recovery will pay for and explain how we will be working with you over the course of the year to develop the detailed scheme design. Later this year, we will provide more information on other aspects of the scheme, including how we'll target actions to areas where they can make the most impact, and how we'll support farmers to work together across a local area."
        },
        {
            "heading": 2,
            "text": "What options will Local Nature Recovery pay for? "
        },
        {
            "text": "Local Nature Recovery will pay for options in a similar way to Countryside Stewardship. By the time that the scheme is rolled out (by the end of 2024), there will be a range of options available, which we are looking into paying for as set out below:"
        },
        {
            "text": "We will also continue to pay for heritage, access and engagement through our existing schemes, and consider how to maintain investment in these areas as part of future schemes."
        },
        {
            "text": "Some of the options will be based on what we already pay for through Countryside Stewardship. We’ll also be introducing new options to cover a wider range of activities and outcomes."
        },
        {
            "text": "The ongoing payments for these actions will all be complemented by appropriate capital item offers to support investment in creating or restoring habitats and other features."
        },
        {
            "heading": 2,
            "text": "Co-design in 2022"
        },
        {
            "text": "We need to ensure that the Local Nature Recovery scheme options (and the Sustainable Farming Incentive standards) we roll out work in practice and achieve the intended outcomes. This is why our approach to designing the options is centred around co-design."
        },
        {
            "text": "We want to offer options that are practical, clear, flexible and value for money. To achieve that, we are co-designing the scheme with farmers, land managers and other experts."
        },
        {
            "text": "We have formed practitioner discussion groups on themes which are based on the LNR options presented above and the SFI standards. The groups are looking at SFI and LNR together, so we can make sure the schemes work well together and people can have a good range of choices to suit their particular setting. We won’t be working on all the themes at once; we'll set these groups up sequentially to work through them a few at a time."
        },
        {
            "text": "If you would like to be involved, please sign up to take part in co-design. We’ll send email updates on the events taking place for your areas of interest."
        },
        {
            "heading": 2,
            "text": "Payment Rates"
        },
        {
            "text": "We'll also be developing payment rates for each of the options that are fair and attractive for farmers and land managers, and affordable and offer value for money for the public."
        },
        {
            "text": "We will set payments in line with the payment principles for our new environmental land management schemes that we published last year, and will fairly and effectively pay farmers, foresters, and other land managers for achieving environmental and climate outcomes."
        },
        {
            "text": "The payment rates will build on the updated payment rates for Countryside Stewardship that we announced earlier this year."
        }
    ]
}