{
    "url": "https://hmlandregistry.blog.gov.uk/2022/05/27/programme-to-help-proptech-and-geospatial-start-ups-wins-award/",
    "title": "Programme to help PropTech and geospatial start-ups wins award",
    "authors": [
        "Caroline Bray, HM Land Registry Geovation Stakeholder Manager"
    ],
    "categories": [
        "Data"
    ],
    "pub_date": "2022-05-27T12:09:51+01:00",
    "content": [
        {
            "text": "I have been lucky enough to work on the Geovation Accelerator Programme since 2017 as part of HM Land Registry’s involvement in the initiative, and was delighted when it won Accelerator Programme of the Year in the recent Go:Tech awards."
        },
        {
            "text": "The Go:Tech awards celebrate businesses and entrepreneurs who lead the way in technology and innovation across the UK. This is exactly what the Geovation programme aims to do, providing funding and support from both HM Land Registry and Ordnance Survey so PropTech and geospatial start-up firms can advance to the next level."
        },
        {
            "text": "So far 137 start-ups have been supported by Geovation, with more than 1,500 jobs created and £116 million in funding raised."
        },
        {
            "text": "I have worked with great community members and business founders during my time as part of the Geovation team. I have regular sessions with participants throughout their time on the programme covering what commercial data HM Land Registry has and how it might help them, introducing them to stakeholders and helping them understand our statutory services. The support doesn’t stop at the end of the programme as they remain members of Geovation. It’s the best role I have had in HM Land Registry and it’s very rewarding to see how the companies we have supported go from strength to strength."
        },
        {
            "text": "There have been many success stories along the way."
        },
        {
            "text": "Orbital Witness was part of our first cohort.  Their platform is used for due diligence in property transactions and they are already making tens of thousands of property transactions a year more efficient by giving lawyers and other professionals the technology they need to get the job done. Looking ahead, their goal is to make property radically more transparent, quick and easy to transact by replacing manual diligence with automated solutions."
        },
        {
            "text": "Sail Homes joined the Accelerator Programme in 2020. They help families going through probate to value and sell inherited properties and have been involved in more than 30,000 property sales."
        },
        {
            "text": "Sociability joined the cohort in October 2019. They launched an app which makes it quick, easy and free to find detailed and reliable accessibility information, helping disabled people find accessible places and enjoy greater social inclusion. Sociability also helps businesses better appreciate which barriers they have, what problems they’re creating and how to fix them. So far, 4,000 venues are profiled on the app."
        },
        {
            "text": "Start-ups who are successful in being chosen to take part in the Geovation programme receive financial support, worth more than £100,000. This includes grant funding,  a 12-month residency in the data hub, intensive support from industry experts, workshops, coaching and access to the latest location and property data from Ordnance Survey and HM Land Registry. At the end of the first 6 months the start-ups take part in a showcase/demo day where they pitch to potential investors and stakeholders."
        },
        {
            "text": "Applications for the next cohort will go live in the summer and I can’t wait to start the cycle once again with the new participants in October."
        }
    ]
}