{
    "url": "https://ipa.blog.gov.uk/2022/05/27/shared-parental-leave-this-can-work-successfully-at-a-senior-level/",
    "title": "Shared parental leave: 'This can work successfully at a senior level'",
    "authors": [
        "laurenvamplew"
    ],
    "categories": [
        "Diversity & Inclusion"
    ],
    "pub_date": "2022-05-27T13:27:51+01:00",
    "content": [
        {
            "text": "This blog is part of the Infrastructure and Project Authority’s Role Models Campaign, which aims to increase diversity at all grades in the Project Delivery Profession. "
        },
        {
            "text": "Zach Cashin is the Deputy Director and the Head of the Project Delivery Profession at the Department for International Trade. Zach began his career in the Civil Service over 17 years ago as an AO. He then applied to work on a government project and since has worked on all scales and types of projects and programmes, having recently spent time heading up major portfolios in the Ministry of Justice, Her Majesty’s Prison & Probation Service and now at the Department for International Trade."
        },
        {
            "text": "New role, new kid"
        },
        {
            "text": "When I began my role as Deputy Director and Head of Project Delivery Profession at the Department of International Trade, I was still fairly new when I explained to my director that I would like to take four months of shared parental leave, in two blocks in the coming year or so, following the birth of my son. This was a real test of a new manager, and also of an organisation’s culture. The department passed the test with flying colours, allowing me this time and I felt very supported throughout."
        },
        {
            "text": "My daughter was born three years earlier, and I took shared parental leave at that point as well - three months at the same time as my partner, straight after my daughter was born and then a month on my own with her when she was ten months old. I feel privileged to have been able to do this, the first three months were simply supporting, as we tried to figure out which way was up. The last month, however, was me on my own. It was daunting, but I really loved it."
        },
        {
            "text": "This time round we shortened my first stint, taking two months straight after my son’s birth and I will take another two months on my own with him when he is nine/ten months old, later this year. I am still daunted, but really looking forward to having this time, especially if the weather holds out and we get time in the garden!"
        },
        {
            "text": "Work set-up"
        },
        {
            "text": "I felt as a Senior Civil Servant it was important to demonstrate the Civil Service cultural values that we promote. I already do compressed hours, which has meant more time than I could have hoped for (or just occasionally more than I wanted!) with my kids. But for me, shared parental leave seemed like a no-brainer - I get time with my kids at an important point in their development."
        },
        {
            "text": "My director and I decided we would run a formal expression of interest to cover my role. This was important to me as I felt it would mean a good opportunity for someone, but also ensure that they had the right autonomy and authority to operate while I was off. Once this process had concluded, I spent a lot of time with the individual to make the handover as smooth as possible. I had some ‘keep in touch’ (KIT) days, but not many as I wanted to focus on my family while equally not making my cover feel they had to run things past me."
        },
        {
            "text": "The Department for International Trade moves quickly, which I actually think reduced the anxiety of coming back to a differing landscape -as you are kind of used to it. I am sure it is the same for many across departments. Once back, it was a process of prioritisation to get back up to speed and balance the current asks, but like an annual leave break, you find a way through, and you build up your knowledge as you go. For the individual who covered for me, it was also an excellent opportunity for them to further their career."
        },
        {
            "text": "Overall"
        },
        {
            "text": "I am pleased to have taken the time both from a family point of view and also from a work angle. This can work successfully at a senior level and hope that this makes others feel more empowered to explore shared parental leave."
        },
        {
            "text": " "
        }
    ]
}