{
    "url": "https://educationhub.blog.gov.uk/2022/05/27/simplifying-and-improving-apprenticeships-what-this-means-for-you/",
    "title": "Simplifying and improving apprenticeships – what this means for you",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Apprenticeships"
    ],
    "pub_date": "2022-05-27T16:35:31+01:00",
    "content": [
        {
            "text": "Apprenticeships help people of all ages to develop the skills and experience they need to secure great careers in a wide range of industries."
        },
        {
            "text": "Because apprenticeships are designed by employers it means you will be learning the specific skills that businesses need, so you can be confident your apprenticeship will set you on a path to success."
        },
        {
            "text": "To support more people to take advantage of apprenticeships from August 2022 we are introducing some improvements to the system."
        },
        {
            "text": "Here’s what this means."
        },
        {
            "heading": 3,
            "text": "We are making sure all apprentices receive the same amount of on-the- job training"
        },
        {
            "text": "Your apprenticeship will be a mix of on-the-job training with your employer and off-the-job training, which will be delivered by your apprenticeship training provider such as your local college, or university and may be undertaken at your  place of work or away from the workplace."
        },
        {
            "text": "However, we know that some apprentices who work longer hours in their job will be doing more off-the-job training than others doing the same apprenticeship ."
        },
        {
            "text": "To make it simpler, fairer and to create a level-playing field for apprentices, we are introducing a minimum number of hours. Any apprentice starting their apprenticeship after 1st August will as a minimum undertake 6 off-the-job training hours each week."
        },
        {
            "heading": 3,
            "text": "We are making it easier for people to complete apprenticeships more quickly "
        },
        {
            "text": "If you have already gained certain qualifications, skills or experience, we are strengthening the rules so that you won’t need to redo previous learning that is part of your apprenticeship. This means that you may be able to complete your  apprenticeship more quickly. Although this must be at least 12 months in duration."
        },
        {
            "text": "Your training provider will make an assessment based on your previous experience and qualifications and adapt your training. This means that apprentices can spend more time in the workplace and will become fully competent sooner, boosting employer productivity and apprentices’ own earnings potential.  "
        },
        {
            "heading": 3,
            "text": "We are removing the requirement for thousands of apprentices to have to take Level 2 English and maths tests"
        },
        {
            "text": "Under the current rules an apprentice who starts a Level 2 (L2) apprenticeship and does not have a Level 1 (L1) English or maths qualification is required to attempt L2 English and Maths tests to complete their apprenticeship."
        },
        {
            "text": "From August 2022, they will no longer need to study for and take L2 English and Maths tests in order to complete their apprenticeship, meaning thousands of L2 apprentices can focus on securing a L1 English and Maths qualification with only those who are really ready to take the L2 tests attempting them towards the end of their apprenticeship."
        }
    ]
}