{
    "url": "https://insidedio.blog.gov.uk/2022/05/27/state-of-the-art-range-tower-delivers-improved-facilities-for-training-troops/",
    "title": "State of the art range tower delivers improved facilities for training troops",
    "authors": [
        "John Shippen"
    ],
    "categories": [
        "Castlemartin Training Area",
        "Defence Training Estate (DTE)",
        "Military Training"
    ],
    "pub_date": "2022-05-27T11:40:46+00:00",
    "content": [
        {
            "text": "A new state of the art range tower at Castlemartin Range in Pembrokeshire will secure the future for the delivery of tri-service training at Castlemartin."
        },
        {
            "text": "Castlemartin Training Area is large enough for live-firing, tactical battlegroup-level exercises involving multiple Armoured Fighting Vehicles (AFV). The delivery of the new range tower, along with future upgrades to the site, is an important project for DIO which enables Castlemartin to remain as a key military training site over the coming years."
        },
        {
            "text": "With the changes in Regular Army Basing and the increase in UK based troops, core sites such as Castlemartin will be used significantly more in the future and, in turn, require improved facilities to retain full training capability for units within the UK."
        },
        {
            "text": "To​ support pre-deployment training using Armoured Fighting Vehicles, all range towers need to be suitable for increasing levels of use, as they are essential to ​ensuring troops have a safe environment in which to train. The existing range towers, on Range Two and Range Five, were at the end of their life and needed replacing; tower two is the first to be replaced in this programme."
        },
        {
            "heading": 2,
            "text": "State of the art design and construction  "
        },
        {
            "text": "The current range towers were designed to be used by the Army of the 1970s​ and forty years on, the towers are no longer fit for purpose. With the advances in communication technologies and sighting systems, a larger workspace is required within the range tower to allow more room for visiting troops to be able to operate efficiently and effectively​, and to allow more space for Landmarc's Training Area Operatives (TAOs) to operate the range targetry system together with the visiting unit."
        },
        {
            "text": "The new range tower under construction in 2021. [Landmarc Support Services]The tower was specifically designed by contractors, Jubb, and architects, Bailey Partnership, to reflect the requirement for a modern and robust facility to operate in a remote and challenging environment. The tower at Castlemartin has three floors, with access to the building and ablutions on the lower floor, a large viewing area on the first floor and the control room on the second floor. The roof of the tower houses the communications aerials, photovoltaic (PV) system and serves as an additional viewing area."
        },
        {
            "text": "The viewing area on the second floor can accommodate 12 to 15 people with the control room on the second floor comprising two areas: one for up to two TAOs and one for up to five individuals from the exercising unit. The control area also has large windows suitable for viewing the firing lanes and targets that the TAOs and Range Control Officers (RCO) are responsible for."
        },
        {
            "heading": 2,
            "text": "Sustainability built-in "
        },
        {
            "text": "The tower has achieved a DREAM rating of Excellent. DREAM stands for Defence Related Environmental Assessment Methodology, which is an environmental assessment tool for new build and refurbishment projects. This rating is thanks to a number of energy​-saving measures that have been incorporated, including the use of PV roof panels to supplement the building's energy requirements, which are helping to improve the carbon efficiency of the building. Local labour was also used to construct the tower and sustainable procurement measures were used to purchase the materials."
        },
        {
            "heading": 2,
            "text": "Successful completion despite significant challenges "
        },
        {
            "text": "Work started on the facility in January 2021 by our Construction Contractor, Trueform Ltd, who specialise in reinforced concrete structures. However, there were significant challenges with supply chain availability caused by the pandemic, which unfortunately led to some delays. This was also impacted by the need to deliver and commission the new tower and transfer all the communications from old to new before Exercise Iron Storm, which ​started on 10 September 2021. I'm pleased to say that this was achieved."
        },
        {
            "text": "Major John Poole, Senior Training Safety Officer at Castlemartin, ​who we worked closely with on this project, described the new tower as “superb”. He ​said ​that it now offers visiting units a much more modern environment to operate within, ​and that with all the technical advances the British Army is seeing, ​troops bring lots of extra equipment with ​them and this needs space. ​He also said that the tower also provides an excellent facility to hold daily conferences or debriefs as the day progresses."
        },
        {
            "text": "We're really pleased that DIO is happy ​with the new tower and we are looking forward to ​working with them to deliver another tower at Range Five, planned to commence early October 22."
        }
    ]
}