{
    "url": "https://ipo.blog.gov.uk/2025/09/18/back-to-school-with-young-ip-trailblazers/",
    "title": "Back to school with young IP trailblazers",
    "authors": [
        "Amber Ockenden"
    ],
    "categories": [
        "Innovation",
        "Patents",
        "Schools",
        "STEM career"
    ],
    "pub_date": "2025-09-18T14:45:00+01:00",
    "content": [
        {
            "text": "As students across the UK sharpen pencils and zip up backpacks, it’s a great time to celebrate the creativity and curiosity that fuels innovation, even in the youngest minds. At the Intellectual Property Office, we know that intellectual property (IP) isn’t just for seasoned inventors and entrepreneurs - it’s for anyone with a bright idea. And sometimes, those ideas come from children who haven’t even finished primary school! "
        },
        {
            "text": "Here are some inspiring young inventors who didn’t just dream big - they protected their ideas through IP."
        },
        {
            "heading": 3,
            "text": "Sam Houghton – the Improved Broom"
        },
        {
            "text": "Patent GB2438091A "
        },
        {
            "text": "At just five years old, Sam Houghton became a patent holder with his invention: the Improved Broom. It featured two broom heads joined by a rubber band, allowing it to sweep up both large and small debris more efficiently.  "
        },
        {
            "text": "Sam’s idea came to life when he was just three, watching his dad clean the garden. With a little help from his father, who happened to be a patent attorney, Sam’s invention was filed and granted a patent. His story became a cornerstone of our Cracking Ideas campaign, showing how even very young children can have ideas can be worth protecting.  "
        },
        {
            "text": "You can read more about Sam in this BBC article "
        },
        {
            "heading": 3,
            "text": "Xanthippe Barnes – RoboSno  "
        },
        {
            "text": "Patent GB2588732  "
        },
        {
            "text": "When eight-year-old Xanthippe Barnes took part in a school design challenge, she didn’t just build a model - she created a fully imagined snow-clearing robot called RoboSno. It featured a kettle to melt snow, machine learning to navigate, and even a boot to kick obstacles out of the way. "
        },
        {
            "text": "Her invention was so compelling that her father (also a patent attorney) helped her file a patent application and register a trademark for the name. Xanthippe proved that school projects can be the launchpad for real-world innovation. "
        },
        {
            "text": "You can read more about Xanthippe on this blog from the Chartered Institute of Patent Attorneys "
        },
        {
            "heading": 3,
            "text": "Soren Plante – Guinness World Record holder   "
        },
        {
            "text": "Patent US12290017B2 "
        },
        {
            "text": "Across the pond in Utah, USA, Soren Plante holds the Guinness World Record as the youngest active patent holder, receiving his patent at just 5 years and 190 days old. His invention? A gardening robot that’s not only electro-mechanical but also commercially viable. "
        },
        {
            "text": "The invention describes a digging machine with a hollow body, odd-shaped wheels, and independent motors powering each wheel. These wheels feature digging members, making the machine suitable for tasks like gardening or excavation. "
        },
        {
            "text": "Soren’s story is a testament to how curiosity, play, and a little technical know-how can lead to serious innovation - even before starting primary school. "
        },
        {
            "heading": 3,
            "text": "Max Palfrey - Dragons' Den hopeful "
        },
        {
            "text": "Patent GB2617627 "
        },
        {
            "text": "Another young inventor, 11 year old Max, was granted a patent for a garment with a built-in fidget device sewn into the seam (similar to bubble wrap toys).  "
        },
        {
            "text": "The invention was aimed at neurodiverse people as it would allow them to discreetly engage in stimming activities (repetitive physical movements, sounds or actions that help individuals self-regulate emotions and process sensory input), without drawing attention to themselves.  "
        },
        {
            "heading": 3,
            "text": "Inspiring creativity through partnership "
        },
        {
            "text": "Our commitment to nurturing young innovators extends through exciting collaborations that bring IP education to life. Building on the tremendous success of our previous campaigns with Aardman, or our recent and current campaign with Taskmaster Education, these collaborations have been a remarkable achievement in making intellectual property accessible and engaging for students across the UK, including resources for IP in education."
        },
        {
            "text": "These partnerships demonstrate our unwavering belief that inspiring the next generation starts with young minds and our enthusiasm for fostering creativity knows no bounds. Through innovative educational approaches, we continue to show children that their ideas really do have value and can shape the world around them.  "
        }
    ]
}