{
    "url": "https://mhclgdigital.blog.gov.uk/2025/09/18/building-understanding-of-software-markets-in-local-government/",
    "title": "Building understanding of software markets in local government",
    "authors": [
        "The Local Digital team"
    ],
    "categories": [
        "Local Digital"
    ],
    "pub_date": "2025-09-18T15:06:22+01:00",
    "content": [
        {
            "text": "Over the past six months, we’ve been developing our understanding of local government software markets. This work aims to address the concerns raised by councils through our programme’s evaluation and highlighted in the Future Councils pilot report. "
        },
        {
            "text": "Common issues include:  "
        },
        {
            "text": "We’ve also identified through roundtable discussions and feedback from partners that managing effective procurements and successfully exiting technology contracts is a challenge, particularly where internal capacity or capability is limited. "
        },
        {
            "text": "With local government reorganisation, new unitary authorities will need to consolidate systems, migrate data, and harmonise business processes at an unprecedented scale. This will also impact technology contracts and procurement activities. "
        },
        {
            "heading": 2,
            "text": "Our approach to supporting better procurement decisions"
        },
        {
            "text": "To help councils operate as intelligent buyers and support suppliers to meet sector ambitions, we are developing a software market intelligence tool.  "
        },
        {
            "text": "As a starting point, the Local Digital team have analysed publicly available contract data for six key service areas. This has helped us assess: "
        },
        {
            "text": "We’ve turned this analysis into an interactive dashboard. Our ambition is to evolve this into a tool that the sector can use to improve transparency and make more informed procurement decisions.  "
        },
        {
            "text": "You can preview the first iteration of the dashboard: "
        },
        {
            "text": "Access our guidance note on the software market intelligence tool."
        },
        {
            "heading": 2,
            "text": " Get involved"
        },
        {
            "text": "Councils are invited to help shape the software market intelligence tool through short virtual research session. This involves: "
        },
        {
            "text": "Once you have submitted the form, a researcher will contact you (if places are still available) to schedule your session. We will close the form once capacity is reached. We may add additional sessions in the future. "
        },
        {
            "text": "Follow our channels for the latest updates and opportunities:  "
        }
    ]
}