{
    "url": "https://defrafarming.blog.gov.uk/2025/09/18/csht-opens-for-applications/",
    "title": "CSHT opens for applications ",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Countryside Stewardship",
        "environmental land management schemes"
    ],
    "pub_date": "2025-09-18T10:05:04+01:00",
    "content": [
        {
            "text": "From today (18 September 2025), eligible farmers, foresters and land managers who’ve received pre-application advice and completed any necessary preparatory works will be invited, on a rolling basis, to apply for Countryside Stewardship Higher Tier (CSHT) online.   "
        },
        {
            "text": "We’re launching the CSHT scheme through a controlled rollout in 2025 and 2026. This means that for now, access is by invitation only.  "
        },
        {
            "text": "This makes sure the service runs smoothly and that the right support is in place for those applying.  "
        },
        {
            "text": "Since January, more than 1,500 people have already been invited to receive pre-application advice from Natural England and the Forestry Commission."
        },
        {
            "text": "The first invitations for pre-application advice went to farmers with CSHT agreements ending in 2025, those with an approved woodland management plan and those applying for an agri-environment agreement who already have a plan in place. "
        },
        {
            "text": "If you’ve completed your pre-application advice the Rural Payments Agency (RPA) will send you an email inviting you to start your CSHT application. "
        },
        {
            "text": "Invitations are being sent out in phases as the scheme is rolled out. The RPA will contact you when it’s your turn to apply. You do not need to contact RPA to check."
        },
        {
            "heading": 2,
            "text": "A new and improved offer "
        },
        {
            "text": "CSHT supports a wide range of land types, including woodlands, farmed land, areas managed for nature, Sites of Special Scientific Interest, commons, and scheduled monuments.  "
        },
        {
            "text": "The new CSHT offer includes: "
        },
        {
            "text": "CSHT agreements can last for 5, 10, 15 or 20 years, depending on the actions included. Agreements can also include capital items, which must be completed within three years of the agreement start date.  "
        },
        {
            "text": "Last week, we published updated CSHT guidance on GOV.UK. "
        },
        {
            "text": "This includes the scheme’s terms and conditions and a link to the 'Find funding for land or farms' tool. "
        },
        {
            "text": "The 'Find funding for land or farms' tool has been refreshed and now includes all CSHT actions and supplements to help you plan your application. "
        },
        {
            "heading": 2,
            "text": "Capital grant plans "
        },
        {
            "text": "Before you apply for woodland management or agroforestry actions under CSHT, you’ll need a plan approved by the Forestry Commission. "
        },
        {
            "text": "This means having either: "
        },
        {
            "text": "You may need a species management plan, depending on the actions you choose. "
        },
        {
            "text": "Each CSHT action sets out whether a plan or feasibility study is needed as part of the pre-application process. You can check this using the 'Find funding for land or farms' tool."
        },
        {
            "text": "Capital Grant funding is available to help you prepare these plans. For full details, see the CSHT guidance. "
        },
        {
            "heading": 2,
            "text": "How to apply  "
        },
        {
            "text": "If you’ve been invited to apply, you’ll have the option to start your CSHT application in the Rural Payments service.   "
        },
        {
            "text": "Before applying, make sure you have an account in the Rural Payments service and the correct permission to apply. You can find guidance on how to check this in the CSHT guidance. "
        },
        {
            "text": "In the service, select the CSHT actions and capital items that your land is eligible for. These should match what you agreed with your adviser during your pre-application advice, or the recommendations in your invitation email.   "
        },
        {
            "text": "Once you’ve added all actions and items, your application will be reviewed by Natural England or the Forestry Commission. You may need to submit supporting maps and quotes at this point. You may be asked to provide additional supporting documents, such as business viability information, when you submit your application or receive an offer. "
        },
        {
            "text": "After the review, Natural England or the Forestry Commission will either ask you to make changes or they will approve your application."
        },
        {
            "text": "When the review is complete and any changes have been made, you can submit your application. You’ll need to provide the RPA with any supporting evidence.    "
        },
        {
            "text": "After the RPA has carried out its checks, you’ll receive an agreement offer in the Rural Payments service. You must accept this offer before your agreement can start. "
        },
        {
            "heading": 2,
            "text": "Next steps  "
        },
        {
            "text": "CSHT is part of the government’s £11 billion plan to support sustainable farming and food production over this parliament. Funding for environmental land management schemes, including CSHT, will increase by 150% to £2 billion by 2029."
        },
        {
            "text": "This investment underlines the government’s commitment to protecting the environment and supporting farming communities, as set out in the Plan for Change.  "
        },
        {
            "text": "Invitations to apply will continue to be issued on a rolling basis to those who have completed pre-application advice.   "
        },
        {
            "text": "We know some people who would like to apply are not yet able to. Work is underway to plan the next phase, including identifying which groups will be invited, and we’ll share more details as soon as possible. "
        },
        {
            "text": "Details of webinars will follow."
        },
        {
            "text": "Subscribe to the Farming Blog to get a notification whenever a new post is published."
        }
    ]
}