{
    "url": "https://enablingdigitalidentity.blog.gov.uk/2025/09/18/how-ofdia-is-driving-adoption-of-secure-digital-verification-services/",
    "title": "How OfDIA is driving adoption of secure digital verification services",
    "authors": [
        "Adele Kersey"
    ],
    "categories": [
        "Digital identity"
    ],
    "pub_date": "2025-09-18T09:19:56+01:00",
    "content": [
        {
            "text": "Whether applying for a credit card or starting a new job, digital verification services (DVS) are already saving people and businesses time and money. But to make sure the benefits of DVS are realised in sectors right across the economy, OfDIA is working to unlock new opportunities. "
        },
        {
            "heading": 2,
            "text": "How we prioritise use cases "
        },
        {
            "text": "How many times have you wished you could prove something about yourself without digging out your old documents or standing in a queue? We know there are hundreds of use cases that could benefit from adopting DVS, but without unlimited resources, we had to figure out where to focus our effort to remove barriers and boost adoption.  "
        },
        {
            "text": "We consider three main factors: "
        },
        {
            "heading": 2,
            "text": "What we have done so far "
        },
        {
            "text": "We’ve already taken some big steps towards our goal of widespread adoption of digital identities, for example in the employment sector. "
        },
        {
            "text": "If you've started a new job recently, you might have noticed that you didn't need to turn up to your new workplace with your passport, and instead, you might have completed a quick and simple digital ID check through a certified DVS. "
        },
        {
            "text": "Hiring and onboarding new employees is an area of the economy where secure use of DVS is already speeding things up, saving people and businesses time and money. When the Covid-19 pandemic caused a rapid rise in remote working, increasing the demand for digital checks, we worked closely with the Home Office to change UK legislation, allowing digital verification for Right to Work (RTW) and Disclosure and Barring Service (DBS) checks.  "
        },
        {
            "text": "Now, we see millions of secure and privacy preserving digital RTW and DBS checks taking place each month, reducing time spent on these from days to just minutes, and getting new employees into new jobs much sooner. "
        },
        {
            "heading": 2,
            "text": "Keeping focused on the top priorities "
        },
        {
            "text": "Beyond employment, there are two other use cases which we are currently prioritising: age verification and financial services. "
        },
        {
            "text": "Age-restricted products and services have a clear regulatory driver for age checks, with digital verification offering potentially huge efficiency savings for businesses as well as a better experience for customers. It’s also a sector where both relying parties and DVS have clamoured for change and demonstrated solutions which, once barriers are removed, could be implemented quickly.  "
        },
        {
            "text": "Earlier this year, the Home Office announced they would be updating the law to allow for the use of DVS for alcohol purchases in England and Wales. We expect changes to be in place by the end of the year, and are currently focusing our efforts on the requirements, to keep these checks safe and secure. You can read our blog post on using a digital identity to buy alcohol safely and securely to find out more. "
        },
        {
            "text": "But we are not stopping with alcohol. The upcoming legal changes provide an ideal opportunity to drive the adoption of DVS for other age restricted goods. After all, once people can use their digital ID to buy a bottle of wine, they’ll expect it to have the same purchasing power for things like tobacco and vapes, fireworks or gambling. That’s why we are working across government to promote consistency across in the rules for the sale of other age restricted products.  "
        },
        {
            "text": "In parallel, we are also working hard to progress the adoption of DVS in financial services. This is also a highly regulated sector, with financial institutions required to undertake Know Your Customer (KYC) checks when onboarding new customers. There are also clear benefits to being able to ensure that payments have been authorised by the right person, without that person needing to visit their bank in person.  "
        },
        {
            "text": "To date, there has been a lack of clarity in the financial services industry as to how digital identities can be used to meet obligations under the Money Laundering Regulations (MLRs).  The government has committed to produce bespoke GOV.UK guidance on using DVS for MLRs identity verification checks. This guidance will provide clarity on the definition of a digital identity and give further detail on how trust framework certified DVS can be used in line with the MLRs’ risk-based approach. You can read more about this work in our previous blog post on trusted DVS in financial services. "
        },
        {
            "heading": 2,
            "text": "Keeping up momentum elsewhere "
        },
        {
            "text": "There are numerous other areas of the economy where DVS can play a transformative role. While our highest priority sectors are employment, age restricted products and financial services, we are also working to drive adoption across other areas of the economy, such as property and travel. We are continuing to work with government departments, regulators and sector representatives to remove barriers, and enable secure and robust checks. "
        },
        {
            "text": "If there are other areas which you think OfDIA should prioritise to help unlock progress, then let us know. "
        }
    ]
}