{
    "url": "https://companieshouse.blog.gov.uk/2025/09/18/louise-smyth-cbe-my-final-chapter-at-companies-house/",
    "title": "Louise Smyth CBE: my final chapter at Companies House ",
    "authors": [
        "Louise Smyth CBE - Chief Executive and Registrar of Companies for England and Wales"
    ],
    "categories": [
        "Companies House transformation",
        "Working at Companies House"
    ],
    "pub_date": "2025-09-18T10:50:00+01:00",
    "content": [
        {
            "text": "I joined Companies House as Chief Executive and Registrar of Companies for England and Wales in 2017, and it's been an honour and a privilege to hold that title.   "
        },
        {
            "text": "I felt truly at home when I arrived at Companies House 8 years ago. I knew straight away that it’s a fabulous organisation with lots of spirit, and full of brilliant people delivering excellent services.   "
        },
        {
            "text": "Through all the twists and turns of the last 8 years, those brilliant people have been the golden thread.  "
        },
        {
            "text": "There are a few achievements that stand out for me over the last few years and show how far we’ve come as an organisation.  "
        },
        {
            "heading": 2,
            "text": "Launching the Register of Overseas Entities  "
        },
        {
            "text": "We launched the Register of Overseas Entities in August 2022, just 3 months after the Economic Crime (Transparency and Enforcement) Act received royal assent following the Russian invasion of Ukraine. We had a lot of work to do in a very short space of time, and everyone pulled together to deliver the new register. "
        },
        {
            "text": "The register is a key part of the government’s strategy to tackle global economic crime, and I’m particularly proud that we received an Innovation Excellence award from the Corporate Registers Forum for this work.  "
        },
        {
            "heading": 2,
            "text": "Implementing the Economic Crime and Corporate Transparency Act  "
        },
        {
            "text": "2024 was a hugely important year in our long history with the implementation of our new and enhanced powers under the Economic Crime and Corporate Transparency (ECCT) Act.  "
        },
        {
            "text": "I’m so proud of the way we’ve transformed since bringing in the Act. We've stepped up to our new role in disrupting economic crime and preventing abuse of the register, while supporting economic growth and ease of doing business in the UK. We're making progress in moving from a passive registry to an active gatekeeper, and we’re already seeing real-world impacts.  "
        },
        {
            "heading": 2,
            "text": "CBE (Commander of the Order of the British Empire) "
        },
        {
            "text": "In December 2024, I was deeply honoured to receive a CBE in the King's New Year Honours list for services to public life and the economy.  "
        },
        {
            "text": "This recognition reflects the collective achievements of my brilliant colleagues at Companies House, and our dedication to delivering high quality public services. I was so proud to receive this honour during my final year at Companies House. "
        },
        {
            "heading": 2,
            "text": "Platinum Investors in People awards  "
        },
        {
            "text": "In August 2025, we achieved the platinum ‘we invest in wellbeing’ award from Investors in People. We also retain the platinum ‘we invest in people’ award – something only achieved by 3% of employers. I’ve always championed a culture where people can bring their whole selves to work, and this is a special achievement that’s very close to my heart. "
        },
        {
            "heading": 2,
            "text": "Handing over to my successor   "
        },
        {
            "text": "As I prepare to retire and hand over to my successor, Andy King, I'm so proud of everything we've achieved together at Companies House. These achievements do not happen without a lot of hard work and determination, and the brilliant people I've worked with over the last 8 years have shown resilience, innovation and commitment.  "
        },
        {
            "text": "The scale of our responsibility continues to grow. More than 5.4 million limited companies are now registered in the UK, with more than 500,000 new companies incorporated each year.  "
        },
        {
            "text": "These numbers represent real businesses, real entrepreneurs, and real economic activity that we're here to support and protect. My main ambition has always been to make changes that make a real difference to people’s lives and livelihoods. I'm looking forward to handing over to Andy, knowing he'll inherit an exceptional team of people with that same ambition to make a difference.   "
        },
        {
            "text": "I have complete confidence that Companies House will continue to evolve and adapt, supporting economic growth while making the UK an increasingly difficult place for those looking to commit economic crime.   "
        },
        {
            "text": "As I move ahead to my next chapter, I’ll never forget my time at Companies House – it'll always have a special place in my heart.  "
        }
    ]
}