{
    "url": "https://nationalscreening.blog.gov.uk/2025/09/18/partnership-board-updated-on-work-to-review-evidence-for-sma-newborn-screening/",
    "title": "Partnership board updated on work to review evidence for SMA newborn screening",
    "authors": [
        "Jo Harcombe"
    ],
    "categories": [
        "Newborn Blood Spot Screening",
        "Uncategorized"
    ],
    "pub_date": "2025-09-18T11:56:15+01:00",
    "content": [
        {
            "text": "Last month, we published a suite of 4 documents relating to the UK National Screening Committee’s (UK NSC’s) review of evidence on newborn screening for spinal muscular atrophy (SMA)."
        },
        {
            "text": "One of the documents was the brief report that concluded that an in-service evaluation (ISE) is still needed to answer questions about the feasibility, acceptability, effectiveness, and cost effectiveness of SMA screening in real world NHS services."
        },
        {
            "text": "The UK NSC SMA ISE Partnership Board oversees the development of the ISE and provides reports and advice to the UK NSC via the Fetal, Maternal and Child Health (FMCH) expert reference group."
        },
        {
            "text": "The partnership board is responsible for the design and delivery of high-quality evidence on the feasibility, acceptability, cost, and clinical effectiveness of newborn screening for SMA. It includes screening experts from the 4 UK governments and NHS, organisations with a shared interest in newborn screening for SMA, clinicians, academics, genomic experts and patient and public voice members."
        },
        {
            "text": "Three sub-groups report to the partnership board: the clinical pathway sub-group, data and methodology sub-group, and laboratory sub-group."
        },
        {
            "text": "At its most recent meeting, the UK NSC SMA ISE Partnership Board was updated on the following activities."
        },
        {
            "heading": 2,
            "text": "NIHR research call"
        },
        {
            "text": "The National Institute for Health and Care Research (NIHR) advertised its Health Technology Assessment (HTA) research brief  for the SMA screening ISE in May.  "
        },
        {
            "text": "NIHR hosted a workshop in July for applicants to gain a deeper understanding of the requirements of the project. Applicants were encouraged to seek advice from a clinical trials unit on methodology in rare disease research."
        },
        {
            "text": "NIHR outlined the following timetable for bids:"
        },
        {
            "heading": 2,
            "text": "NHS England preparations"
        },
        {
            "text": "The NHS England (NHSE) screening team updated the board on its extensive preparatory work for the ISE."
        },
        {
            "text": "This work includes aligning several key workstreams including the spending review, the National Institute for Health and Care Excellence (NICE) managed access agreement for 2 SMA treatments, laboratory contracts, laboratory preparations, test methodology considerations and IT developments."
        },
        {
            "text": "All this work needs completing in preparation for adding SMA to the end-to-end, safely managed newborn blood spot (NBS) screening pathway. The NHSE team now plans to establish an implementation group to oversee this activity."
        },
        {
            "text": "This is taking place at the same time as NHSE prepares for the addition of hereditary tyrosinaemia type 1 and the extension of the ISE for severe combined immunodeficiency (SCID) in the NBS screening programme."
        },
        {
            "heading": 2,
            "text": "Clinical pathway sub-group"
        },
        {
            "text": "The clinical pathway sub-group  is tasked with defining the SMA screening pathway, up to the point of treatment."
        },
        {
            "text": "The group is exploring professional endorsement for the clinical pathway via a professional body."
        },
        {
            "text": "An important element of the clinical pathway group’s work is the development of SMA screening information for parents, the public and healthcare staff. The board was updated on the outputs from a task and finish group that has now developed draft SMA information for parents and professionals to support the ISE."
        },
        {
            "text": "This draft content includes pre-screening information for parents, a check list for staff before the first phone call to parents, text for follow-up emails, and staff training slides. These resources have been circulated to the board members. The content will be developed further and user-tested before being finalised so that it can sit alongside existing NBS screening programme resources."
        },
        {
            "text": "Parents, people with SMA and healthcare staff will continue to be actively involved in the development of these materials."
        },
        {
            "heading": 2,
            "text": "Data and methodology sub-group"
        },
        {
            "text": "The data and methodology sub-group contributed to the HTA research commissioning brief."
        },
        {
            "text": "Following the completion of this work, the sub-group chair discussed the need for the group to review its membership and terms of reference in preparation for providing oversight to the ISE and monitoring milestones."
        },
        {
            "heading": 2,
            "text": "Laboratory sub-group"
        },
        {
            "text": "The laboratory sub-group continues its preparatory work and will meet again in October."
        },
        {
            "text": "All partnership board members were reminded of the importance of declaring any actual or potential conflicts of interest. Actions to mitigate conflicts of interest, if appropriate, are agreed in line with the UK NSC’s declarations of interest guidance."
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK NSC. You can register to receive updates direct to your inbox, so there is no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, please email uknsc@dhsc.gov.uk."
        }
    ]
}