{
    "url": "https://rpc.blog.gov.uk/2025/09/18/rpc-compares-the-quality-of-impact-assessments-submitted-by-government-departments/",
    "title": "RPC compares the quality of impact assessments submitted by government departments",
    "authors": [
        "Stephen Gibson"
    ],
    "categories": [
        "Better regulation",
        "Independent scrutiny"
    ],
    "pub_date": "2025-09-18T16:00:53+01:00",
    "content": [
        {
            "text": "The RPC reviews and rates the quality of impact assessments (IAs) of new regulations produced by government departments. As well as the headline ‘fit for purpose’ rating, we rate IAs across four areas: rationale and options; cost-benefit analysis; wider impacts; and monitoring and evaluation plans. Areas that are rated ‘Good’ or ‘Satisfactory’ provide good or sufficient support for decision-making on those areas of the assessment, while those rated ‘Weak’ or ’Very Weak’ provide inadequate support for decision-making."
        },
        {
            "text": "Our spreadsheet of past RPC opinions includes 174 IAs published since 2020[1]. This allows us to compare the performance of different government departments on aspects of the IA that are not part of the Red/Green ‘fit for purpose’ rating."
        },
        {
            "text": "Big quality differences between departments on IA ratings"
        },
        {
            "text": "Overall 72% of RPC ratings were either ‘good’ or ‘satisfactory’ (the remaining 28% being ‘weak’ or ‘very weak’)."
        },
        {
            "text": "However there were big differences between departments. Top performers were the Department for Business & Trade (DBT) and the Department for Culture, Media & Sport (DCMS), both having 79% rated as ‘good’ or ‘satisfactory’; the weakest performers were the Department for Education (DfE) and the Ministry for Housing, Communities & Local Government (MHCLG) with only 50% and 48% respectively of their ratings being above the line. This means that we judged over half of the assessed areas for those departments as inadequate to support decision-making."
        },
        {
            "text": "And big differences in the quality of IAs as first submitted"
        },
        {
            "text": "Where we judge that an IA as first submitted is not fit for purpose (and the department has submitted the IA early enough to allow resubmission), we can issue an Initial Review Notice (IRN). This means that the department has an opportunity to address the areas of concern and resubmit the IA for a further review."
        },
        {
            "text": "Again there was a big difference between departments on the proportion of IAs receiving an IRN. The department with the highest percentage of initially unsatisfactory IAs was HM Treasury with 60%, while the lowest percentages were DCMS with 13% and ‘top of the class’, the Foreign, Commonwealth & Development Office (FCDO) with no IRNs at all."
        },
        {
            "text": "[1] In May 2024, we published a spreadsheet and blog summarising our ratings of 142 IAs. We have now updated this to include an additional 32 IAs published over the last year."
        }
    ]
}