{
    "url": "https://hmlandregistry.blog.gov.uk/2024/07/24/asking-for-guidance-part-3-the-case-of-the-curious-caution/",
    "title": "Asking for guidance part 3: The case of the curious caution ",
    "authors": [
        "Mike Harrison, Senior Caseworker, Registration Services"
    ],
    "categories": [
        "Law and practice"
    ],
    "pub_date": "2024-07-24T14:10:20+01:00",
    "content": [
        {
            "text": "Approximately 65% of complex applications receive requisitions. This is because some points are hard to anticipate in advance and we are keen to work directly with customers to ensure everything is in place before we receive the application. "
        },
        {
            "text": "Our Ask for Guidance service provides expert assistance with complex applications, help to navigate through the registry processes, and support in avoiding unnecessary errors before lodging an application. "
        },
        {
            "text": "But customers often ask: what constitutes a ‘complex application’? In this series, we look at real examples of thorny issues that our experts have resolved. Previously, we explored unique restrictions and historic charges.  "
        },
        {
            "text": "In this case, we’ll explore a caution relating to tithes.  "
        },
        {
            "text": "A customer contacted us asking for guidance in respect of a rare caution affecting an old title.  "
        },
        {
            "text": "The land had been registered in 1920 and, as a result of statutory devolution, had vested in Cornwall Council. There had been no transfers of the property since first registration. "
        },
        {
            "text": "On inspecting the title register however, our customer had found reference to a caution but could not ascertain what it related to. They said they understood that the cautioner is now part of, or administered by, the Church Commissioners and assumed it to be a caution against dealings. "
        },
        {
            "text": "The customer had three questions: "
        },
        {
            "text": "Our caseworker accepted the request for guidance stating that, in her experience, cautions such as the one in question were entered to protect Tithe Redemption Annuities. She has set out a brief history below. "
        },
        {
            "heading": 2,
            "text": "Tithes, taxes and rentcharges"
        },
        {
            "text": "Up until the 19th century, tithes were a tax in kind levied on the occupier of land, whereby they yielded up one tenth of their crops or other produce for the support of the church and its clergy. "
        },
        {
            "text": "The Tithe Act 1918 (the 1918 Act) allowed landowners to convert tithe rentcharges into annuities under orders of the then Board of Agriculture and Fisheries (the Board). These annuities were capable of protection by a substantive charge, by a caution or by a notice. "
        },
        {
            "text": "In earlier centuries, efforts were made by individual occupiers to enter into voluntary agreements with tithe owners to convert tithes to a money payment - for example, by the creation of corn rents. "
        },
        {
            "text": "The Tithe Acts 1836 to 1891 introduced a statutory process for converting tithe to money payments. Called ‘tithe rentcharges’, these were annual rents in perpetuity secured on the land, with the landowner instead of the occupier being liable for payment. "
        },
        {
            "text": "Under s.4(2) of the 1918 Act, the landowner could apply to the Board for the perpetual rentcharge to be capitalised and converted into an annuity for a maximum term of 50 years. To do this, the Board made an Order that constituted a land charge and which, in the case of registered land, was capable of protection in the register either by substantive registration as a legal charge or by means of a caution or notice. "
        },
        {
            "text": "On 1 January 1926, under the Land Registration Act 1925, all payments and charges arising out of tithe rentcharges became overriding interests. On 22 February 1926, under s.20(1), Tithe Act 1925, the maximum period of duration of an annuity for the redemption of tithe rentcharge created under the 1918 Act was extended from 50 to 60 years.  "
        },
        {
            "text": "Tithe rentcharges were later abolished by the Tithe Act 1936, under which government stock was created and issued to the tithe owners by way of replacement, and provision was made for the payment of 60-year annuities by the landowners concerned. These annuities cannot be secured by charges on the land concerned and are thus not capable of registration in any form.  "
        },
        {
            "text": "As from 2 October 1977, all annuities charged under the Tithe Acts 1936 and 1951 were extinguished under s.56, Finance Act 1977. All of the annuities have now expired and any missed payments are likely to be statute-barred. "
        },
        {
            "heading": 2,
            "text": "So what happens now? "
        },
        {
            "text": "When we know that the caution definitely relates to tithe, we can cancel it without further consideration. The difficulty with the caution on the Council's title was that the statutory declaration in support of the caution (dating back to 1923) was missing from our file so we could not be sure. We therefore asked the customer to send us a CCD application, which would not need to be supported by any evidence.  "
        },
        {
            "text": "The registrar is only obliged to serve notice on the name and address of the cautioner as it appears in the register. The likelihood in a case like this is that the notice comes back undelivered and HM Land Registry simply waits for the notice period (15 business days) to run down to its deadline, after which the caution can be lifted. "
        },
        {
            "text": "The customer submitted a form CCD and was successful in having the entry removed. "
        },
        {
            "heading": 2,
            "text": "If in doubt… "
        },
        {
            "text": "This blog series is intended to show you how these kinds of applications can be handled, and also to detail the types of application which could be referred to our Ask for Guidance team.  "
        },
        {
            "text": "If you have a tricky question about a complex application that you’re about to submit, and you can’t find the answer in our practice guides, we would encourage you to use our Ask for Guidance service. If we are able to point you to existing guidance then we will, otherwise we will walk you through your particular issue and ensure your application is ready to submit."
        }
    ]
}