{
    "url": "https://dwpdigital.blog.gov.uk/2024/07/24/celebrating-success-this-awards-season/",
    "title": "Celebrating success this awards season",
    "authors": [
        "Richard Corbridge, CDIO, DWP Digital"
    ],
    "categories": [
        "Collaboration",
        "Digital transformation",
        "Digital With Purpose",
        "Diversity"
    ],
    "pub_date": "2024-07-24T08:23:24+01:00",
    "content": [
        {
            "text": "As CDIO for DWP Digital, it was a pleasure to welcome the new Secretary of State Liz Kendall and the DWP Ministerial team to our Leeds Digital Hub a few weeks ago to demonstrate our work and how we deliver for UK citizens.  "
        },
        {
            "text": "I’d like to take some time to celebrate what teams in DWP Digital have achieved. DWP Digital is not just a place to work, but a place to develop, innovate and make a real impact. "
        },
        {
            "heading": 2,
            "text": "Inclusive, flexible, and collaborative culture "
        },
        {
            "text": "DWP Digital won Company of the Year at the Women in Change awards, recognition for how we’re shaping a human-centred and inclusive culture, a place where everyone belongs and can be their best. The judges were impressed by implementation of a wide range of inclusion initiatives, including our Women in Digital network. I want to continue driving forward being inclusive by design as I embrace my role as Gender Champion.  "
        },
        {
            "text": "I’m pleased DWP Digital is the first government department to be recognised as a Platinum Partner with BCS, denoting our commitment to colleague development. In 2023, we started a professional journey with BCS and are now being recognised to have demonstrated the highest level of dedication to delivering talented, ethical, and dedicated professionals.   "
        },
        {
            "text": "We’ve had success for our early talent in the BCS IT & Digital Apprenticeship Awards, congratulations to Lorna winning Business Analysis Apprentice of the Year and Thomas; a T Level Student receiving Special Recognition. I look forward to seeing what you achieve in the future as you continue progressing in your career. "
        },
        {
            "heading": 2,
            "text": "Making an impact "
        },
        {
            "text": "Get Your State Pension was highly commended at the Computing Digital Technology Leaders awards, this service is an excellent example how to do end-to-end digital transformation that meets user needs, business goals and reimagines the whole experience and process across all channels. The service has over 90% Customer Satisfaction score supporting being rated “great” in the CDDO Top 75 services list. Congratulations to the GYSP team and all 8 teams who were nominated in these prestigious awards.  "
        },
        {
            "text": "I joined a panel at Civil Service Live to discuss scaling AI to deliver citizen-centric public services alongside Caroline Bellamy from MoD and Ming Tang from NHS England. I shared how we’re encouraging T Level students and apprenticeships to explore AI in their roles for diversity of thought and building the skills for the future.  "
        },
        {
            "text": "Civil Service Live brings together the public sector. It was an opportunity to foster cross government relationships, build networks, and promote how we’re exploring AI safely to an audience wider than digital departments. "
        },
        {
            "heading": 2,
            "text": "Personal recognition "
        },
        {
            "text": "I’ve been recognised for my role as CIO, highly commended at the Computing Digital Technology Leaders Awards, reaching number 3 on the Computer Weekly UKTech50 list and featuring in the Hot Topics Global CIO 100 list which is a real honour.  "
        },
        {
            "text": "DWP Digital colleagues’ collective efforts are the true driving force behind this recognition. Thank you to the team for making my role as CDIO the most rewarding and proudest of my career. This is a testament to the hard work, dedication, and innovation of the entire team. A CDIO is only as good as the team they are privileged to work with, and I’m incredibly fortunate to collaborate with such talented and committed colleagues. "
        }
    ]
}