{
    "url": "https://ssac.blog.gov.uk/2024/07/24/farewell-to-ssac/",
    "title": "Farewell to SSAC",
    "authors": [
        "Professor Gráinne McKeever"
    ],
    "categories": [
        "About the Committee",
        "Department for Communities (Northern Ireland)",
        "DWP",
        "Independent advice",
        "Legislation"
    ],
    "pub_date": "2024-07-24T14:09:24+01:00",
    "content": [
        {
            "text": "I joined the Social Security Advisory Committee (SSAC) in 2014 as an academic with twenty years research and teaching expertise in social security law, alongside ten years as Executive Director of the Law Centre Northern Ireland. While all of this helped to prepare me for the role that I took on as SSAC’s Northern Ireland member, I have learned much more about social security from SSAC than I could ever gain from academic engagement. That has been due, for the most part, to my colleagues on the Committee whose expertise in interrogating the relevant issues has been exceptional, and to the working relationships that SSAC has maintained with officials and Ministers in providing them with independent advice across the social security landscape."
        },
        {
            "text": "In the (almost) ten years of my SSAC tenure, developments in social security have been considerable. I joined when Universal Credit (UC) was just being introduced in Britain, although it took a further three years and some considerable political turmoil for Northern Ireland to agree to introduce UC here. New claims focused initially on those with the least complex circumstances – single people, with no dependants and no illness or disabilities. Any attempt to maintain a slow-and-steady roll-out, however, was disrupted by COVID-19 which vastly accelerated the uptake of UC, placing considerable demands on the Department of Work and Pensions (DWP) in Britain and the Department for Communities (DfC) in Northern Ireland. Those demands were also part of an extraordinary period for SSAC in providing legislative scrutiny of a large volume of emergency legislation, enabling the Departments to meet the need for urgent social security provision. As I step down from SSAC, UC roll-out is continuing but is now dealing with more complex issues around migrating a new claimant cohort impacted by sickness and/or disability. SSAC’s guidance will continue to be critical here, as it will on the related issues of reforming how incapacity for work could be assessed and the Green Paper on proposed changes to Personal Independence Payment (PIP)."
        },
        {
            "text": "Successful implementation of social security reforms need data but this has not always been the DWP or DfC’s forte (nor that of most government departments, despite the Equality Act requirements having been in place since 2010, and the equivalent requirements for Northern Ireland since 1998). While there have been some excellent examples of data-informed legislation to deliver the government’s policy intent, too often the absence of evidence is taken as evidence of an absence of impact. There are encouraging signs that this approach is changing, including through DWP working with SSAC to understand the data needed to scrutinise draft legislation effectively, and presentations to the Committee showing how DWP’s analytical capacity has been enhanced in some areas with high quality data. Similar developments are needed in relation to Northern Ireland and Scotland, where different obstacles for data collection and analysis can arise."
        },
        {
            "text": "While it might be expected that the Northern Ireland member would say this, it is important to consider Northern Ireland in the legislative scrutiny of (principally) DWP legislation. This legislation may not apply to Northern Ireland but there is an inevitable policy interaction with the latter’s fully devolved social security system, which creates a parity paradox: the legislative powers that Northern Ireland holds to do whatever it wants in social security are limited by the cold financial reality that additional HM Treasury funding to implement a different approach will not follow. SSAC’s role here is not to insist on divergence or convergence, but to identify the differential impact of DWP policies in Northern Ireland, where the legislation will be mirrored by DfC. Where this would lead to unintended consequences, then SSAC’s job is to advise both the DWP and DfC on this reality and scrutinise how it might be managed."
        },
        {
            "text": "SSAC is also required to identify how the other devolved nations will be impacted, an issue that has become more significant given that benefits reserved to the UK government, including UC, now sit alongside benefits created under the devolved powers of the Scottish Government. While SSAC has no remit over devolved Scottish benefits, there is still a need to ensure that DWP regulations do not have unintended consequences in Scotland because of how particular terms have differing interpretations in Scots law, for example, or because systems of delivery are not matched north and south of the Scottish/English border. SSAC has been bereft of Scottish expertise since 2020 but the hope is that this gap will soon be filled. This will be critical as DWP considers proposals to reform PIP, which will have inevitable impacts on the equivalent Adult Disability Payment in Scotland under the ‘no-detriment’ principle that guides the devolution settlement in Scotland. While SSAC is alive to this issue, specific Scottish expertise will ultimately be of benefit to ensuring that the interconnecting systems do not generate adverse consequences for claimants moving within the UK."
        },
        {
            "text": "And we should be clear that SSAC’s advice does make a difference to effective parliamentary scrutiny. The most recent report by the UK Parliament’s Secondary Legislation Scrutiny Committee, for example, relied heavily on SSAC’s report on the UC Administrative Earnings Threshold regulations. It can make a difference to legislative outcomes, not just when DWP accepts SSAC’s formal recommendations (sometimes years after they were made) but when officials take SSAC’s advice and change the regulations prior to them being laid before Parliament. The latter aspect is much less visible but critical to SSAC’s role in putting government proposals through their paces, testing the assumptions underpinning the legislation, identifying unintended consequences and solutions to avoid these coming to pass or to mitigate their impact. All of this is done by SSAC while maintaining its independence – from government, from charities, from lobby groups, from those who have different roles in holding government to account – and focusing only on its statutory function. This approach has served SSAC well and I am confident that it will continue to do so. I am honoured to have been part of its contributions to date."
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}