{
    "url": "https://dataingovernment.blog.gov.uk/2024/07/24/information-commissioners-office-unveils-data-strategy-how-we-are-shaping-the-future-of-data-in-regulating-information-rights/",
    "title": "Information Commissioner's Office unveils data strategy: How we are shaping the future of data in regulating information rights",
    "authors": [
        "Rob Holtom Executive Director – Digital, Data and Technology (DDaT), Transformation & Delivery Information Commissioner’s Office (ICO)"
    ],
    "categories": [
        "Data Strategy",
        "Generative AI"
    ],
    "pub_date": "2024-07-24T11:29:06+01:00",
    "content": [
        {
            "text": "In 2022, we launched our ICO25 strategy  to transform the Information Commissioner’s Office (ICO) into a regulator fit for the digital age. Central to this was creating a robust data strategy to harness the power of the data we hold. The strategy aims to set out how the ICO will develop, manage, govern, and use its data assets to “empower individuals through information.”\nSo how did we go about it – and what does it mean for you?"
        },
        {
            "text": "Baselining our current maturity"
        },
        {
            "text": "Understanding our current capabilities was critical in knowing where and how we needed to improve. Luckily, the Central Digital and Data Office (CDDO) had recognised the importance of this and had just launched the Data Maturity Assessment for Government. We loved this as it was current, public sector-specific and flexible."
        },
        {
            "text": "We engaged over 200 people from across the ICO in assessing our maturity, using questionnaires, workshops and interviews."
        },
        {
            "text": "The assessment identified a number of strengths, including:"
        },
        {
            "text": "But it also told us our strategy needed to focus on:"
        },
        {
            "heading": 2,
            "text": "Building a data culture"
        },
        {
            "text": "Our research revealed that our culture around use of data was as much of a challenge as our technical capabilities or processes."
        },
        {
            "text": "Unlike some organisations, we discovered that the issue wasn’t a lack of focus or awareness. Nervousness about getting things wrong, or somehow taking away human intelligence or decision making, was identified as a potential barrier."
        },
        {
            "text": "Working with teams, we defined a set of principles that challenged this, making it clear that we weren’t looking to be data-driven but data-informed. These principles are:"
        },
        {
            "heading": 2,
            "text": "Balancing our role as regulator with being a practitioner"
        },
        {
            "text": "We recognise that by innovating with data we become a more knowledgeable, and therefore effective, regulator."
        },
        {
            "text": "Greater use of data could provide deep insights into the needs of our customers, identify and predict instances of harm, and guide prioritisation and decision making. This would make our work more productive and focused."
        },
        {
            "text": "As a regulator, we’re shifting our guidance away from “don’t do” to “how to”. Similarly, we needed our use of data to “show, not tell”."
        },
        {
            "text": "Together, this drove our vision statement:"
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Approaching AI"
        },
        {
            "text": "Leaps forward in AI technologies and their general availability have raised questions of how to bring these into your data strategy."
        },
        {
            "text": "In some ways, AI changes everything. It offers new ways of creating value, and of addressing issues such as data quality or metadata creation. It brings more and novel risks to manage, particularly as the barrier to AI experimentation has dropped."
        },
        {
            "text": "For us, it’s opened up some great new ideas. For example, we’re exploring how we can unlock access to content that’s hidden in documents or use AI to analyse websites’ compliance with the law."
        },
        {
            "text": "But AI also changes nothing: the investment in data foundations, culture and skills is exactly the same."
        },
        {
            "text": "To make sure we do this right, we’re following our own advice, guidance and toolkits, all available on the ICO website. And working with our partners in the Digital Regulation Cooperation Forum, we launched an AI and Digital Hub this year."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Delivering the data strategy"
        },
        {
            "text": "This all comes together, along with how we’re approaching delivering the foundations for success, in our data strategy."
        },
        {
            "text": "Earlier this year we put this strategy out for consultation. We asked data experts across public and private industry what matters to them when it comes to data, and what they thought of our approach."
        },
        {
            "text": "The feedback we received has been published as part of the final strategy, which you can find on the ICO website. While the consultation has closed, we are still keen to hear from people. Your views, stories and evidence will help us ensure that we continue to head in the right direction and make the most effective use of data for the wider public benefit. You’ll find a\nfeedback survey on the website, so please share your thoughts with us. We want to keep this conversation going."
        }
    ]
}