{
    "url": "https://environmentagency.blog.gov.uk/2024/07/24/storm-recovery-in-lincolnshire/",
    "title": "Storm recovery in Lincolnshire",
    "authors": [
        "josiestoneman"
    ],
    "categories": [
        "Environment Agency",
        "Flood",
        "Flood Maintenance"
    ],
    "pub_date": "2024-07-24T09:00:36+00:00",
    "content": [
        {
            "text": "My name is Paul Dutchburn, and I am the Asset Performance Team Leader in the South Humber & East Coast (SHEC) in the Lincolnshire & Northamptonshire Area."
        },
        {
            "text": "Six months after the eighth storm of the 2023-2024 season, I am now looking back to Storms Henk and Babet and the work that the Environment Agency has since done in incident response and recovery."
        },
        {
            "text": "Looking back to this winter"
        },
        {
            "text": "The weather is becoming wetter, windier and more unpredictable. In recent years, we have seen more flooding, whether from intense rainfall, increased river flows or coastal surges."
        },
        {
            "text": "Between October 2023 and February 2024, the UK was beset by continuous storm events bringing heavy rainfall and flooding impacts to communities. Storm Babet and Storm Henk in particular caused significant impacts across Lincolnshire and Northamptonshire."
        },
        {
            "text": "According to the Met Office, this part of the country recorded the wettest ever winter on record. In October, Storm Babet resulted in a month’s rain in 24 hours and Storm Henk further stressed already overwhelmed flood defence assets."
        },
        {
            "text": "It was a privilege to be able to work with our all our partner organisations in responding to these recording breaking incidents.  I never expected to be spending a weekend in October 2023, during Storm Babet, sat in Wainfleet fire station working with the internal drainage boards and the fire and rescue service on where and how to use pumps."
        },
        {
            "text": "Recovery"
        },
        {
            "text": "At least 11,000 properties in Lincolnshire and Northamptonshire were protected by the Environment Agency during the storm. Despite this around 2,300 properties were affected by river and surface water flooding."
        },
        {
            "text": "Since Storm Babet local Environment Agency staff have worked for 50,000 hours on incident and recovery activities. Since October 2023, approximately 9,344 flood risk management assets , such as flood embankments, sluices and floodwalls, have been inspected. Our teams have walked hundreds of miles. We completed emergency repair works across Lincolnshire, including to the left bank of the Maxey Cut, near Tallington, repaired breaches to both banks of the Barlings Eau, near Short Ferry, just outside Lincoln, and a breach to the Bourne Eau."
        },
        {
            "text": "We have worked closely with our partners at the various internal drainage boards thought Lincolnshire & Northamptonshire, where we have supported each other with various pumping operations."
        },
        {
            "text": "We have engaged directly with multiple communities throughout the year to look at the ways in which we can support them to become more resilient."
        },
        {
            "text": "We have also looked at investigating whether there are any works that could reduce flood risk to those communities. For example, we are working at pace with repair works at Tattershall."
        },
        {
            "text": "Here is a video I did for X (formerly Twitter) back in March 2024, giving an update whilst works were happening on the Barlings Eau. https://x.com/EnvAgencyMids/status/1765678866868346929"
        },
        {
            "text": "We also held public drop-in sessions at Horncastle, Ruskington and Wainfleet."
        },
        {
            "text": "We will keep working with communities over the next few months."
        },
        {
            "text": "Farmers"
        },
        {
            "text": "Around 12% (1.4 million hectares) of agricultural land in England is at flood risk from rivers or the sea; or from both. That includes farmers here in Lincolnshire and Northamptonshire. Farmers and land managers have a key role in creating climate resilient places and helping communities to plan for and adapt to future flooding and coastal change."
        },
        {
            "text": "Our Fens 2100+ team is leading a pilot on sustainable recovery with partners, communities, and farmers in the Fiskerton and Barlings Eau area, just to the east of Lincoln. Their aim is to understand if a different approach to flood recovery could make them more resilient to flooding and the impacts of climate change in the future."
        },
        {
            "text": "We have also been liaising with the National Farmers Union and internal drainage boards in our region to offer support and advice to farmers affected by flooding. We will continue to work closely with all our partners."
        },
        {
            "text": "Becoming flood resilient"
        },
        {
            "text": "It’s important that alongside the Environment Agency’s work, members of the public know their own flood risk."
        },
        {
            "text": "Make sure you sign up to flood warnings or call our Floodline service on 0345 988 1188."
        },
        {
            "text": "If you are asked to prepare for flooding remember the following steps:"
        }
    ]
}