{
    "url": "https://deframedia.blog.gov.uk/2024/07/24/the-environment-agency-has-today-published-its-annual-environmental-performance-assessment-epa-report/",
    "title": "The Environment Agency has published its annual Environmental Performance Assessment (EPA) report ",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Environment Agency",
        "water"
    ],
    "pub_date": "2024-07-24T09:57:09+01:00",
    "content": [
        {
            "text": "The Environment Agency has published its annual Environmental Performance Assessment (EPA) report  of the environmental performance of England’s nine water and sewerage companies during 2023."
        },
        {
            "text": "The EPA is the only independent comparison of environmental performance across the sector. While it shows an improvement in star ratings, the majority of companies continue to underperform."
        },
        {
            "text": "The report found the number of serious pollution incidents increased from 44 in 2022 to 47 in 2023 and over 90% of these were caused by four companies (Anglian Water, Southern Water, Thames Water and Yorkshire Water), resulting in a polarised performance picture across the sector. The total pollution incidents from sewerage and water supply assets increased to 2,174 – the second consecutive annual increase and highest number recorded since 2019."
        },
        {
            "text": "Secretary of State for Environment, Food and Rural Affairs, Steve Reed said:"
        },
        {
            "text": "Environment Agency Chair Alan Lovell said: "
        },
        {
            "text": " "
        },
        {
            "text": "Water Minister Emma Hardy will meet with the bosses of the five water companies that received a 2-star rating, to hear directly from them about how they plan to improve their environmental performance."
        },
        {
            "text": "The Secretary of State for Environment Food and Rural Affairs Steve Reed has already announced a series of initial steps towards ending the crisis in the water sector:"
        },
        {
            "text": "In addition, the Water (Special Measures) Bill outlined in the First Kings Speech will:"
        }
    ]
}