{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2025/06/09/join-the-government-science-and-engineering-profession/",
    "title": "Join the Government Science and Engineering profession",
    "authors": [
        "gseprofession"
    ],
    "categories": [
        "Blog Series",
        "GSE Offer",
        "GSE Profession Updates"
    ],
    "pub_date": "2025-06-09T14:30:11+01:00",
    "content": [
        {
            "text": "On Monday 9 June the Cabinet Secretary launched the ‘Join a Profession’ campaign. This campaign is part of the government’s vision to enhance the Civil Service by investing in skills and leadership capabilities to drive innovation. The Cabinet Secretary is asking every civil servant to identify and connect with a relevant profession and ensure their development plans build their professional skills. "
        },
        {
            "text": "What is a profession? "
        },
        {
            "text": "Professions are active communities providing access to specialised learning, career pathway guidance and the chance to connect with colleagues with similar interests and skill sets. Being part of a profession is about fostering a belonging to professional community that offers guidance, support, and opportunities throughout your career journey. There are 30 government professions available, 13 of which are open to anyone across the government, including the Government Science and Engineering (GSE) Profession.  "
        },
        {
            "text": "Benefits of joining a profession "
        },
        {
            "text": "Government Science and Engineering Profession  "
        },
        {
            "text": "The GSE Profession is a diverse cross-government group of people who are connected to science and engineering either by their role, skillset or interests. The Profession has around 10,000 diverse members across the civil, public, and crown services and aims to help everyone embed science and engineering in government decision making and increase the capability of scientists and engineers across government.   "
        },
        {
            "text": "The GSE Profession is open to everyone across government, regardless of their background, and we have four job families:  "
        },
        {
            "text": "Whether you’re a deep specialist or just starting your journey into science and engineering, the GSE Profession offers a wealth of resources, support, and opportunities to enhance your skills and contribute to impactful decision-making. "
        },
        {
            "text": "We have developed offers to showcase the value of science and engineering. These include: "
        },
        {
            "text": "Find out more about the GSE Profession offer by contacting us for more information.  "
        },
        {
            "text": "Don’t delay, take the next step in your Civil Service career by joining the Government Science and Engineering profession today.  "
        }
    ]
}