{
    "url": "https://moderncivilservice.blog.gov.uk/2025/06/09/join-a-profession-discover-your-professional-community/",
    "title": "Join a Profession: discover your professional community",
    "authors": [
        "Government Reform"
    ],
    "categories": [
        "A Modern Civil Service",
        "Capability",
        "Government Reform",
        "Join a profession",
        "One Big Thing",
        "Professional Networks",
        "Proud Civil Servant"
    ],
    "pub_date": "2025-06-09T13:07:59+01:00",
    "content": [
        {
            "text": "Being part of a government profession is an important aspect of every civil servant’s career journey. Wherever you work, whatever you do, there’s a Civil Service profession waiting to welcome you and help you develop your skills and career, and deliver your role in the best way. There are 31 different professions in the Civil Service, from Digital and Data to Policy to Operational Delivery."
        },
        {
            "text": "Government professions are communities of people sharing common skills, expertise, and knowledge across departments and agencies. They offer support for your training and development, helping you excel in your current role, discover what you want to do next, and connect with colleagues who understand your work."
        },
        {
            "text": "To support you in finding the profession that’s right for your professional needs, we have created the Join a Profession page. Here you can read about all 31 government professions, how you can join, and have many other questions answered."
        },
        {
            "text": "By making being a member of a profession a universal experience of the Civil Service — from onboarding through performance conversations to career planning — we will create stronger professional communities that drive innovation, share expertise, and build the skills our organisation needs for the future."
        },
        {
            "heading": 2,
            "text": "What are the benefits to joining a profession?"
        },
        {
            "text": "The Cabinet Secretary has highlighted professional skills development as essential to Civil Service success, making this the perfect time to get involved. All civil servants should be considering their career development, as well as learning opportunities, with professional skills in mind. "
        },
        {
            "text": "Each civil servant will have a profession aligned to their skills and jobs, with some requiring specific accreditations to join. Many civil servants will have a secondary profession available to them. "
        },
        {
            "text": "Joining a profession helps you access:"
        },
        {
            "text": "By joining a profession you’ll not only be able to gain greater recognition and access new opportunities, but it will also help you better understand the scope of your own role within the Civil Service. It also garners a sense of belonging to a professional community where you can share expertise, drive innovation and gain the skills needed for the future, such as better training in AI."
        },
        {
            "heading": 2,
            "text": "How do I find out which profession is right for me?"
        },
        {
            "text": "Every civil servant belongs to at least one of 31 professions, and our new web page makes it easier than ever to find yours. Here’s what you need to do:"
        },
        {
            "text": "You can also visit our Join a Profession and One Big Thing stall at Civil Service Live to learn more about joining a profession."
        }
    ]
}