{
    "url": "https://digitalhealth.blog.gov.uk/2025/06/09/nhse-cohorting-as-a-service-alpha-assessment/",
    "title": "NHSE Cohorting as a Service Alpha Assessment",
    "authors": [
        "Man-Yee Lam"
    ],
    "categories": [
        "Alpha",
        "Assurance",
        "Service assessments"
    ],
    "pub_date": "2025-06-09T11:12:02+01:00",
    "content": [
        {
            "text": "From: DHSCAssessment date: 20/02/2024Stage: Alpha Result: Met Service provider: NHS England"
        },
        {
            "heading": 2,
            "text": "Service description "
        },
        {
            "text": "Cohorting as a Service is an assured way for national healthcare teams to identify patients for care, based on risk factors.  "
        },
        {
            "text": "The service includes a managed service for creating, assuring and running and disseminating cohorts, underpinned by a rules engine (Cohort Processing System). It also includes a digital journey for finding out why a patient is included in a cohort. The service also includes publishing cohort information to the web. "
        },
        {
            "heading": 2,
            "text": "Service users "
        },
        {
            "heading": 2,
            "text": "Report contents"
        },
        {
            "heading": 2,
            "text": "1. Understand users and their needs "
        },
        {
            "heading": 3,
            "text": "Decision "
        },
        {
            "text": "The service met point 1 of the Standard. "
        },
        {
            "heading": 3,
            "text": "What the team has done well "
        },
        {
            "text": "The panel was impressed that: "
        },
        {
            "heading": 3,
            "text": "What the team needs to explore "
        },
        {
            "text": "Before their next assessment, the team needs to: "
        },
        {
            "heading": 2,
            "text": "2. Solve a whole problem for users "
        },
        {
            "heading": 3,
            "text": "Decision "
        },
        {
            "text": "The service met point 2 of the Standard. "
        },
        {
            "heading": 3,
            "text": "What the team has done well "
        },
        {
            "text": "The panel was impressed that: "
        },
        {
            "heading": 3,
            "text": "What the team needs to explore "
        },
        {
            "text": "Before their next assessment, the team needs to: "
        },
        {
            "heading": 2,
            "text": "3. Provide a joined-up experience across all channels     "
        },
        {
            "heading": 3,
            "text": "Decision "
        },
        {
            "text": "The service met point 3 of the Standard. "
        },
        {
            "heading": 3,
            "text": "What the team has done well "
        },
        {
            "text": "The panel was impressed that: "
        },
        {
            "heading": 3,
            "text": "What the team needs to explore "
        },
        {
            "text": "Before their next assessment, the team needs to: "
        },
        {
            "heading": 2,
            "text": "4. Make the service simple to use "
        },
        {
            "heading": 3,
            "text": "Decision "
        },
        {
            "text": "The service met point 4 of the Standard. "
        },
        {
            "heading": 4,
            "text": "What the team has done well "
        },
        {
            "text": "The panel was impressed that: "
        },
        {
            "heading": 3,
            "text": "What the team needs to explore "
        },
        {
            "text": "Before their next assessment, the team needs to: "
        },
        {
            "heading": 2,
            "text": "5. Make sure everyone can use the service    "
        },
        {
            "heading": 3,
            "text": "Decision "
        },
        {
            "text": "The service met point 5 of the Standard. "
        },
        {
            "heading": 3,
            "text": "What the team has done well "
        },
        {
            "text": "The panel was impressed that: "
        },
        {
            "heading": 3,
            "text": "What the team needs to explore "
        },
        {
            "text": "Before their next assessment, the team needs to: "
        },
        {
            "heading": 2,
            "text": "6. Have a multidisciplinary team "
        },
        {
            "heading": 3,
            "text": "Decision "
        },
        {
            "text": "The service met point 6 of the Standard. "
        },
        {
            "heading": 3,
            "text": "What the team has done well "
        },
        {
            "text": "The panel was impressed that: "
        },
        {
            "heading": 3,
            "text": "What the team needs to explore "
        },
        {
            "text": "Before their next assessment, the team needs to: "
        },
        {
            "heading": 2,
            "text": "7. Use agile ways of working "
        },
        {
            "heading": 3,
            "text": "Decision "
        },
        {
            "text": "The service met point 7 of the Standard. "
        },
        {
            "heading": 3,
            "text": "What the team has done well "
        },
        {
            "text": "The panel was impressed that: "
        },
        {
            "heading": 3,
            "text": "What the team needs to explore "
        },
        {
            "text": "Before their next assessment, the team needs to: "
        },
        {
            "heading": 2,
            "text": "8. Iterate and improve frequently "
        },
        {
            "heading": 3,
            "text": "Decision "
        },
        {
            "text": "The service met point 8 of the Standard. "
        },
        {
            "heading": 3,
            "text": "What the team has done well "
        },
        {
            "text": "The panel was impressed that: "
        },
        {
            "heading": 2,
            "text": "9. Create a secure service which protects users’ privacy  "
        },
        {
            "heading": 3,
            "text": "Decision "
        },
        {
            "text": "The service met point 9 of the Standard. "
        },
        {
            "heading": 3,
            "text": "What the team has done well "
        },
        {
            "text": "The panel was impressed that: \n\nthe team was actively considering security, including threat assessment activities \nthe team was relying on existing NHS identity management processes, building on the existing capabilities\nthe team actively reviews the application-level security of their code, including reviewing security of 3rd party packages\n\nWhat the team needs to explore \nBefore their next assessment, the team needs to: \n\nimprove their development lifecycle to include regular reviews and uplift of the service’s threat model \ndevelop and test a business continuity plan to have a coordinated response to a major cyber incident or data breach   \n\n10. Define what success looks like and publish performance data \nDecision \nThe service met point 10 of the Standard. \nWhat the team has done well \nThe panel was impressed that: \n\nthe team have used a framework to define their priority goal and developed KPIs around this \nKPIs have been mapped to user needs \nthere is a plan for how most metrics will be tracked \nthe team have researched current costs of cohort provision, which can be very high    \n\nWhat the team needs to explore \nBefore their next assessment, the team needs to: \n\nhave a plan for how they will track metrics of enquiries being solved first time   \nhave a clearer commercial model and ROI (return on investment) calculations to understand in more detail how this service will save money \nexplore whether tracking ‘learnability’ is worthwhile measure of success. This is an aspect of usability that is particularly relevant to frequent or ‘super’ users of a service and considers the design trade-offs that might need to be made in a complex internal service \nhave a better understanding of how many users are expected after private beta and what and whether their private beta cohort is a sufficient number    \n\n11. Choose the right tools and technology \nDecision \nThe service met  point 11 of the Standard. \nWhat the team has done well \nThe panel was impressed that: \n\nthe team have made well-considered choices when deciding to build versus re-use. Specifically, the arguments to build the cohort processing service are compelling and well-made \nthe team decided to focus on process optimisation for cohort creation, rather than building technology is also noteworthy, as a choice to not use technology \nthe team have made their technology choices in consultation with the wider programme space they operate within   \n\nWhat the team needs to explore \nBefore their next assessment, the team needs to: \n\ndecide whether the cohort explorer needs to exist as a stand-alone tool or is better served being APIs to integrate into other existing user interfaces \nconsider whether terminology tooling (Ontoserver) is an alternative for use of Excel spreadsheets, including promoting easier re-use of terminology code-sets   \n\n12. Make new source code open \nDecision \nThe service met point 12 of the Standard. \nWhat the team has done well \nThe panel was impressed that: \n\nthe team has understood the NHS England quality expectations before open sourcing of code \nthe team has been doing the preparation work to open source their code   \n\nWhat the team needs to explore \nBefore their next assessment, the team needs to: \n\nopen source the software code projects used to build this service \ndiscuss with stakeholders how to apply the open sourcing principles to the clinical code-sets  \n\n13. Use and contribute to open standards, common components and patterns \nDecision \nThe service met point 13 of the Standard. \nWhat the team has done well \nThe panel was impressed that: \n\nthe team are using OIDC as their identity standard \nthe team are relying on previously built shared components (MESH)   \n\nWhat the team needs to explore \nBefore their next assessment, the team needs to: \n\nconsider how the work done to date might be adopted as a standard methodology for generating cohorts across the NHS and Care systems  \n\n14. Operate a reliable service \nDecision \nThe service met point 14 of the Standard. \nWhat the team has done well \nThe panel was impressed that: \n\nthe team has a process for handling regular Snomed updates \nthe team have a testing and assurance process for new cohort rule sets   \n\nWhat the team needs to explore \nBefore their next assessment, the team needs to: \n\nhave defined and agreed the overall service level of the CaaS service \ndecide how to apply versioning to the cohort outputs, recognising the rule and source data versions in that \nhave defined and tested a breach response plan, as part of the business continuity planning \ntest in private Beta with a manageable number of users, to ensure they are not overwhelming themselves to have time to deal with things that go wrong and have capacity to make changes to the journey for the frontend and backend experience through learnings discovered in private Beta. \n\n"
        }
    ]
}