{
    "url": "https://nationalscreening.blog.gov.uk/2023/12/28/minutes-published-of-uk-nscs-november-2023-meeting/",
    "title": "Minutes published of UK NSC’s November 2023 meeting",
    "authors": [
        "Mike Harris"
    ],
    "categories": [
        "General"
    ],
    "pub_date": "2023-12-28T10:18:39+00:00",
    "content": [
        {
            "text": "The UK National Screening Committee (UK NSC) has endorsed the use of digital pathology (DP) as an alternative option to light microscopy (LM) for the review of cancer screening histopathology slides."
        },
        {
            "text": "DP enables glass histopathology slides to be reviewed digitally, rather than with a microscope. A Health Technology Assessment (HTA) study found that DP performs as well as LM in cancer screening and that pathologists were comfortable and able to use both modalities."
        },
        {
            "text": "The committee endorsed the use of DP at its November 2023 meeting following a consultation into the results of the HTA study. A total of 31 stakeholders responded to the consultation and none were aware of any evidence contradicting the HTA study. The UK NSC supported the use of DP in screening as a permissive modification, meaning it can be used where feasible in labs as an option to LM."
        },
        {
            "text": "The UK NSC also decided to reiterate its recommendation not to screen for vasa praevia, a rare but serious health condition which causes blood vessels to tear during birth and has serious consequences for mothers and babies."
        },
        {
            "text": "The committee decided there was still insufficient evidence to support a positive recommendation for screening for vasa praevia, but members were keen to encourage more research to build the evidence base on this topic. In addition, the UK NSC secretariat will be meeting colleagues from the National Institute for Health and Care Excellence (NICE) to discuss clinical care management guidelines for vasa praevia to see if more can be done."
        },
        {
            "text": "Other items discussed at the UK NSC’s November 2023 meeting included work to assess the effectiveness of the NHS Abdominal Aortic Aneurysm Screening Programme following the programme’s 10-year milestone as a national NHS screening programme, and updates on work to implement a national targeted lung cancer screening programme and screening for tyrosinaemia in newborns."
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK NSC. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, please email screeninginformation@dhsc.gov.uk."
        }
    ]
}