{
    "url": "https://environmentagency.blog.gov.uk/2023/12/28/working-with-farmers-to-protect-our-future-land/",
    "title": "Working with farmers to protect our future land",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "agriculture",
        "Environment Agency"
    ],
    "pub_date": "2023-12-28T09:28:31+00:00",
    "content": [
        {
            "text": "Agriculture is the biggest sector we regulate in terms of individual businesses, with around 100,000 premises covering 70% of the land in England. Every year, the EA works together with farmers to bring the changes and improvements which will protect our future land and resources and secure better compliance with environmental regulations."
        },
        {
            "text": "We carry out farm inspections to check compliance against environmental regulations for farming: Farming Rules for Water; Storage of Silage, Slurry and Fuel Oil (SSAFO) regulations; Nitrate Vulnerable Zones (NVZs). These regulations govern the storage and application of organic and inorganic fertilisers, aspects of livestock management, and other aspects of farming infrastructure and practices where there is a risk of pollution or environmental harm. We check that farmers are compliant with the aspects of the regulations applicable to their farm and, where non-compliances are found, we take appropriate steps to bring a farm back into compliance."
        },
        {
            "text": "Our inspection update for this year shows that we are progressing well towards our annual target of 4000 inspections. Headline figures for our year so far are:"
        },
        {
            "text": "Similar to last year, we are finding non-compliances in around 50% of farm inspections. The issuing of over 4000 actions so far shows that we typically find multiple non-compliances during those inspections. With 2165 actions verified as complete, farmers are making good progress in bringing themselves into compliance. Many of the actions we specify require significant changes to farming practice or infrastructure so these can take time to implement."
        },
        {
            "text": "Back in time for inspections"
        },
        {
            "text": "As we consider the 2000 inspections so far this year, plus the 4000 inspections last year, it is worth a quick look back at how farm inspections for environmental regulation have changed over time. The chart below shows the number of inspections carried out each for the past ten years."
        },
        {
            "text": "Prior to a significant injection of funding and the establishment of our new teams of agriculture inspection officers in 2021, we can see that inspection numbers were low. Without dedicated officers, inspections were carried out by teams with a wide range of other responsibilities relating to land and water regulation. Fluctuations in inspection numbers earlier in the period relate to changes in funding and areas of regulatory responsibility."
        },
        {
            "text": "Much of our inspection work for sectors outside of farming (such as waste management and abstraction licences) is charge funded through the Environmental Permitting Regulations (EPR). This means businesses pay for an environmental permit and the income derived from this is used to monitor compliance. Currently only a small proportion of intensive pig and poultry farms require permits to operate. The majority of farms do not require environmental permits, so the inspections we carry out are paid for directly by government funding – an anomaly in terms of environmental regulation."
        },
        {
            "text": "Hitting the target – prioritising the most vulnerable"
        },
        {
            "text": "So how do we decide where to target our inspections?"
        },
        {
            "text": "With a finite resource for carrying out inspections (our officers) and approximately 100,000 farm premises in England, we target our inspections in the places they are needed most. Not all farms are in places where they present a risk to water quality and some farming sectors and practices have a much lower impact on the environment than others. Our aim is to reduce the impact agriculture has on our waterways, so we target river catchments taking into account a number of factors:"
        },
        {
            "text": "Our farm inspectors take a proportionate approach that uses advice and guidance first. We are a fair regulator, but if advice is not heeded, we will not hesitate to pursue whatever sanctions are necessary – including penalties, formal cautions, or prosecutions.  We continue to innovate in delivering our regulatory role using remote sensing, aerial drones, and targeted campaigns on key issues like soil protection."
        },
        {
            "text": "We also make use of local knowledge, meaning our area teams can use their expertise and first-hand experiences to inform decision making. The map of England below shows where our inspections are being targeted this year. Whilst we use this process for proactive planning, we will also carry out inspections where concerns about pollution are identified, whether by ourselves, partner organisations or the general public."
        }
    ]
}