{
    "url": "https://nationalscreening.blog.gov.uk/2024/04/16/graham-excited-by-challenges-facing-the-evolving-uk-nsc/",
    "title": "Graham excited by challenges facing the evolving UK NSC",
    "authors": [
        "Mike Harris"
    ],
    "categories": [
        "General"
    ],
    "pub_date": "2024-04-16T11:58:07+01:00",
    "content": [
        {
            "text": "The UK National Screening Committee (UK NSC) has changed considerably since Dr Graham Shortland OBE was first asked to work with the committee."
        },
        {
            "text": "Graham joined the committee as a paediatric specialist and played a significant role in the expansion of the newborn blood spot screening programme to screen for inherited metabolic diseases (IMDs)."
        },
        {
            "text": "He has been the UK NSC’s vice-chair since 2017, firstly under previous chair Prof Bob Steele and then under current chair Prof Sir Mike Richards. He said:"
        },
        {
            "heading": 2,
            "text": "A passion for paediatrics"
        },
        {
            "text": "Graham grew up in Welwyn Garden City, Hertfordshire, attended his local comprehensive school and was the first person in his family to go to university."
        },
        {
            "text": "He studied medicine at Southampton and graduated in 1983 before going on to specialise in paediatrics."
        },
        {
            "text": "Graham trained in Southampton, Cardiff and Bristol and was a lecturer in Cardiff. In Bristol, his interest in IMDs was inspired by working with Professor John Walter as his research fellow and with Professor Peter Fleming."
        },
        {
            "text": "In 1993, he was appointed a consultant in paediatric medicine in Cardiff and his interest in metabolic diseases continued to grow. He helped set up the South Wales IMD service and has held senior positions in a number of IMD organisations, including being Chair of the British Inherited Metabolic Diseases Group from 2002 to 2008."
        },
        {
            "text": "When first appointed in Cardiff, he built up vast clinical experience, initially providing Consultant cover in Community Paediatrics, General Paediatrics, Paediatric Intensive Care and Regional Neonatal Services, and finally developing IMDs as his main area of clinical interest."
        },
        {
            "text": "Graham has also held senior managerial roles and chaired several groups on behalf of Welsh government. Between 2010 and 2019, he was the Executive Medical Director of the Cardiff and Vale University Health Board. He chaired the Rare Diseases Implementation Group in Wales and secured significant funding from the Welsh Government for a 3-year pilot programme to establish the first UK Syndrome Without A Name (SWAN) clinic to look at shortening the ‘diagnostic odyssey’ for people with undiagnosed rare diseases."
        },
        {
            "text": "In 2020, Graham received an OBE in recognition for his services to paediatrics, patient safety and the NHS in Wales."
        },
        {
            "heading": 2,
            "text": "UK NSC’s quality checking role is its strength"
        },
        {
            "text": "Graham has worked with the UK NSC as a paediatric specialist and has served on a number of its sub-committees."
        },
        {
            "text": "He was closely involved in work to add IMDs to the conditions which the NHS Newborn Blood Spot Screening Programme screens for. This started with MCADD (medium-chain acyl-CoA dehydrogenase deficiency) in 2009 and 4 more followed after a 2014 evidence review: Glutaric aciduria type 1 (GA1), Homocystinuria (HCU), Isovaleric acidaemia (IVA) and Maple syrup urine disease (MSUD)."
        },
        {
            "text": "Graham has been vice-chair of the UK NSC since 2017 and sees part of his role as providing advice and support for appropriate succession planning for paediatric rare disease expertise and leadership on the committee."
        },
        {
            "text": "He added:"
        },
        {
            "heading": 2,
            "text": "Outside work"
        },
        {
            "text": "Graham is a lifelong Tottenham Hotspur football fan whose other sporting interests last year included spending seven weeks travelling around France with family and friends to follow England and Wales at the 2023 Rugby World Cup."
        },
        {
            "text": "He is a keen sailor and RYA qualified Yachtmaster and sails out of Plymouth along the Devon and Cornwall coast, across the Channel and to the Scilly Isles, so he has plenty to keep him busy in his semi-retirement."
        },
        {
            "text": "Graham, who retired from active clinical work in January 2022, continues to live in Cardiff and has 3 grown-up sons."
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK NSC. You can register to receive updates direct to your inbox, so there is no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, please email uknsc@dhsc.gov.uk."
        }
    ]
}