{
    "url": "https://rtau.blog.gov.uk/2024/04/16/guidance-for-local-authorities-on-data-analytics-in-childrens-social-care/",
    "title": "Guidance for Local Authorities on Data Analytics in Children’s Social Care ",
    "authors": [
        "Ben Kelly"
    ],
    "categories": [
        "Data",
        "Data collection",
        "Data-sharing",
        "Demographic data"
    ],
    "pub_date": "2024-04-16T16:07:27+01:00",
    "content": [
        {
            "text": "Children’s Social Care is one of the most important functions the government carries out. Children who need help and protection deserve high quality and effective support as soon as a need is identified.  "
        },
        {
            "text": "Data analytics tools, software that enables categorisation and analysis of data, present an opportunity for local governments to better deliver responsive services and care to children and families.  "
        },
        {
            "text": "However, to make sure that any use of analytics is effective and trustworthy, senior decision makers (accountable officers) and developers (technical or analytical teams) need to make sure that the right governance structures are in place to use data ethically and responsibly. Citizens, in particular children and families being supported by children’s services, must be confident that their best interests are at the centre of all decisions relating to data analytics.  "
        },
        {
            "heading": 3,
            "text": "Publishing guidance on data analytics"
        },
        {
            "text": "Today, the Department for Education has published guidance for local authorities who are developing and using data analytics tools. It consists of practical guides, toolkits and explainers for audiences across children’s services.  "
        },
        {
            "text": "The DfE asked the Responsible Technology Adoption Unit (RTA) to develop the guidance, following recommendations by What Works Children’s Social Care and others on the need for a national standard. RTA also identified this recommendation as an important issue in its Review into bias in algorithmic decision making.  "
        },
        {
            "heading": 3,
            "text": "Developing guidance with children’s services"
        },
        {
            "text": "RTA engaged in a year-long, extensive and iterative consultation with a wide range of stakeholders throughout the design and development of guidance. These included: "
        },
        {
            "heading": 3,
            "text": "Clear and Comprehensive Guidance"
        },
        {
            "text": "The guidance is made up of 5 key documents covering every angle of responsible innovation in this area, including: "
        },
        {
            "heading": 3,
            "text": "Embedding good practice in local government"
        },
        {
            "text": "RTA continues to work across government to provide guidance and advice on how to innovate responsibly with data driven technology across the full range of policy areas and sectors. This includes working with local authorities  to ensure that this guidance on children’s social care provides the tools and resources needed to embed responsible innovation.  "
        },
        {
            "text": "Please email rtau@dsit.gov.uk if you would like to work with us, or to hear more about the guidance for developing data analytics in children’s social care.  "
        }
    ]
}