{
    "url": "https://educationhub.blog.gov.uk/2024/04/16/how-to-register-childminder-grant-worth-up-to-1200/",
    "title": "How to register as a childminder and receive a grant worth up to £1,200",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Childcare",
        "childminders"
    ],
    "pub_date": "2024-04-16T14:55:03+01:00",
    "content": [
        {
            "text": "We’re making the biggest investment by a UK government into childcare in history. Parents have the flexibility to choose how they spend their government-funded hours – and many are opting to use childminders."
        },
        {
            "text": "Being a childminder is a rewarding role where you can have a real impact on the lives of children and their families. It’s also a flexible career which you can fit around your life."
        },
        {
            "text": "If you’re new to the profession, you may also be entitled to a grant worth up to £1,200 to help start your business."
        },
        {
            "text": "Here we explain everything you need to know about how to become a childminder and where to apply."
        },
        {
            "heading": 3,
            "text": "What do childminders do?"
        },
        {
            "text": "Childminders care for babies, toddlers and children in a home-based environment."
        },
        {
            "text": "Lots of childminders do this alongside looking after their own children."
        },
        {
            "text": "As a childminder, you will help develop children’s wellbeing and kickstart their learning, so they are ready for school when they reach the right age."
        },
        {
            "text": "Your responsibilities could include:"
        },
        {
            "text": "Childminders are self-employed, so you’ll be running your own business and acting as your own boss."
        },
        {
            "heading": 3,
            "text": "How much do childminders earn?"
        },
        {
            "text": "The amount you earn as a childminder depends on a few factors, including the number of children you look after and the hours you offer."
        },
        {
            "text": "Being self-employed is one of the benefits of being a childminder, as you can fit your work around the other commitments you have – including caring for your own children."
        },
        {
            "text": "Childminders are benefitting from our investment in childcare. We are investing more than £400 million this year to increase hourly funding rates, meaning the national average funding rates for 24/25 are:"
        },
        {
            "text": "To help you start-up your business, new childminders joining the profession may be able to apply for a childminder start-up grant of £600 if registering with Ofsted, or £1,200 if registering with a childminder agency. The grant size reflects the different costs of registering."
        },
        {
            "heading": 3,
            "text": "What qualifications do childminders need?"
        },
        {
            "text": "You don’t need any prior experience or qualifications to become a childminder, but you must complete a registration process."
        },
        {
            "text": "To do this you'll usually need to:"
        },
        {
            "text": "New childminders might be eligible to receive a grant to cover costs associated with registering, and once you’re registered, you could take further training, like a  free online course covering child development during early years."
        },
        {
            "text": "Find out more here."
        },
        {
            "heading": 3,
            "text": "How do I apply to become a childminder?"
        },
        {
            "text": "To become a childminder, you must register with Ofsted or a childminder agency."
        },
        {
            "text": "You can register with Ofsted online here."
        },
        {
            "text": "To register with a childminder agency, you must contact them directly. A list of agencies is available here."
        },
        {
            "heading": 3,
            "text": "Should childminders register with Ofsted or a childminder agency?"
        },
        {
            "text": "You can choose whether to register with Ofsted or a childminder agency."
        },
        {
            "text": "If you register with Ofsted, you will need to organise your own support, finances and record-keeping. Ofsted charges an annual fee."
        },
        {
            "text": "In contrast, childminder agencies provide you with practical support, and can also offer a range of additional services, such as help with the administrative side of your business. Childminder agencies are likely to charge you a monthly fee or percentage of your earnings. You can find out about childminder agencies and the services they provide here."
        },
        {
            "heading": 3,
            "text": "How many children can I look after as a childminder?"
        },
        {
            "text": "Childminders can look after a maximum of 6 children under the age of 8 per adult."
        },
        {
            "text": "Of these 6 children, a maximum of 3 may be young children, and there should only be 1child under the age of 1."
        },
        {
            "text": "The EYFS contains more information here."
        },
        {
            "heading": 3,
            "text": "Can I work with other people as a childminder?"
        },
        {
            "text": "Currently, childminders can work with up to two other people (childminders and/or assistants) under their childminder registration – meaning there can be a total of three people working together under a single registration."
        },
        {
            "text": "We’re planning to expand the number of people who can work together as childminders to four people in total – this change will likely come into later this year."
        },
        {
            "heading": 3,
            "text": "Can I work as a childminder outside my home?"
        },
        {
            "text": "Childminders can currently operate from suitable location outside their home, such as a school site or community centre, for up to 50% of their time. Childminders can also organise outings, like a trip to a park or a local library. More information is available here."
        },
        {
            "text": "We’re working to allow childminders to spend more time working from outside a home-based location – these changes will also likely come into effect later this year."
        },
        {
            "heading": 3,
            "text": "I’m a parent. How do I find a childminder?"
        },
        {
            "text": "Contact your local authority to find a childminder in your area. You can find your local authority website here."
        }
    ]
}