{
    "url": "https://defrafarming.blog.gov.uk/2024/04/16/laying-the-hedgerow-regulations/",
    "title": "Laying the hedgerow regulations",
    "authors": [
        "Richard Harrison"
    ],
    "categories": [
        "Farming and Countryside Programme"
    ],
    "pub_date": "2024-04-16T14:08:51+01:00",
    "content": [
        {
            "text": "In my last post on hedgerows, I outlined our approach to the future of hedgerow protections and summarised the responses to the consultation held last year. "
        },
        {
            "text": "It was clear from responses that there was overwhelming agreement that hedgerows are valuable assets for wildlife and the environment. Those who responded clearly supported hedgerow protections and we confirmed our commitment to bring in the new regulation.  "
        },
        {
            "text": "We are pleased to tell you that legislation to protect hedgerows has today been laid in both Houses of Parliament. "
        },
        {
            "text": "If approved by Parliament, the Management of Hedgerows (England) Regulations 2024 will put baseline hedgerow management practices into law, providing a consistent approach across all people operating on agricultural land. "
        },
        {
            "text": "This includes: "
        },
        {
            "text": "These practices will be subject to exemptions and derogations as set out in the legislation. They broadly mirror the previous approach under cross compliance. This will make it straightforward for farmers and others who are familiar with the requirements.   "
        },
        {
            "text": "If agreed by Parliament, the regulations will come into force immediately.  "
        },
        {
            "text": "The exception is the buffer strip requirements which will only apply immediately where there is a buffer strip in place already. On land where there is currently no buffer strip, but which is not used for crop production, the rules will apply from 1 July 2024. "
        },
        {
            "text": "Where land is currently in use for crop production, the rules will apply from the end of the first harvest that takes place after the legislation comes into force. This allows time to establish a buffer strip where it is necessary to do that.  "
        },
        {
            "text": "Guidance on the new rules will be available on GOV.UK and we will be speaking with stakeholders about them. I'll update this post with the guidance as soon as it's available."
        },
        {
            "text": "We understand that while most farmers and others, will be familiar with the requirements, some will not be. We will work hard to give people the support they need."
        },
        {
            "text": "The Rural Payments Agency (RPA) will be the regulator and will take an advice-led approach. They will consult on their proposed approach to enforcing the new regulations, subject to Parliament’s approval. "
        },
        {
            "text": "These new regulations underline the government’s commitment to protecting our hedgerows which are valuable assets for our environment and wildlife.  "
        },
        {
            "text": "This includes for our farmland bird species who, as confirmed by the British Trust for Ornithology, are using hedgerows to nest from 1 March to 31 August.  "
        },
        {
            "text": "We know our farmers and land managers are committed to protecting our hedgerows, the regulations will provide a consistent approach. They will be supplemented by the actions being undertaken by many through environmental land management schemes.   "
        }
    ]
}