{
    "url": "https://cyberandspecialistoperationscommand.blog.gov.uk/2024/04/16/new_officers_for_rg/",
    "title": "Royal Gibraltar Regiment welcomes newly commissioned officers",
    "authors": [
        "abievans"
    ],
    "categories": [
        "Gibraltar",
        "Overseas Bases"
    ],
    "pub_date": "2024-04-16T07:50:39+01:00",
    "content": [
        {
            "text": "The Royal Gibraltar Regiment proudly welcomes Officer Cadet Adam Large and Officer Cadet Joseph Pfang, who have successfully completed their training at the Royal Military Academy Sandhurst and will now join the Regiment as Second Lieutenants (2nd Lt)."
        },
        {
            "text": "2nd Lts Large and Pfang were commissioned during an impressive and dignified parade at the Royal Military Academy Sandhurst on Friday 12 April 24, marking the culmination of their rigorous training and the beginning of their careers as officers in the Royal Gibraltar Regiment."
        },
        {
            "text": "Their commitment, dedication, and leadership potential were evident throughout their time at Sandhurst, preparing them for the challenges and responsibilities ahead."
        },
        {
            "text": "As they join the Regiment, 2nd Lts Large and Pfang bring with them a wealth of knowledge, skills, and a strong foundation in military leadership."
        },
        {
            "text": "They will now complete the arduous Platoon Commanders’ Battle Course at the Infantry Battle School in Brecon, Wales, where they will further develop their skills as Infantry Platoon Commanders prior to taking on their responsibilities of leading troops and contributing to the Regiment's mission in Gibraltar."
        },
        {
            "text": "Lieutenant Colonel Matt Moore, Commanding Officer of the Royal Gibraltar Regiment, expressed his pride and confidence in the newly commissioned officers."
        },
        {
            "text": "He commended Officer Cadet Large and Officer Cadet Pfang for their achievements at Sandhurst and their dedication to serving with the Royal Gibraltar Regiment."
        },
        {
            "text": "The commissioning of Officer Cadet Large and Officer Cadet Pfang is a significant moment for both the officers and the Royal Gibraltar Regiment."
        },
        {
            "text": "As they embark on this new chapter in their military careers, the Regiment looks forward to their contributions, leadership, and continued professional development as they serve with honour and distinction."
        }
    ]
}