{
    "url": "https://naturalengland.blog.gov.uk/2024/04/16/providing-guidance-to-protect-habitats-and-threatened-native-species/",
    "title": "Providing guidance to protect habitats and threatened native species",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Biodiversity",
        "Development",
        "Monitoring",
        "Protected sites and species",
        "Science and evidence",
        "Species recovery",
        "Wildlife"
    ],
    "pub_date": "2024-04-16T17:59:07+01:00",
    "content": [
        {
            "text": "As the government’s advisers on the natural environment, Natural England’s role is to ensure our environment is conserved, enhanced and managed for the benefit of people and wildlife."
        },
        {
            "text": "Recent media reports relating to the proposed Norwich Western Link Road, most recently featured on BBC Politics East (14 April), may have given the impression that we are the decision maker in the planning process. This blog seeks to clarify our role and responsibilities."
        },
        {
            "text": "Natural England provides scientific advice about the natural world to the Government, local authorities, and developers so they can design and build sustainable communities without harming Nature. It is not our job to say whether it is more important than other priorities."
        },
        {
            "text": "Natural England’s role in the planning system - as defined by Parliament - is to ensure that the potential environmental impacts of any proposal are taken into account by the relevant decision-making body. That body will weigh up our advice alongside other factors in reaching its decision. This advisory role is in line with part of our statutory purpose to contribute to sustainable development."
        },
        {
            "text": "It is the local planning authority that makes the final decision on local planning applications. When making their decision, planning authorities must consider whether the impacts on protected species have been addressed in line with the relevant environmental laws. Natural England provides guidance for local planning authorities on protected species and development."
        },
        {
            "text": "For the Norwich Western Link (NWL) the local planning authority is Norfolk County Council. The Council is also the developer for the scheme. As the developer, it is the Council’s responsibility to show there is no satisfactory alternative to their scheme and that the conservation status of the bats will not be negatively affected by the scheme."
        },
        {
            "text": "On the Council's application for the NWL, and their previous scheme for the Norwich Northern Distributor Road, Natural England has been working closely with them and the Council has been aware that the current road proposal may affect the population of Barbastelle bats for more than 10 years. Barbastelle bats are protected by environmental laws."
        },
        {
            "text": "A question was raised about the Favourable Conservation Status definition for Barbastelles, which was published on 8 March 2024. Natural England publishes Favourable Conservation Status (FCS) definitions that describe the conditions in which priority species and habitats can be considered thriving across their range. This is part of a series of FCS definitions Natural England is publishing, endorsed by Defra in 2015, to help Local Planning Authorities and other statutory bodies where protected species are potentially impacted by development."
        },
        {
            "text": "These assessments do not introduce new targets or rules, but are intended to provide the most comprehensive overview of current knowledge on status to help planners, decision makers and practitioners meet their aspirations and legal duties to protect and recover nature."
        },
        {
            "text": "The FCS Test is a key stage in wildlife licensing and for Habitats Regulations Assessments, where bodies are required to determine whether a development or project is likely to impact on FCS for habitats and species. Natural England publishes FCS definitions at an England level to collate evidence to assist with this process."
        },
        {
            "text": "At the UN Biodiversity Conference in December 2022 (COP15), the UK formally made commitments to, among other things, reduce the risk of extinction faced by threatened species and to protect and conserve a minimum of 30% of land and sea for biodiversity by 2030. Known as 30x30, this latter target is an overarching commitment of the government’s Environmental Improvement Plan and key to Natural England’s mission of building partnerships to achieve thriving Nature for people and planet."
        }
    ]
}