{
    "url": "https://moderncivilservice.blog.gov.uk/2024/04/16/stop-think-fraud-home-office-led-campaign-empowers-people-to-protect-themselves-against-fraud/",
    "title": "Stop! Think Fraud: Home Office-led campaign empowers people to protect themselves against fraud",
    "authors": [
        "Government Reform"
    ],
    "categories": [
        "A Modern Civil Service",
        "Ambitious",
        "Government Reform",
        "Modernisation and Reform",
        "Operational Delivery",
        "Proud Civil Servant"
    ],
    "pub_date": "2024-04-16T13:41:48+01:00",
    "content": [
        {
            "text": "Fraud accounts for around 38% of all estimated crime in England and Wales, that’s nearly one in 17 adults who fall victim to fraud every year, and the cost of fraud to society is estimated to be £6.8 billion a year. An Ambitious Civil Service is one that finds new solutions for challenges like fraud, with outcomes for the public."
        },
        {
            "text": " Stop! Think Fraud is a new campaign that launched in February 2024, led by the Home Office and in partnership with many organisations across government, law enforcement and industry including banking, tech, retail, and charities. Its aim is to give people the tools and information they need to stay ahead of scams and help protect themselves against criminals. "
        },
        {
            "text": "The general public will see advertising including posters on billboards and adverts on ITV, Sky, Disney, plus radio and online video such as YouTube."
        },
        {
            "heading": 2,
            "text": "A key priority for the Home Office"
        },
        {
            "text": "The launch of Stop! Think Fraud is a significant milestone in the Home Office’s delivery of the Fraud Strategy, published in May 2023, which set out a programme of ambitious actions to reduce fraud by 10%, based on 2019 levels, by the end of this parliament. Since the fraud strategy was launched, there has been a 13% drop in fraud, which is a sustained reduction."
        },
        {
            "text": "Fraud is also a key revenue stream to fund wider crime including organised crime groups, organised immigration crime and terrorism. By cutting access to funding, this will also contribute towards controlling migration, reducing terrorism, and tackling serious and organised crime."
        },
        {
            "heading": 2,
            "text": "Collaboration across Government and beyond"
        },
        {
            "text": "To develop and deliver the new campaign, the Home Office communications and policy teams adopted a systems approach, working with colleagues from the National Crime Agency (NCA) and National Cyber Security Centre (NCSC), City of London Police, and the Department for Science, Innovation and Technology (DSIT). It was truly a collaborative, one system approach."
        },
        {
            "heading": 2,
            "text": "Encompassing Home Office values"
        },
        {
            "text": "This was a huge piece of work and the team ensured they adopted the Home Office values to deliver it successfully. Utilising all their strengths as collaborative Civil Servants, engaging with stakeholder groups that would enable all the perspectives of issues affecting fraud victims, and compassionately thinking about the extensive audiences the campaign could possibly reach including victims who had been marginalised or didn't know that they weren't alone. The team were respectful of diverse views and focuses of current fraud campaigns and courageous in their approach to developing a simple campaign that unified messaging across the board against fraud."
        },
        {
            "heading": 3,
            "text": "Driving a systems approach"
        },
        {
            "text": "Better Shared Outcomes through a systems approach is a key part of the Home Office Organisational Strategy and the collaborative nature of the Stop! Think Fraud campaign is an excellent example of this. It also clearly encompasses the vision for A Modern Civil Service, one that is skilled, innovative and ambitious in providing high quality advice to the Government, outstanding services to the public and safeguarding the UK’s prosperity and security at home and overseas. "
        },
        {
            "heading": 3,
            "text": "Evaluation"
        },
        {
            "text": "The first burst of the paid-for marketing ran in February and March, a full evaluation of phase one is underway. This will help us to understand shifts in fraud-related attitudes and behaviours as a result of the campaign. Results of the evaluation are due in May and will be used to inform future communications activity. The second phase of the campaign is due to go live in June, which will again be accompanied by a robust evaluation plan to measure its impact on public attitudes and behaviours."
        }
    ]
}