{
    "url": "https://ace.blog.gov.uk/2024/04/16/unmasking-deception-join-the-deepfake-detection-challenge/",
    "title": "Unmasking deception: join the Deepfake Detection Challenge! ",
    "authors": [
        "Kate Shanks"
    ],
    "categories": [
        "Artificial Intelligence",
        "Innovation",
        "Law enforcement",
        "Security"
    ],
    "pub_date": "2024-04-16T12:55:03+01:00",
    "content": [
        {
            "text": "Rapid advances in generative artificial intelligence are accelerating the evolution of deepfakes. As they become increasingly sophisticated and convincing, creating deepfakes grows ever easier. Results that were once the preserve of Hollywood studios – and budgets – can now be achieved in minutes on a laptop or even a smartphone at almost zero cost."
        },
        {
            "text": "As with most recent technology, criminals and bad actors have been early adopters, with the potential for deepfakes to go mainstream across a range of harmful activity, such as fraud, online child sexual exploitation and abuse, intimate image abuse as well as election interference."
        },
        {
            "text": "Deepfake detection is challenging, and the public is becoming increasingly aware of the threats it poses; policing and government more widely want to ensure we are equipped with the tools to address the problem at the necessary pace and scale. Risks of deepfakes include fake news, hoaxes, financial fraud, intimate image abuse (‘revenge porn’) and child sexual abuse material."
        },
        {
            "text": "Given these increasing risks, the Home Office, the Department for Science, Innovation and Technology, the Alan Turing Institute, and the Accelerated Capability Environment (ACE) have come together to launch a Deepfakes Detection Challenge. The Challenge will see us working with Government departments, policing and security, industry and academia to carry out fast paced, phased work to assess what the current situation is, determine existing capabilities and identify gaps requiring innovative approaches and novel solutions to overcome the challenges that deepfakes pose."
        },
        {
            "text": "We have already launched the Challenge with two Discovery Workshops for policy (invited guests from HMG) and technology (invited guests who are specialists in deepfake technology) in March."
        },
        {
            "text": "We will be hosting a briefing event for the Challenge on 1st May in Central London and are keen to get industry leaders in this space involved. We will be asking public sector organisations, industry and academia to register their interest in participating in the Challenge via EventBrite. We welcome interest from organisations and academics who would like to join forces and work together in a rainbow team on the Challenge. We will be using a synthesised data repository which we will be generating as part of this project."
        },
        {
            "text": "The Challenge will culminate in a Showcase later in the year where industry leaders in this space will demonstrate practical solutions to the threats from deepfakes. We will assess and evaluate these state-of-the-art tools and they will support evidence-based decisions for FY 24/25 on where to invest to accelerate HMG and law enforcement agency capability. The work of the Deepfake Challenge will build on advances in HMG’s capabilities to make it easier to address the threat."
        },
        {
            "text": "If you would like to get involved, please sign up through Eventbrite."
        }
    ]
}