{
    "url": "https://buyingforschools.blog.gov.uk/2024/04/16/what-is-social-value-and-how-can-schools-and-trusts-benefit-from-it/",
    "title": "What is social value and how can schools and trusts benefit from it?",
    "authors": [
        "Stacey Speakman, Commercial Lead for Get help buying for schools"
    ],
    "categories": [
        "Advice and support"
    ],
    "pub_date": "2024-04-16T12:26:02+01:00",
    "content": [
        {
            "text": "Stacey Speakman is a Commercial Lead for Get help buying for schools, the DfE’s free procurement service for schools and trusts."
        },
        {
            "text": "In this blog post, Stacey explains why the service wants to work with schools and trusts to ensure they are getting not just value for money, but wider social value from their procurements, and why schools shouldn’t be afraid to ask suppliers what additional value they can bring to the table."
        },
        {
            "text": "Social value refers to the positive impact that a procurement decision can have beyond the core deliverables of a contract. It is the overall value that schools and trusts can gain from money that is spent on procurement with suppliers."
        },
        {
            "text": "When we talk about value we mean it in the broadest sense of the word, including benefits through economic, environmental, or social outcomes. Social value should not risk good value but should be part of the overall value for money of a contract."
        },
        {
            "text": "How can Get help buying for schools help?"
        },
        {
            "text": "Schools and trusts are at the heart of their local communities, and we want to help you get even more social value from your contracts. You have significant spending power, especially when working together. Suppliers want your business, so be clear about what additional value they can bring to your school or trust and build it into your pre-procurement planning."
        },
        {
            "text": "When a supplier responds to your invitation to tender they will have to demonstrate how they will meet your social value requirements, as well as your financial requirements."
        },
        {
            "text": "One example of how Get help buying for schools can help with this is through the changes we have made to our catering quality questions, to include social value questions. This will enable a school or trust working with us to pick the most appropriate social value outcomes, such as demonstrating how the supplier will reduce their carbon footprint of food supplies, improve energy efficiencies, minimise waste and recycling, and reduce single use plastics. These questions are scored and are monitored through contract management and KPIs."
        },
        {
            "text": "We are also working with our public sector buying partners to ensure they are offering schools and trusts wider benefits beyond financial savings."
        },
        {
            "text": "In the future we want to make it easier for schools or trusts who use our service to specify the social value outcomes they would like in the procurements we work with them to deliver, under the following headings:"
        },
        {
            "text": "Some examples of social value might include:"
        },
        {
            "text": "How do you ensure you are building social value into your procurement planning?"
        },
        {
            "text": "Every procurement process is unique and any social value outcomes must be relevant to the contract. It is important to consider social value at the point of building your specification so you can use it as part of your evaluation process. Be bold and be clear to potential suppliers about what would add additional value to you and your community."
        },
        {
            "text": "Most important of all is the contract management phase, where the social value outcomes promised in the tender bid can be demonstrated and managed. Holding suppliers to their commitment is key."
        },
        {
            "text": "Need support with your next big procurement and maximising social value?"
        },
        {
            "text": "We know not many schools and trusts employ a procurement specialist so social value might not be something your organisation understands how to maximise."
        },
        {
            "text": "If you have a big procurement coming up (we encourage you to plan a year ahead!) and want to speak to us about how you can maximise social value, then please get in touch with the team and we’d be happy to work with you."
        },
        {
            "text": "If you’ve found this article useful and want to learn more about how we’re supporting schools, click ‘sign up and manage updates’ to subscribe to our blog and receive notifications when we next post."
        }
    ]
}