{
    "url": "https://ukhsa.blog.gov.uk/2024/04/16/whos-eligible-for-the-2024-covid-19-vaccine-or-spring-booster/",
    "title": "Who’s eligible for the 2024 COVID-19 vaccine, or ‘Spring Booster’?",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Coronavirus (COVID-19)",
        "immunisations"
    ],
    "pub_date": "2024-04-16T10:54:37+01:00",
    "content": [
        {
            "text": "As we move into spring, protection from any earlier COVID-19 vaccination you may have had will be starting to wane. For those who are more likely to become seriously ill from COVID-19, the NHS offers a free vaccine in the spring to top up their protection, previously known as the ‘Spring Booster’."
        },
        {
            "text": "Current vaccines provide good protection against severe disease and hospitalisation. UKHSA surveillance data relating to last spring’s programme shows that those who received a vaccine were around 50% less likely to be admitted to hospital with COVID-19 from 2 weeks following vaccination, compared to those who remained unvaccinated."
        },
        {
            "text": "According to World Health Organization data, 400,000 lives in England are estimated to have been saved up to March 2023 due to the COVID-19 vaccine programme."
        },
        {
            "heading": 2,
            "text": "Are you eligible to top up your COVID-19 protection this spring?"
        },
        {
            "text": "While you might have received your COVID-19 vaccine during winter or in past ‘Spring Booster’ campaigns, the criteria for this year’s spring vaccine have changed slightly:"
        },
        {
            "text": "As you can see, the criteria are similar to the spring 2022 and spring 2023 booster campaigns, but this year the criteria for the immunosuppressed group has lowered to include those 6 months and over."
        },
        {
            "text": "The eligibility is the same across the four nations of the UK (England, Scotland, Wales and Northern Ireland)."
        },
        {
            "heading": 2,
            "text": "Let’s explain the age-based criteria"
        },
        {
            "text": "Those who are aged 75 and over can come forward to top up their protection this spring. If you are 74 but turn 75 years old by 30 June 2024, you don’t have to wait for your birthday to come forward."
        },
        {
            "heading": 2,
            "text": "What about residents, and staff in care homes?"
        },
        {
            "text": "Those who are a resident in care homes for older adults are also eligible. Carers and staff in care homes are not eligible, this is because the spring vaccine is targeted towards providing protection to those most vulnerable to severe disease."
        },
        {
            "heading": 2,
            "text": "I have a weakened immune system, am I eligible this spring?"
        },
        {
            "text": "We understand that having a weakened immune system (immunosuppression) is a lot less straight forward than the other criteria. Looking online can cause even more confusion, as people might see themselves (and be considered by others) as immunosuppressed but might not fit the immunosuppression criteria for vaccination."
        },
        {
            "text": "So, what are the immunosuppression criteria? Eligibility is outlined in Chapter 14a of the Green Book, a document published by UKHSA specifically for public health professionals. It can be a complicated document for non-experts, so we've listed some of the groups here:"
        },
        {
            "text": "While this list summarises some major groups, it does not cover everything. Please check online at nhs.uk/get-vaccine to see if you are eligible."
        },
        {
            "heading": 2,
            "text": "How do I get my spring COVID-19 vaccine?"
        },
        {
            "text": "You should come forward rather than waiting for the NHS to contact you this year. You will be able to book your vaccine online at nhs.uk/get-vaccine from 15 April 2024. If you or someone you know can’t get online, book by calling 119 free of charge, where a translator is available if needed."
        },
        {
            "text": "While having your spring vaccine around 6 months after your last dose is the usual timeframe, you can have it as soon as 3 months after a previous COVID-19 vaccine dose. If you are eligible, you can get protection from a spring COVID-19 vaccination even if you have not taken up a COVID-19 vaccine offer in the past. Most people do not need extra vaccinations to make up for any they have missed, but your doctor may advise a further dose if you have a severely weakened immune system."
        },
        {
            "text": "It is important that everyone who is eligible takes up the offer this spring before the vaccination programme closes on 30 June 2024."
        }
    ]
}