{
    "url": "https://dluhcdigital.blog.gov.uk/2023/06/22/building-a-reusable-service-for-government-funds/",
    "title": "Building a reusable service for government funds",
    "authors": [
        "Ruth Keeling"
    ],
    "categories": [
        "Funding service design"
    ],
    "pub_date": "2023-06-22T12:27:18+01:00",
    "content": [
        {
            "text": "DLUHC’s funding service design team are celebrating this month after our new Access funding tool launched the latest round of the Community Ownership Fund and, just a week later, a new round of the Night Shelter Transformation Fund.  "
        },
        {
            "text": "This is a huge moment for us. Our team was set up in 2021 to transform the way DLUHC delivers funding, starting with a service which could manage funding applications and assessments for multiple DLUHC funds. You can read more about our origins in one of our earlier blogs. "
        },
        {
            "text": "We piloted first with Community Ownership Fund, and we have already run multiple rounds of this fund which helps community groups buy treasured local assets. But the real test is to build a platform that multiple funds can use, and launching this month’s round of Night Shelter Transformation Fund is a critical milestone on that journey. "
        },
        {
            "heading": 3,
            "text": "Why build a service for multiple funds "
        },
        {
            "text": "Building a single funding service which multiple funds can use saves time and money both for the department and for the hundreds of organisations accessing government funding.  "
        },
        {
            "text": "By replacing multiple internal systems with one service, we are reducing duplication and generating savings within DLUHC, saving money which could be better spent elsewhere.  "
        },
        {
            "text": "By listening to users - external applicants and our internal assessors - we are designing a service that is simpler and quicker to use, reducing the time it takes to apply for funding and the time to assess an application for funding. For fund recipients who are accessing more than one DLUHC fund, the user experience will be similar across multiple funds, again saving time and making the process simpler for them. "
        },
        {
            "text": "Last but not least, by collecting data across multiple funds in a more consistent and intelligent way, DLUHC will have a better understanding of the impact of its funding across multiple funds. This will allow it to make better funding decisions in future, making sure the money is delivering the intended outcomes because we have better evidence of what works. "
        },
        {
            "heading": 3,
            "text": "The road ahead "
        },
        {
            "text": "Although we have been very busy getting ready for the launch of two funds on 'Access funding' in June, there is no rest for the Funding Service Design team and plenty more to do. "
        },
        {
            "text": "This year 'Access funding' will be taking on many more DLUHC funds - now that we know we can serve multi-funds at the same time, we want to onboard as many as we possibly can, as quickly as we can. We are also interested in finding out if another government department might want to use the same platform, so get in touch if you have a fund which could use our application and assessment service. "
        },
        {
            "text": "We are also mid-way through building another multi-fund service 'Report funding progress', where fund recipients will report whether the funding is being spent as expected and what outcomes are being delivered.  "
        },
        {
            "text": "In addition to all the above, we are talking to users about what the next biggest pain points are for them in the funding system. Based on those conversations, we will identify where we should focus our efforts next, whether it is giving fund applicants access to old application data so they can re-use it in a new application, better visualisation of fund performance data or capturing qualitative data about whether funding is delivering the expected outcomes or not. "
        },
        {
            "text": "We’ll update again soon, and if you want to know more in the meantime, please contact fundingservicedesign@levellingup.gov.uk"
        },
        {
            "text": "The funding service design team is growing. If you like what you’ve read and are interested in joining us, make sure to check our current job opportunities for service designers, software developers and delivery managers."
        }
    ]
}