{
    "url": "https://rpc.blog.gov.uk/2023/06/22/how-the-work-of-the-regulatory-policy-committee-supports-the-nolan-principles/",
    "title": "How the work of the Regulatory Policy Committee supports the Nolan Principles",
    "authors": [
        "Stephen Gibson"
    ],
    "categories": [
        "Better regulation",
        "Evaluation",
        "Independent scrutiny"
    ],
    "pub_date": "2023-06-22T10:11:56+01:00",
    "content": [
        {
            "text": "The Seven Principles of Public Life (also known as the Nolan Principles) are: Selflessness, Integrity, Objectivity, Accountability, Openness, Honesty and Leadership."
        },
        {
            "text": "The principles apply to anyone who works as a public office-holder including all those who are elected or appointed to public office, and all people appointed to work in the Civil Service, local government, the police, courts and probation services, non-departmental public bodies (NDPBs), and in the health, education, social and care services. The principles also apply to all those in other sectors delivering public services."
        },
        {
            "text": "The third of the seven principles, Objectivity, is defined by the Committee on Standards in Public Life as:"
        },
        {
            "text": "The fourth, Accountability, requires that:"
        },
        {
            "text": "The sixth principle is Openness. This requires that:"
        },
        {
            "text": "These principles are at the very core of the work of the RPC and the objectives of the Better Regulation Framework – we support them in our independent scrutiny of Impact Assessments (which set out the evidence and analysis underpinning government regulatory proposals) and Post Implementation Reviews (which assess how far regulations have achieved their objectives and whether they have led to unintended consequences)."
        },
        {
            "text": "By independently reviewing Impact Assessments (IAs) and Post-implementation Reviews (PIRs) for robustness, impartiality and fitness for purpose, the RPC supports ministers in ensuring that the regulatory decisions they take are Objective."
        },
        {
            "text": "By submitting PIRs to the RPC for independent scrutiny, Ministers demonstrate that they are Accountable for previous decisions and actions and have gone through the scrutiny necessary to ensure this."
        },
        {
            "text": "By publishing the reasoning behind our opinions on government IAs and PIRs, the RPC ensures Openness and transparency about the quality of evidence and analysis underpinning government regulatory decisions."
        }
    ]
}