{
    "url": "https://food.blog.gov.uk/2023/06/22/how-we-continue-to-support-local-authorities-through-challenging-times/",
    "title": "How we continue to support local authorities through challenging times",
    "authors": [
        "Katie Pettifer, Director of Strategy and Regulatory Compliance"
    ],
    "categories": [
        "Our mission",
        "Partners"
    ],
    "pub_date": "2023-06-22T13:21:27+01:00",
    "content": [
        {
            "text": "Local authorities were on the frontline of the COVID-19 pandemic in many ways, including helping the food industry maintain a safe food supply to the nation."
        },
        {
            "text": "This huge effort came at a cost, both in terms of the pressure on staff and in the backlog of routine inspections of food businesses that built up while many were closed and local authorities were concentrating on their emergency response. This is why the FSA launched the Local Authority Recovery Roadmap in 2021. We wanted to support recovery and a return to business as usual following a tumultuous period managing the impact of COVID-19."
        },
        {
            "text": "During the pandemic, almost half of the staff working in local authority food teams were diverted to other priority work. The Recovery Roadmap allowed local authorities to focus on the highest-risk food businesses, with greater flexibility where risks were lower."
        },
        {
            "text": "In Local Authority Recovery Plan Assurance Assessment (tranche 2): summary report (England), the latest of a series of reports on the implementation of the roadmap across England, Wales, and Northern Ireland we can see how collaborative working with other council teams, external agencies, and emergency services enabled local authorities to share intelligence on local food businesses, plan interventions, and triage of new businesses."
        },
        {
            "text": "Thanks to the dedication and hard work of local authority food teams, interventions at the highest-risk businesses were brought back on track, while significant progress has also been made with lower-risk businesses. This meant we were able to end the Recovery Roadmap in April, and we are working with Local Authorities this year to return to full pre-pandemic levels of performance.”"
        },
        {
            "text": "But this does not mean we can take our eye off the ball. Local authorities continue to manage huge challenges. Alongside normal delivery, they are still working to bring down the remaining backlog of lower-risk businesses awaiting inspection.  And, as they visit businesses that have not been inspected for some time, some are finding issues that take additional time and resources to resolve.  So, it remains vital that they have the resources they need to do the job."
        },
        {
            "text": "Funding is an ongoing challenge, but we also know that some local authorities are experiencing difficulties in recruiting and retaining qualified staff. To build a better picture of these problems, we have commissioned research from Ipsos UK. We plan to publish the findings shortly and will work with local authorities, professional bodies and other stakeholders on potential solutions."
        },
        {
            "text": "We knew, even before the pandemic, that we needed to modernise the way food standards controls are delivered, to make sure food teams can put their effort in the right places as the food system evolves.  That becomes even more important in light of these challenges.  This year, we have updated the Food Law Code of Practice and introduced a new food standards delivery model in England and Northern Ireland. The new model will help local authorities focus their resource on food businesses that pose the greatest risk to the public and make better use of intelligence to drive regulatory activity."
        },
        {
            "text": "I would like to thank local authority food team staff for their ongoing hard work and commitment to protecting their communities.  Like them, the FSA will always make food you can trust our number one priority."
        }
    ]
}