{
    "url": "https://socialcare.blog.gov.uk/2023/06/22/learning-disabilities-week-dispelling-misconceptions/",
    "title": "Learning Disability Week: dispelling misconceptions",
    "authors": [
        "Laura Storey"
    ],
    "categories": [
        "Events",
        "learning disabilities",
        "Viewpoint",
        "Workforce"
    ],
    "pub_date": "2023-06-22T10:43:19+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Education and awareness"
        },
        {
            "text": "I’m the service manager at Cygnet Social Care's Outwood facility, a lovely 10 bed residential service in the suburbs of Horsforth in Leeds where we care for individuals with learning disabilities and complex needs."
        },
        {
            "text": "This week is Learning Disabilities Week (19-25 June). This year, the aim is to show the world the incredible things people with a learning disability achieve, smashing misconceptions about what people can do and shining a light on the stigma many still face everyday. The purpose of the week is always to educate people and raise awareness, making sure more of us achieve an understanding of what life is like for people with learning disabilities."
        },
        {
            "text": "Here at Outwood, we support a wide variety of people here to do all kinds of activities – swimming, education and work based provisions, adaptive cycling, horse riding, the cinema, meals out, local walks, hiking, museums, trips to the seaside, theatre, sensory rooms and holidays in the UK and abroad. The care provided is as person-centred and meaningful to each individual as possible. All activities are based on people’s needs and their likes. If something isn’t suitable, we always adapt and find a solution to enable us to do it in a fun and safe way."
        },
        {
            "text": "I’m not sure there are necessarily myths about people with learning disabilities, but I often feel the people we support can be vastly underestimated. The resilience, self-regulatory strategies and challenges they overcome each day are fantastic. All the individuals we support are capable of progression, learning new things and finding ways to overcome anxieties and challenges."
        },
        {
            "heading": 2,
            "text": "Creating calm in the chaos"
        },
        {
            "text": "Tasks we would find simple can create sensory overload, cause anxiety, inconsistency and unpredictability. Something as lovely for many people as Christmas can be tough. It means the shops close, everywhere is busier, there can be sensory overload, more events taking place, and it creates anxiety that things might not be the same."
        },
        {
            "text": "Small adaptations and provisions, like giving advanced warning of an event or change in routine, can make the world of difference. This might include allowing access to quiet spaces to regroup and self-regulate, providing accessible information or extra time at appointments. Sometimes, something as simple as fidget toys and ear defenders can help people lead happy, meaningful lives."
        },
        {
            "text": "A fantastic example is our fake shop, which we created when the local shop closed down. One of our residents finds the other shops around us too overwhelming. Rather than cancel the activity, the staff recreated the experience next door and the resident could enjoy that much needed part of their routine, minus the anxiety."
        },
        {
            "text": "Progress and success can come in many forms and I’m constantly amazed by the achievements of the individuals we support. The most detrimental thought process we can have is ‘that’s the way we’ve always done it’. Aiming high and putting simple provisions in place can make all the difference and enable a successful intervention. It's all about positive risk taking and trying new things."
        },
        {
            "text": "Progress can be anything from accepting a vaccination or medical appointment after a desensitisation plan, making their own meals with support, or learning to use one or two new words or Makaton signs. All progress is individualised and every achievement celebrated."
        },
        {
            "text": "I’m very proud to run a service with a team committed to the development and wellbeing of the individuals we support. Their dedication, acts of kindness, creativity, and 'above and beyond' attitude are humbling. They will always come together in times of need. I look forward to supporting people to achieve more in the coming years – we have holidays abroad planned, returns to education, medical interventions, parties to organise, Makaton to learn and new individuals to welcome into the home."
        }
    ]
}