{
    "url": "https://educationhub.blog.gov.uk/2023/06/national-windrush-day-how-we-teach-children-about-black-history/",
    "title": "National Windrush Day: How we teach children about Black history",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Curriculum",
        "Schools"
    ],
    "pub_date": "2023-06-22T09:28:37+01:00",
    "content": [
        {
            "text": "National Windrush Day 2023 marks the 75th anniversary of the arrival of the passengers of the Empire Windrush to the UK. The day celebrates the vital contribution and achievements of the Windrush generation and their descendants."
        },
        {
            "text": "The freedom and flexibility of the national curriculum mean that historic events such as Windrush can be taught in schools, and many teachers and schools already make sure that these are discussed in the classroom."
        },
        {
            "text": "Learning about how different groups have contributed to the development of Britain to make us the nation we are today is a key part of a broad and balanced curriculum. This includes reflecting the voices and experience of Black people."
        },
        {
            "heading": 3,
            "text": "How is Black history taught in schools, including events like the arrival of the Empire Windrush? "
        },
        {
            "text": "History is a varied and diverse subject and Black history can be appropriately embedded into the curriculum."
        },
        {
            "text": "Here are just some examples of where Black history can be taught using the national curriculum:"
        },
        {
            "text": "We’re currently developing a new Model History Curriculum that will be published next year."
        },
        {
            "text": "The Model History Curriculum will support schools to teach history content that is high-quality and diverse. It will include teaching on how Britain has influenced and been influenced by different societies and communities. It will also reflect the richness of world history – teaching pupils about societies and civilisations both within and beyond Europe."
        },
        {
            "heading": 3,
            "text": "Useful resources to teach children about Black history"
        }
    ]
}