{
    "url": "https://nationalscreening.blog.gov.uk/2023/06/22/new-guidance-on-submitting-screening-research-requests-to-the-uk-nsc/",
    "title": "New guidance on submitting screening research requests to the UK NSC",
    "authors": [
        "Professor Sian Taylor-Phillips"
    ],
    "categories": [
        "General"
    ],
    "pub_date": "2023-06-22T09:56:29+01:00",
    "content": [
        {
            "text": "We have published guidance for screening researchers who want to ask the UK National Screening Committee’s (UK NSC’s) research and methodology group (RMG) for advice."
        },
        {
            "text": "The guidance, UK NSC RMG: submitting research requests, will help make sure the UK NSC has the evidence it needs to deliver high quality policy advice to the 4 UK governments. It describes the processes the RMG will use to advise researchers on designing effective studies with good targets that can influence screening programme policy."
        },
        {
            "text": "The new publication includes a downloadable research request form which has been designed to help applicants make sure proposals fall within the remit of the UK NSC and the RMG. These research requirements are distinct from those used by other organisations such as the National Institute for Health and Clinical Excellence."
        },
        {
            "text": "The new guidance sets out the information the committee needs to see to be able to provide good advice about all aspects of screening. We hope it will help ensure future screening research is impactful."
        },
        {
            "heading": 2,
            "text": "Key principles "
        },
        {
            "text": "Many health service interventions or programmes fall outside the UK NSC’s broadened remit (which covers population, targeted and stratified screening)."
        },
        {
            "text": "The UK NSC only looks at systematic end-to-end quality-assured national screening programmes. It does not examine, or make recommendations on, clinical management or risk assessment as part of routine clinical care. See UK NSC terms of reference  for more information."
        },
        {
            "text": "Applicants requesting RMG advice should explain the pathway of the screening programme to which their research will contribute. This will help the RMG understand if the research is relevant to UK NSC policy recommendations. It will also clarify how proposals can help meet the UK NSC’s evidence review criteria and evidence thresholds, for example that:"
        },
        {
            "text": "Applicants should also make sure submissions align with the UK NSC’s ethical principles to:"
        },
        {
            "heading": 2,
            "text": "Important information to include in submissions"
        },
        {
            "text": "In the new RMG request form, we ask applicants to provide detailed information about the research they are proposing."
        },
        {
            "text": "This includes providing a pathway diagram for the screening programme they want to research. This should include the screening cohort, how people would be contacted, the screening test, follow-up diagnostics, treatment, care and health outcomes."
        },
        {
            "text": "Applicants should also set out which evidence gaps their proposals would address and the research methods they would use."
        },
        {
            "text": "We set the bar deliberately high for high-quality peer-reviewed screening evidence because we know:​"
        },
        {
            "text": "In general, research proposals should include a non-screened comparator, most usually in the context of a randomised controlled trial (RCT), because:"
        },
        {
            "text": "Proposals should consider if screening would find other conditions incidentally and how the detection and care of those incidental findings could affect the balance of benefit and harm of a screening programme."
        },
        {
            "text": "The UK NSC concentrates on the impact screening has on the people offered screening and tends to focus on morbidity and mortality outcomes. Where possible, we prefer to measure this in one large RCT, to make sure we know what effect the programme has over and above usual NHS diagnosis and care. However, we recognise this is not always possible. For example, a large trial would not be feasible when considering screening newborn babies for rare diseases, so instead we link together other good quality evidence to understand the impact on outcomes."
        },
        {
            "text": "Screening is not perfect. There will be people who receive information that says they have a condition when they do not, or that they do not have a condition when they do. The aim of research, technical innovation and quality assurance is to minimise these shortcomings. Screening programmes are offered by the NHS to people who have not sought advice on a condition, so it is ethically proper that potential harms as well as benefits are carefully explored and can be explained to individuals."
        },
        {
            "text": "As you can see, there is plenty for applicants to consider before deciding whether to submit a research request to the RMG. We look forward to providing advice on the implications and requirements of research proposals that fall within the UK NSC’s remit."
        },
        {
            "text": "The RMG meets 4 times a year and any submissions received up to 4 weeks before a meeting date will be evaluated at that meeting. We will aim to respond to applicants within 6 weeks of our meetings."
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK National Screening Committee. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, email screeninginformation@dhsc.gov.uk."
        }
    ]
}