{
    "url": "https://environmentagency.blog.gov.uk/2023/06/22/securing-englands-water-resources-right-now-and-for-the-future/",
    "title": "Securing England’s water resources: right now, and for the future",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Regulated industry",
        "Water"
    ],
    "pub_date": "2023-06-22T13:12:30+00:00",
    "content": [
        {
            "text": "The current hot, dry weather we are experiencing is a reminder of how precious water resources are in England. As demands for water increase, river, reservoir and underground aquifer levels have started falling in many areas and we are already seeing the impacts:"
        },
        {
            "text": "On 28 June, we will chair the National Drought Group to bring all sectors together to support and manage water supplies across England and ensure we are ready if the hot, dry weather persists throughout the summer."
        },
        {
            "text": "That deals with the immediate pressures, but the Environment Agency also has a role to ensure the nation has secure, sustainable water supplies that protect and enhance the environment in the long term, too. Today we have published a summary of our views on England’s draft Regional and Water Resource Management Plans."
        },
        {
            "text": "These plans are part of water companies’ statutory duty to set out how they will supply water in their area over the next 25 years. In addition, regional water resources groups have produced regional plans that cover all water companies in a region and also include non-public water supply interests. Together the plans set out how they will deliver the Environment Agency’s National Framework for Water Resources, published in March 2020, which provides a picture of England’s future water needs across sectors and by region up to 2050."
        },
        {
            "text": "This next round of plans will be implemented from 2024.  They mark a pivotal moment in how we secure England’s water resources. The scale of the challenges ahead are only increasing - by 2050 we face a gap between supply and demand of approximately 4 billion litres of water per day."
        },
        {
            "text": "The report we have published today (22 June) summarises the information contained in the plans and sets out our views of how the plans meet the expectations of both us and government."
        },
        {
            "text": "Our views on the draft water resources management plans"
        },
        {
            "text": "We are pleased to see that water companies are proposing significant investment to meet the challenges of climate change, increase resilience and protect the environment. The country needs this investment and the decisions around the delivery of these schemes will have lasting implications for generations to come."
        },
        {
            "text": "However, overall the quality of both sets of plans has to be improved to ensure they meet water resources planning guidelines and requirements fully. We want to see greater transparency around the options assessments that have been carried out so that we are more confident that they truly represent best value for society."
        },
        {
            "text": "The draft regional plans show a lack of detail and evidence in some areas, including the needs of non-public water supply sectors. It is critical that regional groups are improving evidence and ensuring effective engagement with other sectors."
        },
        {
            "text": "Government expects water companies to act quickly and take significant steps forward on installing smart meters and delivering on their water efficiency commitments for both households and non-households. Currently draft plans do not go far enough in reducing non-household (business) consumption against Government’s 9% reduction by 2037/38."
        },
        {
            "text": "The Government’s recently published Plan for Water sets out that the best way to manage supply pressures is by taking an integrated approach across the whole catchment. We also expect water companies and regional groups to play a key role in the development and delivery of this approach in the future."
        },
        {
            "text": "Whilst there is still more work to do to ensure the plans meet Government and the Environment Agency’s expectations, there are some significant successes in the water resources management plans that should be noted:"
        },
        {
            "text": "We expect water companies and regional planning groups to make changes in response to their consultations. Therefore, the figures and options set out in our report will change in the future."
        },
        {
            "text": "So, what next?"
        },
        {
            "text": "Water companies have until August this year to publish their water resources management plan ‘statements of response’ to our comments. They must set out how the company has considered the responses it has received and the changes that it has made or will make as a result."
        },
        {
            "text": "The Environment Agency will then review their submissions again and provide advice to the Secretary of State for Environment, Food and Rural Affairs. The Secretary of State will then decide whether the plan can be published or whether further changes are needed. If the plan has unresolved issues or significant public interest, the Secretary of State may call for a public hearing, inquiry or examination in public."
        },
        {
            "text": "We expect regional groups to take account of the responses they have received on their regional water resources plans and look to produce final plans later in 2023 or early 2024. Regional groups must ensure that final regional plans align and reflect final Water Resource Management Plans."
        }
    ]
}