{
    "url": "https://apprenticeships.blog.gov.uk/2023/06/22/showing-pride-in-business-top-tips-for-pride-month/",
    "title": "Showing pride in business: top tips for Pride Month",
    "authors": [
        "Institute for Apprenticeships"
    ],
    "categories": [
        "Employers",
        "LGBTQ+",
        "Pride",
        "The Institute"
    ],
    "pub_date": "2023-06-22T09:43:00+01:00",
    "content": [
        {
            "text": "June is Pride month - a month dedicated to celebrating LGBTQ+ communities all around the world."
        },
        {
            "text": "And to mark it, Kristofer McGhee, LGBTQ+ advocate and General Counsel for IfATE, provided these tips for businesses."
        },
        {
            "text": "Kristofer McGhee is the head of legal at the Institute for Apprenticeships and Technical Education."
        },
        {
            "heading": 2,
            "text": "Top Tips For Pride"
        },
        {
            "text": "1. Don’t be afraid to ask! - Foster an inclusive culture and build your understanding as much as you can.  The LGBTQ+ community is hugely diverse and can take some time to understand!  Don’t ever be afraid to ask if people use a LGBTQ+ term you don’t understand, or if you’d like their opinion on inclusivity in the workplace.  You might be surprised at how encouraged and grateful they are to have an employer willing to learn!"
        },
        {
            "text": "2. Go beyond the required - Though all workplaces will have equality policies in place, make sure these are put into action, any discriminatory actions are dealt with swiftly, that diversity is truly valued and that everyone can be their true selves in the workplace."
        },
        {
            "text": "3. Offer support where it is needed and have visible role models - Some people may be unsure of their identity, while others may sadly suffer discrimination.  Knowing that their workplace is open and offers a safe place to talk will be a great support for these apprentices. Junior employees, including apprentices and work experience students, truly value seeing leaders who are openly LGBT+ as it creates a sense of comfort and aspiration."
        },
        {
            "text": "4 Celebrate and take part in LGBTQ+ events - This could be Pride Month, National Coming Out Day, a Pride Event or the Trans Day of Visibility.  All these events build awareness and ensure your apprentice will feel valued and accepted within the workplace."
        },
        {
            "text": "5. Networks and Allies - Have staff networks or, where you don’t, support your LGBT+ staff to start them up – setting up a new network, or contributing to an existing network, is a great way for apprentices to really find their place in the workplace."
        },
        {
            "text": "6. Be diverse in your recruitment and aware of labels and pronouns - When recruiting – senior and junior staff but also apprentices – make sure your recruitment literature reaffirms your commitment to equality, diversity and LGBT+ staff. People look out for this when joining a company and they want to feel your culture. Be aware that for some in the LGBTQ+ community, labels such as “gay” or “bi” are empowering, for others they are oppressive – pronouns likewise are a matter of choice."
        }
    ]
}