{
    "url": "https://environmentagency.blog.gov.uk/2023/06/22/working-with-landowners-to-prevent-waste-crime/",
    "title": "Working with landowners to prevent waste crime",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Environment Agency",
        "Waste"
    ],
    "pub_date": "2023-06-22T09:38:50+00:00",
    "content": [
        {
            "text": "I’m an Enforcement Officer for the Environment Agency covering Greater Manchester, Merseyside and Cheshire. I joined the Environment Agency because I have a real passion for protecting the environment, people, and legitimate businesses."
        },
        {
            "text": "In my job I frequently meet landowners who have been taken advantage of by the people they rent their land to and are left with big piles of illegally deposited waste and a hefty bill to clean it up!"
        },
        {
            "text": "Know what is happening on your land"
        },
        {
            "text": "Waste crimes are not always done maliciously or with intent; in some cases it’s simply due to a lack of awareness. If you’re a landowner, you need to be mindful of who you rent your land to and any rules and regulations that your tenants may need to follow to carry out certain activities. As the landowner, you may also need to apply for permits or exemptions."
        },
        {
            "text": "I would like to share with you an example of this situation where I was asked to investigate a potential illegal site in Harpurhey, Manchester. The site was reported to us by a member of the public who rang our incident hotline to let us know about a potential illegal end of life vehicle (ELV) facility."
        },
        {
            "text": "An ELV is where waste cars and vehicles are taken apart to be reused as spare parts or recycled. This process produces lots of hazardous chemicals and waste which can be highly polluting such as waste oils, fuel, batteries and parts containing mercury, such as switches. Anyone who operates an ELV needs an environmental permit from the Environment Agency and a Scrap Metal Dealers’ Licence from the council to ensure that this process is carried out correctly, minimising any potential impact to the environment."
        },
        {
            "text": "Site checks"
        },
        {
            "text": "We carried out checks to see if the site had a permit registered with us and we couldn’t find any record, so the next step is to go out and investigate. This is where I step in as an Enforcement Officer. I carried out a joint visit with Greater Manchester Police and found this site was operating an ELV without a permit. I took evidence and provided advice and guidance to the operator about what he should be doing and issued a letter instructing the waste to be removed within 28 working days, in line with the Regulators Code."
        },
        {
            "text": "I conducted a follow up visit a few weeks later and the operator had complied with my letter, had stopped operating and cleared the site of waste. I also carried out further checks to make sure the waste that was removed had been taken to an appropriately permitted site for processing."
        },
        {
            "text": "Water pollution risk"
        },
        {
            "text": "The site was located next to the River Irk, which regularly floods across the yard, increasing the risk of environmental pollution from the activities that were being carried out on site. The site did not have a sealed drainage system (which it should have if it was a permitted site) and the operator was frequently depolluting vehicles on the floor in the yard into buckets with no lids. Because the site floods, any oil or fuel that was on the floor would be washed into the river."
        },
        {
            "text": "It is also located near a reservoir which is a recognised local wildlife site. It only takes a small amount of oil to cause a massive impact. Just one litre of oil can pollute 1 million litres of water. The oil spreads over the surface of the water in a thin layer which prevents oxygen reaching the animals and plants below the surface. This can lead to fish kills due to the decreased levels of dissolved oxygen and damage the vegetation growing along the riverbanks. Oil can also make water unsuitable for irrigation and damage how wastewater treatment plants work making the water unfit for human consumption."
        },
        {
            "text": "Landowners’ responsibilities"
        },
        {
            "text": "During my investigation, I found that the landowner was aware that the business was being run on his land but did not know that the operator should have had a permit in place to run the ELV. The landowner also didn’t know that it would fall to him to remove the waste and remediate the site if it had been abandoned by his tenant and caused damaged to the environment."
        },
        {
            "text": "It could have cost the landowner as much as £50,000 to have correctly cleared the site of the ELV waste. That would have been a large amount of money for the landowner to find as well as the inconvenience of arranging the site clearance. He was extremely thankful that we were able to help and was very lucky to have a cooperative tenant. Many just disappear, leaving the landowner a victim of their waste crimes."
        },
        {
            "text": "If you are landowner and you have any concerns that someone maybe operating or using your land illegally for waste processing or dumping, please call the Environment Agency on 0800 80 70 60 or Crimestoppers anonymously on 0800 555 111."
        }
    ]
}