{
    "url": "https://environmentagency.blog.gov.uk/2024/09/22/world-rivers-day-what-are-the-biggest-causes-of-river-pollution-and-whats-being-done-about-them/",
    "title": "World Rivers Day:  What are the biggest causes of river pollution and what’s being done about them? ",
    "authors": [
        "Helen Wakeham"
    ],
    "categories": [
        "agriculture",
        "Cleaner Seas",
        "Environment Agency",
        "Rivers",
        "Uncategorized",
        "Water"
    ],
    "pub_date": "2024-09-22T09:53:21+00:00",
    "content": [
        {
            "text": "By Helen Wakeham, Director of Water"
        },
        {
            "text": "World Rivers Day, celebrated every year on the fourth Sunday of September, is a global event that highlights the importance of rivers and the urgent need to protect them.   "
        },
        {
            "text": "Public concern around pollution in England’s waterways has increased markedly in recent years, with the actions of water companies, and particularly pollution from storm overflow discharges receiving widespread attention.  Today presents a good opportunity to not only take a look at the state of our rivers and what impacts them, but to explore what has already been achieved, and what needs to be done further to improve the situation.   "
        },
        {
            "heading": 3,
            "text": "Looking at the facts – where’s pollution coming from? "
        },
        {
            "text": "Earlier this week, I spoke at the Westminster Energy, Environment & Transport Forum’s policy conference on the next steps for tackling water pollution in England, where I discussed this topic. "
        },
        {
            "text": "The latest figures show that only 14% of rivers and lakes in England achieved ‘good ecological status’ – the criteria for good river health.  "
        },
        {
            "text": "There are many factors that can impact the quality of rivers. Key contributors which meant waters didn’t achieve good ecological status include: "
        },
        {
            "text": "Pollution can of course come from a variety of other sources, including PFAS – a very diverse group of chemicals which can be found in sewage, landfills, firefighting foam and some industrial processes.   "
        },
        {
            "heading": 3,
            "text": "What we’ve achieved so far: "
        },
        {
            "text": "Regulation  "
        },
        {
            "text": "Investment "
        },
        {
            "text": "Transparency  "
        },
        {
            "text": "What’s the gap between the state of England’s water bodies today, and where we want to be?  "
        },
        {
            "text": "In some ways the gap between where we are now and where we want to be in terms of water pollution is not as big as we might think. However, public interest in the health of our waterways has never been higher, and it can seem that the general perception is that the state of our rivers and waters is getting worse year-on-year. "
        },
        {
            "text": "But it’s important to put the increased knowledge and insights we now have about the water environment into context. For example, more storm overflow monitoring and transparency means there is a greater awareness and evidence of the problem rather than it just being water quality getting worse. This is not to say it isn’t a problem, but it’s not a new problem, and we now have the evidence to tackle it through regulation and investment.  "
        },
        {
            "text": "The Centre for Ecology and Hydrology reports that river ecology has improved in the past 30 years. Again, it’s not a matter for celebration, but an indication that some of the interventions we have made as a society can and do work.  "
        },
        {
            "text": "None of that is to belittle the size of the challenge we face.  "
        },
        {
            "text": "Monitoring the water environment is a complicated and expensive business. And the more we look, the more we find. We can detect things now in our water environment that we couldn’t 30 years ago – and our definition of what good looks like has changed accordingly. "
        },
        {
            "text": "We know that to achieve clean and plentiful water we need action, ideas and innovation not just from the water industry, but from land managers, the transport industry, developers and urban decision markers– they all need investment and an appetite to tackle the issues.  "
        },
        {
            "text": "Next steps "
        },
        {
            "text": "For the EA, we are transforming our water regulation, and welcoming new tools and enforcement through our Water Industry Regulation Transformation Programme (WIRTP) and the new Water Special Measures Bill.  "
        },
        {
            "text": "The forthcoming review of the Water Framework Directive is a once in a generation opportunity to get it right. Let’s be open and transparent about the challenges ahead and bring other sectors properly into debate, working together to improve water quality. "
        }
    ]
}