{
    "url": "https://defrafarming.blog.gov.uk/2025/02/26/animal-health-and-welfare-pathway-now-offers-vet-visits-for-multiple-species/",
    "title": "Animal Health and Welfare Pathway now offers vet visits for multiple species",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Payments to improve animal health and welfare"
    ],
    "pub_date": "2025-02-26T13:13:31+00:00",
    "content": [
        {
            "text": "The Animal Health and Welfare Review offers farmers in England a free annual vet visit to check the health and welfare of their livestock. "
        },
        {
            "text": "From today, livestock farmers can now apply for funding for both the Animal Health and Welfare Review and the endemic disease follow-up for more than one species."
        },
        {
            "text": "In this post, we’ll give an overview and details of a webinar for you to learn more."
        },
        {
            "heading": 2,
            "text": "Background "
        },
        {
            "text": "During a review, a vet of your choice will conduct disease testing for conditions including Bovine Viral Diarrhoea (BVD) in cattle, Porcine Reproductive and Respiratory Syndrome (PRRS) in pigs, and worming resistance in sheep."
        },
        {
            "text": "They will also assess biosecurity measures, identify potential risks and offer tailored advice to improve the health, welfare and productivity of your animals. "
        },
        {
            "text": "The endemic disease follow-up is the second stage of the review. Further assessments will be carried out by the vet, based on the findings of the initial review. "
        },
        {
            "text": "They will focus on: "
        },
        {
            "text": "The review and the follow-up are part of the Animal Health and Welfare Pathway, aimed at supporting farmers in improving livestock health while enhancing sustainability and productivity. "
        },
        {
            "text": "Previously, farmers could only claim for a review and follow-up for a single herd or flock of either beef cattle, dairy cattle, pigs or sheep."
        },
        {
            "text": "The review has now been expanded, allowing keepers to include more than one species in their review and follow-up."
        },
        {
            "text": "The follow-ups will still be optional. "
        },
        {
            "text": "Follow-ups must be on the same species as the review and must follow a review. Up to 3 reviews and 3 follow-ups are available per species. "
        },
        {
            "text": "You can apply for: "
        },
        {
            "text": "In addition to this, for the follow-up, we offer: "
        },
        {
            "text": "To apply for an Animal Health and Welfare Review, you’ll need: "
        },
        {
            "text": "And: "
        },
        {
            "text": "If you’ve applied for a vet visit since 19 June 2024 – for your cows, for example – you don’t need to register and apply again, you’ll already be in the system. "
        },
        {
            "text": "If your agreement starts with ‘IAHW’, we will update it to include these changes automatically. You can read the updated terms and conditions on GOV.UK. "
        },
        {
            "text": "If your agreement starts with ‘AHWR’ then you need to apply for a new agreement. "
        },
        {
            "text": "Once you read the changes, you can start arranging reviews or follow-ups for your other species. "
        },
        {
            "heading": 2,
            "text": "Coming this year"
        },
        {
            "text": "This spring, we will launch one round of the Farming Equipment and Technology Fund (FETF). You’ll be able to apply for animal health and welfare grants between £1,000 and £25,000. "
        },
        {
            "text": "In summer, we will expand the Animal Health and Welfare Review to allow funding for multiple flocks of the same species, providing greater flexibility and support to farmers managing several groups of animals. "
        },
        {
            "text": "In autumn, we will launch a consultation on the introduction of mandatory vet visits as part of the review process. "
        },
        {
            "text": "Subscribe to the Farming blog for the latest updates. "
        },
        {
            "heading": 2,
            "text": "Join our webinar"
        },
        {
            "text": "Join us for a webinar on Wednesday, 12 March, where we'll provide an overview of the 'Get Funding to Improve Animal Health and Welfare' service and the expansion to multiple species. "
        },
        {
            "text": "The webinar will start at 1pm and finish at 2pm."
        },
        {
            "text": "We’ll talk through the Annual Health and Welfare Review, the endemic disease follow-up and the new optional PI (Persistently Infected) hunt. "
        },
        {
            "text": "There will be an opportunity for you to put questions to the team. "
        },
        {
            "text": "Sign up to attend. "
        }
    ]
}