{
    "url": "https://openpolicy.blog.gov.uk/2025/02/26/art-design-and-participation-in-public-policy/",
    "title": "Art, Design and Participation in Public Policy ",
    "authors": [
        "Stephen Bennett"
    ],
    "categories": [
        "Events",
        "Policy Lab",
        "Skills, tools and techniques"
    ],
    "pub_date": "2025-02-26T11:32:07+01:00",
    "content": [
        {
            "text": "Can artistic and design-led methods help policymaking be more people-centred and participatory? In autumn 2024, Policy Lab collaborated with Demos in a public event to explore this question as part of their Collaborative Democracy Network. Policy Lab has been at the forefront of policy innovation for more than a decade. Our work focuses on improving policy through new methods and by rooting it in people's experiences of government and everyday life. We use varied creative approaches to involve people in the policymaking process. Our growing portfolio of approaches that draw on artistic practice indicates its potential for improving policy, from bringing out human elements in the policy system to making space for and prompting reflection in policymaking. "
        },
        {
            "text": "In this event we shared some of our own work and highlighted other deeply inspiring examples. Alongside an in-person and online audience, we were joined by four people with fascinating and relevant stories, including a local authority Chief Executive, a socially engaged artist, a movement director who leads a citizens’ jury in Cumbria and a participant from that jury. Emerging from the speakers and participants is a strong sense that artistic practices can positively inform how organisations participate with the public. This includes: "
        },
        {
            "text": "Our approach as a team is sensory and visceral in nature. As a small team, we consider how to navigate experiences of deliberation through atmosphere and feelings using artistic and creative interventions - Kieran Sheehan "
        },
        {
            "text": "Kieran Sheehan is the Co-director of Everyone Here, a project that is based in West Cumbria and is funded by the Arts Council England’s Creative People and Places programme. At the heart of the project's work is Jury for Joy, a citizens’ jury with 20 participants from across an area of 66 square miles, all selected via sortition (by lottery). The Jury for Joy meet twice a year. Their responsibility is to spend £100,000 on creating an artistic programme for the year. The jury decides this through a deliberative process - as with any citizens’ jury - but the difference is that creativity and art is foregrounded in the process of deliberation and decision-making. "
        },
        {
            "text": "Clare Ainsworth is a member of the public based in Whitehaven and a participant in the Jury for Joy. She described some of the artworks. This included work produced by Natalie Sharp, a disabled artist originally from West Cumbria, which included candy-coloured sensory installations adorned with red smoke; bittersweet poetry produced by local poet Emma McGordon; and Steel, a new play set in post-industrial West Cumbria. Many of these pieces particularly resonated with Clare, for whom it brought back memories of childhood streets and ‘things that had gone on’. However, Clare drew particular attention to a sensory exercise centred around the maypole: "
        },
        {
            "text": "One of the things from the sensory world was a maypole… you have the coloured ribbons coming down from it and you have twelve, sixteen or twenty, but everybody has to take a ribbon and everybody has to join in. You can't have one person saying ‘I'm not going to do this’ because then the actual pattern doesn't happen - Clare "
        },
        {
            "text": "To what end did these creative interventions serve? According to Kieran “the way in which our thinking is woven within these encounters leads us to deliberate with a sense of our and others’ bodies and imaginations”. In Policy Lab we have previously explored how using different senses can lead to different forms of insight for policy. The Jury for Joy has taken this into a space where multisensory activities support deliberation, the development of a collective identity and cohesive decision-making. Or to quote Clare again, "
        },
        {
            "text": "Everybody in the room felt that some of their ideas were in there in that end product and so therefore they bought into it - Clare "
        },
        {
            "text": "Catherine Howe is Chief Executive of Adur and Worthing Councils which she noted are “working in an environment of enormous scarcity and also often with the consequences of other people's decisions rather than their own”. This has led her to conclude,  "
        },
        {
            "text": "The idea that we're going to be able to create a sense of agency for the community is really difficult if we can't create a sense of agency for ourselves - Catherine Howe  "
        },
        {
            "text": "Catherine is leading the Councils through a design process which they are developing “through the practice of thinking, feeling and doing in order to meet everybody's different needs”. There are three key design principles: being resilient, being adaptive and being participative. One of Catherine’s actions has been to host artists as part of MANIFEST, a wider Policy Lab programme which supports artists, funded by the Arts and Humanities Research Council, to explore how their work can enrich policymaking.  "
        },
        {
            "text": "The MANIFEST artists hosted at Adur and Worthing have been social practice duo YARA+DAVINA. Yara El-Sherbini, one half of the duo, explained the work they have carried out in Adur and Worthing. Over the last ten months they have been working with council staff in a participatory way to gather content for a public artwork titled CLOCK WORK. This piece comprises thirteen wall clocks for the Town Hall that explore the value of time and how we use it. There is one large clock for the entrance hall with twelve statements on it, accompanied by twelve smaller clocks each incorporating a single different statement. Each statement has been provided by Council staff through a series of participatory and sensory sessions, some of which were very short - five minutes - recognising the time pressures on Council staff.  "
        },
        {
            "text": "CLOCK WORK explores what the public sector values and the underlying purpose behind that value; what does productivity mean to the individual and councils? Can publicly funded organisations balance the value of contemplation vs. action? - Yara El Sherbini "
        },
        {
            "text": "The thirteen clocks are a material intervention and everyday device. They bring attention and intention to how Council staff use their time, whilst acting as a practical tool, reminding us what values matter today and every day. Catherine Howe sees the collaboration with YARA+DAVINA partly as a way of deepening the Council’s practice around their three design principles; partly to show the Council’s intent to develop civic infrastructure; and partly to bring empathy and ‘space to imagine’ to what is sometimes tough and exhausting work. "
        },
        {
            "text": "How you create those moments where you can think and you can stop and you can dream about something a little bit bigger that that's that for me is why art has got a place in all of this - Catherine Howe "
        },
        {
            "text": "Miriam Levin, the Director of Participatory Programmes at Demos, compèred the event. One of her key insights was that “if you involve people, whether that's through participatory policymaking, through the arts, through design, what you end up with is policymaking and policy that works better on the ground with a stronger citizenry, and you help to rebuild some of the trust”. At Policy Lab our mission is to radically improve policymaking through design, innovation and people-centred approaches. We are celebrating our 10-year anniversary, a period in which we have delivered nearly 300 policy participatory and innovation projects across government and our work is rooted in the lived experience of citizens. Please see our prospectus or contact us at team@policylab.gov.uk if you are interested in collaborating or commissioning us. As an interesting perspective on what it is like to work with Policy Lab, Polly Curtis, the Chief Executive of Demos, said at the Collaborative Democracy Network: "
        },
        {
            "text": "We're absolutely thrilled to be partnering with Policy Lab… the absolute ninjas of policymaking expertise and participation in government - Polly Curtis "
        }
    ]
}