{
    "url": "https://mhclgdigital.blog.gov.uk/2025/02/26/bringing-saas-tools-into-a-fully-supported-service-powering-innovation-as-a-live-services-manager/",
    "title": "Bringing SaaS tools into a fully supported service: powering innovation as a live services manager ",
    "authors": [
        "Poonam Patel, Live Services Manager"
    ],
    "categories": [
        "Careers",
        "Technology"
    ],
    "pub_date": "2025-02-26T11:32:56+00:00",
    "content": [
        {
            "text": "As a live services manager at MHCLG Digital, my role revolves around encouraging a more effective use of Software as a Service (SaaS) tools within our department.  "
        },
        {
            "text": "My team has an exciting mission: to make sure that all of our SaaS are fully supported, ensuring a seamless user experience, and service availability and performance.  "
        },
        {
            "text": "Our focus is on reusability, user needs and value for money, all of which supports the digital vision for our department, which is to deliver better, faster and more efficient services to citizens.  "
        },
        {
            "heading": 2,
            "text": "What a live services manager does "
        },
        {
            "text": "Live services managers work with policy and service teams across MHCLG to help them get the most out of SaaS tools, to make their work and processes more efficient, user-centred, secure and cost-effective.  "
        },
        {
            "text": "Live services managers on this programme play a crucial role in integrating various SaaS tools into fully supported services. This involves overseeing user access management, engaging with suppliers and monitoring service performance to ensure operational excellence.  "
        },
        {
            "text": "We also work with service teams across the department to help provide a greater focus on user needs. We believe that prioritising the user in our software journey (development) is essential. "
        },
        {
            "heading": 2,
            "text": "Transitioning SaaS tools into a live service "
        },
        {
            "text": "The team is currently focused on transitioning a broad range of SaaS tools into a live service. This project involves liaising with third-party suppliers to ensure we have the best support package for the software and, where possible, looking for opportunities to improve services.  "
        },
        {
            "text": "We’re also focused on implementing even more robust service management practices along with full documentation, to optimise the service and drive continuous improvements.  "
        },
        {
            "heading": 2,
            "text": "What makes my work unique "
        },
        {
            "text": "In addition to the opportunities offered by the ever-evolving nature of technology, there are constant opportunities for making things better, providing better support to service teams, and growing as an individual and as an organisation.    "
        },
        {
            "text": "I also enjoy working with suppliers, and building rapport and great partnerships, as well as identifying opportunities to optimise and implement solutions to challenges.  "
        },
        {
            "text": "All of these things make my role unique and interesting and help me contribute to MHCLG’s mission to be at the forefront of digital innovation.  "
        },
        {
            "heading": 2,
            "text": "How I joined MHCLG Digital  "
        },
        {
            "text": "I was recruited into MHCLG Digital through one of the first Digital Recruitment Days held in Wolverhampton. "
        },
        {
            "text": "This event was a great experience, especially for someone with a private sector background, as I got to meet different future colleagues working in similar specialisms to mine at MHCLG, and there was a friendly atmosphere. I also got an insight into the department’s work and direction from a presentation from Gill Stewart, the Chief Digital Officer, at the start of the day.  "
        },
        {
            "heading": 2,
            "text": "Moving into public services from financial services "
        },
        {
            "text": "It was a huge step to move from financial services after 19 years, where I held various roles in information technology. But my decision to join MHCLG was fuelled by the department’s commitment to digital transformation and service excellence. I was also drawn to the inclusive culture and the opportunity to contribute my expertise to a diverse and forward-thinking organisation. "
        },
        {
            "text": "I have always had a passion for IT service management and providing the best platform of digital experience and therefore the role was a great match for me. "
        },
        {
            "text": "In the team, we are all super supportive to each other and collaborate closely to identify and bring the best outcome.  "
        },
        {
            "text": "MHCLG Digital has a welcoming culture and lots of exciting work in the digital space. Every day has something new and different to offer. As I evolve in the technology space, I am continually inspired by the power of collaboration, innovation and dedication within our team."
        }
    ]
}