{
    "url": "https://enablingdigitalidentity.blog.gov.uk/2025/02/26/dvs-legislation-marches-on-through-the-commons/",
    "title": "DVS legislation marches on through the Commons ",
    "authors": [
        "Inika Charles"
    ],
    "categories": [
        "Digital identity"
    ],
    "pub_date": "2025-02-26T11:02:46+00:00",
    "content": [
        {
            "text": "As part of our series of short updates on the Government’s plans to create a legislative framework for secure and trusted digital verification services in the UK, I can now report that the draft legislation has passed an important milestone in its progress through Parliament, as the Data (Use and Access) Bill has finished its passage through the House of Lords.    "
        },
        {
            "heading": 3,
            "text": "The story so far "
        },
        {
            "text": "The Data Bill was introduced in Parliament in October 2024, beginning its journey in the House of Lords. Part 2 of the Bill underpins the government’s plans to ensure that digital identity products and services offered in the UK can be trusted by those that want to use them.   "
        },
        {
            "text": "The legislation was debated by the House of Lords Grand Committee in December 2024. "
        },
        {
            "text": "Since then, the draft legislation has been debated further in Report Stage and completed its passage through the House of Lords. Earlier this month, it reached the House of Commons where it was subject to initial scrutiny.  "
        },
        {
            "heading": 3,
            "text": "What do the debates so far tell us about Parliament’s views on digital identity?    "
        },
        {
            "text": "House of Lords debates frequently explore the technical details of new laws. While reviewing the digital identity elements of the Data Bill on 21 January, peers were particularly interested in data accuracy, how Parliament should be involved in scrutinising the trust framework rules, and digital identity theft.   "
        },
        {
            "text": "They laid amendments to the Bill against these topics and three amendments relating to data accuracy (in Clauses 28, 45, and 140) were voted into the Bill.   "
        },
        {
            "text": "When the Bill had its second reading in the House of Commons on February 12, 2025, the UK digital identity clauses were generally well received. "
        },
        {
            "heading": 3,
            "text": "Next steps for digital identity legislation "
        },
        {
            "text": "The Data Bill has now moved on to the House of Commons Committee stage. During this stage, every clause in the Bill will be debated in detail and the Committee decides whether to keep in, change or remove each clause. It is a rigorous process which takes many hours to complete.  "
        },
        {
            "text": "Committee stage is set to conclude by March 18, after which the Bill will be reprinted and will return to the floor of the House to a further, final debate in what is called the Commons Report stage.  "
        },
        {
            "text": "The House of Commons scrutiny then finishes with a ‘Third Reading’ of the Bill when MPs vote on whether they are content with it in its latest form.    "
        },
        {
            "text": "But that’s not the end of the story! "
        },
        {
            "text": "Before the Bill can become an Act, any amendments that have been made by the House of Commons to the version of the Bill that was passed by the House of Lords must be agreed between the two Houses through a process called ‘Ping-Pong’.   "
        },
        {
            "text": "As the name suggests, this is where amendments bounce between both Houses until MPs and peers agree on one version of the Bill. Only at that point is the parliamentary scrutiny complete and the Bill can receive Royal Assent (from HM The King) and become an Act.   "
        },
        {
            "text": "We’ll bring you further updates on the digital identity parts of the Data Bill, and our plans for implementation, as it moves through these stages.  "
        }
    ]
}