{
    "url": "https://defrafarming.blog.gov.uk/2025/02/26/farming-in-protected-landscapes-programme-extended-until-2026/",
    "title": "Farming in Protected Landscapes programme extended until 2026",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Payments to support parks, National Landscapes and the Broads"
    ],
    "pub_date": "2025-02-26T12:14:51+00:00",
    "content": [
        {
            "text": "Farmers and land managers in England’s protected landscapes can now apply for funding from the Farming in Protected Landscapes (FiPL) programme until March 2026. "
        },
        {
            "text": "The programme offers grants for projects in National Parks and National Landscapes (previously called Areas of Outstanding Natural Beauty)."
        },
        {
            "text": "These grants support projects that: "
        },
        {
            "heading": 2,
            "text": "Continued commitment to rural economies and the environment "
        },
        {
            "text": "The FiPL programme has been extended with an additional £30 million of funding."
        },
        {
            "text": "FiPL helps farmers manage protected landscapes, support rural economies, and protect the environment for future generations."
        },
        {
            "text": "So far, FiPL has engaged over 7,000 farmers and land managers, funding more than 4,600 projects. "
        },
        {
            "text": "Feedback from participants has been encouraging: "
        },
        {
            "text": "In line with our commitment in the Environmental Improvement Plan, we will continue to learn from FiPL in the development of our environmental land management schemes in protected landscapes.  "
        },
        {
            "heading": 2,
            "text": "Supporting protected landscapes: a case study "
        },
        {
            "text": "Projects funded through FiPL have already made a positive impact, improving biodiversity, boosting climate resilience and encouraging sustainable farming in some of England’s most valued natural areas. "
        },
        {
            "text": "One such project can be found in the South Downs National Park. "
        },
        {
            "text": "At Hampers Green in Petworth, a 6.66-hectare site that previously had no formal public access is being developed into a vibrant community recreation area, a space for relaxation, education, and wildlife conservation. "
        },
        {
            "text": "Before applying for FiPL, the farmer spoke to local residents, who said they valued the area for its natural beauty."
        },
        {
            "text": "Because the site is important to the local community and livestock farming can be challenging in areas with many visitors, the project aimed to turn it into a community recreation area."
        },
        {
            "text": "Many residents already use the land informally, highlighting the need to balance public access with sustainable land management, especially in areas where livestock farming coexists with high foot traffic. The project set out to create a space that serves both people and nature. "
        },
        {
            "text": "The farmer behind the project aimed to manage the site as a community wildlife and recreation area, while providing information to residents about the importance of farming, food production and how these have shaped the local landscape."
        },
        {
            "text": "The farmer, staff, and volunteers planted hedgerows and trees and created ponds to support a wildlife-rich habitat."
        },
        {
            "text": "They also restored fencing and ditches, and created an all-weather, dog-friendly, circular pathway with a viewing spot to take in the stunning countryside, with access for disabled visitors. One local resident needs to use a mobility tricycle to exercise her dog and struggled with difficult terrain elsewhere. "
        },
        {
            "text": "Information boards about the wildlife, farming and Countryside Code were also designed and installed. "
        },
        {
            "text": "This project shows how thoughtful land management can balance community needs, environmental stewardship and farming. "
        },
        {
            "text": "By creating a dedicated space for recreation and education, the site will improve access to the countryside, foster a deeper appreciation of nature, and support local residents' health and wellbeing."
        },
        {
            "text": "When finished, the Hampers Green recreation site will be a haven for wildlife and show how land management can bring people, nature, and farming together."
        },
        {
            "text": "It’s a space that will inspire, educate, and provide enjoyment for generations to come."
        },
        {
            "heading": 2,
            "text": "Learn more"
        },
        {
            "text": "For more information about FiPL, visit the guidance on GOV.UK. "
        },
        {
            "text": "You can also contact your local protected landscape body for advice about whether your land or project is eligible. "
        },
        {
            "text": "To read more about FiPL’s achievements this year as well as other case studies, National Parks England has just published its Farming in Protected Landscapes Year 3 report. "
        },
        {
            "text": "Finally, for more project spotlights and updates from the Farming and Countryside Programme, subscribe to the Farming blog.  "
        }
    ]
}