{
    "url": "https://dcmslibraries.blog.gov.uk/2025/02/26/how-public-libraries-break-down-barriers-to-digital-inclusion/",
    "title": "How public libraries break down barriers to digital inclusion",
    "authors": [
        "nicoleagyekum"
    ],
    "categories": [
        "Digital"
    ],
    "pub_date": "2025-02-26T12:03:13+00:00",
    "content": [
        {
            "text": "Today the government has set out actions to begin tackling digital exclusion, publishing first steps of a new Digital Inclusion Action Plan which includes funding for local initiatives and partnering with inclusion charity, Digital Poverty Alliance to provide laptops to people who are digitally excluded."
        },
        {
            "text": "Public libraries play an important and inclusive role in making sure everyone has the equipment, skills and confidence required to access digital services which is recognised in the Plan."
        },
        {
            "text": "As trusted, universal and free services, public libraries break down the barriers to digital opportunity. From free Wi-Fi, public PCs, loaning ebooks and audiobooks, and offering assisted digital support, libraries are well placed to support digital inclusion."
        },
        {
            "text": "We wanted to shine a spotlight on the work of Manchester, Leeds, West Sussex and Barking & Dagenham as library services that are providing incredible digital inclusion support to their communities."
        },
        {
            "text": "Manchester Libraries Let’s Get Digital programme"
        },
        {
            "text": "Manchester Libraries Digital Inclusion Team lead on the Lets Get Digital initiative for the city of Manchester, and develop a programme of work both inside libraries and in the wider community. "
        },
        {
            "text": "The Digital Inclusion Action Plan, developed and implemented by the libraries digital inclusion team, is a key element of the Manchester Digital Strategy. In addition to free Internet and Wifi, weekly IT drop-in training sessions take place at each library, delivered in a variety of ways – e.g. through volunteers, adult learning organisations or staff."
        },
        {
            "text": "The Libraries’ digital inclusion team also supports digital skills work in the wider community outside of library venues. They offer phone and online support to residents who have Internet access but don’t have the skills or confidence to use it effectively. This service is supported by digital champion volunteers. Manchester Libraries increase the level of digital inclusion support provided by community groups by working with an informal network of VCSFE organisations. They increase the number of community organisations that embed digital inclusion in their activities by awarding them funding for offering a variety of digital inclusion support such as recruiting a digital champion volunteer or offering digital skills sessions."
        },
        {
            "text": "Leeds First Steps with Digital "
        },
        {
            "text": "Leeds Libraries designed First Steps with Digital after consultation with community organisations showed a gap in provision for people without even the most basic digital skills; existing online and in-person courses needed a certain skill level to join, excluding people without that understanding. They used the government's Essential Digital Skills Framework to develop a course designed to help people achieve the seven foundation skills. "
        },
        {
            "text": "Leeds Libraries piloted the programme with library staff before delivering in care homes and at local organisations who work with digitally excluded people from a diverse range of backgrounds. They received universally positive feedback with people feeling more prepared and confident to use the internet and also having the tools to continue their learning online and at their own pace, all while knowing that they could come back to the library for further support."
        },
        {
            "text": "Barking & Dagenham’s Inclusive Digital Zone: developing digital skills for disabled people"
        },
        {
            "text": "The Inclusive Digital Zones (IDZ) in Barking and Dagenham provide accessible hardware, software, adjustable furniture and trained digital champions to help people with disabilities to get online and gain digital skills. The IDZs are a collaboration, consultation, and design with the LBBD, LBBD Sensory Team, Royal National Institute of Blind People (RNIB), Good Things Foundation, LBBD Disabled Staff Network and residents. "
        },
        {
            "text": "The aim of the IDZ is to provide accessible digital technology to those with disabilities and train digital champions to help residents to be confident online and develop digital skills. "
        },
        {
            "text": "Digital champions are volunteers from the diverse community. They are trained by the GTF, RNIB and the LBBD Sensory Team to not only understand how to use and train others on using the accessible software and hardware but being aware of the different needs of people with disabilities and different approaches to use – all led by the disabled person. The digital champions use Learn My Way (created by the GTF) to teach digital skills and tailor learning to the person. "
        },
        {
            "text": "Some of the digital champions are those with disabilities, which is encouraging to others who are learning as they see them as role models and are inspired to learn."
        },
        {
            "text": "West Sussex Digital Inclusion Partnerships "
        },
        {
            "text": "In West Sussex the Library Service worked with the council’s Online Safety Team to carry out a large piece of research into digital inclusion work in communities across the county. As an outcome from the research, they established a partnership of over 100 local grassroots organisations and public services with a shared commitment to improving digital inclusion. "
        },
        {
            "text": "The partnership shares information, best practice, understanding and evaluation through regular meetings, a newsletter and a dedicated website. Part of the website is a directory of local help and support available to residents, designed to improve access to trusted services. The work is underpinned by a strategic framework, placing digital inclusion at the heart of the county council and demonstrating to all partners the importance of helping residents to get online and be safe online."
        },
        {
            "text": "Next steps"
        },
        {
            "text": "The government is seeking views on the first steps of the Digital Inclusion Action Plan, including the first 5 actions through a call for evidence. It is open to everyone and will run until 11:55 pm on 9 April 2025. You can respond as a:"
        }
    ]
}