{
    "url": "https://naturalengland.blog.gov.uk/2025/02/26/how-new-technologies-are-helping-us-monitor-one-of-englands-largest-grey-seal-colonies/",
    "title": "How new technologies are helping us monitor one of England’s largest grey seal colonies ",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Evidence",
        "Mapping",
        "Marine environment",
        "Monitoring",
        "Natural Capital",
        "Natural England",
        "Nature",
        "NCEA",
        "Science and evidence",
        "Seals"
    ],
    "pub_date": "2025-02-26T13:35:18+00:00",
    "content": [
        {
            "text": "By Gabriella Fasoli and Nick Tomline (AI specialists), Emma Milner (marine mammal specialist) and Elizabeth Mitchell (engagement), all on the marine Natural Capital and Ecosystem Assessment (mNCEA) programme"
        },
        {
            "heading": 4,
            "text": "Documenting Norfolk's biggest beach party"
        },
        {
            "text": "On a windy day in December, something looking a little like a giant black insect took flight from a sheltered dip in the sand-dunes at Winterton-on-Sea on the Norfolk coast. This high-spec drone climbed to over 100 metres above the National Nature Reserve before flying out across the beach, where thousands of grey seal parents and their new-born pups were feeding, sleeping, fighting and playing. From far above their heads, the drone recorded imagery of the seals, documenting one of Britain’s most important colonies at a vital point in their annual cycle. "
        },
        {
            "text": "Finally, back in the office, Artificial Intelligence (AI) analysis of the drone footage allowed us to count the adult seals and their pups. We identified more than 8,500 seals along an 8 kilometre stretch of shoreline – significantly more than the around 6,200 seals identified by a volunteer-led ground count. "
        },
        {
            "heading": 4,
            "text": "How AI can improve environmental monitoring"
        },
        {
            "text": "Drone recording combined with AI detection technology has the potential to transform our monitoring of seal populations. Drones can peer into areas which human observers can’t get to – dips in the dunes in Norfolk, or inaccessible rocky coves off the coast of Cornwall – while the AI analysis tool which we’ve built to analyse the images can count the thousands of seals on the beach within a few hours, and is much less likely than a human observer to count the same pup twice. "
        },
        {
            "text": "The data collected through this project can then be combined with data collected by other organisations across the UK to help contribute to a bigger national picture of our seal populations.  Our hope is that in future the methods from this two-year pilot project can be developed to allow drone surveys at other important sites around the country, and for other species as well as grey seals. "
        },
        {
            "heading": 4,
            "text": "The bigger picture - from the Winterton colony to global grey seal populations"
        },
        {
            "text": "Grey seals are some of the most charismatic occupants of our coastlines, and in many places are surprisingly easy to see first-hand, especially in pupping season (autumn and/or winter, depending on location). But while they are numerous at sites like the Winterton National Nature Reserve, it’s worth remembering that the UK is one of the world hotspots. Around 35% of the global grey seal population is thought to breed on UK coasts, giving us a particular responsibility to protect them. "
        },
        {
            "text": "In the early 20th century, this global population dropped to only 500, though we now estimate that there are more than 160,000 grey seals. Grey and harbour seals (our two native seal species) both remain protected species. "
        },
        {
            "heading": 4,
            "text": "Humans and machines working together"
        },
        {
            "text": "Although we believe that these new monitoring methods have the potential to enhance the accuracy of our population assessments for England’s seals, volunteers on the ground will remain crucial to documenting and protecting them. At Winterton and the neighbouring beach of Horsey, the Friends of Horsey Seals are able to undertake ground-based counts on a weekly basis during the pupping season, as well as rescuing injured seals and encouraging visitors to stay at a safe distance. "
        },
        {
            "text": "Natural England is also conducting annual photo-ID surveys of mothers and pups – data which will be used to try to understand which mothers are returning to the beach year on year. One of the great advantages of the drone/AI method, however, is its potential to access areas which humans can’t, giving reliable data even from points along the coast where there are few ground-based observers, or where seal colonies aren’t fully visible from paths and viewing points. "
        },
        {
            "heading": 4,
            "text": "Seal safety"
        },
        {
            "text": "It’s important not to disturb seals, especially during the pupping season, and you should try to stay at least 100 metres away from them where possible. When around seals you should always keep dogs on leads and take any litter home with you. It’s also worth emphasising that no one should fly a drone over seals unless they have specific permission from any relevant authorities and landowners. "
        },
        {
            "text": "Natural England follows strict regulations laid down by the Civil Aviation Authority, and flies drones at a height which means that they pose very little disturbance risk to the seals. "
        },
        {
            "heading": 4,
            "text": "The marine Natural Capital and Ecosystem Assessment "
        },
        {
            "text": "The Winterton monitoring trial was carried out by Natural England staff working for Defra’s marine Natural Capital and Ecosystem Assessment (mNCEA). For the last three years, mNCEA has been a major driver of new research to improve how we monitor the marine environment. The programme is gathering the evidence and trialling the innovative techniques we need to build long-term monitoring capacity and enhance the evidence base for marine decision making in England. "
        },
        {
            "text": "You can read about how our grey seal project fits into a bigger picture of marine mammal monitoring by Natural England’s mNCEA team in this recent blogpost. "
        },
        {
            "text": "Watch the video below for more information on the project:"
        }
    ]
}