{
    "url": "https://competitionandmarkets.blog.gov.uk/2025/02/26/new-procurement-act-exclusion-and-debarment-on-competition-grounds-what-suppliers-and-contractors-need-to-know/",
    "title": "New Procurement Act: exclusion and debarment on competition grounds - what suppliers and contractors need to know",
    "authors": [
        "Deborah Wilkie"
    ],
    "categories": [
        "Competition Act 1998 and cartels",
        "Competition law compliance"
    ],
    "pub_date": "2025-02-26T14:18:47+00:00",
    "content": [
        {
            "text": "On 24 February 2025, the Procurement Act 2023 came into force, driving greater efficiency, transparency, and fairness in public sector procurement. The Act introduces stronger rules on the exclusion of suppliers where they pose particular risks to public procurement."
        },
        {
            "text": "Changes include a new mandatory exclusion ground for suppliers involved in cartel activity and the introduction of a central debarment register. If you are a supplier tendering for public sector contracts or a contracting authority running tender procedures, this new regime is relevant to you."
        },
        {
            "text": "For more technical detail, visit the CMA’s overview."
        },
        {
            "heading": 2,
            "text": "What do 'exclusion' and 'debarment' mean?"
        },
        {
            "text": "Suppliers who take part in illegal cartel activity such as bid-rigging, price fixing or market sharing risk being excluded from public procurement unless they can demonstrate that they have ‘self-cleaned’ so that the wrongdoing that led to the exclusion won’t happen again. More information on competition exclusion grounds and self-cleaning can be found on the CMA's overview page. "
        },
        {
            "text": "Suppliers can be excluded if an exclusion ground applies to a ‘connected’ or ‘associated’ person. This includes directors, parent or subsidiary companies, and key sub-contractors."
        },
        {
            "heading": 2,
            "text": "Steps suppliers may take to avoid exclusion or debarment"
        },
        {
            "text": "For suppliers, the best way to avoid exclusion or debarment is to remain compliant with competition law.  Read our compliance advice on our Cheating or Competing campaign page and share compliance materials throughout your business."
        },
        {
            "text": "However, if a supplier realises it has infringed competition law, there are steps it can take to make amends and avoid exclusion: "
        },
        {
            "text": "Admit wrongdoing and apply for leniency"
        },
        {
            "text": "The first supplier to report cartel activity to the CMA and be granted a 100% discount on fines will not be excluded or appear on the debarment list. As a result, there is now an increased incentive for suppliers involved in cartel activity to be the first to report wrongdoing to the CMA under its leniency policy."
        },
        {
            "text": "‘Self-cleaning’"
        },
        {
            "text": "Suppliers will not be excluded if they can demonstrate that the circumstances giving rise to the exclusion ground are not continuing or are unlikely to occur again. This might include, for example: a supplier showing they have been granted leniency, or have admitted wrongdoing and agreed to pay a penalty under the CMA’s settlement procedure."
        },
        {
            "heading": 2,
            "text": "Steps for contracting authorities"
        },
        {
            "text": "The new regime applies to contracting authorities in England, Wales, and Northern Ireland, but not in Scotland. Contracting authorities must determine whether exclusions apply to potential suppliers including assessing if a supplier has ‘self-cleaned’.  To help them with that assessment, contracting authorities can:"
        },
        {
            "heading": 2,
            "text": "How the CMA can help"
        },
        {
            "text": "Authorities can contact the CMA at cma_procurementsupport@cma.gov.uk for information that may be relevant to exclusion and self-cleaning assessments."
        },
        {
            "text": "To reduce bid-rigging risk, the CMA has produced bid-rigging advice for public sector procurers. If you suspect bid-rigging or need a teach-in on bid-rigging red flags, contact cma_procurementsupport@cma.gov.uk."
        },
        {
            "heading": 2,
            "text": "How to report concerns to the CMA"
        },
        {
            "text": "If you witness or suspect another business breaking the law:"
        },
        {
            "text": "If you’ve been involved:"
        },
        {
            "heading": 2,
            "text": "Resources"
        },
        {
            "text": "If you want to know more:"
        }
    ]
}