{
    "url": "https://deframedia.blog.gov.uk/2023/05/26/coverage-on-the-kept-animals-bill/",
    "title": "Coverage on the Kept Animals Bill",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Nature"
    ],
    "pub_date": "2023-05-26T12:05:42+01:00",
    "content": [
        {
            "text": "There has been widespread online coverage on The Guardian, Mail Online, Telegraph, Mirror, I News, Spectator, Yahoo News, Politico and more following the Government’s update in the House yesterday on the status of the Kept Animals Bill."
        },
        {
            "text": "There has been further reporting today in The Times (p2), Independent (p11), Daily Mail (p13) and on Sky News, which run similar critical pieces which claim Government has “scrapped” the Bill."
        },
        {
            "text": "As set out in the Oral Statement in the House today, we remain fully committed to delivering our manifesto commitments."
        },
        {
            "text": "Given the successful progress so far in this Parliament of so much single-issue legislation and the pressures that the original Bill faced from broader interests beyond the original manifesto commitments, we will be taking forward measures in the Kept Animals Bill individually during the remainder of the Parliament - the most effective route possible."
        },
        {
            "text": "Farming Minister Mark Spencer said:"
        },
        {
            "text": "We are also supporting Private Members’ Bills currently before Parliament banning the import of detached shark fins, banning the import of hunting trophies and banning the advertising and offering for sale here of unacceptably low animal welfare activities abroad."
        },
        {
            "text": "Action we’ve already delivered on animal welfare since 2010 includes:"
        },
        {
            "text": "The UK already has among the highest standards of animal welfare in the world. The steps announced today and we remain committed to enhancing them further."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}