{
    "url": "https://dfedigital.blog.gov.uk/2023/05/26/how-to-organise-an-accessibility-scavenger-hunt/",
    "title": "How to organise an accessibility scavenger hunt",
    "authors": [
        "Marian Avery"
    ],
    "categories": [
        "accessibility",
        "Content design",
        "culture",
        "design",
        "digital inclusion",
        "neurodiversity"
    ],
    "pub_date": "2023-05-26T10:47:40+01:00",
    "content": [
        {
            "text": "Thursday 18 May 2023 was Global Accessibility Awareness Day (GAAD). GAAD is in its 12th year now. By this point, we’ve had enough of just raising awareness. It's time to take real action."
        },
        {
            "text": "Here at DfE Digital, Data and Technology, we decided to use the day to build empathy - so that people prioritise making our services accessible."
        },
        {
            "text": "In this post I explain what an accessibility scavenger hunt is and share some tips on how to run a successful one yourself."
        },
        {
            "heading": 2,
            "text": "Create your own accessibility scavenger hunt"
        },
        {
            "text": "An accessibility scavenger hunt is a challenge to find a series of facts and figures online. But the challenges must be done while using assistive technology. It’s an insight into to the everyday experiences and frustrations of an assistive technology user."
        },
        {
            "text": "I was introduced to the format by Catrina Imray and Andy McNicoll at Social Security Scotland. Credit goes to Home Office Digital’s Guerman Cope and Jamie Fraser for the idea - they use it as part of their accessibility training."
        },
        {
            "heading": 2,
            "text": "Accessibility is futureproofing"
        },
        {
            "text": "Anyone could develop a disability at any point, whether it’s temporary or permanent. We’re also more likely to become disabled as we get older. Most people will experience disability at some point in their lives – whether that’s directly, or a close friend or relative becoming disabled. Even if you don’t know it yet, accessibility matters to you. Personally."
        },
        {
            "text": "A scavenger hunt highlights how badly designed some websites are, and how users with accessibility needs are excluded from using them."
        },
        {
            "heading": 2,
            "text": "5 steps to run your own scavenger hunt"
        },
        {
            "text": "1. Choose what assistive technology to use. Something that everyone can learn quickly is best. For that reason, we chose to do some tasks using keyboard-only navigation, and some tasks using browser zoom at 400%."
        },
        {
            "text": "2. Set your tasks - choose examples of both good and bad website design. You’ll need to test the websites with the assistive technology you’ll be using in the session to find examples. You need difficult examples that will make everyone frustrated at how badly designed websites are, and some good examples that will show people the impact of good design. We won’t name and shame the bad examples that we used, but we used GOV.UK and the BBC website as good examples."
        },
        {
            "text": "3. Start the scavenger hunt. Tell people what you’re going to do. Make sure everyone has the instructions and is comfortable with the tasks. Ask your participants to find something that’s listed on the page. For example - go to the GOV.UK homepage and find out how many ministerial departments there are."
        },
        {
            "text": "4. If it’s a big group like ours was, put people into smaller breakout rooms. Encourage everyone to have a go at the tasks, and to talk as they do them. This means people can build a team spirit of ‘it’s us against the website’ and find solutions to common problems together. It’s a good idea to try your bad examples first and finish with the good ones to make the most impact."
        },
        {
            "text": "5. Collect feedback. Bring your groups back together and see how people found the tasks. What was easy? What was difficult? Was there anything they found surprising? Talk about what it felt like and check people’s stress levels. Ask everyone what they’d do differently in the future to add accessibility focus to their work."
        },
        {
            "heading": 2,
            "text": "Collecting feedback"
        },
        {
            "text": "We created a survey to collect participant feedback to see what they thought of the session. All the participants who responded:"
        },
        {
            "text": "We received some great feedback:"
        },
        {
            "text": "If you or your team have any other tips on how to run an accessibility scavenger hunt, or if this post has inspired you to give it a go, please let us know – we'd love to hear from you."
        },
        {
            "text": "Follow DfE Digital, Data and Technology on Twitter."
        },
        {
            "text": "Subscribe to this blog."
        }
    ]
}