{
    "url": "https://defrafarming.blog.gov.uk/2023/05/26/improving-and-extending-our-offer-for-upland-farmers/",
    "title": "Improving and extending our offer for upland farmers",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Future Farming and Countryside Programme"
    ],
    "pub_date": "2023-05-26T10:46:42+01:00",
    "content": [
        {
            "text": "Upland farmers are a crucial part of our rural communities, economies and landscapes. They are central to the production of high-quality food and other goods.  "
        },
        {
            "text": "The uplands are a hugely important landscape. Moorlands provide most of England’s semi-natural terrestrial habitat. They include wildlife habitats of international importance, like blanket bog and upland heath. "
        },
        {
            "text": "Many upland farmers already take great care of the natural environment alongside food production. There is potential for upland farmers to go further and earn additional income, by producing more ambitious, large-scale and impactful public goods alongside food. "
        },
        {
            "heading": 2,
            "text": "Our offer "
        },
        {
            "text": "We are making sure our policies and schemes build on what’s already there and work well for farm businesses, food production and the natural environment.  "
        },
        {
            "text": "So, before getting into the improvements, here is a summary of the schemes upland farmers can already access.  "
        },
        {
            "text": "This year, you can:  "
        },
        {
            "text": "You can also access free, independent business advice. Take a look at this list of providers on GOV.UK. They’re listed by county and you can make contact directly. "
        },
        {
            "heading": 2,
            "text": "Improving our offer  "
        },
        {
            "text": "From 2024, we’re going to offer an updated version of our existing scheme options – we're adjusting them to make them more accessible and workable for upland farmers.  "
        },
        {
            "text": "This follows discussions with expert stakeholders and a piece of work which reviewed the existing Countryside Stewardship offer to identify areas to improve and refine. "
        },
        {
            "text": "With effect from 1 January 2023, we are making payment rates in Countryside Stewardship equal for both upland and lowland farms when they are carrying out the same actions. I’ll explain more below. "
        },
        {
            "text": "We’re also improving our engagement with upland farmers and providing more tailored, accessible material to help them into our schemes. This includes the creation of The Payments for Upland Farmers leaflet. It lists the scheme options available to upland farmers. It is the first in our sector-specific series of leaflets.  "
        },
        {
            "heading": 2,
            "text": "Increasing payment rates for Countryside Stewardship options "
        },
        {
            "text": "We’re making payment rates in our schemes equal for both upland and lowland farms when they are carrying out the same actions. Historically, 5 ‘pairs’ of Countryside Stewardship options have had different payment rates for uplands and other areas.  "
        },
        {
            "text": "We are increasing the lower of the 2 prices in each of these 5 pairs to match the higher of the 2 prices. We’ve taken this approach to make sure that farmers are paid fairly, wherever they are in the country. "
        },
        {
            "text": "This change has brought these options in line with the rest of the scheme by setting a single price nationally, making it more equitable and accessible. "
        },
        {
            "text": "The payment rate increase applies from 1 January 2023. The Rural Payments Agency (RPA) will write to farmers to let them know. "
        },
        {
            "heading": 2,
            "text": "More workable options  "
        },
        {
            "text": "In January, we published the list of actions we will pay for in schemes by 2024.  "
        },
        {
            "text": "This includes a range of new and amended options for upland farmers covering moorlands (where we plan to pay considerably more for moorlands in good environmental condition than we currently do), grassland, boundaries, woodland and trees, and species recovery and management. "
        },
        {
            "text": "We are improving existing offers within Countryside Stewardship. "
        },
        {
            "text": "We asked farming and environmental organisations with expertise in applying schemes in upland settings to suggest changes to the current Countryside Stewardship offers to make them more accessible and workable for upland farmers. "
        },
        {
            "text": "The feedback received was that for some Countryside Stewardship options, we could usefully review payment rates, broaden eligibility, and/ or introduce more flexibility on how the options were done. For example, by reviewing dates associated with some actions and providing clarification on how the options should be carried out.  "
        },
        {
            "text": "The results supported some improvements we already planned based on our engagement with farmers so far; most of the suggestions related to Countryside Stewardship offers that are already being updated. For example, GS5 – Permanent grassland with very low inputs in SDAs, GS6 – Management of species-rich grassland, UP1 – Enclosed rough grazing, UP2 – Management of rough grazing for birds, and UP3 – Management of moorland).  "
        },
        {
            "text": "In addition, as a result of these conversations, we’re going to update a further 7 existing Countryside Stewardship offers: "
        },
        {
            "text": "We will deliver these changes for 2024, alongside the other improvements and additions set out in January’s environmental land management update.  "
        },
        {
            "text": "This will create an accessible, broad and rewarding offer for upland farmers to deliver outcomes for environment, climate and sustainable domestic food production. "
        },
        {
            "text": "We will continue working with farmers and experts to make those changes. As part of this work, we are looking at how we present opportunities to farmers. We’re also considering how the offers make sense for different sub-sectors. For example, those with mainly low input grassland, those with mainly improved grassland, etc. "
        },
        {
            "text": "Further details will be provided this summer alongside the detail on the rest of the 2024 offer. "
        },
        {
            "text": "We are also working to improve the Countryside Stewardship Higher Tier application process to make it easier for more people to take part. "
        },
        {
            "heading": 2,
            "text": "Strengthening our relationship with upland farmers "
        },
        {
            "text": "It is our mission to create an offer that is workable for every farmer and farm type in England. With that in mind, we’ve worked hard to ensure that the opinions of upland farmers are not only heard but shape our schemes and grants. "
        },
        {
            "text": "Through tests and trials, for example, tenant farmers are helping us to better understand what works and what needs to improve in our environmental land management schemes.  "
        },
        {
            "text": "There are 26 tests and trials underway specifically in the uplands. We put together a film series on the Forgotten Lands in north-east Cumbria. This test and trial looked at how upland farmers might record the natural capital on their farms. "
        },
        {
            "text": "From design to delivery, the input from farmers and stakeholder organisations has been invaluable and we’re looking forward to developing this relationship further. "
        },
        {
            "text": "We're exploring ways to improve the flow of information about our new schemes to upland communities. "
        },
        {
            "text": "In addition to the relationships we have with trusted intermediaries (for example, vets and land agents) who speak to farmers in person every day, we meet upland farmers at agricultural shows. "
        },
        {
            "text": "We will continue to engage with upland farmers by: "
        },
        {
            "text": "This year, alongside our colleagues in the Rural Payments Agency (RPA), we will attend the following shows in upland areas or with an upland focus.  "
        },
        {
            "text": "For the complete list of shows, visit our Talk to Us page. "
        },
        {
            "text": "We talk to stakeholder organisations through forums, roundtables and webinars and we’re always keen to find ways to make sure they work for members. You can leave a comment or get in touch with the engagement team to share your thoughts. "
        },
        {
            "text": "We’re also working on: "
        },
        {
            "text": "As we carry out this work, we will continue to make sure that our offer works for farmers, offers value for money and delivers the intended outcomes for farm productivity, food production and the environment.  "
        },
        {
            "text": "We will share more about all these areas of work over the coming months, so subscribe to the Farming blog."
        }
    ]
}