{
    "url": "https://defrafarming.blog.gov.uk/2024/08/23/fipl-spotlight-improving-water-quality-in-the-north-york-moors/",
    "title": "FiPL spotlight: improving water quality in the North York Moors ",
    "authors": [
        "North York Moors National Park team"
    ],
    "categories": [
        "Payments to support parks, National Landscapes and the Broads"
    ],
    "pub_date": "2024-08-23T10:51:14+01:00",
    "content": [
        {
            "text": "Among the North York Moors National Park — a landscape of heather moorlands, deep wooded dales, babbling becks, and rugged coastline — lies Fryup Dale.  "
        },
        {
            "text": "Encompassing 2 parallel valleys separated by a moorland outcrop, Fryup Dale is a historic farming landscape defined by a mosaic of pasture, remote farmsteads, tree-lined becks, and bands of deciduous woodland that fill the dale before the upper slopes give way to moorland. "
        },
        {
            "text": "Until 1655, the dale was part of the huge manor of Danby, which was like a cattle ranch. Both Little Fryup Dale and the neighbouring valley of Great Fryup Dale were large pastures where cattle could graze safely.  "
        },
        {
            "text": "When the estate was sold, the pastures were divided into blocks and leased out as tenant farms. The straight-sided fields and dry-stone walls you see now are the results of their work and have remained a feature since the 17th century. "
        },
        {
            "text": "Within Fryup Dale, and across the National Park, agriculture plays a huge part in the way of life for communities, with a diverse range of farming businesses.  "
        },
        {
            "text": "Most are independently managed smallholdings (less than 50–100 hectares), primarily used for grazing, with land classed as ‘Less Favoured Areas’—meaning it is difficult to farm due to the geology, altitude, and climate. "
        },
        {
            "text": "The becks running through Fryup Dale are all tributaries of the River Esk, which is home to Yorkshire’s last surviving population of the endangered freshwater pearl mussel. "
        },
        {
            "text": "Their decline in number is largely due to habitat loss, water pollution, and reduced numbers of their host fish species, Atlantic salmon and brown trout.  "
        },
        {
            "text": "Farming practices in Fryup Dale can impact the water quality of the river, so projects to reduce sedimentation and pollution are vital. "
        },
        {
            "text": "In this post, we’ll share our work to improve water quality in the North York Moors, from wetland creation to enhancing farm infrastructure. "
        },
        {
            "heading": 2,
            "text": "Collaborating to revitalise our rivers "
        },
        {
            "text": "As part of the Farming in Protected Landscapes (FiPL) programme, managed locally by the North York Moors National Park Authority, funding has been allocated to several projects within Fryup Dale.  "
        },
        {
            "text": "Although these projects have been completed individually, their outcomes are interlinked and contribute towards our objectives of the North York Moors Management Plan—notably the aim of achieving good ecological status of all water bodies by 2027. "
        },
        {
            "text": "Mark and Amanda Smith of Woodhead Farm were among the first farmers in the dale to use FiPL funding to improve water quality. "
        },
        {
            "text": "In their own words, a desire to make their farm \"more sustainable and less intrusive on the local environment\" was a real motivator when they sought funding to upgrade their farmyard and tracks.  "
        },
        {
            "text": "By doing so, they have been able to contain contaminated runoff from the dairy farm and prevent it from entering the water catchment. "
        },
        {
            "text": "They also planted trees to extend the buffer habitat alongside a beck, which will act as natural biofilters, trapping sediments, nutrients, and pollutants that could otherwise degrade water quality. "
        },
        {
            "text": "A few farms down, you will find Ellers House and Cottage, where Kenneth, Michael, and Kirsty Knight (father, son, and daughter-in-law) have restored 3 ponds to host a more diverse ecosystem.  "
        },
        {
            "text": "This was achieved by removing silt and making the ponds deeper. A 200-metre hedge was also planted around the ponds, with 2 access gates creating a secluded area for wildlife."
        },
        {
            "text": "Ponds like this can play a crucial role in natural flood management by acting as buffers that slow down the flow of water, especially during heavy rainfall.  "
        },
        {
            "text": "They work by temporarily storing water, which helps to reduce the risk of flooding downstream, or in this case, the nearby beck."
        },
        {
            "text": " In addition to pond restoration, this project involved the gapping up of 180 metres of existing hedgerows and planting of 60 trees along Great Fryup Beck. "
        },
        {
            "text": "Taking a different approach, Daphne Jackson of Slidney Beck Farm used FiPL funding to install a solar-powered water pump, water tank, and trough. "
        },
        {
            "text": "The aim here is to pump water from Slidney Beck to the top of the field and thus exclude livestock from the beck."
        },
        {
            "text": " Complementing this, 628 metres of new fencing will enclose the beck, and the creation of a new track will keep livestock and machinery further away. These efforts will improve water quality and reduce the amount of runoff entering the beck. "
        },
        {
            "text": "Finally, Catherine Hatch of Prospect Farm was keen to work with the FiPL team to \"enhance my land for conservation.\" This led to the creation of a wetland in a poorly drained field with low agricultural use."
        },
        {
            "text": " In total, 3 scrapes were created of varying depths, providing new habitats for invertebrates, amphibians, and wading birds."
        },
        {
            "text": "An existing oxbow pond was also restored. Creating scrapes and restoring the pond will help slow the flow of water through the dale and further reduce flood risk. "
        },
        {
            "text": "There are also several existing ponds nearby, so this will help improve the pond network across the valley. "
        },
        {
            "text": "The plan is to manage the land through conservation grazing by native cattle, which provides the right conditions for the regeneration of wildflowers and scrub. "
        },
        {
            "heading": 2,
            "text": "Reflections "
        },
        {
            "text": "Speaking on the success of the projects, Rebecca Thompson, Head of Farming & Land Management at the North York Moors National Park Authority, said: "
        },
        {
            "text": "“It is especially good to see the bottom-up approach of FiPL, whereby funding is supporting projects proposed by farmers who are facilitated by on-the-ground local project officers."
        },
        {
            "text": " This approach results in farmers coming together, like they have in Fryup Dale, to deliver bigger, better, and more joined-up projects that deliver landscape-scale benefits in our most protected landscapes, as well as enable us to collectively deliver on the North York Moors Management Plan.\" "
        }
    ]
}