{
    "url": "https://ukhsa.blog.gov.uk/2024/08/23/mpox-clade-1-what-you-need-to-know/",
    "title": "Mpox clade 1: what you need to know",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Health security",
        "Mpox"
    ],
    "pub_date": "2024-08-23T10:33:27+01:00",
    "content": [
        {
            "text": "\nCredit: CDC/ National Institute of Allergy and Infectious Diseases (NIAID)"
        },
        {
            "text": "The World Health Organization (WHO) declared a public health emergency of international concern because of the rapid spread of a mpox virus strain, clade 1, after its emergence in the Democratic Republic of the Congo (DRC) last year, and the potential for the virus to spread further across countries in Africa and outside the continent."
        },
        {
            "text": "The UK Health Security Agency (UKHSA) is working with the NHS, local authorities, and other government departments to ensure we are ready to respond to any cases we see in the UK and help prevent transmission."
        },
        {
            "text": "In this blog post, we share more information about what mpox is, the different clades, the key symptoms and how UKHSA is working with partners to respond to the outbreak."
        },
        {
            "heading": 2,
            "text": "What is mpox?"
        },
        {
            "text": "Mpox is a viral infection that spreads through close person-to-person contact. Like many diseases caused by a virus, mpox has different types or ‘clades’. There are two major clades of mpox, known as clade 1 and clade 2."
        },
        {
            "text": "Clade 2 mpox has been present in the UK since 2022. Clade 1 mpox has previously only been reported in five countries in Central Africa but there is now increasing transmission of Clade 1 mpox in several countries in east and central Africa."
        },
        {
            "text": "Anyone can catch either clade of mpox, as it spreads from person-to-person, through close contact (including intimate or sexual contact) with someone who has the mpox virus, through contact with contaminated materials, such as bed sheets or towels, and contact with infected animals."
        },
        {
            "text": "Mpox does not spread easily between people unless there is very close contact."
        },
        {
            "heading": 2,
            "text": "What are the symptoms?"
        },
        {
            "text": "The symptoms of mpox include:"
        },
        {
            "text": "A rash usually appears 1 to 5 days after a fever, headache and other symptoms. The rash (spots, blisters or ulcers) often begins on the face, then spreads to other parts of the body. This can include the mouth, genitals and anus. The number of sores can range from one to several thousand."
        },
        {
            "text": "If you have recently travelled to any of the affected countries, and have any new spots, blisters or ulcers that have developed within 21 days of returning, please isolate at home and call NHS 111 for advice, letting them know your travel history."
        },
        {
            "heading": 2,
            "text": "What is the treatment for clade 1 mpox?"
        },
        {
            "text": "The symptoms of mpox can range from a few spots to a severe rash and illness. Treatment will depend upon the needs of the individual patient but may include admission to a specialist hospital."
        },
        {
            "text": "New-born babies, children, people who are pregnant and people with underlying immune deficiencies may be at higher risk of more serious mpox disease and death."
        },
        {
            "heading": 2,
            "text": "Is mpox clade 1 in the UK?"
        },
        {
            "text": "With no cases of clade 1 mpox confirmed in the UK, the overall risk to the UK population remains low."
        },
        {
            "text": "However, it is important we prepare for any cases that we might see in the UK and planning is underway."
        },
        {
            "text": "This includes extensive monitoring and surveillance of international cases, ensuring rapid testing for all mpox strains is available, equipping healthcare professionals with guidance and advice on how to respond to potential cases, reducing the risk of transmission and close working with international partners to make sure our plans are informed by the latest global picture."
        },
        {
            "text": "In 2022-23, there was a global outbreak of clade 2 mpox, , including in the UK, which appears to be a less severe strain. This was primarily driven through sexual contact. Clade 2 mpox cases are still present in the UK."
        },
        {
            "heading": 2,
            "text": "What is the risk to the public’s health?"
        },
        {
            "text": "The overall risk to the public is currently considered low.  However, due to the severity of clade 1 mpox we are reminding people who have recently travelled to the affected areas to be aware of signs and symptoms and contact a healthcare professional if they are concerned."
        },
        {
            "heading": 2,
            "text": "What is the travel advice?"
        },
        {
            "text": "Currently, the risk to most travellers is low and vaccination against mpox infection is not recommended for the majority of people."
        },
        {
            "text": "Those travelling to areas affected by the ongoing outbreak should take sensible precautions to protect themselves from the risk of infection by reducing touch or sexual contact, especially with individuals with a rash."
        },
        {
            "text": "We recommend that anyone planning to travel to the affected countries check the latest travel advice published by the FCDO."
        },
        {
            "text": "People who are travelling to affected countries can seek health advice from their GP or from a travel health clinic, as well as referring to the country information on the Travel Health Pro website."
        },
        {
            "heading": 2,
            "text": "Is the vaccine effective?"
        },
        {
            "text": "UK and global evidence from the mpox clade 2 outbreak in 2022-23 suggests that the currently available vaccine is effective if given to individuals before they are exposed to the infection (approximately 70% to 85%, with the majority of the protection provided by the first dose) with more limited protection if given after exposure (~20% effective). The vaccine is expected to work as well for clade 1 mpox as for clade 2."
        },
        {
            "heading": 2,
            "text": "How can we protect ourselves and others? "
        },
        {
            "text": "Anyone can catch mpox, so if you have recently travelled to an affected country, be aware of the symptoms. If you think you might have the infection, avoid close contact with other people, self-isolate at home and speak to a healthcare professional as soon as possible."
        },
        {
            "heading": 2,
            "text": "Additional resources"
        },
        {
            "text": "If would like to find out more about this mpox outbreak, the following links contain lots of helpful information and updates:"
        }
    ]
}