{
    "url": "https://mhclgmedia.blog.gov.uk/2024/08/23/right-to-buy-coverage/",
    "title": "Right to Buy coverage",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Housing"
    ],
    "pub_date": "2024-08-23T15:52:28+01:00",
    "content": [
        {
            "text": "It has been reported this morning that councils have spent more than £1 billion purchasing former Right to Buy properties since 2020."
        },
        {
            "text": "Right to Buy is an important route for council housing tenants to be able to own their home. However, discounts have increased significantly since they were introduced in 2012, so councils now have less money to replace the homes which are being sold. Along with the under-delivery of council housing, this has had a major impact on the number of council houses being built. That is why we have started to review these discounts as an important first step to supporting councils to increase the number of homes they are building"
        },
        {
            "text": "We have committed to reviewing Right to Buy more widely and will bring forward via a consultation in the autumn."
        },
        {
            "text": "We have already given councils more flexibility to increase delivery of social housing using Right to Buy Receipts and we will continue to support them and housing associations to build affordable housing and to replace more of the homes sold under the Right to Buy."
        },
        {
            "text": "More needs to be done to help people to own their home and that is why we are building 1.5 million homes over the next Parliament and increasing overall supply, which is crucial for long-term affordability."
        },
        {
            "text": "A Ministry of Housing, Communities and Local Government spokesperson said:"
        },
        {
            "text": "“This government will deliver the biggest increase in social housing in a generation, to help provide the affordable and secure homes our country needs."
        },
        {
            "text": "“We have already announced an additional £450 million investment in England’s councils through the Local Authority Housing Fund, and given councils increased flexibilities to deliver more social housing using Right to Buy Receipts. We will set out details of future Government investment at the Spending Review.”"
        }
    ]
}