{
    "url": "https://competitionandmarkets.blog.gov.uk/2024/08/23/school-uniforms-is-your-policy-at-risk-of-breaking-the-law/",
    "title": "School uniforms: Is your policy at risk of breaking the law?",
    "authors": [
        "Paul Kellaway"
    ],
    "categories": [
        "Antitrust",
        "Compliance"
    ],
    "pub_date": "2024-08-23T12:38:26+01:00",
    "content": [
        {
            "text": "School uniforms can give pupils a sense of identity and belonging to a community. But, for many families across the UK, buying school uniforms is a significant and unavoidable cost alongside the additional costs of childcare and entertainment during the summer holidays. So as a governing body or head of school, what things do you need to keep in mind when it comes to your school’s uniform policy?"
        },
        {
            "text": "At the Competition and Markets Authority (CMA), we’ve been looking at the impact of school uniform policy over the years and have advocated for schools to ensure that their policies are not overly restrictive, limiting the choice of what parents and carers can buy. For example, some families are forced to buy what they consider to be unnecessarily branded items of school uniform, often from suppliers and retailers who have exclusivity agreements with particular schools."
        },
        {
            "text": "It may come as a surprise to many schools and their governing bodies that they may in fact be breaking competition law if those policies are too restrictive."
        },
        {
            "heading": 2,
            "text": "Latest updates from government "
        },
        {
            "text": "Schools in England and Wales now have to take into consideration guidance from the government on the cost of school uniforms. You should therefore at least be thinking about cost as part of your considerations when setting a school uniform policy. The Scottish Government will shortly be introducing similar guidance while the Department of Education in Northern Ireland is currently consulting on revising its guidance. At the CMA, we’ve worked closely with the governments of all 4 nations to help shape their guidance."
        },
        {
            "heading": 2,
            "text": "What schools can do"
        },
        {
            "text": "The CMA isn’t asking schools to change their uniforms (and forcing parents and carers to buy a completely different new uniform). But you should consider whether your uniform policy is in the best interest of pupils and parents and think about where you can offer greater flexibility."
        },
        {
            "text": "As school leadership teams change over time, we recommend that you familiarise yourself with the CMA’s open letter to head teachers, school governing boards and school uniform suppliers about their obligations to parents and carers and whether your policies might face scrutiny under competition law."
        },
        {
            "heading": 2,
            "text": "What schools need to think about"
        },
        {
            "text": "Here are some questions you should consider when it comes to your school’s uniform policy."
        },
        {
            "heading": 3,
            "text": "1. Do you have any exclusivity arrangements with retailers or manufacturers?"
        },
        {
            "text": "Schools and their governing bodies and academy trusts should consider how to use competitive tender processes to get the best results when awarding contracts. Contracts should be sufficiently short to keep suppliers on their toes, but not excessively so where items of uniform are especially distinctive (such as unique colour combinations or branded with a logo)  and may need a minimum order size to be economically viable"
        },
        {
            "heading": 3,
            "text": "2. Have you awarded a contract to a manufacturer for sale through third party retailers?"
        },
        {
            "text": "If so, are there any provisions that fix the minimum price that the uniform can be sold at? Such arrangements could be a breach of restrictions on resale price maintenance. Read the CMA’s advice on resale price maintenance to find out more."
        },
        {
            "heading": 3,
            "text": "3. How many items of uniform are branded or highly tailored to your school?"
        },
        {
            "text": "While less common colour combinations may give a greater sense of identity, does this reduce the number of suppliers who will choose to invest in a stock uniform that can only be sold to a small pool of customers?"
        },
        {
            "heading": 3,
            "text": "4. Do you allow multiple suppliers to use your school crest or logo?"
        },
        {
            "text": "Consider making your logo freely available to different suppliers who may be able to offer better value choices to pupils’ families."
        },
        {
            "heading": 3,
            "text": "5. Do you offer a pre-loved uniform shop?"
        },
        {
            "text": "Whether it’s a swap-shop, a redistribution of unclaimed lost property, or sale of donated clothing, think about how to help extend the lifespan of uniform."
        },
        {
            "heading": 2,
            "text": "What parents and carers can do to save money"
        },
        {
            "heading": 4,
            "text": "If you are a parent or carer, read my previous blog for further tips and tricks on back to school shopping."
        }
    ]
}