{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2023/09/22/applications-open-for-royal-society-pairing-scheme/",
    "title": "Applications open for Royal Society Pairing Scheme ",
    "authors": [
        "gseprofession"
    ],
    "categories": [
        "Blog Series",
        "GSE Opportunities",
        "Interchange"
    ],
    "pub_date": "2023-09-22T11:43:31+01:00",
    "content": [
        {
            "heading": 3,
            "text": "What is the Royal Society Pairing Scheme? "
        },
        {
            "text": "The Royal Society Pairing Scheme is a long-standing collaboration between the Government Science & Engineering (GSE) Profession and The Royal Society. Each year 30 research scientists and engineers are paired with UK parliamentarians and civil servants for one week. The scheme aims to upskill policy makers on how best to work with scientists outside of government, and how to engage with academia more broadly. Next year, the scheme will be taking place between 18 and 21 March 2024. "
        },
        {
            "text": "The scheme has the support of the Head of GSE, and the Government Chief Scientific Adviser, Dame Angela McLean: "
        },
        {
            "text": "“The Royal Society Pairing Scheme is a great opportunity for civil servants and talented UK scientists to experience each other’s worlds and ensure that Government is empowered by the best scientific evidence. Apply now” "
        },
        {
            "heading": 3,
            "text": "What is involved? "
        },
        {
            "text": "Royal Society scientists are matched with civil servants who work in a policy area that corresponds with their fields of study. During the week there is the opportunity to take part in workshops, visits organised by the Royal Society and GSE, and talks from guest speakers. Civil servants will also be shadowed by their Royal Society partners for up to two days, to provide scientists with insight into Civil Service roles and explore routes into government.  "
        },
        {
            "text": "To be eligible for the scheme you must: "
        },
        {
            "text": "Please note, you can contact the GSE Profession Team for support in arranging a suitable working location if you do not have access to a London office.  "
        },
        {
            "heading": 3,
            "text": "Why get involved?  "
        },
        {
            "text": "The event strengthens the relationships between policy makers, scientists and engineers. Civil servants from across government shared some of their reflections on taking part in the 2023 scheme:  "
        },
        {
            "text": "“The scheme was very beneficial. I particularly enjoyed gaining insights into what it is like to  work in academia, as well as the interests and challenges they have with working with  Government. The cross-government networking, including parliamentary aspects, was also  useful” - Civil servant scheme participant 2023.  "
        },
        {
            "heading": 3,
            "text": "Key Dates "
        },
        {
            "text": "If you’re interested in applying, please fill out the application form. If you would like more information on the scheme, please contact gse@go-science.gov.uk.  "
        }
    ]
}