{
    "url": "https://environmentagency.blog.gov.uk/2023/09/22/citizen-science-in-east-anglia/",
    "title": "Citizen Science in East Anglia",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Environment Agency"
    ],
    "pub_date": "2023-09-22T09:47:30+00:00",
    "content": [
        {
            "text": "Citizen science initiatives provide invaluable data about our water environment and complement our own monitoring and assessment work, enabling a greater understanding of the issues we face and how together we can take action going forward."
        },
        {
            "text": "In 2022, the EA committed to delivering its own citizen science project, Supporting Citizen Science. Running from the end of 2022 until March 2025, this project aims to support emerging and established citizen science initiatives across the country to understand how the data collected can be used within the Environment Agency to improve the environment."
        },
        {
            "text": "John Findlay, who works in the East Anglia analysis and reporting team at the EA, writes here about his role and the data his team is collecting."
        },
        {
            "text": "I belong to the East Anglia Analysis and Reporting team at the Environment Agency. My title and main role is Citizen Science Monitoring Coordinator in East Anglia, which involves helping citizen scientists collect good quality accessible data and exploring how the Environment Agency can then use this data. Citizen Science is scientific monitoring and research conducted by members of the public - at the Environment Agency we’re part of many initiatives that support this type of science."
        },
        {
            "text": "Our team collects, analyses and reports invertebrate, plant, algae, fish and water chemistry data to assess the health of freshwater ecosystems. I support the team with fieldwork, and invertebrate and algae sample collection and analysis to help us respond to pollution, drought, public health and fish mortality incidents."
        },
        {
            "text": "In East Anglia almost every major river has a citizen science scheme. I work with volunteers on these schemes, who tend to be members of the public with  an interest in the health of the river as well as Rivers Trust or other charity employees. The best way to get involved is generally through your local catchment partnership, a local rivers charity or the local part of a bigger charity such as a local Rivers Trust, Rivercare or a Wildlife Trust."
        },
        {
            "text": "Those who want to take part in citizen science get trained either by the group they volunteer with, me, or the group that developed the technique they’re using so they know how to log the findings and when to contact me and/or our incident reporting service if they find something abnormal."
        },
        {
            "text": "Citizen scientists use a range of methods including testing water quality directly with meters, test strips or by culturing bacteria, they can also send samples away for a laboratory to analyse. Some citizen scientists also record habitats and how these change over time or following environmental improvement works."
        },
        {
            "text": "I’m currently working with citizen scientists in the River Lark Catchment Partnership, Norfolk Rivers’ Trust and Wensum Catchment Partnership as part of the Rivers’ Trust’s CaSTCo project to test new ways of collaborative working, trial new monitoring methods and investigate the accuracy of citizen science data."
        },
        {
            "text": "Some citizen scientists also carry out riverfly samples; this again is done on almost all our main rivers. Volunteers collect a sample in the river and then analyse it on the riverbank looking for mayfly, stonefly, caddisfly, freshwater shrimp and more, before releasing their catch. The number of species we find is a helpful indicator on the health of the river and following further investigation enables us to detect pollution or drought impacts."
        },
        {
            "text": "The citizen science in East Anglia has so far been really successful. Riverfly samples have helped identify droughts and the effects of drought and help to warn us about possible pollution incidents. Citizen scientists monitoring water quality have also found signs of pollution, which we have investigated and verified and are working collaboratively to resolve."
        },
        {
            "text": "Citizen Science initiatives provide invaluable data, which complements our own monitoring and assessment work and enables a greater level of engagement with partners."
        },
        {
            "text": "We hugely value the contribution of our enthusiastic citizen scientists and share their passion for the environment. We welcome various emerging initiatives and look forward to working more closely together to help find solutions to the complex problems water is facing."
        },
        {
            "text": "Fancy doing some citizen science? This World River’s Day, we are supporting the Rivers’ Trusts Big River Watch! Join us by visiting your local river between 22 and 24 September and telling us what wildlife you can see. By taking part, you will contribute to a national data set that will help build a picture of river health across the country. For more information on how to get involved visit: The Big River Watch | The Rivers Trust"
        }
    ]
}