{
    "url": "https://socialcare.blog.gov.uk/2023/09/22/get-ready-for-self-care-week/",
    "title": "Get ready for Self Care Week",
    "authors": [
        "Helen Donovan"
    ],
    "categories": [
        "Care and support",
        "Carers",
        "Communities",
        "Events",
        "Guidance",
        "Information sharing"
    ],
    "pub_date": "2023-09-22T08:41:39+00:00",
    "content": [
        {
            "heading": 2,
            "text": "New resources to help people get ready for winter"
        },
        {
            "text": "Self Care Week returns 13-19 November this year. It's the annual, UK-wide awareness week run by the Self Care Forum, a charity aiming to further the reach of self-care in the population, making it everyone’s everyday habit and culture, to think and practice self-care."
        },
        {
            "text": "There's no need to wait though. Two new “Get Ready” winter fact sheets are already available for health organisations to support people’s self-care practice during the winter."
        },
        {
            "text": "Self Care Week is a well-established public health initiative, its purpose is to embed support for self-care across communities, families, and generations."
        },
        {
            "text": "We know messages are amplified when spoken by many. Self Care Week provides an excellent opportunity to inform, educate and remind people about the many benefits of self-care to short and long-term health, giving them confidence and understanding to look after their physical health and mental wellbeing."
        },
        {
            "text": "Winter health is just one of a myriad of self-care messages promoted during Self Care Week and, because November is early winter, the Self Care Forum is inviting organisations to use its new fact sheets."
        },
        {
            "text": "The fact sheets focus on ‘winter wellness’ and ‘winter illness’ and are designed to help people:"
        },
        {
            "text": "The fact sheets contain simple but useful advice for people to keep at hand as a resource to refer to and share with family and friends.  They are also excellent take-away resources for patients, following shared consultations with their health professional, including nurses, pharmacists, GPs, social prescribers, link workers and others."
        },
        {
            "heading": 2,
            "text": "What more can we all do to improve our self care?"
        },
        {
            "text": "Here are some other self-care messages we encourage you to adopt and promote during Self Care Week:"
        },
        {
            "text": "The Self Care Forum site has several other fact sheets designed to help support these messages, including the POWER of Self Care."
        },
        {
            "text": "Self Care Week also highlights better use of health services by signposting people to the services most relevant to their health needs – in particular, encouraging more of us to access our local pharmacies for health care treatments and advice."
        },
        {
            "heading": 2,
            "text": "Free resources"
        },
        {
            "text": "We have an array of free resources on our website, not just for use during Self Care Week. You can also view our ‘Become Self Care Aware webinar’ recording, which can be used on TV screens in receptions if this is helpful. A series of Urdu fact sheets will also be available soon."
        },
        {
            "heading": 2,
            "text": "The power of many voices"
        },
        {
            "text": "Self Care Week is the power of many voices and is the one time of year when so many different organisations can own the same message.  Indeed, last year more than 800 organisations across the UK participated in Self Care Week, helping to reach around 28 million people.  As well as those involved in providing health and public health services, schools, universities, colleges, libraries, gyms, businesses, community and faith groups as well as charities are just some of those who got involved."
        }
    ]
}