{
    "url": "https://publicpolicydesign.blog.gov.uk/2023/09/22/introducing-public-design/",
    "title": "Introducing public design",
    "authors": [
        "Andrew Knight"
    ],
    "categories": [
        "PublicPolicyDesign",
        "Research",
        "Thought leadership"
    ],
    "pub_date": "2023-09-22T12:00:02+01:00",
    "content": [
        {
            "text": "A common anecdote that public sector designers tell is that they spend the first 10-minutes of every meeting explaining what design is and the second 10-minutes explaining why they should be sat at the table. There’s a serious issue that belies this tongue-in-cheek slice of life: we lack a well-understood proposition for design."
        },
        {
            "text": "This is our fault – the fault of designers – there are so many explanations for design from each branch of the design family that it acts to confuse people. Our different explanations of design make sense to designers. But to others, this crazy paving approach to our value proposition looks – well, just crazy. The absence of a common proposition divides rather than unites the design family, and it is the number one barrier to bootstrapping design in governments. We need a universal definition and proposition for design in the language of governments and ministries of finance."
        },
        {
            "text": "I’m making the case for a new definition: public design."
        },
        {
            "text": "This can only succeed if designers collaborate on the definition. I am inviting you to participate in making that case as part of the new Public Design Review. So to get the conversation started, I offer you 3 waymarks…"
        },
        {
            "heading": 2,
            "text": "A bigger, more inclusive definition of design practice"
        },
        {
            "text": "I’m not the first to use the phrase ‘public design’ (design leader, Christian Bason, used the term in his PhD many years ago), but the scope of public design as a practice is as yet undefined."
        },
        {
            "text": "Within the design family, we define ourselves through our differences – it helps us work together and respect each other’s specialisms. This is often based on what we make and where we work in the policy-to-delivery pipeline (like transactional services, or strategic policy, or communication). While there are differences in how we work, what we have in common is far more powerful: the practice of design fundamentals about how to make things that deliver public value."
        },
        {
            "text": "Public ministries of finance are, of course, interested in the bottom line. Efficiency has and always will be important. But they are increasingly broadening their definition of value to be far more holistic in order to deliver meaningful outcomes to citizens. The UK’s Public Value Framework, Scotland’s National Performance Framework, Wales’ Future Generations Act, the United Nations’ Sustainable Development Goals: all seek to expand the definition of public value."
        },
        {
            "text": "So to all designers who work in the public sector: define yourselves by the common public value outcomes we all seek, not the small differences in how we work."
        },
        {
            "heading": 2,
            "text": "User-centred design is not enough"
        },
        {
            "text": "Designers in government are passionate about user-centred design. We care deeply about the needs of people and help to ensure their voice is included in decision making. This can be truly transformational for public policies and services. But from the perspective of senior public leaders and ministries of finance it’s simply not enough. They are making trade-offs between:"
        },
        {
            "text": "Civil services everywhere tend to be: brilliant at understanding intent (there is substantial bureaucratic machinery surrounding ministers to enact their ambitions); middling at understanding systems (systems are usually organised, especially social ones, so officials can get to grips with them and often do); and poor at understanding people (because they are unorganised, so very difficult for officials to engage with)."
        },
        {
            "text": "Designers have been incredibly successful at plugging that gap with user-centred design. But if we are going to renew our contract with governments, we need to ensure our definition of design reflects the world as governments see it. That means designers continuing to be brilliant at user-centred design, but it also requires a deliberate focus on crystallising and responding to intent, and being systems thinkers to respond to complex environments."
        },
        {
            "heading": 2,
            "text": "Our place in governments"
        },
        {
            "text": "A large part of what policymakers do is system stewardship – it’s keeping the lights on (literally and metaphorically). This is an incredibly important job in the increasingly complex and turbulent world that we live in. A smaller, but no less important, part of the work is making and re-making public policies and services – and this is where design experts can help."
        },
        {
            "text": "Design should have the same status as ‘Research’. You would expect everyone in your team to have basic research skills – to be able to go onto the internet to find information and make sense of it. But when the research task is too big or difficult to undertake alone, you bring in an expert researcher. Design should be no different. It is a technical practice and a core function of public institutions. It should have the same status as research."
        },
        {
            "text": "That of course means that when we consider design capabilities, we need to do so at three levels: design for everyone, design for experts, and design for leaders (who create the enabling conditions for design)."
        },
        {
            "text": "The question of where and how a design function is embedded in governments is a question for another day. But what is clear is that because design is the practice of making things it should happen throughout the policymaking and service delivery pipeline - it joins-up policy and delivery."
        },
        {
            "text": "Design is about making things better, but it also serves a mechanism for governments to systematically reduce uncertainty about whether their investments will have the expected effect and deliver public value. A world with less design creates long-term design debt and at worst puts lives at risk."
        },
        {
            "heading": 2,
            "text": "A public design review"
        },
        {
            "text": "There is so much at stake and so much for us to articulate. It is time for designers to join forces to define public design and show how it drives public value."
        },
        {
            "text": "The UK Policy Design Community have commissioned a Public Design Review and work is now underway. The review brings together the stewards of public design with the stewards of public value to make a landmark case."
        },
        {
            "text": "On the design side, all central government’s design practitioners are acting together alongside national design institutions like the Design Council, Design Museum, Chartered Society of Designers, Arts and Humanities Research Council. On the public value side we have HM Treasury’s public spending experts, with government’s independent National Audit Office acting as a critical friend. Experts in public design and value from civil society (Nesta, Royal Society of Arts, Joseph Rowntree Foundation) and universities (Central Saint Martins, UCL Institute for Innovation and Public Purpose, University of Manchester) have also joined the team. All supported by co-parent professions: Policy Profession, Operational Delivery Profession, and Digital, Data and Technology Profession."
        },
        {
            "text": "We can only get this right if we work together – and we want you to be involved too. We will be reaching out to all public designers in the UK whether you work in central or local government, or other public organisations. We’ll do this during the Autumn through professional communities and networks, and the Design Council, to understand how public design drives public value and your experience of doing this work. I hope to you can play your part in this extraordinary alliance."
        }
    ]
}