{
    "url": "https://aphascience.blog.gov.uk/2023/09/22/outreach-in-the-community/",
    "title": "Science Sparks: igniting interest in the community",
    "authors": [
        "Sarah Stewart"
    ],
    "categories": [
        "Events"
    ],
    "pub_date": "2023-09-22T09:00:29+01:00",
    "content": [
        {
            "text": "Sarah Stewart, Science Stakeholder Engagement and Events Manager at APHA describes how she is building our APHA Science STEM Ambassador Group, recent events we have attended and how you can invite an ambassador to your event."
        },
        {
            "text": "Over the last year, I have been working with our APHA scientists to build a Science, Technology, Engineering and Mathematics (STEM) Ambassador Group of willing volunteers to do outreach work with local schools, colleges, and community groups."
        },
        {
            "text": "The APHA Science STEM Ambassador Group was initiated in February 2022 following a call out to develop public engagement material for younger audiences at events, supplementing the digital science communications on our science blog and social media accounts."
        },
        {
            "text": "The aims of the group are to relay our science to aspiring scientists (locally, nationally and even internationally) to encourage students to continue studying STEM subjects and ultimately to embark on a science career, and potentially to develop their careers at APHA."
        },
        {
            "text": "We offer great scientific career paths with opportunities for further professional development to ensure we maintain our world-class expertise at APHA. We also have many other sites in England, Wales and Scotland offering a range of career opportunities, enabling us to act locally to deliver nationally."
        },
        {
            "text": "The STEM group has been steadily growing and we now have 35 STEM ambassadors, representing animal and plant health nationally. Each member is helping to generate more science-related communications material for use on social media and at science and careers events at schools, colleges and universities and other community events. We are also planning to expand our STEM Ambassadors to include technology, engineering and maths through the SCAH programme, which is a 10-15 year major infrastructure construction programme."
        },
        {
            "text": "In June this year, we took part in a number of events:"
        },
        {
            "heading": 3,
            "text": "Midsummer Event"
        },
        {
            "text": "We attended this large community fair in a park in New Haw, Surrey, which is very close to our Weybridge science site, to talk to local residents about our wide-ranging scientific work to detect and control animal and plant diseases. We also highlighted the range of job and training opportunities available, for example ‘earn-while-you-learn’ apprenticeships, MSc and PhD training. Information on the site redevelopment and public consultation was available as well."
        },
        {
            "text": "Whilst the agency had previously supported this event, it had been over 11 years since we last attended, making it a significant moment for us to reconnect with the community and answer a range of questions."
        },
        {
            "text": "We were pleased to speak to over 300 people on the day and were impressed by how many children attempted the educational game to pin the notifiable disease on the animal. It was not easy, but with a little help from their parents and APHA staff they all had a go and guessed most of them correctly. The fluffy pig bugs and sweet prizes were a good incentive!"
        },
        {
            "text": "Science demonstrations on vector-borne diseases and the pathology display proved to be popular attractions. Visitors of all ages enjoyed peering through microscopes to observe mosquitoes and stained tissue slides used to identify animal disease conditions."
        },
        {
            "text": "Despite it being a scalding hot day, we were all pleased to see the interest in our work to protect the country from animal and plant diseases."
        },
        {
            "heading": 3,
            "text": "Woking College Careers Fair"
        },
        {
            "text": "Our Weybridge STEM ambassadors participated in the Woking College Careers Fair on 27 June to engage with students and teaching staff to inform them about the diverse range of roles across our science disciplines and other areas, as well as the learning opportunities within the agency. STEM ambassadors from the Tuberculosis (TB) and Virology team talked about their scientific work and encouraged students to consider apprenticeships as an alternative to pursuing degree courses. The fair featured a strong representation from universities and some other local employers."
        },
        {
            "heading": 3,
            "text": "Countryside Days"
        },
        {
            "text": "Our Plant Health STEM ambassadors attended Countryside Days in June, with over 5,000 Key Stage 2 children from local Yorkshire schools visiting over the two days. We ran interactive workshops throughout the event, starting with an activity where the students inspected imported fruit for pests and disease, then a session checking soil for eggs and nematodes, and finally talking about how young people can help us do our jobs."
        },
        {
            "text": "The visitors to our stand were especially interested in plant pests and their impact on the environment. We also answered a lot of questions about careers from the teachers that attended."
        },
        {
            "heading": 3,
            "text": "STEM Ambassador Volunteers"
        },
        {
            "text": "Our STEM ambassadors meet regularly to discuss events and volunteering activities in their region and we are able to offer APHA speakers to attend some school, college or community science or career events. Whilst our headquarters are in Surrey we have sites and STEM ambassadors in other regions, so please get in touch to find out more and to let us know about events in 2024 that we can consider attending. Details on how to contact us can be found below."
        },
        {
            "heading": 3,
            "text": "Looking ahead"
        },
        {
            "heading": 4,
            "text": "New Scientist Live"
        },
        {
            "text": "APHA will be exhibiting at New Scientist Live in London (7 - 9 October) for the first time this year. This is one of the biggest science public engagement events in the country and we are looking forward to interacting with visitors to our stand to talk about animal and plant diseases, how they spread and how everyone can play a part in protecting the UK. If you’re interested in science, there is a great line up of speakers and exhibitions, so book your tickets here and come along and talk to us on stand G12."
        },
        {
            "heading": 4,
            "text": "Science open days at APHA Weybridge"
        },
        {
            "text": "We are also planning some morning or afternoon open days at our Weybridge science headquarters on 1 to 3 November 2023. There will be a two-hour programme of science displays and tours, for a group of up to 40 sixth form college or technical college students, with an interest in learning more about working on animal health research and diagnosis or in supporting roles, such as scientific project management. There will also be chance to speak to our scientists about their career pathway and our HR team about job and further study/training opportunities, including apprenticeships."
        }
    ]
}