{
    "url": "https://defrafarming.blog.gov.uk/2025/07/22/from-invitation-to-agreement-our-approach-to-the-new-csht/",
    "title": "From invitation to agreement: our approach to the new CSHT ",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Countryside Stewardship"
    ],
    "pub_date": "2025-07-22T11:26:52+01:00",
    "content": [
        {
            "text": "In September, the new Countryside Stewardship Higher Tier (CSHT) service will open for applications to those who have been invited to apply, have received pre-application advice and have completed any preparatory work.  "
        },
        {
            "text": "In this post, we’ll give a brief overview of the scheme, our progress so far, and what you need to know about the new CSHT process. "
        },
        {
            "heading": 2,
            "text": "Background "
        },
        {
            "text": "CSHT supports farmers, foresters and land managers to manage their land in a way that: "
        },
        {
            "text": "The actions and capital items available through CSHT support the environment, farm businesses and the rural economy."
        },
        {
            "text": "In autumn 2023, we closed the window to apply for a CSHT agreement. Since then, we’ve worked to improve the scheme. It now offers: "
        },
        {
            "text": "These changes are designed to make it easier to plan and deliver environmental benefits while running resilient, productive farms.  "
        },
        {
            "text": "The new and improved offer includes:  "
        },
        {
            "text": "We’ve taken the time to reopen the scheme in a way that works — not just by making sure the online system runs smoothly, but by giving applicants the support they need from invitation through to agreement. "
        },
        {
            "text": "The preview guidance for CSHT was published in December 2024. It sets out what you can expect from the new scheme including available actions and payment rates. It also provides you with information about how you can get ready to apply for CSHT when it opens for applications. The full CSHT scheme guidance will be published in September. "
        },
        {
            "heading": 2,
            "text": "What you need to know about the new CSHT "
        },
        {
            "heading": 3,
            "text": "You must wait to be invited "
        },
        {
            "text": "Our approach is to gradually bring people into CSHT by rolling out invitations every month. "
        },
        {
            "text": "Since January, selected groups have been invited to pre-application advice from Natural England and the Forestry Commission. These include: "
        },
        {
            "text": "If you’ve received an invitation for pre-application advice and would like to go ahead, please respond within 10 working days. "
        },
        {
            "text": "You don’t need to take any further action if you decide you don't want to, but for woodland applications, if you don’t intend to apply, please let the Forestry Commission know by email.  "
        },
        {
            "text": "Your pre-application invitation email from the RPA includes details on how to respond and what happens next. "
        },
        {
            "heading": 3,
            "text": "You must get advice and complete the pre-application step "
        },
        {
            "text": "Once you’ve confirmed that you are ready to start the pre-application process, a Natural England adviser or Forestry Commission woodland officer will contact you to discuss what you need to do before you can apply. Part of this might involve preparing a plan or study to support your application. "
        },
        {
            "text": "Capital grant funding is available for PA1: Implementation plan, PA2: Feasibility study, PA3: Woodland management plan, PA4: Agroforestry plan, PA5: Moorland mapping or PA7: Species management plan.  "
        },
        {
            "text": "In the case of Natural England, they will work with you to identify the right actions and capital items to include in your application and any plans or studies you need to complete. They’ll also work with you to tailor management prescriptions for each action specifically for your land and to achieve environmental outcomes. "
        },
        {
            "text": "In the case of the Forestry Commission, you will be sent a Woodland improvement pre-application form to fill in. Once you’ve completed it, the Forestry Commission will be in touch. They will let you know if your form is approved, provide advice, and ask any questions. "
        },
        {
            "heading": 3,
            "text": "The invitation to apply follows the pre-application step "
        },
        {
            "text": "After completing the pre-application step and receiving an invitation to apply for an agreement from the Rural Payments Agency (RPA), you’ll be able to access and start your application through the Rural Payments service. "
        },
        {
            "text": "Once the actions and capital items are included in the application, Natural England or the Forestry Commission (or Historic England if the relevant land has scheduled monuments) must review and approve this in the service.  "
        },
        {
            "text": "Once approval is given, you’ll be invited back into the Rural Payments service to submit your application. "
        },
        {
            "text": "If you want someone else to apply on your behalf, such as an agent, you need to check they’re registered with the RPA in the Rural Payments service and give them permission.  "
        },
        {
            "heading": 3,
            "text": "Receiving an agreement offer "
        },
        {
            "text": "Pre-application advice and an invitation to apply don’t guarantee a CSHT agreement.  "
        },
        {
            "text": "But by acting early and taking on the advice of Natural England and/or the Forestry Commission, you’ll give your application the best chance of success. "
        },
        {
            "text": "If you are successful, an agreement offer will be available for you to accept in the Rural Payments service. After that: "
        },
        {
            "heading": 2,
            "text": "Subscribe to the Farming blog"
        },
        {
            "text": "For more updates on CSHT and the wider Farming and Countryside Programme, subscribe to the Farming blog. "
        },
        {
            "text": "You’ll get practical information, scheme updates and stories from farmers across England straight to your inbox. "
        }
    ]
}