{
    "url": "https://naturalengland.blog.gov.uk/2025/07/22/unearthing-the-past-to-restore-our-future-the-role-of-palaeontology-in-nature-recovery/",
    "title": "Unearthing the Past to Restore Our Future: The Role of Palaeontology in Nature Recovery",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Climate change",
        "Education",
        "Evidence",
        "Geology",
        "Landscapes",
        "Natural England",
        "Nature Recovery",
        "Science and evidence",
        "Site of Special Scientific Interest",
        "Species recovery"
    ],
    "pub_date": "2025-07-22T11:09:27+01:00",
    "content": [
        {
            "text": "By Joshua Smith, NE Senior Specialist Palaeontologist"
        },
        {
            "text": "Fossils represent evidence of past life stored in the sequence of rocks below our feet. Like the pages of a book, England's rock record tells the story of changing continents, climates and environments over hundreds of millions of years. "
        },
        {
            "text": "Entangled with these environmental changes is the evidence for the evolution of life. England boasts an exceptionally rich fossil record for its size, from trilobites and dinosaurs to the ancestors of modern humans. This rich fossil diversity proved pivotal in developing the scientific study of rocks (geology) and past life (palaeontology)."
        },
        {
            "text": "As Natural England's only palaeontologist,  I am lucky enough to use England's diverse fossil record to both inform modern conservation and connect people with nature through their local and national paleontological heritage, helping deliver Natural England's vision for nature recovery."
        },
        {
            "text": "Palaeontology as a tool for conservation biology"
        },
        {
            "text": "A growing element of my work is understanding how past environments responded to environmental and climate changes and utilising this knowledge to inform ongoing biological conservation practice and policy - a type of science called conservation paleoecology. "
        },
        {
            "text": "Historically, there has been an element of disconnect between scientists researching conservation paleoecology and meaningful policy outcomes for nature. "
        },
        {
            "text": "However, through Natural England's position as the government's advisor for the natural environment, we are uniquely placed to help implement learnings from the fossil record into modern-day conservation policy and practice."
        },
        {
            "text": "What does this mean in reality? Well, through our collaborative work with academic partners in England's network of National Nature Reserves (NNRs), we are examining the ways in which fossils, can inform the conservation, management and reintroduction of species - such as beavers - on our nature reserves."
        },
        {
            "text": "Natural England is investigating species’ range loss and change, meaning the geographic area where species can survive. By examining past species’ ranges, we hope to understand how species will shift across landscapes as the climate and environment change. "
        },
        {
            "text": "This knowledge will help inform future management strategies, enabling connected landscapes by restoring wildlife corridors, stepping stones, and refugia, creating the conditions for species to adapt and thrive despite climate change."
        },
        {
            "heading": 4,
            "text": "Connecting people with nature through fossil heritage"
        },
        {
            "text": "Another core ambition of nature recovery is connecting people with nature. For many, palaeontology and geology are some of childhood's first true passions. Fossils have a unique capacity to ignite imaginations, connecting people with place and the history of life. "
        },
        {
            "text": "Natural England protects around 200 Sites of Special Scientific Interest (SSSI) for their palaeontology. Although managed for their science, these paleontological SSSIs represent an immense resource for individuals to explore their surrounding natural world and responsibly collect fossils."
        },
        {
            "text": "One such paleontological protected site is Stonesfield Slate Mine in Oxfordshire. In 1824, a professor at the University of Oxford, William Buckland, described Megalosaurus based on fossils from Stonesfield — the first formally named dinosaur. Due to the scientific significance of these fossils, the site is now protected as an SSSI."
        },
        {
            "text": "Palaeontologists are still making discoveries about Megalosaurus, and over the summer of 2024, I was lucky enough to be involved with one such discovery, assisting in excavating the UK's most extensive dinosaur trackways at Ardley Trackway SSSI. "
        },
        {
            "text": "Led by partners at the Universities of Birmingham and Oxford, the dig discovered over 200 fossilised footprints in five distinct trackways. Four trackways were made by large herbivorous dinosaurs called sauropods and one by the carnivorous Megalosaurus. Trackways were first described at Ardley in the late 1990s and were protected as an SSSI in 2010 due to their scientific importance. "
        },
        {
            "text": "The SSSI designation enabled a management plan to be implemented to ensure that future findings were reported to researchers - setting the stage for the most recent set of trackway discoveries. The excavation was broadcast on BBC Two's Digging for Britain with Alice Roberts in January 2025, enabling a broad audience to engage with English fossil heritage."
        },
        {
            "text": "Following these latest discoveries, we are working in partnership with all those involved to ensure the best long-term outcome for the site. "
        },
        {
            "text": "Whilst you may not be able to see the trackways in person, an exhibition at the Oxford University Museum of Natural History called Breaking Ground features footage and photos from the dig and information on the techniques scientists used to discover them. The museum also has the Megalosaurus fossils found by William Buckland, which were used in the first descriptions of dinosaurs in its collections and on display."
        },
        {
            "text": "You can also access a wealth of fossil heritage throughout England's network of paleontological protected sites, for example, in the Axmouth to Lyme Regis Undercliffs NNR. Here, visitors can follow in the footsteps of paleontological pioneers like Mary Anning, collect fossils, and connect with nature through the history of life."
        }
    ]
}