{
    "url": "https://ukhsa.blog.gov.uk/2021/12/08/14634/",
    "title": "COVID-19 vaccination programme: development, distribution, data",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Coronavirus (COVID-19)"
    ],
    "pub_date": "2021-12-08T15:30:41+01:00",
    "content": [
        {
            "text": "The COVID-19 vaccination programme relies on many teams, individuals and organisations, from the scientists who developed the vaccines through to the volunteers who have signed up to support the programme and the NHS staff on the front line."
        },
        {
            "text": "The success of the programme has been critical for the nation's health security. The UKHSA has worked closely with a range of partners who have tested, authorised, procured, monitored, researched, and delivered vaccines. We know the vaccines save lives, and alongside the NHS, DHSC, BEIS, MHRA and many others, our different roles will continue to support the effort to break the link between infection and severe outcomes."
        },
        {
            "text": "As the UK marks the first anniversary of the first-ever COVID-19 vaccine given in the UK, this blog looks at UKHSA’s role in the vaccine's development, distribution and the impact of our real-world data."
        },
        {
            "heading": 2,
            "text": "Vaccine development"
        },
        {
            "text": "Before the first dose of a COVID vaccine was given in the UK, our highly specialised facilities and researchers played a part in the global scientific effort to build a rigorous understanding of COVID vaccines' safety and effectiveness."
        },
        {
            "text": "This work has evolved further, with recent investment in our facilities at Porton Down to help us assess the effectiveness of existing and new vaccines against variants of concern (VoCs). In light of the emergence of the Omicron variant, our skilled and experienced research scientists are now working in our laboratories with live virus to build an understanding of whether Omicron can evade our current vaccines and those in development.  A key part of this work is rapid PCR testing and sequencing of suspected Omicron-positive clinical samples and isolation of virus to support evaluation of performance of in-use Lateral Flow Devises against the Omicron VoC and other genotyping and sequencing analysis across UKHSA and NHS laboratories."
        },
        {
            "heading": 2,
            "text": "Supplying and distributing"
        },
        {
            "text": "On 3 December 2020, the first supplies of the COVID-19 vaccine began to make their way to the UK. UKHSA (then PHE) multidisciplinary teams started to work alongside partners to distribute vaccines across the country, a process that continues today."
        },
        {
            "text": "The logistics of this operation was months in the planning. Teams assessed the UK’s infrastructure to ensure that vaccines could be safely stored and delivered and huge freezers and warehouses were prepared to accommodate different vaccines. The vaccines themselves are just one component in the process of getting a jab. The UKHSA also managed the ordering and distribution of the needles, diluent needed for the Pfizer-BioNTech vaccines, produced patient information leaflets, and patient record cards."
        },
        {
            "text": "A 7-day-a-week service provided by a UKHSA multidisciplinary team supports the COVID-19 vaccination programme to move forward, ensuring that the supply and distribution of vaccines meet the demands of the evolving booster and school-aged programmes."
        },
        {
            "heading": 2,
            "text": "Real world data "
        },
        {
            "text": "Ensuring vaccines are distributed correctly is one part of the puzzle, but with any vaccine programme, safety and effectiveness is crucial to the big picture. As soon as health professionals began administering on 8 December, UKHSA experts (then PHE) began gathering vital real-world data. This data has underpinned vaccination advice for health professionals, provided vital reassurance to the public, and demonstrated real world insights into vaccine safety, efficacy and side effects."
        },
        {
            "text": "We published the UK’s first real-world data on the effectiveness of the Pfizer BioNTech in February 2021. It confirmed the vaccine was providing high levels of protection against symptomatic COVID-19 disease, instilling vital reassurance in the programme. The results showed one dose of the vaccine was 57 per cent effective for those aged over 80, and a second dose potentially more than 85 per cent effective."
        },
        {
            "text": "In addition, our SIREN study of over 40,000 healthcare workers who were among the first to receive the vaccine showed promising results when it was also published in February 2021. Initial results of the study showed one dose of the vaccine reduced the risk of catching COVID-19 infection by more than 70 per cent for those aged under 65, rising to 85 per cent after a second dose. This was among the first evidence suggesting the vaccine may be helping to interrupt transmission of the virus, as well as protecting against disease."
        },
        {
            "text": "In the months that followed, we published real-world data on the AstraZeneca vaccine and then data on the vaccine's effectiveness against the Delta variant – the first data of its kind – which showed that although protection against infection was lower than with Alpha, the vaccines were still highly effective against severe disease. We have also published data on waning immunity – critical analysis that informed the rollout of the booster programme."
        },
        {
            "text": "More recently, UKHSA’s assessment of over 355,000 UK births between January and August has provided reassuring evidence about the vaccine's safety in pregnancy, supporting international findings that vaccinated pregnant women experience good outcomes at birth."
        },
        {
            "text": "The UKHSA gathers a huge range of data and information to help shape the vaccine rollout and inform UK strategy as we react to a changing picture."
        },
        {
            "text": "Our surveillance continues to offer much-needed insights that provide evidence of and confidence in the one crucial fact about the UK’s vaccination programme: vaccines work."
        },
        {
            "text": " "
        }
    ]
}