{
    "url": "https://educationinspection.blog.gov.uk/2021/12/08/curriculum-keeping-it-simple/",
    "title": "Curriculum: keeping it simple",
    "authors": [
        "Heather Fearn",
        "Jonathan Keay"
    ],
    "categories": [
        "curriculum",
        "deep dives",
        "education inspection framework"
    ],
    "pub_date": "2021-12-08T10:22:22+00:00",
    "content": [
        {
            "text": "Heather Fearn and Jonathan Keay are Her Majesty’s Inspectors from Ofsted’s curriculum team. They explain the thinking behind how a ‘deep dive’ helps inspectors find out more about the quality of a school’s curriculum."
        },
        {
            "heading": 3,
            "text": "Why focus on curriculum?"
        },
        {
            "text": "Inspectors carry out ‘deep dives’ on inspection. That means they’ll gather evidence on the intent, implementation and impact of the curriculum. We’ll say more on this in a minute. A subject deep dive will explore whether pupils have been taught and have learned the curriculum content they need to achieve the goals that schools have for their education."
        },
        {
            "text": "This inspection focus on curriculum is based on the insight from research into human cognition: if pupils don’t succeed in learning what we hoped then they have knowledge gaps that will be preventing that success. When pupils are successful, the knowledge they need has built over time, allowing them to understand more complex ideas and undertake more complex tasks. A Jenga tower analogy is useful here. When pupils understand more complex ideas, the Jenga tower is sturdy. When bits of knowledge are missing, the tower can become wobbly."
        },
        {
            "text": "When pupils are not successful, this is sometimes because the knowledge they need was not identified and taught to them. It might be obvious if there are gaps in the teaching of mathematics but often pupils can be asked complex questions in English or foundation subjects without the depth of knowledge that would allow them to provide a meaningful answer."
        },
        {
            "text": "Sometimes, the knowledge that pupils need has been taught but perhaps not given the necessary emphasis or not repeated often enough to ensure that they learn it for future use. Pupils can become confused if crucial knowledge is not taught in a coherent sequence or broken down into small enough bite-sized chunks. Perhaps the teaching activities chosen to deliver the curriculum are not effective."
        },
        {
            "text": "Pupils may have all sorts of barriers to learning the curriculum content they need for success. These barriers will need to be overcome if pupils are to achieve the educational goals we share for them."
        },
        {
            "heading": 3,
            "text": "Curriculum: a simple focus"
        },
        {
            "text": "There will always be consultants offering their own advice on how to prepare for an Ofsted inspection. Unfortunately, this advice can often be overcomplicated and can divert your energy from the simple things that matter:"
        },
        {
            "text": "Does your curriculum identify the knowledge pupils need to achieve the goals of their education, and have all pupils learned that knowledge?"
        },
        {
            "text": "Subject leaders do not need to prepare special documentation for Ofsted on intent, implementation and impact. For Ofsted, intent is simply what you want pupils to learn: your curriculum thinking and high-level planning. Implementation is the teaching activities you choose to teach your curriculum. Impact is when that curriculum content is learned. There are no extra forms of documentation needed for inspection because all schools already plan curriculum content and teaching activities designed to ensure that curriculum content is learned."
        },
        {
            "text": "We know that schools are dealing with all the pressures created by the impact of the COVID-19 pandemic. It is all the more important that schools focus on what is most important for pupils’ life chances. Ofsted inspection deep dives focus on what is most crucial for a quality education: that is, quite simply, whether pupils are gaining the knowledge they need to achieve the goals of their education."
        },
        {
            "text": "It’s important to say that we’ve had the privilege of seeing highly effective curriculum thinking in action across our regions over the last term."
        },
        {
            "heading": 3,
            "text": "Should schools carry out their own deep dives?"
        },
        {
            "text": "As we’ve explored, deep dives help us consider the effectiveness of the quality of education in a specific timeframe when we inspect. They aren’t really designed for anything else. If schools want to drill down to the quality of curriculum themselves, there are probably better ways of doing this than doing internal deep dives. That’s because you see your curriculum being taught every day. This gives you scope to consider curriculum effectiveness in more detail and as an ongoing conversation."
        }
    ]
}