{
    "url": "https://movingon.blog.gov.uk/2021/12/08/emissions-value-tampering-on-the-manufacturers-plate/",
    "title": "Emissions value tampering on the manufacturers plate",
    "authors": [
        "Dave Wood"
    ],
    "categories": [
        "Enforcement"
    ],
    "pub_date": "2021-12-08T17:09:10+00:00",
    "content": [
        {
            "text": "Vehicles that are part of a well-managed and maintained fleet should have little difficulty passing the test. Indeed, many operators take pride in achieving a 100% pass rate. And any good operator should be happy that faults picked up on the test be corrected as quickly as possible."
        },
        {
            "text": "But we’ve noticed that some operators aren’t like that."
        },
        {
            "heading": 2,
            "text": "Issues at test"
        },
        {
            "text": "DVSA Vehicle Standards Assessors have picked up on a small number of heavy vehicles being presented for annual test with some form of tampering carried out to the exhaust emissions data recorded on the vehicle manufacturer’s plate."
        },
        {
            "text": "The MOT requires the exhaust emissions to be tested to the manufacturer’s type approval values. If this is not available, the vehicle could be tested to an incorrect standard. A recent recording exercise found that the practice is relatively uncommon. But it does impact government efforts to reduce emissions and could be an indicator of wider poor practice on the operator’s part."
        },
        {
            "heading": 2,
            "text": "Risks to you as an operator"
        },
        {
            "text": "To ensure that this is not an indication of wider poor practice, DVSA enforcement teams have followed up these tampering reports by either writing to the operator asking for an explanation or paying the operator a visit. Most cases have resulted in the operator getting a replacement plate, but some operators have been reported to the Traffic Commissioner for public inquiry consideration."
        },
        {
            "text": "DVSA has also discussed the issue with vehicle manufacturers, and they have offered solutions to reinstate the data if it’s missing. So, if you have discovered you have an issue, contact your local dealer to get the problem resolved, although they will charge for this. This is a much better option than getting a visit from your local DVSA enforcement examiner!"
        }
    ]
}