{
    "url": "https://gds.blog.gov.uk/2021/12/08/gds-is-10-were-ready-for-our-next-chapter/",
    "title": "GDS is 10: we’re ready for our next chapter",
    "authors": [
        "Tom Read - Chief Executive Officer, Government Digital Service",
        "The GDS Team"
    ],
    "categories": [
        "GDS team",
        "People and skills",
        "Transformation"
    ],
    "pub_date": "2021-12-08T10:00:04+00:00",
    "content": [
        {
            "text": "You might think, given we’re celebrating our 10th anniversary, we’re going to tell you how much things have changed. In fact, we want to do the opposite because the purpose that underpins all of our work - a relentless focus on user needs - is exactly the same."
        },
        {
            "text": "The job of making it easier for people to interact with government is something that will never be finished. We need to keep finding and building the things that will make it easy for people to get what they need from government, and then get on with their lives."
        },
        {
            "text": "Thanks to secure funding, a clear strategy and mature, talented teams, we’re confident that that's what we’ll do. And it’s why we’re marking this anniversary with as much excitement for the work ahead, as we are with pride for what we’ve achieved so far. "
        },
        {
            "text": "With that in mind, we asked some of our people to share what excites them about coming to work to tackle some of the most complex, but rewarding, challenges in government. Because whatever the next decade has in store, we’re certain our people will be at the heart of it. "
        },
        {
            "text": "On that note, we’ll soon be advertising exciting new career opportunities across the UK including our hubs in Manchester, Bristol and London (with hybrid working arrangements too).  So if, like Daisy, Kelvin and our other colleagues, you're inspired by the idea of making it quicker and easier for every citizen to get what they need from government - why not join us for our next chapter?"
        },
        {
            "heading": 2,
            "text": "In 10 seconds or less, what excites you most about GDS's next chapter?"
        },
        {
            "heading": 3,
            "text": "Achieving simpler, personalised and more joined-up digital government services - Tom Read, Chief Executive Officer "
        },
        {
            "text": "Read our strategy for 2021-2024."
        },
        {
            "heading": 3,
            "text": "Making it easier for users to find what they need on GOV.UK - Kelvin Gan, Senior Developer"
        },
        {
            "text": "Find out more about our work to improve the navigation on GOV.UK, and what’s coming next."
        },
        {
            "heading": 3,
            "text": "Personalising government services with enriched metadata - Felix Reilly, Data Scientist"
        },
        {
            "text": "Check out mission 2 of our strategy to learn more about this."
        },
        {
            "heading": 3,
            "text": "Unpicking government complexity so users don’t have to - Daisy Wain, Lead Performance Analyst"
        },
        {
            "text": "This animation explains more about our vision for joined-up, proactive and personalised services."
        },
        {
            "heading": 3,
            "text": "Unlocking the benefits of One Login for Government - Natalie Jones, Director for Digital Identity"
        },
        {
            "text": "Explore the progress we’ve made so far with One Login for Government, and our plans for the next 3 years."
        },
        {
            "heading": 3,
            "text": "Continuing to use research to enable better, user-centred decisions - Paloma Jain, Senior User Researcher"
        },
        {
            "text": "Find out what life as a user researcher is like at GDS."
        },
        {
            "heading": 3,
            "text": "Connecting, organising and publishing government information effectively - Tobi Ogunsina, Senior Product Manager"
        },
        {
            "heading": 3,
            "text": "Offering opportunities for top tech talent outside of London - Stacey Till, Recruitment Business Partner"
        },
        {
            "text": "Find out more about our open roles."
        },
        {
            "heading": 3,
            "text": "Putting down roots in the north-west and south-west - Paul Schagen, Locations Programme Lead "
        },
        {
            "heading": 2,
            "text": "Join us"
        },
        {
            "text": "Played a part in the Government Digital Service’s first decade? Share your highlights, memories or shout out a colleague using #GDSis10 on social media."
        },
        {
            "text": "Keen to play a part in our next chapter? Find out more about our open roles and forthcoming career opportunities."
        }
    ]
}