{
    "url": "https://grantscommunity.blog.gov.uk/2021/12/08/government-grants-a-simpler-faster-and-fairer-way/",
    "title": "Government grants - a simpler, faster and fairer way",
    "authors": [
        "Lucia Webster"
    ],
    "categories": [
        "Digital transformation",
        "Grants Applicant Programme",
        "User research"
    ],
    "pub_date": "2021-12-08T09:02:07+00:00",
    "content": [
        {
            "text": "Sometimes, life can be tough, right? When the chips are down many people turn to voluntary, community and social enterprise (VCSE) organisations to get them through to brighter days. "
        },
        {
            "text": "But if you are part of one of those truly heroic VCSE organisations, who do you turn to for help? Where do you look for different and new funding streams and grants? Where do you start? "
        },
        {
            "text": "Having worked with VCSE organisations throughout my adult life, I have seen and heard first-hand just how hard it can be."
        },
        {
            "text": "Many organisations don’t have the time or resources to find and apply for grants. Many don’t know which government departments do what. And why should they? Especially when remits and titles can change."
        },
        {
            "text": "Right now there is no single go-to place to find or apply for government grants. Then, once you have found the grant you want to apply for, the application process can be complicated, time-consuming and costly, especially when you have very stretched resources."
        },
        {
            "text": "So when I saw the job of Delivery Director for the Grants Applicant Programme in the Government Grants Management Function with a mission to modernise and revolutionise grant-giving, I really wanted it. As I knew I could absolutely make a real difference."
        },
        {
            "text": "Now I am 2 months into this dream job. I really have the bit between my teeth and I am determined that life can be simpler, faster and fairer for people and organisations to access government grants. And the team and I have until March 2023 to pilot a new way to prove we can, starting with a small sample of grants."
        },
        {
            "text": "But it would be foolish of me to think we have all of the answers. That is why - from the outset - this work is being guided and shaped by people from VCSE organisations or small and medium-sized private sector businesses who want to work with my colleagues and me to co-create the future."
        },
        {
            "heading": 2,
            "text": "Let's do this together"
        },
        {
            "text": "Join us. "
        },
        {
            "text": "And by us, I mean colleagues from the Government Grants Management Function in Cabinet Office; the Department for Culture, Media and Sport (DCMS); Department for Environment, Food and Rural Affairs (DEFRA); Ministry of Justice (MOJ) and Department for International Trade (DIT) - all funded by HM Treasury’s Shared Outcomes Fund."
        },
        {
            "text": "With you, we aim to have new online services co-created and ready to test with a small sample of grants in spring 2022. Yes, in just a few months."
        },
        {
            "text": "If you want to get involved, I would really value a reality check on a few things:"
        },
        {
            "heading": 2,
            "text": "What else can we do together?"
        },
        {
            "text": "As well as championing better coordination across government departments, we also want to provide support for places and communities to unleash their full potential by facilitating a Government Grants Community of Interest to share knowledge and good practices about grant applications."
        },
        {
            "text": "We have ideas of running masterclasses, workshops, roundtable discussion, user research sessions and other networking events on topics such as digital capability and insight into what grant evaluators look for. But we really want your views on what would improve the ability of your organisation to access the right grants to support you to deliver the best for citizens. So please, let us know."
        },
        {
            "text": "So if you too want to make life simpler, faster and fairer, just drop us a line or sign up to the Community of Interest and join us."
        },
        {
            "text": "I am looking forward to co-creating with you and learning from you."
        },
        {
            "text": " "
        },
        {
            "text": "Lucia Webster\nDelivery Director, Grants Applicant Programme"
        }
    ]
}