{
    "url": "https://dwpdigital.blog.gov.uk/2021/12/08/guest-post-how-apis-kept-our-country-running-when-everything-stopped/",
    "title": "Guest post: how APIs kept our country running when everything stopped ",
    "authors": [
        "Melissa van der Hecht - guest author, Field CTO, Kong "
    ],
    "categories": [
        "APIs",
        "coronavirus",
        "Integration"
    ],
    "pub_date": "2021-12-08T10:38:19+00:00",
    "content": [
        {
            "text": "I’m Field CTO at Kong and passionate about the powerful ways that APIs help people and businesses.  We’ve been working with DWP Digital for two years alongside Jacqui Leggetter’s fantastic Integration Team, and the API-driven outcomes the company is delivering for UK citizens never fail to impress me. "
        },
        {
            "text": "The Department for Work and Pensions (DWP), the UK’s biggest government department, touches every single one of us. Payments totaling £212billion were paid out in benefits and pensions in 2020/21 to support the needs of UK citizens. The DWP administers our pensions, pays out our Universal Credit and health benefits when we can’t work, and partners with other government departments to support the services they provide to citizens.   "
        },
        {
            "text": "This is the status quo. But at the beginning of (the first) lockdown in the UK in 2020, everything changed. The DWP saw 10 times the normal number of claims for benefits. Demand for data from other government departments shot up from 4.5 million requests per day to over 7.5 million requests at peak. There was a huge increase in demand for everything DWP does, with the knowledge that falling behind could be detrimental to the people relying on those services. It was critical for the DWP to support this increase to ensure citizens were supported through this vulnerable time. "
        },
        {
            "text": "Making matters worse, pandemic social distancing rules and restrictions meant the majority of DWP staff were suddenly unable to work. Although processes were quickly set up to enable remote working, right at the very start of the pandemic they weren’t yet in place. With large numbers of people at home, the DWP had a massive challenge ahead of them to handle the increased workload. "
        },
        {
            "text": "Significant change was needed. DWP Digital, the technology arm of the department, turned to APIs and us: Kong, their API gateway supplier partner, to replace some of the lengthy manual steps in the benefits process with automated, scalable processes. Kong proxies all API traffic across the DWP systems and externally to other government departments, ensuring it’s reliable, secured and observable. That means processing all 7.5 million daily requests across the UK government. You can think of APIs as the glue that connects systems and networks together, enabling confidential, secure and reliable data sharing where and when needed.   "
        },
        {
            "text": "This is how APIs kept our country running when everything stopped. "
        },
        {
            "heading": 2,
            "text": "Universal Credit "
        },
        {
            "text": "There were 2.5 million new Universal Credit claims during the first three weeks of the UK lockdown. That means 2.5 million more households in the UK were suddenly without an income. Put into context, that’s more than the population of Birmingham, Leeds and Glasgow put together. Many of these households had always worked and found themselves abruptly made redundant or put on furlough because of the pandemic, and most had never used the DWP services before. These households could no longer rely on their normal salary and desperately needed financial support to meet basic needs of retaining their housing and putting food on their table. "
        },
        {
            "text": "Normally there are face-to-face meetings or phone calls to validate the circumstances of a Universal Credit claim. But under government rules, people were asked to stay at home. The job centres were closed for face-to-face appointments and turned into virtual processing centres. Staff in non-operational roles were temporarily redeployed to process the influx of Universal Credit claims.   "
        },
        {
            "text": " Somehow, the DWP still paid 97% of these claims on time, achieving a normal performance level in a very abnormal situation and ensuring these households received the financial support they needed. How? APIs. In under two weeks, the team built a new API to automate the claim verification process that enabled the payments to be issued on time whilst carefully balancing the need for speed with adequate validation of a claim. This meant rather than calling people into a job centre for a verification interview and manual process, a new verification API was introduced that enabled the DWP to validate the citizen through checking back-end biographic APIs; the citizen verification is now handled by an API rather than requiring people taking the time to check someone’s details manually. "
        },
        {
            "text": " This means those 2.5 million households could be supported at a time of great crisis. Building this API enabled real people, the users of the service, to pay their bills and put food on the table. "
        },
        {
            "heading": 2,
            "text": " Automating medical reports "
        },
        {
            "text": " It’s not just those who’ve lost their jobs that the DWP and their APIs support. Due to health issues, 1.5 million UK citizens are unable to work and need financial support, and this number grew further to 2 million during the lockdown. "
        },
        {
            "text": " Usually, when a claim for benefit is made on the grounds of ill health, a medical practitioner typically assesses the new claimant and certifies them as unfit for work. Once the medical paperwork has been processed, it’s then physically sent to the office that handles the claim, which would be processed and manually put into the benefit system, which then ultimately results in a payment being issued. Due to lockdown, this became unfeasible. Even though medical assessments could be carried out virtually, the outcome or report could not be shipped by paper to the DWP, as this would increase the risk of transmitting COVID, and staff would not be available to receive and distribute paper medical reports.  "
        },
        {
            "text": " The DWP introduced a new API to digitise this process. A new API was built to enable the medical provider partners to upload and send the medical report digitally. Introducing the API that enables medical reports to be uploaded digitally removed numerous manual processes from health benefit claims processing, enabling them to be processed by staff who were working remotely. Ultimately, this API is helping to ensure citizens received the appropriate health benefit at the right time. "
        },
        {
            "text": " The API is scalable and can process large numbers of reports from multiple partners at the same time, and the removal of paperwork has mitigated the risk of spreading of the virus.  "
        },
        {
            "heading": 2,
            "text": " Benefit status check for prescriptions "
        },
        {
            "text": " Most of us, at one point or another, have taken a prescription slip from the doctor to the pharmacy (or increasingly seen our doctors send the prescription directly to the pharmacy). We always go through the same process: Tick the relevant boxes on the back and sign the declaration that states if you have to pay for it or not. If you qualify for free prescriptions, you tick the appropriate box and leave with the medicine you need and probably don’t think any more about what happens to that slip. "
        },
        {
            "text": " However, the next step is that the slip gets processed by the pharmacies and later somebody performs a check to see if the boxes ticked were the right ones. There are very complex rules on eligibility for free prescriptions, and that means they’re easy to get wrong. This has led to a high rate of fraud and error, costing the NHS £250 million a year in administration and debt recovery costs. That’s the equivalent of 28,249 hip replacements!  "
        },
        {
            "text": " The DWP have delivered a new API that gives pharmacies the ability to do a real-time check to see whether people are eligible for free prescriptions as a result of their benefit entitlement, at the point of collection. The API provides a simple, immediate yes-or-no response which not only saves money but enables citizens who may not know if they are eligible to easily check their status. "
        },
        {
            "text": " It’s a fully reusable benefit check API, so the same outcomes here can be applied for other eligibility services such as free school meals, hospital travel expenses, etc. in the future. The benefit check API has been built as a reusable API, using layered microservice APIs from the source citizen information systems that enable the DWP to trace and validate the citizen record, then perform the benefit check. All microservices other than the NHS calculation service are reusable and are now being enhanced for further adoption by other government services. "
        },
        {
            "heading": 2,
            "text": " The ultimate impact of APIs "
        },
        {
            "text": " The fallout from the pandemic has led to a continued unprecedented demand for DWP services for a number of reasons, from the increased number of health-related benefit claims from sufferers of long COVID to bereavement benefits and unemployment benefits as the economy slowly recovers. The APIs rapidly spun up by DWP Digital at the beginning of the pandemic continue to be used and iterated for these citizen services. I’ve just highlighted a few of them here, but there are hundreds of other APIs being used across numerous government departments to ensure that our citizens needs are met reliably and efficiently. "
        },
        {
            "text": " These APIs are secured, governed and made reusable by Kong, the world’s most widely used API gateway. The DWP is also using APIs in Kong to move to a more holistic and multi-channel citizen experience. APIs make shared componentry reusable across each service team, ensuring a consistent and standardised experience. This means the previously independent experiences provided by each DWP service can be joined together in one experience, providing simpler and better help to those who need it.   "
        },
        {
            "text": " "
        }
    ]
}