{
    "url": "https://civilservice.blog.gov.uk/2021/12/08/how-dfe-helped-learners-access-education-period/",
    "title": "How DfE helped learners access education. Period.",
    "authors": [
        "Helen Waite"
    ],
    "categories": [
        "A Modern Civil Service",
        "An Ambitious Civil Service",
        "An Innovative Civil Service",
        "Better policymaking"
    ],
    "pub_date": "2021-12-08T09:25:14+00:00",
    "content": [
        {
            "heading": 3,
            "text": "When the government launched a state scheme providing free period products in English schools and colleges, it not only helped tackle period poverty, but broke the stigma and raised awareness about menstruation."
        },
        {
            "text": "In January 2020, the Department for Education launched a scheme to provide access to free period products in primary schools, secondary schools and organisations for 16- to 19-year-olds in England. Our mission? To ensure that all learners can access period products if and when they need them."
        },
        {
            "text": "Periods are a normal part of life, but they’re not always an easy experience. In 2018, 14% of female college students and 6% of female school pupils reported being unable to afford period products at some point during the previous 12 months."
        },
        {
            "text": "Coming on unexpectedly, forgetting to carry period products or being unable to afford them can all affect a young person’s ability to engage fully in their education."
        },
        {
            "text": "We took action to ensure that periods would never be a barrier to learning, and that nobody would be held back or forced to miss school or college. Through the scheme, organisations can log into an online portal, order a range of products that meet their needs and have these delivered free of charge. Each organisation has a maximum spend cap and, within this, they can choose which products to order and when. "
        },
        {
            "heading": 4,
            "text": "Meet the team"
        },
        {
            "text": "I am fortunate to lead the School Food and Flexible Childcare Team, which comprises around 25 officials based in six locations across the country."
        },
        {
            "text": "At a strategic level, my team’s policy and delivery aims centre around ensuring that learners have the support they need to engage in education. Our policies include free school meals, the national breakfast club programme and the holiday activity and food programme, alongside the period products scheme. "
        },
        {
            "heading": 4,
            "text": "How it started"
        },
        {
            "text": "In March 2019, the then Chancellor of the Exchequer Phillip Hammond announced a national scheme in England to provide free period products to all state secondary schools and colleges. But the coverage was quickly extended to include primary schools as some learners will have started their periods already."
        },
        {
            "text": "When planning how to deliver the scheme, first and foremost, we wanted to understand what organisations and learners needed and wanted."
        },
        {
            "text": "We opened conversations directly with key stakeholders, including charities and school leaders, and secured research funding to undertake an online engagement exercise with learners by setting up anonymised forums.  "
        },
        {
            "heading": 4,
            "text": "Environmentally friendly"
        },
        {
            "text": "This feedback helped us establish what individuals and organisations needed and valued. For example, learners wanted the option of environmentally friendly products whilst still being able to access products which were familiar and comfortable. "
        },
        {
            "text": "Learners also disliked the term ‘sanitary products’ associating it with uncleanliness – and thus, the ‘period products’ scheme was born. The research was published at Period product scheme: the learner perspective."
        },
        {
            "text": "It was important the scheme was available to anybody who needed it, when they needed it, rather than focusing solely on ‘period poverty’. People of all ages will be able to recall a time they forgot to take products out with them, or came on unexpectedly. "
        },
        {
            "heading": 4,
            "text": "Maximum value"
        },
        {
            "text": "We also thought carefully about getting maximum value for taxpayers’ money, noting the scheme was new and unfamiliar. At that stage, we didn’t have a clear view of learners’ needs or demand from organisations. We chose to implement a demand-led approach, ensuring that the department would only pay for products ordered. "
        },
        {
            "heading": 4,
            "text": "Challenges and opportunities "
        },
        {
            "text": "I think we can all agree that 2020 was a year unlike any other! We were fortunate to launch the scheme on 20 January, before any disruption to learner attendance. From the outset, we were delighted with the strong engagement from organisations and the wider public including the campaigner Amika George MBE. "
        },
        {
            "text": "It was important to be responsive to identify and implement improvements wherever possible. One way in which we did this was by monitoring ordering patterns carefully, taking account of varied budgets, which ranged from £15 for a small primary school to around £1,500 for a big secondary. "
        },
        {
            "text": "Modest cost"
        },
        {
            "text": "We quickly identified that smaller primaries (i.e. those who had a £15 budget) were able to use £12 to acquire two large boxes of products but just another 67p would enable them to order an extra pack containing 114 further period pads. Considering the modest cost to the department, and the clear benefits to the organisations affected, we took action to raise the minimum budget to £16 instead, ensuring that overall, we remained within budget. "
        },
        {
            "text": "A further challenge was engagement during partial school closures, where we saw numbers of orders decline. However, we continued to raise awareness of the scheme and have seen an increase in orders since learners have returned to education settings."
        },
        {
            "text": "Working across the department and the UK "
        },
        {
            "text": "While developing the scheme, we worked closely with the devolved administrations and learnt a lot from Scotland in particular, who were the first of the four nations to make free period products available to learners in 2018. "
        },
        {
            "text": "Within our department, we worked especially closely with Relationships, Sex and Health Education (RSHE) colleagues while they were developing their statutory guidance and curriculum. Through the new Health Education curriculum, learners are taught specifically about menstruation and stigma: Relationships and sex education (RSE) and health education."
        },
        {
            "heading": 4,
            "text": "It made a difference!"
        },
        {
            "text": "In 2020, 76% of secondary schools, 79% of post-16 organisations and 41% of primary schools ordered products."
        },
        {
            "text": "In total during the first year of the scheme, 16,698 orders had been placed: an encouraging figure illustrating that we’re taking a huge step towards providing learners with free period products when they need them. Statistical information about the first year of the scheme can be found here: Period products scheme: management information."
        },
        {
            "text": "In 2021, we’ve seen orders continue to grow and an increased awareness of the scheme. Our communications activity continues, to ensure all learners can access products. "
        },
        {
            "text": "The scheme has been praised for its construct and specifically its consideration and application of social value, winning the main Crown Commercial Award in 2020. The Period Product Scheme has now been officially extended until August 2022."
        },
        {
            "heading": 4,
            "text": "Lesley Grover, Assistant Headteacher, The Boswells School, Essex"
        },
        {
            "text": "The Boswells School in Essex “found this scheme to be fantastic and it has helped to talk more openly about what is still a taboo subject. "
        },
        {
            "text": "I think the range of products available is very good, and a key benefit of the scheme has been ensuring that our PPG/Disadvantaged students have access to free products; it’s a great step in eradicating period poverty.’ "
        },
        {
            "text": "Our supplier, phs, ran a survey in April. Out of the 174 participants, 93% said they were either satisfied or very satisfied with the service. "
        },
        {
            "text": "We continue to work with our supplier to increase awareness about the scheme and create further case studies."
        },
        {
            "text": "It is hugely gratifying to know that this has made a significant difference to learners. Nobody should ever have to worry about missing school because they have a period. It really has changed lives."
        }
    ]
}