{
    "url": "https://planninginspectorate.blog.gov.uk/2021/12/08/improving-national-infrastructure-planning-one-sprint-at-a-time/",
    "title": "Improving national infrastructure planning, one sprint at a time!",
    "authors": [
        "Simone Wilding"
    ],
    "categories": [
        "Applications",
        "Service improvement"
    ],
    "pub_date": "2021-12-08T11:23:47+00:00",
    "content": [
        {
            "text": "Simone Wilding (head of operations and service owner) leads the improvements to the Inspectorate’s applications service. In this post she explains why passing the service standard is good news for the project, and shares an early preview of the developing online service."
        },
        {
            "text": "In June, we blogged about transforming our three services – appeals, applications and examinations – and how we’re making improvements."
        },
        {
            "text": "Six months on and the work to modernise our applications service has been progressing quietly but productively."
        },
        {
            "text": "The applications service covers any application dealt with by the Planning Inspectorate. The majority are national significant infrastructure project (NSIP) applications but there are also other applications, including:"
        },
        {
            "text": "The project is currently focusing on improvements to how users engage with NSIP applications, to make the experience easier, faster and more cost effective."
        },
        {
            "heading": 3,
            "text": "Alpha assessment: Meeting the service standard"
        },
        {
            "text": "This autumn the project passed the Alpha Assessment. Alpha is the second of four phases in the agile way of delivering projects as depicted below."
        },
        {
            "text": "It’s an important milestone in the project – as developing any government service with a digital element needs to meet key standards."
        },
        {
            "text": "Meeting the Government Digital Service standards is of fundamental importance for two main reasons:"
        },
        {
            "text": "Meeting this key milestone is testament to the hard work of the team, who have learned incredibly fast about all the complexities of the national infrastructure planning regime."
        },
        {
            "heading": 3,
            "text": "What we learnt from user research"
        },
        {
            "text": "Who did we speak to?"
        },
        {
            "text": "We are very grateful that 200 service users have given their time to take part in user research to date. Both professional and non-professional service users have engaged in various research methods. This includes one-to-one interviews, usability testing of potential website ideas and card sorting to allow us to understand how information is best grouped and labelled."
        },
        {
            "text": "What did we learn?"
        },
        {
            "text": "How we can overcome these key pain points has driven the design of the new service. We are iteratively coming up with new ideas, testing them with users then acting on our learnings. It is important to us that we create an inclusive and transparent service that allows service users to engage in the process easily and efficiently."
        },
        {
            "text": "Thank you to everyone who has taken part in our research."
        },
        {
            "heading": 3,
            "text": "Where next?"
        },
        {
            "text": "We are now preparing to partner with a live NSIP application for the remainder of the Private Beta stage. We anticipate that users will be able to experience the new service in action on the pilot project from February/March 2022. We are looking forward to receiving feedback on our new and improved user journey, which will be valuable in making improvements so we are confident we can roll the service out wider."
        },
        {
            "heading": 3,
            "text": "A sneak peek"
        },
        {
            "text": "The following screenshots provide an early view of the service as experienced by users. However, I should include a caveat about the information on these screenshots which has been added for testing purposes and should not be taken as accurate case information. Click to enlarge the images."
        },
        {
            "text": "Above: A filterable list showing NSIPs by status"
        },
        {
            "text": "Above: Start page for registering as an interested party"
        },
        {
            "text": "Above: The user follows a much simpler workflow to register as an interested party"
        },
        {
            "text": "Above: Showing the key information on a conceptual project overview page. Key information like the project stage, documents and timeline is much clearer and more accessible for users."
        },
        {
            "text": "Above: A prototype of the project application documents page. There are typically hundreds of documents that need to be published for NSIP applications."
        },
        {
            "heading": 3,
            "text": "Keep tuned for more about our service improvements"
        },
        {
            "text": "We will be blogging more about our service improvements over the coming months. Subscribe to keep updated about all our blog posts."
        }
    ]
}