{
    "url": "https://ukhsa.blog.gov.uk/2021/12/08/investigating-omicron-what-ukhsa-is-doing-now/",
    "title": "Investigating Omicron: what UKHSA is doing now",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Coronavirus (COVID-19)",
        "UKHSA"
    ],
    "pub_date": "2021-12-08T11:23:23+01:00",
    "content": [
        {
            "text": "Last month, a new variant of the virus that causes COVID-19 infection named Omicron was identified and countries around the world are taking action to identify cases and outbreaks and control the spread while we learn more."
        },
        {
            "text": "All viruses naturally change and evolve over time, and SARS-CoV-2, the virus that causes COVID-19 disease, is no exception. Sometimes, changes and mutations result in new variants that may be sufficiently different biologically to impact the severity of infection, susceptibility to infection, or transmissibility of the virus. The changes can potentially also affect the efficacy of our diagnostic tests or vaccines."
        },
        {
            "text": "This ability to mutate is one of the biggest challenges we face when responding to an outbreak of a virus. This is why we have increased our genomic sequencing capacity, to strengthen our surveillance and help us identify new variants of potential public health concern more quickly and effectively."
        },
        {
            "text": "But variants can appear anywhere in the globe and we are grateful to scientists in South Africa who reported rapidly the identification of a variant, now referred to as Omicron. In this blog we describe the investigations that we undertake to characterise and understand a new variant."
        },
        {
            "heading": 2,
            "text": "How we’re reducing the spread of the Omicron variant"
        },
        {
            "text": "As soon as the new variant was identified in South Africa, we put in place a range of measures to identify any possible cases and prevent infection from spreading. When we identify a case, the contacts are traced, tested and asked to self-isolate. We have conducted targeted testing in specific locations where known Omicron cases have visited to identify and control any possible spread. We have also advised on public health measures, such as wearing masks, to reduce the risk of transmission."
        },
        {
            "text": "Whole genome sequencing (WGS) is an important component of our surveillance to identify cases of different variants, following a positive PCR test result. This process can take a few days, so we use a marker known as ‘S gene target failure’ to identify possible Omicron cases rapidly and inform public health action. The Omicron variant of the virus has a number of mutations which mean that the S gene does not show up in PCR results. This referred to as S gene dropout or S gene target failure and it can be used as marker for this variant pending the WGS results."
        },
        {
            "text": "We work closely with partners globally, by sharing our COVID-19 genomic sequencing data internationally through GISAID and other platforms and by supporting other countries to strengthen their own genomic surveillance."
        },
        {
            "heading": 2,
            "text": "Rapid research to understand the public health impact of Omicron"
        },
        {
            "text": "Scientists have used samples from the first positive cases of Omicron identified in the UK to isolate the virus. They do this by incubating the materials containing the virus with cells and growing the virus in the laboratory. The virus is incubated to allow it to multiply. This can take up to seven days or sometimes longer and it results in a small volume of “virus stock”. Once they have produced the virus stock, our scientists can undertake the critical risk assessment studies to understand the risks from the new variant."
        },
        {
            "text": "These studies which are now underway for Omicron in UKHSA include:"
        },
        {
            "text": "All of these tests are performed as quickly and effectively as possible, and under strict containment to ensure the safety of our scientists and the public."
        },
        {
            "heading": 2,
            "text": "Protecting ourselves"
        },
        {
            "text": "These important studies take a bit of time. In the meantime, as we can see, the COVID-19 pandemic is far from over and it’s really important that everyone follows public health advice to protect themselves and others against all forms of COVID-19 infection."
        },
        {
            "text": "The best ways to do this are to:"
        }
    ]
}