{
    "url": "https://grantscommunity.blog.gov.uk/2021/12/08/join-us-to-co-create-the-future/",
    "title": "Join us to co-create the future",
    "authors": [
        "Lisa White"
    ],
    "categories": [
        "Digital transformation",
        "Expert Services",
        "Grants Applicant Programme",
        "Spotlight",
        "User research"
    ],
    "pub_date": "2021-12-08T09:00:26+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Welcome to the new blog space for the Government Grants Community"
        },
        {
            "text": "Over the weeks and months to come we will be blogging about all things to do with grants and keeping you up to date with what we are doing and why - asking for your support in making it much simpler, faster and fairer to find and apply for government grants, and much more."
        },
        {
            "text": "In this blog post, we wanted to introduce you to some of the team:"
        },
        {
            "heading": 3,
            "text": "Lucia Webster - Grants Applicant Programme (GAP), Delivery Director"
        },
        {
            "text": "Right now there is no single go-to place to find or apply for government grants. Then, once you have found the grant you want to apply for, the application process can be complicated, time-consuming and costly, especially when you have very stretched resources. "
        },
        {
            "text": "I am determined that life can be simpler, faster and fairer for people and organisations to access government grants. The team and I have until March 2023 to prove we can. You can read all about what we are doing and why in my blog post."
        },
        {
            "heading": 3,
            "text": "Thomas Hezlett - GAP Lead Business Analyst"
        },
        {
            "text": "I am working to understand what the challenges are for voluntary, community and social enterprise (VCSE) organisation colleagues when they apply for grants - or perhaps why they have never applied. My first blog post covers the challenges that have already been flagged plus our plans for the next phase of our user research. Hopefully, you will want to join us."
        },
        {
            "heading": 3,
            "text": "Amie Wilsdon-Tagg - GAP Engagement Lead"
        },
        {
            "text": "I am starting to meet ‘virtually’ with VCSE organisations to listen and learn more. Over the weeks to come we will be setting up more virtual events, including masterclasses and workshops. If you would like to sign up for the community of interest or to suggest a topic for one of these sessions, drop me a line."
        },
        {
            "heading": 3,
            "text": "Tariq York - Grants Expert Support Team"
        },
        {
            "text": "I will get the chance to share a blog post in the new year, where I’ll cover the work we do with departments, including giving expert advice on design and delivery, paying out in emergencies, mitigation against fraud or error, and ongoing monitoring for schemes right across government. Until then, please do join our community of interest."
        },
        {
            "heading": 3,
            "text": "Ivana Gordon - Grants Expert Services, Deputy Director"
        },
        {
            "text": "In my blog post, I will give you the backstory of how we got to here, including our work on Spotlight, which we are very proud to say was shortlisted for a Digital Leaders 100 award in November 2021."
        },
        {
            "heading": 2,
            "text": "Introduce yourself to us"
        },
        {
            "text": "It would be great if you now felt able to introduce yourself to us. Do feel free to use the comment section below. You can also subscribe to the blog so that you can receive notifications whenever we post on the blog."
        }
    ]
}