{
    "url": "https://food.blog.gov.uk/2021/12/08/top-10-kitchen-hygiene-hacks-for-students/",
    "title": "Top 10 kitchen hygiene hacks for students",
    "authors": [
        "Sam Easterbook, Content Manager"
    ],
    "categories": [
        "Hygiene"
    ],
    "pub_date": "2021-12-08T12:42:48+00:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "Are you coming to the end of your first term at university? Hopefully, you’ve studied hard and enjoyed yourself too, but we’ve got one final test for you. How clean is your kitchen?"
        },
        {
            "text": "If you feel you need to up your food hygiene game, then follow these hacks and avoid food poisoning."
        },
        {
            "heading": 2,
            "text": "#1 Know the difference between use-by and best before dates"
        },
        {
            "text": "Here’s the golden rule for dates on food:"
        },
        {
            "text": "Always check for mould before you do consume it though."
        },
        {
            "text": "Usually fruit, veg and bread have best before dates while dairy, meat and fish will have a use-by date. Double-check though. And you can ignore ‘display until’ – that’s for the shops and not the shoppers."
        },
        {
            "heading": 2,
            "text": "#2 Use takeaway containers to avoid cross-contamination"
        },
        {
            "text": "In an ideal world, you’d have your own fridge, with your meat at the bottom, cooked food separated from raw food, and plenty of space for the air to circulate and keep everything at the right temp… that’s 5C or below, as I’m sure you know."
        },
        {
            "text": "In a shared kitchen you might only have one shelf to yourself in a fridge, so use plastic containers, like takeaway trays, to keep food sealed, separated and safe."
        },
        {
            "heading": 2,
            "text": "#3 Read the instructions and cook your food properly"
        },
        {
            "text": "Over the last 18 months, we’ve seen lots of cases of salmonella poisoning linked to people not cooking their chicken nuggets and goujons thoroughly. Seriously, not preparing your food properly can make you ill."
        },
        {
            "text": "Breaded chicken products may contain raw chicken and are not ready to eat uncooked unless the packaging says so."
        },
        {
            "text": "Always follow the instructions and check that your food is steaming hot before eating. If you’re cooking a few things that require different temperatures and times, go with the highest temperature and longest time. Better safe than sorry."
        },
        {
            "heading": 2,
            "text": "#4 Wash your hands"
        },
        {
            "text": "It’s been peak handwashing time recently and it’s important to keep it going when in the kitchen. You know the drill, 20 seconds, hot soapy water, etc."
        },
        {
            "text": "You should wash your hands:"
        },
        {
            "text": "This will reduce the spread of harmful bacteria and viruses that can cause illness. Wash your hands!"
        },
        {
            "heading": 2,
            "text": "#5 Make a cleaning rota"
        },
        {
            "text": "No one likes a stinking kitchen, and the best way to avoid that in shared accommodation is to make a rota and stick to it. You may even want to pool funds so you’re always stocked up on sponges, washing up liquid, cleaning products etc."
        },
        {
            "text": "Also get into the habit of regularly washing and changing tea towels, oven gloves, and dishcloths. It’s a faff but it’s better than food poisoning."
        },
        {
            "text": "Include taking the bins out regularly on your rota. Check with your local authority (usually the city council) if they do food waste collections and change food waste bins often to avoid flies, pests and foul smells. Again, wash your hands after handling the bins."
        },
        {
            "text": "Finally, remember, there’s no I in rota."
        },
        {
            "heading": 2,
            "text": "#6 Put your phone down when cooking"
        },
        {
            "text": "Yeah, we know, but there’s research that shows that phones can be pretty dirty and contaminated with all sorts of germs."
        },
        {
            "text": "So, regularly clean and sanitize your phone, especially when you are using it to read recipes or help you cook."
        },
        {
            "text": "Also, you can adjust the screen time on your device, so it doesn’t turn off while you’re cooking. This will save you from having to touch it too often while in the kitchen."
        },
        {
            "heading": 2,
            "text": "#7 Be a responsible leftover lover"
        },
        {
            "text": "Reusing and reinventing your leftovers is a great way to make the most of your food."
        },
        {
            "text": "So, cool and cover your leftovers, and put them in a fridge or freezer within one to two hours."
        },
        {
            "text": "You can even split leftovers into smaller portions so that they cool quicker. This can also help portion control and planning future meals."
        },
        {
            "text": "If you do store your leftovers in a fridge, rather than freezing them, eat them within two days. Except for rice. Rice is nice, but not after 2 days, eat leftover rice within a day and don’t reheat more than once."
        },
        {
            "heading": 2,
            "text": "#8 Take a photo of your fridge before you go shopping"
        },
        {
            "text": "This way you’ll know how much space you have and what you’ve already got. This may stop you from buying too much and wasting food and money."
        },
        {
            "heading": 2,
            "text": "#9 Freeze fresh food you might not use"
        },
        {
            "text": "If you can’t resist a special offer, you may end up coming back from the shops with too much food. Or maybe you’ve signed up to one of those apps that offer low-date food at knockdown prices, or you go to FareShare?"
        },
        {
            "text": "Don’t waste your money and good food by binning anything that won’t fit in the fridge or is getting close to the use-by date, use your freezer wisely and save it for another day."
        },
        {
            "text": "Love Food Hate Waste has an A-Z covering every food you can think of and whether you can freeze it or not."
        },
        {
            "heading": 2,
            "text": "#10 Don’t leave food out to defrost"
        },
        {
            "text": "You’ve done your batch cooking for the week, you’ve portioned it up, and put it in the freezer. Job done. Except for the reheating part."
        },
        {
            "text": "The thing is defrosting food at room temperature can lead to food poisoning. Use your fridge to safely thaw your food instead, or the defrost setting on your microwave."
        },
        {
            "heading": 2,
            "text": "More tips, tricks and hacks for student food:"
        },
        {
            "heading": 1,
            "text": "Y 10 awgrym gorau i fyfyrwyr ar gyfer hylendid yn y gegin"
        },
        {
            "text": " "
        },
        {
            "text": "Wyt ti’n tynnu at derfyn dy dymor cyntaf yn y brifysgol? Gobeithio dy fod di wedi bod yn astudio'n galed a dy fod di wedi mwynhau hefyd, ond mae gyda ni un prawf olaf i ti. Pa mor lân yw dy gegin di?"
        },
        {
            "text": "Os wyt ti’n teimlo bod angen i ti wella dy arferion hylendid bwyd, dilyna’r camau canlynol i osgoi gwenwyn bwyd."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "#1 Gwybod y gwahaniaeth rhwng dyddiadau 'defnyddio erbyn' ac 'ar ei orau cyn'"
        },
        {
            "text": "Dyma’r rheol euraid ar gyfer dyddiadau ar fwyd:"
        },
        {
            "text": "Gwiria am lwydni bob tro cyn i ti ei fwyta, fodd bynnag."
        },
        {
            "text": "Fel arfer, bydd gan ffrwythau, llysiau a bara ddyddiadau ‘ar ei orau cyn’, tra bydd gan laeth, pysgod a chig ddyddiadau ‘defnyddio erbyn’. Gwiria ddwywaith serch hynny. A gelli di anwybyddu’r dyddiad ‘arddangos tan’ – mae hwnnw ar gyfer y siopau ac nid y siopwyr."
        },
        {
            "heading": 2,
            "text": "#2 Defnyddio cynwysyddion tecawê i osgoi croeshalogi"
        },
        {
            "text": "Mewn byd delfrydol, bydd gyda ti dy oergell dy hunan, gyda dy gig ar y gwaelod, dy fwyd wedi’i goginio wedi’i gadw ar wahân i’r bwyd amrwd, a digonedd o le i’r aer gylchredeg a chadw popeth ar y tymheredd iawn... sef 5C neu’n is, fel y gwyddost ti, siŵr iawn."
        },
        {
            "text": "Mewn cegin a rennir, efallai na fydd gyda ti ond un silff i ti dy hunan yn yr oergell, felly defnyddia gynwysyddion plastig, fel y rheiny byddi di’n eu cael o siopau tecawê, i gadw bwyd wedi’i seilio, ar wahân, ac yn ddiogel."
        },
        {
            "heading": 2,
            "text": "#3 Darllen y cyfarwyddiadau a choginio dy fwyd yn gywir"
        },
        {
            "text": "Dros yr 18 mis diwethaf, rydym ni wedi gweld llawer o achosion o wenwyno â salmonela sy’n gysylltiedig â phobl yn methu â choginio eu nygets cyw iâr yn drylwyr. O ddifrif, gall peidio â pharatoi dy fwyd yn iawn dy wneud di’n sâl."
        },
        {
            "text": "Gallai cynhyrchion cyw iâr mewn briwsion bara gynnwys cyw iâr amrwd, ac nid ydynt yn barod i’w bwyta’n amrwd oni bai bod y deunydd pecynnu yn nodi felly."
        },
        {
            "text": "Dilyna’r cyfarwyddiadau bob amser a gwiria fod dy fwyd yn stemio’n boeth cyn bwyta. Os wyt ti’n coginio pethau sy’n gofyn am dymereddau ac amseroedd gwahanol, cer gyda’r tymheredd uchaf a’r amser hiraf. Gwell bod yn ddiogel na difaru."
        },
        {
            "heading": 2,
            "text": "#4 Golchi dy ddwylo"
        },
        {
            "text": "Yn ddiweddar mae golchi dwylo wedi bod yn ei anterth, ac mae’n bwysig ein bod ni’n parhau â’r arfer yn y gegin. Rwyt ti’n gwybod y drefn: 20 eiliad, dŵr sebonllyd poeth, ac ati."
        },
        {
            "text": "Dylet ti olchi dy ddwylo"
        },
        {
            "text": "Bydd hyn yn helpu i atal lledaenu bacteria a firysau niweidiol a all achosi salwch. Golcha dy ddwylo!"
        },
        {
            "heading": 2,
            "text": "#5 Creu rota lanhau"
        },
        {
            "text": "Nid yw unrhyw un yn hoff o gegin front, a'r ffordd orau o osgoi hynny mewn llety a rennir yw creu rota a chadw ati. Efallai y byddwch chi hyd yn oed am gronni arian fel bod wastad gyda chi ddigon o sbyngau, hylif golchi llestri, cynhyrchion glanhau, ac ati."
        },
        {
            "text": "Hefyd, ewch i'r arfer o olchi a newid llieiniau sychu llestri, menig popty, ac ati yn rheolaidd. Mae’n dipyn o ffwlffacan, ond mae’n well na gwenwyn bwyd."
        },
        {
            "text": "Ar eich rota, sicrhewch eich bod chi’n cynnwys mynd â’r biniau mas yn rheolaidd. Gwiriwch gyda'ch awdurdod lleol (cyngor y ddinas, fel arfer) a ydyn nhw'n casglu gwastraff bwyd ac yn newid biniau gwastraff bwyd yn aml er mwyn osgoi pryfed, plâu ac arogleuon ffiaidd. Unwaith eto, golchwch eich dwylo ar ôl trin y biniau."
        },
        {
            "text": "Yn olaf, cofiwch: cyfrifoldeb ar y cyd yw rota."
        },
        {
            "heading": 2,
            "text": "#6 Rhoi dy ffôn i lawr wrth goginio"
        },
        {
            "text": "Ie, rydym ni'n gwybod, ond mae yna ymchwil sy'n dangos y gall ffonau fod yn eithaf brwnt ac wedi’u halogi â germau o bob math."
        },
        {
            "text": "Felly sicrha dy fod di’n glanhau ac yn glanweithio dy ffôn yn rheolaidd, yn enwedig pan fyddi di’n ei ddefnyddio i ddarllen ryseitiau neu i dy helpu i goginio."
        },
        {
            "text": "Hefyd, gelli di addasu amser y sgrin ar dy ddyfais, fel nad yw’n diffodd wrth i ti goginio. Bydd hyn yn dy gadw di rhag gorfod cyffwrdd ag e’n rhy aml pan fyddi di yn y gegin."
        },
        {
            "heading": 2,
            "text": "#7 Bydd gyfrifol a charu bwyd dros ben"
        },
        {
            "text": "Mae ailddefnyddio dy fwyd dros ben yn ffordd wych o wneud y gorau o dy fwyd."
        },
        {
            "text": "Felly cofia oeri a gorchuddio dy fwyd dros ben, a’i roi yn yr oergell neu’r rhewgell o fewn awr neu ddwy."
        },
        {
            "text": "Gelli di hyd yn oed rannu bwyd dros ben yn ddognau llai fel ei fod yn oeri yn gyflymach. Gall hyn hefyd helpu i reoli dognau a chynllunio prydau yn y dyfodol."
        },
        {
            "text": "Os wyt ti’n storio dy fwyd dros ben mewn oergell, yn hytrach na’i rewi, dylet ti ei fwyta ymhen dau ddiwrnod. Ac eithrio reis. Mae reis yn neis, ond nid ar ôl 2 ddiwrnod. Bwytâ reis dros ben o fewn diwrnod a phaid â’i ailgynhesu fwy nag unwaith."
        },
        {
            "heading": 2,
            "text": "#8 Tynnu llun o dy oergell cyn i ti fynd i siopa"
        },
        {
            "text": "Trwy wneud hyn, byddi di’n gwybod faint o le sydd gyda ti a beth sydd gyda ti eisoes. Efallai y bydd hyn yn dy atal rhag prynu gormod a gwastraffu bwyd ac arian."
        },
        {
            "heading": 2,
            "text": "#9 Cofio rhewi bwyd ffres na fyddet o bosib yn ei ddefnyddio"
        },
        {
            "text": "Os na elli di wrthod temtasiwn cynnig arbennig, efallai y byddi di’n dod yn ôl o'r siopau gyda gormod o fwyd. Neu efallai dy fod wedi cofrestru ar un o'r apiau hynny sy'n cynnig bwyd gyda dyddiadau agos am brisiau is, neu efallai rwyt ti'n mynd i FareShare?"
        },
        {
            "text": "Paid â gwastraffu dy arian a bwyd da trwy daflu i ffwrdd unrhyw beth na fydd yn ffitio yn yr oergell neu sy'n agosáu at y dyddiad ‘defnyddio erbyn’; defnyddia dy rewgell yn ddoeth a chadw y bwyd at ddiwrnod arall."
        },
        {
            "text": "Mae gan Love Food Hate Waste A-Z sy'n cwmpasu ystod eang o fwydydd, ac a elli  di eu rhewi ai peidio."
        },
        {
            "heading": 2,
            "text": "#10 Peidio â gadael bwyd mas i ddadmer"
        },
        {
            "text": "Rwyt ti wedi coginio dy sypiau am yr wythnos, eu dogni, a’u rhoi yn y rhewgell. Dyna’r jobyn wedi'i wneud. Ac eithrio'r aildwymo."
        },
        {
            "text": "Y peth yw, gall dadrewi bwyd ar dymheredd ystafell arwain at wenwyn bwyd. Yn lle hynny, defnyddia dy oergell i ddadmer dy fwyd yn ddiogel, neu'r gosodiad dadrewi ar dy ficro-don."
        },
        {
            "heading": 2,
            "text": "Rhagor o awgrymiadau, triciau a haciau ar gyfer bwyd myfyrwyr:"
        }
    ]
}