{
    "url": "https://grantscommunity.blog.gov.uk/2021/12/08/were-all-ears-tell-us-about-your-experience-of-grants/",
    "title": "We’re all ears: Tell us about your experience of grants.",
    "authors": [
        "Thomas Hezlett"
    ],
    "categories": [
        "Digital transformation",
        "Grants Applicant Programme",
        "User research"
    ],
    "pub_date": "2021-12-08T09:01:33+00:00",
    "content": [
        {
            "heading": 2,
            "text": "What you have told us so far"
        },
        {
            "text": "Now, I don’t want to paint a picture that everything is doom and gloom. In fact, government typically distributes £118 billion in grants each year (figure from 1 April 2019 to 31 March 2020), of which billions are secured by organisations doing great things in neighbourhoods, towns and cities right across the UK."
        },
        {
            "text": "But we have spoken with prospective applicants from over 25 organisations and grant administrators across government departments so far and heard - loud and clear - just how difficult some things can be right now. Broadly, there are 7 themes emerging."
        },
        {
            "heading": 3,
            "text": "1. Identifying what grant is appropriate"
        },
        {
            "text": "You have told us that it is sometimes really challenging to identify suitable grants and that there are multiple different routes to interact with the different parts of government. And for some of you this lack of clarity leads to low confidence in applying. Or you just give up and don’t apply."
        },
        {
            "heading": 3,
            "text": "2. Time-consuming, costly and burdensome application processes"
        },
        {
            "text": "Some of you have told us that you find the experience a time-consuming and labour-intensive process when applying for grants. This can lead to higher costs associated with applications. Again, we want to help you ensure that more of your money is spent on delivery outcomes for your locality by making things simpler and faster for you."
        },
        {
            "heading": 3,
            "text": "3. Barriers to entry for certain segments of society"
        },
        {
            "text": "You have highlighted that a lack of transparency on the availability of grant funding means that certain segments of society are under-represented. We want to change that as part of living up to our ambitions to attract the best range of diverse applications."
        },
        {
            "heading": 3,
            "text": "4. Lack of competition"
        },
        {
            "text": "Only 32% of the general grant funding was awarded following a competitive process between April 2019 and March 2020. We want to understand more about this."
        },
        {
            "heading": 3,
            "text": "5. Poor data collection"
        },
        {
            "text": "Grant administrators in government have flagged that fragmented and manual upfront processes lead to poor data collection. If we improve data collection, our ability to make better, insight-led decisions would be greatly improved."
        },
        {
            "heading": 3,
            "text": "6. Inconsistent pre-award due diligence"
        },
        {
            "text": "One consequence of poor data collection is that it leads to non-standardised processes for pre-award due diligence across government. Again, we want to explore this more."
        },
        {
            "heading": 3,
            "text": "7. Manual intensive processes for grant makers"
        },
        {
            "text": "Grant administrators have told us that they repeatedly have to double-check information and often have to seek further clarity from applicants. Wouldn’t it be great if we could automate or streamline more of our work to save everyone time and get awards out faster?"
        },
        {
            "text": "Does some or all this resonate with you?"
        },
        {
            "heading": 2,
            "text": "Baby steps"
        },
        {
            "text": "Over the weeks and months to come, as our pilot grants service progresses, we will be refining our understanding and testing out how things can be improved. Our immediate focus, with a small sample of grants schemes, will be to co-create and test a service that can do 3 things:"
        },
        {
            "text": "Our aim is to have a new pilot, online service in spring 2022, with a small sample of grant schemes."
        },
        {
            "text": "To help us, we really do need people from a cross-section of voluntary, community and social enterprise organisations and small to medium-sized private sector businesses who have or would like to apply for government grants. If that’s you, please sign up to be part of our Government Grants Community and the research panel. We will also use this blog to advertise workshops and opportunities that are coming up. "
        },
        {
            "text": "And finally, we totally understand that your time is precious. We know that you will rightly and always prioritise your time on the difference you make to society so we will keep our sessions with you short and to the point."
        },
        {
            "text": " "
        },
        {
            "text": "Thomas Hezlett\nGrants Applicant Programme, Lead Business Analyst"
        }
    ]
}