{
    "url": "https://prisonjobs.blog.gov.uk/2024/01/12/cythnias-work-in-approved-premises-over-christmas-and-the-new-year/",
    "title": "Cythnia's work in approved premises over Christmas and the New Year",
    "authors": [
        "Ministry of Justice"
    ],
    "categories": [
        "Probation"
    ],
    "pub_date": "2024-01-12T11:57:50+00:00",
    "content": [
        {
            "heading": 3,
            "text": "As we're hiring for approved premises workers, we caught up with Cynthia who has been busy working in an approved premises in the Southwest region over the Christmas and New Year period. She reflects on the unique challenges and rewards of her role in supporting offenders, especially during the festive season.  "
        },
        {
            "text": "Cynthia, you’ve been very busy over the festive season, working Christmas Day, Boxing Day, New Years’ Eve- how do you balance your work schedule with your personal commitments? "
        },
        {
            "text": "I am also a carer for my godmother and am mindful that I will be working over the holiday period. I pre-organised a Christmas meal on 22nd December and invited our families. I don't have a lot of time for myself over the holiday period because I am working. My preferred treat is usually lunch and spa day shared with a friend. My birthday is in a few weeks, and I've booked time off which I am looking forward to. "
        },
        {
            "text": "What was the biggest challenge you faced working over the festive period? "
        },
        {
            "text": "Getting offenders involved in activities was the biggest challenge and Christmas is often a trigger for them. I am mindful that two new offenders spend a lot of time in their rooms which isn’t unusual, especially since Covid. However, recently they’ve been leaving their rooms more to engage with other offenders and staff more which is nice to see. "
        },
        {
            "text": "Can you tell us a bit about your role and your duties and responsibilities? "
        },
        {
            "text": "I've worked at this approved premises since February. I am enjoying the new challenge of working in a new premises and it has certainly made the time pass quickly. As a frontline member of staff, I deal with offenders’ day-to-day needs, including all planned and reactive duties. Staff are responsible for monitoring offenders according to their licence conditions. We also help offenders with mental and physical needs by arranging appointments and dispensing medication which are strictly monitored.   "
        },
        {
            "text": "Staff also organise rehabilitative activities for offenders throughout the year and outside agencies come in to work with offenders too. They help them with numerous activities such as cooking, music, yoga and art. One of our main activity providers we work with in the Southwest is Activity Hub who provide purposeful activities for offenders. We've also recently acquired an allotment. Although, there is not an awful lot to do there except turn over the ground and make it ready for planting in the spring.  "
        },
        {
            "text": "We have an offender who learned to do leatherwork while he was in prison. So, he makes handbags, belts, and all sorts of things. We’re encouraging him to make smaller items, things that he could sell in the future like key rings as they take less time to make and are likely to earn him a regular income. He’s showing a lot of the others how to do extremely well-crafted leather work. "
        },
        {
            "text": "How important is teamwork when working on approved premises?  "
        },
        {
            "text": "Working together with colleagues as a team is really important. I work with a fantastic team and appreciate them. My colleague Kim and I worked together over Christmas and New Year which was great because we enjoy engaging offenders in rehabilitative activities.   "
        },
        {
            "text": "What do you think is the most rewarding part of your role?  "
        },
        {
            "text": "When offenders arrive, some are quite guarded. But we soon see the barriers coming down as staff engage in meaningful conversation with them. By the end of their residency, you can see a change in their attitude being more receptive and relaxed around the staff. After being in the service for over twenty-four years I have supervised many offenders and found all the departments I have worked in equally rewarding. The challenge is to be firm, fair and consistent. Approved premises are an enabling environment where offenders feel they can live and be supported to turn their lives around. We have many successes which is rewarding, and it is extremely important to see offenders progress and move on. Overall, the feedback we receive is very good, most people leave feeling more optimistic about their future than before they arrived. "
        },
        {
            "text": "Approved premises provide residential supervision for offenders released on licence and offer a structured environment to support rehabilitation and resettlement.  "
        },
        {
            "text": "The Probation Service is currently recruiting for residential workers in approved premises across several regions. If you are interested in applying, then please visit our vacancy pages here "
        },
        {
            "text": " "
        }
    ]
}