{
    "url": "https://marinedevelopments.blog.gov.uk/2024/01/12/help-shape-assessments-to-ensure-harbour-porpoise-and-marine-birds-are-protected/",
    "title": "Help shape assessments to ensure harbour porpoise and marine birds are protected",
    "authors": [
        "Dan Cutler, Communications & Engagement Manager"
    ],
    "categories": [
        "Evidence",
        "fisheries",
        "marine conservation",
        "Marine Science",
        "Uncategorized"
    ],
    "pub_date": "2024-01-12T10:20:50+00:00",
    "content": [
        {
            "text": "Can you believe it’s a brand-new year already? "
        },
        {
            "text": "Only last month we launched our latest call for evidence on the impacts of fishing on five English offshore marine protected areas (MPAs). These are the ones designated to protect certain highly mobile species. "
        },
        {
            "text": "The deadline for you to help support this work is already fast approaching. Whether you’re a fisher, one of our partners, or a member of a scientific or marine conservation body, we need your input.  "
        },
        {
            "text": "With January well underway, we are encouraging you to participate in our call for evidence before the 13 February closing date.  "
        },
        {
            "text": "MPAs and highly mobile species "
        },
        {
            "text": "England’s MPAs have been established to protect and recover rare, threatened and representative habitats and species from damage caused by human activities. "
        },
        {
            "text": "By managing these areas and protecting their designated features, we aim to ensure healthier marine ecosystems and secure a more sustainable future for coastal communities, the fishing industry and future generations. "
        },
        {
            "text": "Our latest call for evidence is focused on Stage 4 of the MMO’s work to manage fishing in our offshore MPAs. This covers offshore MPAs which have been designated for highly mobile species including harbour porpoise and marine bird species such as red-throated divers, Sandwich terns, common scoter, little gulls, little terns and common terns.   "
        },
        {
            "text": "Where are these MPAs? "
        },
        {
            "text": "There are two MPAs to protect harbour porpoise within our area of responsibility:                                                                                     "
        },
        {
            "text": "..and three MPAs to protect marine birds: "
        },
        {
            "text": "These cover an area of roughly 53,000 km2.  Approximately 42,000 km2 (an area equivalent to the size of Netherlands!) is offshore of 6 nautical miles (nm) where it is the MMOs lead responsibility for the assessment and management of fishing. "
        },
        {
            "text": "You can see the areas covered in the map below.  The Inshore Fisheries and Conservation Authorities (IFCAs) assess and manage the impact of fishing on MPAs inside 6 nm. "
        },
        {
            "text": "What we need from you "
        },
        {
            "text": "The purpose of our call for evidence is to seek feedback and additional evidence from all our stakeholders on the impacts of fishing on highly mobile species in MPAs. It’s vitally important that all those who are most affected by, or with the greatest interest in, share their views and contribute to this work. Specifically, we want you to: "
        },
        {
            "text": "This will ensure that we have the best available evidence to inform our site assessments, which will consider impacts of fishing activity and determine if management measures, such as byelaws, are needed in the future. "
        },
        {
            "text": "How to take part  "
        },
        {
            "text": "Please visit our online call for evidence, and take the time to consider our introduction and impacts evidence documents, before completing our survey. "
        },
        {
            "text": "We are also here to help. If you need any assistance, further information or want to submit a response direct, please contact us."
        },
        {
            "text": "Email: conservation@marinemanagement.org.uk  "
        },
        {
            "text": "Call: 0300 123 1032 "
        }
    ]
}