{
    "url": "https://socialcare.blog.gov.uk/2024/01/12/personal-perspectives-on-the-care-workforce-pathway/",
    "title": "Personal perspectives on the Care Workforce Pathway",
    "authors": [
        "Jennifer Pearl"
    ],
    "categories": [
        "Care and support",
        "Social care reform",
        "Workforce"
    ],
    "pub_date": "2024-01-12T15:24:16+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Great care is built on mutual respect"
        },
        {
            "text": "I very much value the care workers I have, all four of whom are well trained and understand my needs. More than that, they respect me and see me as a whole person. They feel part of my family, supportive in good and bad times. When, for instance, my daughter rang from holiday to say she had got engaged, I cried. My carer was concerned, until I explained they were happy tears."
        },
        {
            "text": "The assistance I receive lives up to the Making it Real statement: ‘I am treated with respect and dignity’. That has not always been the case and I know many people do not have such a positive experience. This was why I was pleased to be involved in the development of the Care Workforce Pathway."
        },
        {
            "text": "I was invited to join the Department of Health and Social Care’s Expert Consultation Group for the Pathway. This was daunting at first, but I was reassured when, at my first meeting in a modern building, the IT crashed!"
        },
        {
            "text": "Being on the group was a good opportunity to share my personal experience of extensively drawing on both social care and health care services and from being an unpaid carer for a relative with dementia. Also, the insight I have from co-chairing Inclusion Barnet, a Deaf and Disabled People’s organisation, and my work as an Expert by Experience for the Care Quality Commission."
        },
        {
            "text": "At TLAP, I was a member of a project group set up to bring together people who draw on care and support to hear their views on the workforce values they expect to see in the people supporting them. The process was co-produced and I enjoyed helping to facilitate the three online workshops."
        },
        {
            "heading": 2,
            "text": "Identifying values and behaviours"
        },
        {
            "text": "A large number of values were generated, but through a considered process we were able to whittle them down to a manageable number, taking the time to identify what people thought were the matching behaviours.  I was struck by how many of the values were universal, in that you can see them applying across the broad, wherever you work, in whatever role. For example, that you are trustworthy and flexible."
        },
        {
            "text": "But it was recognised it is not all plain sailing for care workers. I have to go to bed by 8.00pm because the care organisation providing my service cannot operate any later. This is not uncommon. As it is, the care worker who sees me in the morning at 7.00am very often also helps to me bed, many hours later. Care workers are also often rushed, which makes it difficult to express the value of empathy, if they are visiting one person after another."
        },
        {
            "text": "Care workers need to be recognised and valued more. For me, this means better pay, but also things like having allocated time set aside for training and development. It is important to me the pathway is rooted in values people who draw on care and support see as important. It is also essential to me we invest in the workforce, so everyone gets the person-centred care and support we all want to see."
        }
    ]
}