{
    "url": "https://defrafarming.blog.gov.uk/2024/01/12/slurry-infrastructure-grant-last-chance-to-apply/",
    "title": "Slurry Infrastructure grant: last chance to apply",
    "authors": [
        "Thomas Proudfoot"
    ],
    "categories": [
        "Payments for equipment, technology and infrastructure"
    ],
    "pub_date": "2024-01-12T09:58:54+00:00",
    "content": [
        {
            "text": "Round 2 of the Slurry Infrastructure grant will close for applications on Wednesday 17 January. "
        },
        {
            "text": "We’re supporting many more projects than we did last year so, if you need slurry storage, now is the time to apply."
        },
        {
            "text": "In this post, I’ll give you a recap of the grant and the information you need to get started."
        },
        {
            "heading": 2,
            "text": "The Slurry Infrastructure grant "
        },
        {
            "text": "The Slurry Infrastructure grant is designed to help you improve or expand your slurry storage capacity and improve the use of organic nutrients on your farm.  "
        },
        {
            "text": "You must use the grant to reach the grant storage requirements. These requirements depend on the type of livestock that you mainly farm:"
        },
        {
            "text": "You can use the grant to replace stores that are no longer fit-for-purpose, build additional storage or expand an existing store. "
        },
        {
            "text": "The grant will also contribute towards the costs of impermeable covers and supporting equipment, including slurry separators. "
        },
        {
            "text": "The minimum grant you can apply for is £25,000. The maximum grant is £250,000 for each applicant business. "
        },
        {
            "heading": 2,
            "text": "Applying for a Slurry Infrastructure grant  "
        },
        {
            "heading": 3,
            "text": "Step 1: Read the guidance "
        },
        {
            "text": "The guidance for Round 2 of the Slurry Infrastructure grant can be found on GOV.UK. "
        },
        {
            "text": "It sets out: "
        },
        {
            "text": "Watch a recording of a recent webinar we held to explain the grant. "
        },
        {
            "heading": 3,
            "text": "Step 2: Apply using the online checker"
        },
        {
            "text": "The first part of the application process is an online checker. You’ll find it on the guidance page. "
        },
        {
            "text": "You should use the checker before 23:59 on Wednesday 17 January"
        },
        {
            "text": "It's important to be as accurate as you can about your slurry storage needs and project plans. "
        },
        {
            "text": "The Rural Payments Agency (RPA) and the Environment Agency created guidance to help you  plan your slurry storage. "
        },
        {
            "text": "Use the most up-to-date version of slurry wizard to work out how much slurry storage you need to reach the requirements."
        },
        {
            "text": "Once the online checker closes, the RPA will look at how many projects can be funded. "
        },
        {
            "text": "We have much more funding to go around this year, so we hope to support most projects that apply. "
        },
        {
            "heading": 3,
            "text": "Step 3: Slurry store location and design check "
        },
        {
            "text": "If you are invited to make a full application, we will ask you for information about the location and design of your store. The Environment Agency will check this to see if your project will get you to the scheme storage requirements and comply with regulations.  "
        },
        {
            "text": "We know this process can take time to get right, but it helps you ensure your project is fit-for-purpose. "
        },
        {
            "text": "Once we’ve confirmed you’ve passed store location and design checks, the RPA will ask for some final details to complete your full application. "
        },
        {
            "text": "Don’t start building your project or paying for items before you’ve signed your grant agreement. You can certainly get quotes and apply for planning permission, but you cannot place orders or incur any eligible costs, including paying deposits or start construction work. "
        },
        {
            "heading": 2,
            "text": "Coming up "
        },
        {
            "text": "I'll share how many projects we shortlist and the next steps once applications close. Subscribe to the blog for updates. "
        }
    ]
}