{
    "url": "https://phescreening.blog.gov.uk/2021/07/20/excellent-new-video-underlines-importance-of-attending-nhs-diabetic-eye-screening/",
    "title": "Excellent new video underlines importance of attending NHS diabetic eye screening",
    "authors": [
        "Maria Farman"
    ],
    "categories": [
        "NHS Diabetic Eye Screening Programme"
    ],
    "pub_date": "2021-07-20T15:59:08+01:00",
    "content": [
        {
            "text": "The excellent short film above has been made to emphasise the importance of attending regular NHS diabetic eye screening (DES) for people living with Type 1 and Type 2 diabetes."
        },
        {
            "text": "In this blog article, Maria Farman, Essex Screening and Immunisation Coordinator, explains how and why the film was developed."
        },
        {
            "text": "Four years ago, the Essex DES service conducted a health equity audit (HEA) that identified inequalities in both screening uptake and exclusions. These inequalities were experienced between different areas, for people with a learning disability, younger people, women and some ethnic groups."
        },
        {
            "text": "We decided that making a video focused on diabetic eye screening would be a good way to address some of the inequalities and would align with our Essex screening and immunisation strategy to reduce inequalities."
        },
        {
            "text": "Essex DES engagement manager Lorraine Lockwood and I worked with a film company to develop the concept for the film, which features Essex landmarks alongside accounts of real patient experiences and a virtual walkthrough of diabetic eye screening."
        },
        {
            "text": "The video, funded by NHS England and Improvement, includes information about making reasonable adjustments to ensure services are accessible to all. It covers a range of inequality issues and patient experiences from different ages and ethnicities against a backdrop of a variety of Essex locations to capture different audience interests."
        },
        {
            "text": "We are showing the film in areas of low uptake and on a variety of social media platforms to try to reach underserved groups, including a short Facebook campaign. We have shared it with clinical commissioning groups, acute trusts, Diabetes UK, GP practices and local authorities in Essex, universities, colleges, community groups and some large employers."
        },
        {
            "text": "Discussions are now under way to produce a national edit of the video, suitable for sharing and viewing throughout the country."
        },
        {
            "heading": 2,
            "text": "PHE Screening blog"
        },
        {
            "text": "The PHE Screening blog provides up to date news from all NHS screening programmes. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new blogs. If you have any questions about this blog article, or about population screening in England, please contact the PHE screening helpdesk."
        }
    ]
}