{
    "url": "https://environmentagency.blog.gov.uk/2021/07/20/managing-flood-risk-in-the-face-of-a-changing-climate/",
    "title": "Managing flood risk in the face of a changing climate",
    "authors": [
        "aimeecarguillo"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2021-07-20T10:33:07+00:00",
    "content": [
        {
            "text": "Climate change is happening now"
        },
        {
            "text": "Julie Foley, Director of Flood Risk Strategy & National Adaptation, Environment Agency"
        },
        {
            "text": "The kinds of extreme climatic events experienced in Germany and the Low Countries this July, leading to devastating flooding, is sadly likely to become a more familiar sight over the next century. In England, February 2020 was our wettest ever and the fifth wettest winter on record, and internationally, the record breaking heat waves and wild fires experienced in North America could become a more regular occurrence."
        },
        {
            "text": "Even with ambitious global and national actions to reduce greenhouse gas emissions, some further climate change is now inevitable. Climate scientists predict that sea level in the UK could rise by over a metre by the end of the century. It is therefore essential we get ready for the unavoidable impacts of climate change. The Climate Change Committee has advised that “net zero is not enough” and that “the gap between the level of climate risk we face and the level of adaptation underway has widened”."
        },
        {
            "text": "Recent pledges from national governments to reduce greenhouse gas emissions are closing the gap but are not yet ambitious enough. Consequently, the Climate Change Committee’s recent Adaptation Report to Parliament warned we may reach 3ºC above pre-industrial levels by 2100, with warming of around 4ºC above pre-industrial levels by 2100 still possible."
        },
        {
            "text": "To keep pace with a changing climate, we need to both cut emissions and adapt to climate risks."
        },
        {
            "text": "This is exactly why our national Flood and Coastal Erosion Risk Management Strategy puts creating climate resilient places at the heart of what we do and how we work with partners. The Strategy seeks to better prepare us for 2°C warming in global temperatures as well as planning for higher scenarios, such as a 4°C rise in global temperatures."
        },
        {
            "text": "What we are doing to prepare"
        },
        {
            "text": "We’re delivering our climate ambition through our Strategy Action Plan"
        },
        {
            "text": "published in May this year. One of our first actions is to update our guidance on climate allowances for flood and coastal projects, strategies and planning advice, using the latest UK Climate Change Projections."
        },
        {
            "text": "Our new guidance will ensure flood and coastal projects in England featured in our £5.2 billion investment programme are designed and assessed against a range of future impacts, including flood risks from a 4°C rise in global temperatures. In July 2020 we updated our climate change allowances for sea level rise and we have now updated our allowances for peak river flows. We now have much more detail than ever before on how river flows will change at a catchment level, allowing us to address future flood and coastal risks more confidently."
        },
        {
            "text": "The Environment Agency has championed this approach through our trailblazing Thames Estuary 2100 Plan. The Plan sets a long-term approach to managing this risk protecting over 1.4 million people and £320 billion worth of property in London and the wider estuary. It is internationally recognised as a leading example of a climate adaptation strategy, which enables practitioners and policy makers to plan, monitor and review how to adapt to flood risk to the end of the century and beyond."
        },
        {
            "text": "It sets out a range of pathways for managing differing amounts of sea-level rise, river flows and increasing risk of storm surges whilst also improving the riverside environment."
        },
        {
            "text": "We will also be using our new guidance to provide robust flood risk advice to developers and planners on how to use the climate change allowances to guide the location and design of new development. It is vital that all new development is safe throughout its lifetime and built to be flood resilient in a changing climate. We also need to maximise opportunities for working with partners to create better places for people and wildlife. This includes opportunities for greater use of sustainable drainage systems and natural flood management that can help to slow the flow or store floodwaters during heavy rainfall, which also have wider sustainability and carbon reduction benefits."
        },
        {
            "text": "The future"
        },
        {
            "text": "Our commitment to use the latest climate science in our advice and decision making is part of our wider commitment for a climate resilient, net zero carbon nation. Our new climate change allowances will help us achieve our net zero carbon goals and ensure people and places remain resilient and able to adapt and thrive in a changing climate."
        },
        {
            "text": "With the Conference of the Parties (COP26) on the horizon, we have a fantastic opportunity to elevate adaptation on the international stage and stress the importance of acting now in the face of a changing climate."
        },
        {
            "text": "Further information"
        },
        {
            "text": "For information, please refer to our climate change allowances guidance for FCERM projects, schemes and strategies, or Flood Risk Assessments, as well as our climate change allowances for peak river flows in England map."
        },
        {
            "text": "Julie Foley, Director of Flood Risk Strategy & National Adaptation, Environment Agency"
        },
        {
            "text": " "
        }
    ]
}