{
    "url": "https://civilservice.blog.gov.uk/2021/07/20/meet-the-top-team/",
    "title": "Meet the Top Team",
    "authors": [
        "Gosia McBride"
    ],
    "categories": [
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Ambitious Civil Service",
        "An Innovative Civil Service",
        "Uncategorized"
    ],
    "pub_date": "2021-07-20T09:29:43+00:00",
    "content": [
        {
            "heading": 4,
            "text": "Every Prime Minister has an indispensable backroom team. Gosia McBride on what it's like working in the Economic and Domestic Affairs Secretariat on the PM’s top priorities and seeing your work make headlines?"
        },
        {
            "heading": 3,
            "text": "First In Family To Go To University "
        },
        {
            "text": "Mandeep Samra, joined the Civil Service in 2012 and leads on strategic planning."
        },
        {
            "text": "I was the first in my family to go to university. I’d never left the Midlands so uni came as a shock. Thanks to community support, I did well, winning a post grad scholarship. "
        },
        {
            "text": "My career has taken me from private sector consulting, social research and policy at the Ministry of Justice, to delivery at FCDO. I’ve found myself drawn to the Cabinet Office twice. I volunteered to support the COVID-19 response, and now lead on strategic planning to pre-empt risks and harness opportunities across recovery, COVID, transition and winter planning. "
        },
        {
            "text": "Working in the Economic and Domestic Secretariat is humbling - you’re no longer the policy expert, your role is brokering and convening, getting the best from colleagues across government."
        },
        {
            "text": "It was incredible to observe the late Sir Jeremy Heywood welcoming evidence, knowledge and challenge from across sectors. He influenced my own approach. "
        },
        {
            "text": "This time in the Cabinet Office, I have two young children; it was inspiring seeing my director briefing while plaiting her daughter’s hair. It’s great that we’re having conversations about cultural capital and how intersectionality can compound disproportionate impacts, especially in a pandemic. Team support, sponsorship, mentoring and the Future Leadership Scheme have all been invaluable."
        },
        {
            "heading": 3,
            "text": "Cabinet Secretary's Former Apprentice"
        },
        {
            "text": "Chantelle Lyon, Corporate Support, on how a Civil Service apprenticeship transformed both her confidence and career."
        },
        {
            "text": "At sixth form, I felt a bit lost thinking about the future. But then I saw the Civil Service Apprenticeship Scheme and thought, why not? The chance to learn on the job hooked me in. "
        },
        {
            "text": "The assessments were the most challenging morning of my life, but I succeeded and joined the business administration scheme aged 18. "
        },
        {
            "text": "Being Simon Case’s diary manager was a great first job - you could tell he was going places - except when I sent him to the wrong building to meet the Chief Executive of NHS England! Staying calm under pressure is definitely the main thing I learnt from Simon (below)."
        },
        {
            "text": "I was given the opportunity to develop and shape my role all while studying for my HNC and NVQ level 4. From there I was promoted to Office Manager and then onto business planning for the Department for Health and Social Care. "
        },
        {
            "text": "I now work directly with EDS Directors, supporting them with sudden PM meetings, recruitment and any unit-wide activity. There’s no typical day which is why I love it. I am proudest of setting up our corporate workstreams. Staff across EDS have pulled together to address our people survey, including our new wellbeing charter. It’s such a friendly place despite being so busy. "
        },
        {
            "text": "My apprenticeship built my confidence - I can’t recognise myself as the shy, quiet person who joined the Cabinet Office seven years ago.  "
        },
        {
            "heading": 3,
            "text": "The Fast Streamer"
        },
        {
            "text": "Will Davidson, Policy Officer, Trade was still in his teens when he lost his hearing, but has overcome adversity and is thriving in the Fast Stream."
        },
        {
            "text": "I am a second year Fast Streamer.  My first roles were at the Home Office in Strategy, then Private Office. I joined the fast stream after working for deafplus and BT. I saw it as an opportunity to work on policy that impacts people across the UK. Joining EDS has been a fantastic experience. "
        },
        {
            "text": "Talented colleagues"
        },
        {
            "text": "I’ve had the opportunity to work with talented colleagues across government as we look to strengthen our trading relationships outside of the EU. I’ve been lucky to work on policy such as the UK’s data bridge, ensuring data could be shared freely after we left the EU, or the PM’s announcement of an enhanced trade partnership with India. "
        },
        {
            "text": "I became deaf in my first year at university. I use an interpreter when in the office and captioning technology in virtual meetings. Since lockdown I’ve missed bouncing ideas off people in person. But my team and wider Cabinet office have ensured I have what I need to work effectively from home.  It’s great we’re considering inclusive hybrid working, and how to make sure decision-making doesn’t lean towards those in the office. "
        }
    ]
}