{
    "url": "https://rpc.blog.gov.uk/2021/07/20/scope-of-the-better-regulation-framework/",
    "title": "The scope of the Better Regulation Framework",
    "authors": [
        "Stephen Gibson"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2021-07-20T16:56:07+01:00",
    "content": [
        {
            "text": "An important purpose of the Better Regulation Framework is to provide transparency and accountability over the burdens that government regulatory decisions place on business and civil society organisations. It also supports good decision making by helping ministers and Parliament to balance the benefits arising from new regulation against the costs that it imposes when considering new legislation or when considering different regulatory options for achieving a particular objective."
        },
        {
            "text": "The government are currently required by law to measure the direct impacts of new regulation on business (and civil society organisations) and to report annually on progress against the ‘business impact target’ (BIT) – a commitment to reduce the burden of regulation during the life of the Parliament. These figures are verified by the Regulatory Policy Committee (RPC)."
        },
        {
            "text": "The government have exempted some categories of regulation, so they are not captured in the BIT accounts and some of these are not subject to our independent scrutiny. Some of these exemptions have reasonable justifications."
        },
        {
            "text": "For example, it is often not proportionate to apply the process to very small ‘de minimis’ measures (those with an impact of less than £5 million a year) and this exemption also significantly reduces the number of measures required to be submitted for RPC scrutiny and therefore the resources required to produce and review the impact assessments (IAs)."
        },
        {
            "text": "However, we are concerned that other exemptions are likely to mean that the framework misses some very significant business costs – to the extent that the BIT is not a meaningful indicator of the overall burdens on business of new regulation."
        },
        {
            "heading": 2,
            "text": "What should be exempt?"
        },
        {
            "text": "Some exemptions have been in place since before the establishment of the BIT. For example, it excludes tax measures – the fundamental purpose of which is to impose financial burdens on people and businesses to raise revenue for the Exchequer. But other specific exemptions warrant further consideration."
        },
        {
            "heading": 3,
            "text": "Building safety measures related to the Grenfell disaster"
        },
        {
            "text": "This exemption means that the costs and benefits of regulatory measures related to Grenfell are not subject to independent scrutiny and the associated business costs are not included in the BIT. While we understand that the government may not want to target the cost of Grenfell-related measures, it would be desirable for the analysis underpinning them to be subject to independent scrutiny and impacts on business verified (as happens for other large ‘non- qualifying’ measures)."
        },
        {
            "heading": 3,
            "text": "Temporary measures (those in force for less than 12 months)"
        },
        {
            "text": "It's reasonable that measures which are introduced for only a short period and are therefore likely to have relatively limited impacts are excluded from the BIT. However, the use of this exclusion for emergency measures associated with the coronavirus (COVID-19) pandemic means that the impact of some of the most severe and restrictive measures introduced by a peace-time government (including stopping businesses from operating for extended periods) have not been quantified or reviewed."
        },
        {
            "heading": 3,
            "text": "Civil emergency exclusion applying to COVID-19 measures that are in force for more than 12 months"
        },
        {
            "text": "When the emergency COVID-19 measures were first introduced, it was reasonably expected that they would be in force for less than 12 months and therefore subject to the ‘temporary’ exclusion described above. However, a significant number have now been extended to be in force for more than a year."
        },
        {
            "text": "The rules of the Better Regulation Framework mean that IAs for these measures should have been (retrospectively) submitted to the RPC for scrutiny. The government have however decided to relax this requirement. We understand that this reduces the burden on civil service resources but, again, this means that measures that have very significant impacts on businesses and civil society organisations are not subject to independent scrutiny, as well as being excluded from the BIT."
        },
        {
            "heading": 2,
            "text": "Why is this important?"
        },
        {
            "text": "The BIT was introduced as a tool for the government to communicate transparently to business and others their commitment to minimise the burden of regulation – and for holding the government to account for that commitment. Using exemptions, particularly for measures that have very significant impacts on business, means that this important objective is not being achieved."
        },
        {
            "text": "The Better Regulation Framework also requires departments to produce IAs for new regulation (which are then assessed and rated by the RPC). This allows ministers and Parliament to compare different policy options and choose the one that best meets their objectives. Some of the exemptions mean that departments are not subject to the valuable discipline of submitting IAs for independent scrutiny."
        },
        {
            "heading": 2,
            "text": "Why are we raising this now?"
        },
        {
            "text": "The government are currently considering how they want the better regulation system to operate going forward and are planning to reconsider the approach used to track regulatory impacts on business. If a new approach is to work as intended and continue to help to minimise the burden introduced by new regulation, it will be important to ensure that any exemptions from the framework are reasonable and kept to a minimum."
        },
        {
            "text": "Stay up-to-date by signing up for email alerts from this blog."
        }
    ]
}