{
    "url": "https://ruralpayments.blog.gov.uk/2023/10/06/celebrating-25-years-of-the-british-cattle-movement-service/",
    "title": "Celebrating 25 years of the British Cattle Movement Service",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "BCMS"
    ],
    "pub_date": "2023-10-06T11:55:43+01:00",
    "content": [
        {
            "text": "It’s 25 years since the formation of the British Cattle Movement Service (BCMS), which is responsible for maintaining the central online database of all bovine animals in Great Britain. This is the Cattle Tracing System, which animal keepers use to report the births, deaths and movements of their bovine animals. BCMS is part of RPA and is based in Workington in Cumbria."
        },
        {
            "text": "The Cattle Tracing System was introduced in 1998 – against the backdrop of the BSE epidemic and later became part of RPA. By law, all bovines must be registered with BCMS to allow the government to identify and locate livestock in the event of a disease outbreak or food safety incident."
        },
        {
            "text": "The tracing system helps to control and eradicate bovine diseases such as Tuberculosis (TB), Bovine Viral Diarrhoea (BVD) or foot and mouth disease. It also protects the public by making sure that products in the human food chain are safe. By registering their cattle with BCMS, farmers and keepers play an important role in protecting the national herd from insidious diseases."
        },
        {
            "text": "Every bovine animal in the UK has a unique number, shown both on an ear tag in each ear and on a paper cattle passport held by the keeper of the animal. As well as cattle, the tracing system also covers bovine animals such as water buffalo, yak, bison and hybrids. The unique number and passport remain with the animal throughout its life, and are recorded by the slaughterhouse at its death, allowing traceability of the beef. The tracing system works alongside the physical passport to record the births, deaths and movements of all cattle."
        },
        {
            "text": "The services provided at BCMS make it possible to check which animals are present on a keeper’s holding, where an animal has been during its life, trace animals exposed to a disease risk and provide assurances to buyers about an animal’s life history. This all plays a key role in livestock traceability, disease control and maintaining consumer confidence in beef and its origin."
        },
        {
            "text": "Recently, the Livestock Information Service (LIS) sheep bureau moved into RPA. Working with Livestock Information Ltd we will now manage the movement traceability for sheep, goats, and deer for England, alongside our existing cattle services.  This is an exciting time as we now start the journey to become one flexible team delivering traceability services in England for multiple livestock species."
        },
        {
            "text": "Having the movement data recorded digitally will bring with it a reduction in administrative time and improve efficiencies across the supply chain for recording data. There will also be the ability for farmers to access and utilise the data for their own business purposes. Essential to ensure a successful transition to the new multi-species traceability service will be continuing to work alongside livestock customers and understanding their needs."
        },
        {
            "text": "Look out for more blogs coming soon about BCMS, including the next one with Terry Gadd, who has overall responsibility for the operation of BCMS, talking about the team and the services they provide."
        },
        {
            "text": " "
        }
    ]
}