{
    "url": "https://naturalengland.blog.gov.uk/2023/10/06/geodiversity-is-for-everyone-international-geodiversity-day-2023/",
    "title": "Geodiversity is for everyone – International Geodiversity Day 2023",
    "authors": [
        "Jonathan Larwood"
    ],
    "categories": [
        "Geology",
        "Natural England"
    ],
    "pub_date": "2023-10-06T08:27:20+01:00",
    "content": [
        {
            "text": "Jonathan Larwood, Natural England Principal Geodiversity Adviser, celebrates the second ever International Geodiversity Day and its theme of ‘Geodiversity is for everyone’."
        },
        {
            "text": "International Geodiversity Day is an annual global celebration, supported by UNESCO, of all aspects of geodiversity.  This year’s theme is ‘Geodiversity is for everyone’ reflecting that geodiversity is all around us, influencing the lives of people, wherever they are."
        },
        {
            "text": "Earlier this year, the BBC Wild Isles series was a spectacular demonstration of how geodiversity is ‘all around us’, intimately entwined with our biodiversity. At the very start of the series David Attenborough reflected: “One reason why our natural world is so rich comes from its geology, amongst the most varied to be found anywhere on the planet…”.   For its size, Britain is the most geodiverse area in the world, and is firmly placed on the global stage (see my previous blog post on International Geodiversity Day)."
        },
        {
            "text": "Standing on Old Harry Rocks on the Dorset Coast (at the eastern end of the Jurassic Coast World Heritage Site) David Attenborough goes on to say “…from the chalk cliff and downs of Southern England to the limestone pavements of Yorkshire, from the ragged whinstone cliffs of Durham to the volcanic basalt of the Giant’s Causeway in Northern Ireland, each kind of rock creates its own landscape with its own community of animals and plants”."
        },
        {
            "text": "This intimate relationship between geodiversity, biodiversity and landscape was a recurring them throughout the Wild Isles series:  from salt marshes and dunes to rugged rocky coasts and uplands, to chalk streams and limestone grasslands all providing habitats for our unique flora and fauna."
        },
        {
            "text": "This diversity of geology and landscape is beautifully represented by William Smith’s 1815 geological map.  Smith also noted the relationship between animal, plant and rock musing “how the chain of natural things are linked together”."
        },
        {
            "text": "In the recently published Environment Improvement Plan 2023  the importance of England’s geodiversity is recognised for its “considerable scientific, educational and heritage value”, and the EIP commits to “continue to provide opportunities for people to experience geoheritage through our network of National Nature Reserves.” This resonates strongly with this year’s International Geodiversity Day theme “Geodiversity is for everyone”."
        },
        {
            "text": "So, what is happening to geodiversity on National Nature Reserves?"
        },
        {
            "text": "Last month Natural England declared the Lincolnshire Coronation Coast National Nature Reserve, the first in the new King’s Series of National Nature Reserves.  As part of the King’s Series - five major National Nature Reserve declarations every year for the next five years – it is our ambition to include some NNRs which develop and tell England’s geological story, each NNR contributing pages and chapters to the greatest story we have to tell."
        },
        {
            "text": "Already, the Lincolnshire Coronation Coast is a National Nature Reserve where visitors can see geodiversity in action.  Its network of mudflats, saltmarsh, sand dunes and lagoons, and the habitats and species they support, are shaped by the natural coastal processes of geodiversity, a dynamic and evolving coastline of erosion and deposition."
        },
        {
            "text": "If you can’t wait for this story to unfold, here are a couple of suggestions: –"
        },
        {
            "text": "Wren’s Nest National Nature Reserve in Dudley, in the West Midlands, tells a story of Silurian tropical seas 425 million years ago, rich in reef fossils and today forming a prominent quarried and mined limestone hill in the middle of Dudley."
        },
        {
            "text": "The Undercliffs National Nature Reserve near Lyme Regis in Dorset. This spectacular site, made famous by the fossil collector Mary Anning, is a place to discover the animals that once swam in Jurassic seas, a world of ammonites and ichthyosaurs."
        },
        {
            "text": "To return to David Attenborough.  Sir David has often recounted how childhood fossil discoveries sparked a lifetime’s interest in the natural world. National Nature Reserves already play an important part in bringing ‘geodiversity to everyone’, but our ambition is to do even more with our NNR series to inspire an interest in geodiversity and connect people with nature, wherever they are."
        }
    ]
}