{
    "url": "https://deframedia.blog.gov.uk/2023/10/06/guardian-article-on-road-runoff/",
    "title": "Guardian article on road runoff",
    "authors": [
        "defrablogs"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2023-10-06T17:44:40+01:00",
    "content": [
        {
            "text": "An article published in the Guardian today covering road pollution has said there is no monitoring by regulators of thousands of outfalls and soakaways on the country’s road network, and that the scale of the impact for the wildlife the public is not known."
        },
        {
            "text": "Highways drainage and urban diffuse pollution is a serious issue causing 18 percent of failures for water bodies in England under the Water Framework Directive. They are not directly regulated by the Environment Agency but they do work with the government and partner organisations to reduce pollution from roads. Responsibility for these outfalls rests with National Highways and local authorities."
        },
        {
            "text": "However, the suggestion of permitting tens of thousands of outfalls is flawed as it would provide little in the way of additional pollution control and would be impractical to fit water treatment to every outfall. In addition, highways owners like National Highways and Local Authorities have no control over what comes off the roads from vehicles themselves."
        },
        {
            "text": "As such, permitting every outfall would not lead to effective controls, would be extremely costly and would waste precious resources on administration, which are otherwise being used to make a positive impact on the environment. Instead, the Environment Agency takes a collaborative approach and works with National Highways on the delivery of the current and future Road Investment Strategy’s to minimise environmental impact, including putting in treatment at higher risk outfalls."
        },
        {
            "text": "An Environment Agency spokesperson said:"
        },
        {
            "text": "“While highway outfalls are not directly regulated by the Environment Agency, we continue to work with the government and partner organisations to reduce pollution from our roads."
        },
        {
            "text": "“This includes working closely with National Highways to influence their Road Investment Strategy to include pollution mitigating schemes on their priority list of outfalls and on joint incident response strategies to minimise the risk of pollution arising from road traffic accidents.”"
        }
    ]
}