{
    "url": "https://cddo.blog.gov.uk/2023/10/06/transforming-for-a-digital-future-one-year-update-part-2/",
    "title": "Transforming for a Digital Future - one year update (part 2)",
    "authors": [
        "Sam Lawler, Deputy Director Strategy, Analysis and Reform, CDDO"
    ],
    "categories": [
        "CDDO",
        "Cross-government strategy",
        "DDaT community",
        "Digital strategy",
        "Digital transformation"
    ],
    "pub_date": "2023-10-06T14:23:43+01:00",
    "content": [
        {
            "text": "In June 2022 we launched Transforming for a digital future, government's 2022 to 2025 roadmap for digital and data: an ambitious plan for digital transformation in government. Digital and business leaders came together to agree six missions centred around concrete commitments that all departments are committed to delivering. "
        },
        {
            "text": "The plan we set out is guiding progress across government, as highlighted in my previous blog. We’re committed to delivering against it and finishing what we started. "
        },
        {
            "text": "It’s also essential we look forwards and outwards, making sure we’re keeping pace with emerging trends, challenges and opportunities. That’s why leaders have come together again to make some updates to the missions in the roadmap going into year two. "
        },
        {
            "heading": 3,
            "text": "We’re investing in digital capability and early career digital talent"
        },
        {
            "text": "Over the last year, we’ve heard from teams calling out for more digital capacity and capability. It’s vital we build strong digital skills at scale so the Civil Service is fit for a digital future, particularly with tech talent in such high demand. "
        },
        {
            "text": "That’s why we’re adding two new commitments to Mission Five: Digital skills at scale:"
        },
        {
            "text": "This builds on some exciting initiatives we’re already seeing to grow capability. The Department for the Environment, Food and Rural Affairs (Defra), for example, has enhanced its digital and technical apprenticeships offering through the Digital, Data and Technology Services (DDTS) Academy, with special focus on growing their own talent in hard to recruit roles."
        },
        {
            "heading": 3,
            "text": "We’re recognising the potential of AI to transform government"
        },
        {
            "text": "Nobody can have missed the rapid advances in generative artificial intelligence (AI) this year. New forms of AI make it possible to use technology to do work in ways we couldn’t previously imagine: the potential to change how we do business, how services are delivered and the way we work is truly enormous."
        },
        {
            "text": "Already, we’re seeing teams across government exploring the potential. For example, finalists in the Civil Service Data Challenge showed how AI can be used in HMRC to improve handling and routing on 15 million items of correspondence every year. "
        },
        {
            "text": "At the same time, we’re conscious that new forms of AI carry new risks, and that we need to deploy them responsibly. That’s why, as well as publishing guidance, we’ve modified our commitment in Mission Four, to identify and capture opportunities from emerging technology, to focus on enabling teams to make confident and responsible use of AI."
        },
        {
            "heading": 3,
            "text": "We’re honing how we address systemic barriers to digital transformation"
        },
        {
            "text": "To create enduring change, we need to transform the structures and processes that underpin how government operates. We know, from exciting initiatives across government, this kind of change is possible. For example, the Home Office is moving to Product Lifecycle Management, working collaboratively across policy, operations and digital to deliver continuous improvements to products and services. Two programmes have transitioned to this approach so far, focusing on delivering outcomes rather than outputs and proving they’re able to respond quickly to changes. "
        },
        {
            "text": "We want to make this the norm. When we published the roadmap, CDDO committed to work with other functions to address barriers to digital transformation. After a year of learning what works, we’ve sharpened the commitment in Mission Six: A system that unlocks digital transformation, to focus on a new pilot approach so we can be more specific about which barriers we are addressing and, in agile style, test our approach before wider roll-out."
        },
        {
            "heading": 3,
            "text": "We’re learning and iterating to drive transformation in year two "
        },
        {
            "text": "We’re committed to continuously reviewing progress, gathering feedback and using data to guide us, in line with the National Audit Office’s report, ‘Digital transformation in government: addressing the barriers to efficiency’, published in March, which stressed that we need to be prepared to adapt if we’re to continue making good progress."
        },
        {
            "text": "In addition to the changes highlighted in this blog, we’ve made small adjustments to some other commitments in the roadmap. With these changes, I’m confident we’re keeping the roadmap focused on meeting government’s biggest challenges."
        },
        {
            "text": "Now, we’re looking forward to achieving key milestones for year two, like getting more services to ‘great’ and onboarding them to One Login, delivering a beta version of the Data Marketplace, "
        },
        {
            "text": "We’ll also be focusing on creating a framework for government’s use of AI, piloting new multi-disciplinary ways of working and upskilling senior leaders in digital and data essentials."
        }
    ]
}