{
    "url": "https://nationalscreening.blog.gov.uk/2025/11/14/consultation-opens-on-population-screening-for-cytomegalovirus/",
    "title": "Consultation opens on population screening for cytomegalovirus ",
    "authors": [
        "Cristina Visintin"
    ],
    "categories": [
        "UK National Screening Committee"
    ],
    "pub_date": "2025-11-14T08:40:33+00:00",
    "content": [
        {
            "text": "The UK National Screening Committee (UK NSC) has opened a consultation on evidence relating to population screening for cytomegalovirus (CMV)."
        },
        {
            "text": "The UK NSC does not currently recommend screening for CMV."
        },
        {
            "text": "We are asking individuals and organisations to provide feedback on the findings and conclusions of 2 new 2025 evidence reports – a systematic review of newborn screening for congenital CMV (cCMV) and an evidence map looking at the volume and type of evidence related to antenatal screening for CMV. Evidence maps are typically the first step in the UK NSC evidence review process. "
        },
        {
            "text": "The committee had previously reviewed the evidence on newborn screening in 2017 and undertaken an evidence map exercise in 2021. The 2025 evidence reports re-evaluate the evidence on screening for CMV in both the antenatal and newborn periods."
        },
        {
            "text": "The evidence map concludes that a full evidence review of antenatal screening for CMV is now justified."
        },
        {
            "text": "The evidence review concludes that there needs to be more research to compare screening with standard care to establish if the benefits of newborn screening would outweigh the harms."
        },
        {
            "heading": 2,
            "text": "How to respond"
        },
        {
            "text": "To take part in the consultation, click on the grey ‘View documents’ button on the UK NSC’s Cytomegalovirus recommendation page. Then submit your response by clicking on the green ‘Submit comments’ button."
        },
        {
            "text": "The deadline for responses is 11.59pm on 6 February 2026."
        },
        {
            "text": "The consultation responses and final evidence report on newborn screening will be presented to the UK NSC and inform the committee’s decision on whether or not to change its recommendation on screening for CMV in the newborn."
        },
        {
            "text": "The UK NSC will reconsider its recommendation regarding antenatal screening following the completion of the suggested full evidence review and subsequent consultation."
        },
        {
            "heading": 2,
            "text": "About cytomegalovirus "
        },
        {
            "text": "CMV is a common virus which usually causes mild flu-like symptoms. It can be more serious if it is passed on to a baby before they are born when it is known as congenital CMV (cCMV). This can happen if a woman catches CMV, or if she had CMV before and it becomes active again when she is pregnant."
        },
        {
            "text": "Around 1 in 200 babies are thought to be born with CMV and a fifth of these may have long-term disability associated with the infection. This can include hearing loss and delays in how a child develops and learns."
        },
        {
            "text": "Overall, each year around 200 babies born in the UK with cCMV will experience long-term problems. "
        },
        {
            "heading": 2,
            "text": "2025 systematic review of newborn screening "
        },
        {
            "text": "This review found evidence that saliva and dried blood spot tests were highly effective at detecting cCMV cases, suggesting they could be suitable for use in newborn screening."
        },
        {
            "text": "However, there was limited evidence about how well tests could predict which babies would benefit from treatment. Universal screening could therefore lead to:"
        },
        {
            "text": "The review concluded that there needs to be more research to compare screening with standard care to establish if the benefits would outweigh the harms."
        },
        {
            "heading": 2,
            "text": "2025 evidence map of antenatal screening "
        },
        {
            "text": "The evidence map found that blood tests in the first 3 months of pregnancy can accurately detect when a mother first catches CMV and if it is passed on to her baby. There are also treatments that can reduce the chance of passing the infection from mother to baby, although studies are limited."
        },
        {
            "text": "There is good evidence that ultrasound scans of the baby, possibly combined with MRI scans, can detect problems that might cause long-term harm. There is also some evidence that if the fluid around the baby is infected by CMV, measuring the amount of virus in the fluid could help predict whether the baby will have long-term problems."
        },
        {
            "text": "The evidence map team concluded there is enough published literature, including primary research and systematic reviews, to justify commissioning a full evidence review of antenatal screening for CMV."
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK NSC. You can register to receive updates direct to your inbox, so there is no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, please email uknsc@dhsc.gov.uk."
        }
    ]
}