{
    "url": "https://mhclgmedia.blog.gov.uk/2025/11/14/coverage-of-the-renters-rights-act-implementation-roadmap/",
    "title": "Coverage of the Renters' Rights Act implementation roadmap",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Renters' Rights Act"
    ],
    "pub_date": "2025-11-14T10:16:16+00:00",
    "content": [
        {
            "text": "Following the Renters’ Rights Act which recently passed in law, the timeline for implementing these new legal protections has been published today, giving time for landlords and letting agents to deliver these changes for their tenants."
        },
        {
            "text": "The roadmap sets out that as of the 1 May, reforms such as banning Section 21 ‘no-fault’ eviction notices, appealing excessive above-market rent increases and making it unreasonable for landlords to refuse tenants’ requests to have a pet will be implemented."
        },
        {
            "text": "Working proactively with the BBC’s Tarah Welsh,  a package leading on the ban on no-fault evictions can be seen online and across BBC Breakfast, Radio 4’s Today Programme, BBC 5Live and regional BBC radio stations on their bulletins as well as LBC, Sky News, Absolute Radio and Times Radio. "
        },
        {
            "text": "Elsewhere, there is significant national coverage in The Times focussing on the implementation being a crackdown on ‘rogue landlords’, whilst also featuring an op-ed from the Secretary of State which promotes the benefits of the reforms to both landlords and tenants."
        },
        {
            "text": "Positive coverage can also be seen in The Mirror who run an exclusive quote from the Minister for Homelessness Alison McGovern, focusing on the no-fault evictions and the discrimination ban which is being introduced through the Act."
        },
        {
            "text": "The Big Issue also carries an exclusive article written by Prime Minister, pledging to end unsafe housing and give renters more rights, noting key measures in the Renters’ Rights Act, including enabling tenants to appeal excessive rent increases and removing landlords' ability to unreasonably refuse pets."
        },
        {
            "text": "Further reports and explainer stories also feature in LBC, Metro, the Independent, Mail Online This is Money section, City AM, Politico London Playbook, the Express and the Sun who also featured a factsheet on the reforms."
        },
        {
            "text": "Regional, trade and specialist coverage also feature the announcement including in the Standard, Negotiator, Property Industry Eye, Letting Agent Today, Mortgage Strategy, Property 118, Labour List, Slough and South Bucks Observer, Welwyn Hatfield Times, Eastern Daily Press, Great Yarmouth Mercury, Weston Mercury, Norwich Evening News, the Press, Whitchurch Herald, and This is Oxfordshire."
        },
        {
            "text": "Housing Secretary Steve Reed said:"
        },
        {
            "text": "“We’re calling time on no fault evictions and rogue landlords. Everyone should have peace of mind and the security of a roof over their head - the law we’ve just passed delivers that."
        },
        {
            "text": "“We’re now on a countdown of just months to that law coming in – so good landlords can get ready and bad landlords should clean up their act.”"
        },
        {
            "text": "Chief Executive of Generation Rent, Ben Twomey said:"
        },
        {
            "text": "“This new law is a vital step towards re-balancing power between renters and landlords and should be celebrated."
        },
        {
            "text": "“Our homes are the foundation of our lives, but for too long our broken renting system has left renters staring down the barrel of poverty and homelessness. For decades, Section 21 evictions have forced renters to live in fear of being turfed out of our homes, preventing us from raising valid concerns with our landlords. At last we know when this outdated and unfair law will be sent packing."
        },
        {
            "text": "“This Renters’ Rights Act is the result of years of tireless campaigning from the renter movement, alongside the dedication and strength of ordinary renters. With change on the horizon, I hope that renters across England can rest a little easier tonight in recognition of what we have achieved together.”"
        },
        {
            "text": "Director of the Renters’ Reform Coalition, which includes Shelter, Generation Rent, Citizens Advice and ACORN, Tom Darling said:"
        },
        {
            "text": "“Today’s announcement that the end of Section 21 evictions will come into force on 1st May is huge news for England’s 12 million renters. We have fought for this day for so long and to now have certainty about when the last ‘no-fault’ eviction will be is crucial for our members, who will be trying to ensure as many renters as possible are aware of their new rights.”"
        },
        {
            "text": "“In addition, it will be important that the government quickly implement the whole Renters’ Rights Act – including the Private Rented Sector Database and Awaab’s Law – so that renters can feel the full benefits of this once-in-a-generation upgrading of their rights as soon as possible.”"
        },
        {
            "text": "Chief Executive of Shelter, Sarah Elliott said: "
        },
        {
            "text": "“Today marks a pivotal step forward for England’s 11 million renters as the government unveils its roadmap for implementing the landmark Renters’ Rights Act. This is the result of years of determined campaigning by renters across the country who refused to accept the injustices of a broken private rental system."
        },
        {
            "text": "“For too long, renters have lived under the constant threat of no-fault evictions. Families have been torn from their communities, with record numbers pushed into homelessness. Too many have been silenced about discrimination and unsafe conditions. Today we celebrate that their voices have finally been heard, and change is on the way."
        },
        {
            "text": "“But renters must understand that their rights will not change today. The current system remains in place until the new rights come into force from May 1, 2026. Until then, we stand ready to support renters and help them understand the vital changes the Act will introduce.” "
        },
        {
            "text": "Chief Executive of Crisis, Matt Downie said: "
        },
        {
            "text": "“The passing of the Renters’ Rights Act was a historic moment. It ushers in a fairer future for millions of renters, with more secure tenancies and protections like longer notice periods to help prevent homelessness. We are pleased to see the government moving quickly and implementing many important protections in the next six months. Evictions from the private rented sector have long been one of the biggest causes of homelessness and this landmark legislation will play a vital role in helping get the country back on track to ending homelessness.” "
        },
        {
            "text": "Policy and Research Manager at Centrepoint, Ella Nuttall said:"
        },
        {
            "text": " ”This path-breaking legislation will put renters and landlords on a fairer footing and ultimately lead to fewer people facing homelessness. "
        },
        {
            "text": "“For far too long, young people have faced a private rental system that is often stacked against them. The Renters’ Rights Act promises to tackle long-standing problems in the rental market and create a fairer, more secure system for all, including young tenants.  "
        },
        {
            "text": "“Ending homelessness would not be possible without private rented sector reform, so this is an important first step, but ensuring there is enough funding geared towards supporting those currently in crisis and a clear strategy from the centre remain vital parts of the puzzle.” "
        },
        {
            "text": "Chief Executive of St Mungo’s, Emma Haddad said:"
        },
        {
            "text": "“We are delighted that the Government has set an implementation date for the Renters’ Rights Act, so renters, landlords and homelessness organisations like St Mungo’s can plan and prepare for these long-awaited reforms. "
        },
        {
            "text": "“Homelessness is spiralling, with many people being pushed into homelessness due to the way the private rental sector is currently operating. But from next Spring, renters will gain vital new protections, including an end to unfair ‘no fault’ evictions, which we hope will prevent more people becoming homeless."
        },
        {
            "text": "“The private rented sector is an important part of the housing system for people moving on from homelessness. At St Mungo’s, we see how difficult it can be for people to secure an affordable private tenancy,  which is why we particularly welcome the Act’s move to end the practice of discriminating against tenants receiving benefits so  everyone has  a fairer chance to find a safe and decent home.  We also warmly welcome the Act’s provisions on allowing pets, which we know can be really important to our clients."
        },
        {
            "text": "“The Renters’ Rights Act is one important part of the picture, and we look forward to the publication of the Government’s Homelessness Strategy to provide the overarching framework, direction and focus for national and local government and charities like St Mungo’s.  "
        },
        {
            "text": "“St Mungo’s stands ready to work with the Government and the wider sector to create a system that prevents homelessness at all costs, while continuing to provide support to those who need it.”  "
        }
    ]
}