{
    "url": "https://educationinspection.blog.gov.uk/2025/11/14/ofsted-explore-an-area/",
    "title": "Ofsted: explore an area  ",
    "authors": [
        "Michael Howe, Deputy Director, Data and Insight"
    ],
    "categories": [
        "data and Insight",
        "early years",
        "further education and skills",
        "schools"
    ],
    "pub_date": "2025-11-14T16:19:27+00:00",
    "content": [
        {
            "text": "Ofsted has a unique perspective on the various places that children and learners experience. We gain this through our inspections of schools and further education and skills providers, and through our additional powers as the regulator of children’s social care and early years. We describe what provision is available to children and learners, and how good it is, based on what we find on inspection. When we apply this understanding to a specific area of the country, we’re able to describe what it is like to be a child growing up in that area using these services, including the challenges or opportunities that could come from living there.   "
        },
        {
            "text": "For the first time, we’ve brought together our inspection findings and visualised them for each local area in England in our new ‘Ofsted: explore an area’ service, which we launched earlier this week. This site will help parents and carers to make informed decisions for their children on accessing local childcare and schools, as well as helping those working in the education and children’s social care sectors to better understand the needs of local areas. "
        },
        {
            "heading": 2,
            "text": "What can you do with Ofsted: explore an area now? "
        },
        {
            "text": "Over time, Ofsted: explore an area will pull together existing data and what we find from the inspections carried out under our renewed framework. It will present a richer, more layered picture of the factors that affect the services available to children and learners. While this new service will evolve over time, you are currently able to:  "
        },
        {
            "heading": 2,
            "text": "How Ofsted: explore an area supports inspection"
        },
        {
            "text": "In our recent consultation response about the renewed education inspection framework, we recognised the importance of taking context into account on inspection. We will start each inspection by talking with leaders about the context in which they are working. Ofsted: explore an area will support inspectors by equipping them with information on a provider’s local area, leading to better, evidence-based conversations on inspections that consider that context. We have provided inspectors with more area-based information in their pre-inspection materials, drawing on the insights from Ofsted: explore an area. "
        },
        {
            "heading": 2,
            "text": "Let us know how you use it "
        },
        {
            "text": "Looking ahead, our goal is to continue developing this service so that it doesn’t just present data, but tells a story with a sense of place. We want all users to feel informed about an area when making decisions about which providers to use. And we want those who run local services to better understand what the journey through childhood looks like and how well they support children and learners along the way.  "
        },
        {
            "text": "Over the coming months you will see more information included from further education and skills and children’s social care, as well as non-association independent schools, to reflect the breadth of local services you might use. "
        },
        {
            "text": "Once you’ve explored the platform, please contact us on areainsight@ofsted.gov.uk to let us know what you think, and how we can improve it further for your needs. "
        }
    ]
}