{
    "url": "https://teaching.blog.gov.uk/2025/11/14/pupil-premium-success-building-effective-school-systems/",
    "title": "Pupil Premium Success: Building Effective School Systems",
    "authors": [
        "Emily Reynard"
    ],
    "categories": [
        "Pupil Premium"
    ],
    "pub_date": "2025-11-14T11:57:09+00:00",
    "content": [
        {
            "text": "Manchester Enterprise Academy (MEA) Central is an eight-form-entry school in inner South Manchester. It is part of the Prospere Learning Trust. Their disadvantaged pupils’ average Attainment 8 score is well above the national average. We asked the school’s principal, Emily Reynard, to tell us more about their approach to using the pupil premium.  "
        },
        {
            "heading": 2,
            "text": "Our school’s disadvantaged pupils "
        },
        {
            "text": "Opened in 2017, the school now serves over 1,050 pupils. With 51% eligible for pupil premium funding - significantly above the national average – the school is committed to ensuring every student thrives. Many families experience housing insecurity, financial instability, digital exclusion, and limited healthcare access. We support well above-average proportions of SEND and EAL learners, with a third of pupils entering below age-related expectations. Despite this, outcomes are consistently strong, with excellent destination data and disadvantaged pupils performing above FFT-20 benchmarks. "
        },
        {
            "heading": 2,
            "text": "Moving towards an embedded, inclusive support"
        },
        {
            "text": "Our disadvantaged pupils face multiple, overlapping barriers including low literacy, attendance gaps, SEND, and limited cultural capital. One-off interventions are not enough. Early in the school’s journey, information was often fragmented across staff and systems, slowing crucial support interventions."
        },
        {
            "text": "The challenge was embedding whole-school inclusion systems so no student was overlooked. We needed early identification, consistent provision, and clear accountability structures that would hardwire inclusion into every layer of school life. Removing barriers became everybody’s responsibility, not just the job of specialists. "
        },
        {
            "heading": 2,
            "text": "Building an effective evidence-driven strategy "
        },
        {
            "text": "Drawing on Education Endowment Foundation (EEF) research and The Difference’s Inclusion Framework, we developed our own MEA Central model. This codifies provision across five strands: teaching and learning, behaviour and attitudes, language and literacy, safeguarding, and wellbeing."
        },
        {
            "text": "Provision is mapped as universal, targeted, or bespoke, using clear thresholds. Fortnightly Removing Barriers meetings and half-termly Interventions Boards provide rigorous accountability. Our mantras of ‘no barriers or excuses’ and ‘sweat the small stuff’’ translate values into consistent practice, ensuring inclusion is systemic and sustainable. "
        },
        {
            "heading": 2,
            "text": "Implementation: systems that deliver"
        },
        {
            "text": "Removing Barriers forms the engine of our whole-school strategy. Leaders meet year teams to review the Inclusion Framework, consider referrals, and assign actions. All provisions are mapped, costed and tracked, ensuring consistency and early intervention."
        },
        {
            "text": "Our Interventions Board reviews data and impact half-termly, examining cost-effectiveness and case studies. Pupil premium funding sustains this infrastructure, enabling targeted literacy programmes, mentoring, and enrichment opportunities. Crucially, the funding supports not just interventions, but the systems guaranteeing equitable and consistent delivery. "
        },
        {
            "heading": 2,
            "text": "Ensuring pupil success through our inclusive approach "
        },
        {
            "text": "Outcomes show the system is working. Attendance gaps are narrowing, literacy interventions accelerate reading ages, and behaviour has stabilised following post-pandemic challenges. Pupil premium progress has risen significantly, surpassing FFT-20 benchmarks. NEET figures remain Manchester’s lowest, while pupil voice feedback evidences stronger confidence and belonging. Staff report greater clarity in supporting need, and families value transparent, inclusive processes. "
        },
        {
            "text": "The key to our approach lies in systematised inclusion. Embedding clear processes, we make support predictable, transparent, sustainable beyond individuals. This creates consistency for staff, confidence for families, and continuity for pupils. Most importantly, it ensures that equity is hardwired into the school’s DNA, leaving a sustainable legacy that will outlast leaders and secure fairness for future cohorts. "
        },
        {
            "heading": 2,
            "text": "Find out more"
        },
        {
            "text": "Department for Education (DfE) publications  "
        },
        {
            "text": "Education Endowment Foundation resources  "
        },
        {
            "text": "DfE pupil premium webinars  "
        }
    ]
}