{
    "url": "https://hmlandregistry.blog.gov.uk/2026/01/20/hm-land-registry-portal-to-be-refreshed/",
    "title": "HM Land Registry portal to be refreshed ",
    "authors": [
        "Matthew Thomas, Digital Registration Service Product Manager"
    ],
    "categories": [
        "Buying and selling property",
        "Digital services",
        "Law and practice"
    ],
    "pub_date": "2026-01-20T10:00:09+00:00",
    "content": [
        {
            "text": "From 26 January, 2026 we will introduce a new design for the HM Land Registry portal. "
        },
        {
            "text": "Customers will initially see this new design on the most used pages on the portal – both the homepage and View Applications screen. This refreshed design will align those pages with the Digital Registration Service and LLC screens, bringing a greater sense of consistency across the platform. This look and feel will soon be introduced to the log-in page. "
        },
        {
            "text": "We will then bring more uniformity across the portal, bringing other areas of the platform in line with these popular services over the coming months. "
        },
        {
            "heading": 2,
            "text": "How to know you’re on the right website "
        },
        {
            "text": "The page may look different, however the site remains the same. The easiest way to check is by looking at the url, which will remain “eservices.landregistry.gov.uk”."
        },
        {
            "text": "This design refresh is all part of our efforts to continually improve our customer services, drawing from customer feedback to provide the level of support expected from a modern digital government. "
        },
        {
            "text": "The homepage will now include the familiar, black GOV.UK banner and streamlined links to the services you want. "
        },
        {
            "heading": 2,
            "text": "A digital service for the future"
        },
        {
            "text": "All of this work is based on what our customers are telling us about how they use the portal. Our Strategy 2025+, published last year, sets out how we will invest in our digital services, to make them even more secure and easy to use. So, customer feedback is crucial as we continue to adapt our services to more closely meet your needs. "
        },
        {
            "text": "We are working hard to eliminate the barriers people find to using our services and welcome any further comments or ideas on how we might continue to improve - by either submitting feedback via the link at the top of the portal or by commenting below. "
        },
        {
            "text": "You can also find more information about upcoming changes in our digital services roadmap."
        }
    ]
}