{
    "url": "https://gds.blog.gov.uk/2026/01/20/our-roadmap-for-modern-digital-government/",
    "title": "Our roadmap for modern digital government ",
    "authors": [
        "Emily Middleton, Director General for Digital Transformation, Government Digital Service",
        "Christine Bellamy, Interim Director General, Digital Products Group"
    ],
    "categories": [
        "Digital Centre",
        "Digital engagement",
        "Digital strategy",
        "Digital, Data and Technology"
    ],
    "pub_date": "2026-01-20T10:00:00+00:00",
    "content": [
        {
            "text": "Our roadmap for modern digital government sets out how every corner of the state is using technology to make government work for the citizens it serves. It’s an action plan for the whole of the public sector, bringing together some of the most important products, platforms and transformation initiatives planned between now and 2030. "
        },
        {
            "text": "From building a new careers service to help people into work, to making people’s lives easier by giving them a free, secure way to prove their identity in their day to day lives, this roadmap defines the progress we are making to build a modern British government. "
        },
        {
            "text": "It also details the foundational steps we have taken since launching the blueprint for modern digital government one year ago. In that blueprint, we made a clear declaration of intent: to completely reshape public services through digital transformation.  "
        },
        {
            "text": "Our vision is to unite the entire digital community, reaching out across the public sector to create joined-up services that make a tangible difference to people’s lives.  "
        },
        {
            "text": "It was an ambitious vision, but one we have already made swift progress against. "
        },
        {
            "heading": 2,
            "text": "Progress against our six-point plan "
        },
        {
            "heading": 3,
            "text": "1. Joining up public services "
        },
        {
            "text": "At the blueprint launch in January, then Secretary of State Peter Kyle announced five kickstarters that would underpin a new era of digital government. We’ve made great progress on all of them, including the GOV.UK app, which had been downloaded 316,000 times by the end of December 2025. That’s more than a quarter of a million people – enough to fill Wembley three times – testing a new app in beta, to make their interactions with government easier.  "
        },
        {
            "text": "Meanwhile, GOV.UK Wallet now houses its first credential – the digital Veteran Card. It’s available to over 2 million former Service Personnel and gives them an easier way to show their veteran status to access everything from housing and mental health support to reduced entry at museums and money off their shopping. We’re already testing the digital Driver’s Licence and will have much more to share next year. "
        },
        {
            "text": "Beyond the kickstarters, we’re making big strides towards more joined-up services. GOV.UK One Login has been used by over 13 million people to access more than 120 government services, making interactions with government simpler and more joined-up. In future, products like the GOV.UK app and GOV.UK One Login can support simpler access to local government services too. This is just one of the areas of focus for GDS Local, a new unit that we’ve launched to deepen collaboration between central and local government and to drive improvements in digital services for communities across the UK. "
        },
        {
            "text": "This month, we have also launched a whole new team, CustomerFirst, to help transform customer services across government. The team will use AI and service design to rewire how customer services work and help cut wait times and backlogs. They have already started work in partnership with the brilliant team at DVLA and will quickly take what they learn around government.  "
        },
        {
            "text": "With a huge prize to go after, we’ll need to expand the team rapidly. Initially we’re looking for experienced practitioners with deep expertise in service design, solutions architecture and product management. Register your interest today and learn more about the CustomerFirst mission and upcoming hiring opportunities: https://customerfirst.campaign.gov.uk/  "
        },
        {
            "heading": 3,
            "text": "2. Harnessing AI for public good "
        },
        {
            "text": "2025 was the year our most promising AI tools started to scale, a shift that brought new challenges to technologists across government and one that we’re excited to see continue into this new year. Some of the projects within the Prime Minister’s AI Exemplars programme show just this. The NHS is already using AI to predict demand in 50 A&E wards across the country, helping to keep wait times down when wards get busy. And over 1,000 probation officers are using bespoke transcription in their day-to-day meetings with offenders so they can focus their attention on helping offenders, not doing admin.  "
        },
        {
            "text": "We also tested AI tools to improve productivity within the Civil Service. For instance, our recent evaluation of Consult – an AI tool that automates the analysis of public consultations – revealed a median time of 23 seconds to review a consultation response, slashing the hundreds of days administrators typically spend sorting responses. "
        },
        {
            "text": "As this year progresses, we can expect to see more success stories coming through, and promising ideas shared. Throughout, we’ll keep building out the AI Knowledge Hub, a living repository that now includes the AI Playbook for the UK Government and is designed to support public sector teams in exploring, adopting, and applying artificial intelligence responsibly. "
        },
        {
            "text": "Over the last year, we’ve also run two scaled public pilots of GOV.UK Chat – first on the GOV.UK website, and then in the GOV.UK app in the Autumn of 2025. Based on the findings, we plan to roll out public access to GOV.UK Chat, starting with a release in the GOV.UK app early this year. Beyond that, we intend to make it widely available across the GOV.UK website so it’s accessible wherever users need it. "
        },
        {
            "heading": 3,
            "text": "3. Strengthening our digital public infrastructure "
        },
        {
            "text": "In June, responsibility for government and public sector cyber security moved to DSIT. This move better integrates the centre’s cyber security responsibilities and expertise within the digital centre of government. "
        },
        {
            "text": "We’ve launched the first iteration of our vulnerability scanning service, which is already being used by 6,000 public sector bodies to improve cyber security across government, and we’re designing a set of technology, platforms and processes to join up services, communities and suppliers across government. "
        },
        {
            "text": "We’re also working with other organisations to define common API standards that will open up systems and data, making it easier for services to connect with each other. "
        },
        {
            "heading": 3,
            "text": "4. Investing in talent "
        },
        {
            "text": "The Prime Minister has set a target for one in 10 civil servants to work in technology and digital roles by 2030. To support this, we’ll be focusing efforts on attracting and growing talented and innovative teams on multiple levels. So far this year, we’re continuing to grow our TechTrack apprenticeship programme, which has received thousands of applications. We’ve also launched an AI accelerator upskilling programme to build crucial expertise across government. "
        },
        {
            "text": " In the year ahead, we’ll be investing in the development of leaders across the civil service. This will include new programmes for technical leaders focused on strategic leadership, commercial skills and more, as well as making sure that senior civil servants across government bring with them the digital and data skills they need to build a modern digital government.  "
        },
        {
            "heading": 3,
            "text": "5. Funding for outcomes, procuring for growth "
        },
        {
            "text": "Efficiency and value for money remain front and centre if we’re to realise the £45 billion savings and productivity improvements opportunity estimated one year ago in the State of Digital Government review.  "
        },
        {
            "text": "We’re working with departments to launch new funding models for services, portfolio management, and innovation this summer, moving away from short funding cycles toward continuous funding of persistent, multidisciplinary product teams. "
        },
        {
            "text": "In partnership with the Government Commercial Function, we’ve also launched the Digital Commercial Centre of Excellence to get the best from our suppliers and create opportunities for the UK tech sector."
        },
        {
            "text": "Meanwhile, we’re building the National Digital Exchange, a new platform designed to improve the way the public sector buys technology, aiming to unlock £1.2 billion in annual savings. "
        },
        {
            "heading": 3,
            "text": "6. Committing to transparency, driving accountability "
        },
        {
            "text": "The scale of change GDS and digital professionals are driving across the public sector is immense: it changes the shape of crucial services to vastly improve people’s day-to-day lives. To do this right, we’re committed to making sure people can see and understand the changes that are taking place, so they can continue to use and trust the services they need. This is essential to ensuring the success of modern digital services and spreading good work rapidly. "
        },
        {
            "text": "That’s why we’ve published this comprehensive roadmap, detailing how each corner of government is going to use technology to help the citizens who use those services. "
        },
        {
            "text": "It’s also why we launched the new Algorithmic Transparency Recording Standard last year and have now published over 70 records of tools being used across government. These documents, in an easy-to-read format, share openly how algorithms and AI are used in different public services, and how any risks are managed. In the year ahead, we’ll start publishing product roadmaps for major products to further boost openness and accountability.  "
        },
        {
            "heading": 2,
            "text": "Get involved "
        },
        {
            "text": "We’re committed to working in the open and we need your input. You can: "
        }
    ]
}