{
    "url": "https://space.blog.gov.uk/2026/01/20/unlocking-space-for-agriculture/",
    "title": "Unlocking Space for Agriculture",
    "authors": [
        "UK Space Agency"
    ],
    "categories": [
        "Applications",
        "Earth from space",
        "Earth observation"
    ],
    "pub_date": "2026-01-20T12:59:19+00:00",
    "content": [
        {
            "text": "Two innovative projects will use satellite data and digital tools to help farmers make more informed decisions, boost productivity and care for the environment.  "
        },
        {
            "text": "Building on the Unlocking Space for Agriculture initiatives delivered across Scotland and the East of England by Space Scotland and Space East and supported through the UK Space Agency’s Space Cluster Partnership Programme, the UK Space Agency’s Unlocking Space for Business (USB) programme, which aims to accelerate commercial adoption of satellite-enabled solutions by businesses, is funding two four‑month pilot projects. "
        },
        {
            "text": "Running for the remainder of the 2025/26 financial year, the pilots will work directly with farmers, growers and technology suppliers to co-develop solutions that give farmers tools to inform decision-making on cropping and land health."
        },
        {
            "text": "The aim is to test whether involving end‑users early can speed up the development of practical, near‑market solutions for UK agricultural businesses. "
        },
        {
            "heading": 2,
            "text": "GeoCrop - helping farmers make better cropping decisions "
        },
        {
            "text": "Every year, farmers face a difficult balancing act when planning crops. "
        },
        {
            "text": "Planting earlier in the season can secure higher prices by reducing reliance on imports, but early planting also comes with risks, especially when weather patterns are unpredictable. "
        },
        {
            "text": "The GeoCrop project aims to give farmers clearer, more reliable information when making these decisions. A team consisting of EOLAS Insight, Satarla, Tap-That, Home Farm Nacton, the Scottish Agricultural Organisation Society (SAOS) and Agri-TechE (the UK's Farm Innovation Network). will develop a first version of a new data service that combines satellite images, weather information and supply chain insights."
        },
        {
            "text": "The tool will help farmers understand which factors, such as soil moisture, temperature and market timing, might affect the success of a crop.  "
        },
        {
            "text": "To make sure the service reflects real needs, the project will work directly with farming groups to help shape a tool that is practical, easy to use and grounded in farmers’ everyday decision making. "
        },
        {
            "heading": 2,
            "text": "SEDERS – Using space and sensors to support greener farming "
        },
        {
            "text": "The second project, known as Space Enabled Decarbonisation, Environmental and Regenerative Solutions (SEDERS), focuses on helping farmers measure and improve the health of their land. "
        },
        {
            "text": "This four-month research and development project brings together Oversite Earth, Barlow Farming Company, Gledpark Farm and Inforgen."
        },
        {
            "text": "Their goal is to show how satellite Earth Observation data from space can be combined with small sensors placed in fields, to validate remotely sensed data and give farmers a clear picture of their overall  ‘nature capital’ over time."
        },
        {
            "text": "This includes biodiversity, soil carbon, water flow, habitats and overall land condition. "
        },
        {
            "text": "By providing an affordable and repeatable way to measure environmental progress, the project aims to support farmers who are trying to increase biodiversity, reduce emissions and adopt more regenerative practices, all while maintaining a productive and profitable farm. "
        },
        {
            "text": "Together, these pilots represent an important step in testing how satellite‑enabled tools can deliver real‑world benefits for agriculture in Scotland and beyond. "
        },
        {
            "text": "By working directly with farming communities and technology developers, the UK Space Agency’s Unlocking Space for Business programme is helping to accelerate practical innovation, strengthen environmental stewardship and ensure space‑powered solutions are shaped by the people who need them most. "
        },
        {
            "text": "Letting farmers lead the way will not only improve the tools themselves, it will help unlock new opportunities for a more resilient, sustainable agricultural sector. "
        },
        {
            "text": "Find out more about the Unlocking Space for Business programme here: Unlocking Space for Business - GOV.UK "
        }
    ]
}