{
    "url": "https://ukhsa.blog.gov.uk/2026/01/20/what-are-the-symptoms-of-shingles-and-what-is-the-connection-to-chickenpox/",
    "title": "What are the symptoms of shingles and what is the connection to chickenpox?",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "immunisations"
    ],
    "pub_date": "2026-01-20T14:57:02+01:00",
    "content": [
        {
            "text": "Shingles, known medically as herpes zoster, is an infection that causes a painful rash. It is caused by the same virus that causes chickenpox (varicella). Once someone has recovered from chickenpox, the virus remains dormant in the body and then can reactivate later in life and present as shingles because of decreased immunity – either with increasing age or immunosuppression. Anyone who has had chickenpox is at risk of shingles later in life."
        },
        {
            "text": "You cannot ‘catch’ shingles from someone else - it can only occur in people who have previously had chickenpox, even if they weren't aware of it at the time."
        },
        {
            "heading": 2,
            "text": "What are the symptoms?"
        },
        {
            "text": "The first sign is often a tingling or painful feeling in an area of skin, sometimes accompanied by a headache or feeling generally unwell. A rash typically appears a few days later, initially as blotches, then itchy fluid-filled blisters which crust over and finally heal. The rash appears on one side of the face or body only - a rash on both sides is unlikely to be shingles. You can see images of the shingles rash on the NHS website."
        },
        {
            "heading": 2,
            "text": "What should I do if I think I have shingles?"
        },
        {
            "text": "Seek advice from a health professional if you think you have shingles. Although some people experience mild symptoms and may not need treatment, for others, shingles can be severe and will require antiviral medication."
        },
        {
            "text": "Seek urgent medical advice if you're pregnant, if the rash affects your eyes or nose, if you have vision changes, if you have a severely weakened immune system, or if you or your child is 17 or younger."
        },
        {
            "heading": 2,
            "text": "Can you get shingles without a rash?"
        },
        {
            "text": "Yes, although it's rare. Shingles can occasionally cause pain without any visible rash."
        },
        {
            "heading": 2,
            "text": "How serious is it?"
        },
        {
            "text": "Many people don't realise how serious shingles can be. While some cases are mild, it can cause severe pain and have debilitating effects for months. Some people cannot bear anything touching their skin, including clothes or water. Around 50 deaths are caused by shingles every year in the UK."
        },
        {
            "text": "One of the most common complications is nerve pain that persists long after the rash has healed (post-herpetic neuralgia). Some people never fully recover. Other complications can include eye problems leading to sight loss, muscle weakness, and Ramsay Hunt syndrome, which affects the facial nerve."
        },
        {
            "heading": 2,
            "text": "How long does it take to recover?"
        },
        {
            "text": "The rash can take up to 4 weeks to heal. Skin can remain painful for weeks afterwards, though this usually improves over time. Complications like post-herpetic neuralgia can last for months after the rash has gone."
        },
        {
            "heading": 2,
            "text": "Who is most at risk?"
        },
        {
            "text": "Anyone who has had chickenpox is at risk, but the likelihood and severity increase with age as immunity naturally wanes. Shingles can strike when the immune system is particularly vulnerable - for instance, after flu or during periods of stress or trauma. Those with weakened immune systems are at increased risk and older adults are especially susceptible to complications."
        },
        {
            "heading": 2,
            "text": "Is there a vaccine?"
        },
        {
            "text": "A single-dose shingles vaccine was introduced by the NHS in 2013, and since September 2023 it has been replaced by a new 2-dose vaccine called Shingrix. It is currently offered to people who turned 65 on or after 1 September 2023, those aged 70 to 79 who haven't yet been vaccinated, and people aged 18 and over with a severely weakened immune system. Check full eligibility information on the NHS website."
        },
        {
            "text": "The vaccine has been shown to significantly reduce your risk of developing shingles and, even if you do get shingles after vaccination, symptoms are typically much milder."
        },
        {
            "heading": 2,
            "text": "How do I get vaccinated?"
        },
        {
            "text": "Contact your GP practice to check your eligibility and arrange an appointment. Unlike some vaccines, the shingles vaccine doesn't provide herd immunity - the only way to be protected is to be vaccinated yourself. If you know someone who might be eligible, consider reminding them. It could save them months of pain, or even their life."
        },
        {
            "heading": 2,
            "text": "Can you get shingles more than once?"
        },
        {
            "text": "Yes, which is why vaccination remains important even if you've had the infection before."
        },
        {
            "heading": 2,
            "text": "Does the shingles vaccine help protect against dementia?"
        },
        {
            "text": "A study from the University of Oxford, funded by the National Institute for Health and Care Research, found that the recombinant shingles vaccine (Shingrix) was associated with a reduction in dementia diagnoses. While this is encouraging, further research is needed in this area."
        },
        {
            "heading": 2,
            "text": "What role does UKHSA play?"
        },
        {
            "text": "UKHSA supports all aspects of the national vaccination programme, from being involved in the design and implementation of the programme, to developing guidance and training for healthcare professionals, and producing resources for the public such as our information leaflets. We are also responsible for monitoring vaccine coverage as well as evaluating the impact and effectiveness of the vaccine programme to ensure that it continues to be effective in providing the best protection for our population."
        }
    ]
}