{
    "url": "https://nda.blog.gov.uk/6-things-that-might-surprise-you-about-being-a-graduate-engineer-at-sellafield/",
    "title": "6 things that might surprise you about being a graduate engineer at Sellafield",
    "authors": [
        "Shona Tait"
    ],
    "categories": [
        "Recruitment",
        "skills"
    ],
    "pub_date": "2024-09-13T10:07:03+01:00",
    "content": [
        {
            "text": "You don’t have to be from West Cumbria to work at Sellafield"
        },
        {
            "text": "I’m originally from Wick in the far north of Scotland and in 2017, I moved to Glasgow to study for my Master’s Degree in Mechanical Engineering at the University of Strathclyde. If you join through the graduate programme, you’ll also get some money to help towards your relocation costs."
        },
        {
            "text": "Sellafield Ltd is part of a bigger group of companies"
        },
        {
            "text": "Sellafield Ltd is 1 of 4 operating companies that make up the Nuclear Decommissioning Authority (the others are Nuclear Restoration Services, Nuclear Waste Services and Nuclear Transport Solutions). That means you’re joining part of the nation’s nuclear decommissioning efforts."
        },
        {
            "text": "My nuclear career actually started at Dounreay, a site that is now part of Nuclear Restoration Services. I completed 2 summer placements there and loved it."
        },
        {
            "text": "You get lots of different opportunities and experiences"
        },
        {
            "text": "I knew when I started the Engineering and Maintenance Graduate Scheme here at Sellafield that it would provide me with an exciting and challenging environment. This is exactly what I was looking for so that I could grow and develop as a professional engineer. "
        },
        {
            "text": "I’ve already completed 3 placements on the scheme, in data and asset management, one of our effluent plants, and our manufactured products programme. I’m excited for the next challenge!"
        },
        {
            "text": "You get to do so much more than ‘the day job’"
        },
        {
            "text": "One of the best aspects of working here at Sellafield is that the tasks you complete, be they routine or one-off, all play their part in supporting a much larger mission. This allows you to come to work each day with a sense of purpose and focus."
        },
        {
            "text": "On top of that, Sellafield Ltd will support you to take on other opportunities as well. For example, I’ve had the opportunity to take on a secretarial role for a management safety committee and worked in the support office for the Nuclear Engineering Directors’ Forum. Both have given me opportunities to develop professionally and to build my network within the business and wider industry."
        },
        {
            "text": "You don’t just get graduate support, you get a mentor specific to your chartership specialism"
        },
        {
            "text": "The work I have been involved in at Sellafield has been challenging and stimulating, and throughout I’ve had support and guidance when needed. I get regular feedback from my line managers and from the graduate programme leads. "
        },
        {
            "text": "I also have an IMechE mentor which is a real asset as I work towards IMechE chartership."
        },
        {
            "text": "You’ll get to make friends and work with some of the greatest people you’ll ever meet"
        },
        {
            "text": "On a personal level, my line managers, colleagues and friends on the graduate scheme have been brilliant at supporting me. "
        },
        {
            "text": "They were particularly supportive to me as I faced the challenges and realities of relocating to West Cumbria from Caithness. Life transitions like this are not without their challenges (mine was particularly dramatic, but that’s for another post!) so it’s important to have great people around you, and there’s none better than the people of Sellafield.  "
        },
        {
            "text": "If you are interested in joining the Sellafield graduate scheme, head over to our careers website to find out more. "
        }
    ]
}