{
    "url": "https://deframedia.blog.gov.uk/2024/09/13/coverage-following-the-first-meeting-of-the-floods-resilience-taskforce/",
    "title": "Coverage following the first meeting of the Floods Resilience Taskforce",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Flood"
    ],
    "pub_date": "2024-09-13T11:45:06+01:00",
    "content": [
        {
            "text": "There has been positive media coverage after the new Floods Resilience Taskforce to turbocharge the development of flood defences and bolster the nation’s resilience to extreme weather convened for the first time."
        },
        {
            "text": "Publications including the Guardian, Independent, Shropshire Star, Yorkshire Post, Edie, Business Green and Farming Online covered the first meeting of the Taskforce, which saw the Secretary of State and Floods Minister Emma Hardy meet with representatives from Defra, MHCLG, Home Office, Cabinet Office, the Environment Agency, the Met Office, Local Resilience Forums, Mayoral Offices, emergency responders and the National Farmers Union, among others."
        },
        {
            "text": "The meeting came as the Met Office confirmed there is an increased probability of a wetter-than-average winter floods season."
        },
        {
            "text": "The expert group discussed how they will speed up and co-ordinate flooding preparation and resilience between central government, local authorities and community responders, and emergency services."
        },
        {
            "text": "The Taskforce also outlined plans to take a long-term, strategic approach to the challenges of flooding."
        },
        {
            "text": "Secretary of State for Environment, Food and Rural Affairs Steve Reed said:"
        },
        {
            "text": "Floods Minister Emma Hardy said:  "
        },
        {
            "text": "As the government’s primary delivery partner for flood defences, the Environment Agency outlined how it has stepped up its maintenance of flood assets with 216,000 checks following last year’s demanding winter, delivering repairs at pace and focusing on the areas of highest risk to ensure preparedness ahead of the flood season. It has also increased its spend on asset maintenance and repair to £236 million, up from £200 million."
        },
        {
            "text": "Caroline Douglass, Executive Director for Flood and Coastal Risk Management at the Environment Agency, said:   "
        },
        {
            "text": "The Taskforce agreed on several steps to action ahead of the next meeting in early 2025. This includes continuing to monitor catchment areas showing sensitivity to rainfall, including in western and southern parts of England, and how they recover ahead of the winter flood season."
        },
        {
            "text": "It also agreed to identify how government, emergency services and Local Resilience Forums can better share lessons learnt from recent flooding events, with the introduction of best practice guidance to be considered. "
        }
    ]
}