{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2024/09/13/its-nearly-time-for-the-biggest-government-science-and-engineering-event-of-the-year/",
    "title": "It’s nearly time for the biggest government science and engineering event of the year ",
    "authors": [
        "gseprofession"
    ],
    "categories": [
        "GSE Profession Updates"
    ],
    "pub_date": "2024-09-13T16:32:21+01:00",
    "content": [
        {
            "text": "Government Science and Engineering (GSE) Conference 2024 "
        },
        {
            "text": "The Government Science and Engineering (GSE) Conference 2024 will take place on 18 September at the Science Museum in London and online.  Hosted by Professor Dame Angela McLean, Government Chief Scientific Adviser, and Head of the Government Science and Engineering Profession, this year’s theme is An Innovative Public Sector.   "
        },
        {
            "text": "On the day, we will be showcasing the Profession’s science and engineering superpowers across government. The conference is open to everyone across government to attend.  "
        },
        {
            "text": "Conference Highlights  "
        },
        {
            "text": "Keynote Address   "
        },
        {
            "text": "The Royal Institution, famous for its annual Christmas lectures, will deliver this year’s keynote speech.  A Brief History of Electrical Innovation promises to be interactive and memorable, with unforgettable live demonstrations. "
        },
        {
            "text": "Panel Sessions  "
        },
        {
            "text": "We are also spotlighting panel sessions on innovation, Net Zero and AI.  The innovation panel, chaired by Professor Dame Angela McLean, features notable speakers such as Professor Sir Ian Diamond, National Statistician; Simon Baugh, Head of the Government Communications Service; and Tamara Finkelstein, Head of the Policy Profession. These senior leaders will be exploring the theme of innovation across government. "
        },
        {
            "text": "Turbo Talks   "
        },
        {
            "text": "Members of the profession will take centre stage with a range of exciting talks showcasing the best of science and engineering in government. Our Turbo Talk sessions will spotlight innovation, interchange, and inclusion, featuring 30 dynamic speakers from over 20 organisations — each with just 5 minutes to explain their innovative work.  "
        },
        {
            "text": "Virtual posters  "
        },
        {
            "text": "We also have virtual posters at the museum and online, where our online audience can vote for the best poster of the conference. Delegates will be able to discover new areas of work in science and engineering across government.  "
        },
        {
            "text": "GSE Awards   "
        },
        {
            "text": "Finally, we will be celebrating the incredible achievements of colleagues from diverse scientific, engineering, and technical backgrounds with the launch of the inaugural GSE Awards with the awards ceremony on the day. "
        },
        {
            "text": "Attending on the day "
        },
        {
            "text": "In-person tickets are sold out, but you can still join online if you are a member of the civil, crown or public services. Please email gse@go-science.gov.uk if you would like to attend. "
        }
    ]
}