{
    "url": "https://homeofficemedia.blog.gov.uk/2024/09/13/martyns-law-factsheet/",
    "title": "Martyn's Law Factsheet",
    "authors": [
        "Home Office news team"
    ],
    "categories": [
        "Uncategorised"
    ],
    "pub_date": "2024-09-13T09:14:04+01:00",
    "content": [
        {
            "text": "This factsheet was updated in September 2024. "
        },
        {
            "text": "The Terrorism (Protection of Premises) Bill, also known as Martyn’s Law, was included in The King’s Speech on 17 July as part of the programme of legislation the Government intends to pursue in this Parliamentary session. The Bill was introduced to Parliament on 12 September 2024 and is currently undergoing Parliamentary scrutiny."
        },
        {
            "text": "This Bill will deliver the Government’s manifesto commitment to ‘bring in Martyn’s Law to strengthen the security of public events and venues’."
        },
        {
            "text": "The Government would like to pay tribute to Figen Murray, mother of Martyn Hett, who was killed in the Manchester Arena attack.  Her campaigning has been crucial in driving this Bill forward.  "
        },
        {
            "text": "Please refer to our wider factsheets and Bill documentation which can be found on GOV.UK."
        },
        {
            "text": "Why do we need Martyn’s Law? "
        },
        {
            "text": "What will Martyn’s Law do? "
        },
        {
            "text": "How will it work?  "
        },
        {
            "text": "Who will be in scope?"
        },
        {
            "text": "Premises that satisfy the following three criteria fall within scope of the Bill:"
        },
        {
            "text": "Events that satisfy the following four criteria fall within scope of the Bill:"
        },
        {
            "text": "Who is the responsible person?"
        },
        {
            "text": "What are the requirements for standard duty premises?"
        },
        {
            "text": "What are the requirements for enhanced duty premises and qualifying events?"
        },
        {
            "text": "Why are only large events captured? "
        },
        {
            "text": "Who is responsible for requirements at a premises or event in scope?  "
        },
        {
            "text": "How will Martyn’s Law be enforced? "
        },
        {
            "text": "How will you ensure this doesn’t create undue burden on businesses? "
        },
        {
            "text": "Is there support for this legislation? "
        },
        {
            "text": "How will my business or organisation be supported on Martyn’s Law?  "
        },
        {
            "text": "Will Martyn’s Law apply to all of the UK?   "
        }
    ]
}