{
    "url": "https://socialcare.blog.gov.uk/2022/06/07/carers-week-make-support-for-unpaid-carers-reflective-of-our-diverse-communities/",
    "title": "Carers Week: make support for unpaid carers reflective of our diverse communities",
    "authors": [
        "Fatima Khan-Shah"
    ],
    "categories": [
        "Care and support",
        "Carers",
        "Communities",
        "coronavirus",
        "Events",
        "Viewpoint"
    ],
    "pub_date": "2022-06-07T11:32:35+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Caring doesn't stop during a pandemic"
        },
        {
            "text": "Being an unpaid carer during a global pandemic takes its toll, as does its aftermath. We, along with everyone else, have had to learn to ‘live with COVID-19’, as we collectively strive to recover, rebuild, and reconnect with the world around us."
        },
        {
            "text": "The impact is not just physical and emotional, it’s financial too. From speaking with my networks of unpaid carers, I know am not the only person experiencing this. Many have told me how they have felt invisible, isolated, and undervalued, and are now feeling the strain of the rising cost-of-living. These issues are front and centre of this year’s Carers Week, (running 6-12 June)."
        },
        {
            "text": "We also know unpaid carers from ethnic minorities can experience a double or triple whammy of inequality. As a female carer from an ethnic minority myself, I know how this feels. It can be difficult to find and access services that reflect my cultural and spiritual needs, as well as those of my loved ones."
        },
        {
            "text": "A vital element in addressing this inequality is creating or adapting services to reflect the diverse needs of unpaid carers in their local communities. These services should provide holistic and personalised care, recognising the many different facets that make us who we are."
        },
        {
            "text": "Now, more than ever, during these uncertain and challenging times, we need to make sure unpaid carers remain front and centre. These incredible people make huge personal sacrifices daily and collectively enable our health and care system to function. We must proactively recognise, support, and celebrate their kindness and dedication."
        },
        {
            "heading": 2,
            "text": "An opportunity to unite and make a difference"
        },
        {
            "text": "With the imminent arrival of integrated care boards from 1 July, there is a huge opportunity for partners across health, care, the voluntary, community and social enterprise (VCSE) sector, education and beyond to come together and really address some of the ‘wicked issues’ to have impacted on the lives of unpaid carers."
        },
        {
            "text": "In West Yorkshire’s Health and Care Partnership this has involved a focus on making sure unpaid carers are visible, valued and supported through a variety of work streams which focus on:"
        },
        {
            "heading": 2,
            "text": "The fruits of combined labour"
        },
        {
            "text": "This collaborative focus on tangible interventions provides practical and meaningful support with positive outcomes, including the working carers passport, the ‘message in a bottle’ contingency plan and resources for teaching professionals to support young carers in schools and colleges. These interventions not only support unpaid carers, but the wider health and care system, leading to improved health outcomes for everyone."
        },
        {
            "text": "I am hopeful in this new era of collaboration and partnership working we will help sustain these incredible people by creating a network of support around them. This will help all unpaid carers to stay happy, healthy and well, so they can focus on what matters to them: caring for their loved ones."
        },
        {
            "text": "And finally, a reminder that it’s Carers Week. This gives us all the opportunity to recognise the support they give – we can all do our bit, including looking after a neighbour, by simply checking in, saying hello and showing you care."
        }
    ]
}