{
    "url": "https://vets.blog.gov.uk/2022/06/07/cvo-comments-on-a-recent-paper-on-the-effectiveness-of-badger-culling/",
    "title": "CVO comments on a recent paper on the effectiveness of badger culling",
    "authors": [
        "Dr Christine Middlemiss BVMS MRCVS"
    ],
    "categories": [
        "Disease outbreak",
        "Policy Work"
    ],
    "pub_date": "2022-06-07T10:05:05+01:00",
    "content": [
        {
            "text": "Defra’s Chief Scientific Adviser Gideon Henderson and I have written to the Veterinary Record to express our concerns about significant methodological flaws in a scientific paper it has published by Langton and colleagues1 on the effect of badger culling on cattle bovine TB (bTB) herd incidence"
        },
        {
            "text": "We do not believe the scientific methodology used is credible as the analysis has been carried out in an unusual manner that masks the effect of culling by incorrectly grouping data, which makes it impossible to assess the impact of culling on cattle TB breakdowns."
        },
        {
            "text": "For each year analysed, Langton and colleagues combine data for areas where culling commenced that same year along with areas with a longer history of culling. This is an inappropriate grouping of data because it is known that the impact of culling on cattle outbreaks takes some time to appear,2 typically two years. The total area being culled has increased through the past seven years so, for each year analysed, a relatively large area of newly culled land, with a higher bTB incidence, is included in the total culled area in Langton and colleagues’ analysis."
        },
        {
            "text": "This has the effect of masking trends in herd breakdown incidence like the statistically significant decreases observed previously3 in areas where culling has been underway for several years."
        },
        {
            "text": "This flawed combination of data prevents Langton and colleagues from being able to assess their null hypothesis: that culling has no association with the incidence of Officially Tuberculosis Free-withdrawn (OTFw) herd breakdowns."
        },
        {
            "text": "It is possible to reduce these problems and test the null hypothesis with a more appropriate analysis of the same type of data as used in Langton et al. Using the most recent published data,4, 5 we looked at cull areas by the year culling started, and assess breakdowns in these specific areas in subsequent years. Unculled areas are limited to those where no culling took place during the entire period being considered. Apart from this change in the grouping of data, we use similar assumptions as Langton and colleagues to enable a straightforward comparison."
        },
        {
            "text": "Our analysis indicates a clear reduction in OTFw cattle breakdowns, relative to unculled areas, in culled areas from cull year 2 onwards (Fig 1). For example, TB incidence in the areas where culling started in 2016 has dropped from 17.2 OTFw breakdowns per 100 herd years at risk in 2016/17, to 8.7 in 2019/20."
        },
        {
            "text": "Similarly in the areas where culling started in 2017 it has dropped from 15.3 in 2017/18 to 8.4 in 2019/20."
        },
        {
            "text": "In contrast, in the parts of the high-risk area (HRA) where no culling took place, incidence has only fluctuated slightly from year to year, from 10.9 in 2015/16 rising to 12.8 in 2016/17 before returning to 10.9 in 2019/20."
        },
        {
            "text": "This analysis demonstrates the impact of the flawed approach of Langton and colleagues, negates the conclusion of that study, and indicates that badger culling is associated with a reduction of cattle TB cattle breakdowns in the HRA, as seen in previous studies."
        },
        {
            "text": "In the second half of their paper the authors do not carry out any statistical analysis, simply stating that the peak of TB incidence does not coincide with the year the first cull started in a given county. Such group-level correlations are open to inferential errors through failing to account for confounding variables."
        },
        {
            "text": "We agree with the authors that OTFw incidence is declining across the HRA, and that increased controls on cattle movements, testing and biosecurity will have contributed to this success. These are important components of our bTB eradication strategy. In the context of these increased cattle controls, we don’t regard it as surprising that incidence rates in an entire county do not alter on the date culling started in some parts of that county. As demonstrated by the analysis in Fig 1, culling in an area does correlate with subsequent decreases in OTFw incidence in that area."
        },
        {
            "text": "More in-depth statistical analysis of the effect of badger culling on cattle TB incidence is underway at the APHA and will be submitted for peer-reviewed publication in due course. This will take into account differences between areas (including confounding factors) that can affect the measured impact of culling."
        },
        {
            "text": "We appreciate that the badger cull is a controversial topic. It is important that this debate is informed by the best scientific analysis possible. More appropriate analysis of present data indicates the effectiveness of culling in the HRA in reducing cattle TB incidence."
        },
        {
            "text": "Figure 1: Annual Officially Tuberculosis Free – withdrawn (OTFw) incidence in the high risk area of England from 2015 to 2020. The data used are the most recently published dataset4,5 and contain no additional information from that used by Langton and colleagues,1 except for inclusion of the most recent year of data (September 2019–August 2020). The blue bar represents areas where no culling occurred during the entire period. Other colours show areas where culling commenced in a particular year. Note, for instance, that areas where culling started in 2016 (orange bars) had high incidence when culling started, but significantly lower incidences than unculled areas in subsequent years. A similar pattern is observed for the areas that started in other years."
        },
        {
            "text": " References"
        },
        {
            "text": "1 Langton TES, Jones MW, McGill I. Analysis of the impact of badger culling on bovine tuberculosis in cattle in the high-risk area of England, 2009–2020. Vet Rec 2022; doi:10.1002/vetr.1384"
        },
        {
            "text": "2 Jenkins HE, Woodroffe R, Donnelly CA. The duration of the effects of repeated widespread badger culling on cattle tuberculosis following the cessation of culling. Plos One 2010;5:e9090"
        },
        {
            "text": "3 Downs SH, Prosser A, Ashton A, et al. Assessing effects from four years of industry led badger culling in England on the incidence of bovine tuberculosis in cattle, 2013–2017. Sci Rep 2019;9:14666"
        },
        {
            "text": "4 APHA. Bovine TB in cattle: badger control areas monitoring report. For the period 2013 to 2020. https://bit.ly/3CE6Y5P (accessed 10 March 2022)"
        },
        {
            "text": "5 APHA. Bovine TB epidemiology and surveillance in Great Britain, 2020 Bovine tuberculosis in Great Britain. Surveillance data for 2020 and historical trends."
        },
        {
            "text": "https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/1027592/tb-GB-data-report-accessible-2020.ods"
        },
        {
            "text": "This blog was updated on 24th May 2022 and 7th June 2022 to amend respectively the text and the graph related to the areas where no culling took place."
        }
    ]
}