{
    "url": "https://forestrycommission.blog.gov.uk/2022/06/07/how-beavers-and-trees-can-support-our-waterways/",
    "title": "How beavers and trees can support our waterways",
    "authors": [
        "Matt Holden"
    ],
    "categories": [
        "Tree Planting",
        "Woodland creation"
    ],
    "pub_date": "2022-06-07T11:00:51+01:00",
    "content": [
        {
            "text": "Matt Holden is the Devon Beaver Project Lead for Devon Wildlife Trust. In this guest blog he introduces the work of Devon Wildlife Trust on beaver reintroduction in Devon, explores some of the myths and truths around beavers and trees, and considers how riparian buffer strips could help reduce beaver-human conflicts and enhance river corridors for a whole suite of species."
        },
        {
            "heading": 2,
            "text": "The River Otter Beaver Trial"
        },
        {
            "text": "The River Otter Beaver Trial (ROBT) has been a great success story in the return of beaver (Castor fiber) to England. The trial on the River Otter in East Devon (2015-2020) highlighted that the reintroduction of this keystone species offers the potential to enhance the biodiversity, water quality and flood resilience of our watercourses. Whilst some beaver-human conflicts were identified during the trial, natural and social science research found that the negative impacts were far outweighed by the benefits."
        },
        {
            "text": "The outcome of the ROBT was the official acknowledgement by Defra in August 2020 that the beavers could stay and expand naturally in the catchment."
        },
        {
            "heading": 2,
            "text": "Beavers and trees"
        },
        {
            "text": "Part of the research conducted during the ROBT was on the impacts of beavers on trees in the catchment. It involved identifying the species they prefer, the scale of the impacts and the options for protecting trees from beaver feeding. Alongside other research it has helped to define some important truths and myths associated with beavers and trees:"
        },
        {
            "heading": 3,
            "text": "Truths:"
        },
        {
            "heading": 3,
            "text": "Myths:"
        },
        {
            "heading": 2,
            "text": "The biodiversity benefits of beavers in riparian habitats"
        },
        {
            "text": "The fascinating thing about beavers is their capacity to engineer the riparian woodland and wetland habitats around them. Research from both the ROBT and more widely has demonstrated that foraging behaviour on woody vegetation alters the vegetation structure, opening up parts of the canopy and increasing the diversity of habitats for plants, birds, bats and a range of other terrestrial species. Beaver activity can also increase the abundance of standing and submerged dead wood which is increasingly recognised as being critically important for a wide range of terrestrial and aquatic species."
        },
        {
            "text": "A recent investigation into all the evidence on the ecological impacts of beavers has noted that, whilst there are some priority woodland habitats where beaver activity would need careful consideration, the benefits to biodiversity are overwhelmingly positive. Research continues in Devon and more widely in the UK, and we are getting increasing requests from researchers for access to beaver sites to conduct ecological investigations for several different species groups."
        },
        {
            "text": "In addition to research being conducted on the River Otter, Devon Wildlife Trust has been monitoring the ecological changes at our West Devon Beaver Enclosure Project for the past 11 years. A recent publication provides an intriguing update into the changes in vegetation, invertebrates, amphibians, birds and bats."
        },
        {
            "heading": 2,
            "text": "Making space for water and beavers"
        },
        {
            "text": "A key challenge identified in the ROBT is that the people who benefit from beaver reintroduction are not necessarily the ones who bear the brunt of the impacts. It is a priority for Devon Wildlife Trust to support farmers and landowners with the management of beaver activity. Currently this involves providing guidance and information, practical management of dams and the protection of important trees."
        },
        {
            "text": "Further information can be found in the Beaver Management Strategy Framework developed as part of the ROBT."
        },
        {
            "text": "One way to reduce or even eliminate these beaver-human conflicts is to make space for watercourses and wetlands by creating riparian buffer strips. As most of the challenges arise within 10-20m of water, in many places the size of these riparian buffers would be relatively modest. These riparian buffer strips allow space for natural processes to take hold, provide a natural corridor through the landscape and allow wildlife to flourish."
        },
        {
            "text": "Alongside potential ELMs based payments another exciting funding avenue for riparian buffer strips is through the Forestry Commission’s England Woodland Creation Offer (EWCO) – paying up to £4,800/ha for woodland creation that delivers riparian buffers, higher nature recovery benefits and improves water quality. EWCO is something that the Devon Wildlife Trust are currently investigating to support landowners in our area to make space for water and beavers. As it can be applied to riparian strips as narrow as 10m along watercourses and is BPS compatible, it’s a potential win-win situation for biodiversity and landowners."
        },
        {
            "heading": 2,
            "text": "The future for beavers in Devon"
        },
        {
            "text": "In Devon we are continuing to expand our work supporting communities and landowners who are living with and managing beavers. We are working towards a long-term vision for beavers in Devon, with an ambition for beavers across all major catchments. A growing focus of our work is on creating a space to share information and knowledge across England and Wales regarding our coexistence with beavers. An integral part of this is to develop and promote long-term strategies that financially reward landowners who make space for watercourses and the beavery habitats that develop."
        },
        {
            "text": "With wild beavers now expanding across nearly all other European countries, we are hopeful that we will see the return of this enigmatic species throughout the many rivers and streams in England."
        },
        {
            "heading": 2,
            "text": "Where to find more information"
        },
        {
            "text": "If you’d like more information and support on the management of beavers in Devon, contact the Devon Wildlife Trust ."
        },
        {
            "text": "Alternatively, if you’re located outside of the Devon area, you can contact your local Wildlife Trust."
        },
        {
            "text": "Further guidance on woodland creation and information on grants and available support is available from the Forestry Commission."
        },
        {
            "text": "Find out more about the Woodlands for Water riparian planting projects taking place in the South West Devon and Cornwall catchment – The Tamar and Fowey, and in the North East Devon and Somerset catchment – Torridge and Taw."
        },
        {
            "text": "Resources used in this blog: Brazier, R.E., Elliott, M., Andison, E., Auster, R.E., Bridgewater, S., Burgess, P., Chant, J., Graham, H., Knott, E., Puttock, A.K., Sansum, P., Vowles, A., (2020) River Otter Beaver Trial: Science and Evidence Report"
        },
        {
            "text": "Campbell-Palmer, Róisín & Gow, Derek & Campbell, Roo & Dickinson, Helen & Girling, Simon & Gurnell, John & Halley, Duncan & Jones, Simon & Lisle, Skip & Parker, Howard & Schwab, Gerhard & Rosell, Frank. (2016). The Eurasian Beaver Handbook: Ecology and Management of Castor fiber."
        }
    ]
}