{
    "url": "https://food.blog.gov.uk/2022/06/07/international-work-update-world-food-safety-day/",
    "title": "International work update on World Food Safety Day",
    "authors": [
        "Anjali Juneja, Director of International and UK Affairs"
    ],
    "categories": [
        "Our mission"
    ],
    "pub_date": "2022-06-07T10:00:39+01:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "Anjali Juneja, Director of International and UK Affairs, reflects on the FSA’s international work and explains how we are supporting this year’s World Food Safety Day theme of ‘safe food and better health’."
        },
        {
            "text": "I’m looking forward to discussing the FSA’s international work at the Board meeting next week."
        },
        {
            "text": "Following Brexit, the impact of COVID-19 and the launch of the new FSA strategy, now is a good opportunity for us to consider our international priorities. These will help frame our future international work programme for the year ahead. You can read my full Board paper and register to watch it being discussed on Wednesday 15 June."
        },
        {
            "text": "In this post, let me tell you about what we do internationally, and how we are supporting World Food Safety Day. This is an awareness day led by the global food safety and quality standards setting body Codex Alimentarius Commission."
        },
        {
            "heading": 2,
            "text": "International standards setting and sharing global best practice"
        },
        {
            "text": "Our international work plays a key role in the delivery of the FSA’s mission of ‘food you can trust’ as set out in the FSA strategy."
        },
        {
            "text": "As a convenor and collaborator, we use our expertise as an evidence generator to support development of science-based guidance and play our role internationally in multilateral conversations about food standards. For example, we are an active participant in Codex, the World Organisation for Animal Health (OIE) and the Organisation for Economic Co-operation and Development (OECD)."
        },
        {
            "text": "Our work on voluntary third-party assurance (vTPA) has recently resulted in the adoption of a global Codex guideline. Codex Chairperson Steve Wearne and Head of Codex Policy and Programme Mike O’Neill explain their role in this video, and how vTPA has become a modern regulatory approach that allow authorities to adjust their risk-based inspection model. I think this work is a superb example of how well the FSA works collaboratively with others across the world to help reach a global consensus on a food standard to protect consumer health and facilitate trade. I should say, we are immensely proud that seconded out Steve Wearne is Chairperson of the Codex Alimentarius Commission, after being elected last November."
        },
        {
            "text": "We also learn from other regulators so that best practice is applied in the UK. As the recent National Audit Office 'Regulating after Brexit' report says, we are increasing our engagement with the International Food Safety Authorities Network (INFOSAN) and have a seat on its advisory group. Together we help to establish best practice in food incident and crisis management processes."
        },
        {
            "heading": 2,
            "text": "Imported and exported food standards"
        },
        {
            "text": "Since joining the FSA in 2020, I have gained a greater appreciation of how we work with others, including Food Standards Scotland, to protect public health and support the UK economy and trade by ensuring UK food continues to have a strong reputation for safety and authenticity."
        },
        {
            "text": "Since exiting the EU our role has grown significantly. We have taken on new responsibilities, including the regulation of novel foods, advising the UK Government on new trade deals, and advising on and assuring standards for imported and exported food."
        },
        {
            "text": "In the field, day in and day out our meat hygiene inspectors and official veterinarians deliver inspections to ensure businesses in the meat industry meet their obligations regarding food safety and animal health and welfare, to protect consumers and in support of international trade. This and other enforcement work maintains the confidence of the public and our international trading partners in UK food."
        },
        {
            "heading": 2,
            "text": "World Food Safety Day"
        },
        {
            "text": "Everybody has a role to play in food safety – governments, food producers, business operators and consumers. World Food Safety Day helps raise awareness of the action each can take across the food system. To support it, we have launched a campaign to remind food businesses to continue improving food safety standards, following the impacts of COVID-19. We will point business to Safe food, better business, a popular food safety management system for businesses (Safe Catering in Northern Ireland) – so popular that other countries’ regulators adapt it for their own small businesses. For the campaign, which will be running for a number of months, we are working directly with our local authority partners and business community groups to drive up local business awareness of requirements and the support available."
        },
        {
            "heading": 2,
            "text": "Your comments and questions"
        },
        {
            "text": "Please let me know in the comments below what your views are on our international work. We always welcome insight from our followers, stakeholders and partners."
        },
        {
            "text": "And don’t forget you can tune in next week. If you have a question for the Board, you can email it to board.sec@food.gov.uk."
        },
        {
            "text": " "
        },
        {
            "heading": 1,
            "text": "Diweddariad ar ein gwaith rhyngwladol ar Ddiwrnod Diogelwch Bwyd y Byd"
        },
        {
            "text": "Dyma Anjali Juneja, Cyfarwyddwr Materion Rhyngwladol a’r Deyrnas Unedig, yn myfyrio ar waith rhyngwladol yr Asiantaeth Safonau Bwyd (ASB) ac yn esbonio sut rydym yn cefnogi thema Diwrnod Diogelwch Bwyd y Byd eleni, sef ‘bwyd diogel ac iechyd gwell’."
        },
        {
            "text": "Rwy’n edrych ymlaen at drafod gwaith rhyngwladol yr ASB yng nghyfarfod y Bwrdd yr wythnos nesaf."
        },
        {
            "text": "Yn dilyn Ymadael â’r Undeb Ewropeaidd (UE), effaith COVID-19 a lansiad strategaeth newydd yr ASB, dyma gyfle da i ni ystyried ein blaenoriaethau rhyngwladol. Bydd y rhain yn helpu i fframio ein rhaglen waith ryngwladol yn y dyfodol ar gyfer y flwyddyn i ddod. Gallwch ddarllen fy mhapur Bwrdd llawn a chofrestru i wylio’r Bwrdd yn trafod y papur ddydd Mercher 15 Mehefin."
        },
        {
            "text": "Yn y blog hwn, byddaf yn trafod yr hyn rydym yn ei wneud yn rhyngwladol, a sut rydym yn cefnogi Diwrnod Diogelwch Bwyd y Byd. Mae hwn yn ddiwrnod codi ymwybyddiaeth a arweinir gan y corff sy’n gosod safonau ansawdd a diogelwch bwyd yn fyd-eang, Comisiwn Codex Alimentarius."
        },
        {
            "heading": 2,
            "text": "Gosod safonau rhyngwladol a rhannu arferion gorau yn fyd-eang"
        },
        {
            "text": "Mae ein gwaith rhyngwladol yn chwarae rhan allweddol wrth gyflawni cenhadaeth yr ASB, sef ‘bwyd y gallwch ymddiried ynddo’, fel y nodir yn strategaeth yr ASB."
        },
        {
            "text": "Fel cynullydd a chydweithredwr, rydym yn defnyddio ein harbenigedd fel cynhyrchydd tystiolaeth i gefnogi datblygiad canllawiau sy’n seiliedig ar wyddoniaeth, a chwarae ein rhan yn rhyngwladol mewn sgyrsiau amlochrog am safonau bwyd. Er enghraifft, rydym yn gyfranogwr gweithredol yn Codex, Sefydliad y Byd ar gyfer Iechyd Anifeiliaid (OIE) a’r Sefydliad ar gyfer Cydweithrediad a Datblygiad Economaidd (OECD)."
        },
        {
            "text": "Mae ein gwaith ar sicrwydd trydydd parti gwirfoddol (vTPA) wedi arwain yn ddiweddar at fabwysiadu canllaw Codex byd-eang. Mae Cadeirydd Codex, Steve Wearnem a Phennaeth Polisi a Rhaglen Codex, Mike O’Neill, yn esbonio eu rôl yn y fideo hwn, a sut mae vTPA wedi datblygu’n ddull rheoleiddio modern sy’n caniatáu i awdurdodau addasu eu model arolygu ar sail risg. Rwy’n meddwl bod y gwaith hwn yn enghraifft wych o ba mor dda y mae’r ASB yn gweithio ar y cyd ag eraill ledled y byd i helpu i gyrraedd consensws byd-eang ar safonau bwyd i ddiogelu iechyd defnyddwyr a hwyluso masnach. Rydym yn hynod falch bod Steve Wearne, sydd ar secondiad, yn Gadeirydd Comisiwn Codex Alimentarius ar ôl cael ei ethol fis Tachwedd diwethaf."
        },
        {
            "text": "Rydym hefyd yn dysgu oddi wrth reoleiddwyr eraill fel bod arferion gorau yn cael eu cymhwyso yn y DU. Fel y dywed adroddiad diweddar y Swyddfa Archwilio Genedlaethol, ‘Rheoleiddio ar ôl Brexit’, rydym yn cynyddu ein gwaith ymgysylltu â’r Rhwydwaith Awdurdodau Diogelwch Bwyd Rhyngwladol (INFOSAN) ac mae gennym sedd ar ei grŵp cynghori. Gyda’n gilydd rydym yn helpu i bennu arferion gorau mewn prosesau rheoli digwyddiadau bwyd ac argyfyngau."
        },
        {
            "heading": 2,
            "text": "Safonau bwyd a fewnforir a bwyd a allforir"
        },
        {
            "text": "Ers ymuno â’r ASB yn 2020, rwyf wedi dod i werthfawrogi’n well sut rydym yn gweithio gydag eraill, gan gynnwys Safonau Bwyd yr Alban, i ddiogelu iechyd y cyhoedd a chefnogi economi a masnach y DU trwy sicrhau bod bwyd y DU yn parhau i fod ag enw da am ddiogelwch a dilysrwydd.\nErs ymadael â’r UE mae ein rôl wedi tyfu’n sylweddol. Rydym ni wedi ymgymryd â chyfrifoldebau newydd, gan gynnwys rheoleiddio bwydydd newydd, cynghori Llywodraeth y DU ar gytundebau masnach newydd a chynghori a sicrhau safonau ar gyfer bwyd sy’n cael ei fewnforio a’i allforio.\nYn y maes, o ddydd i ddydd, mae ein Milfeddygon Swyddogol ac Arolygwyr Hylendid Cig yn cynnal arolygiadau i sicrhau bod busnesau yn y diwydiant cig yn cyflawni eu rhwymedigaethau o ran diogelwch bwyd ac iechyd a lles anifeiliaid er mwyn diogelu defnyddwyr a chefnogi masnach ryngwladol. Mae hyn, a gwaith gorfodi arall, yn sicrhau bod y cyhoedd, a’n partneriaid masnachu rhyngwladol, yn parhau i fod yn hyderus am fwyd yn y DU."
        },
        {
            "heading": 2,
            "text": "Diwrnod Diogelwch Bwyd y Byd"
        },
        {
            "text": "Mae gan bawb ran i'w chwarae mewn diogelwch bwyd – llywodraethau, cynhyrchwyr bwyd, gweithredwyr busnesau a defnyddwyr. Mae Diwrnod Diogelwch Bwyd y Byd yn helpu i godi ymwybyddiaeth o’r camau y gall pob un eu cymryd ar draws y system fwyd. I gefnogi’r diwrnod, rydym wedi lansio ymgyrch i atgoffa busnesau bwyd i barhau i wella safonau diogelwch bwyd, yn dilyn effeithiau COVID-19. Byddwn yn cyfeirio busnesau at Fwyd Diogel, Busnes Gwell, system rheoli diogelwch bwyd boblogaidd i fusnesau (Arlwyo Diogel yng Ngogledd Iwerddon), sydd mor boblogaidd fel bod rheoleiddwyr gwledydd eraill yn ei haddasu ar gyfer eu busnesau bach eu hunain. Ar gyfer yr ymgyrch, a fydd yn cael ei chynnal am nifer o fisoedd, rydym yn gweithio’n uniongyrchol gyda’n partneriaid awdurdodau lleol a grwpiau busnesau cymunedol i godi ymwybyddiaeth ymysg busnesau lleol o’r gofynion, a’r gefnogaeth sydd ar gael."
        },
        {
            "heading": 2,
            "text": "Eich sylwadau a’ch cwestiynau"
        },
        {
            "text": "Rhowch wybod i mi yn y sylwadau isod beth yw eich safbwyntiau am ein gwaith rhyngwladol. Rydym bob amser yn croesawu mewnwelediad gan ein dilynwyr, rhanddeiliaid a phartneriaid."
        },
        {
            "text": "A chofiwch y gallwch chi wylio cyfarfod y Bwrdd wythnos nesaf. Os oes gennych gwestiwn i’r Bwrdd, gallwch ei anfon dros e-bost i: board.sec@food.gov.uk."
        }
    ]
}