{
    "url": "https://naturalengland.blog.gov.uk/2022/06/07/marine-net-gain-leaving-the-marine-environment-in-better-state/",
    "title": "Marine net gain – leaving the marine environment in better state.",
    "authors": [
        "Mel Hughes"
    ],
    "categories": [
        "Biodiversity",
        "Climate change",
        "Marine environment",
        "Uncategorized"
    ],
    "pub_date": "2022-06-07T15:09:27+01:00",
    "content": [
        {
            "text": "Defra has just opened a 12-week consultation, seeking views on the proposed aims and principles of marine net gain and how to best introduce a net gain approach to infrastructure and development in the marine environment. Natural England welcomes this consultation as we feel that net gain for marine development activities will be an important tool in helping meet our ambitious targets for net zero, helping to improve and restore our marine environment and contributing to ocean recovery. The amount of marine development is likely to increase significantly in the coming years, particularly in relation to offshore wind and the wider British Energy Security Strategy. It is vital that nature recovery is embedded within our approach to development and industry at sea, and marine net gain should be one of the key tools to achieve this."
        },
        {
            "text": "While there is already an approach to net gain on land, which will become mandatory for developers in 2023, this only applies to developments which are permitted under the Town & Country Planning Act, and therefore only applies to developments taking place on land, at the coast, or anywhere above low tide. However, the aim of this new approach is to ensure that developments at sea also deliver measurable benefits for nature."
        },
        {
            "text": "Net gain is based on the principle that the many benefits associated with development activities need not come at the expense of the environment. Indeed, net gain principles ensure that all development activities are accompanied by environmental improvements. This supports the commitments set out in the Government’s 25 Year Environment Plan to reverse the loss of biodiversity and ensure that developments leave the natural environment in a measurably better state than before. The marine net gain consultation explores options for securing strategic outcomes and asks questions about how best to achieve this."
        },
        {
            "text": "Natural England is pleased that net gain at sea is now being proposed by Defra and we will be working closely with them to help inform the approach, using our extensive expertise in developing net gain approaches on land and in the intertidal zone."
        },
        {
            "text": "Defra is seeking views on the aims and principles of net gain in the marine environment and how this could be delivered across English waters. We encourage you to participate and engage by responding to the consultation."
        },
        {
            "text": "There are still many unknowns around how marine net gain might eventually work, what legislative underpinning it could have and how it will interface with biodiversity net gain on land. However, there is a real urgency to setting a path that secures sustainable development and enables marine nature recovery and we look forward to engaging with Defra and stakeholders on this important new developing policy area."
        }
    ]
}