{
    "url": "https://homeofficemedia.blog.gov.uk/2022/06/07/smugglers-who-recruited-drivers-to-conceal-migrants-in-vans-brought-to-justice/",
    "title": "Smugglers who recruited drivers to conceal migrants in vans brought to justice",
    "authors": [
        "Home Office news team"
    ],
    "categories": [
        "Press release"
    ],
    "pub_date": "2022-06-07T16:03:11+01:00",
    "content": [
        {
            "text": "Two men who dangerously smuggled 31 illegal migrants into the UK, including seven children and a pregnant woman, have been sentenced to a combined 14 years in prison."
        },
        {
            "text": "Akan Brayan, of Nottingham, and Dylan Shwani, of Lincoln, were found guilty of recruiting drivers to hide migrants in hired vans containing various goods before smuggling them into the UK."
        },
        {
            "text": "The defendants, both aged 37, were sentenced at Nottingham Crown Court on 7 June 2022, following a five-year investigation by the Home Office’s Criminal and Financial Investigations (CFI) unit. They were each sentenced to seven years in prison."
        },
        {
            "text": "Between 2016 and 2018, Brayan and Shwani, paid six drivers from the Nottinghamshire and Lincolnshire areas to bring 31 Iraqi migrants, on six separate occasions, into the country."
        },
        {
            "text": "Although, the majority of the migrants were men, children as young as one and a pregnant woman were also found in the vans."
        },
        {
            "text": "People were crammed into the vehicles among stacks of tyres, second-hand furniture and household goods being transported to the UK. Photos show in one of the vans a woman cradling a small child, with other children sat around her in the tightly enclosed space."
        },
        {
            "text": "CFI teams found boxes of goods deliberately placed to hide people as well as paprika on the floor of one of the vans in an attempt to confuse sniffer dogs from detecting the migrants’ scents."
        },
        {
            "text": "Minister for Justice and Tackling Illegal Migration, Tom Pursglove MP said:  "
        },
        {
            "text": "Ben Thomas, Deputy Director for Immigration Enforcement’s  Criminal and Financial Investigations, said:"
        }
    ]
}