{
    "url": "https://deframedia.blog.gov.uk/2019/07/15/telegraph-the-environment-secretary-on-government-reforms-to-boost-recycling/",
    "title": "Telegraph: The Environment Secretary on government reforms to boost recycling",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2019-07-15T11:03:16+01:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "There is coverage in the Telegraph today (15 July) as part of their ‘Zero Waste’ campaign, which reports that more than two thirds of the packaging in consumers' weekly shops is not recyclable or has confusing labelling. The findings come from a snapshot survey in which the paper monitored the weekly shop of four families from major supermarkets, and featuring the experience of the Rutherfords who live in Notting Hill."
        },
        {
            "text": "The coverage notes that the Environment Secretary has pledged to introduce consistent recycling collections, as well as clear labelling, so households know what they can recycle."
        },
        {
            "text": "Environment Secretary Michael Gove said:"
        },
        {
            "text": "“I commend the Telegraph for shining a spotlight on this important issue. The experiences of these families is an all too familiar one for lots of households across the country."
        },
        {
            "text": "“Supermarkets have a clear responsibility to cut unnecessary packaging, but we are also fully committed to playing our part as the government."
        },
        {
            "text": "“That’s why I have set out ambitious plans to end the confusion over recycling. Through our game-changing Resources and Waste Strategy, we will introduce consistent recycling for all households, as well as consistent labelling on packaging so consumers know what they can recycle.”"
        },
        {
            "text": "The Telegraph online also carries an op-ed from the Environment Minister, looking at our landmark Resources and Waste Strategy, which sets a blueprint for overhauling the recycling system and cutting unnecessary packaging. The Minister writes that, through our Strategy, “…if packaging is harder to recycle, producers will pay more. This, along with plans for a tax on plastic packaging that does not meet a minimum recycled content of at least 30%, will galvanise a new age in sustainable packaging design.”"
        },
        {
            "text": "The coverage forms part of the Telegraph’s ‘Zero Waste’ campaign launched last month, aimed at consumers, businesses, and government, to cut waste and drive-up recycling."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}