{
    "url": "https://naturalengland.blog.gov.uk/2021/07/21/biodiversity-metric-3-0-a-milestone-moment-for-biodiversity-net-gain/",
    "title": "Biodiversity Metric 3.0 – a milestone moment for biodiversity net gain",
    "authors": [
        "Mel Hughes"
    ],
    "categories": [
        "Biodiversity"
    ],
    "pub_date": "2021-07-21T16:23:02+01:00",
    "content": [
        {
            "text": "Publishing Biodiversity Metric 3.0 was a landmark moment for biodiversity net gain, it will become the metric used to calculate and evidence whether a project has achieved the biodiversity net gain requirements set out in the Environment Bill. Biodiversity Net Gain (BNG) is:"
        },
        {
            "text": "an approach to development, and/or land management, that leaves nature in a measurably better state than beforehand"
        },
        {
            "text": "Metric 3.0 measures that change. It calculates the existing baseline value of a site and its predicted future biodiversity value, including any contributions provided by creating or enhancing habitats offsite."
        },
        {
            "text": "\nDeveloped with input and support from specialists in Natural England, the Environment Agency, Forestry Commission, environmental NGOs, professional ecologists, developers, Local Planning Authorities and land managers, Metric 3.0 updates and replaces an earlier beta test version released for consultation in 2019, and which has since been downloaded almost 20,000 times."
        },
        {
            "text": "Metric 3.0 significantly updates and improves that earlier metric. It encourages users to create and enhance habitats where they are most needed to help establish or improve ecological networks through rural and urban landscapes. By linking to current and future habitat plans and strategies, including the future Local Nature Recovery Strategies (LNRS), Metric 3.0 incentivises habitat creation and enhancement where most needed, for example intertidal developments establishing new areas of saltmarsh."
        },
        {
            "text": "It also ‘rewards’ landowners who undertake work early, creating or enhancing habitats in advance, allowing them to generate more biodiversity units from their land. We urgently need to be creating new or better-quality habitats now to address the nature emergency we face and Metric 3.0 rewards those who do this."
        },
        {
            "text": "Re-wilding is an exciting new environmental practice that has emerged into the mainstream as Metric 3.0 has been developed. Re-wilding, by its nature, is less certain in the outcomes that will be achieved than traditional conservation management approaches. However, by taking a precautionary approach, Metric 3.0 can be applied to such schemes and be used to account for the mosaic habitats likely to evolve. Landowners may even find that they end up with ‘bonus’ biodiversity units to sell as biodiversity net gain if the re-wilding scheme creates more distinctive habitats than anticipated."
        },
        {
            "text": "Condition assessment approaches have also been significantly updated and simplified for Metric 3.0 and some key changes made, for example removing references to ragwort as a condition indicator from grassland and scrub habitats."
        },
        {
            "text": "Metric 3.0 is also fully transparent and not intended to replace ecological judgement. If a surveyor identifies a habitat parcel that is significantly different in value than the scores within the metric would suggest, they should use their professional judgement and select an alternative habitat type that better reflects the value found on site. For example, an exceptionally nature-rich field margin might be better entered as a parcel of scrub or grassland habitat. A comments section is included within the metric to allow the surveyor to justify the choice they have made."
        },
        {
            "text": "In developing Metric 3.0 we ran over 1.3 million metric calculations to ensure habitats were not ‘scoring’ unduly highly or lowly in different scenarios. We took advice from our own and other experts and, where needed, adjusted some habitat scores (compared to version 2.0) to better reflect their ecological value. We do recognise that we will continually learn from our use of the metric in future scenarios and are keen to keep the conversation going."
        },
        {
            "text": "However, Metric 3.0 is not a silver bullet which can immediately solve and address all the challenges the natural environment faces. Neither it, nor the overarching biodiversity net gain policy, changes or replaces existing protections and measures that are in place for our rarest and most threatened species, habitats, or nationally designated sites. This tool should therefore not be seen as a mechanism to circumvent the planning process, gaining permissions where they would not previously have been given."
        },
        {
            "text": "What Metric 3.0 does ensure, however, is that all habitats, from street trees to woodlands, green roofs to grasslands are recorded, scored and valued for their importance for wildlife. At the same time, it provides an evidence-based, transparent, consistent and easy to use way of ensuring that nature is considered within the design of developments and in land management practice, leaving nature in a better place than it was before, benefitting wildlife, people and places."
        }
    ]
}