{
    "url": "https://hmlandregistry.blog.gov.uk/2021/07/21/complex-and-challenging-why-land-registration-takes-time-to-master/",
    "title": "Complex and challenging: why land registration takes time to master",
    "authors": [
        "Frank Gough, Deputy Director – Operations Strategy and Planning"
    ],
    "categories": [
        "Working at HM Land Registry"
    ],
    "pub_date": "2021-07-21T14:39:56+01:00",
    "content": [
        {
            "text": "At HM Land Registry, we regularly consult with our customers and know what they value most: our expert colleagues and ease of doing business with us. They also appreciate consistency and getting things done in a reasonable timeframe. We know delays to complex register create requests cause frustration and want to assure our customers we are working hard to reduce waiting times."
        },
        {
            "heading": 2,
            "text": "Turbulent times"
        },
        {
            "text": "The last couple of years have been pretty turbulent for everyone, especially with the impact of coronavirus (COVID-19). Despite this, we have stayed open for business and our activity has remained buoyant, even with surges in the property market leading to increased workloads for all."
        },
        {
            "text": "We’ve taken careful decisions to balance our focus on different types of work, wherever possible prioritising applications that enable property transactions, especially expedites."
        },
        {
            "text": "While the resource and capability issues we have faced in previous years continue to present challenges to operational delivery, we are working to overcome them through our digital transformation and investment in recruitment.  In 2019/20 we recruited more than 500 caseworking colleagues and delivered individual technical training to more than 640 members of staff at all grades. Our aim for 2021/22 is to optimise our operational capacity and we are recruiting a further 650 members of staff, including directly into the executive caseworker grade, with more than 1,200 members of staff receiving technical training during the course of the year."
        },
        {
            "heading": 2,
            "text": "With high levels of recruitment, why do delays persist?"
        },
        {
            "text": "The answer to this is time: there is no shortcut to becoming a land registration expert."
        },
        {
            "text": "Pascal Lalande, Central Operations Manager for registration practice and policy, says:"
        },
        {
            "text": "Basic training courses at entry, executive and higher executive officer level are generally 12 weeks each in duration, followed by a period of consolidation that can last many months, depending on the nature and complexity of the casework area, availability of cases and colleagues’ individual work patterns. This gives a general grounding and the ability to work on specific casework types according to the caseworker’s grade, but there will always be a need to refer complex, knotty points of practice to more senior colleagues."
        },
        {
            "text": "Senior Registration Executive Chris Bellwood says:"
        },
        {
            "text": "As well as updating the register, caseworkers must learn how to interpret and create title plans for new registrations, including leases and sales of land out of larger estates. We base these on the Ordnance Survey map and have various digital tools at our disposal, including a new training database to help support spatial awareness and plans techniques. It is a skilled job and takes patience, practice and support."
        },
        {
            "heading": 2,
            "text": "Investment in training"
        },
        {
            "text": "All training is done in-house and was traditionally delivered in each of our 14 local offices across England and Wales, but recently we have designed and implemented a national online technical training infrastructure. Last year, around 5,000 colleagues attended sessions, developing expertise across grades and helping around 490 colleagues to progress to more senior roles."
        },
        {
            "text": "During the pandemic this investment in training has continued, firstly in trialling, then delivering large-scale technical training to colleagues who are working and learning from home, as well as onboarding new recruits remotely. In April we launched the Land Registration Academy, which will provide a foundation and framework to develop and increase knowledge and expertise. Currently, 600 colleagues are upskilling through the range of methods the academy offers."
        },
        {
            "text": "Chief Operations Officer Chris Pope says:"
        },
        {
            "heading": 2,
            "text": "So, what does this mean for our customers?"
        },
        {
            "text": "We have assembled many of the elements we need to improve our service speeds: more registration experts, enhanced systems and new digital tools, including artificial intelligence and robotic automation, designed to reduce routine updates and allow focus on complex applications.  Combined, these activities will enable us to bring down our stock of applications."
        },
        {
            "text": "We are making significant progress in our transformation to a 21st-century land registry, but it will take time for these changes – human or otherwise – to bed in. In the meantime, new services such as our award-winning Digital Registration Service, View My Applications and Estimated Completion Date will help ensure applications are lodged right first time and provide a quick, clear overview of your cases as they progress."
        }
    ]
}