{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2021/07/21/engineers-in-leadership-talking-with-alison-baptiste-cbe/",
    "title": "Engineers in Leadership: Talking with Alison Baptiste, CBE",
    "authors": [
        "Eleanor Voss"
    ],
    "categories": [
        "Blog Series",
        "Diversity & Inclusion",
        "Guest Blog"
    ],
    "pub_date": "2021-07-21T11:49:13+01:00",
    "content": [
        {
            "text": "On International Women in Engineering Day - on June 23rd - the GSE Diversity and Inclusion Action Group and the Engineering in Policy network spoke with Alison Baptiste about being an engineer."
        },
        {
            "text": "Alison is Director of Public and Security Services at the Infrastructure and Projects Authority. She is also a Chartered Engineer and Fellow of the Institution of Civil Engineers. During her career Alison has worked in the private and public sectors and now is responsible for setting the overall strategic direction and leadership for the expert project delivery support of the Government’s critical infrastructure projects and programmes."
        },
        {
            "text": "We talked with Alison about her role and career, how being an engineer has shaped her approach to her work, and any advice Alison has for other GSE members. Due to interest in this event, we summarised our conversation with Alison to share more widely."
        },
        {
            "text": "In advance of the event we asked GSE engineers from across government to share their job titles. We found that there is a huge diversity of roles held by GSE engineers."
        },
        {
            "heading": 3,
            "text": "Why did you choose civil engineering?"
        },
        {
            "text": "I liked maths and physics, but I also liked being outside and wanted to travel. Engineering has given me all of that. I was told at school that not many girls choose engineering. It was true then and still is now, but it's a fantastic career for anyone."
        },
        {
            "text": "I saw the impact engineering can have when I went to Nepal to build water wells so that women didn’t have to walk a long way each day. The technical side of engineering is certainly good, but what drives me is the positive outcomes for people’s lives."
        },
        {
            "heading": 3,
            "text": "How does your engineering background influence your work now? "
        },
        {
            "text": "Engineering can be a foundation for strategic leadership. I’m not doing detailed design anymore but I am using the broader engineering skill set of focusing on outcomes and seeing the big picture. I still consider myself an engineer!"
        },
        {
            "text": "My background gives me credibility when presenting technical information and evidence. But the technical side must be coupled with the political and social aspects of decisions - together they are a powerful combination."
        },
        {
            "heading": 3,
            "text": "What are the differences between the private and public sector approaches to engineering?"
        },
        {
            "text": "I was in the private sector for eight years and then was seconded to the Environment Agency and decided to stay."
        },
        {
            "text": "At junior levels, the private sector encourages technical specialisation, whereas the public sector encourages breadth - looking at the social and political aspects of a project. However, at senior levels in the private sector that breadth is there too. It's needed to deliver the whole solution to clients."
        },
        {
            "text": "The focus on profit in the private sector can mean that it has a sharper focus on outcomes and cost than the public sector. The public sector can be slow to make changes. However, the public sector has the strength of bringing in all perspectives. The combination of private and public sector approaches can be fantastic."
        },
        {
            "heading": 3,
            "text": "What advice do you have for people with a technical background that want to move into leadership roles?"
        },
        {
            "text": "There should be more scientists and engineers at senior levels and having a technical background is not a restriction. Engineering is about seeing outcomes and the big picture, and sometimes it is important to be able to let go of the purely technical perspective. The right technical answer might miss the social or political context. When talking with Ministers I like to say “as an engineer, this is the technical answer and here's how we can adapt it to meet your broader objectives”."
        },
        {
            "text": "I worked on a rice field irrigation project in Indonesia. The engineers wanted to put the hydraulic system in the best place for technical efficiency. But this location wasn’t right for the local community. After the engineers left, the local community just moved it! The desired outcome was not to get the irrigation system to be as efficient as possible, the desired outcome was to irrigate the fields."
        },
        {
            "heading": 3,
            "text": "What advice do you have about how to choose new roles?"
        },
        {
            "text": "Take time to reflect on where you shine and keep moving in that direction. I like to think about where I am thriving and where I am adding value."
        },
        {
            "text": "Each year I build in time to think about what is working for me, for my career and for my family. It is about balance between work and homelife and sometimes the balance needs to change. I worked part time whilst my children were young, but it's not held me back. Sometimes now isn’t the right time to take something on, but that doesn't mean that it will never be."
        },
        {
            "text": "If you would like to get involved in the Engineering in Policy network you can view the website, sign up to email updates, join the LinkedIn group or get in touch at info@engineeringinpolicy.org.uk."
        },
        {
            "text": "If you would like to get involved with GSE Diversity and Inclusion Action Group (DIAG) email gse@go-science.gov.uk. You can also look out for the DIAG role modelling blog series to help you think about how to be a role model yourself."
        }
    ]
}