{
    "url": "https://kingsawards.blog.gov.uk/2021/07/21/everything-you-need-to-know-about-the-queens-awards-for-enterprise/",
    "title": "Everything you need to know about The Queen's Awards for Enterprise",
    "authors": [
        "The Queen's Awards for Enterprise"
    ],
    "categories": [
        "Advice",
        "Assessors",
        "Enterprise promotion",
        "Innovation",
        "International trade",
        "Judges",
        "London",
        "Lord-Lieutenants",
        "North East",
        "North West",
        "Northern Ireland",
        "Promoting opportunity",
        "Queen's Award",
        "Queen's Awards",
        "queens awards",
        "queensawards",
        "Scotland",
        "social mobility",
        "socialmobility",
        "South East",
        "South West",
        "Sustainable development",
        "sustainable fashion",
        "Wales",
        "West Midlands",
        "Winners",
        "Yorkshire and the Humber"
    ],
    "pub_date": "2021-07-21T16:40:57+01:00",
    "content": [
        {
            "heading": 1,
            "text": "The UK's most prestigious business award!"
        },
        {
            "text": "The Queen’s Awards for Enterprise are the most prestigious awards for UK businesses and is a globally recognised royal seal of approval for UK companies."
        },
        {
            "text": "The Queen's Award to Industry, the scheme's original title, was instituted by Royal Warrant in 1965, with the first Awards announced in 1966. It later became known as the Queen's Awards for Export and Technology in 1975, before becoming the Queen's Awards for Enterprise in 1999."
        },
        {
            "text": "Since the Award’s inception in 1965 more than 7,000 companies have won a Queen’s Award."
        },
        {
            "heading": 2,
            "text": "Contact The Queen’s Awards Office"
        },
        {
            "text": "Email: queensawards@beis.gov.uk"
        },
        {
            "text": "Telephone Helpline: 020 7215 6880"
        },
        {
            "text": "Website: www.gov.uk/queens-awards-for-enterprise"
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "About the Awards"
        },
        {
            "text": "The Queen’s Awards for Enterprise recognise outstanding achievements across four categories:"
        },
        {
            "text": "This year, we had the following winners across all four categories:"
        },
        {
            "text": "The Queen’s Awards for Enterprise is a self-nominating process and is open to almost all businesses across the UK, of all sizes and in every sector."
        },
        {
            "text": "It is free to enter and applying for QA is a straightforward online process.  We are currently open for applications and the closing date is midday on the 22nd of September. "
        },
        {
            "text": "You can apply here: https://www.gov.uk/queens-awards-for-enterprise/how-to-apply"
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "The Awards Process"
        },
        {
            "text": "The application process is managed by the Queen’s Awards Office at the Department of Business, Energy and Industrial Strategy."
        },
        {
            "text": " The 2022 round of applications opened on 1 May and closes at midday on 22 September this year. Once the application round closes, the application forms are then assessed by teams of independent assessors, with experience and expertise in each specific category."
        },
        {
            "text": "In November those applicants that have been shortlisted by assessors are notified and asked to provide independent verification of the financial figures they provided in their application forms."
        },
        {
            "text": "Applicants are also notified that due diligence checks are to be carried out on each of the shortlisted companies."
        },
        {
            "text": "In January and February the assessors’ recommendations in each of the four categories are examined by the relevant judging panels. A list of recommendations is then sent to the Prime Minister for consideration before finally being submitted to Her Majesty the Queen for her personal approval."
        },
        {
            "text": "Unsuccessful applicants also receive feedback on the strengths of their application and guidance about how to improve future entries. Many find the comprehensive feedback useful and regularly feedback to us saying that they found the whole process great for reflecting on their business."
        },
        {
            "text": "The winners are announced to the national and regional press on Her Majesty The Queen’s birthday - 21 April and their awards are valid for 5 years. The application process then starts again."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "The Awards Criteria"
        },
        {
            "text": "To apply for the Queen’s Award for Enterprise your organisation must:"
        },
        {
            "text": "Your organisation can be a business or non-profit."
        },
        {
            "text": "Each of the award categories has additional entry criteria."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "heading": 4,
            "text": "International Trade"
        },
        {
            "text": "To apply for the International Trade award, you must also"
        },
        {
            "heading": 3,
            "text": "Innovation"
        },
        {
            "text": "To apply for the Innovation award, you must also:"
        },
        {
            "text": "Your innovation should be in one of the following categories:"
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Sustainable Development"
        },
        {
            "text": "To apply for the Sustainable Development award, you must also:"
        },
        {
            "heading": 3,
            "text": "Promoting Opportunity through social mobility"
        },
        {
            "text": "To apply for this award, your organisation must also have supported people from dis"
        },
        {
            "text": "advantaged backgrounds in improving their job skills and their chances of finding work."
        },
        {
            "text": "This includes doing one or more of the following, for at least 2 years:"
        },
        {
            "text": "You’ll need to prove the benefits for:"
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Award Benefits"
        },
        {
            "text": "The Queen’s Awards for Enterprise Emblem is a trusted mark that provides immediate and long-term business benefits. The use of the prestigious Queen’s Awards Emblem is a recognised Royal endorsement that will get your business noticed, above and beyond the competition, both at home and overseas."
        },
        {
            "text": "Winning businesses are permitted to fly The Queen’s Awards flag at their main office, and use the esteemed Queen’s Awards for Enterprise emblem on products and stationery for the next 5 years."
        },
        {
            "text": "Feedback from previous winners suggests that winning a Queen’s Award for Enterprise can benefit businesses with;"
        },
        {
            "text": "Each winning company is formally presented with a Grant of Appointment scroll and a commemorative crystal bowl by Her Majesty’s Lord Lieutenant, The Queen’s personal representative, at their premises or other selected location at a time suitable to both.  Representatives of the winning organisations are also invited to attend a Royal Reception."
        },
        {
            "text": "\n"
        },
        {
            "heading": 3,
            "text": "Social Media"
        },
        {
            "text": "Follow us on social media to keep up to date"
        },
        {
            "text": " "
        },
        {
            "text": "with our communications and learn more about The Queen's Awards and its winners!"
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": "Follow us on Twitter: @TheQueensAwards\nFollow us on LinkedIn : @the-queens-awards-for-enterprise\nVisit our website: https://www.gov.uk/queens-awards-for-enterprise\nVisit our blog: https://queensawards.blog.gov.uk/\nVisit our YouTube: https://www.youtube.com/channel/UCtdAYPr2hRqK8aXNFdlNOwQ/videos"
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}