{
    "url": "https://sfadigital.blog.gov.uk/2021/07/21/from-academic-research-to-user-research-6-months-in-the-apprenticeship-service/",
    "title": "From academic research to user research – 6 months in the Apprenticeship Service",
    "authors": [
        "Daniel Clayton"
    ],
    "categories": [
        "Agile",
        "Apprenticeship service",
        "Public sector",
        "User research"
    ],
    "pub_date": "2021-07-21T08:59:09+01:00",
    "content": [
        {
            "text": "The last 18 months of my life have been dominated by several key events: the formal completion of my doctoral studies, the country being placed into lockdown in response to the COVID-19 pandemic, and finally, joining the Department for Education as a user researcher. It goes without saying that how I have experienced my time in government has been greatly influenced by the first two events. I’ve often heard the argument made that research is research regardless of context, sector or industry. Drawing on my own experiences I would stand in opposition to such claims. My entry into digital research involved something of a culture shock that required substantial adjustment, but it also enabled a deeper learning as a researcher that had been absent during my academic journey."
        },
        {
            "heading": 2,
            "text": "Making the leap"
        },
        {
            "text": "When your PhD thesis is accepted you are bestowed with the highest possible academic degree and earn the title of \"Doctor\". It is the culmination of 4 years of solid research and the synergising of this work into an 80,000 word document. Essentially, the equivalent of a book. Looking back, I’m still not sure how I did it. But beyond the academic title and feeling of pride, the ultimate result was the learning of how to do research. I had become a professional researcher. However, this process had involved following specific practices constrained by rigid expectations to produce work destined for an academic context. Nevertheless, I began the expected journey of a new academic by undertaking a fellowship, conducting research, and producing papers. It was only after I started doing research in a digital and government environment that I begin to fully appreciate how narrow this learning had been."
        },
        {
            "text": "During my PhD I had often wondered about my role as researcher. Just how was my work helping to improve society? Contributing to the existing body of academic literature was not enough. I wanted to do research that was directly beneficial to people. Not to society but to actual people. I quickly understood that all roads lead out of academia if I wanted to do this. Six months after formally completing my doctoral studies I joined the Department for Education as a user researcher."
        },
        {
            "heading": 2,
            "text": "Picking up the pace and learning to be agile"
        },
        {
            "text": "On entry into the Department, I was excited by both the prospect of researching \"users\" but equally thrown by the different approaches to (and expectations of) research. Following core Agile principles in government, research occurs in rounds where the recruiting, conducting, analysing and reporting of findings is condensed into a matter of weeks. This can be sharply contrasted with academic research which can take place over several years. I had to adapt, and adapt quickly."
        },
        {
            "text": "Another aspect of Agile working that was completely alien to me was the close collaboration with colleagues. Research in academia can be deeply isolating with individual researchers holed up in their offices and only seeing colleagues when they venture out to grab a cup of coffee. I was now part of a team, and a truly multi-disciplinary one at that. On joining the Find Apprenticeship Training team I was introduced to the product owner, delivery manager, business analyst, UX designer, content writer, testers and developers. Pretty dizzying for someone who had the idea of siloed working ingrained into them. Despite it appearing that these different backgrounds had been thrown together at random, I quickly understood I had joined a well-oiled machine where communication, collaboration and transparency were key. I found this was especially important as I took my place as part of the design cycle working closely with the team’s UX designer and content writer. The contrast with my academic experience is that during the last 6 months I have felt more connected with colleagues who I have never physically met than during my entire academic journey."
        },
        {
            "heading": 2,
            "text": "Responding to Covid-19"
        },
        {
            "text": "My transition to doing research with users in a digital environment transcended a mere change of context. The change to \"normality\" brought about by the Covid-19 pandemic didn’t just impact how I worked with colleagues but also how I did my research. For example, I quickly had to get to grips with remote usability testing with actual users of the service. This necessitated not only learning new methods and ways of researching but also saw me develop a deeper empathy with those I was researching. In an academic environment the people being researched are known individually as \"participant\" or \"respondent\", and collectively as a \"sample\"."
        },
        {
            "text": "Researching users enlightened me to the numerous challenges faced by the people using our service and how the additional difficulties brought about by the pandemic impacted their daily lives. These were not just numbers representing a sample but real people facing real hardships. Using research to advocate for their needs has allowed me to impact people’s lives more directly. Ultimately, this is why I set out to do research in the first place."
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}