{
    "url": "https://taxagents.blog.gov.uk/2021/07/21/legislation-day/",
    "title": "Legislation Day",
    "authors": [
        "Alison Walsh"
    ],
    "categories": [
        "News and Updates"
    ],
    "pub_date": "2021-07-21T14:06:27+00:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "The government published draft legislation to be included in Finance Bill 2021-22 yesterday, alongside a number of consultation responses, consultations and various tax policy announcements."
        },
        {
            "text": "We are grateful to the agent community for your constructive comments and suggestions on these measures and welcome your ongoing scrutiny of the draft legislation and further areas we are consulting on."
        },
        {
            "text": "We’ve published:"
        },
        {
            "text": "• a summary of responses and draft legislation on notification of an uncertain tax treatment by large businesses. We’ve made changes to the proposal based on the responses we received during a further period of consultation"
        },
        {
            "text": "• a summary of responses with accompanying explanatory notes on proposals to clamp down on promoters of tax avoidance schemes. The draft legislation has been published after consideration of these responses and is open for consultation until 14 September"
        },
        {
            "text": "• a consultation on Basis period reform which proposes a simplification of the income tax rules for allocating trading profit to tax years, making the rules fairer for small businesses, more logical and easier to understand"
        },
        {
            "text": "• a summary of responses to the consultation 'sanctions to tackle illicit tobacco' and draft legislation to introduce three new sanctions"
        },
        {
            "text": "• draft legislation on powers to tackle electronic sales suppression (ESS). The new powers and penalties will make offences of possessing, making, supplying and promoting ESS software and hardware"
        },
        {
            "text": "• a summary of responses to the call for evidence on ‘Modernisation of the Stamp Taxes on Shares Framework’ published in July 2020. We are exploring the feasibility and implications associated with the key priority areas identified during the consultation, including by setting up a working group to work collaboratively with stakeholders"
        },
        {
            "text": "• a summary of responses and part of the draft legislation to introduce a regime for the taxation of Asset Holding Companies (AHC), and certain payments that AHCs elected into the regime may make. We are keen to engage again with stakeholders to resolve open aspects of the policy design and will be setting up a working group for this purpose."
        },
        {
            "text": "• a summary of responses to a consultation published earlier this year on VAT and value-shifting, which proposed prescribing rules for how considerations must be apportioned when items with different VAT liabilities are supplied for a single price. We are now engaging further with stakeholders to explore concerns raised and obtain more information"
        },
        {
            "text": "• a summary of responses to the call for evidence published in December 2020 on the VAT sharing economy which tested the government’s view of the VAT challenges created by the growth of the sharing economy"
        },
        {
            "text": "• a summary of responses to the call for evidence published in August 2020 on VAT - grouping establishment, eligibility and registration which gathered views from businesses that utilise VAT grouping provisions, and other interested parties, on how these affect them and the wider business environment"
        },
        {
            "text": "• a summary of responses to a paper on VAT and the public sector: reform to VAT refund rules which outlined potential reform to the way public bodies manage their VAT affairs"
        },
        {
            "text": "• a summary of responses to the consultation ‘Increasing the Normal Minimum Pension Age (NMPA) : Consultation on implementation’ and draft legislation to increase the NMPA from age 55 to 57 in 2028."
        },
        {
            "text": "Other changes include:"
        },
        {
            "text": "• extending the information and notice deadlines for ‘scheme pays’ where an individual asks their pension scheme to settle their annual allowance charge of       £2,000 or more from a previous tax year by reducing their future pension benefits"
        },
        {
            "text": "• making a technical change to the hybrid and other mismatch rules. The change will ensure that the legislation applies to certain types of entities that are seen as transparent in their home jurisdictions, including US Limited Liability Corporations, in the same way as it does to partnerships"
        },
        {
            "text": "• amending tax rules applying to Real Estate Investment Trusts (REITs) including some of the conditions that determine whether a company qualifies to be a    UK REIT"
        },
        {
            "text": "• amending the allowance statement requirements for the Structures and Buildings Allowance to include the date on which qualifying expenditure is incurred (or treated as incurred) where this is after the asset is brought into non-residential use, to avoid lost relief"
        },
        {
            "text": "• moving the criteria to determine Insurance Premium Tax (IPT) from the Financial Services & Markets Act 2000, to IPT legislation. This allows for risks  outside the UK to be exempt from UK IPT"
        },
        {
            "text": "• an announcement on the Government’s intention to lay a statutory instrument to put the taxable status of payments for the COVID Winter Grant/Local Grant schemes and similar schemes in the Devolved Administrations beyond doubt, confirming that they are exempt from income tax."
        },
        {
            "text": "• an announcement that the Government will legislate in the Autumn to ensure that the new Child Winter Heating Assistance and the Short Term Assistance social security payments made by the Scottish Government will not be subject to income tax (as provided for in the 2016 Fiscal Framework)."
        },
        {
            "text": "• the Government also announced its intention to legislate in the Autumn to ensure that payments made by the London Capital & Finance Compensation Scheme will not be subject to Capital Gains Tax."
        },
        {
            "text": "• finally, we also published research on the Impact of Making Tax Digital (MTD) for VAT which covers a range of topics including the costs and benefits experienced by MTD for VAT customers in joining and operating MTD. It highlights a number of positive findings, further supporting that MTD can deliver a range of benefits for those that use it."
        },
        {
            "text": "Full details of these announcements are available."
        }
    ]
}