{
    "url": "https://socialcare.blog.gov.uk/2021/07/21/reshaping-health-and-care-with-data/",
    "title": "Reshaping health and care with data",
    "authors": [
        "Michelle Dyson",
        "Matthew Gould"
    ],
    "categories": [
        "Consultations and surveys",
        "Information sharing",
        "Innovation"
    ],
    "pub_date": "2021-07-21T16:13:48+00:00",
    "content": [
        {
            "heading": 2,
            "text": "A chance to improve health and care data"
        },
        {
            "text": "While the COVID-19 pandemic has brought significant challenges for social care, it has also highlighted opportunities to provide better care. It has shown that better use of data and technology has the potential to empower individuals to take control of their own health and care, help them to live independently, and give social care staff an accurate view of the people in their care."
        },
        {
            "text": "Our draft strategy, ‘Data saves lives: reshaping health and care with data’, outlines the important steps we are taking towards the integration of health and adult social care services, using data, which will support social care providers, service users and commissioners. In this blog, we look at the potential of data to help each of these in turn:"
        },
        {
            "text": "Timely and secure access to information leads to more seamless care and the right decisions being made at the right time. Our strategy commits to supporting adult social care staff by accelerating the adoption of digital social care records and making sure they integrate with shared care records by 2024."
        },
        {
            "heading": 2,
            "text": "Support for social care providers"
        },
        {
            "text": "We showed how much impact this can have during the pandemic, when we set up a  summary care record with additional information (SCR-AI) for 92% of people in England. This revolutionised the speed at which health and care staff could access health records, with an individual’s consent, wherever they were in England."
        },
        {
            "text": "Better access to information is only part of the story. We also want care providers and local authorities to have the confidence to invest in innovations proven to benefit staff and service users. The pandemic drove improvements in how care homes made use of digital."
        },
        {
            "text": "Upgrading internet connectivity and equipping over 10,000 care homes with ipads enabled residents to not only speak to their GP through video consultation, but also to have much needed contact with family and loved ones. We will continue to upgrade those care homes with the slowest internet connections and embed the use of technologies that can support better care."
        },
        {
            "text": "We are also committed to improving the data and digital literacy of the adult social care workforce. Frameworks and training will set out what good digital working looks like, and will be informed by evidence, gathered as part of the forthcoming digital skills review."
        },
        {
            "heading": 2,
            "text": "Supporting people"
        },
        {
            "text": "Partnership across health and care is the ultimate goal. We need everyone involved in a person’s care to be able to see not just past health history, but also future care preferences - only then will citizens have a joined up experience. And only when citizens have access to records and care plans themselves will they become real partners in their own care."
        },
        {
            "text": "Shared care records contain rich information that will give local teams a deeper understanding of issues facing people in care, including the impact of antibiotics on the frail and elderly, or triggers that lead to incidents of unexpected behaviour in younger people with learning disabilities. This knowledge will help to personalise care and drive preventative measures that reduce risk, and minimise incidents and accidents for individuals."
        },
        {
            "text": "Technologies that allow data to be shared between individuals and providers have the potential to revolutionise how we deliver care to people too. During the pandemic we made much greater use of remote monitoring tools; allowing people to be safely cared for in the comfort of their own homes and relieving pressure on front line services."
        },
        {
            "text": "There is now widespread evidence that data from assistive technologies, including room sensors, activity monitors and alarm systems, can help provide 24-hour background support, while enabling individuals to live independently. These innovations also give carers and family members reassurance about their wellbeing and safety – and some degree of respite from caring responsibilities."
        },
        {
            "heading": 2,
            "text": "Supporting commissioners"
        },
        {
            "text": "Accessing health data is essential for commissioners making difficult decisions on where best to spend their money. For example, by understanding how many people in an area have long term health conditions and the care support they need, Local Authorities can coordinate with community health and voluntary sector organisations to put the right services in place."
        },
        {
            "text": "At a national level, the pandemic has reinforced the need for access to regularly updated and detailed data to identify emerging issues. The Department of Health and Social Care has been leading work with the sector to provide a near real-time view of the pandemic’s impact across social care as a whole."
        },
        {
            "text": "Beyond the pandemic, well-considered national data collection will provide hard evidence of the true value, challenges and opportunities facing the adult social care provider sector, making the case for funding and changes to the way we work as a sector. That’s why the strategy commits to improving the quality of the data we collect and reducing the burden on staff in doing so."
        },
        {
            "heading": 2,
            "text": "Looking forward"
        },
        {
            "text": "Better use of data and technology has the potential to support care providers, service users and commissioners - and our strategy aims to provide the framework needed to achieve these goals."
        },
        {
            "text": "‘Data saves lives: reshaping health and care with data’ is being shared now, to allow everyone to have their say before final publication  later this year. We encourage you to take this opportunity to read it and complete the survey published alongside it by 20 August to make your views known. Help us shape the digital future of health and care services. You can also see what other people are saying about it on the NHSX website."
        }
    ]
}