{
    "url": "https://homeofficemedia.blog.gov.uk/2021/07/21/windrush-compensation-scheme-factsheet-july-2021/",
    "title": "Windrush Compensation Scheme factsheet - July 2021",
    "authors": [
        "Home Office news team"
    ],
    "categories": [
        "Fact sheet"
    ],
    "pub_date": "2021-07-21T13:32:35+01:00",
    "content": [
        {
            "text": "Windrush Compensation Scheme factsheet - July 2021"
        },
        {
            "text": "The Windrush generation were wronged by successive governments. To help right those wrongs, the Home Office has put in place a range of initiatives."
        },
        {
            "text": "Windrush Compensation Scheme"
        },
        {
            "text": "The Windrush Compensation Scheme was launched on 3 April 2019."
        },
        {
            "text": "You may be able to claim compensation if you suffered losses because you could not show that you had a right to live in the UK."
        },
        {
            "text": "Since April 2019 the Scheme has offered or paid more than £34 million in compensation to members of the Windrush generation."
        },
        {
            "text": "On 21 July the Home Office published the latest set of data on the Scheme which covers the period to the end of June 2021."
        },
        {
            "text": "During the month of June, the Home Office paid out £2.49 million in compensation."
        },
        {
            "text": "To the end of June 2021:"
        },
        {
            "text": "On 14 December 2020 the Home Office announced an overhaul of the Scheme to ensure that people receive significantly more money, much more quickly."
        },
        {
            "text": "We increased the minimum award under the Impact on Life category to £10,000. This is forty times the previous minimum award under this category and will be paid as a new early preliminary payment as soon as someone applying on their own behalf or on behalf of a deceased relative can show any impact on their life under the terms of the Scheme. They do not need to wait for their whole application to be assessed."
        },
        {
            "text": "We also increased the value of awards for Impact on Life at every level so everyone will be paid more in this category, with the maximum award increasing from £10,000 to £100,000 (with options for even higher awards in exceptional circumstances)."
        },
        {
            "text": "Within six weeks of the changes being announced, the Home Office had offered more in compensation than in the first 19 months of the Scheme rising £6.17 million to more than £12 million at the end of January 2021."
        },
        {
            "text": "Prior to the overhaul, the Scheme offered an average of £294,000 per month. Since the changes made in December, the Scheme has offered an average of £5.2 million per month."
        },
        {
            "text": "The Scheme was designed with the independent oversight of Martin Forde QC, in close consultation with those who had been affected, to be as comprehensive and easy to use as possible. As a result, people should not require legal assistance to make a claim."
        },
        {
            "text": "Further improvements to simplify the application process have also recently been made, including changes to the primary claim form, designed in consultation with stakeholders, to make it easier to complete and easier for caseworkers to process."
        },
        {
            "text": "For those who do need support, the Home Office has funded an organisation to provide free, independent claimant assistance to individuals for the duration of the Scheme. We Are Digital started providing this service from the first quarter of 2021."
        },
        {
            "text": "Compensation payments are made as quickly as possible, but each person’s claim is deeply personal and deserves to be processed with the utmost care and sensitivity so that the maximum payment can be made to them."
        },
        {
            "text": "Individuals must accept their offer of compensation before it can be paid, or, if they are dissatisfied, they can ask for a review."
        },
        {
            "text": "This is first through an internal review and, if someone remains dissatisfied, through an independent review by the Adjudicator’s Office."
        },
        {
            "text": "Support for those claiming on behalf of relatives who have passed away "
        },
        {
            "text": "The Home Office is launching a package of support to make it easier for those making claims on behalf of a relative who has passed away to obtain the legal documentation required to process their claims."
        },
        {
            "text": "This includes reimbursing up to £1,500 towards legal advice that has been sought to apply for probate, which is the legal right to deal with someone’s estate when they die. We Are Digital, who provide independent advice for those claiming compensation, will also be able to provide free help and support to those applying for probate, including how to complete the different application forms."
        },
        {
            "text": "The Home Office will be writing to all those who have already made claims on behalf of a relative who has passed away without evidence of probate, and publishing information about the support available on gov.uk in the coming weeks."
        },
        {
            "text": "Urgent and exceptional cases"
        },
        {
            "text": "In December 2018, the Home Office established an Urgent and Exceptional Payments process for those members of the Windrush generation who had an urgent and exceptional need in advance of the Windrush Compensation Scheme."
        },
        {
            "text": "The process remains open for those who need it. The total value of the payments approved, to the end of February, is £104,338.58."
        },
        {
            "text": "But this is just one way we help those in urgent need. There is also a dedicated Vulnerable Persons Team (VPT) to provide help and advice for more vulnerable people. This service also helps people:"
        },
        {
            "text": "To the end of February, the VPT has provided support to 1,791 individuals."
        },
        {
            "text": "Windrush Scheme"
        },
        {
            "text": "On 16 April 2018, the Home Office established the Windrush Taskforce, now known as the Help Team, to ensure members of the Windrush generation could get the documentation they need to prove their right to be in the UK."
        },
        {
            "text": "Over 13,000 people issued with documentation confirming their status or British citizenship."
        },
        {
            "text": "To help people apply for documentation, the Taskforce has attended over 80 surgeries in person at places of worship, care homes and community centres, across the UK since 2018."
        },
        {
            "text": "Windrush Cross-Government Working Group"
        },
        {
            "text": "On 22 June 2020, the Home Secretary launched the Windrush Cross-Government Working Group."
        },
        {
            "text": "The Working Group, co-chaired by the Home Secretary and Bishop Derek Webley MBE DL, brings together community organisations with government representatives to support the delivery of practical solutions to address challenges affecting the Windrush generation and their families."
        },
        {
            "text": "Engagement"
        },
        {
            "text": "Grassroots, face-to-face engagement has been key to delivering our messages to the people we know we need to reach."
        },
        {
            "text": "Since 2018, we have held approximately 180 engagement and outreach events across the country (held in line with Covid-19 guidance during the pandemic). These events include approximately 103 one-to-one surgeries to help people apply for documentation to the Windrush Scheme and over 60 public community engagement events to raise awareness of the Windrush Schemes."
        },
        {
            "text": "These events were moved online during the coronavirus pandemic so that people can continue to access support and advice on the Windrush Schemes. To date, we have held 44 online events. When Governments guidelines allow, we will look to restart face-to-face community-based events."
        },
        {
            "text": "Promotion of the Schemes and supporting communities"
        },
        {
            "text": "The Windrush Community Fund opened for applications on 14 December. The Community Fund supports community and grassroots organisations to run outreach and promotional activity to raise awareness of the Windrush Scheme and Windrush Compensation Scheme."
        },
        {
            "text": "In phase one, 14 charities, community and/or grassroot organisations across the UK have been awarded grants between £2,500 to £25,000 to ensure affected Windrush communities are aware of the support and compensation available, following a competitive bidding round."
        },
        {
            "text": "Phase two is now open for bids. For more information and how to apply, go to: www.gov.uk/guidance/apply-for-the-windrush-community-fund"
        },
        {
            "text": "To reach priority audiences throughout the UK, the Home Office ran a £750,000 advertising campaign late last year. The campaign used a range of channels including print, local radio, web and social media to make more people aware of the support available to them and how to apply."
        },
        {
            "text": "Grassroots activity has included partnerships with specialist media outlets and the recruitment of campaign ambassadors. The ambassadors have worked in communities throughout the UK to encourage and support applications amongst their networks, via activities such as media interviews, hosting information events, distributing materials through food banks, faith organisations and coordinating social media work."
        },
        {
            "text": "The Government continues to work closely with stakeholders to ensure as many people as possible apply."
        },
        {
            "text": "Independent Person"
        },
        {
            "text": "On 21 April the Home Office announced Professor Martin Levermore MBE DL as the new Independent Person to advise on the Windrush Compensation Scheme, following a competitive recruitment round."
        },
        {
            "text": "Professor Levermore will provide crucial independent oversight and reassurance on the Windrush Compensation Scheme’s operation, policy and effectiveness."
        },
        {
            "text": "Learning lessons and moving forward - the Windrush Lessons Learned Review"
        },
        {
            "text": "In 2018, the previous Home Secretary commissioned a lessons learned review into the events leading up to Windrush. Independent oversight was provided by Wendy Williams."
        },
        {
            "text": "After receiving the final report, the Home Secretary published the report the next day on 19 March 2020.  "
        },
        {
            "text": "On behalf of successive governments, the Home Secretary apologised to the Windrush generation for the way they were treated."
        },
        {
            "text": "On 21 July 2020, the Home Secretary set out the action the Home Office is taking in response to the Wendy Williams Windrush Lessons Learned Review."
        },
        {
            "text": "This includes comprehensive training for everyone working in the Home Office to ensure they understand and appreciate the history of migration and race in this country. Every existing and new member of staff working for the Home Office will be required to undertake this training."
        },
        {
            "text": "Greater emphasis will be placed on taking a more compassionate approach to individual applications and decision makers will be empowered to use their own discretion and pragmatism."
        },
        {
            "text": "The Home Secretary published a comprehensive improvement plan in response to the Windrush Lessons Learned Review on 30 September, which shows how the Home Office is delivering on the recommendations and working to be more diverse and worthy of the trust of the whole communities it serves."
        },
        {
            "text": "Notes:"
        }
    ]
}