{
    "url": "https://companieshouse.blog.gov.uk/2021/07/21/working-for-companies-house-louises-story/",
    "title": "Working for Companies House: Louise's story",
    "authors": [
        "Louise O'Connell - Systems Analyst",
        "Spencer Vignes - Campaigns Manager"
    ],
    "categories": [
        "People and culture",
        "Working at Companies House"
    ],
    "pub_date": "2021-07-21T14:54:58+01:00",
    "content": [
        {
            "text": "At Companies House, we like to think of ourselves as an inclusive, innovative and welcoming employer, one that supports people and encourages them to ‘find their passion’ by developing their skills and careers. But don’t just take our word for it. Here, our series of features in which employees reflect on what makes Companies House so special continues with Senior Systems Analyst Louise O’Connell."
        },
        {
            "text": "“Because I love it.” That’s the straight-up, 4-word answer that Louise O’Connell gives when asked the question ‘Why do you keep coming back to Companies House?”"
        },
        {
            "text": "Louise has not always been a systems analyst. Her first spell at Companies House was way back in the 1990s, working as an administrative assistant on the evening shift in the microfiche library in Cardiff."
        },
        {
            "text": "“People would file paper documents, they would get scanned, changed into fiche and then at the end of the day get filed away by the likes of me,” she recalls."
        },
        {
            "text": "“There were massive carousels with thousands of companies on them that span around. Now it’s all on computer and you just press a button that says ‘submit’. You look back and think ‘Wow, that was a lot of work’! But, of course, we did not know any different in the pre-digital age.”"
        },
        {
            "text": "Although Louise’s 6-month temporary contract was extended, the lack of available childcare meant working evenings was no longer an option."
        },
        {
            "text": "By 2003, Louise had returned to Companies House again, once more working on the evening shift filing microfiche. But then the evening shift was disbanded. Goodbye to Companies House for a third time!"
        },
        {
            "text": "Over the following years she worked for other organisations while also experiencing the peaks and troughs that life can throw at you, such as divorce, parenthood, health problems and bereavement."
        },
        {
            "text": "Yet she always felt, in terms of other employers, that something was missing."
        },
        {
            "text": "“I know it sounds like a cliché, but I started thinking ‘You know what? There really is no place like Companies House’. It’s like a big family."
        },
        {
            "text": "“The people are brilliant, but there’s more to it than that. It’s the culture as well. There’s work to be done, important work at that, but it’s not like one of those high-pressure organisations where you have to put your hand up just to ask to go to the toilet. I’ve seen that kind of working environment and it’s horrible. Companies House is the polar opposite.”"
        },
        {
            "text": "In 2008, eager to come back again, Louise returned for a fourth time, on this occasion in the post room. But when an internal position arose as an administrative assistant in IT change management, she jumped at the chance of broadening her experiences and skill set."
        },
        {
            "text": "Then, another position came up as a junior systems analyst which she applied for and got. She then applied for and got a C1 systems analyst role. And inspired by that, she applied for and got a senior systems analyst position. Which brings us right up to date."
        },
        {
            "text": "“I’ve enjoyed all my various roles at Companies House but this is the one I feel most suits me, even after the past year of working remotely and not seeing everyone,” says Louise."
        },
        {
            "text": "“I have multiple pain conditions but all my specially adapted equipment, including my chair and standup table, is with me here at home. Having that kind of support has been worth its weight in gold."
        },
        {
            "text": "“Even before the coronavirus (COVID-19) pandemic, that support was always there for me, along with the flexibility to work around whatever else might be going on in your life. I’m sure some other organisations would have got rid of me years ago!"
        },
        {
            "text": "“I have really missed the people though. You know, silly things like going to the kitchen, making a cuppa and catching up with your friends and colleagues. You cannot beat human interaction."
        },
        {
            "text": "“We also have many support networks at Companies House which employees can join. I’m a member of 3 including the menopause network. I mean, how many organisations out there have a menopause network? That’s the difference between Companies House and other employers."
        },
        {
            "text": "“I’ve been offered opportunities over recent years to work at other places. You know, ‘Oh, there’s a job going here, it’s paid more money’ and so on. But sometimes you’ve got to weigh it up. Would the culture be better there than it is at Companies House? I seriously doubt it. Would the people be better? I doubt it again. Why swap the wonderful working life that I have for a couple of quid? There’s a bigger picture to think about. Hand on heart, I’m very happy to be where I am.”"
        }
    ]
}