{
    "url": "https://dcmslibraries.blog.gov.uk/2016/03/23/have-your-say-libraries-deliver-an-ambition-for-libraries-in-england-2016-2021/",
    "title": "Have your say on Libraries Deliver: an Ambition for Public Libraries in England 2016-2021",
    "authors": [
        "Kathy Settle"
    ],
    "categories": [
        "Taskforce"
    ],
    "pub_date": "2016-03-23T09:08:13+00:00",
    "content": [
        {
            "text": "The Libraries Taskforce reaches a significant milestone today in publishing our draft vision Libraries Deliver: an Ambition for Libraries in England 2016-2021. The document has been welcomed, including by William Sieghart, Chair of the Panel that produced the Independent Library Report for England (see end of the blog for quotes)."
        },
        {
            "heading": 2,
            "text": "How did we get here?"
        },
        {
            "text": "This is an important step in the process that started with publication of the Independent library report for England in December 2014, Both that document and the Taskforce’s first six month progress report recommended the publication of a document that set out the government's and Taskforce's shared vision for public libraries in England. The Government strongly supported this recommendation and asked the Taskforce to produce a draft for consultation."
        },
        {
            "heading": 2,
            "text": "What does it say?"
        },
        {
            "text": "The document reflects on the evolving role of libraries in light of changing public expectations. It presents a vision for the future and discusses how it should be achieved."
        },
        {
            "text": "It illustrates how libraries support people during every phase of their lives and the value they add across a wide range of areas:"
        },
        {
            "heading": 2,
            "text": "It’s still a draft..."
        },
        {
            "text": "Within the Taskforce, we’ve discussed and debated the contents of the Ambition document - what does it need to cover, what should the priorities be, how will the ambition be realised. Taskforce members have used their own knowledge and experience - as well as the intelligence and insights gathered through conversations with hundreds of people involved with libraries - to come up with the draft we’ve published today."
        },
        {
            "text": "But we recognise there are lots of people we haven’t managed to speak to yet. We want to give everyone with an interest in libraries - communities, library staff, partners, decision-makers - an opportunity to have their say on the priorities they believe will most make a difference to them and their libraries."
        },
        {
            "heading": 2,
            "text": "How can you tell us what you think?"
        },
        {
            "text": "We've published an online questionnaire which we’d encourage everyone who has an interest in libraries to complete. This will be open until the end of Friday 3 June. [Editors note: We have heard since publishing this that some networks block access to google forms. If you are having trouble accessing the form, please email julia.chandler@culture.gov.uk]"
        },
        {
            "text": "We’ll also be holding a series of workshops around the country. You can see where they’ll be run and register your interest to take part here."
        },
        {
            "text": "You are also welcome to email us directly on librariestaskforce@culture.gov.uk or write to us."
        },
        {
            "text": "Once the consultation period closes, we’ll work with the Department for Culture, Media and Sport to review all the responses and publish the final document in summer 2016."
        },
        {
            "heading": 2,
            "text": "Over to you…."
        },
        {
            "text": "We all need to contribute to the debate about how libraries maximise their impact and value to their communities, and how local authorities can build a modern, comprehensive and efficient service within the resources that are available. We really hope to hear from you about what you think matters most in achieving this."
        },
        {
            "text": "We look forward to hearing your views."
        },
        {
            "heading": 2,
            "text": "Quotes"
        },
        {
            "text": "The draft document has received a widespread welcome including from:"
        },
        {
            "text": "William Sieghart, Chair of the Panel, Independent Library Report for England:"
        },
        {
            "text": "“I am really delighted that the Libraries Taskforce has published their Library Ambition for consultation today. This builds on the aims from my Independent Library Report and sets out a longer term vision for libraries. It is more important than ever that we help our libraries to grow and adapt. This will help to ensure that they remain open to provide free access to both current and future generations.”"
        },
        {
            "text": "Ed Vaizey, Minister for Culture and the Digital Economy:"
        },
        {
            "text": "“Above all, it is a vote of confidence in our libraries… Showing that libraries are as relevant, if not more relevant, than ever before”"
        },
        {
            "text": "Joanna Trollope, a member of William Sieghart’s original panel, called it “most encouraging and impressive.”"
        },
        {
            "text": "Nick Poole, CILIP Chief Executive:"
        },
        {
            "text": "“CILIP has long called for a strategic plan for the public library network in England and Libraries Deliver is a welcome step towards making that plan a reality. I encourage librarians and library staff to get involved in the consultation and provide their expert views and opinions.”"
        },
        {
            "text": "Paul Blantern, Chair, Libraries Taskforce and Chief Executive, Northamptonshire County Council:"
        },
        {
            "text": "“225 million visits in 2015 shows that libraries are at the very heart of our communities. Our Ambition document is about making sure libraries stay at their heart and continue to meet the needs of our changing population whilst not losing what we all love about libraries! The Ambition document, which I really hope you all contribute to the discussion about, is the culmination of a huge amount of effort by many contributors to the library and information world, and has been brought together by the dedicated hard work of the Libraries Taskforce team.”"
        },
        {
            "text": "Brian Ashley, Director, Libraries, Arts Council England:"
        },
        {
            "text": "“This Ambition document is an important opportunity to set the agenda for libraries in England. Alongside familiar challenges, there are tremendous opportunities for libraries to make a positive contribution to the lives of people and communities across the country. In some places, we can see those opportunities being seized; in others, much more needs to be done. Once we have listened to feedback on our thinking, we will be well placed to harness both existing partners in the Taskforce but, even more importantly, to welcome new partners who will find libraries brilliant at delivering on the things we set out to achieve together.”"
        },
        {
            "text": "Sue Wilkinson, CEO of The Reading Agency:"
        },
        {
            "text": "“We welcome the development of the Ambition document. Building on Arts Council England’s Envisioning the Library of the Future; it sets out both the challenges which lie ahead; the actions and investment needed to meet these and the societal and individual benefits which come from having a sustainable, high-quality public library network. Libraries matter; they are the safe, trusted, spaces which ensure that everyone has access to knowledge, information and the wonderful world of reading. We hope that there will be a robust debate about this document resulting in a strong and shared vision for the future and for the Taskforce’s activity for the next 5 years.”"
        }
    ]
}