{
    "url": "https://accessibility.blog.gov.uk/2024/02/21/accessibility-and-service-design-for-inclusion/",
    "title": "Accessibility and service design for inclusion",
    "authors": [
        "Rachel A.Wood, Service Design Lead, Basildon Council"
    ],
    "categories": [
        "Access needs",
        "Accessibility",
        "Accessibility and Me",
        "Design",
        "User research"
    ],
    "pub_date": "2024-02-21T11:56:16+00:00",
    "content": [
        {
            "text": "My name is Rachel, and I am currently the Service Design Lead at Basildon Council in Essex.  I am also a PhD Researcher in Service Co-design. This means working with service beneficiaries and the workforce to design a service to meet future needs and life events."
        },
        {
            "text": "I live with a disability that affects my immunity and mobility and this has really changed my approach to design (and re-design) of services. Current estimates in England and Wales show that approximately sixteen million people (around 24%) are known to be affected by a disability. However, this figure is reliant on the rates of disclosure, and so there is likely to be more people than this."
        },
        {
            "text": "In my role as Service Design Lead, I aim to support by leading on the design of services for people, and this is often when they need them the most. As part of this work, I have also considered the impact of asking people to disclose their disability, and how this question might make them feel. While this question is important for ensuring people are given the support they need, it can be triggering for some. This means that we need to design in a way that is trauma informed and respectful.  Asking the same question multiple times is unnecessary and can also mean service users disengage early in the process. "
        },
        {
            "heading": 2,
            "text": "What are we learning?"
        },
        {
            "text": "I have learnt that designing for those that need a service can often make the process universally accessible to all. Assistive Technology (AT) is a good example of this. AT is any device or software program that is used to maintain or improve the functional capabilities of people with disabilities, such as a person with sight loss using text to speech technology to navigate a website. I have used AT devices for about five years to help with everyday tasks. If we understand how AT users use our service, we can design services in a more accessible way.  "
        },
        {
            "text": "In the last decade or so, there has been real progress in terms of universal design (a concept first established by Ron Mace in 1997) and inclusive design. "
        },
        {
            "text": "This means applying design to people’s experiences, technology (digital and data), and physical spaces with the following principles:"
        },
        {
            "text": "In service design there is also a focus on patterns, which aims to provide a shared experience, and understanding of a service that is scalable and reusable. This is not without its challenges, but by including service beneficiaries in the design process (otherwise known as co-design), we can better understand journeys, pathways and how, why, and when users interact with our services. "
        },
        {
            "heading": 2,
            "text": "What is changing?"
        },
        {
            "text": "Service design maturity indices (such as the Maturity assessment - The Scottish Approach to Service Design (SAtSD) - gov.scot (www.gov.scot) show where an organisation is in terms of embedding service design, and they now include indicators for accessibility inclusion.  Measuring ourselves against such standards means intentionally making design activities fully accessible to both service beneficiaries and with our own workforce. We also use Equality Impact Assessments to help us understand both our positive impact, and any unintended consequences that our designs could have."
        },
        {
            "heading": 2,
            "text": "What will happen next?"
        },
        {
            "text": "One future trend in design is hyper personalisation, which involves using real time data to enable customisation for taste and preference.  An example of this might be developing a service that allows users to interact face-to-face, by video call, by audio call or by text service whilst giving them the ability to select their preferred language. This is the very mission reflected in the current government digital strategy, and it is starting to have an impact. At Basildon Council, we have our own strategy for digital inclusion, which is another way that we can show our commitment to accessibility and inclusion."
        },
        {
            "text": "Working in partnership with other public services as a system is also a great way to share best practice and build communities of practice. "
        }
    ]
}