{
    "url": "https://nationalscreening.blog.gov.uk/2024/02/21/consultation-opens-on-modifying-antenatal-screening-pathway-for-edwards-syndrome/",
    "title": "Consultation opens on modifying antenatal screening pathway for Edwards' syndrome",
    "authors": [
        "Mike Harris"
    ],
    "categories": [
        "General"
    ],
    "pub_date": "2024-02-21T09:33:14+00:00",
    "content": [
        {
            "text": "The UK National Screening Committee (UK NSC) today opened a consultation on evidence that suggests the quadruple screening test should be added to the antenatal screening pathway for Edwards’ syndrome (trisomy 18)."
        },
        {
            "text": "The UK NSC already endorses the offer of screening for Edwards’ syndrome using the combined test as part of the NHS fetal anomaly screening pathway between 10 and 14 weeks of pregnancy."
        },
        {
            "text": "The quadruple test, which uses maternal age and 4 biochemical markers, is currently offered to screen for Down’s syndrome only. It is offered to pregnant women who are more than 14 weeks pregnant and have missed the first trimester combined screening test, or in cases when it has not been possible to obtain a nuchal translucency measurement."
        },
        {
            "text": "A rapid review paper of modelled data, conducted by NHS England, suggests that the quadruple test is accurate enough to test for Edwards’ syndrome in addition to Down's syndrome."
        },
        {
            "text": "We are therefore asking stakeholders to review the paper and its findings before feeding back on the following question:"
        },
        {
            "text": "To take part in the consultation, please visit: Addition of quadruple test to Edwards' syndrome screening pathway."
        },
        {
            "text": "Please email your consultation responses to uknsc@dhsc.gov.uk by 5pm on Wednesday 6 March."
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK NSC. You can register to receive updates direct to your inbox, so there is no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, please email uknsc@dhsc.gov.uk."
        }
    ]
}