{
    "url": "https://valuationoffice.blog.gov.uk/2024/02/21/council-tax-properties-in-disrepair/",
    "title": "Council Tax: Properties in disrepair",
    "authors": [
        "Diane Thomson - CT and Rent Officer Functions Unit Head"
    ],
    "categories": [
        "Council Tax"
    ],
    "pub_date": "2024-02-21T12:01:41+00:00",
    "content": [
        {
            "text": "The Valuation Office Agency (VOA) bands homes for Council Tax. The Council Tax band of any property is based on its open market value – the price it could have sold for – at a fixed point in time. Read more about how properties are valued for Council Tax."
        },
        {
            "text": "In limited circumstances, we may delete a property’s Council Tax band."
        },
        {
            "text": "This happens when the property is truly derelict or undergoing major renovation."
        },
        {
            "text": "In this blog, we explain what it means for a property to be truly derelict, the evidence we need to delete the property’s band, and what happens once the band has been deleted."
        },
        {
            "text": "What is a truly derelict property?"
        },
        {
            "text": "There is one main question we ask when deciding whether a property is truly derelict."
        },
        {
            "text": "Is the property capable of a normal level of repair without changing its character?"
        },
        {
            "text": "Character covers things like the size of the property, its features, the materials it is made from and its relationship to the overall plot."
        },
        {
            "text": "Our decision is based on the physical state of the property. It is not based on how much the property would cost to repair, or whether repairs will actually be done."
        },
        {
            "text": "A truly derelict property will be in severe disrepair. The property would have deteriorated so much, usually over a long period of time, that it cannot be lived in without major reconstruction work."
        },
        {
            "text": "The work needed to make a truly derelict property habitable will be so significant that the renovated property would bear little, if any similarity with the original."
        },
        {
            "text": "Features of a derelict property may include:"
        },
        {
            "text": "A property will normally need to display many of the listed features for us to delete its band."
        },
        {
            "text": "Properties in poor repair"
        },
        {
            "text": "If a property is capable of a normal level of repair without changing its character, the property is not truly derelict. Instead, it is in poor repair."
        },
        {
            "text": "A property in poor repair needs less work to make it habitable. Unlike a truly derelict property, a property in poor repair does not need significant structural reconstruction."
        },
        {
            "text": "For Council Tax purposes, a normal level of repair includes:"
        },
        {
            "text": "In these circumstances, we cannot delete the Council Tax band as the repairs would be unlikely to change the character of the property."
        },
        {
            "text": "Evidence requirements"
        },
        {
            "text": "When you make a proposal for us to delete your property’s Council Tax band, we will ask you for evidence to help us make a decision."
        },
        {
            "text": "For properties in disrepair, this evidence could be:"
        },
        {
            "text": "What happens next?"
        },
        {
            "text": "If we delete your property’s Council Tax band, your property will be removed from the Council Tax list. You will not pay any Council Tax on the property until we are notified by the local council that work has been completed."
        },
        {
            "text": "Once work has been completed, your property will be banded as a new property."
        },
        {
            "text": "When valuing the property, we will consider all improvements made. This means your Council Tax band may go up."
        },
        {
            "text": "The date you will be liable to pay Council Tax will be the date works were completed."
        },
        {
            "text": "You can find more information about challenging your Council Tax band on GOV.UK."
        }
    ]
}