{
    "url": "https://deframedia.blog.gov.uk/2024/02/21/coverage-of-the-governments-announcements-at-the-nfu-conference-to-support-british-farmers/",
    "title": "Coverage of the Government’s announcements at the NFU conference to support British farmers",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Farming"
    ],
    "pub_date": "2024-02-21T13:05:27+00:00",
    "content": [
        {
            "text": "There has been widespread coverage of the Prime Minister and Environment Secretary’s announcement on a range of new measures to ensure all farmers and producers are treated fairly Government underlines commitment to British farmers - GOV.UK (www.gov.uk)."
        },
        {
            "text": "The new measures announced by the Prime Minister at the NFU Conference on Tuesday Prime Minister's speech to the NFU annual conference: 20 February 2024 - GOV.UK (www.gov.uk) include the largest ever round of farming grants to boost resilience and productivity, an annual Food Security Index to capture and present the key data to monitor food security, and a yearly Farm to Fork Summit to increase industry collaboration. Further measures include regulations laid this week to ensure fair and transparent contracts for dairy farmers and a further review to improve fairness in the poultry supply chain."
        },
        {
            "text": "National coverage highlighted the government’s commitment to boost food security, with outlets including BBC News, Sky News, ITV News, the Daily Mail,  Financial Times and the Telegraph detailing the £220 million announced by the government for new technology to boost productivity in the agriculture sector. Alongside the commitment to improve food security, The Guardian led with the Prime Minister’s promise to “change the culture” in government around farming. The announcement was also covered in trade publications including Farmers Guardian and Farmers Weekly."
        },
        {
            "text": "The Prime Minister also took part in an interview with BBC Farming Today, and the Environment Secretary spoke with a number of broadcast outlets including Good Morning Britain, ITV News, Bauer and LBC Radio."
        },
        {
            "text": "Environment Secretary Steve Barclay said:"
        },
        {
            "text": "Farming Minister Mark Spencer said:"
        }
    ]
}