{
    "url": "https://stratcommand.blog.gov.uk/2024/02/21/we-are-strategic-command-with-mikey-hayes/",
    "title": "We Are Strategic Command with Mikey Hayes",
    "authors": [
        "bobsendall"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2024-02-21T10:00:40+00:00",
    "content": [
        {
            "text": "Learn more about what it takes to drive innovation with Mikey, an innovation scout at the jHub. From concept to delivery, Mikey talks about how jHub connects cutting-edge technology with users across Defence."
        },
        {
            "text": "Interviewer: What does it take to succeed in managing innovation projects?"
        },
        {
            "text": "Mikey: You've got to own it. You've got to be somewhat emotionally attached to the project because if you weren't, you would probably cancel it in an early stage."
        },
        {
            "text": " "
        },
        {
            "text": "Interviewer: Can you introduce yourself and your role?"
        },
        {
            "text": "Mikey: My name is Mikey, and I'm an innovation scout here at the jHub. An innovation scout is essentially a project manager. We take an idea right through to delivering it as a project for our users."
        },
        {
            "text": " "
        },
        {
            "text": "Interviewer: What's your background and how did you get into innovation management?"
        },
        {
            "text": "Mikey: I started as an engineer in Abbey Wood, in Defence Equipment and Support, and went through the engineering graduate scheme. I was always interested in drones, innovation, and robotics. Innovation was a thread throughout my grad scheme. I did placements inside and outside of the MoD. When roles came up at the jHub, I transitioned into Strategic Command, did some innovation work, and became more of a project manager than a technical engineer."
        },
        {
            "text": " "
        },
        {
            "text": "Interviewer: Can you describe the range of projects you handle?"
        },
        {
            "text": "Mikey: We have a wide range of projects, both software and hardware. One of the first projects I was assigned to was Project TALOS, which was one of the jHub’s biggest and longest projects. It involved integrated force protection, combining different types of sensors and effectors into one Command and Control system."
        },
        {
            "text": " "
        },
        {
            "text": "Interviewer: What's the dynamic like within your team?"
        },
        {
            "text": "Mikey: The team here is great; everyone gets on very well. Diversity of thought is a big part of it. We have a good mix of military and civilian staff. Having different perspectives during internal discussions is valuable because there's a variety of opinions. We have people with backgrounds in English, history, geology, and more. You don't necessarily need to be highly technical to do well here."
        },
        {
            "text": " "
        }
    ]
}