{
    "url": "https://environmentagency.blog.gov.uk/2024/02/21/working-with-dvsa-to-put-the-brakes-on-waste-criminals/",
    "title": "Working with DVSA to put the brakes on waste criminals",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Environment Agency",
        "Regulated industry",
        "Waste"
    ],
    "pub_date": "2024-02-21T09:54:00+00:00",
    "content": [
        {
            "text": "In his role as a Waste Crime Engagement Specialist, it’s Stuart Hoyle's job to identify and forge working relationships with other organisations that can help us shut down waste criminals for good."
        },
        {
            "text": "Working with partners brings additional powers and resources into our armoury. Together we create a united front against waste criminals, demonstrating the power collaboration brings to protect our environment and communities."
        },
        {
            "text": "DVSA have the power"
        },
        {
            "text": "Essential to enabling criminals to illegally deal in waste is access to vehicles. Taking these vehicles away from waste criminals puts the brakes on their illegal deeds."
        },
        {
            "text": "Thanks to our engagement and collaboration with the Driver and Vehicle Standards Agency (DVSA), seizing vehicles is now a reality.  Up and down England we work with local DVSA teams who have the powers and sanctions to inspect vehicles for road worthiness, check vehicle documentation and stop those that shouldn’t be on the road. That power to take vehicles off the road helps us to prevent, disrupt and issue fines to people that use our roads to transport waste for illegal disposal or export."
        },
        {
            "text": "In my patch, the Lincolnshire and Northamptonshire area, I have been working with my colleague James Fordham, DVSA Enforcement Commercial Delivery Team Leader, since 2019. Together we have planned and executed many days of action, known as Operation Clean Sweep. We work as a team with the police, local authorities and HMRC. James’s team have stopped the onward journeys of many vehicles carrying waste, greatly assisting us."
        },
        {
            "text": "James Fordham says: “It all started working alongside Stuart and his team on Operation Clean Sweep and from there soon developed to me being invited to sit on the Lincolnshire Environmental Crime Partnership."
        },
        {
            "text": "“I am pleased to be part of this partnership which has helped to broaden the approach taken to deal with Environmental Crime in Lincolnshire by targeting the commercial vehicles that are used by conducting mechanical safety checks, checking for overloads, drivers’ hours infringements and Operator licence compliance."
        },
        {
            "text": "“Having an information sharing agreement in place ensures we can share certain pieces of information that help in targeting offenders through our intelligence gathering methods.\""
        },
        {
            "text": "Partners in crime prevention"
        },
        {
            "text": "Having the DVSA join the Lincolnshire Environmental Crime Partnership where information can be shared between partners helps us identify, target and stop waste criminals faster. DVSA representation at that partnership has been invaluable."
        },
        {
            "text": "Collaborating locally brings benefits to cross border information sharing and project development. DVSA conduct investigations into holders of HGV operator licences and report these to the Traffic Commissioners Office. These often concern individuals and companies of interest to us."
        },
        {
            "text": "My colleague Peter Lennard leads on Operation Convoy, part of which identifies useful information from the Traffic Commissioner resulting from DVSA action. In December this led to James and me looking into two HGV operators whose licenses have been revoked by the Traffic Commissioner due to DVSA action, whose practices have also been of concern to the EA."
        },
        {
            "text": "As with other waste operators the DVSA have impeded, we remain vigilant together so such operators to do not continue to transport waste illegally."
        }
    ]
}