{
    "url": "https://charitycommission.blog.gov.uk/2025/08/26/an-evolving-charity-sector/",
    "title": "An evolving charity sector",
    "authors": [
        "Stuart Wood, Head of Registration"
    ],
    "categories": [
        "Artificial intelligence",
        "Register",
        "Registration"
    ],
    "pub_date": "2025-08-26T12:30:00+01:00",
    "content": [
        {
            "text": "It often surprises people when I tell them that, after 16 years in this role, I still see something new in the charity sector every single week."
        },
        {
            "text": "Charitable status carries such an important role in our society, and is a privilege that carries a number of material benefits, so we take our role as registrar extremely seriously."
        },
        {
            "text": "As society keeps evolving so does the charity sector that supports it. Charities respond to emerging needs, innovate to tackle new challenges (COVID being a clear example), and adapt quickly to change. But this agility comes with a common challenge: increasing demand for services and limited resources to meet that demand."
        },
        {
            "text": "We currently have around 170,000 charities on our Register, which represent a huge span of charitable purposes as well as ambitions and achievement. Our registration data shows a long-term trend of steady growth in the sector, with additions to the Register of Charities exceeding applications for removal."
        },
        {
            "text": "One area that continues to impress me is how readily charities embrace technology. Our registration division is often the first to witness new and imaginative ways charities aim to make a difference. A few examples of applications we’ve had include:"
        },
        {
            "text": "These three examples of the spirit of innovation were successful in their application to become a registered charity in England and Wales. Innovation is one of several factors behind a surge in new registration applications. Also driving registration applications are the ongoing cost-of-living squeeze and financial hardship, global events such as conflicts or disasters, as well as organisations registered as Community Interest Companies looking to convert from a social enterprise to a charity."
        },
        {
            "text": "In our 2023-24 financial year, we processed more than 9,000 applications, which was a record at the time. In 2024-25, that number climbed even higher to 9,840 – an increase of 9% on the previous year. This data indicates that on average per working day the Commission received almost 40 registration applications while registering around 20 new charities from existing applications, alongside removing around 16 organisations from the Register."
        },
        {
            "text": "The Commission has seen similar volumes in the current financial year, with our latest quarterly data showing 1,101 successful registration applications and 1,135 removal applications between 1 April and 30 June 2025. For the first time in our history, in the single month of July 2025 we received more than 1,000 applications in a month."
        },
        {
            "text": "For many organisations, especially those already conducting vital work, charitable status is an important step in their progress. Sadly, some people seek to exploit the status of ‘charity’ for personal gain and we regularly spot and stop sham applications. That’s why our work to robustly scrutinise new applications is so vital. Applicants must demonstrate how any new charity meets the three legal requirements:"
        },
        {
            "text": "1. That the organisation is established to further one or more of the 13 charitable purposes set down in law."
        },
        {
            "text": "2. That they operate for the public benefit."
        },
        {
            "text": "3. That they fall within the jurisdiction of the High Courts for England and Wales."
        },
        {
            "text": "Our work maintaining the integrity of the Register of Charities is one of the principal tasks assigned to us in law, and it’s a responsibility we take very seriously. We understand the public’s expectations of what a charity should be, and our job is to apply the law fairly and expertly. The result? We approved just 53% of new charity applications in the last financial year, ensuring only organisations that meet the legal criteria are added to the Register."
        },
        {
            "text": "When applying to register a charity, we encourage all trustees to follow our guidance and tools available on our website to check this is the correct step for their organisation and to ensure their application has the best chance of being approved. There’s helpful information in our guidance."
        },
        {
            "text": "One growing trend is the apparent use of AI by applicants to generate responses in the application form. Unfortunately, AI-generated content is often too generic and fails to reflect the specific activities or aims of the organisation applying to become a registered charity, leading to a higher rate of rejections."
        },
        {
            "text": "Yet we also recognise the potential of AI to improve our own processes. We’re now actively considering if we might in future utilise AI-tools to enhance our registration service, as part of investing additional funding the government has committed to the Commission from April 2026."
        },
        {
            "text": "Our goal is to support the sector while safeguarding public trust, so people can give confidently, knowing their support is making a real impact."
        },
        {
            "text": "The charity sector isn’t standing still, and neither are we."
        }
    ]
}