{
    "url": "https://mhclgmedia.blog.gov.uk/2025/08/26/fair-funding-review-2-0-consultation/",
    "title": "Fair Funding Review 2.0 consultation",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Council finance",
        "Local government"
    ],
    "pub_date": "2025-08-26T12:19:25+01:00",
    "content": [
        {
            "text": "In June we opened a consultation on the Fair Funding Review 2.0 which set out our proposals to fix the outdated way local authorities are funded to make it fairer and fit for the future, so local leaders can deliver the vital public services their communities rely on.   "
        },
        {
            "text": "Our proposals will ensure funding is targeted effectively at the places and services that need it most and allocated in a way that empowers local leaders to deliver against local priorities. "
        },
        {
            "text": "We are aware that some local authorities, consultancies and local government sector groups are estimating their future financial positions based on the proposals set out in the consultation. To support local authorities to understand the impacts of our proposed changes we would like to clarify how the data presented in these external models should be interpreted. "
        },
        {
            "text": "We expect that councils with social care responsibilities will see their Core Spending Power (CSP) increase in real terms over the multi-year Settlement, with most councils seeing their Core Spending Power increase in cash terms. We also expect that by the end of the multi-year Settlement,  areas with high deprivation will have on average higher CSP per capita than less deprived area. "
        },
        {
            "text": "Local Authorities using externally produced models should look at the estimated figures in the context of calculating their CSP by the end of the multi-year Settlement rather than their CSP change over the period. [See graph below.] "
        },
        {
            "text": "Local authorities focussing only on their percentage change in allocation need to consider their current CSP compared to other areas with similar levels of need, and their final allocation by the end of the multi-year Settlement. This is because local authorities have different variables that may impact their current financial position ahead of transitioning to their new allocation. Allocations are currently calculated using the outdated 13-14 Settlement Needs Assessment, which includes a number of measures that do not accurately reflect areas current needs, like: the Business Rates Retention system that was designed to be reset but was not; transition protections which were built into allocations; and needs formulae which were last updated in 2013/14 and have not been updated to account for change, including varying rates of population growth across the country, over the last decade.  "
        },
        {
            "text": "Another variable was the £600m Recovery Grant delivered as part of the 25-26 Settlement. The Recovery Grant was an interim measure that targeted funding towards areas with greater need and demand for services (using deprivation as a proxy), and less ability to raise income locally. Whilst the Recovery Grant did not capture need in the same way that our proposed new modelling will, it meant that the authorities in receipt of the grant had a head start in moving towards their target allocations.  "
        },
        {
            "text": "The Fair Funding Review 2.0 consultation closed on the 15th August. We will carefully consider all responses and publish our final proposals alongside the Local Government Policy Statement in the autumn, with allocations being set out in the provisional Local Government Finance Settlement later in the year.   "
        }
    ]
}