{
    "url": "https://defrafarming.blog.gov.uk/2025/08/26/join-our-user-research-panel/",
    "title": "Join our user research panel",
    "authors": [
        "Jason Stockwell"
    ],
    "categories": [
        "Farming and Countryside Programme"
    ],
    "pub_date": "2025-08-26T15:46:57+01:00",
    "content": [
        {
            "text": "Good design starts with listening, which is why we are encouraging farmers in England to join Defra’s Farming and Countryside user research panel. "
        },
        {
            "text": "User research helps us design services that work for the people who use them. It shows us who we’re designing for, the challenges farmers face with existing services, and what they need from future tools and systems."
        },
        {
            "text": "As a member of the panel, you will test prototypes, give feedback and help build services that work in practice.  "
        },
        {
            "text": "Research might include interviews, surveys or testing early versions of a service. Sometimes we'll seek to understand how you currently do things, other times we'll observe how you use a new tool or feature. However confident you feel online, every perspective is valuable. "
        },
        {
            "text": "We are especially keen to hear from people with a range of experiences, including farmers who are neurodiverse, to make sure new tools and systems reflect the diversity of the farming community. "
        },
        {
            "text": "By taking part, you will help design services that are more inclusive, accessible and practical. These sessions are not a test of your skills; they are about making the services work better for you. "
        },
        {
            "text": "We’ll usually contact you every few months with a research opportunity. This could be a conversation, a chance to try out a prototype, or a short survey."
        },
        {
            "text": "Sessions last between 30 and 75 minutes and you can choose how often to take part. "
        },
        {
            "text": "Farmers and land managers are already making a difference. They have improved application pages for farming grants, tested nutrient management tools, shared feedback on air pollution assessments, and shaped how farm maps are used in digital services. Their input has helped make these services simpler and more effective for everyone. "
        },
        {
            "text": "The kind of research we conduct includes:  "
        },
        {
            "text": "Naming the new farming portal "
        },
        {
            "text": "We’re exploring what the future portal should be called so that users can easily find and identify it. Your input will help us choose a name that makes sense to the people who use it most.  "
        },
        {
            "text": "Testing funding application tools with upland farmers "
        },
        {
            "text": "We’re working with upland farmers to test a prototype of a new online service for applying for funding. We want to know how user-friendly and clear it is – and how we can make it better.   "
        },
        {
            "text": "Improving the Nutrient Management Planning Tool (NMPT) "
        },
        {
            "text": "We’re developing a tool to help farmers create Livestock Manure Nitrogen Farm Limit reports. We want to understand how you currently manage this data, the challenges you face, and how we can make the tool more useful. "
        },
        {
            "text": "By signing up to the panel you will help shape the future of farming services and make sure they are designed around the real needs of farmers and land managers. "
        },
        {
            "heading": 2,
            "text": "Register your interest"
        },
        {
            "text": "To get involved, register your interest. "
        },
        {
            "text": "We’ll add you to our insights community and get in touch when there’s a research activity that might suit you. You’ll always have the choice to take part or not."
        },
        {
            "heading": 2,
            "text": "Learn more"
        },
        {
            "text": "You can learn more about how Defra uses user research in practice by visiting the dedicated User research blog category on the Defra Digital, Data, Technology and Security blog."
        },
        {
            "text": "For more opportunities to get involved with the work of the Farming and Countryside Programme, subscribe to the Farming blog. By subscribing, you'll get an email notification as soon as we publish a new post. "
        }
    ]
}