{
    "url": "https://foresightprojects.blog.gov.uk/2025/08/26/runners-and-riders-the-tech-race-to-2050/",
    "title": "Runners and Riders: the tech race to 2050",
    "authors": [
        "ianwatt"
    ],
    "categories": [
        "Emerging Technologies"
    ],
    "pub_date": "2025-08-26T14:06:35+01:00",
    "content": [
        {
            "text": "The Net Zero Technology Outlook is a newly published report from GO-Science. It is spotlight on technological progress and trajectories in the high-emitting sectors of our economy, informed by experts inside and outside Government. "
        },
        {
            "text": "Since the Climate Change Act (2008) launched the race to a decarbonised 2050, there has been lively debate about the best way to get over the line. The Net Zero Technology Outlook introduces the array of technologies that will deliver Net Zero 2050, assesses their comparative readiness and certainty of adoption, and provides actionable recommendations to further their progress. "
        },
        {
            "text": "We conducted a series of expert interviews, roundtables, and peer reviews to inform our analysis and supplement insights from published literature. The technology mix is broken down in the report by five key emitting sectors, Industry, Power, Transport, Heat and Buildings, and Agriculture, Land Use, and Waste. The compatibility of three cross cutting technologies areas; carbon capture, hydrogen integration, and application of biomass, are also detailed for each key emitting sector.  "
        },
        {
            "text": "The figure above shows the primary constituents of the main emitting sectors. The initial snapshot is positive, with most solutions in the upper right quadrant for readiness and certainty. However, high ratings don’t reveal the challenges posed by social attitudes, rates of uptake, and market competitiveness, even for proven technological solutions. Examples of challenges in this respect include decarbonising transport, agriculture, and industries. "
        },
        {
            "text": "The Net Zero Technology Outlook is a short report, designed to be simple to consult. We are promoting the current version as a tool for introductory engagement with net zero technologies, through our clear itemisation of prominent solutions. The Outlook is also intended as a vehicle to enable more nuanced conversations around policy agenda, through the research and development recommendations tailed to each emitting sector. Finally, we identify wildcard technologies which are at a low-level of development but could potentially be impactful later in the journey to 2050, another jumping off point for research and discussion.  We welcome feedback and engagement with the Net Zero Technology Outlook, particularly as we consult on potential next steps for an updated and expanded version. Please visit the report, and get in touch with us at climate@go-science.gov.uk to help shape our next piece of work on net zero technologies."
        }
    ]
}