{
    "url": "https://insidehmcts.blog.gov.uk/2022/06/14/building-a-new-online-divorce-service-that-works-for-everyone/",
    "title": "Building a new online divorce service that works for everyone ",
    "authors": [
        "Isabel Syred"
    ],
    "categories": [
        "Court and tribunal reform",
        "Digital services",
        "Family"
    ],
    "pub_date": "2022-06-14T15:00:26+01:00",
    "content": [
        {
            "text": "Wednesday 6 April 2022 was an historic day. The Divorce, Dissolution and Separation Act 2020 came into force, which means that divorcing couples no longer need to provide a reason or evidence for their split.  "
        },
        {
            "text": "The new law brings divorce in line with the government’s approach to family justice to avoid conflict wherever possible and reduce its damaging effect on children. It also allows couples to apply jointly for divorce, dissolution and separation for the first time.  "
        },
        {
            "text": "Data published last week shows that almost 13,000 couples have applied to end their marriage under the new law.  We’ve received 2,771 joint applications for divorce and 10,207 from sole applicants.  "
        },
        {
            "heading": 2,
            "text": "Working with stakeholders to build the online service"
        },
        {
            "text": "At HMCTS, we needed to make sure that our new online divorce service accommodated the change in law effectively. Equally important, was making it accessible for everyone who needed to use it."
        },
        {
            "text": "To do this, we worked closely with organisations including:"
        },
        {
            "text": "Their feedback – from regular conversations and forums - helped us design the new joint application process. For example, this led to the creation of a lead applicant - the person who instigates proceedings and triggers the final submission of the joint application."
        },
        {
            "text": "We also listened to feedback from court staff, developers, and most importantly, people with direct personal experience of the previous divorce system.  We invited them to take part in demonstrations and built their first-hand expertise in to evolve the service into something that both meets the requirements of the new law and is truly based around what users need."
        },
        {
            "heading": 2,
            "text": "How has the new service performed so far?"
        },
        {
            "text": "The service is performing well. On launch day, our first acknowledgement of service was received within 30 minutes of issuing an application. This proved that serving by email is far quicker than under the old law."
        },
        {
            "text": "Feedback is very positive. Users find the service reassuring and like the prompts for things such as missing information. They also like that guidance is available throughout the application process, because it helps them understand what they need to do if they get stuck. This helps users to overcome common issues, for example if they do not have easy access to contact details for their former partner."
        },
        {
            "heading": 2,
            "text": "What do stakeholders think? "
        },
        {
            "text": "Karen Dovaston, Interim Chair of the Law Society Family Law Committee reflected:  "
        },
        {
            "heading": 2,
            "text": "Making sure the service works for everyone"
        },
        {
            "text": "We know that the end of a relationship can be a very challenging time. It was essential that the new divorce service is accessible for everyone and makes the process easier to manage. When developing guidance, we needed to confirm the actions applicants need to take in a way that makes sure no user is excluded. There’s also practical support, such as help to complete forms or links to information to help resolve relationship difficulties."
        },
        {
            "text": "Some court users are adjusting to new rules, such as the 20-week period that must pass between issue of the application and applying for the conditional order. Others find the brevity of the statement of irretrievable breakdown a surprise. It’s a real change from the previous law where users had to set out issues like unreasonable behaviour or adultery."
        },
        {
            "heading": 2,
            "text": "Next steps for the service"
        },
        {
            "text": "By the end of August, we'll issue our first conditional offers which confirm that these marriages and civil partnerships can be ended. Later in the autumn, we'll issue our first final orders to legally end marriages. At this point, we hope people will feel the new law has helped end their marriage or civil partnerships in a more balanced way."
        }
    ]
}