{
    "url": "https://digitaltrade.blog.gov.uk/2022/06/14/female-leadership-in-dit-ddat-breaking-barriers-and-reflecting-the-public-we-serve/",
    "title": "Female leadership in DIT DDaT: breaking barriers and reflecting the public we serve",
    "authors": [
        "Jason Kitcat, DDaT Director",
        "Anais Reding, Chief Engagement and Design Officer",
        "Miranda Pottinger, Chief Product and Delivery Officer",
        "Daisy Mackay, Senior DDaT Resourcing Lead"
    ],
    "categories": [
        "Careers",
        "Culture",
        "Diversity and Inclusion",
        "People and Skills"
    ],
    "pub_date": "2022-06-14T11:41:17+01:00",
    "content": [
        {
            "heading": 2,
            "text": "What are the Women in Tech Awards? "
        },
        {
            "text": "Daisy Mackay, Senior DDaT Resourcing Lead"
        },
        {
            "text": "The Women in Tech Awards celebrate employers and individuals going above and beyond to help close the gender gap within the tech sector."
        },
        {
            "text": "The challenge of addressing the gender imbalance in digital, data and technology professions is being addressed in organisations across the UK, but we still have a long way to go. The issue of under-representation is still significant across the industry, as is the gender pay gap. Females are still likely to be paid less than their male colleagues doing the same job."
        },
        {
            "text": "The Department for International Trade (DIT) was shortlisted for the Best Public Sector Employer award at the Women in Tech Employer Awards 2022. This nomination recognised DIT’s efforts and strategies that attract and retain female tech talent into our Digital, Data and Technology (DDaT) department. We are an industry leader within the public sector, committed to successful diversity initiatives that have increased female representation in tech."
        },
        {
            "heading": 2,
            "text": "What does this nomination show about DIT DDaT as an employer?"
        },
        {
            "text": "Daisy"
        },
        {
            "text": "Our results speak for themselves: a third of our new hires since January identify as female, against an industry standard of 15%. Furthermore, 36% of candidates who have accepted offers in technology platforms since January have been female. Three of these were internal candidates, demonstrating our commitment to training and development and providing equal opportunities. Diverse representation is so important to us at DIT. As the Civil Service, we need to truly represent the communities we serve."
        },
        {
            "text": "Miranda Pottinger, Chief Product and Delivery Officer"
        },
        {
            "text": "It’s such a pleasure to work in a gender-diverse team in tech, particularly in a majority-female Senior Management Team (SMT) at DIT. I’ve previously written about the powerful message I received when I joined DIT and saw that three-quarters of my line management chain were senior women. But it’s not just about sisterhood at DIT. It’s about the policies and approaches that benefit everyone to work in ways that help them to be the best they can be at work."
        },
        {
            "heading": 2,
            "text": "Why is diversity so important, from your experience? "
        },
        {
            "text": "Anais Reding, Chief Engagement and Design Officer"
        },
        {
            "text": "I started my career in the defence and security sector where the opportunities available to me, as a young European woman, felt more limited. While that was sometimes for good reason, I have always believed that diversity leads to better outcomes and a more interesting ride too. In the government technology space, particularly in DIT, I’ve found a team that truly values diversity in all its forms."
        },
        {
            "text": "Daisy"
        },
        {
            "text": "I have worked in technology and IT recruitment for a few years now, but only started this role in January 2022. In the past, I have been used to working with middle-aged men. While they were all excellent colleagues, it was easy to suffer impostor syndrome as I was consistently the youngest and the only female in the room."
        },
        {
            "text": "So, it was both a surprise and a delight when I stepped into the DDaT recruitment team at DIT. I found myself surrounded by a diverse range of colleagues, including three females on the leadership team. They are real role models that people starting their career in DDaT can look up to."
        },
        {
            "text": "We’ve also had really positive feedback about the impact that a strong female presence has in such a male-dominated field for candidates. For me, it is important that our candidates and new colleagues feel like they are already represented in our team."
        },
        {
            "text": "Jason Kitcat, DDaT Director"
        },
        {
            "text": "For too long digital, data and technology roles have been seen as the preserve of white men, with all the unfortunate stereotypes that go along with that. When I was studying a joint degree programme in computing and business, there was only one female in the computing course. By contrast, it was nearly a 50/50 male/female split on the business side. So, the challenges are long running as I was at university a very long time ago!"
        },
        {
            "text": "My lived experience has always shown that more diverse teams are more effective, happier and better able to reflect the needs of those they serve. I am passionate about supporting greater diversity in every team I lead."
        },
        {
            "text": "Miranda"
        },
        {
            "text": "I am frequently reminded that everyone benefits if we lift others up as we climb. We have really seen the fruits of developing internal talent pipelines across DDaT in the last 12 months. We’ve had a diverse mix of people moving up on internal promotion as well as brilliant new hires. This translates not just into better outcomes for our people and for building high-performing teams, but also into better outcomes for the citizens and businesses who use our services. I’m grateful to the women and men who have lifted me as they climbed, too!"
        },
        {
            "heading": 2,
            "text": "What are our next steps to becoming an even more diverse and inclusive employer? "
        },
        {
            "text": "Jason"
        },
        {
            "text": "We have a brilliant group of female leaders in DIT DDaT, who support a virtuous cycle of encouraging more women into DDaT. I’m so proud of all the expert, passionate women working at all levels in DDaT, but I know there is more work to do. For example, some professions find it much easier than others to recruit diverse candidates. So, we must keep working at it, but this award nomination is welcome recognition for our progress thanks to a marvellous team effort."
        },
        {
            "text": "Anais "
        },
        {
            "text": "I am really proud that DIT was nominated for the Women in Tech Employer Awards. Growing teams that reflect our diversity ambitions is a journey. Our Women in Tech Awards nomination is just one recognition of our broader work to drive up the diversity of our teams, but it is an important one. It means the work we do pays off, and we are motivated to keep going."
        }
    ]
}