{
    "url": "https://deframedia.blog.gov.uk/2022/06/14/government-food-strategy-to-back-farmers-spread-jobs-and-grow-economy/",
    "title": "Government Food Strategy to back farmers, spread jobs and grow economy",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Weekly stories"
    ],
    "pub_date": "2022-06-14T16:13:57+01:00",
    "content": [
        {
            "text": "There has been widespread coverage of the Government’s Food Strategy, including in the Times, Telegraph, Daily Mail and Sky News. Interviews with the Prime Minister, Environment Secretary and Minister Prentis were carried across broadcast, such as the BBC, ITV, Sky, Channel 4, Channel 5 and several regional outlets."
        },
        {
            "text": "The Food Strategy will drive innovation and harness pioneering technology in farming, increase domestic production, spread jobs and grow the economy. In light of the consequences of Russia’s illegal invasion of Ukraine for the global economy, which has caused knock on imports for food supplies as well as spikes in prices, the Strategy also sets out the importance of maintaining and boosting our food security, including plans to strengthen the resilience of our supply chains and increase domestic production to help protect against future economic shocks."
        },
        {
            "text": "The Strategy follows the independent review of the food system by Henry Dimbleby last year, which set out an analysis of the challenges facing the food system. Our Government Food Strategy responds to these findings and recommendations, accepting the majority of recommendations, with policy initiatives to improve health, sustainability, accessibility of diet to secure food supply, while also recognising the shared global challenges of the war in Ukraine and the impact of the pandemic on the global economy."
        },
        {
            "text": "Prime Minister Boris Johnson said:"
        },
        {
            "text": "Environment Secretary George Eustice said:"
        },
        {
            "text": "The strategy also includes plans to:"
        },
        {
            "text": " Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}