{
    "url": "https://educationhub.blog.gov.uk/2022/06/14/how-were-supporting-disadvantaged-children-in-the-school-holidays/",
    "title": "How we’re supporting disadvantaged children in the school holidays",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Holidays"
    ],
    "pub_date": "2022-06-14T16:04:02+01:00",
    "content": [
        {
            "text": "Since 2018, the Holiday Activities and Food Programme (HAF) has been supporting thousands of children and families in the school holidays."
        },
        {
            "text": "We’ve been working closely with supermarkets like the Co-Op and Waitrose and sports organisations like the UEFA Women’s EURO 2022 organisers on the programme. The Education Secretary Nadhim Zahawi has been speaking to a range of organisations about how they support the communities around them: Boost in activities and food pledged to support children - GOV.UK (www.gov.uk)."
        },
        {
            "text": "Here’s what you need to know about how we support disadvantaged children and their families in the school holidays."
        },
        {
            "heading": 3,
            "text": "What support is already available?"
        },
        {
            "text": "Our HAF programme is already backed by over £200 million each year to 2025, to support disadvantaged children in every area across the country in major school holidays."
        },
        {
            "text": "Over 600,000 children attended HAF clubs last summer, benefitting from nutritious meals and enriching activities, which are targeted towards those who are eligible for free school meals."
        },
        {
            "text": "We’ve also confirmed that approximately £18 million of new funding will help schools provide for the 1.25 million infant pupils receiving a free, healthy and nutritious lunch in term time, in recognition of the rising cost of living."
        },
        {
            "heading": 3,
            "text": "Who contributes to the holiday scheme?"
        },
        {
            "text": "Many organisations, including supermarkets and sports and activity organisations, are providing community support and facilitating partnerships to support the Holiday Activities and Food programme."
        },
        {
            "text": "The Education Secretary and Cost of Living Tsar, David Buttress met with representatives from several UK businesses to celebrate their achievements and to encourage further partnerships to boost support for the holiday scheme."
        },
        {
            "text": "Representatives from Morrisons, Co-Op, the John Lewis Partnership (with Waitrose), M&S, the English Football League Trust, Daily Mile, Swim England, Dallaglio Rugby Works, Lawn Tennis Association, Sport England, StreetGames, and Football Association joined the meeting and shared examples of their valuable work to support families and communities."
        },
        {
            "text": "Examples of contributions so far include:"
        },
        {
            "heading": 3,
            "text": "How can I get involved and access support?"
        },
        {
            "text": "Our piece on What you need to know about the Holiday Activities and Food (HAF) programme - The Education Hub (blog.gov.uk) provides all you need to know about the HAF programme."
        },
        {
            "text": "For information on how you and your family can get involved, please contact your local council."
        }
    ]
}