{
    "url": "https://defradigital.blog.gov.uk/2022/06/14/how-blood-donations-make-a-difference-to-my-life/",
    "title": "How blood donations make a difference to my life",
    "authors": [
        "Sam Chapman"
    ],
    "categories": [
        "Defra digital"
    ],
    "pub_date": "2022-06-14T07:00:36+01:00",
    "content": [
        {
            "text": "On World Blood Donor Day Defra Digital, data, and technology Business Manager Sam Chapman reflects on the importance of giving blood to someone like her whose life has literally been saved by the goodwill of others."
        },
        {
            "text": "Today is World Blood Donor Day and it’s a day that is very close to my heart, for very personal, and very real, reasons. World Blood Donor Day is organised by the World Health Organisation to celebrate and thank all voluntary and unpaid blood donors. The gifts that donors make is truly lifesaving and, in my eyes, makes them all superheroes. And I should know."
        },
        {
            "text": "For an hour of their day, and the donation of one pint of blood, these superheroes may receive a warm cuppa and a biscuit for their time, but I feel they should also be issued with a superhero’s cape (pants on the outside of trousers is optional)."
        },
        {
            "text": "That one hour of their time, and the priceless donation they make, can potentially save the life of up to four people.  Just think about for a moment – four people."
        },
        {
            "text": "Nearly 120 million units of blood are donated every year. However, this isn’t sufficient to meet the global need of so many patients who require a transfusion yet who may not have timely access to safe blood."
        },
        {
            "text": "Blood can’t be stored indefinitely, meaning there is a constant need for donations to ensure there is always a supply for those in need. Despite global need, donation rates differ around the world and some high-income countries see up to seven times more donations than low-income countries."
        },
        {
            "heading": 2,
            "text": "Time for me to ‘fess up"
        },
        {
            "text": "OK I must confess that I’m not one of the amazing people who gives blood, and if I wore a hat, I would lift it to you all.  However, I have been a recipient of a blood donation on several occasions. In a few weeks I’ll be having an operation which will mean I will be a recipient of a couple more pints too."
        },
        {
            "text": "Due to severe anaemia, which was not responding to medication, I have had to undergo several blood transfusions. The transfusions have taken approximately four hours each time, and have seen me receive donated red blood cells, one of the elements that make up our blood along with white blood cells, platelets, and plasma, which supports the carrying of oxygen to cells throughout our bodies."
        },
        {
            "text": "I just don’t seem to be able to produce sufficient ‘haemoglobin rich’ red blood cells myself, which has caused iron deficiency anaemia, meaning I then have to rely on medication, and as a last resort, blood transfusions."
        },
        {
            "text": "As well as anaemia, blood transfusions are needed for a wide range of health conditions including complications during pregnancy and childbirth, severe trauma due to accidents, and surgical procedures. They are also regularly used for patients with conditions such as sickle cell disease and thalassaemia and for products to treat haemophilia."
        },
        {
            "heading": 2,
            "text": "Squeamish alert – skip this bit if you’re easily spooked!"
        },
        {
            "text": "Blood transfusions are very safe and can be life-saving too. They are undertaken to replace blood cells for a range of reasons. My experience was very positive. For my transfusions, I sat in a comfy chair with my book, a needle was inserted into a vein in my left arm, which was then connected to the bag of blood via a tube."
        },
        {
            "text": "The blood ran through the tube and into my arm.  My arm was tender for a couple of days and there was a little bruise. But I had no side effects, it was a truly positive experience for me. I like to think the impact of the transfusion was pretty instant.  But given I had to have three transfusions in total over a period of 35 days, I think I might be kidding myself."
        },
        {
            "text": "However, knowing the positive affects the donated blood cells would have on me did lift my spirits and helped to lift some of the feelings of fatigue I was experiencing.  In the UK around three million transfusions take place annually, I feel incredibly lucky to have been one of this number, but it was only made possible by an equivalent number of donations being made."
        },
        {
            "heading": 2,
            "text": "I know I’m lucky"
        },
        {
            "text": "I’ve been very fortunate, in that I am a B RhD positive blood type, which is the third most common blood type.  Within the UK population the prevalence of O RhD negative, B RhD negative or A RhD negative is reduced, and the UK Blood and Transplant service has raised an urgent appeal for donors of these blood types to come forward and make donations."
        },
        {
            "text": "I also feel fortunate to be working at the Department of Environment Food & Rural Affairs (Defra) and within the Digital, data & technology team whilst undertaking this treatment.  My Line manager, Malcolm McKee, our wider Senior Leadership team, and my team, have all been incredibly supportive.  It was not just their help with balancing my workload, but also their kindness, concern, and encouragement whilst I was receiving the transfusions.  And the established flexible working policy in Defra enabled me to manage my treatment and my working day."
        },
        {
            "text": "If you are a blood donor already? I would like to send you a massive ‘thank you’ and encourage you to book in for your next donation session.  If you aren’t currently a donor, and feel you have the time and the desire to be a hero too, please do check out the blood donor website and book in for an appointment."
        }
    ]
}