{
    "url": "https://disabilityunit.blog.gov.uk/2022/06/14/the-big-apple-talking-about-disability-rights-at-the-un/",
    "title": "The Big Apple: Talking about Disability Rights at the UN",
    "authors": [
        "Disability Unit"
    ],
    "categories": [
        "Policy"
    ],
    "pub_date": "2022-06-14T11:39:30+01:00",
    "content": [
        {
            "heading": 3,
            "text": "The 15th session of Conference of States Parties (COSP) is being held at the United Nations Headquarters in New York from 14 to 16 June 2022. "
        },
        {
            "heading": 3,
            "text": "What does this mean? Why is it important? Find out more."
        },
        {
            "heading": 3,
            "text": "What is COSP? "
        },
        {
            "text": "COSP stands for the Conference of States Parties to the UN Convention on the Rights of Persons with Disabilities (UNCRPD). It is an annual conference that started in 2008. "
        },
        {
            "text": "COSP is the event that comes together to discuss the UNCRPD."
        },
        {
            "heading": 3,
            "text": "What is the UNCRPD? "
        },
        {
            "text": "The UNCRPD stands for the United Nations Convention on the Rights of Persons with Disabilities, which was adopted by the UN General Assembly by its resolution 61/106 of 13 December 2006. "
        },
        {
            "text": "It came into force on 3 May 2008 upon the 20th ratification. The UK has been signed up to the UNCRPD since 2009."
        },
        {
            "text": "Since 2008, 14 sessions of the Conference of States Parties have been held at United Nations Headquarters, New York. This year, COSP15 will be held from 14 to 16 June 2022. "
        },
        {
            "heading": 3,
            "text": "What is the UK doing? "
        },
        {
            "text": "Our Minister for Disabled People will be attending COSP15 and will be reading out the UK’s statement during the General Debate on 14 June. The UK will also be hosting a UK ‘side event’ on ‘Increasing Disability Employment’, building on one of the sub themes for COSP15: “Economic empowerment and entrepreneurship of persons with disabilities”. It will feature a panel discussion and speakers include Mike Adams of Purple, and the Minister for Disabled People, Health and Work."
        },
        {
            "text": "The UK Government recently met its commitment to have one million more disabled people in employment over 10 years. The side event will focus on this, and share best practice across different sectors. You can get involved by registering for our hybrid side event here.   "
        },
        {
            "text": "The event will include presentations on how the UK is:"
        },
        {
            "heading": 3,
            "text": "What are the themes for this year’s meeting? "
        },
        {
            "text": "Each session of COSP is focused on a specific set of themes, with member nations and civil society organisations coming together to discuss best practice and agree on commitments to deliver for disabled people. "
        },
        {
            "text": "The overall theme for this year is: Building disability-inclusive and participatory societies in the COVID context and beyond."
        },
        {
            "text": "This is an important time to discuss innovation and economic empowerment for disabled people, as we recover from the pandemic and get ready to tackle the cost of living crisis around the world. "
        },
        {
            "text": "More and more employers are recognising the value that disabled people can bring to their business and to their bottom lines. But many employers still lack the confidence, knowledge, processes and skills they need to support disabled staff effectively. Through the Disability Confident scheme, the UK Government is working with employers to change attitudes and create employment opportunities by enabling businesses to recruit and retain disabled people in their workplace. "
        },
        {
            "text": "Sub theme 1: Innovation and technology advancing disability rights"
        },
        {
            "text": "Sub theme 2: Economic empowerment and entrepreneurship of persons with disabilities"
        },
        {
            "text": "Sub theme 3: Participation of persons with disabilities in climate action, disaster risk reduction and resilience against natural disasters"
        },
        {
            "heading": 3,
            "text": "What will the Minister for Disabled People say in her statement? "
        },
        {
            "text": "The UK is committed to implementing the UN Convention on the Rights of Persons with Disabilities. This is through legislation like the Equality Act 2010 and the new British Sign Language Act 2022, and policies that tackle the barriers faced by disabled people, in order to realise their full participation and inclusion in society."
        },
        {
            "text": "We want to help people start, stay and succeed in work. Last month the Government met the commitment made in 2017 to see one million more disabled people in employment – in half the time expected.  We’re aiming to prevent health-related job losses too."
        },
        {
            "text": "Recognising the need for wider societal change, our 19 Disability and Access Ambassadors are using their expertise and influence in business, driving and supporting changes in access for disabled consumers and employees."
        },
        {
            "text": "We recognise the importance of co-ordinated action across government, reflecting the full range of services and opportunities that deliver participation and inclusion. Our Ministerial Disability Champions are driving forward work on disability in their respective departments."
        },
        {
            "text": "We continue to engage with disabled people to ensure their needs are considered, including in the Government’s COVID-19 response and recovery efforts."
        },
        {
            "text": "As we continue to rebuild from the global impact of COVID, our work on global disability rights is more urgent than ever."
        },
        {
            "text": "The UK remains steadfast in our commitment and co-hosted the first Global Disability summit in 2018. That pivotal moment has become a movement."
        },
        {
            "text": "At the second Global Disability Summit this February, we launched the FCDO Disability Inclusion and Rights Strategy. It reaffirms the UK’s commitment to act as a global leader, recognising disabled people – in all their diversity - must have greater voice, choice, and visibility to enjoy their full rights and freedoms."
        },
        {
            "text": "It sets out our ambitious approach for our work with - and for - disabled people around the world. Across education to health; economic empowerment to humanitarian action; social protection to climate change "
        },
        {
            "text": "As we speak, Russia continues with its unprovoked, reprehensible attack on Ukraine. The deteriorating humanitarian situation is having a devastating and disproportionate impact on the most vulnerable – and many of the 2.7 million disabled people in Ukraine have been left behind."
        },
        {
            "text": "That is why we are strengthening our focus on reaching the most vulnerable, as part of which we are entering a new £15m partnership with UNICEF in Ukraine."
        }
    ]
}