{
    "url": "https://defrafarming.blog.gov.uk/2024/11/06/a-commissioner-for-the-tenant-farming-sector/",
    "title": "A commissioner for the tenant farming sector ",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Tenanted sector"
    ],
    "pub_date": "2024-11-06T12:54:59+00:00",
    "content": [
        {
            "text": "Today, at the Northern Farming Conference, Food Security and Rural Affairs Minister Daniel Zeichner shared that there will be a commissioner for the tenant farming sector in England. "
        },
        {
            "text": "This role, the first of its kind in England, will address one of the recommendations from the Rock Review, to improve relationships and collaboration between tenant farmers, landowners and advisers.  "
        },
        {
            "text": "Tenant farmers play a crucial role in ensuring England's food security, maintaining rural livelihoods and advancing environmental goals. Positive relationships between tenants, landlords and advisors are essential for a fair and sustainable sector, guided by the principles in the Agricultural and Tenant Code of Practice.  "
        },
        {
            "text": "We recognise the need to balance the rights, interests and obligations of both tenant farmers and landlords. "
        },
        {
            "text": "Many tenant landlord and adviser relationships work very collaboratively and positively to navigate and balance their interests for mutual benefit. This post includes some examples of good practice.  "
        },
        {
            "text": "However, this is not always the case. The Rock Review identified examples of both good and bad practice in the sector and highlighted that poor conduct on either side can lead to a breakdown in communication and stress, limiting the ability of the farm business to thrive. "
        },
        {
            "text": "The appointment of a commissioner will provide a neutral point of contact for all parties in the sector who have concerns about poor conduct helping to facilitate collaboration and solutions for all parties.  "
        },
        {
            "heading": 2,
            "text": "The role of the commissioner "
        },
        {
            "text": "The commissioner for the tenant farming sector will hold an influential role as both an advocate and a mediator for tenant farmers, landlords and advisers.  "
        },
        {
            "text": "The commissioner’s presence seeks to reinforce transparency and trust, encouraging fairness and collaboration across the tenanted sector. The commissioner will be appointed by Defra and will work closely with the Farm Tenancy Forum providing regular reports on the concerns and issues raised to help track industry trends and offer advice on improving practices across the sector. "
        },
        {
            "text": "The commissioner’s responsibilities will include: "
        },
        {
            "text": "This appointment will be made through an open competition. The aim is to make an appointment by spring next year. "
        },
        {
            "text": "The role is non-statutory. While the commissioner will not have statutory powers to issue penalties or publicly identify poor practices, their influence lies in fostering cooperation, trust and effective mediation to achieve solutions together.  "
        },
        {
            "text": "After 2 years, the role of the commissioner and the non-statutory approach will be evaluated to determine its effectiveness and if statutory powers may be required in the future. The review will be conducted in consultation with the Farm Tenancy Forum. "
        },
        {
            "heading": 2,
            "text": "Supporting rural communities "
        },
        {
            "text": "The government’s strategy prioritises optimising schemes to benefit farmers, especially those managing tenanted land. "
        },
        {
            "text": "This initiative, along with the commissioner’s advocacy, renews the focus on recognising and addressing the unique challenges that the tenanted farming sector faces.  "
        },
        {
            "text": "The commissioner ensures that the sector gets the attention it needs, supporting a fair, balanced, and collaborative environment to thrive. "
        },
        {
            "text": "For more details on the Farm Tenancy Forum’s membership and terms of reference, please visit Farm Tenancy Forum: terms of reference from 2024. "
        },
        {
            "text": "As soon as the recruitment process for the commissioner is launched, in the coming weeks, we’ll update this post.  "
        }
    ]
}