{
    "url": "https://marinedevelopments.blog.gov.uk/2024/11/06/coastal-planner-corner-2/",
    "title": "Coastal Planner Corner",
    "authors": [
        "David Patrick, Digital Communications Manager"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2024-11-06T10:05:12+00:00",
    "content": [
        {
            "text": "The MMO have marine planners based around the English coast. Their role is to engage with you for the development, implementation, and monitoring of marine plans. You can find out who your local coastal planner is and their contact details here"
        },
        {
            "text": "North East"
        },
        {
            "text": "Amy's new role focusing on marine plan use has allowed Kathleen to take on the North East role and attend the Durham Heritage Coast Partnership forum, which highlighted projects on local heritage, coastal appreciation, and marine conservation. Earlier this summer, Amy led a marine planning session for the Whitby Community Group, engaging a range of local stakeholders and including a valuable Q&A session on community views. We are now preparing for our North East marine planning workshop, one of several sessions being held around the country and online. You can sign up here."
        },
        {
            "text": "East"
        },
        {
            "text": "Mark and Char have been strengthening relationships with stakeholders in their respective East (North) and East (South) regions in preparation for the next stage of the East Marine Plan replacement: Issues with Supporting Evidence (IwSE). This work has included preparing and leading successful internal MMO IwSE workshops, as well as focusing on stakeholder outreach and promoting the in-person external IwSE workshops."
        },
        {
            "text": "South East"
        },
        {
            "text": "Marie has been strengthening connections with external stakeholders and internal MMO teams. During site visits, she visited West Mersea on the Blackwater Estuary to learn about the RSPB Beneficial Use of Dredged Sediment (BUDS) project, which uses sediment from Harwich Harbour Authority to protect eroding islands that support wetland bird species. Marie also joined a site visit to the Eastbourne to Pevensey Bay Coastal Management Scheme, designed to manage the coastline over the next 100 years, reducing flood and erosion risks while benefiting the community and environment."
        },
        {
            "text": "South"
        },
        {
            "text": "Charlotte and Kirstyn recently shadowed Poole Marine Officer Thomas Havelock as part of our fisheries stakeholder prioritisation work. This provided valuable insights into his role and the critical work of the enforcement team, including fisheries and marine protected area inspections. We also had a chance to refresh our fish identification skills! Charlotte attended a meeting for the Pevensey to Eastbourne Coastal Management Scheme, one of the largest Flood and Coastal Erosion Risk Management Schemes in the country. It was a valuable chance to learn about their approach to managing the 15km coastline and connect with various stakeholders."
        },
        {
            "text": "Image of the South of Portland Marine Conservation Zone taken by Charlotte Stadden"
        },
        {
            "text": "South West"
        },
        {
            "text": "Mae led an implementation session for Cornwall Council’s planning team, establishing a productive relationship to help integrate marine plans into their decision-making. Mae and Charlotte facilitated a training session for South Hams District Council’s planning team, emphasising the importance of cross-border collaboration and integrating marine and terrestrial approaches for managing intertidal areas. On the 14 November, the Marine Management Organisation and Welsh Government Marine Planning teams will co-host an event to support cross-border marine planning in the Severn Estuary. For more details and to sign up, please visit the Eventbrite page."
        },
        {
            "text": "North West"
        },
        {
            "text": "In October, Chloe attended the Liverpool Bay coastal subgroup meeting, where the Liverpool City Region Combined Authority shared updates on the Mersey Tidal Power Project. The first public consultation is now open, inviting local input on the initial tidal barrage proposals for the River Mersey. We are in the early stages of collaborating with the North West Coastal Group and the Welsh Government to ensure there is alignment between the North West Shoreline Management Plan (SMP) and other policies. The North West SMP, also known as Cell 11, covers the area from Great Orme’s Head in North Wales to the Scottish Border."
        }
    ]
}