{
    "url": "https://cyberandspecialistoperationscommand.blog.gov.uk/2024/11/06/early-battles-to-lifelong-passion/",
    "title": "Early battles to lifelong passion",
    "authors": [
        "bobsendall"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2024-11-06T10:26:08+00:00",
    "content": [
        {
            "text": "As part of the Defence Experimentation and Wargaming Hub’s People in Wargaming series we recently spoke to a panel of people/experts about their experiences in the field of wargaming."
        },
        {
            "text": "Interviewer: Can you briefly introduce yourself?  "
        },
        {
            "text": "Tess: I am Tess Butler, CEO of Ruddy Nice and Defence Simulation Education and Training (DSET Ltd). I'm also a founding director of Fight Club International and Owner of the Wargaming Studio in Salisbury."
        },
        {
            "text": "Interviewer: What drew you into wargaming?  "
        },
        {
            "text": "Tess: It was my grandmother; she introduced me to wargaming when I was a child, as something to occupy me whilst she looked after me and siblings. She had learned wargaming concepts during the Second World War with some of her girlfriends and then taught my father. I didn't really look at wargaming properly until I was about 16 years old. In the beginning it was historical wargaming. "
        },
        {
            "text": "My first degree was in Russian and Soviet studies. I did a lot of wargaming of the siege of Leningrad and the battle around Stalingrad. That was an early interest. Then I moved on to the Napoleonic Wars, Austerlitz and things like that before coming into military modelling, simulation and training. That then blended everything together."
        },
        {
            "text": "Interviewer: Can you briefly describe your role/experience in wargaming? Tess: I’ve been professionally wargaming for around 25 years, looking at everything from game design to delivery, including facilitation. Everything to do with wargaming end to end, basically. I have delivered wargames into business environments, the military, government, and academia in multiple countries. I am currently studying for my PhD in Wargaming, analysing how different demographics wargame. "
        },
        {
            "text": "I’m particularly focused on women, and Gen Z & Alpha."
        },
        {
            "text": "Interviewer: What are some of the key skills required for success in the wargaming field?   "
        },
        {
            "text": "Tess: I think it depends on your role within wargaming because there are many different skills depending on what you'd like to do with wargaming."
        },
        {
            "text": "If you're mathematics or engineering orientated, then game mechanics is a good area for you to be in. If you're a researcher and you love data and you love deep diving into things, then data validation and verification of wargaming will appeal. Not everybody has to run a wargame, but facilitation is a key part of it. I think some of the best facilitators are those that are not afraid to create a narrative around things to help the players feel more immersed. In fact, there's some PhDs and studies going on at the moment about immersion and how important that is to get a really good output, so that you're putting yourself into the blue mindset, or indeed red."
        },
        {
            "text": "Lastly, analysis is key to deliver genuine outcomes that are useful to strengthening our Defence capability, advising leadership, and coming to the correct conclusions, if there are any to come to."
        },
        {
            "text": "Interviewer: What current trends are you seeing in wargaming?  "
        },
        {
            "text": "Tess: I think trends might be the wrong word. Wargaming is a zeitgeist. At the moment, everyone is like, ‘oh, wargaming is sexy’. And let me tell you, as a wargaming nerd, I never expected this! I think there are diverging thoughts. There are some, let's call them traditional wargamers, who are all about the tabletop and the manual game. Then there are those looking at hybrid; a manual delivery of a wargame but with digital capture of the data. Then there are those that think that digital wargaming is the only way forwards. There are issues with all of them and there are some digital wargames that are really good at what they do for a specific purpose, usually in the tactical space. After the initial question of ‘does this challenge need a wargame?’, the next question should be ‘what kind of wargame is fit for purpose?’"
        },
        {
            "text": "If we're going to purport that wargaming is the answer to some of Defence’s questions, we really need to see that the data is reused and able to be shared easily so that as many people as possible can benefit from that wargaming experience. This is because you might only get the players that you need around the table once so let's make sure that any data or information that comes out of it can be easily disseminated, effortlessly shared, and more easily acted upon."
        },
        {
            "text": "Interviewer: How do you think wargaming will evolve over the next five years?  "
        },
        {
            "text": "Tess: We need to embrace technology as wargamers. I live, breathe, eat, and sleep simulation as well as lots of different technologies for training and education. Wargaming can be used for training and education, but also for research and development, business planning, and operational planning (verging on Computer Assisted Exercises). I think there needs to be a bit of a mind shift.A bringing together of digital wisdom, so that we can get the best out of things in that environment because if you want to run wargames rapidly, the only way to do it is with a digital answer. We won’t always have time to design and build a game that's perfect for the idea. Sometimes it might be that we've got an 80% solution with an existing manual game, and we adapt it. I think the rapidity and agility in wargaming needs to speed up."
        },
        {
            "text": "Interviewer: What is your favourite wargame and why?  "
        },
        {
            "text": "Tess: I love finding new games, new ways of thinking or playing with a new set of people; so, the same game will come out differently when you play with different people."
        },
        {
            "text": "My favourite wargame would be whatever wargame I'm going to play next because I don't know what it's going to be like. I don't know who's going to be playing with me. I don't know what the outcomes are going to be and that's really exciting! #WargamingNerd."
        },
        {
            "text": "Interviewer: What do you see as the biggest challenge facing Defence Wargaming?   "
        },
        {
            "text": "Tess: There are two things; the digitisation of wargaming, which we've touched on earlier, and diversity."
        },
        {
            "text": "There is very little diversity in the wargaming community, both with the Military Operations Research Society survey and the survey that we conducted from DSET. Only 2% of professional wargamers are female, and only 4% are under the age of 28. "
        },
        {
            "text": "Somebody asked me recently, why do we need women in wargaming? Why do we need women in Defence? Why do we need women in the Armed Forces? My answer is very simple, women are dangerous! They are half of the enemy and therefore should be half of your defence! The end goal is diversity of thought which produces better outcomes and is critical for operational and mission success. "
        },
        {
            "text": "We need to make diversity a Defence priority and make it a critical point rather than a nice to have."
        },
        {
            "text": "Interviewer: What advice would you give to someone aspiring to enter the wargaming industry?  "
        },
        {
            "text": "Tess: One of the things I found very early on was I always had to knock down doors or ask for entry. Rather than people always having to push into our community, it's up to us as a community to reach out and pull people in. What people reading this should do is just join in a wargame, go online, go on to Fight Club International. There's a really good resource there for wargaming primers as well as little videos and it's really accessible. Joining Fight Club is free and gets you into gaming. Readers can even reach out to me and say, look, I'd love to come and play a game. We've got a wargaming studio down in Salisbury that's open 24/7 and you can book to come in and learn how to game."
        },
        {
            "text": "Wargaming, as a term, is actually a bit of a misleading term, it's really about critical thinking and decision-making. We're working with a veteran’s homeless charity, for example, creating a peace-game for them. It’s still a wargame, but it's focused on post-conflict resolution, so don't get hung up on that word ‘Wargaming’. Serious gaming can look at a variety of different aspects to help in business or in your life."
        },
        {
            "text": "Interviewer: What drives you as an individual?  "
        },
        {
            "text": "Tess: I’m a woman of action! It feels like we’ve got so much to do and so little time! I was kind of hanging on by my fingertips in wargaming, because I wasn't welcome as a woman in this space, actively prevented from participating, especially as a young civilian woman. I was questioned all the time about my knowledge, abilities, dress (!), and so much more. I don't want that for anybody, but especially not the next generation of talent coming through. We need clever young people to come into this space, so we need to be a safe and happy space for people to be able to come and say “I love it!”."
        }
    ]
}