{
    "url": "https://buyingforschools.blog.gov.uk/2024/11/06/getting-your-school-or-trust-ready-for-new-recycling-regulations/",
    "title": "Getting your school or trust ready for new recycling regulations",
    "authors": [
        "Amanda Quinn, Education Procurement Category Manager at YPO"
    ],
    "categories": [
        "Advice and support"
    ],
    "pub_date": "2024-11-06T12:23:02+00:00",
    "content": [
        {
            "text": "In this blog post, Amanda Quinn, Education Procurement Category Manager at YPO, highlights new, simpler recycling regulations coming into force in 2025 and the action that schools and trusts will need to take to be compliant."
        },
        {
            "text": "In 2023, the UK Government announced a new recycling plan that aims to create a new, simpler common-sense approach to recycling. The new requirements aim to improve recycling rates and standardise recycling practices by having a simpler recycling system where we can recycle the same items at home, work or school."
        },
        {
            "text": "All schools in England must comply with the new regulations. From 31 March 2025, recycling and collection measures for all types of recyclable waste are required to be in place in your school, except garden waste and plastic film. "
        },
        {
            "text": "For schools, this includes:"
        },
        {
            "text": "• Food waste• Glass (bottles, jars)• Metal (aluminium and steel tins, cans, foil)• Plastic (bottles, tubs, trays, containers)• Paper (envelopes, magazines, copier paper, shredded paper)• Cardboard (cardboard boxes, corrugated cardboard)"
        },
        {
            "text": "The legislation changes how food waste is collected and aims to stop food waste from going to landfill. Food waste can no longer be placed in general/non-recyclable waste bins or mixed with other recyclable materials and must be put into a specific food waste container for collection."
        },
        {
            "text": "Schools can use the same bin for dry mixed recycling of glass, metal, plastic, paper and cardboard. This means that you will need a minimum of three waste containers (bins, boxes or bags)."
        },
        {
            "text": "These changes should help schools cut recycling costs as well as increase recycling rates to support your sustainability goals."
        },
        {
            "text": "The plan also aims to crack down on unscrupulous waste operators who do not follow proper procedures to ensure waste ends up where it is supposed to. A digital system for waste tracking will be introduced to gather data on what is collected and reduce illegal waste activity."
        },
        {
            "text": "The collection of plastic film will begin from 31 March 2027."
        },
        {
            "text": "How schools and trusts can get ready for 31 March 2025 deadline"
        },
        {
            "text": "To get ready for these changes, make sure that you have appropriate bins and enough of them. You might want to think about colour coding and labelling your bins so that everyone can easily identify which bin is for what waste stream."
        },
        {
            "text": "It is crucial to note that where the new recycling criteria were not initially included in a framework's specification before the announcement of the new legislation, these criteria should be incorporated into your specification during the further competition stage. This ensures that your procurement process aligns with the latest environmental requirements and promotes sustainable practices, even if the original framework predates the new recycling regulations."
        },
        {
            "text": "You should ensure staff and pupils alike understand the importance of recycling and how to do this properly."
        },
        {
            "text": "It is also a good idea to provide signage, posters and guidelines on what needs to be recycled and in what bin. You may want to undertake a waste audit to assess your school’s waste management processes."
        },
        {
            "text": "If you are already separating and recycling food waste, your next step is to assess your current practices to ensure they comply with the new recycling plan. You can ensure compliance by using commercial waste collection services and licensed waste carriers who adhere to the new regulations."
        },
        {
            "text": "Do you need help to buy waste management services?"
        },
        {
            "text": "Use the DfE’s Find a Framework tool to explore the range of DfE approved frameworks that offer waste management solutions."
        },
        {
            "text": "One of the DfE approved frameworks that covers waste management is YPO’s Building in Use - Support Services (879) Dynamic Purchasing System (DPS). The DPS is open to new suppliers to join at any time, providing they meet our selection criteria."
        },
        {
            "text": "This means any new suppliers or local waste management providers you might already use can apply to join at any time. You can include the requirement to meet the new recycling criteria set to come into effect from March 2025 in your procurement, ensuring your waste management solutions are future-proofed."
        },
        {
            "text": "If you need help with your buying, contact Get help buying for schools for support to buy for your school or trust. We can help you navigate the buying process, including incorporating the new regulations to buy compliantly, save you time, and secure great value for your school or trust."
        },
        {
            "text": "If you’ve found this article useful and want to learn more about how we’re supporting schools, click ‘sign up and manage updates’ to subscribe to our blog and receive notifications when we next post."
        }
    ]
}