{
    "url": "https://healthmedia.blog.gov.uk/2024/11/06/improving-the-mental-health-act-what-you-need-to-know/",
    "title": "Improving the Mental Health Act: what you need to know",
    "authors": [
        "cnewton"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2024-11-06T11:07:43+00:00",
    "content": [
        {
            "text": "The Mental Health Act is changing to give patients a greater say over their care and to improve their experiences, whilst protecting them, staff and the general public."
        },
        {
            "text": "But how is it changing?"
        },
        {
            "text": "In this explainer post, we’ll answer some questions you might have about this update and tell you everything you need to know about our plans.  "
        },
        {
            "text": "What is the Mental Health Act?"
        },
        {
            "text": "The Mental Health Act (1983) provides the legal framework to detain and treat people in a mental health crisis, who are at risk of harm to themselves or others.  "
        },
        {
            "text": "The purpose of the Act is to make sure that patients get the vital treatment they need in a place that is safe for both them and others."
        },
        {
            "text": "If a patient is well enough to leave hospital but still needs extra support, the Act also gives clinicians the power to arrange a Community Treatment Order. This is where patients are required to meet certain conditions set by their clinician and receive supervised care in their community."
        },
        {
            "text": "Why does it need updating?"
        },
        {
            "text": "The Mental Health Act is woefully outdated and needs urgent reform. Our understanding of mental illness has changed since the act was drafted and too many patients have felt let down."
        },
        {
            "text": "It does not reflect the 21st century values of personalised case, greater patient autonomy, dignity and respect."
        },
        {
            "text": "Detained patients currently have too little say over their care and treatment or who should be involved in it, such as family members and carers."
        },
        {
            "text": "In his independent review of the Mental Health Act, Professor Sir Simon Wessely found rising numbers of detentions, racial disparities, and poor patient experiences – especially for autistic people and those with a learning disability."
        },
        {
            "text": "For example, black people are 3.5x more likely to be detained under the Act than their white counterparts."
        },
        {
            "text": "This government is bringing forward major reforms to make the Act fit for the 21st century."
        },
        {
            "text": "What do the changes do?"
        },
        {
            "text": "Our reforms will give patients stronger rights and ensure care is more appropriate, and effective - helping to protect them, staff and the wider public."
        },
        {
            "text": "The Mental Health Act will continue to provide clinicians the powers to admit and treat people if they become a risk to themselves and others."
        },
        {
            "text": "But we’re making laws clearer so that individuals should only be detained if their mental health condition means that they are a risk of serious harm to themselves or others, and where treatment in detention has a reasonable prospect of helping them."
        },
        {
            "text": "By requiring clinicians to review a patient’s treatment more frequently, we will make sure that the care patients receive always meets their needs and is appropriate."
        },
        {
            "text": "We will end the inappropriate use of police cells to detain someone experiencing mental health crisis, so that patients get access to a facility where they can get the proper support, such as a hospital."
        },
        {
            "text": "Patients and their families or friends will also be given more of a say so that they can input into decisions around treatment, helping to support them better."
        },
        {
            "text": "In addition, clinicians will be required to engage with patients when creating new statutory Care and Treatment Plans and to consider a patient’s wishes and feelings, including those in their Advance Choice Document, that our reforms will introduce as part of clinical decision making."
        },
        {
            "text": "We want to limit the length of time that people with a learning disability and autistic people can be detained under the Act if they do not have a co-occurring mental health condition that needs hospital treatment and have not committed a criminal offence. We’re also putting in requirements to review people’s needs to help get the care and support that is right for them."
        },
        {
            "text": "How will this impact the safety of the public?"
        },
        {
            "text": "Public safety is paramount."
        },
        {
            "text": "The Act is designed to ensure patients, staff and the general public are protected from the consequences of severe mental illness."
        },
        {
            "text": "This Bill will introduce a new requirement for the Responsible Clinician to consult another person before discharging a patient."
        },
        {
            "text": "Discharge processes will also be reviewed more broadly, with Care and Treatment Plans to include  safety management plan for patients when they need one, to keep the patient and others safe."
        },
        {
            "text": "What else is the government doing to support mental health?"
        },
        {
            "text": "For those experiencing heightened mental health crises, one of the world’s first all-hours mental health crisis support service can be accessed through dialling 111, option 2."
        },
        {
            "text": "The government has recently announced that £26 million will be invested to open new mental health crisis centres as part of last week’s Budget, helping to ensure people have the support they need when they need it."
        },
        {
            "text": "For people who need support at A&E, if there is a risk to life, every emergency department in England now also has a liaison psychiatric team available to offer specialist care."
        },
        {
            "text": "A full list of mental health support options is available via the NHS.uk website. The service is also suitable for Deaf people, with tailored services available via the NHS 111 website."
        }
    ]
}