{
    "url": "https://defraenvironment.blog.gov.uk/2024/11/06/setting-the-standard-for-biodiversity-markets-in-the-uk/",
    "title": "Setting the standard for biodiversity markets in the UK",
    "authors": [
        "Ciaran Ambler"
    ],
    "categories": [
        "Green finance",
        "Nature",
        "Research and data analysis"
    ],
    "pub_date": "2024-11-06T12:26:34+00:00",
    "content": [
        {
            "text": "I’m Ciaran Ambler and I lead on voluntary biodiversity finance within Defra’s Green Finance team. "
        },
        {
            "text": "Today, we are inviting you to have your say on a fundamental part of green finance: a new Biodiversity Standard from the British Standards Institution (BSI). Read on to find out more. "
        },
        {
            "text": "Private investment in nature is crucial. Through high-integrity biodiversity markets, we can direct more funding towards restoring nature in the UK and delivering our legally binding Environment Act targets. "
        },
        {
            "text": "To encourage this, investors should be confident that nature markets – such as those for biodiversity or woodland and peatland carbon – are delivering genuine and robust environmental change.  "
        },
        {
            "text": "However, internationally, credits generated through nature markets have been criticised for not delivering actual or lasting environmental benefits. "
        },
        {
            "text": "So, how do we ensure that nature projects that generate and sell biodiversity credits deliver real and lasting environmental improvement? This is a question at the heart of the government's vision for high-integrity UK nature markets.  "
        },
        {
            "text": "Building trust in UK nature markets "
        },
        {
            "text": "As part of Defra's commitment to develop robust nature markets, we have funded BSI to deliver the UK Nature Investment Standards Programme. "
        },
        {
            "text": "This multi-year initiative will develop standards that will give confidence to land managers and corporates looking to invest, buy or sell across UK nature markets. "
        },
        {
            "text": "The BSI’s work builds on, and aligns with, wider international work to set principles for high integrity nature markets. "
        },
        {
            "text": "For example, at COP16 in Columbia, the International Advisory Panel on Biodiversity Credits launched its ‘Framework for High-Integrity Biodiversity Credit Markets’. This was co-sponsored by the UK and France. "
        },
        {
            "text": "And, in the coming months, the UK Government will also start a related consultation. It will be about potential interventions that could help to strengthen voluntary carbon and nature markets. "
        },
        {
            "text": "A new Biodiversity Standard "
        },
        {
            "text": "Biodiversity markets enable nature project suppliers (usually farmers or land managers) to sell quantified environmental improvements to buyers. These improvements might be the creation of new habitats, restoration of species populations or re-establishment of productive ecosystems. "
        },
        {
            "text": "You can see some great examples through the case studies we have developed as part of our Natural Environment Investment Readiness Fund. "
        },
        {
            "text": "The BSI’s new Biodiversity Standard (known as BSI Flex 702) is the latest output from their Standards Programme. It follows the publication of the standard for overarching principles for all UK nature markets, earlier this year (BSI Flex 701). "
        },
        {
            "text": "Why do we need this standard? "
        },
        {
            "text": "During the discovery phase of this work, BSI identified at least 23 different biodiversity schemes operating in the UK. "
        },
        {
            "text": "While this growth shows the increasing appetite for biodiversity investment, it also highlights the urgent need for a common approach. "
        },
        {
            "text": "The new standard will: "
        },
        {
            "text": "What this means for the sector "
        },
        {
            "text": "This standard will help: "
        },
        {
            "text": "Have your say "
        },
        {
            "text": "To ensure the new Biodiversity Standard works for everyone involved in green finance as well as for nature, the BSI are currently running a consultation on it.   "
        },
        {
            "text": "The consultation is open until 3 January 2025. "
        },
        {
            "text": "We want to hear from everyone involved in biodiversity markets - from nature project developers, investors and buyers to landowners and conservation experts. "
        },
        {
            "text": "Your views will help ensure this standard works for the whole sector, while maintaining the high levels of integrity needed to drive genuine biodiversity improvements. "
        },
        {
            "text": "This new standard is just the beginning "
        },
        {
            "text": "The Biodiversity Standard is just one part of our approach to nature market standards. As well as the overarching principles already mentioned, the BSI’s programme includes: "
        },
        {
            "text": "And improving standards is just one part of our wider vision for green finance in the UK. "
        },
        {
            "text": "The Defra Minister for Green Finance, Mary Creagh, recently spoke at the Nature Finance UK Conference about our wider plans. She underscored the Government's commitment to building robust nature markets, as well as outlining our wider measures for increasing private finance into nature. "
        },
        {
            "text": "Stay involved "
        },
        {
            "text": "This is just part of our journey to build robust, trusted nature markets in the UK. "
        },
        {
            "text": "To keep up with the latest developments, visit the BSI Nature Investment Standards Hub. "
        },
        {
            "text": "You can also subscribe to this blog to receive an email notification whenever we publish a new post. "
        }
    ]
}