{
    "url": "https://environmentagency.blog.gov.uk/2024/11/06/waste-crime-engagement-specialists-take-to-the-stage-at-the-environmental-services-and-solutions-expo-in-a-bid-to-stop-waste-crime/",
    "title": "Waste Crime Engagement Specialists take to the stage at the Environmental Services and Solutions Expo in a bid to stop waste crime",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Environment Agency",
        "Waste"
    ],
    "pub_date": "2024-11-06T08:10:20+00:00",
    "content": [
        {
            "text": "Waste crime is estimated to cost the UK economy around £1 billion per year. Often this money is taken away from essential services to deal with the damage caused by waste criminals. Waste crime can endanger people's safety, undercut reputable waste management companies and undermines investment in legitimate businesses."
        },
        {
            "text": "To help address this growing issue, our Waste Crime Engagement Specialists (WCES) gave a presentation at the Environmental Expo at the NEC, Birmingham last year (Creating an effective waste crime partnership – Creating a better place (blog.gov.uk). The feedback was so positive we were invited back to speak again this year. This time to raise awareness of the type and scale of waste crime that we are seeing across England and encourage the waste industry to share what information they know about rogue operators and their waste activities, to help us shut down waste criminals. Building on the success of last year, we also hosted a stand at the event."
        },
        {
            "text": "On the first day we provided the 12,000 plus delegates with a ‘call to action’ to report information on waste crime by presenting our ‘Joining the dots – Building the intelligence picture’ presentation on the Main Stage. WCES speaker, Peter Lennard said:"
        },
        {
            "text": "“Our talk was very well attended and generated lots of discussion. It provided a great opportunity to explain to the waste industry how investigations into waste crime unfold and how the information they share with us, shapes those investigations."
        },
        {
            "text": "This is particularly important as we are often unable to provide feedback on live investigations. Many of those present told us that it was good to understand how the information provided is used, and what information we need from industry, to progress investigations and stop waste crime”."
        },
        {
            "text": "Having a stage presence didn’t just allow us to showcase how we work with our professional partners, it also allowed us to inform people about how to report waste crime including via our partner Crimestoppers (0800 555 111) or directly to us in the case of wrongdoing within a business we regulate:  Whistleblowing: reporting serious wrongdoing to the Environment Agency - GOV.UK"
        },
        {
            "text": "We were joined on stage by industry leaders from the Waste Compliance Taskforce (WaCT), allowing for a debate around the waste industry and the potential intelligence that waste operators may hold. WaCT have provided great ongoing support to the Environment Agency since its inception and were invaluable in highlighting how important sharing information with the Environment Agency can be in protecting legitimate waste companies."
        },
        {
            "text": "Stuart Foster CEO of RECOUP and Chair of Waste Compliance Taskforce said:"
        },
        {
            "text": "“It stands to reason that criminal networks will target the easiest wins with the biggest financial rewards. We need to make absolutely sure the recycling and waste sector do not provide that opportunity."
        },
        {
            "text": "Perhaps the increase in both crime and regulator counter measures in recent years isn’t a surprise but the scale and complexity of waste crime should not be under-estimated."
        },
        {
            "text": "I encourage everyone to review and improve crime prevention measures, take action and protect our industries and the many legitimate companies working in the sector”."
        },
        {
            "text": "The Environment Agency’s presence was strengthened on day two, when our Deputy Director Steve Molyneux took part in the ‘Leaders in Waste’ panel discussion to a packed audience. Steve said:"
        },
        {
            "text": "“Waste crime is a blight on our communities and environment. We’re determined to stop this problem, working with the police and other government agencies. Just last year we closed more than 480 illegal waste sites and prosecuted 83 criminals, resulting in fines of over £5.7 million."
        },
        {
            "text": "We will always look to use our powers to stop waste criminals – whether by prosecuting those we believe are behind dumping waste illegally, closing down sites, or freezing criminals’ money."
        },
        {
            "text": "The waste industry has a vital role to play. If you suspect illegal waste activity is taking place, you should tell us, so we can stop rogue operators and organised criminals in their tracks.”"
        },
        {
            "text": "At our event stand it was non-stop both days with people from the water and waste industries stopping by, leaving very positive feedback, with comments like “it is hugely important to have the regulators at trade shows”. Many of our visitors wanted information and updates on legislative changes such as the Simpler Recycling Reforms, likely impacts on their business as a result of the changes to Materials Recycling Facilities rules and upcoming changes to rules around managing WEEE: Importing and exporting waste electrical and electronic equipment (WEEE) - GOV.UK."
        },
        {
            "text": "We were joined on our stand by colleagues from our national technical teams. This meant operators could ask specific waste related questions to the people who had the answers they needed; something most delegates felt was invaluable."
        },
        {
            "text": "It was a busy and valuable two days, enabling us to interact with lots of waste operators and other companies working within the waste industry. We even featured in the ESS’s Official Highlights Video! Resource & Waste Management Conference, Event | ESS Expo (ess-expo.co.uk)"
        },
        {
            "text": "It was a fantastic experience and we’re already planning for our involvement at the 2025 Expo to be bigger and better than before!"
        }
    ]
}