{
    "url": "https://educationhub.blog.gov.uk/2024/11/what-is-the-national-curriculum-and-why-is-it-being-reviewed/",
    "title": "What is the Curriculum and Assessment Review and how will it impact my child's education?  ",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Academies",
        "Curriculum",
        "Exams and qualifications",
        "Primary Schools",
        "Schools",
        "Secondary schools"
    ],
    "pub_date": "2024-11-06T15:53:40+00:00",
    "content": [
        {
            "text": "We’re holding an independent review to refresh the curriculum and statutory assessment system for 5- to 19 -year-olds, to make sure they meet the needs of every child and young person."
        },
        {
            "text": "The Curriculum and Assessment Review is being led by Professor Becky Francis CBE who is an expert in education policy, including curriculum and social inequality. The 8-week call for evidence closes on 22 November 2024."
        },
        {
            "text": "We are seeking a range of views from experts, teachers, and other education sector members, as well as parents and young people, which will aid the panel in developing their final recommendations."
        },
        {
            "text": "The review will also take evidence from stakeholders and is hosting a series of regional roadshows to hear as many views as possible."
        },
        {
            "heading": 3,
            "text": "What is the national curriculum?  "
        },
        {
            "text": "The national curriculum is a set of subjects and standards used by primary and secondary schools, so children learn the same things."
        },
        {
            "text": "It is divided into key stages and maps out what schools should be teaching. This includes what subjects are taught and what standards children should be aiming for."
        },
        {
            "text": "Most of the national curriculum was introduced in September 2014, and since then it has been updated multiple times."
        },
        {
            "heading": 3,
            "text": "Do all schools have to teach the national curriculum? "
        },
        {
            "text": "Currently, academies and independent schools don’t have to follow the national curriculum."
        },
        {
            "text": "However, following the review, all state schools, including academies, will be required to teach the national curriculum."
        },
        {
            "text": "Whilst we know that many academies already choose to follow the national curriculum, we think this is important to ensure that all children have a strong core at the heart of their education."
        },
        {
            "heading": 3,
            "text": "What kind of assessments do pupils and students have to take at school? "
        },
        {
            "text": "While at primary school, children take part in several statutory national curriculum assessments. These include:"
        },
        {
            "text": "There may be some alternative teacher assessments for some children with special educational needs and disabilities (SEND) and pupils working below the standards of the national curriculum."
        },
        {
            "text": "In key stage 4, most pupils study GCSEs and key stage 4 technical awards. Pupils are examined in these subjects at the end of key stage 4, although the assessments themselves are not statutory."
        },
        {
            "text": "Meanwhile, there’s no set curriculum for 16- to 19-year-olds in further and higher education."
        },
        {
            "text": "Learners take a range of qualification options, which may include academic, technical or vocational qualifications across different levels."
        },
        {
            "text": "Many are at level 3, although some may also study qualifications at level 2 and below."
        },
        {
            "heading": 3,
            "text": "Why is the curriculum and assessment being reviewed?  "
        },
        {
            "text": "The main purpose of the review is to ensure that the curriculum balances ambition, relevance, flexibility and inclusivity for all children and young people."
        },
        {
            "text": "The review will span from Key Stage 1 to Key Stage 5"
        },
        {
            "text": "The review will look to deliver:"
        },
        {
            "heading": 3,
            "text": "How can I and my child take part?"
        },
        {
            "text": "We want to hear from you and your children through the call for evidence."
        },
        {
            "text": "You can take part and help your child take part or record your child’s views on their behalf by downloading our easy read form to help guide you through completing the online survey."
        },
        {
            "heading": 3,
            "text": "What happens next?"
        },
        {
            "text": "The call for evidence closes on 22 November, when all the responses will be reviewed. In early 2025, an interim report will be produced outlining some key themes and initial recommendations to be explored."
        },
        {
            "text": "The review team will continue to explore these specific areas more with the aim of publishing a full report in the autumn of 2025."
        }
    ]
}