{
    "url": "https://ukhsa.blog.gov.uk/2023/05/14/one-year-on-7-things-weve-learnt-about-mpox/",
    "title": "One year on: 7 things we’ve learnt about mpox",
    "authors": [
        "Katy Sinka"
    ],
    "categories": [
        "Health Protection"
    ],
    "pub_date": "2023-05-14T09:49:08+01:00",
    "content": [
        {
            "text": "Last year, UKHSA was the first in the world to detect the 2022 mpox outbreak acting immediately to alert global health partners, control further transmission and secure vaccines for those at highest risk in the UK."
        },
        {
            "text": "A year on, case numbers have fallen dramatically, with just 10 new cases since the beginning of 2023. Vaccination has played a crucial role in protecting people from the mpox virus and reducing case numbers. People who are eligible but have not yet received 2 doses of the vaccine are being encouraged to come forward and book their first dose by 16 June 2023 and be booked in for their second dose by the end of July 2023."
        },
        {
            "text": "The 2022 outbreak was the first time an mpox outbreak like this had been observed in multiple non-endemic countries at the same time. For clinicians and scientists worldwide, this new outbreak presented many unknowns and highlighted the need for rapid research so they could better understand how the virus was being transmitted, who was affected and what interventions could be used to protect those at highest risk."
        },
        {
            "text": "A year after the first case in this outbreak was identified, we reflect on some of the key lessons we’ve learnt that have shaped our response and will influence how we limit or prevent any future outbreaks."
        },
        {
            "heading": 2,
            "text": "1) Some groups were disproportionately affected"
        },
        {
            "text": "Clinicians and scientists worked rapidly at the start of the outbreak to better understand the community transmission that was taking place in the UK. Early analysis of cases, and their contacts, found the majority of cases were men who were gay, bisexual and other men who have sex with other men – a trend that continued throughout the outbreak."
        },
        {
            "text": "Understanding who was at highest risk of exposure to mpox was crucial to the public health response in the UK, it underpinned everything from communication to vaccine eligibility. A £200,000 fund was set up to help reduce sexual health inequalities in underserved LGBT+ communities – with the aim of trialling new ways to improve sexual health and HIV outcomes."
        },
        {
            "heading": 2,
            "text": "2) How mpox is transmitted has changed"
        },
        {
            "text": "Before the 2022 mpox outbreak, transmission was primarily thought to occur between animals and humans (zoonotic transmission) through close contact with animals that had mpox. In the last year there’s been a significant amount of research to understand transmission in this outbreak, as well as regular publications of data by the UKHSA and the WHO, which is summarised in the UKHSA’s transmission review. Evidence has consistently suggested that transmission of mpox in this outbreak was mostly from close sexual contact representing a significant change in the epidemiology of mpox, with significant implications for our response and future surveillance."
        },
        {
            "heading": 2,
            "text": "3) Mpox can be transmitted before symptoms are identified"
        },
        {
            "text": "UKHSA modelling, based on a review of surveillance and contact tracing data from between 6 May and 1 August 2022 in the UK, found evidence of transmission of mpox before symptoms are identified (pre-symptomatic transmission). Researchers estimated that more than half (53%) of transmission occurred up to four days before symptoms were developed or were recognised, with an average incubation period of between 7-8 days. This was the first study to ever show pre-symptomatic transmission of a pox virus."
        },
        {
            "heading": 2,
            "text": "4) Whilst an mpox infection is mild for most people, it can also cause severe symptoms"
        },
        {
            "text": "For those who are immunosuppressed, an mpox infection can be associated with more severe symptoms. An international collaboration of clinicians, led by Queen Mary University of London and the Fight Infectious Foundation/Hospital Germans Trias of Barcelona, identified a severe form of mpox in immunosuppressed people living with advanced HIV. They called for it to be added to the World Health Organisation and Center for Disease Control and Prevention list of severe infections that are considered particularly dangerous to people with advanced HIV disease."
        },
        {
            "heading": 2,
            "text": "5) Vaccination offers strong protection against mpox"
        },
        {
            "text": "A review of monkeypox cases in England and vaccination uptake data between 4 July to 3 November 2022 indicated that a single MVA-BN vaccine dose provides around 78% protection against mpox 14 days after being vaccinated. This shows vaccination is crucial to protect those at highest risk of exposure to mpox and prevent further outbreaks."
        },
        {
            "text": "The recently launched LIMIT study aims to better understand how the body reacts to the mpox virus and produces antibodies by comparing people’s antibody levels after an mpox vaccination, an mpox infection or both to see what antibody reaction each produces and how long they last for."
        },
        {
            "heading": 2,
            "text": "6) Public awareness of mpox is key to prevention"
        },
        {
            "text": "A report into the role of vaccination and public awareness around mpox found that public awareness of monkeypox and subsequent behaviour change had a substantive impact on the mpox trajectory in the United Kingdom. It also found that the vaccine rollout was hugely important in reducing the risk of mpox resurgence in the United Kingdom over the medium term. People who are eligible but have not yet received 2 doses of the vaccine are being encouraged to come forward and book their first dose by 16 June 2023 and be booked in for their second dose by the end of July 2023."
        },
        {
            "heading": 2,
            "text": "7) There’s still more to learn"
        },
        {
            "text": "It’s with thanks to the public who have followed our advice to reduce transmission, and the NHS, public health professionals and third sector organisations who sprang into action and worked hard to bring down mpox cases, that the number of new cases reported has declined significantly. Just 10 new cases have been identified so far in 2023, with half (5) presumed acquired outside the UK, but research to better understand mpox continues."
        },
        {
            "text": "Our LIMIT study will help us understand how the body reacts to the mpox virus, an area where there has not been much research."
        },
        {
            "text": "We continue in our work with partners to avoid a resurgence of mpox and achieve our ultimate elimination goal. Vaccination is key to reducing the severity of symptoms and preventing further transmission. People who are eligible but have not yet received 2 doses of the vaccine are being encouraged to come forward and book their first dose by 16 June 2023 and be booked in for their second dose by the end of July 2023."
        },
        {
            "text": "You can find an mpox vaccination site through NHS.UK."
        }
    ]
}