{
    "url": "https://environmentagency.blog.gov.uk/2025/12/04/bathing-season-2025-storm-overflow-edm-data-analysed/",
    "title": "Bathing Season 2025 storm overflow EDM data analysed",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "EDM",
        "Environment Agency",
        "Uncategorized",
        "Water",
        "Water Monitoring"
    ],
    "pub_date": "2025-12-04T16:44:34+00:00",
    "content": [
        {
            "text": "Following the 2025 DEFRA bathing water classifications, we are sharing an update on storm overflow performance associated with bathing waters across England for the 2025 season (15 May to 30 September). This year has seen an overall improvement: both the frequency and duration of storm overflow events has reduced."
        },
        {
            "text": "Storm Overflow Performance"
        },
        {
            "text": "The data for 2025 shows:"
        },
        {
            "text": "· Average spills per overflow: 5.9, down from 7.7 in 2024."
        },
        {
            "text": "· Average spill duration: 2.8 hours, compared to 3.9 hours last year – a reduction of 1 hour and 6 minutes."
        },
        {
            "text": "· Total number of spills: 6,780, a significant decrease from 8,704 in 2024."
        },
        {
            "text": "Bathing Water Connections"
        },
        {
            "text": "The number of storm overflows associated with designated bathing waters has increased slightly. Storm overflows affecting bathing waters are reviewed periodically and can lead to flux in year-to-year numbers:"
        },
        {
            "text": "· 2025: 1,140 overflows"
        },
        {
            "text": "· 2024: 1,135 overflows"
        },
        {
            "text": "Seasonal Context "
        },
        {
            "text": "Overall, summer rainfall was below average, with August recording just 62% of the UK’s typical rainfall."
        },
        {
            "text": "The bathing water season for 2025 was a drier than average year. Storm overflows stop wastewater backing up when rainfall and/or snowmelt overwhelms sewers. As such we would expect them to operate less when the weather is dry."
        },
        {
            "text": "How we use EDM data "
        },
        {
            "text": "We put permits in place for storm overflow operation to ensure they are only used when they should be – during times of rainfall and snowmelt. Event Duration Monitor (EDM) data is a vital regulatory tool. As of the end of 2023, 100% of storm overflows were fitted with an EDM, and since the 1st of January 2025, water companies have been required to publish this data in near real time. This gives us full oversight of the whole overflow network, closing a major transparency gap in the water industry. We use EDM data to plan what investigation and improvement work from water companies needs to take place, and to work with water companies and local partners to act where needed."
        },
        {
            "text": "Bathing water quality has improved significantly since the 1990s following decades of regulation, investment and partnership work but we know there is more to do to tackle all sources of pollution and support continued progress across sites."
        },
        {
            "text": "From our early work pushing companies to install event duration monitors, to carrying out the biggest number of inspections yet, we have consistently focused on measures that will deliver real improvements to water quality through reducing overflow use."
        },
        {
            "text": "Using our Event Duration monitor analysis, we have worked with partners to secure £10.2bn from water companies to improve storm overflows in England as part of the Water Industry National Environment Programme (WINEP) announced earlier this year. You can view investment in your local area using our new WINEP interactive maps."
        },
        {
            "text": "We are also updating water company permits to include spill frequency thresholds in line with the targets in the Government’s Storm Overflow Discharge Reduction Plan and, since January this year, all dry day spills – no matter how small – are now classified as pollution incidents."
        },
        {
            "text": "In 2024, through the renewal of Environmental Permitting Regulations (EPR) water quality charges, we secured funding for 400 new roles focusing solely on the water industry, allowing us to more than triple our number of inspections and raise water company performance."
        },
        {
            "text": "The Water (Special Measures) Act (WSMA), further strengthens our regulatory approach through stronger powers, new duties and better data. This will allow us to have an even better understanding of overflow use and their impact on bathing waters and take stronger enforcement action against environmental lawbreakers."
        }
    ]
}