{
    "url": "https://ipo.blog.gov.uk/2025/12/04/cymraeg-yn-yr-ipo-y-daith-hyd-yn-hyn/",
    "title": "Cymraeg yn yr IPO - y daith hyd yn hyn",
    "authors": [
        "Jenny Manders"
    ],
    "categories": [
        "Cymraeg / Welsh language blog",
        "IPO",
        "Patents",
        "Trade marks"
    ],
    "pub_date": "2025-12-04T16:49:21+00:00",
    "content": [
        {
            "text": "English translation (link) "
        },
        {
            "text": "Cafwyd moment ychydig flynyddoedd yn ôl pan sylweddolodd tîm y Gymraeg yn yr IPO, sefydliad sydd â'i bencadlys yng Nghymru, y gallem fod yn gwneud llawer mwy i ddarparu dewis dwyieithog i'n cwsmeriaid sy'n siarad Cymraeg. "
        },
        {
            "text": "Ychydig dros flwyddyn yn ôl, dechreuodd ein tîm digidol gam cyntaf rhaglen i ddarparu gwybodaeth a gwasanaethau digidol craidd dwyieithog Saesneg/Cymraeg i gwsmeriaid ar ein tudalennau gwe Gov.UK. Dyma lle rydyn ni wedi cyrraedd hyd yn hyn.   "
        },
        {
            "heading": 3,
            "text": " Y Swyddfa Eiddo Deallusol yng Nghymru – lle dechreuodd ein taith Gymreig"
        },
        {
            "text": "Yn yr 1980au y symudwyd pencadlys yr IPO (a elwid bryd hynny yn Swyddfa Batentau Prydain) i Gymru, gan agor ei drysau i groesawu gweithlu o Dde Cymru. Yn 2007, ynghyd â busnesau ledled Cymru, gweithredodd IPO ei Gynllun Iaith Gymraeg o dan Ddeddf yr Iaith Gymraeg 1993, gan ymrwymo i ymgorffori defnydd o’r Gymraeg yn ei weithgareddau busnes ‘fel y bo’n briodol a lle bo’n rhesymol ymarferol’.  "
        },
        {
            "text": "Mae ein Cynllun Iaith Gymraeg yn esbonio beth mae'r Swyddfa Eiddo Deallusol (IPO) yn ei wneud i sicrhau bod y Gymraeg a'r Saesneg yn cael eu trin yn gyfartal pan ydyn ni'n darparu gwasanaethau cyhoeddus yng Nghymru (dolen) IPO Cynllun Iaith Gymraeg  (Dogfen MS Word, 61.9 KB)."
        },
        {
            "heading": 3,
            "text": "Gwasanaethu ein cwsmeriaid sy'n siarad Cymraeg "
        },
        {
            "text": "Er ein bod yn gwybod ein bod ni ar daith fawr, mae'r tîm sy'n hyrwyddo defnyddio'r Gymraeg yn yr IPO eisoes wedi cyrraedd rhai cerrig milltir.  "
        },
        {
            "text": "Cymraeg ar y wefan "
        },
        {
            "text": "Er bod cwsmeriaid a oedd yn ysgrifennu atom yn y Gymraeg eisoes yn derbyn ateb ysgrifenedig yn y Gymraeg, roedd cydnabyddiaeth y gallem fod yn gwneud mwy fel sefydliad i roi dewis dwyieithog o wybodaeth a gwasanaethau iddyn nhw ar-lein hefyd. "
        },
        {
            "text": "Yn 2024 dechreuodd ein tîm digidol gyfieithu tudalennau gwe lefel uchaf Gov.UK yr IPO. Dechreuodd y gwaith gyda'r gwasanaeth ymgeisio am nodau masnach, gan gynnwys cyfieithu ffurflenni ar-lein a fydd yn galluogi ein cwsmeriaid i gwblhau rhai trafodion yn y Gymraeg os ydyn nhw'n dewis. Gallwch weld y stori yma (dolen):  Y Swyddfa Eiddo Deallusol yn lansio gwefan ddwyieithog yn rhan o'i hymrwymiad i'r Gymraeg - GOV.UK  "
        },
        {
            "text": "Esboniodd Rheolwr Strategaeth Ddigidol yr IPO, Mark Juffs, beth mae hynny wedi'i olygu: "
        },
        {
            "text": "Pobl yr IPO sy'n siarad Cymraeg "
        },
        {
            "text": "Er mwyn darparu gwasanaethau cymorth proffesiynol i'n cwsmeriaid sy'n siarad Cymraeg, mae angen i ni gynnal sylfaen dda o sgiliau Cymraeg o fewn y gweithlu. Mae yna awydd a hyder gwirioneddol ymhlith pobl IPO i ddefnyddio unrhyw Gymraeg sydd ganddyn nhw, yn hytrach nag aros am ruglder a pherffeithrwydd. Mae gan y swyddog iaith Gymraeg, Sue Emery, y dasg o wneud y defnydd gorau o'r Gymraeg o fewn yr IPO. Esboniodd hi: "
        },
        {
            "text": "Mae John Chick, arweinydd iaith Gymraeg IPO, yn amlwg yn falch o’r cynnydd sydd wedi’i wneud i godi proffil y Gymraeg yn fewnol, gan roi clod i’r tîm o bobl ymroddedig sydd wedi gwneud i hyn ddigwydd.   "
        },
        {
            "text": "Fe wnaeth John esbonio sut mae llwyddiant y fenter yn rhannol oherwydd cefnogaeth o'r brig, gyda dau aelod o'r bwrdd yn siaradwyr Cymraeg rhugl a thrydydd yn gweithredu fel noddwr y bwrdd ar gyfer defnyddio'r iaith Gymraeg yn fewnol.    Mae ef ymhlith y cyntaf i gytuno mai dyddiau cynnar yw’r rhain i’r IPO yn ei hymdrechion iaith Gymraeg:"
        },
        {
            "text": "#DefnyddiaDyGymraeg"
        },
        {
            "text": "Os oes angen fersiwn Cymraeg o unrhyw un o’n ffurflenni / llyfrynnau gallwch e-bostio information@ipo.gov.uk neu ffonio 01633 813 768. "
        },
        {
            "heading": 2,
            "text": "Use of Welsh language in the IPO - the journey so far"
        },
        {
            "text": "Cyfieithiad Cymraeg"
        },
        {
            "text": "There was a conscious moment a few years ago when the Welsh language team at the IPO, an organisation headquartered in Wales, came to the realisation that we could be doing a great deal more to provide bilingual choice to our Welsh-speaking customers. "
        },
        {
            "text": "Just over a year ago, our digital team started the first phase of a programme to provide customers with core bilingual English/Welsh digital information and services on our Gov.UK web pages. Here’s where we’ve got to so far.  "
        },
        {
            "heading": 3,
            "text": "The Intellectual Property Office in Wales – where our Welsh journey began "
        },
        {
            "text": "It was in the 1980s that the head office of the IPO (then called the British Patent Office) was relocated to Wales, throwing open its doors to welcome in a South Wales-based workforce. In 2007, together with businesses based across Wales, IPO implemented its Welsh Language Scheme under the Welsh Language Act 1993, committing to incorporate use of Welsh into its business activities ‘as appropriate and where reasonably practical’."
        },
        {
            "text": "Our Welsh Language Scheme explains what the Intellectual Property Office (IPO) does to ensure that Welsh and English are treated equally when we provide public services in Wales (link) IPO Cynllun Iaith Gymraeg (MS Word Document, 61.9 KB)."
        },
        {
            "heading": 3,
            "text": "Serving our Welsh-speaking customers"
        },
        {
            "text": "While we know that we are very much on a journey, the team championing use of Welsh in the IPO has already reached some milestones. "
        },
        {
            "text": "Welsh on the web"
        },
        {
            "text": "While customers writing to us in Welsh were already receiving a written Welsh reply, there was recognition that we could be doing more as an organisation to provide them with a bilingual choice of information and services online, too."
        },
        {
            "text": "In 2024 our digital team started translation of IPO’s top level Gov.UK web pages. Work began with the trade mark application service, including the translation of online forms that will enable our customers to complete some transactions in Welsh if they choose. You can view the story here:IPO launches bilingual website as part of Welsh language commitment - GOV.UK"
        },
        {
            "text": "IPO Digital Strategy Manager, Mark Juffs, explained what that has entailed:"
        },
        {
            "text": "Welsh-speaking IPO people"
        },
        {
            "text": "To provide professional support services for our Welsh-speaking customers, we need to maintain a good base of Welsh skills within the workforce. There’s a real keenness and confidence among IPO people to use whatever Welsh they have, rather than wait for fluency and perfection. Welsh language officer Sue Emery has the task of optimising use of the Welsh within IPO. She explained:"
        },
        {
            "text": "John Chick, IPO ‘s Welsh language lead, is clearly proud of the progress that has been made to raise the profile of Welsh internally, crediting the team of dedicated people who have made it happen. "
        },
        {
            "text": "John explained how the success of the initiative is partly due to support from the top, with two board members fluent Welsh speakers and a third who acts as board sponsor for use of the Welsh language internally.  He is among the first to agree that these are early days for the IPO in its Welsh language endeavours:"
        },
        {
            "text": "If you would like a Welsh version of any of our forms or brochures, you can email information@ipo.gov.uk or call 01633 813 768."
        }
    ]
}