{
    "url": "https://defrafarming.blog.gov.uk/2025/12/04/farming-podcast-how-to-build-a-fairer-more-transparent-supply-chain/",
    "title": "Farming podcast: how to build a fairer, more transparent supply chain ",
    "authors": [
        "Graham Higgins",
        "Becky Briggs",
        "Richard Thompson",
        "Sarah Stewart"
    ],
    "categories": [
        "Future Farming Podcast"
    ],
    "pub_date": "2025-12-04T11:49:52+00:00",
    "content": [
        {
            "text": "Fair contracts help to create a farming sector that is more resilient and profitable. "
        },
        {
            "text": "They give producers greater certainty, clarity and transparency, support long-term planning and help to address power imbalances across the supply chain.  "
        },
        {
            "text": "Last year, Richard Thompson was appointed Agricultural Supply Chain Adjudicator (ASCA). His remit is to improve fairness in agricultural supply chains by enforcing Fair Dealing Obligation Regulations, starting with the dairy sector. "
        },
        {
            "text": "The ASCA has now published its first annual report covering July 2024 to June 2025. In this post, we share a link to the report and a summary. "
        },
        {
            "text": "To go alongside the report, Richard presents the latest episode of the Farming Podcast.  "
        },
        {
            "heading": 2,
            "text": "Podcast"
        },
        {
            "text": "In this episode, Richard is joined by two guests. "
        },
        {
            "text": "Paul Tompkins is NFU Dairy Board Chair. He farms 400 pedigree Holsteins with his wife, Rachael, supplying Paynes Dairies in the Vale of York. "
        },
        {
            "text": "Michael Masters is Head of Milk Supply and Operations at Barber's Farmhouse Cheesemakers. Barber's was one of the first processors to issue new contracts under the Fair Dealing Obligations (Milk) Regulations 2024 (FDOM24). "
        },
        {
            "text": "Together, they explore the role of the ASCA, the challenges facing the dairy sector, and how the new regulations are helping to build a fairer and more transparent supply chain. "
        },
        {
            "text": "Read the transcript."
        },
        {
            "heading": 2,
            "text": "The annual report "
        },
        {
            "text": "ASCA’s first annual report, published on GOV.UK, covers how the office was established, its strategic objectives and values, and activities over this period.  "
        },
        {
            "text": "Because the rules were in a transition period, existing milk contracts did not fall under the regulations until 1 July 2025.  "
        },
        {
            "text": "This meant the ASCA’s first year focused on gathering insight, raising awareness and helping the sector prepare for the end of the transition period. "
        },
        {
            "text": "Between July 2024 and June 2025, the ASCA: "
        },
        {
            "text": "The report explains that many farmers welcomed the move to clearer, fairer and more transparent contracts. They said the new rules had the potential to bring greater stability to their businesses.  "
        },
        {
            "text": "At the same time, a lot of farmers weren’t sure if their current contracts were fully compliant; particularly around pricing mechanisms, notice periods and how changes can be made. "
        },
        {
            "text": "The most common concern was about speaking up. Farmers told the ASCA they worry about damaging relationships with their buyer, being identified, or even losing their contract if they raise issues.  "
        },
        {
            "text": "To address this, the ASCA set up an in-confidence route so farmers can get advice without giving their name. You can contact the ASCA confidentially through the ASCA contact page. "
        },
        {
            "text": "The transition period ended on 9 July 2025, which means all milk purchase contracts must now meet the requirements of FDOM24. "
        },
        {
            "text": "If you think your contract may not comply, you can check the guidance, speak to your buyer, contact the ASCA for informal advice, or make a formal complaint if necessary. "
        },
        {
            "text": "In 2026, the ASCA will continue to work across both milk and pig sectors, building on relationships it has forged over the past year, and providing an impartial voice championing fairness and transparency. "
        },
        {
            "text": "The Fair Dealing Obligations (Pigs) Regulations 2025 came into force in August, with a 12-month transition period. Engagement with the pig sector is already underway.  "
        },
        {
            "text": "To keep up with the latest from our team, including scheme updates, new tools, case studies and policy developments, subscribe to the Farming Blog. "
        },
        {
            "text": "You’ll get an email every time we publish a new post. "
        }
    ]
}