{
    "url": "https://nda.blog.gov.uk/i-imagined-a-concrete-jungle-not-a-nature-reserve-innovation-at-winfrith/",
    "title": "“I imagined a concrete jungle not a nature reserve!”: Innovation at Winfrith",
    "authors": [
        "Joanna Morton",
        "Kimberly Jones",
        "Tiffany Cheung",
        "George Baker"
    ],
    "categories": [
        "Early careers",
        "Innovation/savings",
        "Research and development"
    ],
    "pub_date": "2025-12-04T15:33:36+00:00",
    "content": [
        {
            "text": "Recently, three new Nuclear Decommissioning Authority (NDA) group graduates were lucky enough to visit Winfrith, the former nuclear reactor test site now being decommissioned by Nuclear Restoration Services (NRS), as part of the NDA group’s estate."
        },
        {
            "text": "Jo, Kim, and Tiffany are graduates working in the Research and Development team. Their visit to Winfrith left them with a better understanding of the scale and challenges involved in decommissioning the UK’s legacy nuclear sites and the vital role that new technology can play in overcoming decommissioning challenges."
        },
        {
            "text": "Kim said: “Visiting the Winfrith site was a great opportunity for me to get a sense of the scale and complexity of the nuclear decommissioning industry, something I couldn’t learn from just working at a desk. It’s made it easier for me to share my ideas with colleagues and contribute more as I can relate to what I’ve seen and consider practical, operational details...”"
        },
        {
            "text": "The Winfrith site was constructed in the 1950s, as part of the UK’s research into new and emerging nuclear reactor technology and was designed without decommissioning in mind. Today, the site is well into its decommissioning journey and is an important test-bed for innovation."
        },
        {
            "text": "At the site stands the Dragon Reactor, a first-of-its-kind experimental high-temperature gas-cooled reactor, which is currently being decommissioned. It needs to be dismantled, for easier longer-term storage while the radiation decays."
        },
        {
            "text": "Tiffany said: “We saw how laser cutting is being used to make this process safer and more efficient. The control room featured a wall of screens, each providing a different angle of the reactor’s interior. The setup allowed for operators to have maximum visibility of their workspace. We heard how this new system uses an arm-manipulated laser, which allows the work to be carried out remotely, safely and in a contained environment without physically sending staff into the hazardous reactor.”"
        },
        {
            "text": "With the imminent transfer of AGR reactors from EDF into the NDA for decommissioning, the laser cutting of Dragon could become a model for similar work across the group."
        },
        {
            "text": "Winfrith is also home to NRS’ first large-scale trial of remote monitoring technology, part of a £2 million NDA-funded R&D project. In this NDA-NRS collaborative project, with the Defence and Security Accelerator (DASA) as our delivery partner, advanced technology is being developed and tested to remotely monitor site perimeters in a secure and cost-efficient way."
        },
        {
            "text": "Jo said: “The drones and the speed at which they launch and respond to signal was impressive. Additionally, there were clearly huge benefits in the fact these drones, and the ground vehicles that work alongside them, can charge and deploy themselves from secure containers.”"
        },
        {
            "text": "“The great thing is that these innovations could be used at other NRS sites and beyond. The sensors and cameras could be used for future facilities as well as current NDA sites, for example at a potential Geological Disposal Facility, which would require security monitoring through its construction and well into the future.”"
        },
        {
            "text": "The visit to Winfrith brought the NDA’s wider aims into perspective for the visiting graduates. Cross-group collaboration on technology is key in delivering one of the biggest environmental clean-up missions in Europe. Innovation keeps the NDA at the forefront of the global nuclear decommissioning industry, and Winfrith is tangible proof of that success."
        }
    ]
}