{
    "url": "https://cddo.blog.gov.uk/2025/12/04/innovation-in-action-highlights-from-the-local-government-innovation-hackathon/",
    "title": "Innovation in action: highlights from the Local Government Innovation Hackathon",
    "authors": [
        "Liz Adams, Local Government Collaboration, GDS"
    ],
    "categories": [
        "Cross-government strategy",
        "Digital transformation",
        "Government Digital and Data"
    ],
    "pub_date": "2025-12-04T09:00:00+00:00",
    "content": [
        {
            "text": "A data-driven tool to match homeless people with suitable temporary accommodation has been crowned the winning idea at the Local Government Innovation Hackathon on This exciting and collaborative event hosted in partnership with the Ministry of Housing, Communities and Local Government (MHCLG), the Local Government Association (LGA) and Birmingham City Council brought together 150 individuals across 70 organisations within local and central government, the private sector and academia to collaborate and innovate. Participants were asked to create solutions to challenges relating to homelessness, rough sleeping and temporary accommodation within 24 hours. "
        },
        {
            "text": "Team ‘Match’, the overall winners, impressed judges with a prototype that uses intelligent matching to reduce the time people spend in emergency and temporary accommodation. Their solution also included a voice-note feature to capture conversations with individuals facing homelessness, ensuring a personalised user experience while reducing administrative burdens through AI."
        },
        {
            "text": "The team will now pitch their prototype to Ministers from the Department of Science, Innovation and Technology (DSIT) and MHCLG - a fantastic opportunity to showcase what can be achieved when local government, central government and tech partners innovate together."
        },
        {
            "heading": 2,
            "text": "Collaboration at its best"
        },
        {
            "text": "Over two days, participants collaborated to tackle pressing challenges around homelessness, rough sleeping and temporary accommodation, supported by Amazon Web Services - one of MHCLG’s Cloud Compute partners."
        },
        {
            "text": "Building on the recent launch of GDS Local, a new unit within Government Digital Service (GDS) established to catalyse digital collaboration between GDS and local government, the hackathon showcased what we can achieve when we work collaboratively. The aim throughout was clear: to help councils deliver better, more joined-up support for people experiencing housing instability and homelessness."
        },
        {
            "text": "Participants heard from speakers including Emily Middleton, Director General for Digital Centre Design in GDS, Kat Sexton from Birmingham City Council and Theo Brown from third sector organisation Rene House. The event was endorsed by Ministers from GDS and MHCLG, with Minister Dixon opening day 2 by focusing on the human impact and why this work really matters."
        },
        {
            "heading": 2,
            "text": "What we achieved"
        },
        {
            "text": "Fourteen teams made up of colleagues from central and local government, policy specialists and developers worked over 24 hours to design and prototype solutions aimed at improving support for vulnerable individuals across the UK."
        },
        {
            "text": "Suggested solutions responded to three challenge statements:"
        },
        {
            "text": "The outputs were incredible, with teams showcasing working prototypes in under 24 hours."
        },
        {
            "heading": 2,
            "text": "Winning team"
        },
        {
            "text": "An impressive judging panel made up of specialists from GDS, MHCLG, Birmingham City Council and the voluntary sector chose Team ‘Match’ as the winners. Their data-driven solution helps reduce the time people spend in emergency and temporary accommodation through intelligent matching of individuals to suitable properties."
        },
        {
            "text": "Well done to Team ‘Match’ for a brilliant presentation and demonstration of their tool, and to all the contributing teams who worked so hard and produced fantastic solutions to tackle these important problems."
        },
        {
            "heading": 2,
            "text": "Thank you"
        },
        {
            "text": "A huge thank you to everyone who took part and dedicated their time and energy to this event. "
        },
        {
            "text": "If you’d like to find out more about GDS Local or be the first to hear about future events please register for our mailing list or find out more on our GDS Local GOV.UK page. "
        }
    ]
}