{
    "url": "https://ukhsa.blog.gov.uk/2025/12/04/living-with-antimicrobial-resistant-tb/",
    "title": "Living with antimicrobial-resistant TB",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Antimicrobial resistance",
        "Tuberculosis"
    ],
    "pub_date": "2025-12-04T18:19:29+01:00",
    "content": [
        {
            "text": "Samara works in the third sector with a children’s charity. Through her role, she has worked with people who experience homelessness. A few years ago, she contracted a disease which would lead to a challenging and long battle with the real-world impact of antimicrobial resistance (AMR), affecting almost all aspects of her life. In this blog post Samara shares her story of fighting antimicrobial -resistant tuberculosis, the hidden long-term consequences and the importance of getting that persistent cough checked out."
        },
        {
            "text": "I'd had a persistent cough for months, but like many people, I just pushed through it. I found myself coughing constantly during a holiday with friends, feeling hot and struggling to get through each day. My friends made me realise something wasn’t right and their concern prompted me to get myself checked out when we got home."
        },
        {
            "text": "What followed was a frustrating journey– I was treated for a chest infection, then for asthma. The symptoms of TB can look like many other diseases, and if you’re fit and healthy and not the sort of person who is at more at risk, TB is often one of the last things to consider."
        },
        {
            "text": "I spend my days working face-to-face with homeless people who are sadly disproportionately affected by TB, because poor living conditions and limited access to healthcare can often lead to an increased vulnerability to infections. When I discussed my work with this group, my doctor suggested we test for TB. As many of us think of TB as a thing from the past, it is more difficult to diagnose early."
        },
        {
            "text": "Over Christmas I needed an MRI scan and on Christmas Eve I was called and told I needed to see a specialist the day after Boxing Day. I was extremely anxious about what the scan would find and at this point, the possibility of TB still hadn't even crossed my mind. When the order form said \"query TB,\" I was shocked. My grandfather had died of TB in Borneo before I was born, and my parents were devastated by the news that I might have it."
        },
        {
            "text": "The treatment hit me hard. I was sleeping 20 hours a day, lost weight rapidly, and developed painful skin rashes. I was incredibly fortunate to have family who looked after me and an employer who gave me the time off I needed."
        },
        {
            "text": "At my check-up, we discovered the rifampicin hadn't worked. I was then diagnosed with an antimicrobial-resistant strain of TB – meaning the antibiotics usually offered to treat TB were not working and I wasn’t getting better. Instead of the standard 6-month treatment, I faced 12 months of gruelling medication. AMR doesn't just mean different drugs; it means longer treatment, more side effects, and a much harder journey back to health."
        },
        {
            "text": "Even when TB is cured there are still long-term impacts, I have minor scarring on my lungs caused by having the disease for so long. And recently I participated in research about life expectancy for TB survivors, and the findings were sobering. There's a significantly higher chance of cardiovascular issues and long-term mental health effects - yet more reasons to get that persistent cough checked out."
        },
        {
            "text": "The social impact of fighting antimicrobial-resistant TB was hard on me too. When your treatment time doubles because of AMR, you struggle with that extended period of illness, isolation and uncertainty. Life moves on around you while you’re stuck fighting an illness which was once easily treated. It can be a challenging 12-month battle, but sticking to the treatment is so important if you're to get well again."
        },
        {
            "text": "Antimicrobial resistance means that those tiny germs have learnt to fight back, making treatment more complex, and more devastating for patients like me and our families."
        },
        {
            "text": "My experience with TB has made me passionate about encouraging both doctors and patients to think TB when people present with persistent symptoms. AMR means we can't afford to have TB as an afterthought. Every delay gives resistance more time to develop and spread."
        },
        {
            "text": "My message is: if you have a persistent cough, weight loss, night sweats – don't dismiss your symptoms – speak to your doctor and get treatment early. And if you work with vulnerable people, make sure they’re thinking TB if they have a persistent cough. This is especially important because  it can be so much more difficult for them to get and follow up with medical care."
        },
        {
            "text": "AMR has made TB a modern threat again and will do so with many more infections, we all need to be more aware of how devastating the effects of AMR infections can be without effective medications."
        }
    ]
}