{
    "url": "https://nationalscreening.blog.gov.uk/2025/12/04/progress-made-on-plans-to-evaluate-sma-newborn-screening/",
    "title": "Progress made on plans to evaluate SMA newborn screening",
    "authors": [
        "Jo Harcombe"
    ],
    "categories": [
        "Newborn Blood Spot Screening"
    ],
    "pub_date": "2025-12-04T16:54:24+00:00",
    "content": [
        {
            "text": "Spinal muscular atrophy (SMA) is a serious rare inherited condition that affects nerves in the spinal cord. This can affect a person’s ability to move, speak, swallow and breathe."
        },
        {
            "text": "Following the UK National Screening Committee’s (UK NSC’s) review of evidence on newborn screening for SMA, the committee endorsed a 2-pronged approach to:"
        },
        {
            "text": "ISEs test proposed or modified screening programmes within ‘real world’ National Health Services. They help answer important evidence gaps and demonstrate how a screening programme would work in practice."
        },
        {
            "text": "This summer (2025) we published 4 documents relating to the UK NSC’s review of evidence on newborn screening for SMA. One of these documents was a report that concluded the ISE is needed to answer questions about whether screening for SMA should be recommended in the UK and how this might work in the NHS, how much it would cost, and whether it would be effective in everyday NHS practice."
        },
        {
            "text": "A partnership board to oversee planning for the ISE brings together screening experts from the 4 UK governments and NHS, organisations with a shared interest in newborn screening for SMA, clinicians, academics, genomic experts and patient and public voice members."
        },
        {
            "text": "The partnership board met in November to review progress and receive several updates on preparations for the ISE."
        },
        {
            "heading": 2,
            "text": "Research progress"
        },
        {
            "text": "The research component of the ISE is being commissioned via the NIHR’s Health Technology Assessment (HTA). "
        },
        {
            "text": "The HTA funding committee met recently and confirmed that an application had been received in response to the advertised funding opportunity.  The application is progressing through the funding process, and the HTA funding committee decision is anticipated in March 2026."
        },
        {
            "heading": 2,
            "text": "Remit of partnership board"
        },
        {
            "text": "The partnership board agreed to update its terms of reference to reflect its ongoing responsibilities and future oversight of the ISE work. This will include reference to how the group will be informed about international SMA screening practices."
        },
        {
            "heading": 2,
            "text": "Clinical pathway preparations"
        },
        {
            "text": "David Elliman, chair of the clinical pathway group, provided an update on progress, including the development of a clear definition of SMA and guidelines for routine immunisations in children with SMA."
        },
        {
            "heading": 2,
            "text": "Laboratory readiness"
        },
        {
            "text": "Jim Bonham, chair of the laboratory group, gave an update on progress with preparing laboratories for the ISE. "
        },
        {
            "text": "This includes the validation of testing for SMN2 copy numbers on dry blood spot samples."
        },
        {
            "heading": 2,
            "text": "NHS England preparations"
        },
        {
            "text": "NHS England has been working on detailed planning for the ISE in England, including meetings with laboratory representatives and finance colleagues. "
        },
        {
            "text": "An implementation group has now been set up and is meeting this month (December 2025)."
        },
        {
            "heading": 2,
            "text": "Scotland’s preparations for ISE"
        },
        {
            "text": "NHS Scotland confirmed it is on track to begin the ISE of newborn screening for SMA in Scotland in March 2026. "
        },
        {
            "text": "Scotland is preparing its national newborn laboratory and developing information and training materials."
        },
        {
            "text": "The next partnership board meeting will take place in spring 2026."
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "The UK NSC blog provides up-to-date news from the UK NSC. You can register to receive updates direct to your inbox, so there is no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, please email uknsc@dhsc.gov.uk."
        }
    ]
}