{
    "url": "https://buyingforschools.blog.gov.uk/2025/12/04/smarter-banking-how-bishop-hogarth-catholic-education-trust-increased-their-annual-interest-income-to-over-1-million/",
    "title": "Smarter banking: How Bishop Hogarth Catholic Education Trust increased their annual interest income to over £1 million",
    "authors": [
        "David Leane, Chief Financial Officer, Bishop Hogarth Catholic Education Trust"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2025-12-04T11:18:51+00:00",
    "content": [
        {
            "text": "David Leane, Chief Financial Officer, shares how Bishop Hogarth Catholic Education Trust has benefited from reviewing their banking arrangements."
        },
        {
            "text": "When I joined Bishop Hogarth Catholic Education Trust twelve years ago as a small trust of just four schools, managing our banking seemed straightforward. Today, as Chief Financial Officer of a 35-school organisation spanning 30 Catholic primary schools and five secondary schools across Darlington, County Durham, Stockton and Hartlepool, I've learned that smart banking arrangements can be transformational for educational outcomes."
        },
        {
            "heading": 2,
            "text": "The challenge of rapid growth"
        },
        {
            "text": "Our significant expansion came between March 2020 and May 2022, when we grew from 15 to 35 schools as part of our diocese's strategic restructuring. This rapid growth during the COVID-19 pandemic taught us valuable lessons about managing banking resources at scale."
        },
        {
            "text": "Each phase of growth brought new banking challenges that forced us to reconsider our approach."
        },
        {
            "text": "We decided early on in our growth to consolidate to a single account and this centralisation decision proved crucial. Rather than managing multiple separate accounts, we established one central banking arrangement with an overnight sweep facility."
        },
        {
            "heading": 2,
            "text": "Operational efficiency gains"
        },
        {
            "text": "The move to centralised banking has also delivered significant operational benefits. A reduction in the administrative burden associated with individual bank accounts. Our school business managers can focus with Headteachers on their school’s educational priorities rather than banking administration."
        },
        {
            "text": "The efficiency gains are clear: As we've got more mature and got bigger, my team is able to answer more of the questions directly themselves and need to ask fewer questions of the business managers. This frees up valuable time in schools for educational leadership and pupil support."
        },
        {
            "heading": 2,
            "text": "Strategic banking relationships"
        },
        {
            "text": "Our growth and stability allowed us to develop strategic relationships with multiple banking partners. We expanded beyond our original bank to include two others, building relationships that enabled us to secure better deposit rates and banking terms - maximising returns on our reserves."
        },
        {
            "text": "One innovative arrangement is our green deposit account, where funds are ring-fenced for green projects and green companies. This aligns with our Catholic values whilst delivering competitive returns, creating a win-win for us."
        },
        {
            "heading": 2,
            "text": "Financial impact: from £16,000 to over £1 million"
        },
        {
            "text": "The transformation in our banking arrangements has delivered remarkable financial results. Before optimising our approach, we only generated £16,000* in annual bank interest."
        },
        {
            "text": "In 2022-23, our first partial year of strategic banking management, this increased to £453,000*. By 2023-24, our first full year of optimised arrangements, we achieved £1,178,000* in interest income."
        },
        {
            "text": "Over the course of less than two years, we've added more than £1 million* of income into our trust. We acknowledge that returns will vary with interest rate movements, but implementing these measures will nonetheless yield greater value than taking no action."
        },
        {
            "text": "Direct benefits for schools and pupils"
        },
        {
            "text": "This additional income has immediate impact across our trust. Most importantly, it means we can keep the recharge for our schools as low as possible. When we benchmark our central recharges against similar-sized trusts, we always come in significantly lower than the average."
        },
        {
            "text": "One really helpful part of that is that we've got this money coming in and so that's obviously taking up some of the cost increases in other areas and not passing them on to our schools. This approach directly protects classroom resources and educational provision across all 35 schools."
        },
        {
            "heading": 2,
            "text": "Governance and best practice"
        },
        {
            "text": "Strong governance and cash flow forecasting have been essential to our success. We get good challenge from our directors, and they were very keen once we got fully grown that we did explore better banking arrangements. We updated our investment policy and now provide regular updates to our Finance & Resources Committee and full board."
        },
        {
            "text": "We have enhanced our cash flow forecasting and our trust’s CEO and COO review this with me on a monthly basis. Their strong estates management and planning of the capital programme is crucial to maintaining our efficient cash flows."
        },
        {
            "text": "The administrative challenge of establishing new banking relationships shouldn't be underestimated. The hardest bit is the new client paperwork and trying to get set up with a new bank. However, our directors have been incredibly supportive, giving up significant time to complete necessary documentation."
        },
        {
            "heading": 2,
            "text": "Learning from the DfE pilot programme"
        },
        {
            "text": "Our participation in the DfE's banking pilot, which has been shared with the Queen Street Group networking organisation, has enhanced our expertise. The comparison tools are particularly helpful for schools at the start of this journey to see the banks and what rates they're offering and avoid them considering third-party aggregation services that take a fee."
        },
        {
            "heading": 2,
            "text": "Practical advice for other trusts"
        },
        {
            "text": "For trusts considering similar changes, the message is clear: even modest improvements in banking arrangements can yield substantial benefits. The key principles we've applied include:"
        },
        {
            "heading": 2,
            "text": "In summary"
        },
        {
            "text": "Our banking transformation demonstrates that strategic financial management directly benefits educational provision. The additional income we generate doesn't just improve our balance sheet - it protects classroom resources and supports educational excellence across all our schools."
        },
        {
            "text": "For school leaders and business professionals, the lesson is clear: optimised banking arrangements aren't just about financial efficiency - they're about maximising every pound available for the children we serve. The journey from £16,000* to over £1 million* in annual interest income proves that smart banking decisions can make a real difference to educational outcomes."
        },
        {
            "text": "Whether you're managing a single academy or a growing trust, reviewing your banking arrangements could unlock significant resources for your pupils and communities – I would strongly urge you to ask your bank “is this the best rate you can give me?'\""
        },
        {
            "text": "* Figures quoted have been supplied by Bishop Hogarth Catholic Education Trust and have not been verified by the Department for Education"
        },
        {
            "text": "If you’ve found this article useful and want to learn more about how we’re supporting schools, click ‘sign up and manage updates’ at the top right of this page to subscribe to our blog and receive notifications when we next post."
        }
    ]
}