{
    "url": "https://insidehmcts.blog.gov.uk/2025/12/04/supporting-justice-in-action-how-staff-delivered-urgent-technical-support-for-a-high-profile-trial/",
    "title": "Supporting justice in action: how staff delivered urgent technical support for a high-profile trial ",
    "authors": [
        "Kate Lantzos, Senior Video Product Manager",
        "Colin Clixby, Video Solution Architect"
    ],
    "categories": [
        "Digital services",
        "User experience and research",
        "Working at HMCTS"
    ],
    "pub_date": "2025-12-04T09:31:23+00:00",
    "content": [
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "text": "When an urgent request arrived on the eve of a major murder trial, colleagues from across HMCTS  worked together to deliver a critical technical solution. They protected a witness’s identity, upheld the principle of Open Justice and made sure the trial could proceed fairly. "
        },
        {
            "heading": 2,
            "text": "Making sure justice is both fair and open"
        },
        {
            "text": "Ensuring courts are impartial is central to everything we do. Alongside that sits the long-established principle of open justice – making sure the public and press can observe  and scrutinise court proceedings while protecting those who may be at risk. "
        },
        {
            "text": "Recently, these principles came sharply into focus during a murder trial at Bristol Crown Court. A defence witness had been granted a witness anonymity order under section 86 of the Coroners and Justice Act 2009. This meant their voice needed to be disguised for the public and press, but heard naturally by the judge, jury and court staff. "
        },
        {
            "text": "Usually, this type of voice modulation is supported by the Crown Prosecution Service for prosecution witnesses. But in this case, because the witness was for the defence, no solution had been arranged. Without a rapid response, the witness might not have given evidence – risking the collapse of the murder trial. "
        },
        {
            "heading": 2,
            "text": "Working against the clock "
        },
        {
            "text": "The request for support only came in on the afternoon before the testimony was due. With no realistic chance of delivering a safe and tested solution overnight, colleagues worked with the judge, who agreed to reschedule the witness for two days later. That time was used to bring together a team from across the organisation.  "
        },
        {
            "text": "Colleagues from Digital and Technology Services, Regional IT and court operations came together immediately. Suitable equipment was sourced and shipped quickly. Multiple software options were also tested, acknowledging that courtroom acoustics at Bristol would make some previously successful applications unsuitable. "
        },
        {
            "text": "The next morning, Kate from the Digital Infrastructure Product Team and Joe from Regional IT were on site to trial the options in live courtroom conditions with the assistance of Hannah, a court clerk and Graham, an usher. Their aim was clear: maintain the clarity required for court users while ensuring the public audio stream masked the witness’ natural voice. "
        },
        {
            "heading": 2,
            "text": "Adapting in real time "
        },
        {
            "text": "Because the witness could not rehearse in advance, the real test came when they began giving evidence as they were far more softly spoken than expected. Thanks to careful preparation and agile teamwork, Kate and Joe were able to adjust audio levels and reposition equipment instantly. "
        },
        {
            "text": "The result was a seamless experience for the judge, jury, parties, public and press. The witness was protected, the court remained impartial, and the trial was able to continue without disruption. "
        },
        {
            "text": "This collaborative effort showcased the best of HMCTS: digital specialists supporting operational colleagues and working side by side to deliver a new, critical capability at remarkable speed. It demonstrated how, when confronted by challenges and pressure, our teams respond with professionalism, creativity and unwavering commitment to supporting justice. "
        },
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "heading": 1,
            "text": "Cefnogi cyfiawnder ar waith: sut y cyflwynodd staff gymorth technegol brys ar gyfer treial proffil uchel"
        },
        {
            "text": "Pan gyrhaeddodd cais brys ar drothwy treial llofruddiaeth sylweddol, gweithiodd cydweithwyr o bob rhan o GLlTEF gyda'i gilydd i ddarparu datrysiad technegol hanfodol. Fe wnaethant amddiffyn hunaniaeth y tyst, cynnal yr egwyddor o Gyfiawnder Agored a gwneud yn siŵr y gallai'r treial fynd rhagddo yn deg."
        },
        {
            "heading": 2,
            "text": "Gwneud yn siŵr bod cyfiawnder yn deg ac yn agored"
        },
        {
            "text": "Mae sicrhau bod llysoedd yn ddiduedd yn ganolog i bopeth a wnawn. Ochr yn ochr â hynny mae'r egwyddor hirsefydlog o Gyfiawnder Agored – gwneud yn siŵr bod y cyhoedd a'r wasg yn gallu arsylwi achosion llys wrth amddiffyn y rhai a allai fod mewn risg."
        },
        {
            "text": "Yn ddiweddar, daeth yr egwyddorion hyn i'r amlwg yn ystod treial llofruddiaeth yn Llys y Goron Bryste. Roedd tyst yr amddiffyniad wedi cael gorchymyn anhysbysrwydd tyst o dan adran 86 o Ddeddf Crwneriaid a Chyfiawnder 2009. Roedd hyn yn golygu bod angen cuddio eu llais i'r cyhoedd a'r wasg, ond bod y barnwr, y rheithgor a staff y llys yn ei glywed yn naturiol."
        },
        {
            "text": "Fel arfer, mae'r math hwn o fodiwleiddio llais yn cael ei gefnogi gan Wasanaeth Erlyn y Goron ar gyfer tystion yr erlyniad. Ond yn yr achos hwn, oherwydd bod y tyst ar gyfer yr amddiffyniad, nid oedd unrhyw ddatrysiad wedi'i drefnu. Heb ymateb cyflym, efallai na fyddai'r tyst wedi rhoi tystiolaeth – gan beryglu y byddai’r treial llofruddiaeth wedi chwalu."
        },
        {
            "heading": 2,
            "text": "Gweithio yn erbyn y cloc"
        },
        {
            "text": "Dim ond ar y prynhawn cyn i'r dystiolaeth fod ei hangen daeth y cais am gymorth. Heb unrhyw siawns realistig o ddarparu datrysiad diogel dros nos, gweithiodd cydweithwyr gyda'r barnwr, a gytunodd i aildrefnu'r tyst ar gyfer dau ddiwrnod yn ddiweddarach. Defnyddiwyd yr amser hwnnw i ddod â thîm o bob rhan o'r sefydliad at ei gilydd."
        },
        {
            "text": "Ymunodd cydweithwyr o Wasanaethau Digidol a Thechnoleg, TG Rhanbarthol a gweithrediadau’r llys ar unwaith. Cafodd offer addas ei ganfod a'i gludo'n gyflym. Profwyd sawl opsiwn meddalwedd, gan gydnabod y byddai acwsteg llys ym Mryste yn gwneud rhai ceisiadau a oedd yn llwyddiannus yn y gorffennol yn anaddas y tro hwn."
        },
        {
            "text": "Y bore wedyn, roedd Kate o'r Tîm Cynnyrch Seilwaith Digidol a Joe o TG Rhanbarthol ar y safle i dreialu'r opsiynau mewn amodau llys go iawn gyda chymorth Hannah, clerc y llys a Graham, tywyswr. Roedd eu nod yn fanwl gywir: cynnal yr eglurder sy'n ofynnol i ddefnyddwyr llys wrth sicrhau bod y llif sain cyhoeddus yn cuddio llais naturiol y tyst."
        },
        {
            "heading": 2,
            "text": "Addasu mewn amser real"
        },
        {
            "text": "Oherwydd nad oedd y tyst yn gallu ymarfer ymlaen llaw, daeth y prawf go iawn pan ddechreuon nhw roi tystiolaeth gan eu bod yn llawer mwy tawel na'r disgwyl. Diolch i baratoi gofalus a gwaith tîm ystwyth, roedd Kate a Joe yn gallu addasu lefelau sain ac ail-leoli offer ar unwaith."
        },
        {
            "text": "Y canlyniad oedd profiad di-dor i'r barnwr, y rheithgor, y partïon, y cyhoedd a'r wasg. Cafodd y tyst ei amddiffyn, arhosodd y llys yn ddiduedd, ac roedd y treial yn gallu parhau heb unrhyw darfu."
        },
        {
            "text": "Mae'r ymdrech gydweithredol hon yn arddangos y gorau o GLlTEF: arbenigwyr digidol sy'n cefnogi cydweithwyr gweithredol ac yn gweithio ochr yn ochr i ddarparu gallu newydd, beirniadol ar gyflymder rhyfeddol. Dangosodd sut, pan fydd tensiynau yn uchel, mae ein timau yn ymateb gyda phroffesiynoldeb, creadigrwydd ac ymrwymiad diwyro i gefnogi cyfiawnder."
        }
    ]
}