{
    "url": "https://deframedia.blog.gov.uk/2023/07/26/coverage-of-update-to-extended-producer-responsibility-scheme/",
    "title": "Coverage of update to extended producer responsibility scheme",
    "authors": [
        "defrablogs"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2023-07-26T14:27:04+01:00",
    "content": [
        {
            "text": "There has been coverage in the Financial Times, the Telegraph, The Times and i News following our announcement providing further details on the extended producer responsibility for packaging scheme."
        },
        {
            "text": "The announcement confirmed that, following extensive engagement with industry, and in light of the pressure facing consumers and businesses in the current economic context, new rules to ensure packaging producers pay for the cost of recycling their packaging will be deferred a year from October 2024 to 2025."
        },
        {
            "text": "Government will use the additional year to continue to discuss the scheme’s design with industry and reduce the costs of implementation wherever possible. In anticipation of EPR, producers have already started to use less packaging and adopt easier to recycle packaging formats, and we expect this process to continue – ensuring that costs are not then passed onto households later on."
        },
        {
            "text": "Environment Minister Rebecca Pow said:"
        },
        {
            "text": "“We’re determined to transform the way we collect, recycle and reuse our waste materials so we eliminate all avoidable waste by 2050 in a way that works for households and consumers. That’s better for our environment."
        },
        {
            "text": "“We are also listening to industry and ensuring our work to tackle inflation and to drive up recycling go hand in hand, to make sure our reforms will be a success.”"
        },
        {
            "text": "The government remains committed to delivering on its commitments to eliminating avoidable waste by 2050 and recycle 65% of municipal waste by 2035."
        },
        {
            "text": "The extended producer responsibility scheme will play a central part in delivering that mission and will build on other measures, including the tax on plastic packaging which does not meet a minimum threshold of at least 30% recycled content, which came into force last April, and the upcoming bans on countless single-use plastic items, including cutlery and plates."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}