{
    "url": "https://defrafarming.blog.gov.uk/2023/07/26/introducing-animal-health-and-welfare-infrastructure-grants/",
    "title": "Introducing Animal Health and Welfare Infrastructure grants",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Payments to support animal health and welfare"
    ],
    "pub_date": "2023-07-26T15:13:17+01:00",
    "content": [
        {
            "text": "We're pleased to share the next steps of the Animal Health and Welfare Pathway. "
        },
        {
            "text": "Through the first round of the Animal Health and Welfare Equipment and Technology grant, over £19 million will be awarded to more than 3,000 pig, cattle, poultry and sheep farmers. The Rural Payments Agency (RPA) is now writing to successful applicants so they can begin to buy their new equipment. You can help us to shape the next round of the grant.  "
        },
        {
            "text": "Additionally, the Animal Health and Welfare Infrastructure grant will launch shortly with the Calf Housing for Health and Welfare grant."
        },
        {
            "text": "In this post, we’ll tell you more about this new grant and share the link to the guidance to help you prepare."
        },
        {
            "heading": 2,
            "text": "The Animal Health and Welfare Infrastructure grant "
        },
        {
            "text": "Grants of between £15,000 and £500,000 are available for large infrastructure projects that help to continually improve the health and welfare of your animals. "
        },
        {
            "text": "Initially, the grant will be available for cattle keepers to co-fund new and upgraded calf housing that improves social contact and the ambient environment. "
        },
        {
            "text": "In time, we’ll extend the offer to include grants for adult cattle, pig and poultry housing.  "
        },
        {
            "text": "This grant represents an opportunity to fund changes on farm that will improve productivity and futureproof calf housing. "
        },
        {
            "text": "Upgrading or building new calf housing with an ambient environment will help to produce healthy calves that are more likely to be resilient and productive in later life.  "
        },
        {
            "text": "Better housing provides a comfortable temperature, protection from humidity and draughts, as well as allowing social contact between animals.  "
        },
        {
            "text": "It’s positive for the animals and the increases in productivity will benefit your bottom line."
        },
        {
            "text": "For example, you could get funding for an A-frame building to house dairy calves from birth to weaning, or a mono-pitch building on a beef unit to house calves between 3-6 months. You can also apply for funding for permanent open-sided structures with igloos/hutches and other types of calf housing. "
        },
        {
            "text": "This is also an opportunity to adapt your calf housing and ensure it’s ready to meet the demands of extreme weather conditions and changing climate. "
        },
        {
            "text": "Through this grant you will be able to access funding for rooftop solar panels, a great source of thermal insulation and low-cost energy for your calf housing.  "
        },
        {
            "heading": 2,
            "text": "Applying for a grant "
        },
        {
            "text": "You’ll be able to apply for a grant later this summer. "
        },
        {
            "text": "To help you prepare, we’ve published the guidance for the Calf Housing for Health and Welfare grant on GOV.UK. "
        },
        {
            "text": "The guidance explains: "
        },
        {
            "text": "You will be required to seek advice from your vet as part of the application process.  "
        },
        {
            "text": "This is to make sure the infrastructure changes funded by the grant reflect the specific health and welfare needs of the calves on your farm.  "
        },
        {
            "text": "One way to get this advice is to apply for an Annual Health and Welfare Review. Available through the Pathway, the Review is a fully-funded visit by your choice of vet. It provides bespoke advice on health and welfare of your animals, as well as access to testing for endemic diseases and conditions. "
        },
        {
            "text": "We’ll post again when it’s time to make your grant application, so subscribe to the blog for an update. "
        }
    ]
}