{
    "url": "https://ruralpayments.blog.gov.uk/2023/07/26/rpa-to-make-bps-advance-payments-in-august/",
    "title": "RPA To Make BPS Advance Payments In August",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Basic Payment Scheme"
    ],
    "pub_date": "2023-07-26T09:08:27+01:00",
    "content": [
        {
            "text": "In 2022, we made Basic Payment Scheme (BPS) payments in two instalments to support farmers and landowners at a time of increased pressure on cash flow.  "
        },
        {
            "text": "Advance payments of up to 50% were made from the end of July and across August, with the balance payments made from December 2022.  "
        },
        {
            "text": "We have listened to the feedback that we received in response to making BPS payments in this way and will be making advance payments again this year.  "
        },
        {
            "heading": 2,
            "text": "How will it work in 2023?  "
        },
        {
            "text": "In response to feedback on how we can make improvements, BPS advance payments will be paid on a single day, which is 1 August 2023.   "
        },
        {
            "text": "The payments will be up to 50% of the total annual BPS payment. The remaining balance will be paid in December 2023.  "
        },
        {
            "text": "Once your payment has been made, a remittance notice will be sent in the post confirming the amount paid. When the balance payment is made in December, you will receive a claim statement explaining how the 2023 payments have been worked out.  "
        },
        {
            "text": "Both the advance and balance payments will reflect progressive reductions applied as we phase out BPS payments to 2027.    "
        },
        {
            "text": "You can use the online calculator as a guide to understanding how progressive reductions could affect your BPS payments.  "
        },
        {
            "text": "For more information about BPS, you can read the guidance on GOV.UK. "
        },
        {
            "text": "It’s important to make sure that all of your details are correct in the Rural Payments service.  "
        },
        {
            "text": "For guidance on how to update your password, email address, details and permissions, we have created a series of videos you can follow on our YouTube channel.  "
        },
        {
            "text": "To stay up to date with the latest information and updates from RPA, sign up to our blog and follow us on social media on the following accounts:   "
        },
        {
            "text": "By following and subscribing to our social channels and blog, you’ll be able to see the latest updates about important information. We also share top tips and announcements.  "
        },
        {
            "text": "You can also listen to The RPA Podcast which we have launched to help farmers, landowners and rural communities keep up to date with the latest news from RPA. "
        },
        {
            "text": "If you need to submit a query to RPA, you can use the online query form in the Rural Payments service. Follow the steps in our video guidance on how to submit questions and receive answers from RPA all in one place in the Rural Payments service. "
        }
    ]
}