{
    "url": "https://deframedia.blog.gov.uk/2023/07/26/what-we-have-achieved-at-agricultural-shows-this-summer/",
    "title": "What we have achieved at agricultural shows this summer",
    "authors": [
        "defrablogs"
    ],
    "categories": [
        "Farming"
    ],
    "pub_date": "2023-07-26T11:49:26+01:00",
    "content": [
        {
            "text": "Agricultural shows are the highlight of farming calendars across the country."
        },
        {
            "text": "Since May, Defra ministers have travelled to 16 different shows in every nation and region of the UK , speaking to farmers and land managers about our new farming schemes and payments and listening to their feedback about how we can continue to respond to the challenges they are facing."
        },
        {
            "text": "Combined with the work of Defra’s team of farming officials, we estimate that we will have spoken face-to-face with more than 5,000 farmers and land managers at shows by the end of the year."
        },
        {
            "text": "Since May, we have made significant progress through a number of announcements that will help to support farmers in a way that will work for farm businesses, food production and the natural environment."
        },
        {
            "text": "We’ve also made it easier for farmers to find the funding that works for them with a dedicated page on gov.uk, and published regular updates on every part of our farming policy on our Defra farming blog."
        },
        {
            "text": "Farming Minister Mark Spencer said:"
        },
        {
            "text": "“This agricultural show season has been another fantastic celebration of the best of British farming and it’s been inspiring to meet so many brilliant farmers who work all-year round to put food on our plates."
        },
        {
            "text": "“The last few months have also been an important chance to hear directly from farmers about how our policies are working for them, and what we can do to improve them further."
        },
        {
            "text": "“We’re proud of the huge progress that we’ve made to further improve our offer to farmers over recent months, including setting out full detail on the new and improved Sustainable Farming Incentive 2023, bringing the whole food sector together in Downing Street to deliver a major package of support, and providing millions of pounds of grants to help thousands of farmers improve their productivity and sustainability."
        },
        {
            "text": "“But we’re not complacent, and we know that there’s still work to do to ensure that our schemes work for farm businesses, food production and the natural environment.”"
        },
        {
            "text": "During the agricultural show season, the government has:"
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}