{
    "url": "https://insidedio.blog.gov.uk/2019/09/23/new-online-booking-system-for-training-facilities-will-make-life-easier-for-our-armed-forces/",
    "title": "New online booking system for training facilities will make life easier for our Armed Forces",
    "authors": [
        "Rachel Whitelock"
    ],
    "categories": [
        "Landmarc",
        "Military Training"
    ],
    "pub_date": "2019-09-23T15:17:14+00:00",
    "content": [
        {
            "text": "A Bidding and Allocation Management System (BAMS Online) went live across the Defence Training Estate this summer. It is a new online booking service for our Armed Forces, which replaces paper forms and processes for troops looking to book facilities on the UK’s training areas and ranges. As the BAMS and National Service Centre Manager for Landmarc Support Services (Landmarc), I am responsible for a team that supports all users of BAMS by providing training and technical help."
        },
        {
            "heading": 2,
            "text": "Benefits of BAMS"
        },
        {
            "text": "Landmarc has worked with the Defence Infrastructure Organisation (DIO) for over 15 years to manage and operate military training facilities across the MOD’s 190,000 hectares of UK training estate. Together, we are always looking for ways to innovate to ensure that our Armed Forces are provided with the best possible resources and that they can access them in the most efficient way."
        },
        {
            "text": "With over 6,000 bookable facilities, one of the most important benefits of BAMS is that the military now has one system that provides complete visibility of everything that the training estate has to offer; which means more options to help meet vital training objectives. The military tend to focus on the main training areas when booking facilities as it is what they have always known. With BAMS you can now see all the different locations and facilities that are available across the country from ranges, dry training areas and urban complexes which should reduce clashes with availability and encourage use of other lesser known areas."
        },
        {
            "text": "BAMS offers over 6,000 facilities for soldiers to train [Crown Copyright/MOD2019]An availability calendar enables users to see when a location is fully booked before wasting valuable time applying for the same dates and bid details can be saved for repeat requests. BAMS also has an intelligent search facility, so users can identify a range of training facility options based on location, need, availability and preference."
        },
        {
            "text": "From an estate management perspective, this centralised booking system will also help us to provide essential data to the MOD about how the training estate is used. This will inform future investment decisions and encourage the most cost-effective use of the training estate."
        },
        {
            "heading": 2,
            "text": "Top tips for BAMS Online Users"
        },
        {
            "text": "My team and I have daily contact with military users through our BAMS help desk, where we help with a range of different queries. Our top 10 tips for end users to get the most out of BAMS online would be:"
        },
        {
            "heading": 2,
            "text": "The future of BAMS"
        },
        {
            "text": "Throughout the development of BAMS, Landmarc and DIO consistently engaged with military users to test the system and provide opportunities for feedback to ensure we could deliver a service that is both intuitive and meets their booking requirements. Now that BAMS is up and running we are continuing this process so that BAMS can evolve with the changing requirements of military training, supporting our joint aims of providing a better Defence estate, a better customer service and a better business for our Armed Forces."
        }
    ]
}