{
    "url": "https://ofsi.blog.gov.uk/2023/07/12/an-update-to-our-licensing-process-returning-incomplete-applications/",
    "title": "An Update to our Licensing Process: Returning Incomplete Applications",
    "authors": [
        "OFSI"
    ],
    "categories": [
        "Financial Sanctions",
        "Implementation",
        "Licensing"
    ],
    "pub_date": "2023-07-12T12:18:55+01:00",
    "content": [
        {
            "text": "In response to the illegal invasion of Ukraine, the UK introduced the largest and most severe package of economic sanctions that Russia has ever faced. As a result, the Office of Financial Sanctions Implementation (OFSI) continues to experience unprecedented high demand to consider applications for new licences and for amendments to existing licences."
        },
        {
            "text": "When applying for a specific licence, or an amendment to an existing specific licence, applicants must provide evidence to support an application and demonstrate that all criteria of the relevant licensing ground have been met. Where an application has insufficient details or evidence, OFSI’s General Guidance states that: 'Incomplete applications will not be considered and will be returned to the applicant for re-submission' (see paragraph 6.9)."
        },
        {
            "text": "Since the invasion, and to help mitigate the impact on applicants, OFSI has repeatedly engaged with applicants until such a time as sufficient details and evidence have been received and a decision can be taken."
        },
        {
            "text": "To reduce delays and ensure a timely service can be provided for all applicants, OFSI will be ending this temporary measure and will resume returning applications which are not complete at the time of receipt."
        },
        {
            "text": "An incomplete application is one in which key information is missing, such as an adequate explanation as to why the licensing purpose applies."
        },
        {
            "text": "Applicants will be able to re-apply; however, this will be treated as a new application and will not be prioritised purely because it has been resubmitted."
        },
        {
            "text": "OFSI will continue to assist applicants who contact us to understand the licensing process as well as our evidentiary requirements. However, we cannot provide legal advice and applicants should consider taking independent legal advice before applying, especially for complicated matters."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "To ensure that an application is complete and to prevent it from being returned, applicants may wish to: "
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Some of the key pieces of information that applicants will need to provide are: "
        },
        {
            "heading": 4,
            "text": "The Regulations"
        },
        {
            "text": "Please note that OFSI can only issue licences which relate to financial sanctions. If an application relates to another type of sanction, then it should be redirected to the relevant Department. Further information can be found here."
        },
        {
            "heading": 4,
            "text": "The UK Nexus"
        },
        {
            "heading": 4,
            "text": "The Licensing Purpose"
        },
        {
            "text": "How can applicants demonstrate this?"
        }
    ]
}