{
    "url": "https://marinescience.blog.gov.uk/2023/07/12/early-career-scientist-interdisciplinary-summer-school-a-week-of-fun-facts-and-fish/",
    "title": "Early Career Scientist Interdisciplinary Summer School: a week of fun, facts and FISH!",
    "authors": [
        "James Lamb"
    ],
    "categories": [
        "Field Research",
        "Fisheries",
        "International",
        "Science"
    ],
    "pub_date": "2023-07-12T11:34:14+01:00",
    "content": [
        {
            "text": "First things first, who am I? I'm James, an Offshore Fisheries Observer and team leader at Cefas. I have been doing the observer role for almost 4 years now, so I am very much an early career (fisheries) scientist. I also manage a small team of observers, the majority of which are in the early stages of their careers. "
        },
        {
            "text": "Being an early career scientist can be a difficult time. Navigating along a somewhat ill-defined career path, becoming proficient in what you do, while simultaneously figuring out what it is you want to do. And to quote a famous Albert “If we knew what we were doing, it wouldn’t be called research would it”. At times it can feel like spinning plates while riding a unicycle while an angry bear is chewing on your leg. So having the opportunity to spend a week with people in the same boat, and share experiences, wisdom (and recipes for bear spray) can be an incredibly valuable and fulfilling experience.  "
        },
        {
            "text": "Now, time for acronyms..."
        },
        {
            "text": "A key aim of SIIECS (Strategic Initiative on Integration of Early Career Scientists) is to foster interdisciplinary collaboration of ECS (Early Career Scientists) within ICES (International Council for the Exploration of the Seas). And out of this, the idea for an InterDiS (Interdisciplinary Summer School) was born. In collaboration with OYSTER (Orienting Young ScienTists of EuromaRine) and the incredibly hard work of the organisers, this May the first (of hopefully many) InterDiS was hosted. "
        },
        {
            "text": "The week was split between networking, guest speakers, lectures and proposal writing. All with the aim that we walk away with, not only a better understanding of interdisciplinary research, but the skills to make said research happen.  "
        },
        {
            "text": "And, from my point of view, the week was a roaring success.  "
        },
        {
            "text": "The week also focused heavily on dissemination and communicating our research. Retrospectively a lot of what we discussed was obvious, but not something I had thought about. Using science communicators and social scientists in collaboration with the “hard sciences” in my new state of enlightenment is the only way science should be done. Traditionally this kind of collaboration is a rarity.  "
        },
        {
            "text": "Early Career Scientists, I feel sit in two camps, industry, and academia. As the least academically qualified attendee at InterDIS, I went into the week with a small feeling of imposter syndrome. This feeling very quickly dissipated as my opinions were valued and my industry experience was welcomed with open arms. PhD courses (as most attendees were somewhere on the doctorate trajectory), build into the course requirements opportunities to present work and actively encourage collaboration. But I personally feel there is an untapped wealth of non-academic experience to show off, utilise and more importantly support. "
        },
        {
            "text": "However, for me personally, the week was more than just another tool in the box, it was invigorating. Being surrounded by likeminded people who share my passions (and frustrations) and seeing 28 diverse ways of fighting for our oceans, from different disciplines, using different epistemologies (a new concept for me after this week) was amazing. Putting the science aside, I found the week cathartic and as was raised in our feedback session, we all had fun. This is what science should be about; fun, facts and FISH! "
        },
        {
            "text": "So, what does the future look like? I gained an unexpected sense of purpose; I want to run around shouting from the rooftops about InterDiS! I want to champion all our early career scientists and what they do, but as I learned from the proposal writing portion of the course, grand dreams with no structure often remain as such, dreams. I need a goal, objectives, tasks and outcomes. I’m not at that point yet, so watch this space. "
        },
        {
            "text": "I will leave you with this, don’t sell yourselves short, collaborate, innovate. Contact that researcher that you have always wanted to work with. Submit to that call for abstracts. Do what science does best, do.  "
        }
    ]
}