{
    "url": "https://insidehmcts.blog.gov.uk/2023/07/12/helping-people-navigate-the-justice-system-signposting-in-action/",
    "title": "Helping people navigate the justice system: signposting in action",
    "authors": [
        "Charlotte Rook, Support Through Court Regional Manager"
    ],
    "categories": [
        "Training and support"
    ],
    "pub_date": "2023-07-12T14:30:08+01:00",
    "content": [
        {
            "text": "Following on from Miriam Davidson’s recent blog on our signposting strategy, Charlotte Rook, from Support Through Court, explains what happens after we signpost a person to their charity for help."
        },
        {
            "text": "Support Through Court makes a real difference to real people. We’re a volunteer led charity and our priority is to help people facing civil and family proceedings without legal representation. We work with our clients to be able to navigate the legal system with confidence. One of the main ways that people access our support is through signposts from organisations such as HMCTS, call handlers in a service centre, local third-sector agencies and law clinics. "
        },
        {
            "text": "We know the number of people without legal representation (known as litigants in person) is rising and that they can find the justice system confusing. On top of this, many of the people that we support are dealing with the trauma of issues including separation from children, homelessness, and domestic abuse. Stuck in a stressful cycle of events and circumstances, people need somewhere to turn. Last year, we were there for people on more than 57,000 occasions. "
        },
        {
            "heading": 3,
            "text": "Helping people find their way through the justice system "
        },
        {
            "text": "Our service is free for anyone who needs our help with a civil or family case, as long as they do not have a legal representative. We do not give legal advice but provide legal information, and practical support such as: "
        },
        {
            "text": "Our volunteers also provide emotional support to help reduce anxiety and increase confidence in our clients so that they feel more able to present their cases. While we are unable to speak on behalf of clients in court, our volunteers can attend court and discuss what happened afterwards. Feeling supported and having an extra pair of eyes and ears on the case enables our clients to feel in control and better able to approach their situation. We’re also told by some judges that our service can enable hearings to proceed more effectively as we help clients to be better prepared. "
        },
        {
            "heading": 3,
            "text": "Providing emotional and practical support"
        },
        {
            "text": "We provide help in person and remotely. Our volunteers listen to a client’s story, to best understand how to support and assist them on their journey through the courts.  "
        },
        {
            "text": "We can provide light-touch support for people who need reassurance that they’re on the right track. Alternatively, we can provide more in-depth support for people who are overwhelmed by their situation and the court proceedings. Volunteers will listen to each client’s needs and work with them to establish the best way to provide support. "
        },
        {
            "heading": 3,
            "text": "Supporting people in the future "
        },
        {
            "text": "We’re doing more than ever to be there for people alone in court. Our current locations can be found on our website along with the contact number for our national helpline, for those who do not live near one of our local services.  "
        },
        {
            "text": "In summer of 2023, we’ll be extending our support nationally and increasing access to our service through video chat. This will allow us to closely mirror the face-to-face experience for those who cannot access a local service and need more than phone support.  "
        }
    ]
}