{
    "url": "https://educationhub.blog.gov.uk/2023/07/hot-weather-and-heatwaves-guidance-for-schools-and-other-education-settings/",
    "title": "Hot weather and heatwaves: guidance for schools and other education settings",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Schools"
    ],
    "pub_date": "2023-07-12T14:47:05+01:00",
    "content": [
        {
            "text": "There are several ways that schools can make changes to keep children safe in hot weather, especially as children are more at risk of becoming ill with heat-related issues than adults. "
        },
        {
            "text": "The UK Health Security Agency (UKHSA) has published updated guidance for schools and early years settings to help them. "
        },
        {
            "text": "Here we recap the key points you need to know about how schools should manage hot weather. "
        },
        {
            "heading": 3,
            "text": "Do schools close in hot weather? "
        },
        {
            "text": "During hot weather, we don’t normally advise schools to close. "
        },
        {
            "text": "This is because school attendance is the best way for pupils to learn and reach their potential, and hot weather can usually be managed safely. "
        },
        {
            "text": "School leaders should make sure they take any steps necessary to make sure children are safe and comfortable. "
        },
        {
            "heading": 3,
            "text": "What are the rules for uniform in hot weather? "
        },
        {
            "text": "Schools could consider relaxing uniform rules during hot weather to make sure pupils are comfortable. "
        },
        {
            "text": "Children should wear loose, light-coloured clothing to help keep cool and sunhats with wide brims. When outdoors, encourage children to stay in the shade as much as possible.  "
        },
        {
            "text": "Sunscreen with high sun protection factors should be used to protect skin. "
        },
        {
            "text": "Teachers should also encourage children to take off their blazers and jumpers.  "
        },
        {
            "heading": 3,
            "text": "What activities are appropriate in hot weather? "
        },
        {
            "text": "The Department of Health and Social Care (DHSC) recommends children should not take part in vigorous physical activity on very hot days. Lessons can be adapted for hot weather when sedentary activities are more appropriate. "
        },
        {
            "heading": 3,
            "text": "What other adjustments can schools make in hot weather? "
        },
        {
            "text": "If possible, open classroom doors as well as windows to encourage cross ventilation in the single sided classrooms. "
        },
        {
            "text": "Windows should be opened as early as possible in the morning before children arrive, or preferably overnight to allow stored heat to escape from the building (checking insurance conditions and need for security if windows are to be left open overnight).  "
        },
        {
            "text": "Windows should be closed when the outdoor air becomes warmer than the air indoors – this should help keep the heat out while allowing adequate ventilation. Indoor blinds or curtains can be closed where possible but should not block ventilation, CO2 monitors can be used to keep a check on ventilation. "
        },
        {
            "text": "Electric lighting should be kept to a minimum and equipment should not be left in ‘standby mode’, as this generates heat. Mechanical fans can be used to increase air movement if temperatures are below 35°C – at temperatures above 35°C fans may not prevent heat-related illness and could worsen dehydration. "
        },
        {
            "text": "Provide and encourage children to drink more water than usual in hot weather. "
        },
        {
            "text": "Teachers and other educational professionals who manage or work in schools or early years settings should sign up to receive Weather-Heath Alerts from the UK Health Security Agency (UKHSA) and the Met Office by using this form. "
        },
        {
            "heading": 3,
            "text": "What are the signs of heat related medical conditions in children? "
        },
        {
            "text": "If sensible precautions are taken, children are unlikely to be seriously affected by hot conditions but teachers, assistants, school nurses and all child carers should look out for signs of heat stress, heat exhaustion and heatstroke. "
        },
        {
            "text": "Symptoms of heat stress: "
        },
        {
            "text": "Symptoms of heat exhaustion may include: "
        },
        {
            "text": "To cool a child suffering from heat exhaustion: "
        },
        {
            "text": "If you are concerned about symptoms, or they are worsening, seek medical advice by contacting NHS 111. "
        },
        {
            "text": "Heat exhaustion can lead to heatstroke and is a medical emergency. "
        },
        {
            "text": "Symptoms of heatstroke may include: "
        },
        {
            "text": "If heatstroke is suspected, call 999 and then cool the child down whilst awaiting medical assistance. "
        },
        {
            "text": "If a child loses consciousness, or has a fit: "
        },
        {
            "text": "For more information on heat related illnesses visit the UKHSA’s website. "
        }
    ]
}