{
    "url": "https://deframedia.blog.gov.uk/2023/07/12/new-regulations-set-to-promote-fairness-and-transparency-across-the-dairy-sector/",
    "title": "New regulations set to promote fairness and transparency across the dairy sector",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Farming"
    ],
    "pub_date": "2023-07-12T14:22:53+01:00",
    "content": [
        {
            "text": "Yesterday (11th July), Defra Farming Minister, Mark Spencer, outlined more detail on regulations set to come into force later this year which will ensure supply contracts in the dairy sector are fair and transparent."
        },
        {
            "text": "Speaking at the Great Yorkshire Show, Minister Spencer stated that this was part of delivering on a key commitment set out at the Prime Minister’s Farm to Fork Summit held earlier this year to ensure that farmers are being paid a fair price for their produce."
        },
        {
            "text": "The announcement received coverage across farming trade publications, including Farmers Guardian, Farmers Weekly, Farmers Guide, Farming UK, Agriland and The Grocer. There was also coverage across regional media in Yorkshire from the Yorkshire Post, the Darlington & Stockton Times and The Stray Ferret."
        },
        {
            "text": "The NFU also welcomed the dairy regulations update, stating that the new regulations promise to empower dairy farmers' negotiating position, helping to ensure fairer prices, transparency and accountability across the supply chain."
        },
        {
            "text": "The regulations will mean that farmers have clearer pricing terms, with contracts setting out the factors which generate the milk price and allowing farmers to challenge prices if they feel this process isn’t being followed. They will also ensure that changes to contracts can't be imposed on farmers without their agreement, providing stability and trust in the supply chain."
        },
        {
            "text": "In addition, under the new regulations, farmers’ contracts will all include a straight-forward way to raise concerns about their contracts, promoting accountability and timely issue resolution and there will be clear rules put in place on notice periods and contractual exclusivity, removing any ambiguity from contracts and protect the rights of both buyers and sellers. An enforcement mechanism will also be created to guarantee the regulations are followed, ensuring a fully fair and transparent dairy industry on a solid foundation to thrive in the future."
        },
        {
            "text": "These regulations come alongside wider support for the agricultural sector, with £2.4 billion per year being invested in farming for the rest of this Parliament. This includes support for farmers through our new environmental land management schemes, with an expanded and improved Sustainable Farming Incentive 2023 offer announced last month, as well as enabling the sector to harness new opportunities for the development of automatic and robotic technologies on farms as part of our £270 million Farming Innovation Programme."
        }
    ]
}