{
    "url": "https://charitycommission.blog.gov.uk/2024/05/20/campaigning-and-political-activity-what-do-charities-need-to-consider-ahead-of-a-general-election/",
    "title": "Campaigning and political activity – what do charities need to consider ahead of a general election?",
    "authors": [
        "Orlando Fraser KC"
    ],
    "categories": [
        "Campaigning",
        "Guidance"
    ],
    "pub_date": "2024-05-20T09:12:09+01:00",
    "content": [
        {
            "text": "A General Election is on the horizon, and I know that some charities will be ramping up their campaigning and political activity in anticipation of this."
        },
        {
            "text": "In this context I want to remind charities of their responsibilities and of our published guidance to help with decision making around political activity and campaigning, as I have already done jointly in a blog with John Pullinger of the Electoral Commission."
        },
        {
            "text": "As trustees and charity leaders, you may see this as a critical moment to speak up for the cause you serve, and that is legitimate and healthy for our country. As I’ve said many times, charity campaigning plays an important role in society and the law is clear about the right of charities to campaign in support of their purposes. The Commission is steadfast about that."
        },
        {
            "text": "However, in order to maintain public confidence in your political campaigning, and trust in charities more broadly, it is crucial that you campaign in a way that is consistent with the legal framework."
        },
        {
            "text": "Charity leaders’ role in shaping the debate"
        },
        {
            "text": "Charities may give support to or raise concerns about specific policies advocated by political parties but as trustees and leaders of charities, you have an important responsibility to ensure that everything you do, and every decision you make, helps you further your charity’s purposes and is in the best interests of your charity."
        },
        {
            "text": "Charities are required to be independent and cannot have political purposes, and this is important for public trust in charities. As such, charities must never stray into party politics – they must never promote, or be seen to promote, a political party or candidate."
        },
        {
            "text": "As trustees and charity leaders you must protect your charity’s reputation and not allow your organisation to be used as a vehicle for the expression of the party-political views of any individual trustee, employee, political party, or candidate."
        },
        {
            "text": "We seem to live in an increasingly divided society, in which public discourse is becoming ever more polarised. Personal attacks undermining the motivations of opponents risk becoming the norm, not just in party politics, but in wider public debate. And the work of charities is often at the biting edge of the most sensitive, divisive of these debates."
        },
        {
            "text": "But charities are different, both in law, and in the public mind. In this context, the Commission expects charities to engage in public discourse in a way that promotes respect, tolerance and consideration for others, and in a tone that reflects your trusted standing as a charity – avoiding inflammatory rhetoric."
        },
        {
            "text": "This does not mean avoiding criticism of political parties’ policies, and it does not mean that you have to avoid passionate, emotive or direct messaging – but you should remain focused on the issues relevant to your charity and avoid character attacks."
        },
        {
            "text": " The role of the Commission"
        },
        {
            "text": "I want to assure you that, as Chair of the Commission, I understand the importance of our role during this time. Complaints to the regulator are one certainty in an otherwise uncertain period of heightened political volatility. But in regulating charities in line with the legal framework I assure you that - whilst all complaints will be considered carefully - I will not allow the Commission to be misused or weaponised by any particular side of the public debate, whether it be by politicians, the media, or indeed the sector itself."
        },
        {
            "text": "Our decisions will be based on the public interest and the law alone, in line with our Regulatory and Risk Framework, and regardless of the source of complaints. We will ensure, as we always do, that our regulatory decisions are fair, balanced and independent, and we will take any action needed to resolve concerns promptly, also being clear where no action is appropriate."
        },
        {
            "text": "Key Commission guidance"
        },
        {
            "text": "For an introduction to charity campaigning and political activity you can read our 5-minute guide on the topic."
        },
        {
            "text": "For more detailed material to help you in your decision making, see our in depth guidance on campaigning and political activity for charities. We also have supplementary guidance on campaigning and political activity during an election period."
        },
        {
            "text": "You may also find it helpful to read our guidance on charities and social media as your charity prepares its campaigning and political activity."
        },
        {
            "text": "Please take the opportunity to review this guidance, as it sets out the principles of charity law and the legal framework within which charities are expected to operate in this context."
        },
        {
            "text": "Finally, as we approach the General Election the Commission will be continuing to issue content supporting charities when considering political activity and campaigning in this context. Keep an eye on our digital channels for the latest."
        }
    ]
}