{
    "url": "https://aphascience.blog.gov.uk/2024/05/20/championing-best-beekeeping-practices-throughout-ghana/",
    "title": "Championing best beekeeping practices throughout Ghana",
    "authors": [
        "Flavie Vial"
    ],
    "categories": [
        "Bee health",
        "International"
    ],
    "pub_date": "2024-05-20T14:20:36+01:00",
    "content": [
        {
            "text": "To raise awareness of the importance of pollinators, the threats they face and their contribution to sustainable development, the UN designated 20 May as World Bee Day. Bees as pollinators are fundamental for the health of ecosystems and food security. Beekeeping is also increasingly seen as an opportunity to diversify livelihood opportunities for men and women in rural areas and support sustainable economic growth in low- and middle-income countries."
        },
        {
            "text": "Ghana’s aspirations to grow its honey production and export are hindered by the lack of information on its apiculture (the science of maintaining colonies of bees, a largely unregulated sector) and bee health in the country. As part of the Department for Environment, Food and Rural Affairs' Animal Health System Strengthening project, APHA has been providing technical assistance to Ghana to help strengthen its animal health systems. As a recognised centre of excellence in the provision of advice and research in bee health, we were asked by the Ministry of Food and Agriculture to work with competent authorities and relevant stakeholders in country to improve knowledge about honeybee health and husbandry."
        },
        {
            "text": "Unique to the British Isles, our National Bee Unit (NBU) has been involved in the management and control of bee pests and diseases, along with training and dissemination of information to beekeepers for over 60 years. They have now partnered with the University of Ghana (UG) and Kwame Nkrumah University of Science and Technology (KNUST) Schools of Veterinary Medicine and trained some of their staff on the basics of bee management and bee health. These trainees are now being mentored to develop a bee health course for inclusion in the veterinary undergraduate and postgraduate programmes in Ghana."
        },
        {
            "text": "A workshop bringing together representatives from the apiculture industry, academia, government, and non-governmental organisations in Ghana was organised by APHA in December 2023. Across two days, participants discussed the concerns of beekeepers; constraints to enhancing the safety and quality of the honey produced for local consumption and export; the evidence needs future research should address; and potential regulatory and policy gaps."
        },
        {
            "text": "To continue building on their shared understanding of the Ghanaian beekeeping landscape, a team made up of bee inspectors from the NBU and the mentees from the UoG and KNUST spent two weeks together in February 2024 to observe working hives and supply chain from frame to jar. They conducted bee health surveys and recorded a lot of useful information on local husbandry and pest management practices and indigenous harvesting methods. This will help the team adapt best practices to make them relevant and acceptable to honey producers and processors in Ghana."
        },
        {
            "text": "We met some of Ghana’s most successful bee farmers who train new beekeepers within their local associations and who are open to expanding their technical skills and trial different techniques. Within the AHSS project, several more joint activities are planned between Ghana and the UK over the next 12 months to continue developing role models to champion best apiculture practices throughout Ghana."
        }
    ]
}