{
    "url": "https://kingsawards.blog.gov.uk/2024/05/20/frugalpac-receives-kings-award-for-enterprise-for-its-low-carbon-frugal-bottles/",
    "title": "Frugalpac receives King's Award for Enterprise for its low-carbon Frugal bottles",
    "authors": [
        "The Queen's Awards for Enterprise"
    ],
    "categories": [
        "Advice",
        "Innovation"
    ],
    "pub_date": "2024-05-20T17:02:20+01:00",
    "content": [
        {
            "text": "British sustainable packaging company Frugalpac, which produces the Frugal Bottle – the world’s first paper bottle for wines and spirits, and the machines that make them - has been honoured with a prestigious King’s Award for Enterprise for Innovation."
        },
        {
            "text": "Frugalpac’s Frugal Bottle is made from 94% recycled paperboard, has a carbon footprint 84% lower than a glass bottle and has been produced to decarbonise the global drinks industry."
        },
        {
            "text": "As well as being found in the wines and spirits aisles at Aldi and Sainsbury’s supermarkets, 45 brands around the world are using them in over 25 countries including the US, Canada, South Africa, Australia, New Zealand, Japan, the UK, Scandinavia, Italy, Spain, France and other European countries."
        },
        {
            "text": "Last year, Frugalpac was also invited by the Department for Business and Trade to display its Frugal Bottles during a Franco-British trade event in Bordeaux hosted by His Majesty The King and Her Majesty The Queen."
        },
        {
            "text": "To mark the occasion, Frugalpac created a commemorative paper bottle with the King’s cypher, the Boardeaux crest and the Union flag, filled with Bordeaux wine. The ‘Cardboardeaux’ wine bottles were then presented to the Royal Couple."
        },
        {
            "text": "Employing 29 people, Frugalpac was founded in 2011 and from its 11,000sq foot Innovation Centre in Ipswich, Suffolk, the company looks to reduce the impact of carbon on the planet by engineering sustainable packaging, using recycled paperboard, that’s easy to recycle again."
        },
        {
            "text": "Its flagship product the Frugal Bottle is made from 94% recycled paperboard in the shape of a Bordeaux bottle and contains an easily separable food grade pouch to hold the liquid, like those in bag in box wines."
        },
        {
            "text": "An Intertek study commissioned by Frugalpac, found a Frugal Bottle has a carbon footprint up to six times (84%) lower than a glass bottle and more than a third less than a bottle made from 100% recycled plastic. Its water footprint is also four times lower than glass and it uses up to 77% less plastic than a plastic bottle."
        },
        {
            "text": "In addition to its impressive eco credentials, the shatterproof bottles weigh just 83g and are lighter to carry and transport – making them ideal for outdoor leisure and sporting events, and for the travel sector."
        },
        {
            "text": "Sainsbury’s was the first supermarket in the UK to list Frugal Bottles with The Greener Greenall’s Original London Dry Gin in 2022, followed by When In Rome’s award-winning craft Italian wines in Spring 2023."
        },
        {
            "text": "Most recently in the UK, Aldi became the first supermarket to launch its own-label Cambalala South African wines in the bottles in March this year, while in the US, Whole Foods has just become the first American supermarket to carry the bottles with Bonny Doon Vineyard’s Frugal Bottle wine ‘Carbon…Nay’ landing in stores across the US from April."
        },
        {
            "text": "As well as producing Frugal Bottles at its factory in Ipswich, Frugalpac makes Frugal Bottle Assembly Machines so its paper bottles can be produced around the world. It has already sold three machines for export to the US, Canada and Australia."
        },
        {
            "text": "Each machine is capable of producing 2.5m bottles per year. By placing Frugal Bottle Assembly Machines at the heart of bottling plants, co-packers or packaging companies around the world, Frugal Bottles can be produced locally, reducing carbon miles even further and making its packaging even more sustainable."
        },
        {
            "text": "Its first overseas Frugal Bottle Assembly Machine is now operational in Canada at Kinsbrae Packaging, while a second machine is heading to Monterey Wine Company in California - due to be in production in Q3. A third Frugal Bottle Assembly Machine is heading Down Under to Mother of Pearl Vodka to serve the Australian and Southeast Asian drinks market in early 2025."
        },
        {
            "text": "Frugalpac CEO Malcolm Waugh said: “It’s a great honour to have our pioneering work recognised at this highest level."
        },
        {
            "text": "“At Frugalpac our team is passionate about finding innovative low carbon solutions to reduce the impact of incumbent packaging on our planet and this award is all down to them."
        },
        {
            "text": "“Working with like-minded stakeholders around the world, we’re realising our vision of establishing Frugal Bottle hubs around the world to produce our paper bottles to help decarbonise the global wine and spirits industry."
        },
        {
            "text": "“From our Ipswich base, our goal continues to be to save the planet one bottle at a time by cutting the carbon footprint of wine and spirits bottles by 84%. We’re also delighted that His Majesty and Her Majesty have seen our Frugal Bottles at first hand and we hope they enjoyed the wine!”"
        }
    ]
}