{
    "url": "https://ruralpayments.blog.gov.uk/2024/05/20/introducing-you-to-donna-medd/",
    "title": "Introducing you to...",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Introducing You To",
        "RPA podcast"
    ],
    "pub_date": "2024-05-20T15:34:43+01:00",
    "content": [
        {
            "text": "Hello. My name is Donna Medd and I work within the Grants Service Scheme Support Team. Our function is to support all the teams within Grants Service, which includes appraisals, development and claims and contracting."
        },
        {
            "text": "My role gives our customers an opportunity to showcase their projects and it’s always interesting to hear about how their businesses have benefitted from our grants and how they can provide huge benefits to farming businesses in a variety of ways, including using robotics and innovative technology."
        },
        {
            "text": "A typical day for me involves a lot of interaction with our customers as I’m currently working on pulling together some of our Farming Equipment and Technology Fund (FETF) and Farming Transformation Fund (FTF) case studies for RPA’s Annual Report. I’m also arranging some site visits around the country for grants colleagues to go out and see completed projects and take part in farm visits."
        },
        {
            "text": "I really enjoy speaking with our customers and understanding how we can make the grants process more user friendly. I’m an RPA Customer Excellence champion, which aims to train our people and adopt the commitment to make every decision with the customer in mind. I’ve recently achieved my silver level accreditation, and this has been mainly through my work as a champion and promoting others to become accredited."
        },
        {
            "text": "I also arrange the Grants Service away day, which is planned for June, and invite some of our customers along to give a presentation on the grants they’ve been awarded and how they‘ve benefitted their businesses. This is usually a highlight of the day for staff, as it really brings home how we all work together to deliver the benefits the grants give."
        },
        {
            "text": "I have a lot of interaction with the RPA communications team and have worked alongside them in producing our RPA podcast and contacting our customers to talk about their personal grant experiences. It’s always really interesting to hear their individual stories and how they’re so grateful for the grants they’ve received. I also coordinate our attendance at regional shows and events where we can meet customers face-to-face and discuss their projects in person. Both customers and Grants Service find this interaction very rewarding."
        },
        {
            "text": "I’ve worked for RPA since 2011. Before that I worked for Advantage West Midlands, the regional development agency for the West Midlands. I was working on the Rural Development Programme at the time the agency was dissolved, and as the programme still needed to be managed, we were moved over to Defra in Worcester and then merged with RPA. I have knowledge in many areas within legacy grants over the years, including claims and contracting, appraisals and site visits. Prior to that I’ve had a variety of different jobs, including 12 months working as cabin crew, a very long time ago!"
        },
        {
            "text": "Outside work, I live with my husband and two children who are nine and six. I’ve also recently become a dog mom to an active border collie named Mylo who keeps me very busy, and now spend a lot of time walking him before and after work! I also enjoy running and recently ran the Birmingham half marathon which I took part in to raise money and awareness for Diabetes UK. My son was diagnosed with type one diabetes early last year, so the charity is very close to my heart. I also enjoy chilling out on a nice spa day when I get the chance!"
        }
    ]
}