{
    "url": "https://defraenvironment.blog.gov.uk/2024/05/20/invasive-species-week-threats-to-our-native-wildlife/",
    "title": "Invasive Species Week: threats to our native wildlife",
    "authors": [
        "Lucy Cornwell"
    ],
    "categories": [
        "Invasive species"
    ],
    "pub_date": "2024-05-20T10:24:41+01:00",
    "content": [
        {
            "text": "Our natural world is under pressure. Factors like habitat loss and climate change make native plants and wildlife more susceptible to other environmental threats, such as disease, pests and competing species."
        },
        {
            "text": "Earlier this month, we wrote about the impact of extreme weather on our trees and plants."
        },
        {
            "text": "Today, to mark Invasive Species Week, we’re exploring the impact of invasive non-native species on our wildlife – with a special focus on the Asian hornet."
        },
        {
            "text": "Invasive species threaten our native wildlife"
        },
        {
            "text": "Over 2,000 plants and animals from all over the world have been introduced to Britain by people, both deliberately and by accident. These are known as non-native species."
        },
        {
            "text": "Most are harmless. But around 10-15% become invasive non-native species, which spread and have a harmful impact on the environment and wildlife, the economy, or human health and recreation."
        },
        {
            "text": "Invasive non-native species are one of the top five drivers of global biodiversity loss and play a role in 60% of plant and animal extinctions. They cost the global economy over $423 billion a year and their costs have quadrupled every decade since 1970."
        },
        {
            "text": "In Britain, they threaten the survival of native wildlife and damage our natural ecosystems by preying on or out-competing other plants and animals, and spreading harmful diseases."
        },
        {
            "text": "Invasive species cost the British economy almost £2 billion a year and can be a significant nuisance. Certain species can  irritate our skin or respiratory system, while others increase the risk of flooding or prevent us from enjoying recreational spaces and activities."
        },
        {
            "text": "Earlier this year, we wrote about how you can prevent the spread of invasive plants from your garden."
        },
        {
            "text": "Case study: the Asian hornet"
        },
        {
            "text": "Vespa velutina, commonly known as the Asian hornet is native to Asia. It is smaller than our native hornet, with a mostly black abdomen. It has yellow leg tips, which accounts for its other nickname – the yellow-legged hornet."
        },
        {
            "text": "The Asian hornet first arrived in Europe in 2004."
        },
        {
            "text": "It is believed that a single mated (fertilised) queen arrived in France in a consignment of pottery from China. The hornet is now widespread in France and has spread to other European countries."
        },
        {
            "text": "This presents a problem, because Asian hornets prey on pollinating insects, including honey bees."
        },
        {
            "text": "The National Bee Unit, part of the Animal and Plant Health Agency, have been taking action against Asian hornet since the first incursion into Britain in 2016."
        },
        {
            "text": "In 2023, the unit located and destroyed 72 nests in 56 locations. Many of the nests were found in the South East of England, the vast majority in Kent. Over winter, there was further analysis of the nests. This helped to identify areas in which there is a heightened risk that nests may have reproduced and released new queens. These would overwinter on their own, to establish new nests in the spring."
        },
        {
            "text": "In response to these findings, in March 2024 the National Bee Unit, in conjunction with stakeholders, rolled out and began closely monitoring traps in these areas."
        },
        {
            "text": "The traps, which do not allow non-target invertebrates to escape, have been set at locations across Kent, East Sussex, Devon and North Yorkshire. By the end of April, the unit had found 5 confirmed Asian hornets: 3 queen hornets found in traps and 2 Asian hornets reported by members of the public."
        },
        {
            "text": "The trapping should be completed by early June, at which point the opportunity to capture foundress queens (ones who would establish new colonies) diminishes. This is because once she has established her nest, she will remain inside and rely on the workers to bring in food to grow and support the colony."
        },
        {
            "text": "This is when we start to see increased sightings of Asian hornet workers. Reports become increasingly important to allow the nest to be tracked. The National Bee Unit will follow up credible sightings and take action to find and destroy any nests present."
        },
        {
            "text": "Help us by reporting any sightings of the Asian hornet"
        },
        {
            "text": "You can help to eradicate the Asian hornet in the UK by reporting any sightings through the Asian hornet app or online."
        },
        {
            "text": "All reports should include a photo and a location where possible."
        },
        {
            "text": "This week the Animal and Plant Health Agency are exhibiting at the Chelsea Flower Show to highlight the threat of Asian hornet and how the public can help by reporting sightings."
        },
        {
            "text": "Other ways to help protect the environment from invasive non-native species"
        },
        {
            "text": "Please:"
        },
        {
            "text": "To brush up on your knowledge of invasive species, or find activities taking place this week, visit the Non-native Species Secretariat website."
        },
        {
            "text": " "
        }
    ]
}