{
    "url": "https://marinescience.blog.gov.uk/2024/05/20/see-it-snap-it-report-it-suspected-japanese-oyster-drill/",
    "title": "See it, Snap it, Report it!     Suspected Japanese oyster drill",
    "authors": [
        "Debbie Murphy"
    ],
    "categories": [
        "Invasive species"
    ],
    "pub_date": "2024-05-20T09:30:02+01:00",
    "content": [
        {
            "text": "Those working to protect our Nation’s biodiversity couldn’t do their job without the additional eyes and ears of the public.  One way the public can assist is by reporting unusual and new sightings of flora and fauna, but have you ever wondered why we should bother or what will happen to the report?"
        },
        {
            "text": "A non-native species (also called non-indigenous species or alien species) is a species that arrives in a new location assisted by humans, deliberately or accidently.  Not all will establish in their new location and not all that establish will have a negative impact, but those that do are known as invasive non-native species."
        },
        {
            "text": "Figures released in 2023 estimated the annual cost of the economic impact of invasive non-native species to the GB economy to be £3,864 million (all sectors, all species*).  Invasive non-native species are one of the top five drivers of global biodiversity loss and have been a significant driver in 60% of global native species extinctions**. "
        },
        {
            "text": "It is difficult to spot aquatic species, especially in the marine environment, as they are often hidden below the water surface and with the coastline of GB, including islands, stretching 31,368 km monitoring beyond non-native species introduction hotspots such as ports and marinas is not feasible, which is where the public and their knowledge of their local area is vital to spot new arrivals."
        },
        {
            "text": "In January, a report was received by the Centre for Ecology and Hydrology from a member of the public who thought they may have spotted a possible incursion of Japanese oyster drill (Ocinebrellus inornatus) after discovering egg cases, potentially belonging to this species, on an East Sussex beach."
        },
        {
            "text": "This species potential sighting caused considerable concern as it preys on oysters, scallops, mussels, clams, cockles, barnacles and other gastropods, by drilling through their shells and consuming their flesh. If this species were to establish, it could put economically and environmentally significant species at risk, such as the Pacific oyster (Magallana gigas), blue mussel (Mytilus edulis) and European flat oysters (Ostrea edulis). To avoid these potentially detrimental impacts, an emergency response was triggered."
        },
        {
            "text": "Cefas were appointed by Defra to lead a Rapid Response Group, under the Contingency Plan for Marine Invasive Non-Native Species,*** and immediately arranged an opening meeting with the relevant organisations (Defra Marine, Defra NNS, Defra aquaculture, GBNNSS, FHI, NE). Information was gathered to create a briefing document for all involved.  This included consulting suitable experts regarding the identification of the egg cases, from photographs submitted, and collating a brief overview of the species.  Next step was to arrange a survey of the beach where the sample had been spotted, to check for additional evidence or samples."
        },
        {
            "text": "No further evidence was found on the beach and from the photographs of the original sample no definitive identification could be made.  The life cycle of both native oyster drills and non-native oyster drills known to be present on the French and Dutch coasts were considered.  Due to the small risk of the species arriving attached to stock imported for aquaculture or from an egg case being carried across the English Channel it was agreed that an awareness raising campaign would be circulated including an advice note. This would ensure relevant individuals and organisations knew about the species and how to report any possible sightings."
        },
        {
            "text": "This process took just a few weeks to complete, as a rapid response was deemed necessary in this case to ensure the species did not establish making it more difficult to eradicate, had its presence been confirmed."
        },
        {
            "text": "The presence of non-native species is a major threat to biodiversity and industries operating in locations where they establish.  If you see something that you have reason to believe is a non-native species, please photograph it and report it on the iRecord website so the threat can be assessed, and appropriate action taken at the earliest opportunity.  Remember, See it, Snap it, Report it! "
        },
        {
            "text": "Additional information on biosecurity measures that can be taken to limit the risk of introduction and spread of non-native species can be found at https://www.nonnativespecies.org/biosecurity/ ."
        },
        {
            "text": "References:"
        },
        {
            "text": "* An updated assessment of the direct costs of invasive non-native species to the United Kingdom | Biological Invasions (springer.com)"
        },
        {
            "text": "** Thematic Assessment Report on Invasive Alien Species and their Control | IPBES secretariat"
        },
        {
            "text": "*** Contingency plan for invasive non-native marine species » NNSS (nonnativespecies.org)"
        }
    ]
}