{
    "url": "https://defrafarming.blog.gov.uk/2024/05/20/the-smaller-abattoir-fund-increase-in-intervention-rate-and-grant-amount/",
    "title": "The Smaller Abattoir Fund: increase in intervention rate and grant amount",
    "authors": [
        "Owen Marlow"
    ],
    "categories": [
        "Farming and Countryside Programme"
    ],
    "pub_date": "2024-05-20T12:33:44+01:00",
    "content": [
        {
            "text": "In December, we shared details of a new capital grant to support smaller abattoirs in England, offered through the Smaller Abattoir Fund."
        },
        {
            "text": "To recognise the cash flow challenges that many smaller abattoirs face, we’re increasing this support. We’ve raised the intervention rate from 40% to 50% and we’ve increased the maximum grant amount from £60,000 to £75,000. "
        },
        {
            "text": "The minimum grant amount remains the same at £2,000. "
        },
        {
            "text": "In this post, I’ll give a recap of the fund and include a summary of the changes. Colleagues at the Rural Payments Agency (RPA) have already contacted eligible applicants with the official guidance and application forms. "
        },
        {
            "heading": 2,
            "text": "The Smaller Abattoir Fund"
        },
        {
            "text": "Smaller abattoirs are a vital part of rural economies. They offer a higher value route to market for native and rare breeds, particularly horned animals, which many large abattoirs are generally unable or unwilling to process."
        },
        {
            "text": "They also support higher standards of animal welfare by reducing journey times to slaughter. "
        },
        {
            "text": "For a range of reasons, we have seen a decline in the number of smaller abattoirs in recent years. Between 2018 and 2022, the number of smaller red meat abattoirs has declined by around 25% and smaller poultry abattoirs have declined by around 40%. "
        },
        {
            "text": "As mentioned, the maximum grant amount available through the fund has now increased from £60,000 to £75,000."
        },
        {
            "text": "The intervention rate has also increased from 40% to 50%."
        },
        {
            "text": "The items the grant can fund need to demonstrate that they impact an abattoir's ability to meet one or more of the Fund's four main objectives, notably to: "
        },
        {
            "text": "The fund will support the purchase of a diverse range of capital investments and equipment. A list of example items has been produced for the benefit of applicants. This includes items such as: "
        },
        {
            "text": "As each abattoir has different specialisms, requirements and challenges, we will consider applications for investments that are not on the list of example capital items. We will need evidence that the purchase will support one or more of the fund’s objectives. "
        },
        {
            "text": "The increased intervention rate of 50% means an abattoir applying to purchase an eligible item costing £10,000 would receive £5,000 in grant funding towards the item."
        },
        {
            "text": "We are aware that some eligible abattoirs may have hard-to-predict cash flows. To maximise their ability to access the fund, applicants will therefore be able to make up to 3 separate applications throughout the application window, requesting a total grant of £75,000."
        },
        {
            "text": "The window to apply opened on 13 December 2023 and will close on 30 September 2024. "
        },
        {
            "text": "If you have any questions about applications or the Smaller Abattoir Fund, email FTF@rpa.gov.uk or call 03000 200 301 and select the ‘Smaller Abattoir Fund’ option."
        }
    ]
}