{
    "url": "https://educationinspection.blog.gov.uk/2022/07/11/the-education-inspection-framework-eif-looking-ahead-to-september-2022/",
    "title": "The education inspection framework (EIF) – looking ahead to September 2022",
    "authors": [
        "Christopher Russell"
    ],
    "categories": [
        "curriculum",
        "education inspection framework",
        "further education and skills",
        "inspection",
        "schools"
    ],
    "pub_date": "2022-07-11T09:30:37+01:00",
    "content": [
        {
            "text": "Christopher Russell, our National Director, Education, discusses the recent changes to our EIF handbooks and moving beyond transitional arrangements."
        },
        {
            "text": "We are coming to the end of another academic year and looking ahead to September 2022."
        },
        {
            "text": "Following our return to inspection, we have been able to take stock of the impact of the COVID-19 pandemic with the sectors that we work with. As a result, we have reviewed and updated our education inspection framework (EIF) handbooks. This is part of our standard practice to ensure that our handbooks are up to date."
        },
        {
            "text": "COVID-19"
        },
        {
            "text": "We understand that COVID-19 continues to have an impact on early years settings, schools and colleges. We appreciate that this is likely to continue to affect how you make decisions for some time. We also know that you are now moving on from the emergency response to COVID-19 and getting back to the more usual ways of working. We are doing the same."
        },
        {
            "text": "We believe that now is the right time to move beyond the temporary measures that we placed in our handbooks as a response to the national disruption. To reflect this, we are integrating the stand-alone COVID-19 paragraphs into the main sections of our inspection handbooks."
        },
        {
            "text": "These changes demonstrate that we will continue to take account of the relevant issues that providers may be facing. For example, we have placed a clear expectation that conversations between leaders and the lead inspector will continue to include a discussion on the impact of COVID-19. This ensures that our inspections continue to be informed by the different contexts in which you work and the range of challenges that you may still face."
        },
        {
            "text": "Transitional arrangements"
        },
        {
            "text": "When we launched the EIF in September 2019, we understood that we had introduced some new ideas about how we would evaluate a curriculum, and that some leaders would want to change their approach as a result."
        },
        {
            "text": "We wanted to give you time to do this and so we put in place transitional arrangements. We acknowledged that planning a curriculum needed thought, so any school or college that was still in the process of updating its curriculum could still receive a good grade, provided that other aspects were good."
        },
        {
            "text": "We initially envisaged that these arrangements would last until September 2020, by which time we would have expected providers to have their curriculum thinking in place. Of course, when national restrictions were put in place in response to the pandemic, everyone had to reprioritise their time. Some of you had to put your curriculum plans on hold and many of you had to develop new plans and find new ways of delivering your curriculum."
        },
        {
            "text": "As we returned to full-time education from September 2020, many of you were still in the process of planning your curriculum. We therefore kept the transitional arrangements in place when we returned to full routine inspection in September 2021. This was to give you further time to make any additional changes that COVID-19 required."
        },
        {
            "text": "As we approach the start of another academic year, without national restrictions and modifications to our day-to-day work, now is the right time for us to move beyond the transitional arrangements. I am keen to stress that we are not introducing a ‘cliff edge’ for a judgement of good. We recognise that you are likely to always be revising elements of your curriculum. We will not suddenly expect you to meet every single criterion to remain good. Inspectors will continue to use the best-fit approach that is set out in the handbooks to reach a judgement of good."
        },
        {
            "text": "Changes to our grade descriptors"
        },
        {
            "text": "In terms of the quality of education judgement, an outcome of good reflects that leaders have an accurate understanding of the curriculum that they offer – its strengths and weaknesses – and that there is clear evidence that the approaches they are taking to address any issues or challenges are leading to tangible improvements. Inspectors will want to be reassured that leaders can transfer the successful work underway in one area of the curriculum to other, less-developed aspects."
        },
        {
            "text": "We do not expect curriculum to be perfect or a ‘finished article’. Indeed, the best curriculum thinking is always evolving to meet changing circumstances. Inspection supports this approach to continuous improvement. Inspectors will therefore be interested in the effectiveness of leaders’ actions and the steps being taken in subject areas that are less developed."
        },
        {
            "text": "Discussing curriculum with inspectors is a brilliant way to explore your thinking. One of the strengths of our EIF is the evidence that inspectors gather through conversations with you, which allows us to appreciate individual contexts and necessary adjustments."
        },
        {
            "text": "This move away from ‘transitional arrangements’ recognises that the changes you are making are no longer temporary, emergency measures, but are considered, longer-term approaches to returning children and young people to the curriculum that you always intended. To reflect this, we will introduce a new grade descriptor in the quality of education judgement to formally acknowledge the longer-term impact that this will have. The following is the wording in the school inspection handbook, but similar changes have been made in the non-association independent school handbook and the further education and skills handbook:"
        },
        {
            "text": "‘The curriculum may undergo necessary changes (for example, following a review by senior leaders or to take account of COVID-19) and certain aspects may be more developed than others. Where this is the case, these changes do not prevent all pupils having access to an appropriately broad and ambitious curriculum. Where adaptations to curriculum breadth are made for particular pupils, there is a clear rationale for why this is in those pupils’ interests, and, where appropriate, there is a clear plan for returning all pupils to studying the full curriculum.’"
        },
        {
            "text": "Structural changes"
        },
        {
            "text": "Finally, we have made some structural and layout changes to both the school inspection handbook and the non-association independent school handbook."
        },
        {
            "text": "Although these changes have left the handbooks looking a little different, most of the content is unchanged and our approach to inspection remains the same. For example, we have incorporated the annexes for specific settings into the main body of the handbooks, which makes them more user-friendly for you and our inspectors. We also want to be clearer about how we refer to different types of inspection. Section 5 inspections will now be referred to as ‘graded’ inspections and section 8 inspections of good and outstanding schools will be ‘ungraded’ inspections. Section 8 inspections include a range of different inspection types, and we are introducing this term to distinguish a particular type. The inspections themselves have not changed; the way that we refer to them simply supports a better understanding of the types of inspection that we carry out and why."
        },
        {
            "text": "Separately, we have made structural changes to the early years inspection handbook in response to sector feedback. We have created a new ‘Part 3: Applying the education inspection framework (EIF) in different contexts’, which includes guidance on how to apply the EIF in specific contexts and provisions such as childminders and out-of-school settings. Annex A, which was previously a stand-alone annex in the handbook, is included in this new ‘part’."
        },
        {
            "text": "There is no change to inspection policy. We have, however, taken the opportunity to consider some of the terminology we use in the handbook and revised this to provide greater clarity for both Ofsted inspectors and the sector."
        },
        {
            "text": "Thank you"
        },
        {
            "text": "Once again, I would like to recognise the huge efforts that you have made, and continue to make, during the pandemic. I know the past 2 years have been challenging, and that the changes made because of the pandemic were necessary at the time. Everyone did the best that they could in very difficult circumstances and, on behalf of Ofsted, I want to thank you all. I also want to reassure you that we recognise that some of these changes will continue to be relevant. I hope our updated handbooks reflect this."
        },
        {
            "text": "I know that many of you will now be busy preparing for the end of term. I hope you can take a moment to reflect on the achievements of the last year, and enjoy the much-deserved break over the summer when it comes."
        }
    ]
}