{
    "url": "https://ukhsa.blog.gov.uk/2022/07/11/working-towards-a-healthy-commonwealth-games/",
    "title": "Working towards a healthy Commonwealth Games",
    "authors": [
        "Carol Chatt"
    ],
    "categories": [
        "Health Protection"
    ],
    "pub_date": "2022-07-11T15:36:45+01:00",
    "content": [
        {
            "text": "This summer the West Midlands is hosting the Commonwealth Games."
        },
        {
            "text": "Preparing for and managing the Games is a massive undertaking involving a diverse range of agencies from across the UK and the Commonwealth."
        },
        {
            "text": "One of the most important tasks partners have is keeping the 6,600 competitors and their teams from 72 nations, around 40,000 volunteers, spectators (one million tickets have been sold) and the local community healthy during this huge event."
        },
        {
            "text": "At UKHSA we’re key to this, and it will be the first time our new agency has managed public health risks at an event of this scale, though through predecessor organisations we have long experience of dealing with “mass gatherings” such as the 2012 Olympics."
        },
        {
            "text": "UKHSA’s Field Service Epidemiology Team has a crucial role in detecting, preventing, and managing infectious disease outbreaks that could be linked to major events such as the Commonwealth Games."
        },
        {
            "text": "Our team consists of consultants, scientists and analysts who investigate any patterns and causes of disease and how they affect communities."
        },
        {
            "text": "As field epidemiologists, we carefully examine surveillance data from reports of infections and this acts as an early warning system for evidence of infectious diseases, such as COVID, norovirus or measles."
        },
        {
            "text": "If an early warning is identified, we then take action to prevent the further spread of infection to visitors and athletes at the Games or local West Midlands residents."
        },
        {
            "text": "We don’t do this work in isolation. Our team has been preparing for the Games for two years working with colleagues from across UKHSA and multi-agency partners to ensure we are equipped to deal with whatever challenges we may face."
        },
        {
            "text": "Key partners include NHS and UKHSA laboratories who are primed to give us results in a timely manner so we can monitor laboratory reports of infectious diseases."
        },
        {
            "text": "We also work with UKHSA’s Real-time Syndromic Surveillance team. Syndromic surveillance indicators give us important situational awareness. These include, for example, attendances at emergency departments with specific respiratory conditions or calls to NHS 111 reporting diarrhoea or vomiting."
        },
        {
            "text": "A benefit of this syndromic surveillance is that we don’t have to wait for formal laboratory diagnoses – symptoms presented by patients can give us an early warning that something is going on. This type of surveillance was used really effectively during the London 2012 Olympics and has now become routine for mass gatherings."
        },
        {
            "text": "We also work very closely and have good relationships with the Games’ organising committee and the key to all of our partnerships is ensuring we have access to good data and awareness of any health-related incidents in a timely manner so we can support the response."
        },
        {
            "text": "For instance, if athletes are sick during the Games they can report to polyclinics located in the athletes’ villages, or they may see their own team doctor and both of these options have a system of reporting that allows us to monitor the data we need."
        },
        {
            "text": "As well as providing surveillance we provide epidemiological support to any incidents and outbreaks. This is like detective work, describing the cases in terms of time, place and person to inform our risk assessment, any control measures needed and then monitoring the effect of these measures to ensure they are working."
        },
        {
            "text": "Planning for an event like this brings many challenges, including of course the ongoing COVID-19 pandemic where we’ve needed to anticipate the guidelines that will be in place to help everyone live safely with COVID at the time of the Games."
        },
        {
            "text": "In addition, the nature of a major event like this poses challenges for surveillance with Games venues being geographically dispersed across nine West Midlands local authorities and one London local authority (where the velodrome cycling events are held)."
        },
        {
            "text": "But all of this is rewarding work for a health protection professional, as it’s great to play our part in working to ensure the Games is a success."
        }
    ]
}