{
    "url": "https://insidedio.blog.gov.uk/2023/03/21/celebrating-the-2022-sanctuary-awards/",
    "title": "Celebrating the 2022 Sanctuary Awards",
    "authors": [
        "Richard Brooks"
    ],
    "categories": [
        "Conservation",
        "Defence Estate",
        "Sustainability"
    ],
    "pub_date": "2023-03-21T12:59:54+00:00",
    "content": [
        {
            "text": "Every year, the coveted Silver Otter Trophy is presented to the best conservation effort on the MOD estate [Crown Copyright / MOD 2023]Since 1991, the Sanctuary Awards have been recognising outstanding sustainability and conservation efforts across the MOD. The awards celebrate group and individual-led projects that are benefiting sustainable development and helping to conserve the environment, natural resources and heritage across Defence’s UK and overseas estate."
        },
        {
            "text": "The award categories reflect the MOD’s sustainability agenda and our commitment to achieving the government’s environmental and sustainability goals. The winners of each category are considered for the coveted Silver Otter Trophy, presented to the best conservation effort on the MOD estate, and the Sustainable Business Award for the best larger scale or commercial project. A brand-new category, introduced this year, is the Innovation Award for the project best exemplifying innovative behaviours."
        },
        {
            "heading": 2,
            "text": "A look at some of this year’s worthy winners"
        },
        {
            "text": "This year, as always, the entries were impressive and varied, from projects introducing resource saving measures to sustainable approaches to construction and procurement, as well as some remarkable achievements by individuals."
        },
        {
            "text": "The prestigious Sustainable Business Award was presented to the Queen Elizabeth Class Logistics Centre Project at HM Naval Base Portsmouth, which has seen the creation of a new logistics centre to support the Royal Navy’s Queen Elizabeth Class aircraft carriers."
        },
        {
            "text": "The Queen Elizabeth Class Logistics Centre at HMNB Portsmouth, ready for operations[Copyright: Iain Greenlees]Throughout the project, emphasis was placed on reducing the base’s carbon footprint. From the installation of an array of 678 solar panels to highly efficient thermal cladding and the use of battery-powered machines in the construction process, the project has exemplified the sustainable delivery of large-scale infrastructure to support our Armed Forces. A big well done to all involved!"
        },
        {
            "heading": 2,
            "text": "Presenting the Silver Otter Trophy"
        },
        {
            "text": "The award of the coveted Silver Otter Trophy is always a highlight of the ceremony, and it was a great moment to see it presented to Captain Nigel Williams this year."
        },
        {
            "text": "Since volunteering to become the Sustainability Lead for 29 Regiment Royal Logistic Corps at South Cerney Station in 2009, Nigel’s pioneering approach and unmatched commitment has seen the site become one of the most green-focused stations in Defence, achieving a 38.7% reduction in its CO2 emissions over 10 years."
        },
        {
            "text": "Captain Nigel Williams (standing, front row, second from left) and the Recycle Now campaign team[Crown Copyright / MOD 2023]Nigel retired from the Army in 2022, but his passion for protecting the natural world has led him to a role as a Climate Resilience Manager in DIO’s Technical Services team, and we’re delighted to have him on board. In this role, Nigel will continue to advise on climate impact risks and encourage sustainable innovation across the MOD."
        },
        {
            "heading": 2,
            "text": "Restoring heritage"
        },
        {
            "text": "I was delighted to see this year’s Heritage Award presented to the Tower refurbishment project at HM Naval Base, Gibraltar."
        },
        {
            "text": "The Tower was built in 1905 and originally served as the area HQ for the Royal Navy, before becoming the HQ of British Forces Gibraltar in 1989. Last undergoing refurbishment in that year, the Tower was in desperate need of upgrades, so in 2019 our DIO teams began working with Mitie on a plan to restore the historic building. Sustainability was at the core of the ensuing 18-month refurbishment project, which combined modern upgrades such as energy efficient lighting and rooftop solar panels with the careful restoration of the Tower’s historic features."
        },
        {
            "text": "The newly refurbished Tower at MOD Gibraltar [Crown copyright / MOD 2023]The project has really showcased the dedicated role our DIO teams play as stewards of the historic environment, and it’s extremely heartening to know that this historic building will see continued use on the MOD Gibraltar estate thanks to the work of all involved."
        },
        {
            "heading": 2,
            "text": "Supporting nature recovery"
        },
        {
            "text": "As well as the worthy winners, congratulations are in order for the impressive array of highly commended entries across all categories."
        },
        {
            "text": "One such example is the Sands of LIFE project at MOD Pendine in South Wales, highly commended for this year’s Environmental Enhancement award."
        },
        {
            "text": "To restore the site’s ecologically vital sand dune habitats following several years of decline, an extensive programme of scrub clearance and fencing was agreed between the Sands of LIFE project led by natural Resources Wales, QinetiQ, who operate the site on the MOD’s behalf, and our DIO ecology teams."
        },
        {
            "text": "The works have been carried out as part of the UK-wide MOD Site of Special Scientific Interest Condition Improvement Project, funded by the DIO Conservation Stewardship Fund, and have seen impressive results to date. A crowning achievement came last summer when, thanks to the efforts of the project team, the rare and elusive Fen Orchid was discovered growing at MOD Pendine for the first time in nearly 20 years!"
        },
        {
            "text": "The elusive Fen Orchid re-discovered at MOD Pendine [Copyright Richard Pryce]This year’s awards featured so many excellent projects that it’d be impossible to list every single one here! However, you can always catch up on the live-streamed awards ceremony, which is still available on YouTube. It’s a must-watch if you want to know more about the sustainability and conservation work going on across Defence."
        },
        {
            "text": "You can also read the latest issue of Sanctuary Magazine, which is published by DIO every year following the Sanctuary Awards, and features in-depth articles and case studies exploring the MOD’s sustainable development and conservation activities."
        },
        {
            "text": "If you’re interested in submitting a nomination for the 2023 Sanctuary Awards, please email the DIO Sanctuary team at dio-sanctuary@mod.gov.uk."
        }
    ]
}