{
    "url": "https://mojdigital.blog.gov.uk/2023/03/21/celebrating-super-women-women-in-tech/",
    "title": "Celebrating Super Women In Tech",
    "authors": [
        "Lindsay Hancock"
    ],
    "categories": [
        "a great place to work",
        "gender equality",
        "Women in Tech"
    ],
    "pub_date": "2023-03-21T10:01:44+01:00",
    "content": [
        {
            "text": "As a diverse place to work, we embrace teams that are inclusive and full of incredible women! Here are just some of the career journeys that may just inspire you or someone you know to come and work here at Justice Digital."
        },
        {
            "text": "Michelle Peachey - Network Services - Senior Operations Manager"
        },
        {
            "text": "I spent over 30 years as a Civil Servant and started my career as a Court Clerk. Working in an operational role, facing the public gave me my first experience of understanding the true impact on the business if the systems and process did not work. I then moved to the Lord Chancellors department and spent 7 years working for the Judge Advocate General's Office overseeing the Court Martial System."
        },
        {
            "text": "I made the decision to take up a Policy role and quickly realised I missed the direct engagement with stakeholders so I became the first female Exit Manager in technology! I progressed to the Passport Office, returning to the MoJ 3 years ago to work in Service Operations and now the new NVVS team."
        },
        {
            "text": "I was attracted to Justice Digital as I wanted to be part of a team that would make a difference for the business."
        },
        {
            "text": "Laura Carr - Network Services -  Operations Manager"
        },
        {
            "text": "I have over 15 years experience working in the technology industry. I started as an IT Technician, progressing to becoming an IT project manager, finally moving into a business & client development manager role. I have worked with various sectors including retail, distribution, education and government. Working across such a variety of different areas in the IT industry has given me a wide knowledge base I can use in all my current role."
        },
        {
            "text": "I was attracted to Justice Digital as I wanted to work for a department that was actively making a difference. I enjoy working with a very supportive and encouraging team where there is an open platform for ideas and solutions. I am currently learning the 'ins and outs' of the Prison network, all the elements of the systems and how the network ties them all together."
        },
        {
            "text": "Kyla ONeil  - Network Services - Business Analyst"
        },
        {
            "text": "I moved into tech after working with some fantastic starts ups in South Africa and seeing the positive impact of tech. This inspired me to change careers. I joined the Digital, Data and Technology (DDaT) scheme on the Civil Service Fast Stream where I started out as a product manager in Defra working on building their career pathways to support colleagues to upskill. Prior to that I worked outside tech: having studied History and Law – possibly one of the furthest things from tech you get – before moving into teaching and then project coordination in the international trade sector."
        },
        {
            "text": "The work matters. Having a justice system that works for all especially as we transition to more digital services so what we do is impactful and important. It is a very welcoming space with so many opportunities to develop yourself not only through formal training but also in the work that you can choose to take on – the scope for forging your path and making an impact is huge."
        }
    ]
}