{
    "url": "https://cddo.blog.gov.uk/2023/03/21/civil-service-data-challenge-finalists-labspace/",
    "title": "Civil Service Data Challenge finalists: LabSpace ",
    "authors": [
        "Central Digital and Data Office"
    ],
    "categories": [
        "Data",
        "DDaT",
        "DDaT events"
    ],
    "pub_date": "2023-03-21T09:30:20+00:00",
    "content": [
        {
            "text": "This week is the Civil Service Data Challenge final - here we meet the finalists."
        },
        {
            "heading": 4,
            "text": "Team\nLabSpace"
        },
        {
            "heading": 4,
            "text": "Meet the team "
        },
        {
            "text": "Robbie Packer, Head of VAT Reform at HM Treasury\nDan O’Donnell, Large Business Corporation Tax Specialist at HMRC\nZenaida Amin, Analyst at HMRC\nAnna Ardanaz-Badia, Economist at the Department for Education\nRobina Khan, Debt Management Specialist at HMRC\nAnthony Walker, Data Scientist and Air Quality Specialist at Defra"
        },
        {
            "heading": 4,
            "text": "The idea"
        },
        {
            "text": "All of our jobs regularly involve collating a solid evidence base to inform Ministers regarding the policy choices at their disposal; evidence-based decisions ensure that the public services we deliver are effective and represent good value for money."
        },
        {
            "text": "Whereas we rarely encounter problems in drawing from the economic theory to inform our thinking, or finding the hard data to back up our assertions, experimental evidence of the causal relationships that determine the success or failure of a policy is scarce; it’s clearly not possible to experiment with complex interventions such as the rate of tax, or the level of benefits, in the real world. Yet at the same time, trying to replicate these settings in the lab is cumbersome, time consuming, and expensive."
        },
        {
            "text": "LabSpace will provide a service that enables policy makers and researchers to work together to quickly conduct policy experiments online at a low cost. This will make it easier for Government to test policies before rolling them out, increasing the likelihood that we get it right the first time."
        },
        {
            "heading": 4,
            "text": "Main motivations for entering Data Challenge 2023"
        },
        {
            "text": "It sounds a bit nerdy, but we all feel quite strongly that policy should, as far as possible, be evidence based; I guess this is part of the public service ethos that attracted each of us to our respective jobs in Government. This way, getting involved in the Data Challenge has been a great opportunity to support an aspect of the government’s work that we really care about. Our idea is definitely out of the box – something really interesting to get involved in, with the potential to genuinely change how we generate the data that informs policy making; we really feel like we’re breaking new ground and it’s exciting!"
        },
        {
            "heading": 4,
            "text": "Submitting the entry"
        },
        {
            "text": "We work well together because we all bring very different perspectives to the endeavour – the more academically minded among us have been able to focus on ensuring our work is rigorous, those working in debt management and compliance have ensured we stay in track to deliver something genuinely useful, whilst those from a policy background have brought the blue sky thinking to the table."
        },
        {
            "heading": 4,
            "text": "The experience so far"
        },
        {
            "text": "It has been a challenge, but I guess we should have expected that – the clue’s in the name! We’ve all got very demanding day jobs, so carving out the time to put the hours in to refine our idea has been tough. On the other hand, it’s been very rewarding to work on a project with a lot of creative freedom, something we truly own, in an innovate area. "
        },
        {
            "text": "We were thrilled to make it through to the finals; not only because of all the work we had put in, but also, because our idea is so novel, it was genuinely affirming to learn that people out there share our passion and interest in pushing the boundaries of what we can achieve with policy experiments!"
        }
    ]
}