{
    "url": "https://cddo.blog.gov.uk/2023/03/21/civil-service-data-challenge-finalists-project-heyrick/",
    "title": "Civil Service Data Challenge finalists: Project Heyrick",
    "authors": [
        "Central Digital and Data Office"
    ],
    "categories": [
        "Data",
        "DDaT",
        "DDaT events"
    ],
    "pub_date": "2023-03-21T09:26:05+00:00",
    "content": [
        {
            "text": "This week is the Civil Service Data Challenge final - here we meet the finalists."
        },
        {
            "heading": 4,
            "text": "Team name\nProject Heyrick"
        },
        {
            "heading": 4,
            "text": "Meet the team"
        },
        {
            "text": "In the picture we have:\nThe idea lead, David Vinnicombe, HMRC, Tax Compliance Officer\nKerry Barley, HMPO, Business Architect\nJayashree Sadanand, Home Office, Lead QAT Delivery Owner\nOlusegun Oyedepo, Home Office, Presenting Officer\nAliyah Hussain, Cabinet Office, Higher Statistical Officer"
        },
        {
            "text": "Plus the other core team members:\nSumitra Varma, Medicines and Healthcare Products Regulation Agency, Head of Engineering, Digital & Technology Group\nChristopher Varrall Esq MBE, Home Office, Principal Service Designer\nKatherine Bishop, Cabinet Office, Principal Analyst- SOC\nWilliam Cardno, FCDO, Digital, Data and Technology Fast Streamer"
        },
        {
            "text": "Plus support from Ian Rimington, Alexander Gibb and Carl Hall from NTT Data and lots of wider involvement from stakeholders across Government."
        },
        {
            "heading": 4,
            "text": "The idea "
        },
        {
            "text": "Much like its 19th century namesake Elizabeth Heyrick, Project Heyrick aims to change how the UK detects modern slavery using a modern data-driven approach. By collecting public & private data from across government and from open source, and analysing it for indicators of modern slavery, Project Heyrick will provide proactive intervention targets so that enforcement departments, such as Policing, the Home Office or the National Crime Agency, can more effectively identify potential cases of modern slavery without the victim needing to present themselves. "
        },
        {
            "text": "As in many cases today victims of modern slavery often do not even realise that they are slaves.  Thousands of slaves go undetected every year, but Heyrick can help massively by finding the victims, identifying the perpetrators, and also helping the enforcement agencies optimise the use of resources and bring criminals to justice more efficiently."
        },
        {
            "heading": 4,
            "text": "Main motivations for entering Data Challenge 2023"
        },
        {
            "text": "At first I didn’t know what to submit, but when I started thinking about my role in HMRC I remembered how modern slavery is always on my mind when paying a surprise visit to a trader, so I spent some time coming up with a proposal, and now I’m preparing to pitch it to the judges at the final!"
        },
        {
            "heading": 4,
            "text": "Submitting the entry"
        },
        {
            "text": "We are really fortunate that everyone involved in our idea is a volunteer, they put their names forward for the challenge and are involved because they want to be. I met most of the team for the first time in October and saw immediately how committed and passionate they are about the cause, so much so that we were continually reining in our enthusiasm.  "
        },
        {
            "text": "As the idea evolved, we spotted that we were short in experience in a couple of areas and expanded the team in January with wonderful expertise joining the team. It’s challenging to coordinate work between team members in multiple departments who are juggling their main job with the Data Challenge, but that’s also why we work well, we understand each other’s challenges and step forward to share the work. Also, because we all come from different areas of government, we bring different perspectives & expertise to the table helping us create a rounded winning solution."
        },
        {
            "heading": 4,
            "text": "The experience so far"
        },
        {
            "text": "I (David) remember feeling over the moon when I learned we had made the semi-finals, and that same evening I was filled with dread when I pictured how I’d tackle what felt like a gargantuan task. I’ve had the opportunity to meet incredible people doing amazing work across the Civil Service, the chance to present the idea in front of the judges, and the pleasure of working alongside Civil Servants from an array of departments."
        },
        {
            "text": "It was a tremendous feeling to learn that my team has made it to the finals, and we’re incredibly excited and nervous to present our work to the judges one more time. Also, when I heard that one of the judges was happy to be our sponsor it gave me a further boost, to have that kind of backing really means something to the team and has helped us massively in gaining attention and support in areas which were new to me.  My manager, colleagues & friends are thrilled for me! I’m very grateful to have their support going into the final."
        }
    ]
}