{
    "url": "https://dwpdigital.blog.gov.uk/2023/03/21/civil-service-awards-win-for-the-digital-shared-channels-experience-team/",
    "title": "Civil Service Awards win for the Digital Shared Channels Experience team",
    "authors": [
        "DWP Digital"
    ],
    "categories": [
        "Cross Government",
        "Shared Channels Experience",
        "user experience"
    ],
    "pub_date": "2023-03-21T13:52:20+00:00",
    "content": [
        {
            "text": "The Digital Shared Channels Experience team collaborated with colleagues across DWP and other government organisations to deliver the Government’s Cost of Living Financial Checker to 5.7 million customers and claimants. This collaborative project won the One Civil Service award category at the Civil Service Awards. "
        },
        {
            "text": "Using design thinking for intelligent routing, the team supported rapid development of a new service to signpost customers to financial support available, based on their circumstances.  "
        },
        {
            "heading": 2,
            "text": "Improving efficiencies at scale "
        },
        {
            "text": "In the months since the support package was announced the team have helped users understand if they’re entitled to the payment, when it’s due, and how much they can expect. This function has been viewed over 20.2 million times.  "
        },
        {
            "text": "The team also launched the Cost-of-Living Payment Guide in the summer, achieving the most viewed page on GOV.UK and has a satisfaction rate of 90%. "
        },
        {
            "text": "More flexible ways of delivering the payment scheme were developed during roll out, such as forms to enable the communication of missed payments and report non-payments.  "
        },
        {
            "heading": 2,
            "text": "Collaboration across government "
        },
        {
            "text": "To support these initiatives, the notifications team worked with colleagues across DWP and other government departments to support the Cost-of-Living crisis. They developed an SMS response system to raise customers’ awareness of the potential support they could access, and when it would be available.  "
        },
        {
            "text": "In total, the team sent 21 million SMS messages to customers, reducing the burden on DWP telephone lines and giving people a much better user experience.   "
        },
        {
            "text": "Ready for a challenge? To find out about our latest career opportunities subscribe to our mailing list to get roles sent straight to your inbox. "
        }
    ]
}