{
    "url": "https://cddo.blog.gov.uk/2023/03/21/civil-service-data-challenge-finalists-child-maintenance-datasets-to-improve-compliance/",
    "title": "Civil Service Data Challenge finalists: Child Maintenance datasets to improve compliance",
    "authors": [
        "Central Digital and Data Office"
    ],
    "categories": [
        "Data",
        "DDaT community",
        "DDaT events"
    ],
    "pub_date": "2023-03-21T09:30:44+00:00",
    "content": [
        {
            "text": "This week is the Civil Service Data Challenge final - here we meet the finalists."
        },
        {
            "heading": 4,
            "text": "Team\nChild Maintenance: Connecting datasets across government to improve levels of compliance for child maintenance payments"
        },
        {
            "heading": 4,
            "text": "Meet the team"
        },
        {
            "text": "Alvin Dupre and Paul Wright, Child Maintenance, DWP\nKate Masri, Business Strategy, DWP\nJemma Bucknall, Criminal Investigator, Economic, Serious and Organised Crime Team, DWP\nJohn Bullen, HMRC Transformation, HMRC\nBukola Feyisetan, HMRC Transformation, HMRC"
        },
        {
            "text": "Plus of course, Chris and Alexis Riddler from NTT"
        },
        {
            "text": "This is our core team but please note we’ve also worked with a range of other people across DWP and HMRC to develop our proposal."
        },
        {
            "heading": 4,
            "text": "The idea"
        },
        {
            "text": "Our idea is to access and use HMRC data to ensure that ‘Paying Parents’ in the Child Maintenance system are paying the correct amount to ‘Receiving Parents’. "
        },
        {
            "text": "Specifically, accessing self-employed assessment earning data directly from HMRC, as and when Child Maintenance agents need that information. This will avoid parents who are self-employed having to wait up to six weeks to have ‘change of income’ requests processed. "
        },
        {
            "text": "Our idea will save the agent time – especially if we can automate the process – which allows them to focus on other, more complex cases. Through increasing accuracy, reducing fraud, and resolving changes more quickly, our system will be fairer and we hope to build greater trust with our customers. We have also identified further opportunities for DWP to better utilise HMRC data."
        },
        {
            "heading": 4,
            "text": "Main motivations for entering Data Challenge 2023"
        },
        {
            "text": "Our motivations have all varied. Alvin, an agent in Child Maintenance put forward the initial idea. Seeing and hearing about the impact the service has on the families who use it, he was keen to find ways to deliver the service better."
        },
        {
            "text": "For me (Kate) personally, I joined the Data Challenge for the opportunity to work with colleagues across the Civil Service on a project that went wider than my own organisation. Having moved from Policy to Business Strategy [creating the vision for how DWP transforms its services] last year, it also gave me the chance to be directly involved in a transformation project. Plus, I was also weirdly attracted to or intrigued by the Dragons Den style format!  "
        },
        {
            "heading": 4,
            "text": "Submitting the entry"
        },
        {
            "text": "I (Kate) heard about the Data Challenge at CS Live and put my name forward to work in one of the teams. It was Alvin who submitted some ideas for better utilising the data we already get from HMRC and also potentially gathering additional data. "
        },
        {
            "text": "Coming together as a brand new team we had to go through the forming and norming stages etc. We grew into a great team by sharing our skills and interests to maximise those. In-person sessions have really helped, as has pulling in wider expertise to support us. We work well together as we all bring different skills and perspectives. For example, John’s knowledge of both HMRC and DWP digital systems has been invaluable. We’re sometimes guilty of getting stuck in the weeds, but we coalesce around our aims to make things better for our colleagues and customers, as well as sharing our longer term transformational goals for how DWP and HMRC could work better together."
        },
        {
            "heading": 4,
            "text": "The experience so far"
        },
        {
            "text": "I’ve (Kate) enjoyed working on a new challenge with a new team. It’s sometimes been tough alongside other work pressures but we’ve stepped in and supported each other. We’ve been able to make changes to the processes our agents use and are now embedding that change. It’s really satisfying to have made a difference already – alongside our wider ambitions to better share data."
        },
        {
            "text": "We felt well-rehearsed for the semi finals but once the mics were clipped on the nerves really kicked in! We’re really excited to be in the final and have been telling all our colleagues. For Alvin and Paul in operational roles it empowered and enabled them to make a difference, to put forward solutions and make changes.  "
        }
    ]
}