{
    "url": "https://ruralpayments.blog.gov.uk/2023/03/21/countryside-stewardship-mid-tier-and-wildlife-offers-now-open-for-applications/",
    "title": "Countryside Stewardship Mid Tier and Wildlife Offers now open for applications",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Countryside Stewardship",
        "Farming Investment Fund",
        "Sustainable Farming Incentive"
    ],
    "pub_date": "2023-03-21T12:08:10+00:00",
    "content": [
        {
            "text": "The application window for Countryside Stewardship (CS) Mid Tier and Wildlife Offer agreements, to start from 1 January 2024, opened today.  "
        },
        {
            "text": "Earlier this year, Farming Minister Mark Spencer announced an average increase of 10% for CS revenue payment rates, so farmers and land managers are being paid more for their work. The scheme, which provides financial incentives for farmers, foresters and land managers to look after and improve the environment, is one of our most popular offers, with farmers and land managers currently enrolled in over 30,000 agreements across Mid Tier and Higher Tier.  "
        },
        {
            "text": "Wildlife Offers are part of Mid Tier and provide a simpler set of options to help improve wildlife in 4 different farming types.  "
        },
        {
            "heading": 3,
            "text": "Changes to Countryside Stewardship Mid Tier applications for 2023 "
        },
        {
            "text": "We’ve made some changes to improve how you make an application for a Mid Tier agreement which applies to all farmers with up to 250 parcels. "
        },
        {
            "text": "Last year we introduced the option to apply for Mid Tier online and around a third of CS Mid Tier applications for 2023 agreements were submitted via this route. We’ve listened to your feedback on the application system and have introduced a new, fully improved online service, which is closer to the application process used for the Sustainable Farming Incentive (SFI), that we know farmers found straightforward to use."
        },
        {
            "text": "The new application process has been simplified so it’s clearer and easier to make an application. As with last year’s online option, there is no need to request an application pack and it’s much safer because there is no risk of your application getting lost in the post. New for this year, the information you enter will mean eligibility is assessed upfront so you can be sure you are only applying for eligible areas. "
        },
        {
            "text": "We expect to be able to issue agreements much sooner than in previous years, and if your application is successful, we will make you an agreement offer online, via the Rural Payments Portal. You’ll receive a notification that you have been offered an agreement and will be able to view the offer and all Agreement Documentation within the Mid Tier Application section of Rural Payments. You will be able to review and accept the offer online and, pending any outstanding activity, the Agreement will start on 1 January 2024. "
        },
        {
            "text": "As we have improved the Mid Tier online process to make it quicker and easier, we won’t be offering Mirror agreements to Mid Tier customers this year. If you have a Mid Tier agreement that’s expiring, you can apply online for a new agreement. We’ll be writing to affected customers soon to explain this.    "
        },
        {
            "text": "To make the process as smooth as possible, some consenting requirements have changed for this year;  Site of Special Scientific Interest (SSSI), Farm and Land Management Advice (FaLMA), Catchment Sensitive Farming (CSF) and Inheritance Tax Exemption (ITE). When making your online application you’ll be able to make a self-declaration where consent or permission is needed. We won’t need to confirm this before offering your agreement and instead will check to make sure this is in place before the agreement start date.  "
        },
        {
            "text": "It’s still important you obtain the relevant consents as soon as possible as your agreement won’t be able to start without them, but the new process gives us more flexibility in getting your agreement out to you ahead of the start date. HEFER requirements have not changed. "
        },
        {
            "text": "Some options previously available in CS Higher Tier are now available in Mid Tier, for applications made this year. Farmers will be able to apply for options for the creation of successional areas and scrub, very low nitrogen inputs to groundwaters, and flood mitigation on arable reversion to grassland and on permanent grassland. "
        },
        {
            "text": "Applications can be made on Rural Payments."
        },
        {
            "text": "Guidance on how to apply is available on GOV.UK, with a video also available."
        },
        {
            "text": "Before starting your application, please make sure your land and personal details are up to date and that you have all the information you need. Your land information must be current and complete before you begin the CS Mid Tier application process, so if you have any land updates, changes or corrections that need to be made then these must be actioned first by submitting an RLE1 form as soon as possible. "
        },
        {
            "text": "For those who are unable to access Rural Payments to apply online, support will be provided from 17 April and we will share information on how to access this nearer the time. "
        },
        {
            "text": "The closing date for CS Mid Tier applications is 18 August 2023. "
        },
        {
            "heading": 3,
            "text": "Other Funding Opportunities "
        },
        {
            "text": "There’s still time to apply for a CS Higher Tier agreement for 2024. We'll be accepting applications until 28 April 2023.  "
        },
        {
            "text": "Applications for capital grants are open all year round, and you can read about enhancements for 2023, and capital payment rate changes in our Capital Grants 2023 blog post."
        },
        {
            "heading": 4,
            "text": "Sustainable Farming Incentive  "
        },
        {
            "text": "If you are also an existing Basic Payment Scheme (BPS) recipient, you may wish to consider applying to the Sustainable Farming Incentive (SFI), which provides quarterly payments to help farmers manage land in a way that improves food production and is more environmentally sustainable.  "
        },
        {
            "text": "The SFI has been made as straightforward as possible to apply for online, with farmers giving positive feedback over the simplicity and speed of the application process. The 2023 offer has been made more flexible and accessible to enable farmers to get started in the scheme and start to deliver the outcomes for their business and the environment. These improvements are based on learnings from extensive pilots and feedback to make it simpler, clearer and more workable for farmers. "
        },
        {
            "text": "Six new SFI standards are being introduced for 2023, and SFI is compatible with other schemes such as CS so long as we are not paying for the same action twice. More information on how SFI interacts with other schemes is available on gov.uk. You can also read about eligibility, payment rates, standards and the application process on the Sustainable Farming Incentive guidance page on GOV.UK"
        },
        {
            "heading": 4,
            "text": "Grants "
        },
        {
            "text": "In February, Minister Spencer announced over £168 million in grants will be available to farmers this year, in a speech he gave at the National Farmers’ Union Conference. Applications for the Productivity and Slurry theme of the Farming Equipment and Technology Fund (FETF) are open now until 4 April, with the Animal Health and Welfare grants application portal opening shortly this month, for livestock keepers in England. We are also in progress to launch our second round of Water Management grant next month.  "
        },
        {
            "text": "To plan ahead, we have published a blog with the information of all grants that will be available this year. "
        },
        {
            "text": "For details of all our current funding opportunities in one place, see the Funding for farmers and land managers page on GOV.UK."
        }
    ]
}