{
    "url": "https://insolvencyservice.blog.gov.uk/2023/03/21/dealing-with-debt-options-for-paying-off-your-debts/",
    "title": "Dealing with debt: options for paying off your debts",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Bankruptcy",
        "Breathing Space",
        "Debt management",
        "Debt Relief Order",
        "Debt solutions"
    ],
    "pub_date": "2023-03-21T16:40:16+00:00",
    "content": [
        {
            "text": "The government has provided funding for free money guidance to support you if you are experiencing financial worries."
        },
        {
            "text": "It’s important to know there are various options available, and you can access free advice through MoneyHelper: Dealing with debt."
        },
        {
            "text": "Here we provide an overview of the different solutions available for managing financial difficulties here."
        },
        {
            "heading": 3,
            "text": "What options are available?"
        },
        {
            "text": "There are several options if you are unable to pay back the money you owe – these can be formal or informal solutions. You can also use the MoneyHelper tool to find free expert advice."
        },
        {
            "text": "Before you make a decision about what to do, you should seek free expert advice from a money adviser. This can be from either an organisation like Citizens Advice or through the MoneyHelper: Debt Advice Locator | Syndication | MoneyHelper."
        },
        {
            "text": "Your adviser will look at your circumstances - for example the types of creditors you have (who do you owe money to), and the terms of the agreements you have signed."
        },
        {
            "text": "That will help them to advise you on the best way forward, which may include a “formal” or an informal” solution depending on your situation."
        },
        {
            "heading": 3,
            "text": "Formal solutions"
        },
        {
            "text": "Formal insolvency solutions are legal processes, and they include:"
        },
        {
            "text": "If you are in one of these processes, the people you owe money to (your creditors) can’t take action against you to get you to repay them and you won’t have to repay all the money you owe, although this will depend on your circumstances. Any new debt you incur after you have entered one of these processes won’t usually be included and you will need to deal with those new creditors separately."
        },
        {
            "heading": 3,
            "text": "Informal solutions"
        },
        {
            "text": "Informal solutions are options for people who are able to repay their creditors in full and allow them to come to an agreement with their creditors to make repayments over a period of time."
        },
        {
            "text": "Because these agreements are informal - not legally-binding - you can usually more easily change the terms of the agreement if your circumstances change. However, because they are not legally-binding this does mean that your creditors can change their minds and they can still take action to recover the money you owe."
        },
        {
            "text": "Informal solutions include:"
        },
        {
            "heading": 3,
            "text": "Breathing Space"
        },
        {
            "text": "Breathing Space is a government scheme for people living in England and Wales. The scheme gives you temporary protection from your creditors while you get advice and plan for how you’ll repay any debts."
        },
        {
            "text": "Breathing Space gives you protection from your creditors contacting you or chasing you for the money you owe for up to 60 days."
        },
        {
            "text": "If you are getting mental health crisis treatment, Breathing Space allows you a longer period of protection from your creditors. In this case the scheme will last for the length of your treatment plus 30 days."
        },
        {
            "text": "You need to speak to a money adviser if you want to apply for a Breathing Space scheme. If the adviser thinks Breathing Space is right for you, they will make an application for you."
        },
        {
            "text": "You cannot apply for Breathing Space if you are in a Debt Relief Order, an Individual Voluntary Arrangement (IVA) or you are an undischarged bankrupt"
        },
        {
            "text": "Also, you cannot apply for Breathing Space if you have already accessed the scheme in the last 12 months unless it was for a mental health crisis."
        },
        {
            "text": "More information on the Breathing Space scheme is available here: What is Breathing Space and how can it help me | MoneyHelper."
        },
        {
            "heading": 3,
            "text": "Debt Relief Order"
        },
        {
            "text": "A Debt Relief Order (DRO) usually lasts for 12 months. After this time the amounts you owe to the creditors who are included in the DRO are written off, and you do not have to pay them."
        },
        {
            "text": "You need to apply for a DRO through a specially approved debt adviser (an intermediary), and you can obtain one if the following apply to you:"
        },
        {
            "text": "The fee for applying for a DRO is £90 which must be paid when your application is made, although you can pay in instalments. You will not get a refund if your application for a DRO is refused."
        },
        {
            "text": "If your DRO is accepted your details will be added to the Individual Insolvency Register and will stay there until 3 months after your DRO ends."
        },
        {
            "text": "There will also be a number of things that you will be unable to do while you are in a DRO, details can be found here: Getting a Debt Relief Order - GOV.UK (www.gov.uk)"
        },
        {
            "text": "After 12 months, these DRO restrictions will come to an end. The restrictions can last for more than 12 months if you are found to have acted carelessly or dishonestly."
        },
        {
            "text": "A DRO will usually appear on your credit file for 6 years."
        },
        {
            "text": "More information on what you need to know about DROs can be found here: Getting a Debt Relief Order - GOV.UK (www.gov.uk)."
        },
        {
            "heading": 3,
            "text": "Individual Voluntary Arrangement (IVA)"
        },
        {
            "text": "An IVA is a legally-binding agreement with your creditors – the people or organisations to whom you owe money – to pay all or part of your debts. If an IVA seems to be a good option for you, your debt adviser will be able to help you get in touch with an Insolvency Practitioner to put one in place."
        },
        {
            "text": "IVAs are available for people living in England and Wales. If you live in Scotland, you could get a Protected Trust Deed instead. For more information, please visit: Trust deed explained | Accountant in Bankruptcy (aib.gov.uk)."
        },
        {
            "text": "IVAs usually last for 5 years, during which you will pay a monthly amount to an Insolvency Practitioner who will pass this onto your creditors. The Insolvency Practitioner will keep some of the money you pay for their fees for setting up and managing the IVA for you. This will form part of your agreement with your creditors."
        },
        {
            "text": "Your IVA will be added to the Individual Insolvency Register and will stay there until 3 months after your IVA is completed."
        },
        {
            "text": "An IVA will appear on your credit file for 6 years after it has ended."
        },
        {
            "text": "It is important to know that if you do not keep up with your agreed IVA payments your IVA may be ended, and you will still owe money to your creditors which you will have to find a different way to repay."
        },
        {
            "text": "More information on what you need to know about IVAs can be found: What you need to know about Individual Voluntary Arrangements (IVAs) - Insolvency Service (blog.gov.uk)."
        },
        {
            "heading": 3,
            "text": "Bankruptcy "
        },
        {
            "text": "The bankruptcy process makes sure your assets are shared among those you owe money to (creditors) and lets you make a fresh start free from debt (with some restrictions for a period of time)."
        },
        {
            "text": "To obtain a bankruptcy order, you can make an online application to the Insolvency Service. Your application will be considered by someone called an adjudicator who will decide whether you should be made bankrupt."
        },
        {
            "text": "The cost of the application is £680. You can pay this fee in instalments; however, you need to have paid the whole amount before you can complete your application. You may be able to apply for a grant or get help from a charity if you are struggling to afford the fee."
        },
        {
            "text": "If the adjudicator makes you bankrupt your assets (the things that you own) can be used to pay your debts. You must hand over your assets to the person who is managing your bankruptcy, known as your trustee. This can be the Official Receiver, who works for the Insolvency Service, or an Insolvency Practitioner."
        },
        {
            "text": "You can usually keep items needed for your job, such as tools or a car, household items such as clothing and furniture and any money you’ve paid into a pension."
        },
        {
            "text": "Your bank accounts may be frozen, but your trustee may release any money you need urgently, for example to buy food, and your partner’s share of any money in a joint account. It is up to your bank to decide whether to let you continue to use your accounts."
        },
        {
            "text": "If you own a house, it might be sold depending on the amount of your equity; that is the difference between the value of your home, and the amount you owe on your mortgage and any other debts secured against the house."
        },
        {
            "text": "You may be able to remain in your home if:"
        },
        {
            "text": "You may be asked to make monthly payments from any spare income you have (any money you have left over each month after paying your essential outgoings), for a period of up to 3 years. This is known as an Income Payments Agreement. Your trustee will set up the agreement. If you are not able to agree on the amount you should pay, your trustee can ask the Court to order you to make payments. This is known as an Income Payments Order."
        },
        {
            "text": "There will also be a number of things that you will be unable to do while you are bankrupt (known as bankruptcy restrictions, details of which can be found here: Applying to become bankrupt: Restrictions - GOV.UK (www.gov.uk)."
        },
        {
            "text": "Bankruptcy usually lasts for 12 months and the restrictions last until your bankruptcy ends. The restrictions can last for more than 12 months if you do not do what you are asked by your trustee or if you are found to have acted carelessly or dishonestly."
        },
        {
            "text": "More information on what you need to know about bankruptcy can be found here: Applying to become bankrupt: Overview - GOV.UK (www.gov.uk)."
        },
        {
            "heading": 3,
            "text": "Who can help me choose the right option?"
        },
        {
            "text": "The first step is to talk to a trained and trusted money adviser about your financial situation."
        },
        {
            "text": "If you are in England or Wales you can find out where to contact a reputable money adviser here:  Debt Advice Locator | Syndication | MoneyHelper."
        },
        {
            "text": "If you are in Scotland, there are different options available: Deal with Debt | Accountant in Bankruptcy (aib.gov.uk)."
        }
    ]
}