{
    "url": "https://companieshouse.blog.gov.uk/2023/03/21/my-journey-with-equality-diversity-and-inclusion-at-companies-house/",
    "title": "My journey with equality, diversity and inclusion at Companies House",
    "authors": [
        "Jamuna Sivapalan - Operational Case Manager, late filing penalties"
    ],
    "categories": [
        "People and culture",
        "Personal blog posts",
        "Working at Companies House"
    ],
    "pub_date": "2023-03-21T12:30:53+00:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "Thirty-nine years ago, I arrived in Wales as a newlywed bride having migrated from Singapore. As you can imagine, it’s never easy for a migrant to adapt quickly, especially in those days. Mobile phones were non-existent, and the internet was a vision yet to be realised. I relied on letters to keep in touch with my family and, later, the luxury of prepaid international call cards to speak to my parents weekly."
        },
        {
            "text": "I kept a positive outlook and was determined to make new friends and establish myself in my new home country.  Although my mother tongue is Tamil, English was my first language so there were no language barriers in getting to know people. However, there were other challenges I faced – the new culture, way of life and getting used to the weather!"
        },
        {
            "heading": 2,
            "text": "Joining Companies House"
        },
        {
            "text": "My journey with Companies House began in 1986. When I started, it was hard not to notice that at that time there was only a handful of staff from an ethnic background."
        },
        {
            "text": "I quickly gained new friends who were friendly and welcoming, though I still recall an upsetting experience during my first week. One member of staff made a direct comment to me saying that I was taking jobs belonging to British people. I let it go and did not challenge them because, in the 1980s, such comments were tolerated. Thankfully, such comments and displays of overt racism are unthinkable in the present-day organisation. Society has changed."
        },
        {
            "text": "Over time, I witnessed a shift in people’s attitudes and behaviour towards people of other races, religious backgrounds, sexual orientations and other differences. There was a new wave of awareness, a willingness to understand, learn and accept our differences but to remain inclusive as a society. Flights became more affordable allowing people to travel more freely and widely, and there were more television documentaries on travel, introducing us to new sights and cultures without needing to leave our sofas."
        },
        {
            "text": "At Companies House, I've also witnessed a gradual mindset shift, culture change, a string of conversations, and concerted efforts to be more inclusive. Few people can talk about what equality, diversity and inclusion (EDI) at Companies House felt like 3 decades ago. My perspective, as someone from a different ethnic background, is even rarer."
        },
        {
            "heading": 2,
            "text": "The start of culture change"
        },
        {
            "text": "One of the earliest attempts to bring EDI to the discussion table was the establishment of an Equal Opportunities Forum in 1999. I was an active member, wanting to be part of the team looking to change the organisation’s culture and make it a better workplace for all. The group focused on how Companies House could develop as an equal opportunities employer, looking to introduce new strategies and create opportunities. We worked closely with the then Race Equality Council, monitoring progress at Companies House."
        },
        {
            "text": "Over time, there has been an increased appetite among colleagues to learn about other cultures and perspectives. People began to take the initiative within our supportive culture to create more and more networks and support groups – today there are over 20. Other activities such as volunteering opportunities in the community, or the Companies House choir, have also provided more social-based activities for people to come together. Being a member of these networks allows us to create a safe and welcoming space in which we can learn from each other’s experiences. Importantly, it’s through these networks that we can form allies, which are essential for improving EDI."
        },
        {
            "text": "Companies House has become a true driver for change, empowering staff members to champion many worthwhile causes and tackle systemic inequalities in numerous ways, all alongside our day-to-day work. Thanks to the dedication of such team members, these efforts have fostered an environment which encourages colleagues to have conversations on a range of issues and, crucially, provide meaningful feedback to our Executive Board."
        },
        {
            "text": "I'm proud of the journey Companies House has taken as an organisation, in celebrating and embracing diversity in all its forms and encouraging colleagues to bring their whole selves to work.  The people-led networks have given us an insight into the challenges the underrepresented and misrepresented continually face. It's through shared stories and open discussions that we’ve begun to truly understand and appreciate our different journeys and perspectives."
        },
        {
            "heading": 2,
            "text": "The journey isn't over"
        },
        {
            "text": "Although it's getting better, racism hasn’t completely been eradicated in the world. It's simply more covert and instead can take the form of microaggressions."
        },
        {
            "text": "We in Companies House must carry on the good work and continue to engage with everyone in advocating for the rights and civil liberties of all people regardless of background, characteristics or personal circumstances. This includes adapting policies through constant monitoring and evaluation."
        },
        {
            "text": "We must remember that efforts to encourage transformation and culture change should not be just lip service; they need to be visible inside and outside of Companies House."
        },
        {
            "text": "I'd like to see a world where diversity and inclusivity are the norm, where discrimination is non-existent, where all voices are heard and change is visible. I look forward to seeing how our journey continues."
        }
    ]
}