{
    "url": "https://socialworkwithadults.blog.gov.uk/2023/03/21/national-social-work-week-and-a-worldwide-day-of-recognition/",
    "title": "National Social Work Week and a worldwide day of recognition",
    "authors": [
        "Lyn Romeo"
    ],
    "categories": [
        "Events",
        "Our profession"
    ],
    "pub_date": "2023-03-21T08:54:04+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Our mettle has been proven"
        },
        {
            "text": "The most important week in the social work calendar has arrived. National Social Work Week, incorporating World Social Work Day, gives us an extended opportunity to reflect on recent history, assess the current state of our practice and ask the question ‘What next for modern, progressive, person-centred social work?’"
        },
        {
            "text": "I have to say, I feel more positive and optimistic about our wonderful profession than ever. The last three years of lockdowns, illegal wars and economic or natural born crises (at home and abroad), have ‘stress tested’ our skills and experience as never before. If we are not needed at times of intense personal challenge then when are we?"
        },
        {
            "text": "I’m glad to say we have proved our worth, using our practice, empathy and community outreach to support many more people through the darkest of days and into the light."
        },
        {
            "text": "The privations and technological workarounds of successive lockdowns have also demonstrated our innate capacity to adapt, innovate and embrace the new. While you can’t really improve on face to face interactions, we nonetheless maintained positive online connections with those we support and with our peers and professional counterparts in the wider health and care system."
        },
        {
            "heading": 2,
            "text": "Digital practice"
        },
        {
            "text": "That’s why I’m delighted to be participating in The Digital Social Worker this week, a webinar hosted by NHS colleagues working on the digital revolution of social care – including social work practice."
        },
        {
            "text": "Whilst some may unfairly assume we are tech-averse, as social workers, we actually use technology every day. The debate we must now have is this: to what extent can we use it to enhance and expand our approach to supporting individuals, families and communities? The webinar will explore how technology improves the lives of those drawing on care and support and how we might similarly augment our person-centred approach."
        },
        {
            "text": "If you haven’t already registered your place, I urge you to do so now. You’ll hear from practicing social workers, already using technology in innovative ways, sharing lessons learned and discussing our profession’s evolving relationship with digital services."
        },
        {
            "text": "I will also be tuning in to the session on hospital social work, which I hope will be of interest to many others too. Social work in hospital settings has contributed so much over the history of the profession and continues to play an important role in shaping future health and social care services."
        },
        {
            "heading": 2,
            "text": "Discuss, debate and celebrate"
        },
        {
            "text": "Of course, National Social Work Week has a much wider brief than our adoption of technology or our presence in clinical settings. Led by Social Work England, our official regulator, the week is filled with seminars and other events focusing on a vast range of hot topics."
        },
        {
            "text": "From tailored support for ethnic communities, to embracing sexual and social diversity, to eating disorders and the skill sets required to support people living with brain injuries, there is so much to explore, discuss and debate - I cannot wait."
        },
        {
            "text": "This is a unique opportunity to hear from experts in their field, voices of lived experience and academics working at the frontiers of modern social work practice. For existing social workers, I hope the week brings them further validation in the amazing work they do. For those new to the profession, or in training, I believe it will inspire, motivate and expand their creative horizons."
        },
        {
            "text": "This may be one week in the spotlight, but the work we do affects positive change for a lifetime."
        },
        {
            "text": "That is an enormous privilege and one which I believe these five days can only strengthen in our minds. I hope you can all find time to take part and discover, once again, why social work is one of the best, most rewarding jobs in the world."
        }
    ]
}