{
    "url": "https://gds.blog.gov.uk/2023/03/21/notifys-product-strategy-and-upcoming-features/",
    "title": "Notify’s product strategy and upcoming features",
    "authors": [
        "Irina Pencheva, Lead Product Manager - GOV.UK Notify"
    ],
    "categories": [
        "GOV.UK Notify"
    ],
    "pub_date": "2023-03-21T15:02:38+00:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "We want GOV.UK Notify to be the public sector’s first choice for sending messages. Common components like Notify make it easier for government to deliver better digital services."
        },
        {
            "text": "Here’s how we plan to deliver our vision."
        },
        {
            "heading": 2,
            "text": "Approaching product growth strategically"
        },
        {
            "text": "In early 2020 the world changed dramatically with the onset of the COVID-19 global pandemic. The pandemic also transformed GOV.UK Notify’s product growth. "
        },
        {
            "text": "Setting up a service on Notify is quick and easy, with no need for procurement or funding. Because of this, many public sector services used Notify to support their rapid response to the pandemic. Nearly 2,000 services started using our product in 2020. Notify sent all the COVID test results and vaccination reminders, and we saw our transaction volumes increasing by up to ten times."
        },
        {
            "text": "Whilst this growth was great for our product and for public outcomes, it created a lot of reactive work and support. Our team was under a lot of pressure to keep Notify safe, reliable and performing.  "
        },
        {
            "text": "Since February 2021, growth has normalised and our annual rate of growth is around 30%. So that we can continue to offer a great product for the best value for money, we need to be more targeted and considered in our work."
        },
        {
            "text": "In the last year we’ve updated our product strategy, which sets the direction for Notify’s growth. The strategy is helping us to prioritise and support choices about our focus. "
        },
        {
            "text": "Our product strategy has three broad goals:"
        },
        {
            "heading": 3,
            "text": "Goal 1: Scaling our operations to match our growth"
        },
        {
            "text": "When we first started this work, our operations weren’t scaled effectively to support the growth from the past few years. For example, we had to support users to complete simple manual tasks. This distracted us from being able to focus on the truly value-adding product work. "
        },
        {
            "text": "To achieve this goal we will: "
        },
        {
            "text": "We’ve already completed a lot of this work and are starting to see a reduction in support tickets."
        },
        {
            "heading": 3,
            "text": "Goal 2: Maintaining a great service and improving our features to retain existing users"
        },
        {
            "text": "From engagement with our users and research such as our annual satisfaction survey, we know that overall our users are happy with our product. We are also aware of some improvements that we need to make to our features."
        },
        {
            "text": "To achieve this goal we will:"
        },
        {
            "text": "Work on this mission is also underway and we hope to be able to share more about some of the exciting improvements to our notifications soon."
        },
        {
            "heading": 3,
            "text": "Goal 3: Growing our product proposition to attract new users"
        },
        {
            "text": "Whilst we’ll continue to support our steady organic growth, we also want to extend Notify’s reach to services whose needs Notify does not currently meet. In particular - and in line with GDS’s wider strategy - we want to meet the needs of high-volume central government teams and those users with low or no access to Digital, Data and Technology (DDaT) capabilities. "
        },
        {
            "text": "As part of this mission we might do mini-discoveries and explorations into new functionality like integrations with other channels, more complex two-way communication, as well as integrations with other GDS products, such as GOV.UK Forms."
        },
        {
            "text": "We may find there is little or limited value in some of these improvements. If so, we will stop and focus on something else."
        },
        {
            "heading": 2,
            "text": "Get involved"
        },
        {
            "heading": 2,
            "text": "Annex"
        },
        {
            "text": "This table shows the growth in number of services and organisations on Notify since 2016:"
        }
    ]
}