{
    "url": "https://educationhub.blog.gov.uk/2023/03/social-work-week-how-to-become-a-child-and-family-social-worker/",
    "title": "Social Work Week: How to become a child and family social worker",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Social work"
    ],
    "pub_date": "2023-03-21T17:42:15+00:00",
    "content": [
        {
            "text": "Child and family social workers do vital work, helping to protect vulnerable children and change their lives for the better."
        },
        {
            "text": "Now is a great time to consider a career in social work. Over the next two years we will continue to invest more than £50 million every year on recruiting, training, and developing child and family social workers."
        },
        {
            "text": "There are several routes to becoming a social worker. As part of Social Work Week, we explore how you can get into a truly rewarding career that has a positive impact on the lives of children and young people."
        },
        {
            "heading": 3,
            "text": "What does a social worker do?"
        },
        {
            "text": "There are lots of different types of social workers, including those who are trained specifically to support children and families experiencing serious difficulties."
        },
        {
            "text": "Child and family social workers help to establish safe and stable environments for children. They assess risk, protect children, provide support to parents and establish relationships with all family members."
        },
        {
            "text": "Child and family social workers play a key role in improving the lives of families in need. It’s a fantastic career for people who want to make a real difference to people’s lives."
        },
        {
            "heading": 3,
            "text": "What qualifications do you need to become a social worker?"
        },
        {
            "text": "There are many ways to become a child and family social worker. One pathway is through a university course and a degree in social work. However, you don’t need to go to university to become a social worker."
        },
        {
            "text": "An alternative route is through an apprenticeship, where you can start working and earn while you qualify as a social worker. You need four or five GCSEs at grades 9 to 4 (A* to C) and A levels, or equivalent, to do a Social Worker Level 6 Degree Apprenticeship. It takes around three years to complete."
        },
        {
            "text": "If you have a degree in a subject other than social work, you can apply to one of our fast-track programmes. These are intensive work-based training programmes where you get your qualification while on the job. Frontline and Step Up to Social Work both offer training programmes for child and family social work."
        },
        {
            "text": "Frontline is an independent training programme – you can find out more about it here. Meanwhile, Step Up to Social Work is funded by the Department for Education."
        },
        {
            "heading": 3,
            "text": "What is Step Up to Social Work?"
        },
        {
            "text": "Step Up to Social Work is our intensive, 14-month, full-time programme. If you want to become a child and family social worker, have a degree but not in social work, you can train through this route."
        },
        {
            "text": "To apply to the programme, you’ll need to have:"
        },
        {
            "text": "Step Up to Social Work is fully funded, meaning there’s no tuition fees to pay, and trainees receive a bursary of £19,833 to train. The fast-track course means students qualify after 14 months and will be able to register with Social Work England."
        },
        {
            "text": "The course is ideal for those who prefer to learn on the job. With 170 days placement, students gain real social work experience, knowledge and skills in combination with academic study."
        },
        {
            "text": "Applications are open until Monday 3 April to start the programme in January 2024. Apply now at this link."
        },
        {
            "heading": 3,
            "text": "How much do social workers earn?"
        },
        {
            "text": "Average salaries start at £27,000 a year for a newly qualified social worker and can rise to above £40,000. Find out more about the details of the role on the National Careers Service website."
        },
        {
            "text": "To support social workers early in their career, we’re also introducing a new framework which will give them the best start in the job."
        },
        {
            "text": "Social workers can also access fully funded training programmes throughout their career. Explore these at this new tool for social workers looking to develop their careers."
        }
    ]
}