{
    "url": "https://vmd.blog.gov.uk/2023/03/21/supplying-veterinary-medicines-at-trade-shows-and-exhibitions/",
    "title": "Supplying veterinary medicines at trade shows and exhibitions",
    "authors": [
        "Lee Grist"
    ],
    "categories": [
        "Enforcement",
        "Inspections"
    ],
    "pub_date": "2023-03-21T13:12:05+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Visiting trade shows and events"
        },
        {
            "text": "As Head of the Distribution and Supply Chain at the VMD, I know that veterinary medicines, or products which purport to be veterinary medicines, are advertised and /or offered for sale at trade shows. This is fine as long as the exhibitors selling or advertising these products comply with the requirements of the Veterinary Medicines Regulations (VMR)."
        },
        {
            "text": "As a team, we often go along to trade shows and events to provide advice and information about our work. As you might expect, we see a wide variety of products being advertised or for sale, and for the most part everything is in order and in compliance with the regulations, but we do sometimes come across a breach and have to act accordingly."
        },
        {
            "text": "You may have seen representatives from our Inspections and Enforcement Division at the recent AHDA Conference chatting to delegates there, or at the London Vet Show, where we delivered two Inspection workshops. However, whilst we were there, we also instructed a company to remove advertising material from their stand for a product which didn’t have a marketing authorisation."
        },
        {
            "text": "We were also at the Blackpool Pigeon Show where we seized unauthorised medicines offered on sale."
        },
        {
            "text": "Some of these issues are caused through ignorance rather than made deliberately, and the offending exhibitor is unaware that they are in breach of the regulations. Unfortunately, ignorance is no defence, and a breach however unintentional  is still  a breach, so it’s important to know what you can and can’t do."
        },
        {
            "heading": 2,
            "text": "What are the rules?"
        },
        {
            "text": "If you wish to supply veterinary medicines classified as POM-V, POM-VPS or NFA-VPS, then you must be authorised to do so, and any sale must be from an approved premises."
        },
        {
            "text": "A trade stand can be registered as a veterinary practice premises, SQP retailer premises or a pharmacy at a trade show for this purpose. This must be done before you can supply any veterinary medicines from there. The stand must be within a permanent building, such as an exhibition hall, with a specific address, and you must meet the relevant storage requirements for the medicines you propose supplying."
        },
        {
            "heading": 2,
            "text": "Small Animal Exemption Products"
        },
        {
            "text": "These are products for animals that are kept exclusively as pets and are not intended to produce food for human consumption."
        },
        {
            "text": "If you wish to supply products that are marketed in the UK under Schedule 6 of the VMR (Exemptions for small pet animals) then you don’t need to have an approved or registered stand. But you must only supply medicines in accordance with this Schedule."
        },
        {
            "text": "This means there are limits on which products can be supplied (for example no antibiotics), for which species (including homing pigeons and caged birds), and the quantities allowed in one pot/container. Further information on small animal exemption products is available on our website."
        },
        {
            "text": "Small animal exemption products must also be labelled in accordance with the scheme (the product label must include a statement to that effect)."
        },
        {
            "text": "Information on what makes a product a veterinary medicine, including medicinal words and phrases, can also be found on our Legal Controls on Veterinary Medicines page."
        },
        {
            "heading": 2,
            "text": "Further Information"
        },
        {
            "text": "Further guidance on how to comply with the VMR can be found on GOV.UK:"
        },
        {
            "text": " "
        },
        {
            "text": "Team contact details are given within relevant guidance, so if after reading them you are unsure whether you comply with the VMR please contact us for advice. Alternatively, you can always reach us at postmaster@vmd.gov.uk."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}