{
    "url": "https://prisonjobs.blog.gov.uk/2023/03/21/the-probation-services-officer-role-from-two-different-perspectives/",
    "title": "The probation services officer role from two different perspectives",
    "authors": [
        "Ministry of Justice"
    ],
    "categories": [
        "Probation"
    ],
    "pub_date": "2023-03-21T17:22:13+00:00",
    "content": [
        {
            "heading": 3,
            "text": "We spoke to Pavenpreet and Georgie who work for London Probation Service as probation services officers. Pavenpreet has nearly nine years’ experience while Georgie joined the service last year. Will their different lengths of service change their reflections on the role?"
        },
        {
            "text": "Your roles both involve managing a caseload of people on probation. Tell us a bit about your day to day."
        },
        {
            "text": "Pavenpreet: The work is largely face-to-face appointments, then updating records, dealing with referrals, information gathering, that sort of thing. I would say it’s a different challenge every day, dealing with different people, with different needs. Some simple, some not. You might plan a to-do list, but you’ll end up doing something completely different. There’s never a boring day."
        },
        {
            "text": "Georgie: It’s quite varied. It’s completely new to me. There’ll be appointments, reports, different issues with different people. Housing issues to sort, home visits to make. Each day is quite different. It’s a lot at first but you soon learn to get the balance right and it works pretty well."
        },
        {
            "text": "Why did you decide to become probation services officers?"
        },
        {
            "text": "Pavenpreet: It’s just about helping others really, it’s as simple as that. I have a policing background, it’s in the family – my grandfather was a policeman and I studied criminology. So my interest in the job started during my studies. For me it’s about helping people in the community and protecting the public."
        },
        {
            "text": "Georgie: I worked in a gym before and it wasn’t very fulfilling, I was just on the front desk. But I was interested in people’s lives and how I could make a difference. I watched lots of YouTube videos and saw a woman who was a probation officer talking about her job and it sounded fascinating."
        },
        {
            "text": "How easy was it to apply for the role?"
        },
        {
            "text": "Georgie: I looked it up on the Government website [link]. It was very simple! The assessment was fine – there was a written element and an interview – I found it alright to be fair. The written bit was harder for me as I’m not my best with words. But it was all well laid out and I got there in the end."
        },
        {
            "text": "Pavenpreet: The application process was alright from what I remember. It was a while ago. There was a behaviour and experience-based test and an interview. It was okay. I mean, I got the job!"
        },
        {
            "text": "So, with all the experiences you’ve had, both long and brief, what would you say are the most rewarding parts of the role?"
        },
        {
            "text": "Pavenpreet: Being able to make a difference to people’s lives is really important and it’s what I find so rewarding about the job.  Seeing people get help and move away from a life of crime – it doesn’t get much better than that. It is very satisfying. That’s why I’ve stayed so long. It’s fulfilling on lots of different levels."
        },
        {
            "text": "Georgie: So far, it’s working with people who do actually want to change their path, they don’t want to be involved with the lifestyle they’ve been in before, they want help to take their life in a more positive direction. Getting the opportunity to help facilitate that is very uplifting and powerful."
        },
        {
            "text": "What about the more challenging aspects of the role?"
        },
        {
            "text": "Pavenpreet: Obviously when you think of the job before you start you think of the face-to-face interactions, and you don’t really think about the paperwork. But it’s there, and it needs to get done."
        },
        {
            "text": "Georgie: At the beginning I was quite stressed but now I’ve really learned how to balance my time. The training is great, and you’re very well supported and learn a lot on the job. You can’t do everything in one day and knowing that is important."
        },
        {
            "text": "What do you think are the most important qualities you need to be a good probation services officer?"
        },
        {
            "text": "Pavenpreet: Patience, resilience, assertiveness, empathy and good listening skills. You’ve also got to be tenacious and prepared to work hard."
        },
        {
            "text": "Georgie: Being empathetic. Being organised and having strong time-management skills are also important. And being a team player. I really like my team and I know I can go to them."
        },
        {
            "text": "Finally, what would you say to anyone considering a career as a probation services officer?"
        },
        {
            "text": "Georgie: You’re there to help and everyone deserves the chance to change. There will be tough days, but there’s lots of things to love about the role."
        },
        {
            "text": "Pavenpreet: Being able to make a difference to people’s lives is really important. It’s a very fulfilling and rewarding role."
        },
        {
            "text": "Thanks very much Pavenpreet and Georgie – it’s remarkable how similar your reflections on the probation services officer role have been. Thanks again and wishing you well in your roles."
        }
    ]
}