{
    "url": "https://ofsi.blog.gov.uk/2023/03/21/trust-services-sanctions-update/",
    "title": "Trust Services Sanctions update",
    "authors": [
        "OFSI"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2023-03-21T15:27:20+00:00",
    "content": [
        {
            "text": "The UK Government remains committed to punishing Russia’s illegal invasion of Ukraine, cutting off funding streams to the Putin regime and stopping those close to the regime from benefitting from western services."
        },
        {
            "text": "As announced last year, the UK government has acted alongside its international allies to introduce new measures that will prevent Russia from accessing UK trust services. Enforcement agencies suggest there is evidence of UK-based trust and company service providers offering their services to persons to enable them to reduce the impact of sanctions in the event they become subject to them. This forms part of the strongest sanctions regime ever introduced in the UK."
        },
        {
            "text": "Today, we are further sharpening our sanctions to close off UK trust service providers from providing trust services to designated persons."
        },
        {
            "text": "The Russia (Sanctions) (EU Exit) Regulations 2019 (“the Regulations”), define trust services as:"
        },
        {
            "text": "Since 16th December 2022, it has been prohibited by Regulation 18C (trust services) of the Regulations for a person to provide trust services to or for the benefit of a person connected with Russia (unless those trust services were being provided pursuant to an ongoing arrangement immediately prior to that regulation coming into force)."
        },
        {
            "text": "It is also prohibited to provide trust services to or for the benefit of persons designated for the purposes of Regulation 18C (trust services). Today, on 21st March 2023, the 1730 persons that are currently designated under Regulation 11 (asset freeze) of the Regulations are now also designated under Regulation 18C (trust services). This means that it is now prohibited to provide trust services to or for the benefit of these persons, unless permitted by a licence or there is an applicable exception. FCDO’s UK Sanctions List and OFSI’s Consolidated List have been updated to reflect this."
        },
        {
            "text": "To support trust service providers wind down their services in relation to designated persons, OFSI has issued General Licence INT/2023/2589788 that allows 90 calendar days to wind down those services. This is effective from the date of designation for the purposes of Regulation 18C of the person to whom the trust services are being provided. For example, for persons designated today on 21st March 2023, the permission to wind down provision of these services will expire at 23:59 on 18th June 2023. Anyone using the General Licence must report to OFSI within 30 calendar days of undertaking any activity under the General Licence. Reporting must include the details of the trust services provided, amongst other things, and evidence should be provided where applicable, and can be completed using this form."
        },
        {
            "text": "This General Licence is in addition to the existing exceptions and licencing grounds, including the exception to allow trust services to continue to be provided for the purposes of complying with an asset freeze. More information on exceptions and licensing grounds can be found in OFSI’s updated Russia guidance."
        },
        {
            "text": "Like all UK sanctions measures, the trust services prohibitions also apply across the UK’s Crown Dependencies and Overseas Territories (OTs), with HM Treasury and FCDO supporting on their effective implementation. To ensure that this new measure can be implemented effectively in the OTs, we have made an Order in Council. OTs can issue General Licences with the consent of the Foreign Secretary and a number of OTs may want to mirror OFSI’s General Licence."
        },
        {
            "text": "OFSI’s updated Russia guidance also provides clarity on how the trust services sanctions interact with other existing sanctions, such as sanctions on professional and business services. Further to that, it confirms that all sanctions on professional and business services continue to apply even when trust services are permitted, unless the professional or business service is permitted by a licence in respect of that professional or business service or there is an applicable exception from the professional or business services sanction."
        },
        {
            "text": "For any queries, please contact ofsi@hmtreasury.gov.uk"
        }
    ]
}