{
    "url": "https://environmentagency.blog.gov.uk/2024/07/31/combatting-crime-in-rural-communities/",
    "title": "Combatting crime in rural communities",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Environment Agency",
        "Waste"
    ],
    "pub_date": "2024-07-31T07:44:26+00:00",
    "content": [
        {
            "text": "Sgt Dan Goss from Merseyside Police Rural, Wildlife & Heritage Team shares how working collaboratively with the Environment Agency and others is helping to stop waste crime across Merseyside’s rural areas."
        },
        {
            "text": "Merseyside Police is one of the newest forces to set up and establish a Rural, Wildlife & Heritage Team. The reason for the team is to provide rural communities with a dedicated team that understands the complexities and effects that rural crime has on its communities."
        },
        {
            "text": "Nationally it’s clear that organised crime groups target and exploit rural communities. This criminality takes various forms including firearms, human trafficking, drugs and waste crime, to name a few. The waste industry identifies the cost of waste crime to the English economy to be in the region of £1 billion annually through evaded tax, environmental and social harm, and lost legitimate business. This is clearly a concerning factor given that a portion of this will be funding further criminality. The Environment Agency’s 2023 National Waste Crime Survey finds that 52% of farmers and landowners are affected and 18% of all waste is illegally managed."
        },
        {
            "text": "At an early stage of setting up Merseyside Police Rural, Wildlife & Heritage Team, it was clear that joint operations and partner agency co-operation would be key in tackling waste crime within Merseyside. As an officer with over 15 years’ experience, I was surprised by the number of legislative powers that the Environment Agency have. The Environment Agency’s knowledge, skillset and dedication to targeting offenders of waste crime is extremely refreshing."
        },
        {
            "text": "Working together utilising each other’s powers and knowledge has helped us gain access to locations that we wouldn’t ordinarily have, and to locate numerous stolen vehicles from sites that without that access we wouldn’t have been able to get to. Utilising disruption and prevention tactics simply by visiting sites, in a high visibility and joint method shows a strong and united approach to current and prospective offenders. It’s allowed us from the very start to prevent offenders from being able to provide false or inaccurate information, as well as playing one agency off against another. This continues to be a small but vital step to tackling waste crime offenders on the spot."
        },
        {
            "text": "As a team we have been able to learn a huge amount from these joint visits, operations and days of action, which has not only upskilled us but has provided Environment Agency staff with a better understanding of our processes and limitations. Taking a step back and accepting that the police are not always the right organisation to lead on incidents has allowed us to thrive together and target much wider areas of criminality. Debriefing and gaining feedback after every visit identified that with the police present, verbal abuse towards Environment Agency staff lowered and the outcome being more efficient compliancy."
        },
        {
            "text": "Our joint successes have not only come from targeting specific intelligence led days of actions or from follow up visits, but also through our joint awareness and education across our organisations and communities. This has taken the form of internal newsletters and updates as well as media and social media platforms. Education and awareness is vital to cutting the trend and explaining to communities that they have a part to play in restricting offenders and to dispose of their waste appropriately."
        },
        {
            "text": "Working with the Environment Agency has aided in the wider profile of my team by allowing us to form relationships with partners and stakeholders such as local councils, Fire and Rescue Service, Natural England, Health & Safety Executive and the National Farmers Union. This in-turn has Improved the sharing of intelligence between agencies and set the foundations for on-going operations. The trust and confidence developed within the network has meant that information and intelligence is passed quickly and effectively. It can be acted on or developed on a much more efficient scale."
        },
        {
            "text": "Crime prevention, awareness and education are key to stopping criminals, specifically around the topic of waste crime. Due to our core role, we engage with a lot of farmers, landowners and rural communities. All have voiced how they are at risk of being a victim of waste crime. We sign post them to the Environment Agency for guidance, provide crime prevention advice and look at any safeguarding for potential vulnerable victims."
        },
        {
            "text": " "
        },
        {
            "text": "If you live in a rural area, I urge you to follow the Environment Agency guidance to prevent waste criminals impacting your lives."
        }
    ]
}