{
    "url": "https://deframedia.blog.gov.uk/2024/07/31/coverage-of-rapid-review-to-meet-environment-act-targets/",
    "title": "Coverage of rapid review to meet Environment Act targets",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Nature"
    ],
    "pub_date": "2024-07-31T11:42:57+01:00",
    "content": [
        {
            "text": "There has been widespread media coverage today (Wednesday 31 July) of the government’s announcement of a rapid review of the Environmental Improvement Plan (EIP). The review will be completed by the end of the year marking the government’s renewed ambition to deliver legally binding targets and save nature."
        },
        {
            "text": "The announcement coincides with the publication of the Environmental Improvement Plan Annual Progress Report, which highlights the need for accelerated action to reverse the historic declines in nature. This covers the previous government’s progress against delivery of the EIP between 1 April 2023 to 31 March 2024."
        },
        {
            "text": "The government will develop delivery plans to meet each of its ambitious Environment Act targets, focusing on cleaning up our waterways, reducing waste across the economy, planting millions more trees, improving air quality and halting the decline in species by 2030."
        },
        {
            "text": "Publications such as The Times (page 11), The Guardian, Evening Standard, BusinessGreen, Water Magazine, FarmingOnline, Circular Online, Eastern Daily Press, the Northern Echo and the Express & Star covered the announcement."
        },
        {
            "text": "Secretary of State for the Environment, Food and Rural Affairs, Steve Reed, said: "
        },
        {
            "text": "A number of stakeholders are quoted in coverage of the announcement, with the Green Alliance noting the review is “a good place to start”, the National Trust “warmly welcoming” the announcement and the Wildlife and Countryside Link quoted as being “delighted that Secretary of State Steve Reed will strengthen the EIP”."
        },
        {
            "text": "Dame Glenys Stacey, Chair of the Office for Environmental Protection, said:"
        }
    ]
}