{
    "url": "https://defencedigital.blog.gov.uk/2024/07/31/defence-developer-services-d2s-launching-new-offerings-for-our-users/",
    "title": "Defence Developer Services (D2S): Launching new offerings for our users",
    "authors": [
        "Hayley P"
    ],
    "categories": [
        "Digital Foundry",
        "Digital Transformation"
    ],
    "pub_date": "2024-07-31T11:47:50+01:00",
    "content": [
        {
            "heading": 3,
            "text": "D2S is part of the Defence Digital Foundry and provides products and services that enable the software development community and accelerate the delivery of software and applications. You can find out more information on the D2S Portal."
        },
        {
            "text": "It has been another busy year for the Defence Developer Services (D2S) with a strong focus on expanding the products and offerings for digital teams in Defence. As D2S Service Owner, I wanted to share a timely update on where we’re up to and what’s on the horizon for our users."
        },
        {
            "text": "The D2S team deeply understands the importance of continuous improvement and innovation. It's not just about adding more badges to our lanyard — it's about listening and consistently delivering value to our users and the wider Defence community. Our latest offerings are a testament to this commitment. I’m proud to say that our users have worked closely with our team to shape and improve our latest offerings."
        },
        {
            "heading": 2,
            "text": "What’s new for D2S"
        },
        {
            "heading": 3,
            "text": "1.    Introducing D2S//Tools"
        },
        {
            "text": "D2S//Tools (formerly Tech for Digital Teams) has now joined the D2S offering to enable digital teams across Defence to access industry-leading productivity tools and collaboration software. There are over 3,300 users in Defence that are using the tools to improve their ways of working."
        },
        {
            "heading": 3,
            "text": "2.     Launching the D2S Platform’s SECRET Environment"
        },
        {
            "text": "The first Defence application has now launched in the SECRET environment on the D2S Platform. This followed a huge amount of effort from our Platform and Security teams to build a minimum viable product and achieve Continuous Authority to Operate (CAtO) certification. This milestone will enable Defence teams to access an assured and secure SECRET environment to deploy software at pace."
        },
        {
            "heading": 3,
            "text": "3.     D2S Community kicks off the annual Defence Developer Day"
        },
        {
            "text": "We recently held the first Defence Developer Day to bring our developer community together and foster new connections and ideas. The event featured community stories, Defence software policy ideation and team building exercises."
        },
        {
            "text": "It was a fantastic day, with a 4.7/5* rating from attendees who shared “we're still a very new community but bringing us all together will give us a big voice inside Defence”. We can’t wait for next year!"
        },
        {
            "heading": 2,
            "text": "What’s next for D2S"
        },
        {
            "heading": 3,
            "text": "1.    Enhancing the D2S Platform’s SECRET Environment"
        },
        {
            "text": "We are now focused on building the collaboration tool set and full user support package for the SECRET environment to replicate the capabilities available in the OFFICIAL environment. Later this year, we will invite more Defence teams to deploy at SECRET."
        },
        {
            "heading": 3,
            "text": "2.    Delivering our reuse strategy for Defence"
        },
        {
            "text": "We will explore and build the D2S//Reuse offering where development teams can access, share, and utilise containers, components, and trusted image repositories to accelerate delivery. The aim is to make these elements available so we can reuse and reduce duplication of effort."
        },
        {
            "heading": 3,
            "text": "3.    Discovery for the Foundry Access and Authentication service"
        },
        {
            "text": "The Defence Digital Foundry has a requirement to manage access to its services and products developed within it. The goal is to simplify the configuration and management of identity to improve user experience. We’re looking forward to launching a discovery and speaking to Foundry users about an Access and Authentication service very soon."
        },
        {
            "heading": 2,
            "text": "Find out more"
        },
        {
            "text": "To understand how D2S could accelerate your software delivery, contact the D2S team. You can visit the D2S Service Page to find out more."
        },
        {
            "text": " "
        }
    ]
}