{
    "url": "https://competitionandmarkets.blog.gov.uk/2024/07/31/getting-ready-for-the-consumer-protection-changes-in-the-digital-markets-competition-and-consumers-act-2024/",
    "title": "Getting ready for the consumer protection changes in the Digital Markets, Competition and Consumers Act 2024",
    "authors": [
        "Hayley Fletcher"
    ],
    "categories": [
        "CMA Digital"
    ],
    "pub_date": "2024-07-31T11:10:25+01:00",
    "content": [
        {
            "heading": 2,
            "text": "New powers for the Competition and Markets Authority (CMA)"
        },
        {
            "text": "Today we are publishing our draft rules and procedural guidance covering an important aspect of the Digital Markets, Competition and Consumers Act 2024 (DMCC Act) – the new direct consumer enforcement powers of the CMA. "
        },
        {
            "text": "When these powers come into effect, for the first time the CMA will be able to decide whether key consumer laws have been broken rather than taking a case to court. If it finds a consumer law breach, the CMA will be able to impose remedies, which may include requiring firms to offer compensation or other redress for consumers. It will also be able to impose fines for breaches, including for breaches of remedies and failures to comply with information provision requirements. "
        },
        {
            "text": "These powers are expected to come into force next year. The precise timing is a matter for the Department for Business and Trade, but we will be ready to use our new powers to protect consumers whenever they come into force. As part of our preparation for using our new powers, we are asking stakeholders if they agree with our proposed approach set out in the draft rules and guidance."
        },
        {
            "text": "Find out more about the consultation and how to respond through the response form or by email to consumerguidance@cma.gov.uk. "
        },
        {
            "text": "Please note this consultation will close on 11 September."
        },
        {
            "heading": 2,
            "text": "New and updated consumer rights "
        },
        {
            "text": "In addition to strengthening the CMA’s powers, the DMCC Act also makes changes to existing consumer rights. These include: "
        },
        {
            "heading": 2,
            "text": "Stronger powers for other consumer law enforcers  "
        },
        {
            "text": "The CMA’s direct consumer enforcement powers will exist alongside other court-based enforcement powers held by it and other enforcement agencies in the UK. The DMCC Act also makes some important changes to these powers. Most notably: "
        },
        {
            "text": "As we prepare to take on the new powers that the CMA and others will receive under the DMCC Act, we remain committed to driving better outcomes for people, businesses and the UK economy. We look forward to working with our landscape partners and hearing from our stakeholders in this important moment for the UK’s consumer protection regime. "
        },
        {
            "heading": 3,
            "text": "Areas also found in the DMCC Act "
        },
        {
            "text": "These consumer law and enforcement provisions comprise only one element of the DMCC Act, which also: "
        }
    ]
}