{
    "url": "https://mhclgmedia.blog.gov.uk/2024/07/31/our-plan-to-get-britain-building-again/",
    "title": "Our plan to get Britain Building again",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Affordable housing",
        "Housing",
        "Planning"
    ],
    "pub_date": "2024-07-31T17:48:46+01:00",
    "content": [
        {
            "text": "Yesterday the Deputy Prime Minister launched the new National Planning Policy Framework which will increase housing targets to get Britain building again."
        },
        {
            "text": "We will also begin work today on a generation of new towns. The Deputy Prime Minister has appointed Sir Michael Lyons to lead an independent New Towns Taskforce, supported by Deputy Chair Dame Kate Barker."
        },
        {
            "text": "For the first time we will make housing targets mandatory, and we have changed the way they are calculated so they better reflect local needs, rather than the current system which reflects decade old data."
        },
        {
            "text": "London"
        },
        {
            "text": "The standard method should produce an objective assessment of housing need. The previous version of the method instead imposed an arbitrary 35% uplift on the 20 most populous cities, known as the ‘urban uplift’. While in 19 cities outside of London, this applied only to the city centre authority – creating its own issues in trapping need in urban cores that the new method distributes over the wider city region – in London it was applied to every borough. This took the London number from circa 73,000 to 99,000, in turn accounting for a third of the total target across England."
        },
        {
            "text": "The Government is clear that we must radically boost delivery in our capital to meet housing pressures and fuel productivity growth, but our view – which we believe is shared by the development and wider housing sector (for example, Landsec’s Chris Hogwood, Lichfields’ Matthew Spry, The Housing Forum’s Anna Clarke, and the Home Builders Federation’s David O’Leary) – is that this figure was divorced from reality. It effectively made tens of thousands of homes a fiction, existing on paper but never realistically planned for, when if reallocated to other places these numbers could have been delivered."
        },
        {
            "text": "The new method produces a figure for London of nearly 81,000. This is more than double recent delivery, which was 35,305 in 2022/23, and which is expected to fall further this year. It is also more than half again above the figure set out in the current London Plan. It equates to more than 2% of stock per year, which is well over twice the average delivery rate we have seen across England over the last decade at 0.89%. It has the biggest proposed percentage increase against existing delivery of any region in the country by a significant margin."
        },
        {
            "text": "More important than setting a deeply ambitious but credible target is of course meeting it. The Government is clear that recent delivery in London has fallen well short of what is needed, and that is why we are committed to working in partnership with the Mayor of London and the GLA to turn this around - including by optimising density and through Green Belt review."
        },
        {
            "text": "Distribution"
        },
        {
            "text": "Alongside this position in London, the new method sees growth across the rest of the country: across our broader city regions, figures grow by more than 30%; and we see boosts in every region. This addresses a consistent criticism of the old method, that it dragged down ambition in large areas of the north and midlands, where targets fell radically short of existing delivery and existing Local Plans as the analysis by consultancy Lichfields shows (see chart below). With houses out of reach for the average earner in all but two local authorities, ambitious growth should not be confined to the South East."
        },
        {
            "text": " "
        },
        {
            "text": "We do not shy away from the fact that this drives some big increases versus current targets – in many cases this simply brings the output of the standard method far more in line with existing delivery. For example, County Durham, Darlington, Hartlepool, Middlesbrough, Northumberland, Stockton-on-Tees, Sunderland, and Redcar and Cleveland have delivered hundreds more homes per year than the target set for them. In some cases, the old method suggested an authority delivering hundreds of homes a year should only be delivering in the tens. The new targets compared to delivery are rightly ambitious yet credible."
        },
        {
            "text": "The new method strikes a balance between recognising and meeting the scale of need right across the country and focusing additional growth on those places facing the biggest affordability pressures, by more than doubling the affordability multiplier we apply in the method. The heat maps below (Lichfields) demonstrates this, showing that the biggest proportionate increases are focused in the South and South East."
        },
        {
            "text": " "
        },
        {
            "text": "We see a big rise in ambition in areas central to driving growth, like Oxford and Cambridge, where the current method has been demonstrably below the number of homes necessary to support economic ambitions. The previous method locked in under-delivery by relying on projections of household formation: low rates of housebuilding lead to low levels of household growth as, for example, adults stay living with parents because there are no homes to move into. The new method avoids the circularity problem, so we see Oxford’s figure rise by 38% and Cambridge’s by 56% compared to the current method, requiring an increase versus current delivery of 141% and 70% respectively. The Government’s new emphasis on cross-boundary collaboration and on strategic Green Belt release will bring these figures into reach."
        },
        {
            "text": "In addition, as the Housing Minister set out this morning, the Government’s ambition for new towns will further unlock the economic potential of existing towns and cities across the country, with many delivered as urban extensions and regeneration schemes."
        },
        {
            "text": "Beauty"
        },
        {
            "text": "New homes should be high-quality, well-designed and sustainable. As the proposed NPPF continues to make clear, and as the consultation emphasises, beauty is an important objective of well-designed places. And as the Deputy Prime Minister said in the House of Commons yesterday, “whether it is social, affordable or any other housing, it should be beautiful and should have character and style, and we are determined to make that happen”."
        },
        {
            "text": "The Government is not proposing to remove all references to ‘beauty’ from the NPPF. The changes we are making simply relate to additional references inserted by the previous government in December 2023, which architectural and planning professionals were concerned added additional subjectivity that risks inconsistency in decision-making."
        },
        {
            "text": "The Royal Institute of British Architects has previously said the use of descriptive words such as “character” and “beauty” could be “problematic” if used in the wrong way in planning policy, because they were subjective issues open to interpretation and could mean that “necessary and otherwise high-quality development” is turned down."
        },
        {
            "text": "The proposed reversals address that problem, while still ensuring that beauty is an important and explicit objective of well-designed places. There is already a clear framework through policy and guidance on how to achieve well-designed places as set out in the National Design Guide and National Model Design Code, enabling this to be decided by local planning authorities, working together with developers and the community."
        }
    ]
}