{
    "url": "https://moderncivilservice.blog.gov.uk/2024/07/31/transforming-tax-millions-now-using-the-hmrc-app/",
    "title": "Transforming tax: millions now using the HMRC app",
    "authors": [
        "Government Reform"
    ],
    "categories": [
        "A Modern Civil Service",
        "Data science",
        "Digital and data",
        "Government Reform",
        "Innovation",
        "Interoperability",
        "Modernisation and Reform",
        "Proud Civil Servant",
        "Skilled",
        "Skilled Civil Service"
    ],
    "pub_date": "2024-07-31T09:38:46+01:00",
    "content": [
        {
            "text": "If you’re checking your pay, changing jobs, viewing your state pension forecast or claiming Child Benefit, where do you go for the right information? Rather than wading through paperwork or picking up the phone, the HMRC app is becoming a go-to digital companion for tax and benefit tasks that can be done hassle-free."
        },
        {
            "text": "In the last year, HMRC has added services that are encouraging millions to use the app just as they do for their banking, shopping and other life admin. In a world where online services have revolutionised how people live their lives, citizens rightly expect the government to provide more of what they need through quick and straightforward digital channels. HMRC is working to improve their experience by making it easier to get their tax right at a time and place convenient to them."
        },
        {
            "text": "In 2023, over 3.3 million customers used the HMRC app more than 80 million times. It consistently ranks in the top 10 free finance apps on Google Play and App Store, and currently has ratings of 4.8 and 4.7 out of 5 respectively. Last year the app also secured a spot in the shortlist for Computing's Digital Technology Leaders Awards in the Mobile Project of the Year category, a testament to its development."
        },
        {
            "text": "\"We're building what customers need\""
        },
        {
            "text": "Reflecting on the journey of the HMRC app, Daljit Rehal, Director General for Chief Digital & Information Officer, said \"The app has shown how we’re building what customers need, and we’ll continue to improve the ease of use and include more digital services as we go."
        },
        {
            "text": "“Child Benefit is a great example of how we have improved a paper and post service and moved it online and into the HMRC app to great effect. Our digital claims process, supporting families to get the money they need as quickly as possible, now takes about 10 minutes to complete and payments can be made to many families in as little as three days."
        },
        {
            "text": "“Over 450,000 online Child Benefit claims have been made since launching the service in May 2023, and parents can claim and manage their Child Benefit on the HMRC app, ensuring they receive the financial support they’re entitled to.”"
        },
        {
            "text": "As part of HMRC’s ongoing digital transformation, customers who can self-serve are being encouraged to solve many queries online and in the app, giving our customer service advisers time to help those with more complex queries or who are digitally excluded."
        },
        {
            "text": "NINO at your fingertips"
        },
        {
            "text": "An example of this is using the app to store your National Insurance Number (NINO) in a digital wallet, making it readily accessible anytime. Teenagers get their NINO when they turn 16 and can use it for their first job, booking a driving test, applying for university finance and lots of other useful tasks. We also hear from customers who misplace or forget their NINO, and now there’s no need to phone HMRC and wait for a letter, as the app allows them to view their NINO securely on screen and download it."
        },
        {
            "text": "Further developments are planned to enhance the app’s functionality, delivering what our customers rightly expect – modern, quality services that are quick and easy to interact with. But where did the journey start? We launched the HMRC app in 2016, initially with little fuss. While the first generation of the app mostly featured links to GOV.UK guidance, it has evolved into something of a digital gem and is now a cornerstone of HMRC, shaping our ongoing transformation journey. "
        },
        {
            "text": "Daljit says: “The app is a fundamental part of the broader digital transformation of HMRC and our services. Last year, we received more than three million unnecessary calls for just three tasks easily resolved digitally: resetting passwords, getting tax codes and National Insurance numbers."
        },
        {
            "text": "“Offering secure, convenient digital solutions saves everyone time and allows our customers to get things right and manage their information, while freeing up our staff to help those who need the most support.”"
        },
        {
            "text": "The app has evolved based on feedback and customer use, with services and guidance often added if we see customers calling us when they could complete the task themselves. In 2023, these included allowing users to check their State Pension forecast and pay their Self Assessment bills – with £710 million Self Assessment app payments made to date."
        },
        {
            "text": "App users can check their wages ahead of payday, use our tax calculator to estimate their take-home pay, and update their details – all in one place."
        },
        {
            "text": "Ensuring Accessibility and Customer Satisfaction"
        },
        {
            "text": "Accessibility is at the heart of the app’s design and it is compatible with assistive technologies. The app also supports the Welsh language needs of customers allowing toggling between English and Welsh. To avoid having to remember passwords, users can access the app using facial recognition, fingerprint, or a six digit pin for fast and secure entry."
        },
        {
            "text": "Downloading the HMRC app is simple and straightforward; just visit GOV.UK and follow the instructions. It’s available for download on both the App store and Google Play, and only takes a few minutes to sign up."
        },
        {
            "text": "Looking ahead, Daljit says: “We still have a lot of work to do but are determined to make the app experience even better so most customers have no need to call.  As we look to the future, the HMRC app will continue to evolve and improve and be the customer touchpoint for HMRC, helping us become a more efficient, modern, and trusted tax organisation.”"
        },
        {
            "text": "How can you help? Please download the HMRC app yourselves, and encourage friends and family to do the same. From teenagers to parents, self-employed to pensioners, the app can help everyone to get in control of their money and tax."
        }
    ]
}