{
    "url": "https://environmentagency.blog.gov.uk/2024/07/31/what-is-a-chemistry-sample-and-why-does-the-environment-agency-do-them/",
    "title": "What is a chemistry sample and why does the Environment Agency do them?",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Environment Agency",
        "Rivers",
        "Water"
    ],
    "pub_date": "2024-07-31T09:40:33+00:00",
    "content": [
        {
            "text": "My name is Lucy, and I am a Field Monitoring Officer in the National Monitoring Field Team. My role involves collecting water samples from bathing waters and rivers. I take several types of samples but today I am going to explain Catchment Sensitive Farming chemistry samples."
        },
        {
            "text": "As I am based in East Anglia that is where I collect my chemistry samples. However, they are done all over England."
        },
        {
            "text": "I take my samples at pre-determined sampling locations. A lot of thought and research goes into the location of our sample points. There are many reasons why we collect samples.  The chemistry samples are part of the Catchment Sensitive Farming (CSF) monitoring programme which requires weekly sampling of the River Alde, River Ore and the River Deben."
        },
        {
            "text": "The CSF programme led by Natural England works with farmers, organisations, and communities to improve the quality of air and water and supports the use of nature-based solutions to improve sustainable water management."
        },
        {
            "text": "Taking the sample involves filling a stainless steel can with river water and then transferring it into sample bottles. These are what we send to our laboratories for analysis. The type and number of sample bottles depends on what chemicals are being looked for. Once the bottles are full, I pop them in a fridge located in the back of our van. The CSF sampling also includes collecting samples which are analysed for their bacteria content. For these I have a pole which I attach the sample bottle to so that the river water goes straight into the sterile bottle, reducing the risk of contamination. When all the samples have been taken, I go to my nearest office and transfer them to another fridge where they wait to be picked up later that day and transported to our laboratory."
        },
        {
            "text": "At the lab the samples are analysed for substances indicative of impacts from agriculture and sewage such as phosphates, nitrates, bacteria, and suspended solids. We also take readings at each site using a meter to record dissolved oxygen levels, pH, temperature and conductivity levels."
        },
        {
            "text": "One of the critical substances we measure is phosphate. When levels are elevated it can cause eutrophication, which is when excess plants and algae grow causing dissolved oxygen levels to crash and fish kills as well as a reducing biodiversity. Phosphate enters the rivers primarily, but not exclusively, from sewage inputs and agricultural runoff."
        },
        {
            "text": "Weekly sampling for CSF means we can keep an eye out for changes and observe long term trends. We use the evidence we collect from our monitoring to drive investment in environmental improvements and protection of the water environment."
        },
        {
            "text": "To improve water quality, we must all work together - us, the farming community, water companies and the public. If you think you have spotted a possible pollution incident at a river or bathing water please report it to our 24/7 incident hotline number immediately on 0800 80 70 60 ."
        },
        {
            "text": " "
        }
    ]
}