{
    "url": "https://ruralpayments.blog.gov.uk/2024/07/25/grants-service-team-visit-cowsden-bank-farm-to-talk-about-fetf-grants/",
    "title": "Grants Service team visit Cowsden Bank Farm to talk about FETF grants",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "External engagement",
        "Grants"
    ],
    "pub_date": "2024-07-25T14:55:48+01:00",
    "content": [
        {
            "heading": 4,
            "text": "RPA offers a wide range of grants and rural payments to farmers and businesses. In this blog, Georgina Ling from the Grants Service team writes about her visit to Cowsden Bank Farm in Worcestershire, to understand their experience of applying for grant funding under the Farming Equipment and Technology Fund (FETF) "
        },
        {
            "text": "Hello, I’m Georgina and I’ve worked in Claims Contracting for three months. I was lucky enough to visit Cowsden Bank Farm to look at some of the items they’ve bought under FETF."
        },
        {
            "text": "It's been important for me to see how the equipment for which we process the claims is used. This visit was very insightful, and it’s been great to speak to grant recipients as well as helping with my understanding of why we do our work within Grants Service."
        },
        {
            "text": "The farmer, Colin Collins, was awarded funding under FETF for a variety of items including a direct drill, a mobile sheep handling system, crop storage sensors and inter row companion drills."
        },
        {
            "text": "Colin farms around 5000 acres, predominantly arable, with contract farming and share farming. He has 100 organic suckler cows, as well as running a sheep fattening enterprise on their cover crops from their re-gen farming."
        },
        {
            "text": "I asked Colin whether he would recommend grants to other farmers and he told me: “I definitely, definitely would. It's transformed our farming system going down the re-gen line and it's been really easy to do, and has helped us tremendously getting to where we want to go."
        },
        {
            "text": "Colin also does a lot of contract farming and share farming. His central store building was erected in 2018 through a Countryside Productivity grant. This is used for his share and his contract farming partners to blend the grain and get the quality right."
        },
        {
            "text": "I also met Caroline, Colin’s PA/secretary who applied for the grants on behalf of the farm. I asked her about the application process for the grants."
        },
        {
            "text": "Caroline said: “It was a really easy process and it gave a list of everything to complete the grant. The process itself was really easy, step by step. The first one took me a bit longer, but now we've done several and I've got the information stored from the previous grant. It probably takes between 15 to 30 minutes to apply, so really quick and easy. I think we're up to about five or six that we've applied for now.”"
        },
        {
            "text": "During my first three months at RPA, as well as visiting Colin’s farm, I’ve been lucky enough to be able to meet farmers at the Three Counties Show and the Great Yorkshire Show. I accompanied RPA’s filming team who’ve been making case study videos about grants for farmers, which will be published on RPA’s social media channels soon, as well as recording for the RPA podcast."
        },
        {
            "text": "Although this is my first role within the Civil Service, I worked in a small Tesco store for four years throughout school and university. There, I really got to understand the importance of delivering great customer service. I’m very new to RPA and grants, but it’s been great to meet some of the farmers who have benefitted from the funding."
        }
    ]
}