{
    "url": "https://forestrycommission.blog.gov.uk/2024/07/25/international-cooperation-helps-understand-the-threat-from-an-invasive-forest-pest/",
    "title": "International cooperation helps understand the threat from an invasive forest pest",
    "authors": [
        "Daegan Inward"
    ],
    "categories": [
        "Tree health"
    ],
    "pub_date": "2024-07-25T08:30:52+01:00",
    "content": [
        {
            "text": "Ips typographus, the eight-toothed spruce bark beetle, is the most destructive pest of spruce trees throughout continental Europe. Severe weather events such as drought, high temperatures, and storms can weaken and kill trees, providing an abundance of breeding material for these small insects, which feed and develop in the trees’ nutritious inner bark. Large populations can build up, which may then attack and kill live standing trees in an ‘outbreak’. Successive years of summer drought conditions have driven especially high population levels of the beetle to build up in continental Europe over the last few years, leading to large-scale and widespread killing of spruce trees."
        },
        {
            "text": "Until recently, no established population was known in the British Isles, with the barrier of the English Channel presumed to have restricted entry. In 2018, an isolated breeding population of Ips typographus was found in Kent in a small stand of spruce that was in very poor health. The spruce was felled and chipped to ensure destruction of the pest, and no breeding population remains there."
        },
        {
            "text": "However, since 2021, surveillance efforts have detected numerous localised and small-scale breeding populations of the beetle in Norway spruce woodlands in South East England and, more recently, in East Anglia. As a regulated quarantine pest in Britain and Ireland, eradication measures have been rapidly implemented to prevent the establishment and spread of this potentially damaging pest, some details of which can be found in the Trees, Forests and People Journal."
        },
        {
            "heading": 2,
            "text": "Cross-channel dispersal of Ips typographus into England"
        },
        {
            "text": "During the original UK finding in 2018, the beetle was initially assumed to have arrived with infested timber or by hitchhiking on a truck from a port, but further investigations failed to find a likely source of beetles. Meanwhile, pheromone traps laid out to catch the beetles in the ‘Wider Environment’ trapping network caught beetles in woodlands where there was no evidence of breeding populations in 2019 and 2020."
        },
        {
            "text": "The team of researchers from Forest Research, led by myself, in collaboration with the Université Libre de Bruxelles, set out to collect evidence for the intriguing possibility that the beetles were dispersing naturally across the English Channel. An extensive trap network was set up to track the flight activity of the beetles from an outbreak hotspot in France and Belgium to southern England, including parallel ‘coastal’ traps on either side of the channel."
        },
        {
            "text": "During a large-scale dispersal event in 2021, beetles were found to have travelled more than 160km into England assisted by suitable weather conditions and initiating many of the localised establishments of the beetle. This is the first evidence of a forest pest dispersing aerially across the Channel, and suggests that further incursions may be expected whilst continental populations remain high. Further details of the study can be found in the Journal of Pest Science."
        },
        {
            "heading": 2,
            "text": "Ips typographus spotted on Sitka spruce"
        },
        {
            "text": "This month, breeding galleries of Ips typographus were found on cut and fallen Sitka spruce material for the first time in the UK. A small number of unhealthy Sitka stems in a woodland in West Sussex had evidence of breeding galleries, among a stand of infested and unhealthy Norway spruce trees."
        },
        {
            "text": "In Britain, spruce is a crucial component of commercial forestry, particularly Sitka spruce, a North American tree species which grows especially well in cooler and damper regions. Sitka spruce is the most extensively planted tree species planted in Britain, comprising around 50% of all planted conifers, and is therefore very valuable economically, ecologically, and as a component of carbon sequestration and sustainable timber production. However, little is known about its suitability as a host for Ips typographus because it is rarely planted in continental Europe, and so the team are working to understand the threat that the beetle poses to Sitka spruce."
        },
        {
            "text": "Working within a new quarantine facility in the Holt Laboratory for tree pests and pathogens, the group have determined that freshly cut Sitka logs are as successfully utilised by breeding beetles as logs from their primary European host tree, Norway spruce. However, this finding does not account for the defensive response of living trees to bark beetle attack, where both physical and chemical defences interact to prevent beetle colonisation in healthy trees. The detection of breeding galleries on some fallen Sitka stems at the West Sussex site was therefore not unexpected. To date, successful colonisation of live, healthy Sitka trees by Ips typographus has not been observed in the UK."
        },
        {
            "heading": 2,
            "text": "Collaboration to understand Ips typographus on Sitka"
        },
        {
            "text": "To investigate the resistance of live Sitka spruce trees to Ips typographus, an important new collaboration has been established with the Danish Nature Agency and University of Copenhagen."
        },
        {
            "text": "A series of novel experiments have been initiated in a mixed spruce forest in central Denmark where the beetle occurs naturally. Artificial pheromone lures are being used to attract beetles to both healthy and water-stressed Sitka and Norway spruce trees, and measurements made to compare tree resistance and beetle colonisation success on the two tree species. By understanding the effectiveness of host defences in both healthy and stressed trees, we hope to better understand the risk of population build-up and outbreak of Ips typographus in Sitka spruce forest. Such evidence is critical to inform and support the management of healthy spruce trees and woodland in Britain and Europe."
        },
        {
            "text": "The Wider Environment study is now in its sixth year and has continued to provide evidence for long-distance dispersal in Ips typographus, as well as demonstrating that the south-east of England is by far the most likely region for establishments of Ips typographus. Following up these catches in spruce woodlands with on-the-ground surveillance has shown that Ips typographus struggles to establish in spruce woodlands that are in good health and contain no susceptible material after undertaking long-distance dispersals. However, woodlands in the South East with wind-damaged or snapped trees, or where there are other causes of decline, are at significant risk of infestation from Ips typographus. Genetic work has shown that beetles arriving in the UK are from north-west Europe, and that the initial source population in the 2018 site was relatively large, consistent with the pattern seen in the pheromone traps."
        },
        {
            "text": "The trap data has now been incorporated into wind plume models aiming to trace findings back to a source, and to forecast where beetles may travel on the wind. Phenological studies have shown that the climate is not a barrier for Ips establishment in the UK, with two generations a year the predicted norm across much of England and Wales. Climate change will benefit Ips typographus, enabling populations, if they were allowed to establish, to have two generations a year more regularly across Britain and potentially increasing drought stress in some spruce-growing areas. This work is being conducted in collaboration with the University of Cambridge."
        },
        {
            "text": "The monitoring and eradication programme for Ips typographus is rooted in evidence both from hypothesis-based research and detailed observations from years of surveillance efforts. The approach to managing Ips typographus has changed significantly since 2018, most notably with changes to site classifications for infested woodlands to allow for better cost recovery for landowners without increasing the risk that eradication measures fail. All evidence to date shows the eradication measures are working."
        }
    ]
}