{
    "url": "https://mojdigital.blog.gov.uk/2024/07/25/pursuing-professional-development-in-justice-digital/",
    "title": "Pursuing Professional Development in Justice Digital",
    "authors": [
        "Robyn Grainger"
    ],
    "categories": [
        "a great place to work",
        "Design",
        "Learning and development",
        "Our Culture"
    ],
    "pub_date": "2024-07-25T11:19:22+01:00",
    "content": [
        {
            "text": "Joining the Civil Service"
        },
        {
            "text": "As a young professional, I never anticipated my career would lead me to the Civil Service. I believe I speak for many twenty-somethings when I say I struggled to envision myself fitting into the mould of what is expected of a Civil Servant. It has been almost three years since I joined Justice Digital, and I can confidently say my assumptions couldn’t have been further from reality. I've found myself in a department where our work genuinely makes a difference to the public, and where my contributions as a young professional are truly valued."
        },
        {
            "text": "Developing in my role"
        },
        {
            "text": "My current role lies within the Communications and Engagement Team, a group of seven individuals collaborating with the wider organisation to amplify our people's voices and promote our teams' amazing work. As a Digital Content specialist, I am passionate about utilising my creativity and skills to enhance our service offerings. Creativity might not be the first word that comes to mind when thinking of a government function, but I have been able to employ my skills in a very unique and valuable way here. This is partly why I became interested in developing my abilities through continued learning and development. "
        },
        {
            "text": "When I approached my line manager about the potential to develop my skills in content design, I was met with nothing but positivity and encouragement to pursue this. At Justice Digital, where personal and professional development is championed from the top down, with the ability to dedicate 10% of your working time to it, such support is not uncommon. So, with the assistance of our Learning and Development team, I secured a place at the UX Design Institute, and last year completed a Professional Diploma in UX Design."
        },
        {
            "text": "Balancing my time"
        },
        {
            "text": "During my studies, adapting to balancing daily responsibilities with extracurricular learning was initially challenging. However, I quickly established a rhythm that benefitted both myself and my team, allowing me to fully commit to integrating these aspects. I was able to clearly block out my 10% time in my calendar by prioritising BAU tasks at the beginning of the week; this allowed me to anticipate and look forward to my development time on Fridays."
        },
        {
            "text": "A vital factor in the success of my studies was the culture of open communication and mutual support within our team. This enabled me to exceed my own expectations and discover previously untapped capabilities with the right support in place. Not only did I achieve my personal goals, but I also thrived in my professional role, bringing my best self to work each day."
        },
        {
            "text": "Looking to the future "
        },
        {
            "text": "Since completing my diploma and getting back into my everyday role, I've been pleasantly surprised at how much my confidence has been boosted by taking on a new challenge. I have seen not only the practical benefits of obtaining a professional certification, but also the significant personal growth that has occurred as a result of my learning experience. I find myself more vocal in meetings, with confidence in my decision-making and a willingness to challenge ways of working where I may have previously remained passive. Taking the time to invest in myself in this way has allowed me to see greater value in my contributions and appreciate that I bring just as much to the table as my colleagues. I now realise more than ever the importance of pushing myself at work. A few years ago, a friend shared the news of their career move with me, using the phrase, “If you're the smartest person in the room, you're in the wrong room.”. That sentiment has stuck with me ever since. It emphasises the value of surrounding yourself with those who are ahead of you, to glean knowledge from others, and to never become complacent in your own development. "
        },
        {
            "text": "If I were to give a piece of advice to someone wondering whether to invest in their own learning, I would say, don’t wait around! There is never a perfect time, and no matter when you start, it will take time to find your balance. However, in the end, you will be rewarded with new skills and a newfound sense of accomplishment."
        }
    ]
}