{
    "url": "https://defraenvironment.blog.gov.uk/2024/07/25/working-with-stakeholders-to-finalise-englands-30by30-criteria/",
    "title": "Working with stakeholders to finalise England's '30by30' criteria",
    "authors": [
        "Danielle Rooke"
    ],
    "categories": [
        "30by30",
        "Land use",
        "Nature"
    ],
    "pub_date": "2024-07-25T10:28:31+01:00",
    "content": [
        {
            "text": "The natural world is vital to our economy, food production, health, and wider society. Yet biodiversity is in decline, with one in six species at risk of being lost in Great Britain. This includes almost half of our bird species and a quarter of our mammal species."
        },
        {
            "text": "My name is Danielle and I work in the 30by30 on land team at Defra. We have an important role to play in helping to reverse nature’s decline and supporting biodiversity to recover."
        },
        {
            "text": "Our commitment to protect 30% of land and ocean by 2030"
        },
        {
            "text": "December 2022 saw a historic moment for the planet’s biodiversity, with the agreement of the Global Biodiversity Framework at the UN Biodiversity Summit. I was lucky enough to be part of the UK delegation in Montreal, to see the negotiations unfold."
        },
        {
            "text": "At the heart of the negotiations was the proposed “30by30” target, aiming to ensure that at least 30% of the Earth’s land and ocean would be effectively conserved and managed by 2030. This target was agreed as part of an ambitious framework aiming to halt and reverse global biodiversity loss."
        },
        {
            "text": "The target isn’t an expectation for every country to protect 30% of its lands and seas. But, as a leading voice calling for a global 30by30 target, the UK Government committed to deliver this target nationally."
        },
        {
            "text": "My team has been working to ensure that this commitment helps to drive the conservation and recovery of England’s terrestrial, freshwater, and coastal habitats."
        },
        {
            "text": "England’s progress one year on"
        },
        {
            "text": "In December 2023, one year after the global 30by30 target was agreed, Defra published an update on England’s progress so far. This included an indicative map showing that 8.5% of land in England currently counts towards the 30by30 commitment, as well as draft criteria for additional land that could contribute towards the target."
        },
        {
            "text": "This update stated that 30by30 on land in England should take a collaborative, bottom-up approach. This way, delivery would be led by those who are driving nature’s recovery on the ground and drawing on the support and expertise of external partners."
        },
        {
            "text": "Establishing a cross-sector working group"
        },
        {
            "text": "Building on the momentum following the map’s publication, in February this year we established a dedicated 30by30 stakeholder working group, to seek views to help us develop our approach."
        },
        {
            "text": "The group required a significant time commitment, so we were delighted by the number and range of organisations that were willing to take part - with representatives from various sectors including farming, water, nature conservation, transport, and more."
        },
        {
            "text": "So far, we’ve held 6 “deep dive” sessions with the group and are hugely grateful for the level of engagement and enthusiasm we’ve seen. Below, I’ve shared some reflections on this approach, including feedback we’ve heard from working group members."
        },
        {
            "text": "Open and positive discussions"
        },
        {
            "text": "The working group provides a forum for stakeholders to share views and practical experience that could help us to shape and inform England’s approach to 30by30."
        },
        {
            "text": "This includes recognising the barriers to long-term management commitments, like short-term funding cycles, which could make it challenging for landowners and land-managers to meet the “protection” aspect of the draft 30by30 criteria."
        },
        {
            "text": "It was evident that there needs to be scope within the criteria and our approach to recognise the wide range of management types and processes with potential to contribute."
        },
        {
            "text": "We also heard how crucial it is that 30by30 sets an ambitious standard that will drive the scale of nature recovery England needs, and which reflects the global target. It was recognised that advice and support will be key to enable many landowners to meet this standard."
        },
        {
            "text": "Next steps"
        },
        {
            "text": "Between February and April, the working group moved at quite a pace. We’re now giving members a well-earned rest as we reflect on what we’ve heard and consider the best way forward with our colleagues in Government."
        },
        {
            "text": "We look forward to sharing an update with the working group and wider stakeholders in the coming months, to provide greater clarity and guidance on what land can contribute towards 30by30 and undertake some initial piloting."
        },
        {
            "text": "For now, we’d like to give thanks (again) to those individuals and organisations that dedicated their time to help us develop our thinking on 30by30, and we look forward to continuing to work together to ensure nature’s recovery."
        }
    ]
}