{
    "url": "https://environmentagency.blog.gov.uk/2024/10/22/discover-your-local-river-and-contribute-to-citizen-science/",
    "title": "Discover your local river and contribute to citizen science!",
    "authors": [
        "defrablogs"
    ],
    "categories": [
        "Nature",
        "Rivers",
        "Water"
    ],
    "pub_date": "2024-10-22T08:12:11+00:00",
    "content": [
        {
            "text": "September was a fantastic month for bringing communities and stakeholders together in celebration of our rivers. There were events across the country as part of World Rivers Day on 22 September, seasonal mass monitoring of our rivers through national citizen science initiatives such as The Rivers Trust’s The Big River Watch and Earthwatch’s Great UK Waterblitz, and the launch of the Environment Agency’s Water Hub!"
        },
        {
            "text": "We need to continue and build on this level of engagement, support and interest with our water environment to better understand the pressures our water environment is facing and work together to improve the health of our rivers."
        },
        {
            "text": "The Environment Agency is committed to working collaboratively and through the Supporting Citizen Science project, we are working with a range of partners, projects and citizen science programmes to understand the different methods and approaches of citizen science monitoring the water environment and exploring how this data and information can be used by the organisation."
        },
        {
            "text": "We are launching our Supporting Citizen Science information pagewhich provides further information on our project, who we are working with and will signpost to citizen science monitoring guidance."
        },
        {
            "text": "In the continued spirit of World Rivers Day, we would encourage you to find out more about your local water course, and if you are able to, get involved and take part in citizen science."
        },
        {
            "text": "There are lots of ways to get involved …."
        },
        {
            "text": "Get involved with our Hello Lamp Post pilot!"
        },
        {
            "text": "We are excited to announce the launch of our Hello Lamp Post citizen science project."
        },
        {
            "text": "Part of the Environment Agency’s Supporting Citizen Science project, Hello Lamp Post invites local residents and visitors at selected sites across the country to chat to their local beach, river or lake using the Hello Lamp Post artificial intelligence platform. QR signage at these pilot locations will prompt a text conversation, and the beach, river or lake will share the latest news from local Environment Agency monitoring and signpost to local work we are involved in across the area. We hope this will be more than a one-way conversation, with residents and visitors contributing to citizen science by sharing their own observations from these sites."
        },
        {
            "text": "The information from these conversations will help us to understand who visits these sites and how this varies over time. It will also provide us with information on water quality observations and any signs of pollution."
        },
        {
            "text": "If you live near any of the following locations, look out for our Hello Lamp Post signs. We would love to hear from you!"
        },
        {
            "text": "If you are not local to these sites, don’t worry. See below for some of the other ways you can get involved with citizen science."
        },
        {
            "text": "You can still take part in the Rivers Trust's Big River Watch!"
        },
        {
            "text": "If you’re new to citizen science and keen to get involved, take part in The Rivers Trust’s Big River Watch. This survey encourages mass participation in spring and autumn, however it remains open all year round, so you can find a time to take part that suits you! Just download the app and head out to your local river where you can follow the survey on your phone and answer questions about what you can see and how you feel. The Rivers Trust will use this information to help build a national picture of river health."
        },
        {
            "text": "Commit to monitoring our rivers more regularly"
        },
        {
            "text": "The Riverfly Partnership is a network of organisations that offer a range of freshwater citizen science monitoring initiatives. It is hosted by the Freshwater Biological Association and supported by the Environment Agency. They provide full training and carry out regular site surveys. To get involved, contact the Riverfly Partnership to join one of the many local Riverfly monitoring groups across the country or establish a new one near you. "
        },
        {
            "text": "Already involved in citizen science?"
        },
        {
            "text": "We would love to hear from you! What type of citizen science are you involved in?"
        },
        {
            "text": "Through our feedback survey, you can share information on the citizen science you are involved in, provide feedback on our Supporting Citizen Science information page and suggest information or guidance from the Environment Agency that would help to support citizen science. The feedback survey is open until 31 December 2024."
        },
        {
            "text": "We can all play a part and by working together collaboratively, we can increase the knowledge and evidence needed to improve, enhance and protect our environment, now and for the future."
        }
    ]
}