{
    "url": "https://mhclgmedia.blog.gov.uk/2024/10/22/employment-rights-bill-is-pro-growth-pro-business-and-pro-worker/",
    "title": "Employment Rights Bill is “pro-growth, pro-business and pro-worker”",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Workers' rights"
    ],
    "pub_date": "2024-10-22T15:46:15+01:00",
    "content": [
        {
            "text": "The Employment Rights Bill returned to the House of Commons for its second reading yesterday (Monday 21 October). It continues to attract significant media attention, as shown by today’s front pages, which all lead on the bill’s impact assessment published yesterday and words from the Deputy Prime Minister Angela Rayner telling Parliament how the bill will benefit ten million working people across the country."
        },
        {
            "text": "In an op-ed for today’s I News the Deputy PM reflected on her time as a mother and care worker struggling on unpredictable hours – and how new protections in the bill will save the lowest paid workers up to £600 a year in lost income from cancelled or shortened shifts. She said: “My fight to support others out of insecurity into stability and restore respect is deeply personal. I know how it feels, and I’ve been there. Now I am at the Cabinet table, I am determined to deliver for the millions of people in the position I was once in.”"
        },
        {
            "text": "The Mirror highlights that the government’s analysis shows 2.4 million people in the UK work irregular patterns like zero or low hours contracts or agency work. New protections like guaranteed hours and giving reasonable notice or compensation for lost work will help workers save money on hidden costs like expensive childcare or transport from last-minute notice of shifts."
        },
        {
            "text": "Many workers in the North and Midlands where more people struggle with insecure hours will benefit from these changes, an angle covered by Birmingham Live, Liverpool Echo and Yorkshire Post."
        },
        {
            "text": "Most headlines today including the Financial Times and Guardian also pick up on the cost to employers – most of which will be a transfer from businesses to their workers, which we expect to be in the low billions of pounds per year. Put in context, this amounts to costing only 0.4% of the total £1.3 trillion pay bill paid by UK businesses annually. The impact assessment also concludes the bill could have a direct and positive impact on economic growth, and by boosting protections and quality of work for the lowest paid, will help raise living standards for families and communities across the UK."
        },
        {
            "text": "As the Deputy PM recently wrote in the Financial Times, “all the best businesses know that their greatest asset is their people”."
        },
        {
            "text": "Speaking in Parliament, the Deputy Prime Minister said:"
        },
        {
            "text": "“This landmark Bill—pro-growth, pro-business and pro-worker—will extend the employment protections given by the best British companies to millions more workers…"
        },
        {
            "text": "“Almost 9 million employees will benefit from protection against unfair dismissal from day one, 1.7 million will benefit from new policies on flexible working, and up to 2 million will receive a right to bereavement leave. Thousands of pregnant women and mothers will benefit from new maternity protections, and tens of thousands of fathers and partners will be brought into the scope of paternity leave. We will deliver a genuine living wage that matches the cost of living..."
        },
        {
            "text": "“If you are working hard on low pay and struggling to make ends meet, this Government are delivering for you…"
        },
        {
            "text": "“Our reforms are ambitious—they have to be to bring real change. But we have engaged extensively and will continue to do so.”"
        }
    ]
}