{
    "url": "https://hmlandregistry.blog.gov.uk/2024/10/22/the-scale-and-cost-of-requisitions/",
    "title": "The scale and cost of requisitions",
    "authors": [
        "Ilia Bowles, Head of Directorate Planning, HM Land Registry Service Delivery"
    ],
    "categories": [
        "Law and practice"
    ],
    "pub_date": "2024-10-22T15:30:54+01:00",
    "content": [
        {
            "text": "In part one of this blog, we explored how HM Land Registry is reducing the number of requisitions we send and why this is important not only for us but also for you, our customers. "
        },
        {
            "text": "In part two, we’re going to look more closely at why we are so intent on driving down requisitions. Surely a couple of typos and a missing date in a transfer, or a black-and-white plan that’s not signed, cannot cause too many problems. "
        },
        {
            "text": "The simple fact is, they do. And the main problem is: requisitions lead to delays. "
        },
        {
            "heading": 2,
            "text": "The impact of requisitions"
        },
        {
            "text": "We are not in any way suggesting errors such as these are the sole cause of longer processing times but they are a significant contributing factor.  "
        },
        {
            "text": "We’ve looked at how many requisitions we send in relation to just 10 simple groupings of mainly administrative errors and omissions, which we refer to as “avoidable”. The chart shows the actual number of requisitions sent over each error type from October 2023 to September 2024 – all together more than 600,000 points. "
        },
        {
            "text": "Our economists examined how much it costs conveyancers to rectify a mistake in a simple application to update the register, such as a straightforward transfer or remortgage. Based on average pay levels in the sector, they calculated a sum of between £5 for each “avoidable” clerical error and £30 for issues that involve chasing third parties for a document or consent, for example. Multiplied across all firms, these ‘minor mistakes’ become hugely expensive, costing the industry anything between £3.2 million and £19.1 million every year.  "
        },
        {
            "text": "The chart below shows a breakdown of the estimated costs of the most common requisition types. They also add on average 15 working days to the time it takes for the transaction to be registered."
        },
        {
            "text": "It also takes HM Land Registry time and resources to manage and resolve these requisitions. We are sure you can appreciate the impact they have on the number of applications awaiting responses, and in taking our staff away from processing others."
        },
        {
            "heading": 2,
            "text": "How we can help"
        },
        {
            "text": "Errors and omissions affect how quickly we can complete an application. We  recognise there have been some issues at our end, and we’ve talked about the measures we’re taking to reduce the amount of requisitions we raise. We’ve also talked about the support available to customers in making complete and correct applications.  "
        },
        {
            "text": "We are also actively exploring ways to make our data more accessible and meet your current and future needs. This includes empowering you to self-serve and further understand your own requisition rates, while ensuring you have the information you need to make actionable improvements – for the benefit of your business and ours.  "
        },
        {
            "heading": 2,
            "text": "A shared goal – let’s do this! "
        },
        {
            "text": "It’s clear that the only way we’re going to bring down the sheer number of requisitions as much as we all need is by continuing to work together.   "
        },
        {
            "text": "If you have any feedback or suggestions – or if you’d like to share your success in reducing requisitions in a case study – please get in touch with us at CustomerCommsTeam@landregistry.gov.uk. "
        },
        {
            "text": "Please scan the QR code below or visit the HM Land Registry training hub on GOV.UK for free training and support resources from HM Land Registry."
        }
    ]
}