{
    "url": "https://insideDIO.blog.gov.uk/2021/10/20/celebrating-construction-and-facilities-management-award-successes/",
    "title": "Celebrating construction and facilities management award successes",
    "authors": [
        "DIO communications team"
    ],
    "categories": [
        "Construction",
        "Defence Training Estate (DTE)",
        "Facilities Management"
    ],
    "pub_date": "2021-10-20T17:26:42+00:00",
    "content": [
        {
            "text": "This month, DIO and our industry partners are celebrating several successes in prestigious award schemes across the British construction and facilities management sectors."
        },
        {
            "text": "At the 2021 Institute of Workplace and Facilities Management (IWFM) Impact Awards, our partners Mitie and Sodexo were recognised for their delivery of hard and soft Facilities Management (FM) services which are making a real difference to our Defence customers. Meanwhile, two major construction projects which DIO has played a key role in delivering came top of their categories at the 2021 British Construction Industry Awards and National Environment Agency Awards respectively."
        },
        {
            "heading": 2,
            "text": "Sodexo’s services at Village, Worthy Down"
        },
        {
            "text": "Our partners Sodexo won the Workplace Experience category of the IWFM Impact Awards for the soft FM services they are providing for personnel at Worthy Down Station, Hampshire."
        },
        {
            "text": "Working closely with DIO and our military partners, Sodexo has created ‘Village’, a one-stop catering, retail and leisure facility which has been developed to improve the lived experience of service personnel. The facility was designed with a strong focus on wellbeing and includes a social and meeting lounge, a micro theatre and a gaming area to bring people together and encourage engagement and collaboration."
        },
        {
            "text": "With a ‘high street’ feel, Village has been specifically designed to meet the needs and expectations of the young student demographic at Worthy Down, and is an excellent example of how DIO is working with our partners to meet the current and future needs of Royal Navy, Army, and Royal Air Force personnel."
        },
        {
            "heading": 2,
            "text": "Facilities management support to Permanent Joint Operating Bases (PJOBs)"
        },
        {
            "text": "DIO and Mitie won the Collaboration category of the IWFM Impact Awards, for the provision of facilities management services to British Forces Permanent Joint Operating Bases (PJOBs)."
        },
        {
            "text": "Through the PJOBs Infrastructure Service Provider (ISP) contract, DIO works with Mitie and our supply chain partners to deliver facilities management services across four sites of key strategic importance: Ascension Island, the Falkland Islands, Cyprus and Gibraltar. The services provided range from ground and airfield maintenance, to accommodation and Nuclear and marine support."
        },
        {
            "text": "Operating in locations as remote as Ascension Island and the Falklands brings unique logistical and climatic challenges. To overcome these, our partnership with Mitie involves collaborative working behaviours which the judges recognised as leading the way amongst the central government and Defence community."
        },
        {
            "heading": 2,
            "text": "The Northern Ammunition Jetty refurbishment project"
        },
        {
            "text": "At the British Construction Industry Awards, DIO and VolkerStevin won the Upgrade and Renewal Project of the Year for the refurbishment of the Northern Ammunition Jetty in Glen Mallan, Scotland."
        },
        {
            "text": "The project, which was also awarded Best Infrastructure Project at the 2020-2021 Scottish Civil Engineering Awards, is vital to the Royal Navy’s £7bn Queen Elizabeth Carrier (QEC) programme and will help to keep our country safe for decades to come. The work included upgrades the jetty structure as well as the installation of new infrastructure, all of which will support the Royal Navy’s surface fleet and aircraft carriers in loading and unloading ammunition. In delivering the project ahead of schedule against the backdrop of challenges including harsh winter weather conditions and Covid-19, DIO and VolkerStevin set a new benchmark for collaborative working on complex Defence maritime projects."
        },
        {
            "heading": 2,
            "text": "The Hythe Ranges Sea Defences project"
        },
        {
            "text": "The Hythe Ranges Sea Defences project, a joint initiative between the Environment Agency (EA), the Department for Environment, Food and Rural Affairs (Defra), DIO and local authorities, won the EA 2025 Award at the National Environment Agency Awards."
        },
        {
            "text": "The judges were impressed by the collaborative approach between DIO, the Environment Agency and partners, which was key in delivering the vital improvements to coastal flood defences in the area between Hythe and Dymchurch on the south Kent coast. Most of this land is owned and operated by the Ministry of Defence (MOD) as a live firing range, but the renovation work has also reduced the risk of flooding to 1,000 properties and protected critical local infrastructure."
        },
        {
            "text": "A huge congratulations to all of our partners and suppliers whose hard work for the benefit of the UK Armed Forces has been recognised in awards this month. The breadth of winning projects is a testament to the scope of work that DIO and our industry partners are constantly delivering for Defence across the hard FM, soft FM, construction and environmental sectors."
        }
    ]
}