{
    "url": "https://ipo.blog.gov.uk/2021/10/20/crowdsourcing-brings-gender-neutrality-to-a-legacy-manual/",
    "title": "Crowdsourcing brings gender neutrality to a legacy manual.",
    "authors": [
        "Philip Lawrence"
    ],
    "categories": [
        "Inclusion and diversity",
        "Patents"
    ],
    "pub_date": "2021-10-20T14:51:20+01:00",
    "content": [
        {
            "text": "A team of more than 40 ‘crowdsourced’ patent examiners took on the task of upgrading all 1,028 pages of the IPO’s 35-year-old Manual of Patent Practice. Their aim was to refresh its dated language and make it inclusive. Senior Patent Examiner Phil Lawrence tells us more. "
        },
        {
            "heading": 4,
            "text": "Some background "
        },
        {
            "text": "It is a proud claim of the Intellectual Property Office, trading name for the Patent Office, that it has been responsible for intellectual property rights in the UK for more than 140 years. During that time, good patent practice and knowledge have been documented to inform the generations of patent examiners that followed. In the mid-eighties, the forerunner of today’s ‘Manual of Patent Practice’ (MoPP) under the Patents Act 1977 was established.  "
        },
        {
            "text": "Today, we live in a very different world. In the intervening decades, society, and its language, has become more inclusive. The tone of TV comedies has changed, the percentage of women inventors worldwide (though still small) has more than doubled, the need for gender neutral, non-sexist language has been recognised. The time had come for our trusty MoPP, the essential ‘go to’ for every patent examiner, to change.  "
        },
        {
            "heading": 4,
            "text": "What is the Manual of Patent Practice? "
        },
        {
            "text": "The Manual of Patent Practice – MoPP - is the book that covers what patent examiners should be doing when searching and examining patent applications.  If a patent examiner doesn’t know what to do, MoPP is the first place they go. We use it a lot. MoPP also has many sections which are relevant to infringement, ownership of patents and so on, which people outside the IPO use regularly as well. "
        },
        {
            "heading": 4,
            "text": "Our challenge "
        },
        {
            "text": "MoPP is large, spanning some 1,028 pages, and is a combination of many different authors going back many years. Some chapters are updated regularly as they are active areas of law or practice, others less frequently.  As such some of the wording in MoPP can be quite dated.   "
        },
        {
            "text": "It has been known for some time that MoPP wasn’t always inclusive. Patent examiners and applicants were often referred to as he/him, our fictional person for examining certain areas of law was 'the man skilled in the art', even the Comptroller was assumed to be male – despite us having had a female Comptroller."
        },
        {
            "text": "No one doubted it needed changing but how do you update so many pages when you don’t know what needs changing?  It was going to be a massive job for just the MoPP editor to attempt.   "
        },
        {
            "text": "The first 18 chapters, which are more frequently updated, had largely already been changed but there were still 167 chapters (around 600 pages) that needed checking and updating.  You may be thinking that computers and AI could be the solution, but it is trickier than just 'find/replace'.   "
        },
        {
            "text": "[Image] IPO's Manual of Patent Practice assumed the Comptroller to be male despite IPO having had a female Comptroller.Quotations of the Act and court cases, even if using non-inclusive language such as 'the man skilled in the art' or passages referring back to specific people, couldn’t be changed. For example, references to judges, and 'Her Majesty' needed to remain unchanged.  Furthermore, we didn’t even know what other words might exist (for example it turns out 'warehouseman' is used in Chapter 60).  There was the underlying risk that a computer might change something in a way we didn’t intend, that might not get spotted for a year or more. Given the importance of MoPP to how patents are prosecuted and managed, we had to be sure that it was right. "
        },
        {
            "heading": 4,
            "text": "Crowdsourcing the task"
        },
        {
            "text": "On International Pronoun Day 2020 we set ourselves the target of having a gender neutral MoPP within a year. Given the magnitude of the task, we decided to tap into the expertise of our own people by using a crowdsourcing method.  We asked our patent examiners to volunteer to adopt a chapter or two and read them, looking for gendered language. We asked them to suggest suitable amendments.   "
        },
        {
            "text": "Each section was then double checked by another examiner and the changes then signed off by the MoPP editor.   "
        },
        {
            "text": "We were overwhelmed with the number of volunteers. It showed us how important this issue is to our staff. One of the ‘pillars’ of our Corporate Plan is 'making the IPO a brilliant place to work'. It was great to see how our people seized the opportunity to help make our documentation more inclusive. "
        },
        {
            "text": "Today is International Pronoun Day 2021, and we’re pleased to announce that we have met the target.  The team spotted 496 'errors' across 185 sections of the manual and the online version of MoPP has now been updated to reflect all of those changes. "
        },
        {
            "heading": 4,
            "text": "A brilliant place to work"
        },
        {
            "text": "The updating of MoPP is a great example of how bringing people together to improve our services for our customers has contributed to making the IPO a brilliant place to work.  A wider project on language within the IPO is continuing with a team looking at all of our publications and documents to see where improvements can be made. "
        }
    ]
}