{
    "url": "https://mojdigital.blog.gov.uk/2021/10/20/how-i-became-a-delivery-manager-with-moj-digital/",
    "title": "How I became a Delivery Manager with MoJ Digital",
    "authors": [
        "Chris Richardson"
    ],
    "categories": [
        "a great place to work",
        "Delivery Manager",
        "Our services"
    ],
    "pub_date": "2021-10-20T15:22:30+01:00",
    "content": [
        {
            "text": "As a civil servant of nearly 20 years, I thought all of Government was the same. However, just over 4 years ago I discovered a place where things are done a little differently."
        },
        {
            "text": "I work for the Ministry of Justice and have done since before the MoJ existed! The majority of this was in prisons supporting the staff IT systems. By supporting IT, I mean I basically managed the large outsourced contract that was given to a major IT provider and ensured that any changes were raised correctly with the appropriate budget. This was the epitome of the bureaucracy and inefficiency that you had probably read about in the news over the years. Hardware and software were old and inefficient and it could take months and large amounts of money to change into something that worked well for the users. Our users mainly thought of the IT systems as a necessary evil and longed for the days when they could keep their records on paper, or better still on the wall of their wing office and could update with a chinagraph pencil (my dad was a prison officer and he still laments the decline of the chinagraph pencil even though these days he mostly uses an iPad)."
        },
        {
            "text": "Then everything changed for me. It was at one of our all-staff meetings when there was a demonstration of the new visits booking software by the digital team. Going into the demo with the cynicism of the weary IT Manager who had seen so many ideas fail not because they were bad, but because they hadn’t taken into consideration the unique environment that prison is and traditionally you can’t just do things like this. This was different though. The team had spoken to the users of the system, and not just the senior managers who think they know what the users should do, the actual users of the system. And not just the users who are booking the visits, the people who want to book visits."
        },
        {
            "text": "They spent time looking at the problem and coming up with what they thought was a solution they wanted to try out and then iterate on. Additionally, they wanted our help in the prisons to make sure they got it right. Furthermore, they didn’t work for a large corporation looking to make money out of this, they too were civil servants like me, and as one of my colleagues told me at the time “they look happy and they use Macs!” That was my first realisation that Government IT didn’t have to be what I had known for so long."
        },
        {
            "text": "Fast forward several years and I am now a Delivery Manager, having worked with some of the most important teams in MoJ Digital who not only change peoples lives but also keep the country safe from terrorists and organised crime, but the thing that remains constant through the teams is the belief that we are always doing the right thing, and we are doing it the right way. Is that all down to me? I would be arrogant to say that it definitely was but I do think that things would be worse without the influence of the Delivery Manager. The attraction of the DM role is that no days are the same. The list of roles you need to cover for the team is huge, from problem solver to bean counter and from coach to process enthusiast. Your job is to help the team wherever they need it to make them a better team and shield them from the things that could distract them, but most importantly to make sure that there is some enjoyment to be had from work. "
        },
        {
            "text": "The other important part of life as a DM is to take responsibility for the organisational change to make the place you work more in tune with your beliefs. If you had asked me a couple of years ago about the importance of fostering a good culture where people clap and appreciate other people’s efforts, I would probably have told you that it wasn’t for me, but I was wrong. Making small changes to appreciate others' work and efforts can massively improve morale and make the workplace a much more enjoyable place to be. Obviously, this is much harder remotely, but doing things to be inclusive with people in and out of your team can make such a difference, and these small differences over time can lead to a change in mindset through the organisation. "
        },
        {
            "text": "It won’t always be an easy journey but eventually, people will start to notice, just like I did, that not only do those digital folks deliver good software and services, but they do it with a smile on their faces - and they have Macs... "
        }
    ]
}