{
    "url": "https://civilservice.blog.gov.uk/2021/10/20/how-to-break-through-in-the-civil-service-our-top-tips/",
    "title": "How to break through in the Civil Service: our top tips",
    "authors": [
        "Amy Tsang, Senior Engagement and Strategic Adoption Manager, Department for International Trade"
    ],
    "categories": [
        "A great place to work",
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "Uncategorized"
    ],
    "pub_date": "2021-10-20T08:56:28+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Colleagues from the Department for International Trade’s Digital, Data and Technology team share their tips for career progression and promotion"
        },
        {
            "text": "Are you stuck in a career cul-de-sac? If so, don’t worry, you’re not alone. Our Diversity and Inclusion group recently found that most civil servants in the Digital, Data and Technology team wanted to know more about how to progress at work and advance their career. As a result, the group started several projects such as a mentor network and inspiring career events. "
        },
        {
            "text": "Along with my colleagues Elle Panes and Rachael Robinson, we created a workshop inviting people from all grades and professions to join. We wanted to host an open, frank discussion about promotions, interviews and applications and invited our colleagues to speak freely about their experiences."
        },
        {
            "text": "Below, our speakers give their professional take on how to win your next promotion."
        },
        {
            "heading": 4,
            "text": "Arthi Vish, Talent Acquisition Lead"
        },
        {
            "text": "You might think that as long as you keep doing your job, promotion to a higher grade will come naturally. Unfortunately, this doesn’t happen automatically within the Civil Service. You really do have to actively apply for roles advertised both internally and externally – and don’t just apply for one role."
        },
        {
            "text": "Use every opportunity to go the extra mile, demonstrate your commitment and remember to:\n"
        },
        {
            "text": "◼︎Communicate your career goals and actively seek opportunities that will help you plan and fulfil them."
        },
        {
            "text": "◼︎Gain experience through lateral moves to gain varied experience"
        },
        {
            "text": "◼︎Demonstrate behaviours such as continuous learning, collating regular feedback and showing passion for your work by seeking 'stretch' roles."
        },
        {
            "text": "To prepare your application (including a cover letter), read the job advert thoroughly to highlight and consider the essential skills, experience and behaviours required for the role.\n"
        },
        {
            "text": "During interviews, be prepared to discuss Success Profiles and how you fulfil them. You will need to give examples of essential skills, experience and behaviours demonstrated in your current and previous roles. Don’t forget to sell yourself and your individual achievements and goals - right from the application stage of the process.\n"
        },
        {
            "heading": 4,
            "text": "Anais Reding, Chief Engagement and Design Officer"
        },
        {
            "text": "I was asked to talk about my experience of moving from Grade 6 to the Senior Civil Service. I was recently promoted to SCS1 in the Digital, Data and Technology Directorate, having started my career in policy and joining government a few years in at HEO level. Some promotions were easier than others for me, and I wanted to encourage colleagues with some insight I was given."
        },
        {
            "text": "Did you know that at the more senior levels, it’s not uncommon for people to submit 30+ applications before being successful? When you work towards that number, overcoming rejection becomes normal and you recognise part of it is being in the right place at the right time. And when you think retirement comes in your sixties, we all have plenty of opportunities to progress in our careers."
        },
        {
            "heading": 4,
            "text": "Careers, not jobs "
        },
        {
            "text": "This workshop has kickstarted many insightful conversations about making the move up into a new grade. I believe this is an important subject to approach. I was personally surprised at the open and honest conversations about career progression at the Department of International Trade. "
        },
        {
            "text": "This encourages me to think about my long-term career goals at DIT as well as inspire colleagues around me to progress, not just in their current jobs but in their long-term careers."
        },
        {
            "text": "◼︎ Find out more about the DDaT DIT team by visiting their Digital Trade blog."
        }
    ]
}