{
    "url": "https://buyingforschools.blog.gov.uk/2021/10/20/schools-sustainability-day-2nd-november-2021/",
    "title": "Schools Sustainability Day, 2nd November 2021",
    "authors": [
        "Arati Patel-Mistry, Stakeholder and Engagement Manager, Schools Commercial Team"
    ],
    "categories": [
        "Services"
    ],
    "pub_date": "2021-10-20T14:34:47+01:00",
    "content": [
        {
            "text": "Arati Patel-Mistry, Stakeholder and Engagement Manager in the Schools Commercial Team, talks about what schools can look forward to at the upcoming Schools Sustainability Day."
        },
        {
            "text": "On 2 November our team are holding our first Schools Sustainability Day. We have six individual webinars planned throughout the day – each with a different focus, but all with a shared aim:"
        },
        {
            "text": " “We want to help schools by providing clear and easily understood routes to market, support and enable behavioural change to reduce energy consumption and to facilitate the better use of technology to manage energy more efficiently.”"
        },
        {
            "text": "Join us if you can at one or all of the following sessions."
        },
        {
            "text": "Having had over 25 years’ experience in the education sector and chair of governors of a local primary school, I know the growing challenges school business professionals face every day to balance reducing your carbon footprint with achieving value for money."
        },
        {
            "text": "We have timed our Schools Sustainability Day to coincide with the United Nations Climate Change Conference, also known as COP26 to be held in Glasgow between 31 October and 12 November 2021 as we know this will feature within your school’s curriculum."
        },
        {
            "text": "Our schedule of webinars is planned to help school business professionals and schools find out more about ways we can help you put in place measures that will help towards reducing your school’s energy consumption and carbon footprint."
        },
        {
            "text": "We have joined with experts from Business, Energy and Industrial Strategy (BEIS) and suppliers from a number of DfE approved frameworks; including CCS, YPO, Fusion21 and CPC who will provide information from the use of smart meters to energy efficient heating systems, buying energy and how to reduce your consumption."
        },
        {
            "text": "Paul Wyse from our Risk Management Service will talk about how you can use water more efficiently and reduce waste. If your school is in an area prone to flooding, he will talk about what can be done to increase resilience and reduce the risk of lost school’s days."
        },
        {
            "text": "The DfE schools water project team want to work proactively with schools to help increase pupil and staff awareness, supporting them to mitigate and adapt to water related risks from the current and future climate."
        },
        {
            "text": "I’ve led on organising the Schools Sustainability Day as this is an area I feel passionately about. Working together we can make a difference, and by attending this event you’ll be able to increase your own awareness as well as learn how you can support pupils to become more aware of how they can support sustainability efforts."
        },
        {
            "text": " "
        }
    ]
}