{
    "url": "https://socialcare.blog.gov.uk/2021/10/20/social-care-reform-is-a-shared-endeavour/",
    "title": "Social care reform is a shared endeavour",
    "authors": [
        "Jackie O'Sullivan"
    ],
    "categories": [
        "Carers",
        "Guidance",
        "Social care reform"
    ],
    "pub_date": "2021-10-20T17:41:51+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Engagement stands the test of time"
        },
        {
            "text": "I wasn’t in the sector when the Care Act passed through Parliament, but I have since been struck by the affection people have for it. It’s rare for any piece of legislation to be so universally endorsed and supported."
        },
        {
            "text": "That such a wide range of stakeholders – including many people with lived experience – were involved in its development, is surely one major reason for its enduring strength. Moreover, the Act itself set out how co-production – a major tenet of the enterprise we are now embarking on - should be used in the delivery of better care."
        },
        {
            "text": "When it became clear long promised social care reforms were on the horizon, we were greatly cheered by the Department of Health and Social Care (DHSC)’s intention to use the Care Act as its model for talking to the sector."
        },
        {
            "text": "Care sector engagement has got off to a really positive start. DHSC’s social care team have made a huge effort to make themselves available to answer questions and listen to views from organisations and charities, including mine, Mencap."
        },
        {
            "text": "The engagement is genuine and it does feel like we have a common purpose. Myself and other representatives from disability support groups, recently met with this team to discuss the intricacies of the reforms."
        },
        {
            "text": "The conversation was open, frank and constructive. We discussed how people pay for their care and contemplated what a reformed adult social care system should look and feel like for working age disabled adults. Their care needs are quite different to those of older people and a measure of the reforms’ success will be the ability to support this often forgotten group."
        },
        {
            "heading": 2,
            "text": "Concentrating minds on co-production"
        },
        {
            "text": "The Government’s commitment to bring forward a White Paper later this year makes the timescales frighteningly tight, and it will be hard to achieve thorough co-production with people with lived experience – especially if we are to solicit views from a wide range of care users, including people who aren’t part of existing groups. But we have real momentum and we will do all we can to engage broadly, because their views are vital. If we are to get this right, their experiences, needs and aspirations must influence the process of reform for the better."
        },
        {
            "text": "There remain persistent challenges of perception. Even people who need care, provide informal care or already receive it, don’t necessarily identify with being social care users. This is especially the case for people who do not live in care homes or supported living settings.  People talk about going to ‘clubs’ not ‘receiving day services’, they have ‘someone who comes round to help’ not ‘dom care’. Some might even go on ‘holiday’, while their families get some ‘respite’ from their caring responsibilities."
        },
        {
            "text": "It is really important we gather the broadest range of insights and views. It becomes even harder when tackling issues about access to care, especially in communities where care is delivered by families and the idea of accepting help from outsiders is alien. Striking the right balance between getting it done and getting it right will be very difficult, but there is a collective will to do our best."
        },
        {
            "heading": 2,
            "text": "Comfort in common ground"
        },
        {
            "text": "While the devil will inevitably be in the detail, the other striking thing is the remarkable degree of consensus about what reform should focus on. We all agree the system needs to change, that fairness must be prioritised, and that we should do all we can to prevent vulnerable people slipping through the net. We all agree resourcing is a central issue. We all agree care workers deserve decent pay and unpaid carers enhanced support. We also agree care needs to be tailored to individuals."
        },
        {
            "text": "It is this last point of agreement which is most important. When asked what we want, the chorus of ‘more money’ is loudest; the acute needs of the sector drowning out the important principle which made the Care Act so strong."
        },
        {
            "text": "Whilst some of the problems we are experiencing are created by a dysfunctional market (supermarkets can put up prices so they can pay hauliers more – care providers can’t do that in order to attract and retain its key workers), it is worth tapping into marketing expertise to model the customer experience."
        },
        {
            "text": "We need to gather insight, conduct market research and use product development principles to get to the heart of what people want and then create services around them. In the same way reading this blog may lead you to search more articles about social care, wouldn’t it be amazing if the system was truly responsive to people’s needs without them even having to ask?"
        },
        {
            "heading": 6,
            "text": "[The views expressed in this blog are those of Jackie O'Sullivan and Mencap]"
        }
    ]
}