{
    "url": "https://kingsawards.blog.gov.uk/2018/08/03/queens-award-like-rocket-fuel-for-twinkl/",
    "title": "Queen’s Award like rocket fuel for Twinkl",
    "authors": [
        "Jon Seaton"
    ],
    "categories": [
        "International trade",
        "Recipients"
    ],
    "pub_date": "2018-08-03T08:00:08+01:00",
    "content": [
        {
            "text": "Guest post by Jon Seaton, CEO and Founder of Twinkl."
        },
        {
            "text": "Everything we do at Twinkl is to help those who teach. We’re an online educational publisher - with over 500,000 resources on our website from worksheets and flashcards to interactive presentations, videos and display materials."
        },
        {
            "text": "We received the Queen’s award for International Trade in 2018 and in terms of recognition it has been like rocket fuel. It has helped us to recognise our staff for their achievements and thank the teaching community we work with. Holding the award for the next five years will now support us as we continue to grow our offering to teachers across the globe."
        },
        {
            "heading": 2,
            "text": "Twinkl started with a spark"
        },
        {
            "text": "Twinkl was created 8 years ago when my wife, Susie, was working as a school teacher and could not find any resources she needed for her lessons online. Extensive searches by us both showed that these were either unavailable or were not good quality. I remember thinking that if I was a parent I would not have been happy for the materials that were online back then being used to teach my child."
        },
        {
            "text": "As a result Susie was having to spend her evenings and weekends making her own resources. Along with planning lessons, marking, reporting and the host of other responsibilities that come with teaching, she was working well into the night. Speaking to her colleagues and friends, Susie found that she was not alone in her situation."
        },
        {
            "text": "This is what sparked the idea for Twinkl and what led to us creating and publishing our own high quality teaching resources online. It began as a small enterprise that we operated on an 'after work' basis, but quickly grew as educators embraced the teacher created learning materials we were providing. We now have over 500,000 resources on our website, a team of over 470 amazing staff members and customers in 168 different countries. We’re really proud to be able to help those who teach across the world and are thrilled to have received a Queen’s Award for Enterprise in recognition of this."
        },
        {
            "text": "We could not have come this far and received the award without the support and guidance of the wonderful teaching community we work with. The engagement and feedback we receive from those who teach drives everything we do. Along with our team, it is our teaching community that has helped us share our message and reach teachers across the world."
        },
        {
            "heading": 2,
            "text": "Why we applied for the Queen’s Award"
        },
        {
            "text": "After experiencing a high level of growth in our international markets we knew that there was a lot we could say for International Trade category in particular. We had fairly recently opened our office in Australia and had made great strides in new parts of the world, including the Ascension Islands, Cayman Islands and Bermuda so it felt the right time for us to try and get this recognised. We did this in the best way we knew of, which was of course by applying for the Queen’s Award for International Trade."
        },
        {
            "text": "Winning the award was one of those milestone moments for us. To have the award is a true reflection of the brilliant work our teams do on a daily basis to make a real difference in helping teachers around the world."
        },
        {
            "text": "The whole Twinkl team were thrilled and as soon as we had announced our success internally we got straight on with planning how we could let people outside of Twinkl know about the award. We now have a banner in our reception with the emblem on and of course have spread the word on our website and across social media. You can read our blog post about it."
        },
        {
            "text": "The award has already helped us to recognise our staff and our teacher community. We celebrated at our head office in Sheffield with a lunch fit for a king or queen and made sure we thanked our customers for all their support."
        },
        {
            "text": "We are delighted that every Twinkl resource now comes with a royal stamp of approval. We are now also hoping that it will support us as we work to expand into new markets and countries and grow our offering in Australia from our office there."
        },
        {
            "text": "The Queen’s Award for Enterprise is such a prestigious form of recognition and we’re honoured to have Twinkl’s work in International Trade acknowledged in this way. I really can’t overstate the significance of winning this award - it’s incredible!"
        },
        {
            "text": "Subscribe to updates from this blog, or follow us on Twitter and LinkedIn."
        }
    ]
}