{
    "url": "https://homeofficemedia.blog.gov.uk/2023/10/29/police-use-of-facial-recognition-factsheet/",
    "title": "Police use of Facial Recognition: Factsheet",
    "authors": [
        "Home Office news team"
    ],
    "categories": [
        "Fact sheet"
    ],
    "pub_date": "2023-10-29T10:25:04+00:00",
    "content": [
        {
            "text": "This factsheet provides information on police use of facial recognition technology."
        },
        {
            "heading": 2,
            "text": "Types of facial recognition  "
        },
        {
            "text": "  The police use three types of facial recognition:  "
        },
        {
            "heading": 2,
            "text": "Retrospective Facial Recognition"
        },
        {
            "text": "RFR is used after an event or incident as part of a criminal investigation. Images are typically supplied from CCTV, mobile phone footage, dashcam or doorbell footage or social media. These images are then compared against images of people taken on arrest to identify a suspect.  "
        },
        {
            "text": "When there is a possible RFR match, a trained operator reviews the images to confirm it. An investigating officer also reviews the match to confirm accuracy.  "
        },
        {
            "text": "The investigating officer will consider all of the evidence available and follow up all reasonable enquiries as in any normal investigation.  "
        },
        {
            "text": "This is a key tool for the police to identify suspects more quickly and accurately.  It can also help identify missing or deceased people.  "
        },
        {
            "text": "A South Wales Police study found that without RFR identifications take around fourteen days, whereas with it they typically take minutes.   "
        },
        {
            "text": "All police forces use the Police National Database facial search facility.  "
        },
        {
            "heading": 3,
            "text": "Real life examples of how forces use this technology to catch criminals and keep people safe include:  "
        },
        {
            "heading": 2,
            "text": "Live Facial Recognition"
        },
        {
            "text": "Live Facial Recognition (LFR) enables police to identify wanted people, a core part of policing. Every day, police officers are briefed with images of suspects to look out for. Over many years, officers have spotted individuals from these briefings and taken action to keep the public safe.  "
        },
        {
            "text": "LFR does what the police have always done but much more quickly and with greater accuracy.  "
        },
        {
            "text": "All deployments are targeted, intelligence-led, time-bound, and geographically limited. It lets forces place their effort where it is likely to have the greatest effect. Before a deployment, the police will inform the public where they intend to use the technology and where they can obtain more information on its use.  "
        },
        {
            "text": "The technology uses live video footage of crowds passing a camera and compares their images to a specific list of people wanted by the police.  The technology can precisely pick a face out of a dense crowd, something which would be impossible for an officer to do. It means the police can quickly and accurately identify wanted criminals and take them off the streets. "
        },
        {
            "text": "Following a possible LFR alert, it is always a police officer on the ground who will decide what action, if any, to take.  As with normal investigations, the investigating officer must form reasonable grounds to suspect the person identified is responsible for the commission of an offence and that there is justification for an arrest.  The standard procedures for investigation, evidence collection, arrest, charge, and prosecution are followed.  "
        },
        {
            "text": "If the LFR system does not make a match with the watchlist, a person’s biometric data is deleted immediately and automatically.  The watchlist is destroyed after each operation.   "
        },
        {
            "text": "It is an operational decision for individual police forces whether, how and when to use the technology, in line with the College of Police Authorised Professional Practice. To date, South Wales Police (SWP), the Metropolitan Police Service (MPS) and Northamptonshire Police have used LFR.    "
        },
        {
            "heading": 3,
            "text": "Real life examples include:   "
        },
        {
            "heading": 2,
            "text": "Operator Initiated Facial Recognition (OIFR)  "
        },
        {
            "text": "OIFR is a mobile App that allows officers, after engaging with a person of interest, to photograph them and check their identity where they are not sure, without having to arrest them and taken them into custody.   "
        },
        {
            "text": "It is at the early trial stage but has been showing positive results.  "
        },
        {
            "heading": 2,
            "text": "Frequently Asked Questions"
        },
        {
            "heading": 3,
            "text": "Why is the Home Office encouraging the police to make more use of facial recognition technology?  "
        },
        {
            "heading": 3,
            "text": "Didn’t the courts say that police use of live facial recognition was unlawful? "
        },
        {
            "heading": 3,
            "text": "What laws govern police use of facial recognition?  "
        },
        {
            "heading": 3,
            "text": "What safeguards are in place to make sure facial recognition is operated fairly and without bias?  "
        },
        {
            "heading": 3,
            "text": "Is it true that facial recognition is not as accurate with female or non-white faces?  "
        },
        {
            "heading": 2,
            "text": "Related content  "
        }
    ]
}