{
    "url": "https://aphascience.blog.gov.uk/2025/10/22/bse-achieving-negligible-risk-status/",
    "title": "BSE: From crisis to confidence – APHA’s role in achieving negligible risk status",
    "authors": [
        "Timm Konold"
    ],
    "categories": [
        "Prions"
    ],
    "pub_date": "2025-10-22T12:11:26+01:00",
    "content": [
        {
            "text": "In this blog, APHA's Dr Timm Konold, Transmissible Spongiform Encephalopathies Lead Scientist, talks about how APHA led the charge against BSE, combining science and action to protect the public, support farmers, and earn the UK a clean bill of health."
        },
        {
            "text": "In the world of animal health, few acronyms carry as much historical weight as BSE (Bovine Spongiform Encephalopathy). Known more widely as ‘mad cow disease’, BSE is a neurodegenerative disease in cattle that first emerged in the United Kingdom (UK) in the 1980s. It not only reshaped farming practices but also had profound implications for public health, food safety, and international trade."
        },
        {
            "text": "In June 2025, the UK* achieved a major milestone in animal and public health: the World Organisation for Animal Health (WOAH) officially recognised the UK as having negligible risk status for classical BSE. This marks the culmination of nearly four decades of scientific vigilance, regulatory rigour, and collaborative effort, much of it led by the Animal and Plant Health Agency (APHA)."
        },
        {
            "text": "As someone who has worked on BSE for many years, I am proud to reflect on the journey that brought us here, and the work that continues to ensure we never return to the crisis of the past."
        },
        {
            "text": "* Northern Ireland has held negligible risk status for some time, and now that England, Scotland, and Wales have also attained this designation, the entire United Kingdom is classified as negligible risk."
        },
        {
            "heading": 2,
            "text": "Understanding BSE and its impact"
        },
        {
            "text": "BSE is caused by abnormal proteins called prions, which affect the brain and spinal cord of cattle, leading to severe neurological signs and ultimately death."
        },
        {
            "text": "First identified in 1986 by pathologists at APHA’s Weybridge site (then the Central Veterinary Laboratory), BSE quickly escalated into a national crisis. At its peak in 1992, over 36,000 cases were reported in a single year, with more than 180,000 cases overall in the UK."
        },
        {
            "text": "The disease’s link to variant Creutzfeldt-Jakob Disease (vCJD) in humans, through consumption of beef products containing prions, made it a public health emergency. The UK responded with sweeping legislative changes, including a ban on feeding meat and bone meal (MBM) to ruminants, later extended to all farm animals. These measures were essential to halting the spread, but the road to recovery was long."
        },
        {
            "heading": 2,
            "text": "APHA’s role in tackling BSE"
        },
        {
            "text": "For scientists and veterinarians, BSE became a defining challenge - one that demanded innovation, vigilance, and resilience."
        },
        {
            "text": "From the outset, APHA has been central to the UK’s response to BSE. Our scientists and veterinary teams have led the way in identifying the disease, developing and enforcing control measures, conducting surveillance and applying diagnostics, training veterinary professionals, and providing expert advice to government and international bodies."
        },
        {
            "text": "APHA serves as both the National Reference Laboratory and a WOAH Reference Laboratory for BSE. This designation means we:"
        },
        {
            "text": "This role reflects APHA’s scientific leadership, and the trust placed in our expertise by both UK government and international partners."
        },
        {
            "text": "The journey to negligible risk status was a cross-government effort led by Defra, with APHA playing a pivotal role. Our One Health team coordinated the Agency’s contribution, drawing on expertise from colleagues across the transmissible spongiform encephalopathy and animal by-products portfolio. The application process involved months of intensive work - collating, drafting, reviewing and validating technical content in line with WOAH’s requirements."
        },
        {
            "heading": 2,
            "text": "What does negligible risk status mean?"
        },
        {
            "text": "WOAH classifies countries based on their BSE risk as negligible, controlled, or undetermined. Achieving negligible risk status means the UK has demonstrated:"
        },
        {
            "text": "This status is more than symbolic, it reflects the UK’s global reputation for high biosecurity standards and opens doors for trade, reduces regulatory burdens, and boosts confidence in our food safety systems."
        },
        {
            "text": "The benefits of negligible risk status are significant:"
        },
        {
            "heading": 2,
            "text": "Maintaining the status: a new challenge"
        },
        {
            "text": "While the negligible risk status is a cause for celebration, it also sets a high bar for the future. Maintaining this status means aiming for no cases of classical BSE in future, a challenge that requires continued vigilance."
        },
        {
            "text": "Our BSE programme continues with ongoing surveillance, feed testing, and annual re-confirmation of risk status to WOAH. Our research continues to support government advice and uphold our role as a National and WOAH Reference Laboratory."
        },
        {
            "text": "We remain alert to atypical BSE which is a rare, spontaneous form not linked to feed contamination. Though it does not affect our risk status, it must be managed carefully to maintain international confidence."
        },
        {
            "heading": 2,
            "text": "Final thoughts"
        },
        {
            "text": "The journey from crisis to negligible risk status has been long and complex. It has been a true team effort involving science, policy, and the dedication of countless individuals across APHA and beyond. For many of us, this achievement is not just professional, it is personal. We have lived through the challenges of the BSE epidemic and worked tirelessly to overcome them."
        },
        {
            "text": "As we look ahead, our commitment remains unwavering: to protect animal and public health, uphold our international reputation, and ensure that the lessons of BSE continue to guide us."
        },
        {
            "text": "To everyone who played a part in this achievement, thank you. Your work has made history."
        },
        {
            "heading": 2,
            "text": "Spotting and reporting BSE"
        },
        {
            "text": "Although rare, BSE remains a notifiable disease. Cattle owners should watch for signs such as behavioural changes, nervousness, tremors, hind limb weakness and over-reactivity to external stimuli, especially in animals over four years old."
        },
        {
            "text": "If you suspect BSE:"
        },
        {
            "text": "Early reporting is essential to protect animal and public health and to safeguard the UK’s hard-won negligible risk status."
        }
    ]
}