{
    "url": "https://space.blog.gov.uk/2025/10/22/celebrating-the-success-of-the-mantis-mission-uk-investment-in-agile-earth-observation-innovation-through-esa/",
    "title": "Celebrating the success of the MANTIS mission: UK investment in agile Earth Observation innovation through ESA",
    "authors": [
        "UK Space Agency"
    ],
    "categories": [
        "Satellites"
    ],
    "pub_date": "2025-10-22T09:57:22+01:00",
    "content": [
        {
            "text": "The MANTIS satellite, short for Mission and Agile Nanosatellite for Terrestrial Imagery Services, has completed its mission and deorbit, following a highly productive operational phase."
        },
        {
            "text": "Funded by the UK Space Agency through the European Space Agency’s InCubed programme, an initiative that supports innovative commercial Earth observation services, MANTIS was the first satellite mission to be funded and supported from concept to launch. Developed by UK-based Open Cosmos, the mission marks a major milestone in agile Earth observation, showing how public investment can bring new technologies to market faster, boost commercial growth, and deliver value for money."
        },
        {
            "text": "Built on a 12U CubeSat platform and equipped with a novel optical payload from Satlantis, MANTIS combined compact design with advanced imaging technology. Operating in a Sun-synchronous orbit, it delivered high-resolution multispectral imagery with revisit times of just a few days, providing reliable data to track change over time. Onboard processing filtered and compressed information before transmission, enabling rapid delivery of insights to sectors such as energy, mining, and infrastructure, to support timely decisions and safety. Beyond commercial applications, the mission contributed a deeper understanding of our planet, providing data to monitor environmental change, manage natural resources and inform strategies for long-term sustainability and resilience."
        },
        {
            "text": "The mission was successfully led by Open Cosmos, which led the satellite’s design, build, and operations, and Terrabotics, which provided downstream analytics and applications. Together, they highlight the UK’s commercial capability, from space hardware through to services for commercial end users."
        },
        {
            "text": "Harshbir Sangha, Director of Missions and Capabilities at the UK Space Agency, said:"
        },
        {
            "text": "Rafel Jordà, CEO at Open Cosmos, said: "
        },
        {
            "text": "Simonetta Cheli, Director of ESA Earth Observation Programmes said:"
        },
        {
            "text": "As MANTIS completes its mission and safely deorbits, it’s a demonstration of UK Space Agency investment turning innovation into impact, building national capability, supporting industry, and laying the foundations for future UK-led missions in a fast-growing global market."
        }
    ]
}