{
    "url": "https://ukhsa.blog.gov.uk/2025/10/22/join-the-fight-against-flu-by-taking-part-in-our-citizen-science-project/",
    "title": "Join the fight against flu by taking part in our citizen science project",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "flu",
        "Protecting the country's health"
    ],
    "pub_date": "2025-10-22T12:39:43+01:00",
    "content": [
        {
            "text": "Our scientists are tracking flu and other respiratory viruses and they need your help. Join our FluSurvey UK-wide citizen science programme and contribute directly to protecting the nation’s health this winter."
        },
        {
            "text": "When you register, you'll be invited to report any respiratory symptoms on our website on a weekly basis. It’s quick and easy to submit the information, and you’ll be playing a part in protecting the health of all of us across the country. From this season, you’ll also be able to track your symptoms on your profile each week. We’d also encourage you to share the link with your friends and family – the more of us participate, the better the data will be."
        },
        {
            "text": "At UKHSA, our purpose is to protect the public from threats to health - everything from infectious diseases to nuclear incidents. To achieve this, we monitor health hazards and develop ways of dealing with them, which makes science a huge part of what we do."
        },
        {
            "text": "We are ramping up our comprehensive surveillance systems to monitor flu and other seasonal respiratory viruses over the winter season. FluSurvey is one of the key methods we use to understand how these viruses are spreading in our communities. This is valuable information for us because not everyone who feels unwell will call 111, visit their GP, or go to hospital, so their symptoms may not be captured. Community-based systems like FluSurvey include data from those who manage their symptoms at home, giving us an early understanding of respiratory illness activity across the whole population."
        },
        {
            "text": "When added to our existing sources of information, the value of real-time data on respiratory illnesses, provided directly by households countrywide, is immense. It's like having thousands of health detectives scattered across the country, all working together to build a comprehensive picture of flu-like illnesses. By taking part in FluSurvey, you would be contributing a vital piece to a larger puzzle. The data you submit will also form part of our award-winning UKHSA data dashboard, which shares public health data in a simple, inclusive and accessible way."
        },
        {
            "text": "If you’re interested in taking part, sign up for FluSurvey today."
        }
    ]
}