{
    "url": "https://dfedigital.blog.gov.uk/2024/12/04/making-the-most-of-design-histories/",
    "title": "How we changed our approach to design histories ",
    "authors": [
        "Rob Dale"
    ],
    "categories": [
        "Content design",
        "design",
        "Service design",
        "User-centred design"
    ],
    "pub_date": "2024-12-04T11:00:00+00:00",
    "content": [
        {
            "text": "At the Department for Education (DfE), all designers working on service teams are required to work ‘in the open’. One way we do this is by sharing our design thinking through design histories. "
        },
        {
            "text": "Design history posts are blogs that record the development of services and help us communicate: "
        },
        {
            "text": "Posts tell the story of how designs have been developed and how this will improve the user experience. "
        },
        {
            "heading": 2,
            "text": "Why we write design histories "
        },
        {
            "text": "Working in the open in this way helps our team to apply the service standard and:  "
        },
        {
            "heading": 2,
            "text": "How we changed our approach design histories "
        },
        {
            "text": "On the service team I work on, we used to only start thinking about our design history post once the design work had been done. We noticed that this was leading us to miss out some of the detail about why changes had been made.  "
        },
        {
            "text": "For example, we recently had to go back and add more detail about user needs to a post on displaying metrics. This was because the previous version simply stated the need without any detail about the ‘why’. "
        },
        {
            "text": "This led me to thinking about sharing some of the things we do to try and get the most out of our design histories. "
        },
        {
            "heading": 2,
            "text": "How to write a design history "
        },
        {
            "text": "Here are some of my top tips for writing design history posts. "
        },
        {
            "heading": 3,
            "text": "Make it part of the design workflow "
        },
        {
            "text": "We find it works best if we capture the details that make up our design histories as we go. We do this as part of our regular playbacks and team discussions, where we try to identify: "
        },
        {
            "text": "It is also important to make sure you collaborate when writing the post, by asking for contributions from other members of your team. This can include designers, researchers, product managers, developers or policy colleagues. This ensures that the post reflects at least 2 perspectives on the design problem. "
        },
        {
            "heading": 3,
            "text": "Include details about user needs and research "
        },
        {
            "text": "To ensure our design histories cover all of our design thinking, we make sure to include details about the research that drove the design.  "
        },
        {
            "text": "We cover: "
        },
        {
            "text": "To help with this, I make sure to get input from our user researchers or whoever gathered the insight. "
        },
        {
            "heading": 3,
            "text": "Explain each step of the design decision "
        },
        {
            "text": "You should write posts in a way that clearly lays out all the main points of your design thinking. Things I consider when drafting include: "
        },
        {
            "text": "Anyone reading the post should be able to follow how you arrived at your decision, regardless of any prior knowledge of the service. "
        },
        {
            "heading": 3,
            "text": "Structure posts clearly "
        },
        {
            "text": " You should make sure your design history posts are clear and well-structured.  "
        },
        {
            "text": "Firstly, by following the GOV.UK content guidelines, including: "
        },
        {
            "text": "Secondly, by including useful examples in the right way. For example, by: "
        },
        {
            "heading": 3,
            "text": "Getting the post reviewed and approved "
        },
        {
            "text": "Once drafted I get the post checked by another content designer and properly proofread (“2i’d”) before being published. "
        },
        {
            "text": "My advice would be if you are new to creating design histories, it is also worth getting your first few posts approved by a senior team member before publishing. "
        },
        {
            "heading": 2,
            "text": "Discussion and improvement "
        },
        {
            "text": "Within the design profession at DfE we are always keen to keep discussing and improving the way we capture and communicate design thinking. "
        },
        {
            "text": "We have a specific Slack channel for design histories where we discuss, share and ask for feedback on posts. We also have weekly design meetings where we can share our work and gain insight on how to best talk about it. "
        }
    ]
}