{
    "url": "https://homeofficemedia.blog.gov.uk/2024/12/04/media-factsheet-evisas-2/",
    "title": "Media factsheet: eVisas",
    "authors": [
        "Home Office news team"
    ],
    "categories": [
        "Fact sheet"
    ],
    "pub_date": "2024-12-04T15:19:03+00:00",
    "content": [
        {
            "text": "Overview"
        },
        {
            "text": "The Home Office is developing a border and immigration system that is more digital and streamlined. eVisas, a digital proof of immigration status, are a key part of this transformation and will enhance visa holder and new applicant’s experience, deliver excellent value, and increase the immigration system’s security and efficiency."
        },
        {
            "text": "We have been transitioning from physical immigration documents to eVisas for the past 6 years, and they are tried and tested, with millions of people now successfully using eVisas. Since 31 October this year, successful visa applicants who would have received a biometric residence permit (BRP) in the past now get an eVisa."
        },
        {
            "text": "Since eVisa rollout activities began in March 2024, with physical immigration document holders encouraged to access their eVisa, over 3.1 million people have now created an online (UKVI) account to access their eVisa, with statistics published here on GOV.UK on 4 December 2024."
        },
        {
            "text": "What is an eVisa?"
        },
        {
            "text": "An eVisa is an electronic record of a person’s immigration status. It provides people with the ability to view and prove their immigration status online. eVisas are accessed via a UK Visas and Immigration (UKVI) account, which visa holders create as part of the process of transitioning to an eVisa. This can then be used to share information about their immigration status and conditions, such as their right to work or rent in the UK."
        },
        {
            "text": "What are the benefits of eVisas?"
        },
        {
            "text": "eVisas bring significant benefits, deliver excellent value and increase the UK immigration system’s security and efficiency."
        },
        {
            "text": "They also bring significant benefits to people who hold an immigration status in the UK:"
        },
        {
            "text": "Who needs to get an eVisa?"
        },
        {
            "text": "Most BRPs and EU Settlement Scheme (EUSS) biometric residence cards (BRCs) expire on 31 December 2024, and anyone who uses a BRP is urged to access their eVisa now at www.gov.uk/eVisa, and to help family members and friends to access theirs. An EUSS BRC is a BRC that was issued following a successful application to the EU Settlement Scheme."
        },
        {
            "text": "Anyone with indefinite leave to remain (ILR) who uses an ink stamp or vignette in a passport to prove their rights can continue to use their documents as they do today, including for travel, , but they are still encouraged to make a free No Time Limit (NTL) application to access an eVisa at www.gov.uk/eVisa. They can do this at any time."
        },
        {
            "text": "Everyone must have their own UKVI account. Where a child under the age of 18 is unable to create and manage their own account, a parent or guardian should do this for them. You can read more about creating a UKVI account for a child here."
        },
        {
            "text": "What do eVisas mean for international travel? "
        },
        {
            "text": "When travelling, the immigration status for most passengers will be checked digitally – either via automated systems or using the online View and Prove service. If needed, carriers can also call our 24/7 support hub to confirm a passenger’s immigration status."
        },
        {
            "text": "UKVI account details can be updated easily and quickly if no personal details have changed (i.e. no change in name, nationality, date of birth or sex marker), a new or different passport can be added to a UKVI account quickly and easily, without needing to send in the document and the vast majority of changes are applied immediately."
        },
        {
            "text": "Will expired BRPs and EUSS BRCs be accepted by airlines and carriers if a passenger doesn’t have an eVisa yet?"
        },
        {
            "text": "While we are confident that our systems and processes will ensure no one is disadvantaged by the move to a digital immigration system, we are conscious that some people remain concerned about the transition, particularly in the context of international travel."
        },
        {
            "text": "On this basis, the Home Office will allow carriers - such as airlines – to initially accept a biometric residence permit (BRP) or EU Settlement Scheme biometric residence card (EUSS BRC) which expires on or after 31 December 2024 as valid evidence of permission to travel. We intend this arrangement to be in place until 31 March 2025, but this will be kept under review."
        },
        {
            "text": "Passengers whose immigration permission is still valid but whose BRP/EUSS BRC expires on or after 31 December are advised to continue to carry their expired BRP/ EUSS BRC with them when they travel in the early part of 2025."
        },
        {
            "text": "This transitional measure is intended to provide additional reassurance to travellers during the early phase of this transition."
        },
        {
            "text": "Passengers may also wish to create a View and Prove share code in advance of travel, which is valid for 90 days. "
        },
        {
            "text": "Border Force will continue to check all passengers through existing border processes to ensure they still have valid immigration permission and this change does not impact on border security."
        },
        {
            "text": "What support is available?"
        },
        {
            "text": "The Home Office’s Resolution Centre provides help and support to anyone seeking to create a UKVI account to access their eVisa and can assist users who are experiencing technical issues with their online immigration status, and where necessary, enable a person’s status to be verified through alternative means. Details of how to access this can be found here on GOV.UK."
        },
        {
            "text": "In September, the Home Office announced up to £4m in new UK-wide grant funding for four national, and dozens of local organisations to support vulnerable people who may need support transitioning to an eVisa. It builds on the huge success of EU Settlement Scheme grant funded network that helped over 500,000 vulnerable people. The organisations funded to provide free support to vulnerable and at-risk people who need help with creating their UKVI account and getting access to their eVisa are listed here on GOV.UK."
        },
        {
            "text": "The Assisted Digital service is also available to provide individual support by phone and email to people who require assistance with IT-related aspects of creating a UKVI account, for example if they do not feel confident using a computer or mobile device, have internet access or access to a device like a computer, laptop or smart phone. Support is available by text, email or phone, and offers phone support and face to face support where appropriate. More details can be found here on GOV.UK."
        },
        {
            "text": "What about data security?"
        },
        {
            "text": "Immigration data is held securely, and government will never sell user data. Further information on how the Home Office handles data can be found here on GOV.UK."
        },
        {
            "text": "How are Home Office informing people about eVisas?"
        },
        {
            "text": "The Home Office continues to deliver an extensive range of communications activity in support of eVisa transition, encouraging impacted physical immigration holders to take action. This has included direct communication, regular updates to gov.uk, and wide-ranging stakeholder engagement."
        },
        {
            "text": "Our eVisa outreach and engagement has included organisations well-placed to support communities with specific needs to take-action to access their eVisa."
        },
        {
            "text": "In October, the Home Office launched a targeted advertising and engagement campaign across the UK to raise awareness of the transition to eVisas amongst those affected. The campaign aims to inform as many people as possible about the change and uses a multichannel approach, including out of home advertising, print and social media alongside multicultural engagement activity through community organisations, embassies and stakeholder events."
        },
        {
            "text": "Can you still use a physical document if it expires, and you don’t get an eVisa? "
        },
        {
            "text": "The expiry of a physical document, for example, a BRP card, does not affect  someone’s immigration status if it expires on a later date. Visa holders will be able to create an account quickly and easily, using their expired BRP if needed, at www.gov.uk/eVisa. BRP holders will also still be able to use the online right to work and rent services to prove their rights once their BRP expires – provided they still have valid immigration status – although they are encouraged to register for a UKVI account and to use that to access those services."
        },
        {
            "text": "Holders of legacy paper documents, including passports containing ink stamps and visa vignette stickers, can continue to use their physical document to prove their immigration status as they do today. However, they are encouraged to take action at www.gov.uk/eVisa in order to make use of the benefits and convenience that a UKVI account offers, and to reduce unnecessary delays when proving their status."
        },
        {
            "text": "Will eVisas create another Windrush situation?"
        },
        {
            "text": "We are conscious of the lessons learnt from Windrush and are committed to ensuring that all customers, including the most vulnerable, are properly supported as we transform our immigration system.  We understand that individuals may have concerns about proving their status in the absence of a physical document."
        },
        {
            "text": "Many Windrush individuals had an immigration status that was automatically conferred on them by an Act of Parliament, so in some cases they had no physical proof.  In contrast, those who receive an eVisa have secure evidence of their status."
        },
        {
            "text": "Successful visa applicants receive written confirmation by email or letter that they have been granted permission, which they can keep for their personal records. While this document cannot be used as evidence of their status these printed documents can be used when interacting with the Home Office should any subsequent issues be encountered with their eVisa We have also put in place a range of support and alternative mechanisms if people struggle to prove their rights using the digital system."
        },
        {
            "text": "To ensure those with historic and paper-based evidence of their immigration status can take advantage of the benefits eVisas bring, we are continuing further focused communications activity aimed at this group and key stakeholders to get the information that they need in order to create a UKVI account and access their eVisa during 2024 and beyond. We will endeavour to reach vulnerable people who are less digitally confident through collaboration with other Government departments and stakeholders."
        },
        {
            "text": "Does this impact British citizens?"
        },
        {
            "text": "British passport holders and Irish citizens, including those who previously held an immigration status but have since acquired British citizenship, do not need to do anything. British citizens who do not have a British passport because they are dual nationals (excluding Irish passport holders) may need to take action in future regarding how they prove their right of abode. Updates on this will be provided in due course."
        }
    ]
}