{
    "url": "https://space.blog.gov.uk/2024/12/04/messium-uses-space-based-nitrogen-analysis-as-an-enabling-technology-for-farmers/",
    "title": "Messium uses space-based nitrogen analysis as an enabling technology for farmers ",
    "authors": [
        "Emily Jayne Peters"
    ],
    "categories": [
        "Delivering Missions and Capabilities",
        "Earth observation",
        "Satellites"
    ],
    "pub_date": "2024-12-04T13:57:20+00:00",
    "content": [
        {
            "text": "As the only satellite technology capable of detecting the specific wavelengths required for remote crop nitrogen analysis, hyperspectral imaging has become a game-changer when combined with Messium’s deep expertise. Commercial hyperspectral satellites have just now become available at scale, Messium is the undisputed global leader in applying this technology to agriculture."
        },
        {
            "text": "\"Hyperspectral has the potential to substantially increase farm profits and reduce nitrogen fertiliser use across the agricultural sector,\" says our CTO Vishal Soomaney Vijaykumar, \"By providing frequent, highly detailed insights far beyond traditional vegetation indices, it enables precision solutions that farmers could only dream of a decade ago.\""
        },
        {
            "text": "Our progress has not gone unnoticed. “Messium is the leading global agricultural hyperspectral player,” says Chris Robson, CEO of Wyvern, one of the world’s leading hyperspectral satellite companies."
        },
        {
            "text": "As part of the UK Space Agency’s Enabling Technologies Programme (ETP), we are leveraging advanced machine-learning techniques to estimate crop biomass - a critical metric for understanding nitrogen requirements. By employing sophisticated, data-led algorithms rather than simplistic approximations, our team has pioneered new levels of insight into crop health."
        },
        {
            "text": "“Biomass estimation is vital,” explains our CTO Vishal. “Paired with crop nitrogen monitoring, it not only shows growers how their crops are performing today but also provides actionable insights to optimise fertiliser use and maximise yields. With hyperspectral satellites, the accuracy is truly unprecedented.”"
        },
        {
            "text": "“Messium will have the most accurate picture possible of future crop biomass growth and, therefore, nitrogen requirements,” adds Aakash Parekh, Chief Commercial Officer at Pixxel."
        },
        {
            "text": "This remarkable progress would not have been possible without the unwavering support of the UK Space Agency (UKSA). The Enabling Technologies Programme provided the foundation for validating our approach, while the GEO accelerator programme and strategic introductions - such as access to expert space lawyers - have been invaluable."
        },
        {
            "text": "“We are delighted to be part of the UK Space Agency ecosystem,” says our CEO George Marangos-Gilks. “From R&D funding to strategic advice, the UK Space Agency has been instrumental in our success. We’re proud to be a UK champion in hyperspectral technology and agriculture.”"
        },
        {
            "text": "Clare Willis at the UK Space Agency said: “Space data is set to have a huge, positive impact on agriculture, providing farmers with unprecedented insights and solutions. The progress Messium has made is a testament to the power of collaboration and the potential of space technology to address real-world challenges. Messium have responded to the challenge presented by the persistent poor weather this year, engaging with farmers internationally to retain momentum in developing their algorithm led approach.  We look forward to seeing their continued success and the positive impact their technology will have on the agricultural sector.”"
        },
        {
            "text": "Our technical team are also exploring the feasibility of Solar-Induced Fluorescence (SIF) analysis, enabled by the latest generation of hyperspectral satellites. This cutting-edge capability holds exciting potential for uncovering even deeper insights into crop health."
        },
        {
            "text": "With commercial contracts signed and pilot programmes set to launch globally in 2025, Messium is entering a new phase of growth. This rapid progress reinforces our position as the global leader in using hyperspectral technology to address agriculture’s most pressing challenges."
        },
        {
            "text": "For more information or partnership opportunities, visit www.messium.co.uk or contact Peter Jupp at peter@messium.co.uk."
        }
    ]
}