{
    "url": "https://nationalscreening.blog.gov.uk/2024/12/04/uk-nsc-consults-on-offering-hpv-self-sampling-option-to-under-screened-people-in-cervical-screening-programme/",
    "title": "UK NSC consults on offering HPV self-sampling option to under-screened people in cervical screening programme",
    "authors": [
        "Carolina Martinelli"
    ],
    "categories": [
        "NHS Cervical Screening Programme"
    ],
    "pub_date": "2024-12-04T11:04:06+00:00",
    "content": [
        {
            "text": "The UK National Screening Committee (UK NSC) is consulting on the following recommendation:"
        },
        {
            "text": "If implemented, the HPV self-sampling option would be offered to under-screened people alongside traditional clinician-collected sampling by a nurse or doctor."
        },
        {
            "text": "Cervical screening is available to women and to other people with a cervix who do not identify as women."
        },
        {
            "text": "Screening detects types of human papillomavirus (HPV) which can cause cells in the cervix to become abnormal. Removing these abnormal cells can prevent cervical cancer developing."
        },
        {
            "text": "Barriers like pain, embarrassment and inconvenience can put people off cervical screening. Approximately 3 in 10 people do not take up the offer of screening. Individuals who rarely or never attend their screening appointment are described as ‘under-screened’ and are at higher risk of undetected cervical abnormalities and associated disease."
        },
        {
            "text": "National and international evidence now suggests that offering the option of HPV self-sampling could help overcome some of these barriers among the under-screened group, leading to improved participation in screening and ultimately preventing more cervical cancer deaths."
        },
        {
            "heading": 2,
            "text": "How you can participate"
        },
        {
            "text": "Any individual or organisation can respond to the consultation. To participate, please visit the cervical screening recommendation page for more information and to download the consultation documents."
        },
        {
            "text": "The consultation gives stakeholders the chance to give their views on:"
        },
        {
            "text": "Submit your response to uknsc@dhsc.gov.uk by 11.59pm on Wednesday, 26 February 2025."
        },
        {
            "heading": 2,
            "text": "Evidence to support the consultation"
        },
        {
            "text": "The UK NSC this year commissioned a review of national and international evidence on HPV self-sampling in under-screened populations. This evidence review is included in the consultation documents."
        },
        {
            "text": "The evidence also includes the results of the YouScreen trial in North London which found that offering self-sampling to under-screened people was both feasible and increased engagement with screening.  A cost effectiveness evaluation which was commissioned, and co-produced, by the trial team is also included in the consultation documents."
        },
        {
            "text": "Another study, HPValidate, recently published its final results. HPValidate was set up to help find out if vaginal self-taken samples are as accurate as clinician-taken samples. It concluded that 4 combinations of self-collection device and screening test worked well and can inform self-sampling kit and platform choices for under-screened people in the national cervical screening programme."
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK National Screening Committee. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, email uknsc@dhsc.gov.uk."
        }
    ]
}