{
    "url": "https://environmentagency.blog.gov.uk/2024/12/04/working-together-to-create-natural-sustainable-solutions-to-climate-change-and-nature-loss/",
    "title": "Working together to create natural, sustainable solutions to climate change and nature loss ",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Climate change",
        "Environment Agency",
        "Flood Maintenance"
    ],
    "pub_date": "2024-12-04T14:30:55+00:00",
    "content": [
        {
            "text": "Nature Returns is an ambitious program across government and the private sector to explore head-on some of the biggest environmental challenges we face. Key participants in the programme include the Environment Agency, Forestry Commission, and the Royal Botanic Gardens, Kew.  "
        },
        {
            "text": "The programme focuses on the best use of land across England to address climate change while supporting thriving ecosystems and productive agriculture. It involves working with companies and financial institutions to activate the billions in private investment needed to meet our national net zero commitments. "
        },
        {
            "text": "The Ecosystems Knowledge Network (EKN) Nature Finance 2024 conference, known as Nature Finance UK 2024, was a significant event for the Nature Returns programme. They were a sponsor of the conference, which took place on the 5 November, and Melissa Swartz, Catchment Funding Senior Advisor for the Environment Agency, was present, representing the project.  "
        },
        {
            "text": "With almost 20 years at the Environment Agency, Melissa’s role in Nature Returns is working with internal and external partners to develop and trial ways of blending public and private money to support the delivery of environmental outcomes. Melissa leads a workstream on governance on these projects, blended funding, engagement with local project partnerships, and delivers green finance research to increase capacity across Defra ALBs and with external partners. "
        },
        {
            "text": "Nature returns had a stand as well as a seminar titled: How to harness value for business and society across landscapes and catchments. During this seminar, she discussed the benefits of thinking about nature finance in a strategic, programmatic way with Matt Buckler, the Director of Nature Solutions at Derbyshire Wildlife Trust. Working with local partners, Nature Returns is developing strategic funding plans to leverage private investment, gaining a first-hand understanding of how public and private funding can work together in practice at landscape scale. "
        },
        {
            "text": "An integrated approach "
        },
        {
            "text": "Nature Returns brings together the expertise, resources, and perspectives of government bodies, environmental NGOs, and private entities. Through this integrated approach, we can develop landscape-scale approaches to conservation and sustainable land use in practical ways. We are exploring new models of blended funding aimed at protecting and enhancing the natural environment and providing benefits to local communities and economies. "
        },
        {
            "text": "Creating strategic funding plans "
        },
        {
            "text": "Working with three local partnership projects, we are researching the key ingredients needed for blended funding to achieve desired environmental outcomes, as well as commissioning research to support these methods. Through our partnership working, we are supporting the creation of strategic funding plans for place-based environmental actions, aiming to establish a replicable process for others, and developing an online action learning set to support this approach. "
        },
        {
            "text": "Sharing our research  "
        },
        {
            "text": "Independent research commissioned by the Environment Agency and the Forestry Commission enhances our understanding of several key areas in green finance and nature markets: "
        },
        {
            "text": "Governance structures supporting landscape-scale action and investment "
        },
        {
            "text": "Examining the governance structures and legal forms available to entities seeking to deliver landscape-scale nature-based solutions, and in particular the ability of different structures to blend funding from several sources. "
        },
        {
            "text": "Determining key ‘ingredients’ for governance of green finance, flood and water outcomes. "
        },
        {
            "text": "Benefits, risks and requirements of bringing together ecosystem service suppliers as part of effective place-based collaboration. "
        },
        {
            "text": "Exploring the benefits and drawbacks of different models currently in place for aggregating ecosystem service sellers, and drawing on case studies from the different models. "
        },
        {
            "text": "Investor and buyer motivations in nature markets "
        },
        {
            "text": "Through two separate reports, we explore the needs of institutional investors and look at the motivations of buyers from across different sectors on investing in nature. "
        },
        {
            "text": "Carbon prices in voluntary markets "
        },
        {
            "text": "Reviewing how the market is valuing nature-based carbon credits so we can better understand the UK carbon market and increase transparency.  "
        },
        {
            "text": "Land use decision-making tools. "
        },
        {
            "text": "This report provides a summary of the key decision-making stages expected to be made during a landscape restoration project and a selection of suggested tools available to support those decisions. "
        },
        {
            "text": "By thinking strategically and programmatically about the various nature-based solutions needed to deliver the needed environmental outcomes in a place – and including thinking about sources of funding for delivery from both public and private sources while developing this programme,  we will significantly enhance our ability to deliver landscape-scale nature-based solutions. These efforts will ultimately lead to improved environmental outcomes, promoting a more sustainable and resilient future for our ecosystems and communities. "
        },
        {
            "text": "Nature Returns: Investing in nature | Kew "
        },
        {
            "text": "Nature Returns Programme "
        }
    ]
}