{
    "url": "https://environmentagency.blog.gov.uk/2025/06/06/working-together-to-protect-and-restore-the-mimram-catchment/",
    "title": "Working together to protect and restore the Mimram catchment",
    "authors": [
        "defrablogs"
    ],
    "categories": [
        "Environment Agency",
        "Invasive species",
        "Nature",
        "Rivers",
        "Water"
    ],
    "pub_date": "2025-06-06T11:38:19+00:00",
    "content": [
        {
            "text": "Thanks to funding from the Environment Agency, Herts and Middlesex Wildlife Trust has appointed Heidi Mansell as the new Chalk Rivers and Farm Advisory Officer to lead crucial efforts to restore and protect the River Mimram—one of Hertfordshire’s rare and precious chalk streams."
        },
        {
            "text": "The River Mimram rises near Whitwell and flows through the villages of Kimpton, Codicote, and Welwyn before joining the River Lea near Hertford. Like many chalk streams, the Mimram is under pressure from low flows, pollution, and habitat degradation. These globally rare habitats are a special type of spring-fed river unique to England and north-west Europe."
        },
        {
            "text": "To help address these challenges, Heidi is working closely with landowners, local communities, and stakeholders to improve the river’s flow, resilience, and ecological health. This includes practical habitat restoration, advice to landowners on sustainable options, and community engagement."
        },
        {
            "text": "After one year in the role, here is what Heidi has to say:"
        },
        {
            "text": "“We’re looking at a new approach with the Mimram – one that’s catchment-wide, considering the entire area of land that drains into the river and having a dedicated person to support work on the ground. That’s really important because specific local issues, for example, the demand for water, pollution or invasive species, may start in the wider catchment and those that affect or who are affected by them should be empowered to find the solutions. We recognise that for a number of years, different groups and stakeholders have been coming together to improve the Mimram, so now the aim is to consolidate on this good work and hopefully make further progress."
        },
        {
            "text": "“In these first few months, I have been meeting with and listening to landholders to understand the support that they would like and gathering existing data on the catchment. Already, 11 of those, with land right next to the Mimram, have said that they would like to work towards improving the river, which is hugely encouraging. Over the coming months and years, we’ll work together to create and deliver restoration and management plans that address some of the reasons why the river is not achieving good ecological status, according to the Water Framework Directive.  "
        },
        {
            "text": "“Further exciting new options are now available through the Higher-Level Countryside Stewardship Scheme that may fund some of this work, with payments to farmers that sensitively manage riverbanks and water edge habitats and connect river and floodplain habitats. I am also working with the Mimram Farm Cluster, signposting funding opportunities and supporting individuals with the actions they want to take and acquiring funding for it."
        },
        {
            "text": "“Within the wider catchment, there are 191 Local Wildlife Sites—areas of land recognised for their high value to nature in the Hertfordshire area. These sites create important links across the landscape and offer opportunities to hold water in the environment. Most are privately owned, and I’ll be supporting landholders with sites that rely on water to help keep their plant and animal communities healthy. This is especially important in a chalk catchment, where holding more water in the landscape helps recharge the groundwater and makes the area more resilient during dry periods."
        },
        {
            "text": "“As a result of this work, we hope to see species such as the endangered water vole thriving once again, to find brown trout creating their nests on the riverbed, to see flashes of blue as kingfishers dart along the river and waving strands of Water Crowfoot teetering on the water’s surface – all indicators of healthy chalk streams. Across the wider catchment, we are aiming to increase the numbers of declining bird species such as yellowhammers, lapwings and corn buntings – all priorities in the emerging Hertfordshire Nature Recovery Strategy.”."
        },
        {
            "text": "Elizabeth Walden, Chalk Catchment Coordinator for the Upper Lee at the Environment Agency, reflects on the collaborative efforts to restore and protect the River Mimram:"
        },
        {
            "text": "“Funded through our Chalk Partnership Fund, this project plays a key role in delivering the Catchment Based Approach (CaBA) Chalk Stream Restoration Strategy in the Mimram Valley."
        },
        {
            "text": "“England is home to 85 per cent of the world’s chalk streams and their future depends on collective action from water companies, farmers, and landowners as well as government and regulators. Despite their importance nationally and internationally, only 17 per cent met good ecological status under the Water Framework Directive in 2019. The River Mimram is one of the many chalk streams currently falling short of this standard."
        },
        {
            "text": "“The problems facing chalk streams are complicated and expensive to solve, however, by working on a catchment-scale in close partnership with Heidi, we’re making meaningful improvements to the Mimram catchment. Heidi is bringing together farmers, landowners, and local communities to drive action forward for the benefit of people and wildlife. By improving water resources, habitat, and the river’s resilience during periods of high and low flow, this project is helping to secure a healthier future for the River Mimram, and the communities that value it."
        },
        {
            "text": "“We are excited to see how this new collaborative approach with Herts and Middlesex Wildlife Trust develops and delivers lasting impacts in the years to come.”"
        },
        {
            "text": "For more details, check out our videos on the River Mimram on the Environment Agency’s YouTube channel "
        }
    ]
}