{
    "url": "https://aphascience.blog.gov.uk/2024/05/22/boosting-biodiversity-through-thoughtful-construction/",
    "title": "Boosting biodiversity through thoughtful construction",
    "authors": [
        "Marios Demetriou"
    ],
    "categories": [
        "Science Capability in Animal Health Programme"
    ],
    "pub_date": "2024-05-22T12:30:02+01:00",
    "content": [
        {
            "text": "22 May marks the United Nations (UN) International Day for Biodiversity, which aims to increase understanding and awareness of biodiversity issues and increase recognition of the significant challenges that human activities pose to biological diversity. The theme of this years’ International Day for Biodiversity is, ‘Be Part of the Plan’, a global call to action for all stakeholders to halt and reverse the loss of biodiversity. To celebrate, we are sharing our biodiversity plans for the transformation of the Defra Animal and Plant Health Agency’s (APHA) Weybridge science campus."
        },
        {
            "text": "In February 2024, we submitted our Master Outline Planning Application (MOPA), for the site’s transformation and creation of a new science hub, which includes our landscape and biodiversity proposals."
        },
        {
            "text": "Protecting and enhancing valuable ecological features of the site is of paramount importance to our transformation project. On a wider scale, it also mirrors APHA’s mission to protect animal and plant health as recent research suggests that preventing biodiversity loss could mitigate the threat from zoonotic diseases – those that are transmitted from animals to humans."
        },
        {
            "heading": 3,
            "text": "Biodiversity net gain - pathfinder"
        },
        {
            "text": "Biodiversity Net Gain (BNG) commitments, introduced in February 2024, require all developers to deliver at least a 10% improvement in biodiversity to make sure that habitats are left in a measurably better state than they were before development."
        },
        {
            "text": "Our proposals go significantly above and beyond this 10% gain, proposing a BNG Strategy to deliver 25% biodiversity net gain on the site. Although we are only at the enabling stage of construction, work has already begun to deliver these improvements, with the Weybridge site somewhat of a pathfinder for other ambitious projects to follow."
        },
        {
            "text": "Our proposals aim to increase the habitat potential across the site to promote new habitats with sustainable growth for the future. We will be enhancing wildlife corridors to link new green spaces within the site to those that already exist and connect to the surrounding landscape; through:"
        },
        {
            "heading": 3,
            "text": "Find out more:"
        },
        {
            "text": "If you are interested in this topic, please look at some of our other related blogs:"
        },
        {
            "text": "Please email LocalEngagement@defra.gov.uk if you would like more information or to share your views on the transformation plans."
        },
        {
            "text": " "
        }
    ]
}