{
    "url": "https://kingsawards.blog.gov.uk/2024/05/22/bryden-wood-wins-second-kings-award-for-innovation/",
    "title": "Bryden Wood receives second King’s Award for innovation ",
    "authors": [
        "The Queen's Awards for Enterprise"
    ],
    "categories": [
        "Recipients",
        "Uncategorized"
    ],
    "pub_date": "2024-05-22T12:15:16+01:00",
    "content": [
        {
            "heading": 2,
            "text": "Integrated design company leading industrialisation and digital innovation is honoured for Platforms innovation now widely adopted across the industry.  "
        },
        {
            "text": "Bryden Wood has been awarded a King’s Award for Enterprise, the most prestigious business award in the UK. The company is one of only 59 businesses to win for Innovation and is the only design consultancy to receive the award."
        },
        {
            "text": "This is the second such award for Bryden Wood. The company won a Queen’s Award in 2018, also for Innovation, and was also the only design consultancy to do so."
        },
        {
            "text": "Established by Mark Bryden and Martin Wood in 1995, Bryden Wood has grown into a 300-person integrated practice of designers, architects, engineers, digital technologists, and analysts with offices in the UK, US and across Europe."
        },
        {
            "text": "Mark Bryden, co-founder, says: “I’m enormously proud of our team who span the widest range of skills and expertise and who time and time again position us right at the heart of solving the most complex problems facing the public and private sectors in the UK and beyond. "
        },
        {
            "text": "This award recognises the ways in which we’re changing how major infrastructure is and will be delivered. Whether that’s in healthcare, energy, life sciences, data centres or other commercial projects. That we have won for a second time is testament to the tireless efforts of our people who never fail to think of new and better ways to do things.”"
        },
        {
            "text": "Bryden Wood was awarded a Queen's Award for Innovation in 2018 in recognition of its pioneering Design for Manufacture and Assembly (DfMA). This award has been won for the next evolution of DfMA – Platforms – a digital design and delivery system to increase productivity and reduce carbon and cost."
        },
        {
            "text": "Platforms identify features like floor heights and structural spans shared by different types of buildings to reveal a kit of standardised parts that can be used to deliver assets across multiple sectors. Housed in digital libraries, these manufactured components are readily available from existing suppliers and can be assembled quickly and intuitively, in countless ways, to create a vast range of spaces."
        },
        {
            "text": "The approach offers standardisation at component level but design freedom at asset level and allows design automation to thrive. Platforms create economies of scale to drive down time and cost while increasing safety, productivity, and quality. Reduced carbon and re-use are embedded in these projects at the earliest stages of design."
        },
        {
            "text": "Platforms is now widely adopted as part of national social infrastructure policy in hospitals, schools, and prisons, and, by Bryden Wood, in commercial developments, energy infrastructure and data centres."
        },
        {
            "text": "www.brydenwood.com"
        },
        {
            "text": "@BrydenWood"
        },
        {
            "text": " "
        },
        {
            "text": "Bryden Wood is an integrated, technical practice of creative technologists, architects, engineers, designers, and analysts leading the sector in a platforms approach to industrialized construction, creative technologies, and automated design."
        },
        {
            "text": "The company has offices in London and St Albans; Barcelona; Milan and Athens with teams working seamlessly on global projects throughout the UK, Europe, Asia and the US."
        },
        {
            "text": "Apply for the 2025 round of King's Awards for Enterprise here: https://www.gov.uk/kings-awards-for-enterprise/how-to-apply"
        }
    ]
}