{
    "url": "https://marinedevelopments.blog.gov.uk/2024/05/22/fisheries-data-mapping-an-update-from-the-mmo-marine-planning-team/",
    "title": "Fisheries data mapping - An update from the MMO Marine Planning team",
    "authors": [
        "Paul Gilliland, MMO Head of Marine Planning"
    ],
    "categories": [
        "fisheries",
        "marine planning"
    ],
    "pub_date": "2024-05-22T12:33:17+01:00",
    "content": [
        {
            "text": "During 2023, a number of fisheries workshops were conducted as part of work undertaken by the Marine Management Organisation (MMO) and others to support thinking around marine spatial prioritisation.  The objective of the workshops was to validate both the approach and the data used in fisheries mapping."
        },
        {
            "text": "Fishing representatives identified several key areas where the approach and data could be strengthened. Work is now being undertaken to identify how these key points can be addressed and implemented, with an expectation to produce new outputs in the future."
        },
        {
            "text": "Dale Rodmell, Chief Executive at the Eastern England Fish Producers Organisation, noted:"
        },
        {
            "text": "We will continue to engage with the fishing industry to share progress and gather further feedback."
        },
        {
            "text": "In the meantime, a project commissioned by MMO to examine “the sensitivity of the under-12 metre fishing fleet to offshore wind development in the East Marine Plan areas” is being finalised. The project engaged directly with fishers through face-to-face workshops across eight ports in the East region."
        },
        {
            "text": "Representatives from the under-12 metre fishing fleet attended, helping to produce maps of their fishing grounds and highlight how they are being impacted by offshore wind developments. In line with standard practice, the final report will be published on the MMO Evidence projects register for use by any interested stakeholders. We hope this will include fishers, their representatives, and offshore wind farm developers."
        },
        {
            "text": "For marine planners, the potential application of both analyses includes feeding into the process to replace the East Marine Plan, which formally began on 22 April 2024, and informing the location of future offshore wind sites in England, noting the challenge of meeting renewable energy targets in sea areas that are already busy."
        }
    ]
}