{
    "url": "https://socialcare.blog.gov.uk/2024/05/22/getting-to-the-social-hub-of-the-matter/",
    "title": "Getting to the (social) hub of the matter",
    "authors": [
        "Raf Hamaizia"
    ],
    "categories": [
        "Care and support",
        "Innovation"
    ],
    "pub_date": "2024-05-22T10:48:58+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Space for everyone"
        },
        {
            "text": "Our patients across Cygnet Health Care services now have access to homely environments – ‘social hubs’- away from the wards, after unused spaces in our hospitals were given a makeover in an effort to provide safe spaces where the people we support can relax and socialise together."
        },
        {
            "text": "The hubs have been designed and installed across ten services so far and all have been co-produced with staff and patients, with more to come."
        },
        {
            "text": "Co-production is an integral part of our culture and the social hubs came about following feedback from patients who said they would benefit from having non-clinical rooms to wind down in."
        },
        {
            "text": "Working from a wish list of items provided by service users, a team of staff and experts by experience (those with lived experience of inpatient settings) worked together to spend a day at each service, transforming an otherwise empty room into a brand new space featuring games consoles, arcade machines, sensory lighting and a newly clothed pool table."
        },
        {
            "text": "The social hubs offer a non-clinical, homely space for service users to relax and engage in fun activities and peer support sessions, giving them a safe space away from the wards."
        },
        {
            "text": "Service users were placed at the heart of the project from the very beginning. This included visiting a local shopping centre, where they could be directly involved in choosing the items bought for the hub, giving them a greater sense of ownership of the project."
        },
        {
            "text": "This co-produced approach demonstrates how staff and service users can enhance both the built environment and engagement by working together."
        },
        {
            "heading": 2,
            "text": "Unwind, relax, revive"
        },
        {
            "text": "The new hubs are a great place for service users to get off the wards to relax and socialise, particularly on evenings and weekends. Feedback from community meetings has been really positive with one service user saying the room “gives a positive and relaxing energy” and another remarking how they find it “stunning and helps us to stay chilled.”"
        },
        {
            "text": "We strive to make our services “homes away from homes” and the social hubs have been hugely beneficial for the people we care for, reducing incidents and providing them with a non-clinical, homely environment to enhance off-ward activities. It is refreshing to see how quickly the hubs are growing and the amazing feedback we are getting from patients and colleagues."
        },
        {
            "text": "Social hubs typically include items such as TVs, immersive sound systems, PlayStations, inspirational artwork, comic figurines and posters, arcade machines, board games, bean bags and adjustable sensory lighting."
        },
        {
            "text": "The plan is to expand these hubs across our services. It has been a real journey of co-production and sharing best practice between sites to enhance therapeutic environments and meaningful activity to support recovery."
        },
        {
            "heading": 2,
            "text": "Person-centred to power recovery"
        },
        {
            "text": "The individuals we support now have places to do what they want to do, that don’t feel clinical or reminiscent of hospital environments. What's more, they feel fully invested in their creation. In this way, the hubs are helping to create a sense of self, connectedness and, ultimately, recovery. They also provide reassurance to families when seeing this space, knowing their loved ones are not in an institution, but a place they played a part in creating."
        },
        {
            "text": "For service users, social hubs are a reflection of their voices being heard. We’ve listened and acted on their needs, hopes and interests. Staff, including managers, are over the moon too. We all feel invested in these spaces and are excited to see how they will make a positive difference, from enhancing engagement on evenings and weekends, to having a place where service users can relax and socialise."
        },
        {
            "text": "Seeing the reaction on people’s faces has been priceless, the best reward we could hope for."
        }
    ]
}