{
    "url": "https://environmentagency.blog.gov.uk/2024/05/22/how-the-project-lead-for-the-isle-of-wight-coastal-defence-scheme-is-actively-reducing-carbon/",
    "title": "How the project lead for the Isle of Wight coastal defence scheme is actively reducing carbon",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Climate change",
        "Environment Agency"
    ],
    "pub_date": "2024-05-22T11:20:19+00:00",
    "content": [
        {
            "text": "My name is Emily Webster and I am the project lead for two coastal defence schemes in Sandown Bay on the south-eastern coast of the Isle of Wight. These schemes will refurbish over 2km of sea wall and groynes in the popular sandy bay."
        },
        {
            "text": "The Environment Agency is aiming to become a net zero organisation by 2045-50. This means that we will aim to balance the carbon emissions we produce with those we take out of the atmosphere so that we are no longer contributing to climate change."
        },
        {
            "text": "Every Environment Agency flood and coastal erosion risk management project is allocated a carbon budget. This is calculated using a baseline carbon footprint for the assets and is set in line with the Environment Agency’s carbon reduction targets."
        },
        {
            "text": "Reducing carbon during site visits "
        },
        {
            "text": "Like many Environment Agency employees, I completed the carbon literacy training course last year, which means I am certified as Carbon Literate."
        },
        {
            "text": "I have committed to lead by example in using sustainable travel. I also take proactive steps to roll out the Environment Agency’s hierarchy of travel to our external partners and stakeholders."
        },
        {
            "text": "In March I met our designer, JBA Consulting and our contractor, VolkerStevin to review the initial designs for the refurbishment. We wanted to identify the potential impacts of the construction work on the Sandown Bay community. I was delighted when VolkerStevin and JBA Consulting announced that they were taking the train and using their bikes to join us on the visit."
        },
        {
            "text": "I started my sustainable travel journey to site from my home on Hayling Island, an island east of Portsmouth in Hampshire. I took the Hayling Island foot passenger ferry to Portsmouth which has been operating for at least 200 years!"
        },
        {
            "text": "On the next part of my journey, I rented an electric scooter from the Voi app on my phone. I am then joined by Leon Pollard from VolkerStevin for a flight on the Hovercraft from Portsmouth to Ryde on the Isle of Wight."
        },
        {
            "text": "Leon then sets off on his bike and I take the train from the Hovercraft to our meeting point in Shanklin."
        },
        {
            "text": "Reducing carbon during construction "
        },
        {
            "text": "We spent the morning inspecting the sea wall in Shanklin identifying opportunities to reduce carbon in the design."
        },
        {
            "text": "These ideas can be categorised into the construction carbon hierarchy:"
        },
        {
            "text": "This is important because more than half of the Environment Agency’s carbon emissions come from construction."
        },
        {
            "text": "Three members of the team then travelled by bike down the esplanade towards Sandown and Yaverland. The remaining team members car shared in electric vehicles."
        },
        {
            "text": "The Environment Agency’s travel carbon calculator can be used to assess the true carbon cost of planned journeys to help inform travel decisions. The carbon calculator estimates that if I had used my personal petrol vehicle the CO2 impact of my travel would have been 23kgs of CO2. The more sustainable option of a train journey for the distance I travelled would still have released 6kgs of CO2. The UK’s greenhouse gas conversion factors show my ferry and scooter journeys together were both responsible for far less than 1 kg of CO2."
        },
        {
            "text": "There will be an opportunity for the public to find out more about the coastal refurbishment work. A series of information events will be held in June and July to explain what the refurbishment will look like and what will happen during the work."
        },
        {
            "text": "For more information visit:  "
        },
        {
            "text": "Yaverland: Yaverland Coastal Defence Scheme Information Page - Environment Agency - Citizen Space (environment-agency.gov.uk)"
        },
        {
            "text": "Shanklin:  Shanklin Coastal Defence Scheme Information Page - Environment Agency - Citizen Space (environment-agency.gov.uk)"
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}