{
    "url": "https://environmentagency.blog.gov.uk/2024/05/22/how-the-environment-agency-is-conserving-and-enhancing-biodiversity/",
    "title": "How the Environment Agency is conserving and enhancing biodiversity",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Environment Agency",
        "Fisheries and biodiversity"
    ],
    "pub_date": "2024-05-22T08:22:29+00:00",
    "content": [
        {
            "text": "Hi, I am Tony Grayling and I’m one of the new Directors of Nature and Place, along with my colleague Jennie Donovan, at the Environment Agency. Today we are celebrating International Day of Biodiversity, and I wanted to share with you, just a few examples of how we contribute to conserving and enhancing biodiversity in our fabulous environment.  "
        },
        {
            "text": "Myself and all those that work here, have a key role in shaping and delivering the government’s ambitions to leave nature in a better state for future generations, and our responsibilities, expertise, activities and science place us in a unique position to champion this ambition in the water environment.   "
        },
        {
            "text": "Science plays such an important role in nearly everything we do at the Environment Agency. Our science provides us with the insights we need to decide how to respond to changes we are experiencing, underpinning our work to protect and improve the environment, and enables us to assess the impacts our actions are having.  "
        },
        {
            "text": "We deliver biodiversity benefits through many different avenues including our own operations, partnerships, through regulating business, advising government and provision of expert advice especially on fresh, estuarine and coastal water and wetland habitats and species.  "
        },
        {
            "text": "A look back – What we have delivered so far:  "
        },
        {
            "text": "Last year alone, through our partnership projects, we created 385 ha of priority habitat and restored 1,527 ha including blanket bog, coastal and floodplain grazing marsh, lowland mixed deciduous woodland, lowland meadow and intertidal mudflat.   "
        },
        {
            "text": "A great way we continually contribute to conserving and enhancing biodiversity, is through our natural flood management schemes. These schemes deliver enhancements for nature while delivering flood protection for people and businesses. For example, we have recently partnered with the Wild Trout Trust and others on the River Witham at Manthorpe, Lincolnshire to reconnect the floodplain allowing the river to change and evolve, creating new habitats for wildlife. We have also worked with the Ullswater Catchment Restoration project in Cumbria, which seeks to reverse the decline in habitat and natural processes, by working with local landowners and communities.   "
        },
        {
            "text": "Nature based solutions are a win-win. Take peatland for example. We continue our work with local authorities, businesses and community groups to protect and re-wet peat. Aside from protecting the intrinsic natural beauty of peatland landscapes, this work represents value for money. Peatland filters water, meaning water companies can use less chemical treatment; it provides habitats for rare and declining species, and it helps store carbon to mitigate the impacts of climate change.  "
        },
        {
            "text": "Additionally, we continue to actively contribute to the Nature for Climate programme, as well as others such as the Green Recovery Challenge Fund. These are especially crucial in conserving and enhancing biodiversity and show that working with others significantly increases the scale of our outcomes for nature, while also delivering other multiple benefits for society. Our role in delivery of Defra’s landscape recovery scheme will also help to demonstrate how collaborative working, and blending of public and private finance, can drive changes to land management and use to support ecosystem recovery and deliver multiple outcomes for nature and people.     "
        },
        {
            "text": "Moving forward: What are we doing to increase biodiversity?  "
        },
        {
            "text": " Between 2021 and 2030 we aim to create or restore 20,000 hectares (ha) of priority habitat, through our own projects and working in partnership with others, while contributing to the Environmental Improvement Plan target to restore or create 140,000 ha of wildlife-rich habitats by 2028. We are also delivering a wide range of projects which help deliver the government aims to have 75% of Sites of Special Scientific Interest (SSSI’s) in favourable condition by 2042. You can find out more about our work and how we are contributing to the delivery of the government’s Environmental Improvement Plan (EIP) goals here.  "
        },
        {
            "text": "Defra have also announced the mandatory biodiversity net gain (BNG) where all developers must deliver a BNG of 10%. This means a development will result in more or better quality natural habitat than there was before development. As a developer, this offers us at the Environment Agency another great opportunity to deliver more for nature recovery, especially through our Flood and Coastal Erosion Risk Management capital programme  and through our role in Local Nature Recovery Strategies (LNRSs). As an organisation, we will focus on the opportunities provided by BNG to protect and enhance the water environment, including river and wetland habitats, whilst supporting wider environmental improvements within our remit. "
        },
        {
            "text": "  "
        },
        {
            "text": "My final mention of our work on biodiversity today highlights a fabulous partnership that will delve into our ambitious habitat restoration initiative to restore Meadow, Marsh and Reef. This summer we are partnering with Ocean and Coastal Futures to run the ReMeMaRe conference on restoring estuarine and coastal habitats. By 2043 ReMeMaRe aims to restore at least 15% of the three priority habitats - seagrass meadows, saltmarshes and native oyster beds and reefs.  By re-establishing these precious estuarine and coastal ecosystems, we are enhancing society's connection to the natural world. Find out more about this great work here.   "
        },
        {
            "text": "To round up, our environment is always changing, and with it, our requirements and expectations are changing too. It is a great privilege to be leading the Environment Agency’s work on nature recovery. We are already doing a lot. We know, however, that there is much more to do to halt and reverse the decline in biodiversity, which is so essential to our heath and underpins our economy. We will be striving to play our full part in that national mission, and we call on all those who have a role in nature to join us and apply for the funding or schemes we manage, that I have mentioned above.   "
        },
        {
            "text": "Working together we can build a natural environment to be proud of and protect our precious habitats for years to come. "
        },
        {
            "text": "We’re celebrating International Day for Biological Diversity across Defra group. You can read more about our work in the following blog posts:"
        }
    ]
}