{
    "url": "https://ukhsa.blog.gov.uk/2024/05/22/i-was-a-gp-on-the-frontline-of-a-whooping-cough-epidemic-here-is-what-i-saw/",
    "title": "I was a GP on the frontline of a whooping cough epidemic. Here is what I saw.",
    "authors": [
        "Doug Jenkinson"
    ],
    "categories": [
        "Immunisation and vaccination"
    ],
    "pub_date": "2024-05-22T10:23:13+01:00",
    "content": [
        {
            "text": "The thing about whooping cough is that anyone can diagnose it once they have heard the typical cough. The ‘whooping’ noise happens right at the end of a choking cough attack, although not everyone makes it."
        },
        {
            "text": "I returned from a spell in Central Africa in the mid-1970s to take up a GP job in the Midlands to find that most parents had stopped allowing their babies to be given whooping cough vaccine."
        },
        {
            "text": "There had been a scare that the vaccine could very occasionally cause serious side effects. Nobody knew whether it was true or not, and even some doctors stopped advising it."
        },
        {
            "text": "It was later proved that it was not the vaccine causing the side effects. But, by then, the damage had been done."
        },
        {
            "text": "Whooping cough came back big time, and my 3 partners and I in the GP practice saw well over 100 cases in the last few months of 1977 when the outbreak hit. It went on for a year or more before settling down."
        },
        {
            "text": "More than a decade went by before people were confident in the vaccine again. In the meantime, everyone had seen how nasty whooping cough was and realised what a great job the vaccine did."
        },
        {
            "text": "It stopped children getting these terrible bouts of coughing where they vomited, went blue and became frightened and exhausted."
        },
        {
            "text": "Because that is what happens with whooping cough, and these spasms happen at least a dozen times a day. The worst ones seem to happen at night, and everyone loses sleep. The whole family suffers distress, not just the person with it."
        },
        {
            "text": "If it only lasted a week or 2, like most coughs, you might think you could deal with that. But no, it lasts 6 to 7 weeks, on average, and sometimes longer. Although some cases do clear up in as little as 3."
        },
        {
            "text": "Back then we would often get cases in nurseries and schools and people became very familiar with it. You’d get diagnoses on the way to school in the morning. “Hey, your daughter has just coughed, and it sounds like whooping cough,” teachers or parents would say. “You had better get her to the doctor.”"
        },
        {
            "text": "We always put suspect cases in a side room when they came in so infection would not spread. Quite often there would be a waiting room full of people waiting patiently for their turn to see the doctor, and then somebody would have a typical whooping cough spasm."
        },
        {
            "text": "All ears would prick up until one of the staff ushered them into a side room before the whole space was full of whooping cough bugs."
        },
        {
            "text": "Thankfully, the vaccine was able to protect children during the most dangerous years, and now the vaccine available in pregnancy has worked a little miracle to protect newborn babies against the most severe disease."
        },
        {
            "text": "It’s vital that women get vaccinated at the optimal time when pregnant - during every pregnancy - to protect their newborn. Babies are the most vulnerable to severe whooping cough, in some tragic cases even dying."
        },
        {
            "text": "But neither vaccination nor infection provide lifelong protection so people can get it again when they’re older. And for adults, in my experience, it often seems to go on longer and the spasms can still be painful."
        },
        {
            "text": "The bottom line from my many years of practice as a GP is just make sure you and your children have all the recommended immunisations. Vaccination during pregnancy saves babies’ lives."
        }
    ]
}