{
    "url": "https://defraenvironment.blog.gov.uk/2024/05/22/the-darwin-initiative-supporting-biodiversity-and-communities-across-the-globe/",
    "title": "The Darwin Initiative: supporting biodiversity and communities across the globe",
    "authors": [
        "Ben Yexley"
    ],
    "categories": [
        "Community",
        "Nature"
    ],
    "pub_date": "2024-05-22T13:44:57+01:00",
    "content": [
        {
            "text": "Today, the International Day for Biological Diversity, Defra has opened the 31st round of the Darwin Initiative for applications. There is up to £30 million worth of grants available to conserve biodiversity, reduce poverty and support local communities worldwide."
        },
        {
            "text": "The Darwin Initiative is a UK government grants scheme"
        },
        {
            "text": "The Darwin Initiative is one of Defra’s three Biodiversity Challenge Funds, alongside the Illegal Wildlife Trade Challenge Fund and Darwin Plus."
        },
        {
            "text": "The Initiative is helping the UK government to deliver on major international policies and commitments to tackle global biodiversity loss and reduce poverty, including the Global Biodiversity Framework."
        },
        {
            "text": "Projects are delivering ambitious impacts"
        },
        {
            "text": "Since 1993, the Darwin Initiative has awarded more than £220 million to over 1,320 projects, helping national and local stakeholders to deliver for nature."
        },
        {
            "text": "Recent Darwin Initiative projects have placed a total of 396,000 hectares of habitat under sustainable management practice. They have enabled 98,000 people to improve their resilience to natural disasters or climate change."
        },
        {
            "text": "If funding continues at present levels, by 2030 we expect this to rise to 344,000 people. And, through the funding, we expect to improve the ecological management of 3.2 million hectares – that's more than one and a half times the size of Wales."
        },
        {
            "text": "Projects range from protecting Himalayan plants to regenerating soil in Madagascar"
        },
        {
            "text": "Behind the numbers are powerful stories. One example is how the University of Exeter and local partners have improved how Indonesia protects threatened peatland forest."
        },
        {
            "text": "Project partners blocked illegal drainage, improved fire detection, reformed firefighting and accelerated reforestation. Satellite imagery since shows a significant reduction in forest fires. With Darwin Initiative funding, our partners are now scaling these reforms, to better protect 50,000 hectares – an area roughly the size of the New Forest."
        },
        {
            "text": "We’ve also just awarded £29 million to more than 50 projects under the most recent funding round – this brings our total portfolio of live projects to more than 180, worth over £100 million."
        },
        {
            "text": "In Nepal, a project will fund TRAFFIC to make the wild harvesting of rare Himalayan plants and fungi sustainable. They will use the FairWild Standard to safeguard the incomes of 10,000 wild harvesters in remote villages."
        },
        {
            "text": "In Kenya, Tanzania, Madagascar, Nepal, and Bolivia, IIED will improve how 70 protected and conserved areas are governed, by strengthening the role of rural communities in the decision-making over the biodiversity around them."
        },
        {
            "text": "In the Philippines, Re:Wild will scale up a successful pilot already funded by the Darwin Initiative. Together with indigenous communities and government agencies, they will improve their collaboration to conserve species such as the Critically Endangered tamaraw, a small buffalo."
        },
        {
            "text": "Our smaller grants test more novel ideas and build conservationists’ capability and capacity. Examples include:"
        },
        {
            "text": "Find out more through our website and social media"
        },
        {
            "text": "All the information on how to apply can be found on the Darwin Initiative website."
        },
        {
            "text": "Organisations can apply to four different funding schemes – Innovation, Main, Extra, and Capability & Capacity – for grants between £10,000 and £5 million, and up to 5 years."
        },
        {
            "text": "You can get more inspiration and learn about the huge diversity of Darwin Initiative projects by reading the articles on our website or looking through our list of current and past projects."
        },
        {
            "text": "International Day for Biological Diversity"
        },
        {
            "text": "We’re celebrating International Day for Biological Diversity across Defra group. You can read more about our work in the following blog post:"
        },
        {
            "text": "Don't forget to subscribe to this blog to receive an email notification every time we publish a new post."
        }
    ]
}