{
    "url": "https://forestrycommission.blog.gov.uk/2024/05/22/the-importance-of-woodland-and-trees-to-uk-bats/",
    "title": "The importance of woodland and trees to UK bats",
    "authors": [
        "Sonia Reveley"
    ],
    "categories": [
        "Nature"
    ],
    "pub_date": "2024-05-22T09:00:56+01:00",
    "content": [
        {
            "text": "Bats account for more than a quarter of mammal species in the UK and are the top nocturnal predators of flying insects. Most of the 18 bat species found in the UK evolved to use trees as roosts, while many also forage in woodland. Depending on their preference, as habitat choice can be species-specific, they search for their prey in woodland, along woodland edges and waterways."
        },
        {
            "text": "Each bat species favours different insect prey. For instance, the common pipistrelle prefers midges, while the brown long-eared bat feeds on moths and beetles."
        },
        {
            "text": "Woodland and trees are also important commuting wildlife corridors for bats, enabling them to move from their roosting sites to their foraging areas. Linear features such as woodland edges, hedgerows and tree-lined waterbodies provide much needed cover and protection from predators, and three-dimensional structures for echolocation calls to bounce off, acting as important navigational landmarks."
        },
        {
            "text": "The importance of trees to bats is further emphasised by their choice of shelter. Most bats prefer to roost in tree features like cracks, crevices and holes, when available, either high in the canopy when rearing their young or low and deep in hollows when hibernating. Some bats are woodland specialists - habitat-specific species that have a strong preference for roosting in trees and foraging in woodland."
        },
        {
            "heading": 2,
            "text": "Changes in bat populations"
        },
        {
            "text": "The latest scientific findings from the 11 bat species monitored through the National Bat Monitoring Programme, a world-leading citizen science programme, show that at a national scale, they are either stable or have increased overall since the baseline year of monitoring in 1999."
        },
        {
            "text": "However, this only reflects recent changes because bat populations have suffered significant historical declines since the start of the 20th century. In addition, we do not have trends for the other 7 UK species because they’re either hard to monitor or rare. It’s these species that are particularly vulnerable to habitat loss. A recent study looking at historic declines showed that one of our woodland specialist species, the barbastelle, declined by 99% over several hundred years,  beginning 500 years ago, likely triggered by the loss of woodland."
        },
        {
            "text": "Despite the good news that some species are stabilising, bats continue to face challenges. They have specific roost requirements, they cannot move very fast when hibernating or when young are present, they rest in their roosts during the day when most works are carried out and many have a close association with structures and habitats that humans want to change in some way. This means they are vulnerable to a suite of pressures including:"
        },
        {
            "text": "In addition, new challenges are emerging, from climate change to wind turbines, as well as potential changes to regulations, policies and wildlife laws that may impact legal protection."
        },
        {
            "heading": 2,
            "text": "Managing your woodland for bats"
        },
        {
            "text": "To help bats, landowners can ensure their woodland supports a mosaic of different habitat features. This will also help a range of other species."
        },
        {
            "text": "Retain trees (especially mature broadleaf trees) with features like hollows, snags, crevices and loose lifted bark including standing dead wood. This will provide a continuity of suitable tree roosts."
        },
        {
            "text": "Consider allocating areas of your woodland as minimum intervention sites, to allow for natural processes to take place, providing grazing/browsing is kept to a low level. High forest, areas of lapsed coppice, neglected direct planting or regeneration are potential sites to consider, especially where access and adequate infrastructure are an issue, or the area is susceptible to water logging. Such sites with their closed canopy and dense native understorey, shady, dappled interior, native trees and shrubs of different ages and heights, broken stems and fallen limbs, shimmering with humidity are humming with midges, flies and moths - the perfect bat buffet especially for our woodland specialist bats like the barbastelle, Bechstein’s bat and brown long-eared bat."
        },
        {
            "text": "Scrubby vegetation, thorny, messy and dense supports a diverse range of insects and will provide bat food and key wildlife corridors especially if located within open glades, clearings and along woodland edges."
        },
        {
            "text": "Improve the boundary along woodland edges, rides, glades and open spaces by encouraging a succession of vegetation, from scrub, tall grasses, herbaceous plants to short grasses, with overhanging vegetation and branches, scallop edges to provide shelter and pinch points across rides to allow for movement across the woodland. This will encourage a variety of insects along edge habitats, perfect hunting grounds for our more generalist bat species like the common and soprano pipistrelles."
        },
        {
            "text": "Ensure woodlands are connected and not fragmented. We know hedgerows are good wildlife corridors, but they can also provide a source of food and roosting habitats. Work with landowners outside your woodland to ensure hedgerows are retained and managed appropriately. Ideally, we want a dense structure and hedgerow trees to be retained. Reducing the frequency of hedgerow trimming and rethinking the timing of this kind of management has been found to increase insect abundance and create a varied and dense structure. Avoiding cutting in the autumn so berries and insect larvae remain readily available would also benefit bats, birds and other wildlife."
        },
        {
            "text": "As Oliver Rackham, leading ecologist of British Woodlands, once said “our woods are a living, breathing part of our heritage and therefore it is our responsibility to protect them. In owning a wood, you are playing a part in ensuring its conservation.” A woodland managed appropriately can support an impressive range of wildlife, including our only true flying mammal, our bats."
        }
    ]
}