{
    "url": "https://defrafarming.blog.gov.uk/2024/05/22/this-years-sustainable-farming-incentive-offer/",
    "title": "This year’s Sustainable Farming Incentive offer",
    "authors": [
        "Jonathan Marsden",
        "Tom Lewis"
    ],
    "categories": [
        "Sustainable Farming Incentive",
        "Things we're doing"
    ],
    "pub_date": "2024-05-22T15:02:25+01:00",
    "content": [
        {
            "text": "We recently published details of this year’s Sustainable Farming Incentive (SFI) offer along with information on Countryside Stewardship (CS) Higher Tier and how those with existing agreements can benefit. "
        },
        {
            "text": "We'll start inviting people to apply in June, through a controlled rollout, as we have done in previous years. Doing so enables us to make any adjustments needed to our service and provide applicants with the support they need to apply during the initial rollout. "
        },
        {
            "text": "The expanded SFI offer will be available to most farmers at scale by the end of July. By then, voluntary guidance will be available to help you carry out the actions.  "
        },
        {
            "text": "If you want to apply for the expanded SFI offer, the first step is to register your interest with the Rural Payments Agency (RPA). They will contact you and invite you to apply. "
        },
        {
            "text": "If you’ve already started an application, you can either complete it with the range of actions currently available or submit an Expression of Interest (EoI) for the expanded offer using the link above."
        },
        {
            "heading": 2,
            "text": "An overview of the expanded SFI offer  "
        },
        {
            "text": "SFI pays farmers to take actions that can help improve farm productivity, make farms and food production more resilient, and improve the natural environment and climate.   "
        },
        {
            "text": "From the start of the agricultural transition, we said that we would improve and expand our offer, based on feedback, so that it works for as many people as possible and delivers our target outcomes for food, farming and the environment.  "
        },
        {
            "text": "This year, the number of actions on offer through SFI will increase from 23 to 102. "
        },
        {
            "text": "Countryside Stewardship Mid Tier options have been improved and incorporated into SFI as actions. This will make it simpler, easier and faster to manage your agreement. It means that you'll have more choice and the flexibility of SFI with the breadth and scale of Mid Tier, just with less paperwork. "
        },
        {
            "text": "The 102 actions comprise:  "
        },
        {
            "text": "Among the expanded offer are new actions which will support flood preparedness and resilience, helping businesses to become more resilient to the changing climate and challenging weather conditions.  "
        },
        {
            "text": "The full list of actions and payment rates for SFI can be found in the scheme information.  "
        },
        {
            "heading": 2,
            "text": "Endorsed actions "
        },
        {
            "text": "As part of the expanded offer, we will be offering a new category of endorsed actions. "
        },
        {
            "text": "Endorsed actions require some approval by Historic England or Natural England (or their contractors) to check that the actions you wish to undertake on the land you manage are appropriate.  "
        },
        {
            "text": "We’ve done this to make more actions available without the need for a bespoke Higher Tier agreement.  "
        },
        {
            "text": "One of the 102 endorsed actions is GRH6: Manage priority species-rich grassland. Information about this action will be published in June and available for applications when the service opens fully from July 2024. A further 15 endorsed actions will follow later this year, as will the educational access action announced in January’s Agricultural Transition Plan update.   "
        },
        {
            "text": "You can learn more about endorsed actions in section 1.2 of the scheme guidance. "
        },
        {
            "heading": 2,
            "text": "Management payment increase "
        },
        {
            "text": "The SFI management payment covers the administrative costs of joining the scheme. "
        },
        {
            "text": "In February, we said we would double the management payment for the first year of each agreement. This summer, we will begin to make payments for those already in agreements and those entering into SFI for the first time.  "
        },
        {
            "text": "The management payment will pay £40 per hectare for up to the first 50 hectares entered into an eligible agreement and £20/ha for the first 50 hectares for years 2 and 3.  "
        },
        {
            "heading": 2,
            "text": "Area limits  "
        },
        {
            "text": "The following actions are intended to be used on smaller areas within a holding. As a result, you can only cover up to 25% of your holding with any combination of these actions.  "
        },
        {
            "text": "In addition, we’re applying the 25% limit to 4 of the actions in the expanded offer, because they’re similar in nature to the 6 above. This means that you will only be able to apply any combination of all 10 actions on a maximum of 25% of your holding. They are:   "
        },
        {
            "text": "We are keeping this list under review and will look to consult with the sector on capping an additional 4 actions. We've not limited these actions so far, because uptake of them tends to be limited to smaller areas already. We will confirm whether these actions will also be limited, by July: "
        },
        {
            "heading": 2,
            "text": "Taking advantage of the expanded SFI offer "
        },
        {
            "heading": 3,
            "text": "New entrants  "
        },
        {
            "text": "For the first time, those who didn’t receive Basic Payment Scheme (BPS) payments can now begin the process of applying for an SFI agreement. This means that those new to farming can enter the scheme. "
        },
        {
            "text": "The expanded offer will also be available to those farming on commons, with commons associations being able to start getting ready to apply now and then apply online later this year – more on this later in the post. "
        },
        {
            "text": "It’s worth bearing in mind that if you apply for an agreement on a Site of Special Scientific Interest (SSSI),  you must give notice to Natural England to get consent before you will receive an agreement offer and you must have consent from Natural England before you can start doing the relevant actions."
        },
        {
            "heading": 3,
            "text": "Existing SFI agreement holders "
        },
        {
            "text": "If you already have an SFI or Mid Tier agreement in place, you can make the most of the new actions straight away by taking out an additional, new agreement as long as the actions are compatible and we are not paying you for the same actions twice. The online application system will show you what actions are available on your land. "
        },
        {
            "text": "While we’re implementing improvements to SFI and rolling out the new offer, we’ll temporarily manage access to the service from Thursday 6 June. "
        },
        {
            "text": "This is so that we can ensure everyone has access to the right support as we roll out the expanded offer, and to enable us to make any adjustments required to the system in the initial phase of rolling out the expanded offer. "
        },
        {
            "text": "If you would like to be one of the first farmers to access the expanded SFI offer, you can complete a short expression of interest on the RPA website. RPA will then invite you to apply over the following weeks.  "
        },
        {
            "text": "We will gradually invite more people to apply through June and July and expect to be able to offer access to the service for most farmers at scale by the end of July.  "
        },
        {
            "heading": 3,
            "text": "Commoners  "
        },
        {
            "text": "Commoners are a vital part of the farming sector and play a particularly important role in many of England’s beautiful, protected landscapes. "
        },
        {
            "text": "Common land is eligible for the expanded SFI offer, including if it’s part of a site of special scientific interest (SSSI). "
        },
        {
            "text": "The expanded SFI offer will substantially increase the number of actions for common land because CS Mid Tier options are being merged into SFI. "
        },
        {
            "text": "Those farming on commons also have access to an additional payment for common land of £7 per hectare to help groups with the costs, given the additional complexities involved. "
        },
        {
            "text": "Applying to join the scheme is likely to be more complex for those farming on commons, because it often entails reaching an agreement between parties and using a wider range of maps and data.  "
        },
        {
            "text": "If you would like to apply for the expanded SFI offer on your common land, please send an email ruralpayments@defra.gov.uk with the subject ‘Expanded Offer Commons Interest’ and they will be able to support you to get ready to apply."
        },
        {
            "text": "Meanwhile, those farming on moorland commons can continue to access the action already available in SFI, (assess the condition of the moorland, CMOR1, previously MOR1). They’ll be able to apply for the expanded offer on their in-bye land through a separate agreement if they wish.  "
        },
        {
            "heading": 3,
            "text": "CS Mid Tier and HLS agreement holders "
        },
        {
            "text": "From September, those with a CS Mid Tier or Higher Level Stewardship (HLS) agreement will be able to end their agreement early to apply for a SFI agreement, or CS Higher Tier once it opens for applications this winter. "
        },
        {
            "text": "Farmers and land managers will be able to end their existing agreement either:  "
        },
        {
            "text": "Farmers are also able to apply for an expanded SFI agreement to run alongside their existing agreement if: "
        },
        {
            "text": "Farmers with a Mid Tier or HLS agreement coming to an end will be able to choose what land and actions to include in a new agreement, subject to meeting the eligibility rules of the scheme you’re applying for. There won’t be any requirement to carry over the same or similar actions from the previous agreement. "
        },
        {
            "text": "Farmers with an existing Higher Tier agreement will generally be expected to complete their existing agreement, and will only be able to close their agreement early by exception. This is because bespoke Higher Tier agreements are expensive to set up and involve actions that need to be taken over a longer period in order to deliver benefits, and our main priority for Higher Tier this year is to enable more people to access Higher Tier agreements.  "
        },
        {
            "text": "We will publish details on applying to end your existing Mid Tier or HLS agreement this summer. "
        },
        {
            "heading": 2,
            "text": "Next steps for Higher Tier "
        },
        {
            "text": "This summer, we will publish more information on this year’s Countryside Stewardship Higher Tier offer, setting out:   "
        },
        {
            "text": "If you’re eligible to apply for Higher Tier actions, you may need specialist advice before you start your application, which you will normally get through Natural England or Forestry Commission. You may need additional advice from Historic England or the Environment Agency.   "
        },
        {
            "text": "Later this summer, you’ll be able to start working with Natural England or Forestry Commission to prepare to apply. This includes any feasibility studies or plans you may need to complete. "
        },
        {
            "text": "You’ll be able to submit your online application for Higher Tier in the Rural Payments service this winter, with the first agreements starting from early 2025. "
        },
        {
            "text": "Applications will then stay open throughout the year, so you can choose when to apply. Agreements will normally start the month after your application is approved. "
        },
        {
            "text": "Our colleague John Place will publish a post later this week which will go into more detail on our plans for Higher Tier. "
        },
        {
            "heading": 2,
            "text": "Learn more "
        },
        {
            "heading": 3,
            "text": "Visit the SFI site"
        },
        {
            "text": "Our dedicated SFI site gives an overview of the scheme, with details of the actions, eligibility and support."
        },
        {
            "heading": 3,
            "text": "Join our webinar "
        },
        {
            "text": "On Wednesday 29 May at 11am we’re holding a webinar for farmers to go through the guidance, actions and detail for the expanded offer. To attend the online session, simply follow the Zoom link and reserve a place. It’s free. Once you’ve registered you can start asking or upvoting questions on Slido before and during the webinar. "
        },
        {
            "text": "It will be recorded so if you can’t attend, don’t worry. The video recording will be added to this post and the webinars in 2024 page after it ends.  "
        },
        {
            "heading": 3,
            "text": "GOV.UK"
        },
        {
            "heading": 3,
            "text": "Leaflets "
        },
        {
            "text": "Download, print or share the following leaflets to learn more about the actions by theme:  "
        },
        {
            "heading": 3,
            "text": "Printable document"
        },
        {
            "text": "We'll share a printable version of all the actions shortly. Once it's available, likely this week, we'll link it here."
        }
    ]
}