{
    "url": "https://environmentagency.blog.gov.uk/2024/05/22/why-what-we-do-with-our-rubbish-matters/",
    "title": "Why what we do with our rubbish matters",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Environment Agency",
        "Waste"
    ],
    "pub_date": "2024-05-22T09:20:22+00:00",
    "content": [
        {
            "text": "Rebecca Mason, Senior Adviser in our Enforcement and Waste Crime Team, shares why she works for the Environment Agency and why what we do with our rubbish matters."
        },
        {
            "text": "I have worked for the Environment Agency for over 20 years in various roles. I joined because I want to play my part in protecting our environment for people to enjoy now and in the future. It’s really important to use our natural resources wisely and reduce our impact on the environment as much as possible."
        },
        {
            "text": "I work in the Enforcement and Waste Crime Team. We work with Defra and Government to design effective regulatory frameworks to protect our environment which includes rules around moving and disposing of waste. The Environment Agency oversees these regulations, providing advice and guidance to individuals and businesses to ensure they understand what is expected of them. We have teams of officers across the country who work everyday to check businesses are operating within the limits of their environmental permits."
        },
        {
            "text": "We also have dedicated enforcement teams who work hard to stamp out crime within the waste sector. Sadly, crime is rife, but we are determined to disrupt and stop criminals and bring them to justice using our regulatory powers. In the most serious cases we can take offenders through the courts; the courts set the punishment outcome."
        },
        {
            "text": "Some criminals target households and businesses who are unaware they are handing their rubbish over to the wrong people and fuelling illegal activity."
        },
        {
            "text": "Before you hand rubbish over to someone advertising  as a waste collector, waste carrier, skip operator or that ‘man with a van’, check Waste Carriers, Brokers and Dealers (data.gov.uk) – it’s quick and simple to do. Find one on the register and ask them where they are taking your waste as it will need to end up at a site with an environmental permit or exemption."
        },
        {
            "text": "By making this quick and simple check, you are preventing criminals making a profit from disposing your waste to somewhere it is likely to harm the environment and cause a nuisance to people."
        }
    ]
}