{
    "url": "https://naturalengland.blog.gov.uk/2024/05/22/why-biodiversity-day-is-every-day/",
    "title": "Why biodiversity day is every day",
    "authors": [
        "Mike Burke"
    ],
    "categories": [
        "Biodiversity",
        "Biodiversity Net Gain"
    ],
    "pub_date": "2024-05-22T14:41:37+01:00",
    "content": [
        {
            "text": "Today (22 May) is the United Nations’ International Biodiversity Day, but at Natural England biodiversity is for life, not just for one day. Since we were established almost 20 years ago, we have been conserving and enhancing the natural environment for the benefit of present and future generations, thereby contributing to sustainable development."
        },
        {
            "text": "In the biggest change to our planning system in a generation, the Government passed new laws earlier this year to make sure development has a measurably positive impact (‘net gain’) on biodiversity, compared to what was there before development. With its mandatory 10% biodiversity net uplift, for the first time, biodiversity net gain (BNG) is putting nature right at the heart of the development process and enabling development and nature recovery to happen side-by-side. Created and enhanced habitat will be legally protected for a minimum of 30 years. Since 2018 we have been supporting Defra by engaging with stakeholders to collaboratively produce and refine this policy."
        },
        {
            "text": "Where possible developers will create or enhance natural habitat on and around development sites, so that local communities receive the benefits of an enhanced local environment. Where a development cannot achieve BNG on-site – because it is either ecologically or practically not possible – nature gains can be provided off-site, with incentives to deliver these gains locally and in a way that contributes to local nature recovery priorities. A last resort alternative, statutory biodiversity credits, is available if on-site and off-site options are not possible. Natural England will sell statutory credits to developers on behalf of Defra and the income will be invested by Defra in habitat enhancement."
        },
        {
            "text": "By providing a mechanism to pay land managers who might be farmers, NGOs, or anyone with control of some land, BNG offers another way to fund nature recovery. It can provide an alternative income stream to complement other land-based business activities. Defra analysis suggests that the annual investment in nature recovery through BNG could be between £135 million and £274 million. We know access to nature-rich spaces can help address existing known inequalities and has been linked to improving wellbeing. We anticipate that approximately £1.4 billion of social benefits will be delivered annually to people and local communities from statutory BNG."
        },
        {
            "text": "Natural England is proud to have been working on a tool to measure biodiversity losses and gains, the ‘biodiversity metric’, for more than a decade, alongside a wide range of experts. This metric is being used to measure habitats and biodiversity on all continents bar one and Defra has used this to establish a statutory biodiversity metric as part of the world-leading BNG legislation."
        },
        {
            "text": "Natural England also has a team dedicated to running the publicly accessible BNG Register which facilitates the market for off-site biodiversity units. In the three months since launch, this register is already recording a quarter of the anticipated annual biodiversity units."
        },
        {
            "text": "So, what will we see as BNG becomes the norm? We estimate that every year an area of habitat the size of Norwich will be created or enhanced under BNG. This is equivalent to two Dartmoor National Parks over the next 30-years, an incredible step towards addressing the biodiversity crisis we are all now facing."
        },
        {
            "text": "Mandatory BNG is the start of a journey and there is more to be done. We are committed to continuing to support Defra in to realise the benefits of BNG alongside all our stakeholders."
        },
        {
            "text": "BNG is not a silver bullet to solve the Nature crisis alone. It will take sustained and increasingly ambitious action from all of us around the world to make change on the scale we need. Natural England’s sustainable development team is maximising the impact of new tools for nature recovery, such as Green Infrastructure, Local Nature Recovery Strategies, and Species Conservation Strategies."
        },
        {
            "text": "Are you working to improve biodiversity? If you or someone you work with is a developer, land manager or local planning authority, read more about biodiversity net gain."
        },
        {
            "text": "We’re celebrating International Day for Biological Diversity across Defra Group. You can read more about our work in the following blog posts:"
        }
    ]
}