{
    "url": "https://dfedigital.blog.gov.uk/2022/06/29/1-year-on/",
    "title": "Why we’re stopping the head of digital role 1 year on",
    "authors": [
        "James Reeve, Head of Digital"
    ],
    "categories": [
        "community of practice",
        "professions",
        "Schools"
    ],
    "pub_date": "2022-06-29T10:35:32+01:00",
    "content": [
        {
            "text": "A year ago, I wrote a blog post saying that we were introducing a new ‘head of digital’ role at the Department for Education (DfE) to:"
        },
        {
            "text": "A lot has happened over the last year. We’ve got a new Chief Digital and Technology Officer in Charlotte Briscall (as Emma Stace left to join DWP). We’re part way through merging ESFA’s digital, data and technology teams and we’ve played a leading role in the Secretary of State’s White Paper: opportunity for all."
        },
        {
            "text": "We’ve now taken the happy decision to stop the role because it’s achieved what it intended."
        },
        {
            "heading": 2,
            "text": "What we've achieved in the last 12 months"
        },
        {
            "text": "We have sponsorship from the Secretary of State and Permanent Secretary to organise our work around a set of user-centred areas of work (often called 'portfolios')."
        },
        {
            "text": "We have 10 fantastic digital, data and technology heads of profession. Each has a growing, confident and skilled community of professionals."
        },
        {
            "text": "We’ve set up a multidisciplinary team which looks after users in the gaps between our products. This makes sure they have good experiences when moving between our services – much like the Government Digital Service’s work on One Login for Government."
        },
        {
            "text": "There are 11 cross-cutting functions (like security or infrastructure), which we'll embed in each policy area such as families, schools or skills. We'll aim to solve specific problems and journeys for users as well as doing what works for the department and the taxpayer."
        },
        {
            "text": "And most importantly, we know that true organisational and digital transformation comes from within, not from a siloed digital, data and technology function. We’ve decided that everyone in our leadership team needs to lead for digital transformation – not just one person."
        },
        {
            "text": "This is the end of this chapter, but it isn’t the end of our eagerness to learn at the DfE."
        },
        {
            "text": "As for me, I’m taking the considered step of leaving the Civil Service for a while. I’m equally excited about learning something new and working with some fantastic people."
        }
    ]
}