{
    "url": "https://actuaries.blog.gov.uk/2022/06/29/disaster-risk-finance/",
    "title": "Disaster risk finance",
    "authors": [
        "Joanne Meusz - Actuary"
    ],
    "categories": [
        "Actuary",
        "Climate change",
        "Finance",
        "Risk management"
    ],
    "pub_date": "2022-06-29T10:44:46+01:00",
    "content": [
        {
            "text": "“Alone we can do so little; together we can do so much” – Helen Keller"
        },
        {
            "text": "Working in disaster risk finance has opened my eyes to the role that actuaries, working with others, can play in addressing some of the world’s biggest challenges."
        },
        {
            "text": "In 2019, I was fortunate enough to be seconded from the Government Actuary’s Department to the Centre for Disaster Protection (‘the Centre’)."
        },
        {
            "text": "I spent 18 months working as part of their multi-disciplinary team, which included economists, international development experts, risk modellers and other risk finance experts."
        },
        {
            "heading": 2,
            "text": "Supporting countries"
        },
        {
            "text": "The Centre finds better ways to stop disasters devastating lives and economies, by supporting countries to better manage disaster risk. It was established in response to global recognition that climate change, population growth, urbanisation, and conflict are making disasters more frequent, more deadly, and more expensive."
        },
        {
            "text": "The Centre believes the relative likelihood of disasters can be predicted, and that their impact can be managed, with the right plans in place."
        },
        {
            "text": "It focuses on disaster risk finance - working with governments and organisations to create practical solutions, incentivise proactive risk management and risk financing, and support risk-informed decision making."
        },
        {
            "heading": 2,
            "text": "Wider skillset"
        },
        {
            "text": "Actuarial skills have an obvious place in this work, but I was surprised how often my wider skillset was in demand. Being a client-facing actuary often involves communicating complicated technical information effectively to a non-technical audience."
        },
        {
            "text": "I drew on these skills to lead training for stakeholders (including national governments, multilaterals organisations and non-government organisations). This enabled them to engage in disaster risk finance initiatives."
        },
        {
            "text": "My wider actuarial experience was also valuable as I provided input into ways of working to ensure the Centre delivered high quality work as it scaled up. I was able to draw on internal and external actuarial standards, and the informal good practice of actuarial firms."
        },
        {
            "heading": 2,
            "text": "Multi-disciplinary approach"
        },
        {
            "text": "At the Centre, I was struck as to how effective a multi-disciplinary approach can be. I led a quality assurance review of a disaster risk finance proposal to safeguard agricultural investments and livelihoods from weather shocks in a low-income country."
        },
        {
            "text": "In a state of panic, I pointed out to my boss how much I didn’t know. She replied, “… you aren’t supposed to – just ask the team for input.”"
        },
        {
            "text": "A week later I’d received several comments on the proposal. These included: “…it’s unlikely the proposed premiums are affordable to smallholders” and “…there should be some assessment of whether the risks covered are the right ones”."
        },
        {
            "text": "Another colleague commented: “… the calculation of the premiums doesn’t appear unreasonable, but there is insufficient information to provide assurance”."
        },
        {
            "text": "These different insights led to a holistic review that would not have been possible if approached by one type of professional in isolation."
        },
        {
            "heading": 2,
            "text": "Building expertise"
        },
        {
            "text": "Now back at the Government Actuary’s Department, I work in the team that provides actuarial support to the Centre."
        },
        {
            "text": "We are challenging ourselves to improve how we deliver for this client in what is a relatively new area. This isn’t just about building expertise in disaster risk finance. It’s also about revisiting our ways of working so that we can deliver work in true partnership with the Centre."
        },
        {
            "heading": 3,
            "text": "Notes and disclaimer"
        },
        {
            "text": "This was originally posted on the Institute and Faculty of Actuaries Blog on 24 June 2022."
        },
        {
            "text": "The opinions in this blog post are not intended to provide specific advice. For our full disclaimer, please see the About this blog page. "
        }
    ]
}