{
    "url": "https://socialworkwithadults.blog.gov.uk/2022/06/29/keep-calm-and-call-an-amhp/",
    "title": "Keep calm and call an AMHP",
    "authors": [
        "Jason Brandon"
    ],
    "categories": [
        "Events",
        "Knowledge and skills",
        "Mental health",
        "Our profession"
    ],
    "pub_date": "2022-06-29T08:27:47+00:00",
    "content": [
        {
            "heading": 2,
            "text": "National AMHP Day 2022 is here"
        },
        {
            "text": "With so many recent challenges and experiences in the pandemic, I can’t think of a more suitable title to this blog post, which describes the dignity and professionalism our approved mental health professional (AMHP) workforce as they helped many people through a period of national crisis."
        },
        {
            "text": "Through the toughest of times and despite relentless workloads, our AMHP colleagues continued to promote the rights, strengths and wellbeing of people, families and communities, helping them access the necessary care, treatment and support they needed."
        },
        {
            "text": "With this in mind, I am delighted to blog about National AMHP Day and raise the profile of this incredible workforce. Indeed, I recall the last event in 2017, when great effort was invested in the National AMHP Benchmarking exercise in response to growing concerns about workforce shortages."
        },
        {
            "text": "Since 2017, we have seen a welcome MHA reform agenda within which the AMHP role was suitably acknowledged. In his Modernising the Mental Health Act final report (2018), Sir Simon Wessely made this reference:"
        },
        {
            "heading": 2,
            "text": "Clarity of mind and purpose"
        },
        {
            "text": "I can also mention a number of significant milestones, which have subsequently influenced the profession and provided greater opportunity for clarity, purpose and quality assurance."
        },
        {
            "text": "The publication of recommendations within the National AMHP Workforce Strategy by the Chief Social Workers Office (DHSC) in 2019 has laid the foundations for a wide range of collaborative initiatives, not only developing career pathways, but also across the operational environment within which AMHPs carry out their critical role."
        },
        {
            "text": "In 2020, the National AMHP Service Standards were made available for councils to self-assess the status of their respective offer and develop an action plan enabling the co-production of local improvement plans."
        },
        {
            "text": "Through 2021/22, Skills for Care have worked with local authorities to co-ordinate increased investment supporting additional AMHP candidates to undertake their training."
        },
        {
            "text": "The advent of Breathing Space in 2021 has seen a diversification of the AMHP function beyond the statutory responsibilities of the Mental Health Act, where Government located an integral gatekeeping function for people in need of debt respite."
        },
        {
            "text": "Looking ahead and noting the priority of dealing with the ‘AMHP sufficiency’ question, there is a lot to be heartened about when recognising the tremendous strides to raise the profile of the AMHP role across government, NHS and within our local communities."
        },
        {
            "text": "The AMHP workforce continues to demonstrate interest and commitment to the co-production of service improvement alongside the increasing involvement of those with lived experience being subject to the Act."
        },
        {
            "text": "The rise of the Black and Minority Ethnic AMHP Leads Forum has helped to counter the over-representation of our diverse communities within detention numbers."
        },
        {
            "text": "The AMHP Leads Network is now an established cog in many strategic and tactical wheels both locally and nationally with a well established reputation for professionalism and integrity."
        },
        {
            "text": "Of course, there is more work to do with the MHA Reform/ MH Transformation agenda. I look forward to working with AMHP colleagues to promote their voice and expertise which has a real and direct impact on people needing interventions at a time of crisis."
        }
    ]
}