{
    "url": "https://civilservice.blog.gov.uk/2022/06/29/my-only-guaranteed-hot-meal-was-my-free-school-lunch/",
    "title": "My only guaranteed hot meal was my free school lunch",
    "authors": [
        "Vicky McGurk"
    ],
    "categories": [
        "A great place to work",
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Ambitious Civil Service",
        "Uncategorized"
    ],
    "pub_date": "2022-06-29T08:31:06+00:00",
    "content": [
        {
            "heading": 3,
            "text": "From part-time AO to thriving senior leader in the Civil Service, Vicky McGurk is living proof that you can overcome childhood struggles and make life a success. Interview: Lorraine McBride"
        },
        {
            "text": "Born and raised in one of Blackburn’s poorest council estates, it’s fair to say my early life wasn’t easy. I went to a comprehensive school where my only guaranteed hot meal was my free school meal. "
        },
        {
            "text": "Life was tough being the eldest of five, with parents on benefits, who couldn’t read, write, or help with homework. With no quiet spaces or money for a computer, I shared a cramped bedroom with two younger sisters."
        },
        {
            "text": "Unfortunately growing up in poverty meant I suffered several adverse childhood experiences, including sexual abuse (within the community) that had a profound impact on my early life, in particular my behaviour as a teenager, where I was loud and had to appear physically and mentally tough to feel safe. "
        },
        {
            "heading": 4,
            "text": " Trouble for fighting"
        },
        {
            "text": "I wasn’t an easy teenager and was often in trouble for fighting, in lower sets at school. At the end of Year 7, my headteacher took me aside telling me: “Half the teachers feel sorry for you, Vicky, but the others fear you. Don’t let your past life dictate your future.” "
        },
        {
            "text": "That was a turning point for me, and this teacher assisted me thereafter.  It was invaluable advice and I rapidly moved through the sets, leaving school as Head Girl, and today I’m a governor of the school, but my journey hasn’t been plain sailing. "
        },
        {
            "heading": 4,
            "text": "Social class shame "
        },
        {
            "text": "I remember at around age seven going to a job centre with my mum, and it was the first time I ever felt shame for my social class, when the supervisor was rude. I didn’t understand why the job centre couldn’t give her a job, and vowed that I’d one day work here and change the way people were treated. "
        },
        {
            "text": "This experience was my call to action to join the Civil Service and at 17, I joined the Department for Work and Pensions as a part-time administration officer.  Although I’d worked since the age of 13 to help pay the bills, the Civil Service was my first grown up job, where I realised I could aspire to be the person I wanted to be."
        },
        {
            "text": "By the age of 25, I was manager of the same job centre where the benefits clerk had been rude to my mum. I vowed that everybody in my team would speak respectfully to our public, and they were - and are - a brilliant team of civil servants. I later rose to a senior position across the Civil Service, and am now in the Department for Health and Social Care (DHSC)."
        },
        {
            "heading": 4,
            "text": "Future Leaders Scheme"
        },
        {
            "text": "I’m on the Future Leaders Scheme (FLS) with aspirations to go even higher. You must really shine against other applicants to get onto the course, but once you’re in, the world’s your oyster! "
        },
        {
            "text": "Through the FLS, I have the opportunity to lead a theme and present sessions at Civil Service Live, which I grabbed with both hands; I’m excited to deliver the Smashing the Glass Ceiling session as I’m so passionate about it. In preparing the session, I’ve looked both at my own journey and spoken to other civil servants about their journeys. "
        },
        {
            "heading": 4,
            "text": "Inspirational stories"
        },
        {
            "text": "I want civil servants to hear inspirational stories about how they’ve overcome adversity to forge careers in the Civil Service despite their struggles, whilst at the same time, exploring the progress Civil Service is making in regions, expanding opportunities."
        },
        {
            "text": "Anything is possible with hard work, effort and putting yourself out there. My background has shaped my thinking, and I’m so proud to belong to the social mobility network within the DHSC. Levelling up is key to progression. "
        },
        {
            "heading": 4,
            "text": " AMCS"
        },
        {
            "text": "In A Modern Civil Service, the government plans to move thousands of roles around the country to widen the talent net and opportunities. They also want to twin Places for Growth with social mobility, which is really important if you face multiple hurdles. The Smash the Glass Ceiling mantra is all about inspiration.  "
        },
        {
            "text": "In my private life, I’ve adopted two children and later conceived two children naturally. However, I’ve faced other challenges too, related to being a child in poverty and suffering abuse, which was comfort eating and obesity."
        },
        {
            "heading": 4,
            "text": "Overcoming obesity"
        },
        {
            "text": "By 30, I was more than 25 stone but after I had children, I wanted to be a healthy role model and joined Slimming World, losing 14.5 stone. It definitely wasn’t easy but was evidence of my past life impacting my future life."
        },
        {
            "text": "Away from work, I’m a huge community volunteer, sharing my experience and inspiration within charities and the wider community."
        },
        {
            "text": "I want to get the message out that the Civil Service is an organisation where you can reach your potential, no matter what your start in life is. If you’ve got the belief and skills, there’s nothing to stop you. I started as a teenage AO, yet today, I lead teams across the UK and Europe - I’m so proud of that."
        },
        {
            "heading": 4,
            "text": "Own who you are"
        },
        {
            "text": "My tip for smashing the glass ceiling is to own who you are. For far too long, I’ve met people who changed their accents to get on in the Civil Service. I always tell them, “Be proud of your accent and where you come from - your experiences make you stand out from the crowd.”  "
        },
        {
            "text": "Whenever I’m involved in policy or operations, I use my real-life experiences and consider, how will this land? I represent the people that I serve in every role that I’ve ever done, and that’s a huge strength. "
        },
        {
            "heading": 4,
            "text": " Reach for stars"
        },
        {
            "text": "I encourage colleagues to be authentic and say, don’t just reach for the easiest cloud. Reach for the moon and the stars because it is achievable. If you believe in yourself, have a strong personal development plan, the Civil Service will wrap itself around you to ensure you can reach the moon and stars. You just need to believe it!"
        }
    ]
}