{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2022/06/29/new-systems-thinking-products-for-civil-servants/",
    "title": "New systems thinking products for Civil Servants",
    "authors": [
        "Selina Khan"
    ],
    "categories": [
        "Capability & Skills",
        "Specialism Deep Dives"
    ],
    "pub_date": "2022-06-29T15:04:11+01:00",
    "content": [
        {
            "text": "The Government Office for Science is excited to announce the publication of a new suite of systems thinking documents for civil servants. We have designed these to be accessible and relevant, with the aim of supporting better evidence-based policy making. Our documents include an Introduction to Systems Thinking for Civil Servants, Civil Servants Systems Thinking Journey, Civil Servants Systems Thinking Toolkit and Systems Thinking Case Study Bank. We also signpost other useful systems thinking resources on the webpage, including the Defra systems thinking primer and a video on systems thinking by policy profession featuring Tamara Finkelstein and Sir Patrick Vallance."
        },
        {
            "text": "https://www.gov.uk/government/publications/systems-thinking-for-civil-servants."
        },
        {
            "text": "What is systems thinking and when is it useful? "
        },
        {
            "text": "When I joined the Government Office for Science in October, I had just finished my PhD in toxicology and had not heard of systems thinking before. This meant that I spent a lot of time reading and getting up to speed with how it can be applied across government!"
        },
        {
            "text": "I quickly realised that systems thinking is a valuable collection of tools and approaches that are particularly useful for tackling complex policy problems. These are ‘wicked’ problems where the impacts of a policy are unclear and unpredictable and require a deeper understanding of the whole system along with its interdependencies. This applies to the majority of problems that are dealt with across government; examples include achieving net zero, levelling up and tackling obesity."
        },
        {
            "text": "These challenges involve many people and organisations with competing priorities and have a bearing on many adjacent policy areas. The success of an intervention often relies on collective action taken across boundaries. No single individual, agency or department can tackle a complex problem alone. Nor should they have to."
        },
        {
            "text": "Our suite of systems thinking documents "
        },
        {
            "text": "Our systems thinking documents are intended for civil servants working across government, regardless of grade, department, background or profession. They assume no prior knowledge of systems thinking and aim to help civil servants design resilient interventions to tackle complex policy issues. We have worked hard to ensure that they are suitable for busy and time-pressed civil servants who want to actively embed systems thinking into policy design and delivery. Our documents include:"
        },
        {
            "text": "The Civil Servants Systems Thinking Journey and Toolkit were developed through extensive collaboration with cross-government groups, professions and external academies. These include Policy Profession, Cabinet Office, the Systems Thinking Interest Group and the Royal Academy of Engineering, as well as many others. Experts from each of these groups provided advice and peer review at multiple stages."
        },
        {
            "text": "The Case Study Bank was developed by interviewing 14 diverse systems thinking practitioners across government, who were identified using the systems thinking interest group and established networks. These individuals vary in department, grade and profession."
        },
        {
            "text": "We hope that these products encourage you to begin incorporating some systems thinking into your work! If you would like more information on these documents or want advice on how to start using systems thinking in your work, please feel free to contact me at systems@go-science.gov.uk."
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}