{
    "url": "https://deframedia.blog.gov.uk/2022/12/24/coverage-on-water-targets-and-river-basin-management-plans/",
    "title": "Coverage on water targets and River Basin Management Plans",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Environment Agency",
        "water",
        "Weekly stories"
    ],
    "pub_date": "2022-12-24T10:11:07+00:00",
    "content": [
        {
            "text": "There has been coverage in the Guardian and the Times following the Environment Agency’s publication of updated River Basin Management Plans for England."
        },
        {
            "text": "It incorrectly claims that the target for Good status of England’s water bodies has moved back to 2063. This is not true – it remains at 2027. This is a legal target set out in the Water Framework Directive (WFD)."
        },
        {
            "text": "There is, however, an exemption for a small number of persistent chemicals – known as uPBT (ubiquitous, persistent, bioaccumulative, toxic) substances. This exemption is set out in the WFD and is fully compliant with the regulations."
        },
        {
            "text": "It recognises that although we have taken action to prevent them entering the water – including national and international bans – there is no feasible technical solution to remove them entirely and they will take time to naturally drop to required levels."
        },
        {
            "text": "It is an issue that countries across the EU are facing."
        },
        {
            "text": "Over 90% of England’s water bodies would be at Good Chemical Status (monitoring for around 50 priority substances) were it not for the presence of these 3 substances. The WFD ‘one out all out’ rule water must be at Good for all elements and will fail overall if just one element fails. Almost 80% of individual tests meet the threshold for good ecological status but only 16% of surface waters achieve good ecological status."
        },
        {
            "text": "The 2063 date for these persistent chemicals mentioned is not a new target, it is a modelling prediction by the Environment Agency on how long it will take for the levels to dissipate under the exemption."
        },
        {
            "text": "An Environment Agency spokesperson said:"
        },
        {
            "text": "The Government will outline further detail on plans to improve water quality as part of the Environmental improvement Plan to be published next year."
        }
    ]
}