{
    "url": "https://marinescience.blog.gov.uk/2024/09/17/cefas-seascapes-project-understanding-the-benefits-and-trade-offs-associated-with-managing-marine-natural-capital/",
    "title": "Cefas’ Seascapes project: understanding the benefits and trade-offs associated with managing marine natural capital",
    "authors": [
        "Clement Garcia",
        "Frances Mynott"
    ],
    "categories": [
        "Aquaculture",
        "biodiversity",
        "blue carbon",
        "Climate Change",
        "Deep-sea",
        "Fisheries",
        "marine protected areas",
        "mNCEA",
        "Monitoring",
        "natural capital",
        "Policy",
        "Pollution",
        "Science"
    ],
    "pub_date": "2024-09-17T10:20:04+01:00",
    "content": [
        {
            "text": "By Clement Garcia and Frances Mynott, Cefas leads of the mNCEA programme."
        },
        {
            "text": "The Cefas-led project, ‘A seascape natural capital approach for sustainable management (Seascapes)’, is part of a 3-year Defra funded marine Natural Capital and Ecosystem Assessment (mNCEA) programme. mNCEA is delivering evidence, tools, and guidance to integrate natural capital approaches into policy and decision making for marine and coastal environments. In this post, we highlight how the project will improve understanding of marine natural capital assets, uses, values and benefits. It will also assess the trade-offs and synergies across ecosystem services provision in support of sustainable marine management in England."
        },
        {
            "text": "Marine natural capital assets such as species, habitats, natural processes and functions, underpin the provision of vital goods and services that support the economy and human well-being. The flows of ecosystem services and goods from natural capital assets (along with other forms of capital e.g., financial capital) enable benefits to be generated for our economy, society and the environment (Figure 1)."
        },
        {
            "text": "In England, marine and coastal environments are recognised as providing a range of benefits such as the provision of food, energy, clean water, wildlife, recreation, enjoyment of the natural environment and many more. However, pollution, the unsustainable use of coastal and marine resources, biodiversity loss and climate change can adversely affect marine natural capital and degrade ecosystem services and benefits. A natural capital approach therefore allows us to consider the often-complex relationship between nature (natural assets), the ecosystem services they support, and the benefits derived from them."
        },
        {
            "text": "To make informed choices around how to protect and manage the marine environment, decision-makers require evidence and tools that enable them to understand the full range of goods and services provided by our marine environment in a more holistic way. These tools need to be capable of understanding how decisions over use of the marine environment impact marine natural capital, especially with respect to the potential losses, gains and trade-offs in ecosystem services and benefits, and the broader impacts to society and nature."
        },
        {
            "text": "A spotlight on the Seascapes project "
        },
        {
            "text": "The Cefas-led Seascapes project aims to deliver robust scientific evidence, tools and case studies to illustrate the added-value of taking a natural capital approach in marine decision-making. The project spans catchment to coast, nearshore and to offshore marine environments in English waters, and takes an integrated approach in combining environmental, social and economic considerations into a natural capital framework."
        },
        {
            "text": "Overall, the Seascapes project will help policymakers and decision makers increase their understanding of the different uses and values of marine natural capital for people and society, as well as the competing uses and pressures facing marine resources. It also aims to provide more holistic understanding of the benefits and complex trade-offs involved in managing our marine environment, with the aim of supporting the sustainable use of coastal and marine environments."
        },
        {
            "text": "The Seascapes project (now in Phase 2) brings together a range of interdisciplinary science that Cefas has developed during the mNCEA programme as well as from research outside of the programme. Focus areas of the Seascapes project include:"
        },
        {
            "text": "Now more than ever we need to practically embed a natural capital approach into business-as-usual monitoring, advice and science for our marine environment. The Seascape project is a step towards the transformational change that is necessary to support the UK Government’s commitments to protecting and enhancing our natural capital, halting the decline in our biodiversity, and adapting to and mitigating against climate change."
        },
        {
            "text": "The mNCEA programme is led by Defra and co-delivered in partnership with Cefas, Environment Agency, Joint Nature Conservation Committee, Marine Management Organisation, and Natural England."
        },
        {
            "text": "Outputs from year one will be published shortly."
        },
        {
            "text": "References:\nNatural Capital Committee (2017) Natural Capital Committee. How to do it: a natural capital workbook version 1. Available online at: How to do it workbook (publishing.service.gov.uk)"
        }
    ]
}