{
    "url": "https://nationalscreening.blog.gov.uk/2024/09/17/consultation-opens-into-uk-nsc-recommendation-on-dental-disease-screening/",
    "title": "Consultation opens into UK NSC recommendation on dental disease screening",
    "authors": [
        "Peggie Huangfu"
    ],
    "categories": [
        "General"
    ],
    "pub_date": "2024-09-17T14:14:18+01:00",
    "content": [
        {
            "text": "The UK National Screening Committee (UK NSC) has opened a consultation on screening for dental disease in children aged 6 to 9 years."
        },
        {
            "text": "The UK NSC recognises that dental disease, most commonly in the form of tooth decay, also known as dental caries or cavities, is a very important health issue as well as being one of the world’s most common diseases."
        },
        {
            "text": "Numerous reviews have found no evidence that screening could help reduce levels of the disease."
        },
        {
            "text": "Due to this lack of evidence, the UK NSC is now consulting on a proposal to remove its screening recommendation on dental disease in children from the list of recommendations it regularly reviews until or unless new evidence emerges that suggests it should be reviewed again."
        },
        {
            "heading": 2,
            "text": "Participate in consultation"
        },
        {
            "text": "Visit the dental disease recommendation page for more information and to participate in the consultation."
        },
        {
            "text": "The consultation opened today for 6 weeks. "
        },
        {
            "text": "Responses to the consultation must be submitted by 11.59pm on Tuesday 29 October."
        },
        {
            "heading": 2,
            "text": "About the condition"
        },
        {
            "text": "Tooth decay is caused when acid, produced by bacteria, breaks down food on the surface of teeth. Sugars are the bacteria’s main energy source which is why too much sugary food or drink is a major risk factor."
        },
        {
            "text": "The 2022 Oral Health Survey found about 1 in 4 children in England aged 5 have dental caries, similar to the prevalence found in the 2017 and 2019 surveys."
        },
        {
            "text": "According to the 2022 report, the condition is nearly 3 times more common in the most deprived areas compared to the least deprived. The survey also found higher prevalence among ethnic minority groups. Almost half of children in the ‘Other Ethnic Groups’ category and one third of children in the ‘Asian/Asian British’ category had dental decay."
        },
        {
            "heading": 2,
            "text": "The evidence"
        },
        {
            "text": "The UK NSC does not recommend routine screening for dental disease in children. This recommendation is based on evidence reviews it conducted in 2013 and 2019."
        },
        {
            "text": "Those reviews found no relevant studies into the effectiveness of screening for dental disease in children and suggested that screening for dental disease is not effective in reducing levels of dental disease. In November 2023, the US Preventive Services Task Force published a systematic review which also concluded there was not enough evidence to support routine screening for dental disease in children."
        },
        {
            "text": "The UK NSC secretariat has now conducted a thorough assessment of the US review and examined new studies that had emerged up to August 2024."
        },
        {
            "text": "We concluded that there is no new evidence since the 2019 review indicating that screening for dental disease effectively reduces untreated cases among children."
        },
        {
            "text": "We found:"
        },
        {
            "text": "Due to this lack of evidence, we are now consulting on a recommendation to:"
        },
        {
            "heading": 2,
            "text": "Focus on prevention and timely care"
        },
        {
            "text": "Dental disease is an important problem. Prevention, detection and prompt treatment of tooth decay is crucial, enabling timely intervention that can prevent pain, tooth loss, and harm to permanent teeth."
        },
        {
            "text": "Prevention initiatives are not in the remit of the UK NSC. However, the committee is strongly supportive of interventions that can reduce dental disease among children."
        },
        {
            "text": "The UK NSC’s evidence reviews have suggested that efforts should be increased to detect children at high risk in areas with high levels of dental decay. This includes those who live in deprived areas and children who have other medical conditions."
        },
        {
            "text": "Existing guidance in the UK 1,2,3 already focuses on prevention with an emphasis on effective interventions for improving dental health."
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK National Screening Committee. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, email uknsc@dhsc.gov.uk."
        }
    ]
}