{
    "url": "https://digitalpeople.blog.gov.uk/2024/09/17/get-cloud-certified-this-autumn/",
    "title": "Get Cloud Certified this Autumn!",
    "authors": [
        "Martin Turner, Senior Change Delivery Manager, CDDO"
    ],
    "categories": [
        "Capabilities",
        "Community",
        "Digital data and technology",
        "Government Digital and Data",
        "Skills and Learning",
        "Training and progression"
    ],
    "pub_date": "2024-09-17T18:30:00+01:00",
    "content": [
        {
            "heading": 3,
            "text": "Introduction"
        },
        {
            "text": "Following the remarkable success of last October’s Get Cloud Certified programme, the Central Digital and Data Office (CDDO) is pleased to announce the return of the programme, now featuring an expanded range of innovative training opportunities with a range of different cloud providers. "
        },
        {
            "heading": 3,
            "text": "Eligibility"
        },
        {
            "text": "As part of the ‘Transforming for a digital future roadmap’, we’re aiming for over 90% of digital, data and technology professionals to undertake related training at least once a year. This programme is open to anyone with a public sector email address (such as gov.uk, gov.scot, gov.wales, nhs.uk, police.uk)."
        },
        {
            "heading": 3,
            "text": "The Programmes"
        },
        {
            "text": "Following this, we have officially launched two of our Cloud training programmes beginning in September: CDDO & AWS Solutions Architect Pro Bootcamp and CDDO/AWS CloudUp For Her Practitioner programme. These programmes are both being launched at maximum capacity, with all 25 spaces being filled for Solutions Architect, and with over 400 registered participants for CloudUp for Her. In addition the Microsoft TechHer For Government has received over 5000 expressions of interest, and will launch in October. However, if you missed these programmes, don't worry! At CDDO, we will be launching a year round initiative to encourage your participation in cloud training and certification programmes across a range of different providers."
        },
        {
            "text": "This year, we are extending the “Get Cloud Certified this October” initiative run last year, to cover the entire Autumn season, providing more participants the chance to get involved. Whether you are looking to expand your knowledge of cloud, enhance your skills, or are considering a role in cloud, our comprehensive training programmes provide an excellent opportunity to master the fundamentals of cloud. These programs also provide flexibility, and can be done at your own pace."
        },
        {
            "text": "This will be an exciting season for those in the UK public sector to learn and achieve a Cloud certification as CDDO has secured free or discounted training, support classes and exam vouchers. And if you are already Cloud certified, why not aim for the next level of certification, or learn about services from a different cloud provider?"
        },
        {
            "text": "We have dedicated listings for each Cloud provider detailing training and events that are running this Autumn to help you learn, as well as show you how to access free or discounted exam vouchers. You might also have additional training available through existing learning and development arrangements your organisation already has in place with third party training providers - so do search your existing intranet to see if you have access to year-round Cloud training or a Digital Academy in your organisation!"
        },
        {
            "heading": 3,
            "text": "Testimony from Jude Gallagher"
        },
        {
            "text": "The OGCS team will be delivering a calendar of Cloud Knowledge Drops (or OGCS Bytes sessions). These tackle some of the wider challenges of Cloud in public sector so if you would like to be on the mailing list email us at OGCS@cabinetoffice.gov.uk"
        },
        {
            "heading": 3,
            "text": "Want to know more?"
        },
        {
            "text": "To learn more about the training programmes being offered to you at CDDO, please follow the registering links from the providers below:"
        },
        {
            "heading": 3,
            "text": "Cloud Providers participation in CDDO Get Cloud Certified this Autumn"
        }
    ]
}