{
    "url": "https://hmlandregistry.blog.gov.uk/2024/09/17/its-now-much-easier-to-add-additional-parties-to-digital-registration-service-applications/",
    "title": "It’s now much easier to add additional parties to Digital Registration Service applications",
    "authors": [
        "Louise Mulhern, Associate Product Manager (Digital Registration Service), HM Land Registry Customer and Strategy"
    ],
    "categories": [
        "Digital services"
    ],
    "pub_date": "2024-09-17T15:35:06+01:00",
    "content": [
        {
            "text": "HM Land Registry now processes more than 1.5 million applications annually through the Digital Registration Service (DRS), which was rolled out in 2021. 'Digital applications' play an essential role in helping HM Land Registry to provide faster registration services and enable us to automate more of our work, which reduces the risk of human error."
        },
        {
            "text": "Since its launch in 2021 we have made several improvements to the service and we continue to do so with the help of conveyancers, legal professionals and DRS users, who provide us with invaluable feedback and insight on the service."
        },
        {
            "text": "Many of you have told us you find it difficult to enter additional parties to applications, for example where a proprietor has died or a guardian is acting. Our research has shown that this results in requisitions because parties are not accounted for in panel 13 of the e-AP1."
        },
        {
            "text": "This is usually because an additional party to the deed was not entered as transferor, an attorney acting for a party was not entered, or a transaction was mis-selected or not selected at all, for example a charge or discharge."
        },
        {
            "heading": 2,
            "text": "So what have we done to address this issue?"
        },
        {
            "text": "If you are applying to register a transfer of whole, a transfer of part, or a transfer of charge, you can now add the following parties to your application easily."
        },
        {
            "text": "You are now able to amend the name of a transferor or remove them from the application entirely, add an attorney for any part, and select the capacity in which they are acting.  You can also add representation, verify their identity when prompted and provide evidence to support an amendment, removal or addition."
        },
        {
            "text": "All this information will populate the appropriate panels of your e-AP1."
        },
        {
            "text": "You can review the transferor fields and amend them until you are confident that all the names match the register and your deeds, and that everyone involved is accounted for."
        },
        {
            "text": "Our changes mean you can ensure that names are entered correctly and check that they match across all the documents you lodge with your application. You’ll also be prompted to attach all the evidence required. These enhancements should lead to fewer errors and consequently reduce requisitions."
        },
        {
            "text": "We’d like to extend our thanks to everyone who took part in the user research and testing that helped us to develop this feature."
        },
        {
            "heading": 2,
            "text": "Upcoming changes"
        },
        {
            "text": "There will be extra help available with selecting the correct application type, including additional guidance on how to lodge a lease extension at the same time as a transfer on to a new owner."
        },
        {
            "text": "You’ll be able to amend and add additional party landlord and tenant details, review incremental improvement of transaction availability and selection. There will also be additional validation, including Register of Overseas Identity and Declaration of Trust, and a reminder to indicate that restrictions are in the register and require compliance."
        },
        {
            "heading": 2,
            "text": "What else can customers do to reduce errors?"
        },
        {
            "text": "As applications can be saved for 90 days before submission, it’s advisable to  start entering data as soon as possible. If your application includes a TR1, this would allow you to auto-populate the TR1 in DRS, thus ensuring that names entered are correct and match other documents."
        },
        {
            "text": "You can read how Harrison Clark Rickerbys has been using DRS to reduce inconsistencies, and saving time, by using DRS in this way."
        },
        {
            "text": "We are constantly evaluating the service and trying to enhance it to improve efficiency for both customers and HM Land Registry. Please continue to give feedback and tell us if you are having difficulty using the service in any way."
        },
        {
            "text": "See our guidance page for more detail on how to enter additional parties."
        }
    ]
}