{
    "url": "https://digitaltrade.blog.gov.uk/2024/09/17/radiating-intent-improving-how-product-and-delivery-communicate-in-dbt/",
    "title": "Radiating intent: improving how product and delivery communicate in DBT",
    "authors": [
        "Billy Glover, Lead Product Manager"
    ],
    "categories": [
        "Professions"
    ],
    "pub_date": "2024-09-17T10:50:01+01:00",
    "content": [
        {
            "text": "Billy Glover"
        },
        {
            "text": " We recently brought together our Delivery and Product communities for an away day at our Cardiff office. Getting everyone in a room together, on an equal level, allowed us to strengthen connections with our colleagues. This is a vital part of building resilient teams. It also gave us the time to put our heads together on some key issues.  "
        },
        {
            "text": "Three key areas came out of our session, which we structured into a series of circles within each other. They focused on communicating with: "
        },
        {
            "text": "Each of these represents a slightly smaller, more specialised audience for us to talk to, and therefore our approach must change.  "
        },
        {
            "text": "I ran a session using some techniques picked up from Liberating Structures London. This ensured that everyone’s voice was heard and that the session was a safe space. We  generated and triaged ideas in small groups, before feeding back to the main session and sorting our thoughts."
        },
        {
            "heading": 2,
            "text": "What we are trying to achieve"
        },
        {
            "text": "As a Lead Product Manager in DBT, it is important to me that the teams I work with have the right tools to talk about their great work. I want them to be recognised for the impact they are making for our users and ensure that they are visible across the organisation."
        },
        {
            "text": "Ultimately, we want to be able to generate support for what we are doing. At the same time, allowing others to learn from our work only makes our products better. We also need users to be able to hear about the changes we are making. Finally, we improve how others see us by being open and celebrating our success. This increases the pace of further delivery."
        },
        {
            "heading": 2,
            "text": "Working with our community"
        },
        {
            "text": "The first thing the team identified during our away day was that ‘grassroots’ or flexible approaches to communication were key. By working transparently and openly in formal and informal networks, we create the space to both illustrate our intent and create collaboratively. For example, sharing design history to show the product journey, and the reasoning behind iterative changes, rather than simply telling."
        },
        {
            "text": "We open up a whole new avenue for both communicating and learning if we include users in our ‘community’. Rather than information moving in one direction, we can bring them in at an early stage, using prototypes to fully involve them in the service design."
        },
        {
            "heading": 2,
            "text": "The machinery of the Civil Service"
        },
        {
            "text": "Next, we discussed how we understand how the broader machinery of the civil service works. Some of my colleagues are ace “bureaucracy hackers”. They move swiftly and seamlessly through the department’s internal structures to get products delivered. They helped us see that sometimes a tightly drafted memo is more effective than weeks of show and tells or engagement workshops."
        },
        {
            "text": "Knowing when to write a paper, what information to include and how to get a decision made are key skills for any civil servant. That includes those in DDaT too. During the session we recognised that those of us who have Civil Service experience outside of DDaT really bring an extra dimension to their role. They can help us all develop our skills."
        },
        {
            "text": "This is not to say that governance or wider processes are a burden; in fact, they can give us great leverage. To be effective Delivery and Product Managers we need to know how to engage with our stakeholders. Working through this with the team really made me realise what I need to do in my role as a leader.  I must ensure that they all have the confidence and skills to put themselves in the right room at the right time to get things done."
        },
        {
            "heading": 2,
            "text": "Talking amongst ourselves"
        },
        {
            "text": "Finally, we discussed our smallest circle; ourselves. Our approach to agile development at DBT provides another layer of the toolkit. We use different techniques to work in the open and receive feedback on what we are delivering. These include Show and Tells, where we share the work done over the previous fortnight, and weeknotes, where team members publish updates on their work. Ideally, they create a dialogue between the team and their colleagues. This allows for healthy feedback and even generates new ideas."
        },
        {
            "text": "The shift to hybrid work has allowed us to change how we use these techniques and draw them into a more ‘community’ approach. Show and tells, for example, can now be truly open. We are in a department with users based in countries all over the world. Being able to host everyone in a virtual room has allowed us to gain much broader perspectives on our work."
        },
        {
            "text": "We agreed that the better we can communicate in this smallest, inner circle, the more we can engage with our stakeholders and community. This is important as that is where our efforts can produce the most value."
        },
        {
            "heading": 2,
            "text": "Taking this forward"
        },
        {
            "text": "So, what do we do with all of this? For me, it’s about ensuring the teams feel comfortable and safe to try out new ideas.  These can lead to improvements, both within our structure and more widely.  Teams might want to consolidate their show and tells to reach a broader group of stakeholders, or travel to other offices to share their work in the open."
        },
        {
            "text": "The away day gave the Product and Delivery communities valuable time to actively think about who they are trying to reach, and what they are trying to achieve. It allowed them to refocus on their goals. Stepping back and looking at how we are doing is always valuable, especially if we find that if something isn’t working, we can just change it."
        }
    ]
}