{
    "url": "https://mhclgmedia.blog.gov.uk/2024/09/17/the-renters-rights-bill/",
    "title": "The Renters’ Rights Bill",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Housing"
    ],
    "pub_date": "2024-09-17T16:34:20+01:00",
    "content": [
        {
            "text": "Last week we introduced our Renters’ Rights Bill to Parliament. This landmark reform is set to be the biggest overhaul to the private rented sector for over 30 years, delivering new and stronger protections for tenants."
        },
        {
            "text": "There has been widespread coverage across national media, including the BBC, the i Paper, The Independent and the Mirror which all led with the Section 21 ‘no fault’ evictions ban."
        },
        {
            "text": "The Times, The Sun, the Financial Times  and ITV News provided key information for tenants, emphasising other aspects of the Bill. These include a ban on rental bidding wars, an end to in-tenancy rent increases and the introduction of the Decent Homes Standard and Awaab’s Law to the private rented sector which will drive up standards and empower tenants to challenge dangerous conditions."
        },
        {
            "text": " The Housing Minister Matthew Pennycook wrote exclusively in Daily Telegraph, explaining that landlords have nothing to fear from our sensible reforms. He said “The Bill also recognises the rights of the majority of responsible landlords who provide quality homes to their tenants. They should know they have nothing to fear from our reforms.”"
        },
        {
            "text": "The Housing Minister was also interviewed on BBC Breakfast, Times Radio, Sky News, LBC and Good Morning."
        },
        {
            "text": "Deputy Prime Minister, Angela Rayner said:  "
        },
        {
            "text": "“Renters have been let down for too long and too many are stuck in disgraceful conditions, powerless to act because of the threat of a retaliatory eviction hanging over them.  "
        },
        {
            "text": "“Most landlords act in a responsible way but a small number of unscrupulous ones are tarnishing the reputation of the whole sector by making the most of the housing crisis and forcing tenants into bidding wars.   "
        },
        {
            "text": "“There can be no more dither and delay. We must overhaul renting and rebalance the relationship between tenant and landlord. This Bill will do just that and tenants can be reassured this Government will protect them.” "
        }
    ]
}