{
    "url": "https://educationinspection.blog.gov.uk/2024/09/17/the-challenges-of-teacher-recruitment-and-retention-in-england/",
    "title": "The challenges of teacher recruitment and retention in England",
    "authors": [
        "Lee Owston, National Director Education",
        "Jason Bradbury"
    ],
    "categories": [
        "CPD",
        "initial teacher education",
        "ITE",
        "recruitment",
        "teacher training",
        "teachers"
    ],
    "pub_date": "2024-09-17T09:45:38+01:00",
    "content": [
        {
            "text": "Many schools are facing challenges recruiting and retaining teachers. It’s something Ofsted is critically aware of, and frequently highlights."
        },
        {
            "text": "To help tackle this, it’s vital that we understand the factors contributing to these difficulties."
        },
        {
            "text": "That’s why we were happy to support a new study by UCL’s Professor John Jerrim into this topic. Working with Ofsted and the Department for Education (DfE), Professor Jerrim was able to look at the school-age characteristics of children who went on to become teachers."
        },
        {
            "text": "He looked at children born between September 1994 and August 1995, and was able to explore the characteristics of individuals who chose to become teachers and whether they subsequently left teaching."
        },
        {
            "text": "A better understanding of the characteristics of those most likely to become and stay teachers can help to inform recruitment and retention strategies and the development of a diverse workforce that mirrors the population it serves."
        },
        {
            "text": "Some of the most significant findings are explored below."
        },
        {
            "text": "Eligibility for free school meals "
        },
        {
            "text": "Children who were eligible for free school meals (FSM) are roughly half as likely to enter teaching as those who were not."
        },
        {
            "text": "It is worth noting that, on average, FSM pupils achieve lower grades than non-FSM pupils. Professor Jerrim found that, given the academic requirements of becoming a teacher, most of the gap in entering teaching can be explained by this difference in grades achieved."
        },
        {
            "text": "He also found that teachers from FSM backgrounds are no more or less likely to leave teaching than their peers."
        },
        {
            "text": "So, as eligibility for FSM clearly has an impact on the likelihood of becoming a teacher, improving outcomes for these pupils remains the most important objective."
        },
        {
            "text": "Speaking English as an additional language "
        },
        {
            "text": "At first glance, it appears that children who spoke English as an additional language (EAL) in Year 11 are about as likely to enter teaching as their peers whose first language is English."
        },
        {
            "text": "However, once differences in the educational achievements of these groups have been controlled, EAL pupils are less likely to become teachers."
        },
        {
            "text": "To put it another way, young people who speak EAL are less likely to enter teaching than their equally qualified peers."
        },
        {
            "text": "Teachers who spoke EAL in Year 11 are also more likely to leave teaching in the state school sector."
        },
        {
            "text": "Overall, it seems that EAL pupils who hold the requisite qualifications to become teachers are still less likely to want to teach than their non-EAL peers. And those who do become teachers are more likely to leave. This all suggests that improving both recruitment and retention of people from an EAL background could make a real difference."
        },
        {
            "text": "Living with parents as an undergraduate"
        },
        {
            "text": "Individuals who live with their parents as undergraduates are more likely to become teachers than their peers who live away from home. This is true even when they achieve similar school grades, go to the same university and achieve the same higher education outcomes."
        },
        {
            "text": "They are then also less likely to leave teaching (in the state sector) within the first four years working in the job."
        },
        {
            "text": "Professor Jerrim suggests that this may indicate that these teachers have a higher than average:"
        },
        {
            "text": "The fact that teaching is a possible career no matter where you live, and that it offers a relatively stable and reliable income, could be significant in attracting these individuals."
        },
        {
            "text": "University"
        },
        {
            "text": "Those who study for their undergraduate degree at a Russell Group university are around 30% less likely to enter teaching than their peers who study elsewhere, even after accounting for differences in school grades."
        },
        {
            "text": "They are also more likely to stop teaching in the state school sector within the first four years of their career."
        },
        {
            "text": "Competition from other professions may be pulling away potential teachers who attended Russell Group universities."
        },
        {
            "text": "Next steps"
        },
        {
            "text": "This paper is a useful contribution to understanding the difficulties around teacher recruitment and retention. It highlights areas where focused recruitment campaigns could help, and where they are less likely to have an impact."
        },
        {
            "text": "We hope that this work can be continued and extended."
        },
        {
            "text": "It could also help Ofsted with our future work. For example, it could help to inform our inspection framework for initial teacher training (ITT) providers. And, if the work is extended to other cohorts, it could be used to establish differences in teacher retention rates across different ITT providers, and some of the background reasons why these may occur."
        },
        {
            "text": "We look forward to future discussion and development of this critical topic. And we hope it can inform actions to make sure schools are able to hire and retain high-quality teachers who provide an excellent education for the next generation."
        }
    ]
}