{
    "url": "https://space.blog.gov.uk/2024/09/17/what-is-the-enabling-technologies-programme/",
    "title": "What is the Enabling Technologies Programme?",
    "authors": [
        "UK Space Agency"
    ],
    "categories": [
        "Funding"
    ],
    "pub_date": "2024-09-17T15:12:44+01:00",
    "content": [
        {
            "text": "The National Space Innovation Programme (NSIP) offers funding opportunities for high-risk, high-reward technologies and applications that strengthen the UK’s offering to the space sector. NSIP works to boost UK prosperity, drive innovation and capture market share."
        },
        {
            "text": "Under NSIP’s remit, the Enabling Technologies Programme (ETP) was established to support the research and development of cutting-edge technologies with a low-Technology Readiness Level (1-4). "
        },
        {
            "text": "Grants of up to £250,000 are provided to academic, industrial or other non-profit organisations working to create a pipeline of innovative technologies. With this funding, project teams can advance the maturity of their technology, preparing them to contribute to the UK’s thriving commercial space sector and wider research efforts."
        },
        {
            "text": "To date, ETP has funded 41 projects across 4 calls, with all projects due to wrap up by March 2025. The successful applicants represent the best the UK has to offer in In-Orbit Servicing & Manufacturing, Optics, Safety & Sustainability, and Novel Instruments innovation; an open call was also held for emerging technologies that don’t fit into these criteria."
        },
        {
            "text": "ETP participants hail from across the UK, with many of our projects collaborating with other regional academic institutions or industrial partners. Over the course of the next few months, we are excited to showcase the range of innovative projects funded by the agency in a series of ETP spotlight posts. "
        },
        {
            "text": "Look out for upcoming articles featuring our grantees and their progress to date!"
        }
    ]
}