{
    "url": "https://apprenticeships.blog.gov.uk/2023/03/29/a-day-in-my-life-during-ramadhan/",
    "title": "A day in my life during Ramadhan",
    "authors": [
        "Institute for Apprenticeships"
    ],
    "categories": [
        "Awareness Days",
        "Ramadan",
        "The Institute"
    ],
    "pub_date": "2023-03-29T14:25:24+01:00",
    "content": [
        {
            "text": "It is the month of Ramadhan (also spelled Ramadan or Ramazan) and millions of Muslims worldwide are observing this holy month with fasting, community reflection and prayer."
        },
        {
            "text": "I'm Moosa Desai, lead HTQ implementation manager at IfATE, and this is how I spend Ramadhan."
        },
        {
            "heading": 2,
            "text": "What is Ramadhan?"
        },
        {
            "text": "Ramadhan is the most blessed month in the Islamic calendar. The Islamic holy book, The Quran, was first revealed to our Prophet Muhammad (Peace be upon him) during this month, through Angel Gabriel."
        },
        {
            "text": "Fasting during this month is one of five compulsory commandments given to Muslims by Allah and there are countless rewards promised to us during Ramadhan. One being that all our good deeds are multiplied by 70 which is a special bonus!"
        },
        {
            "text": "There are a few practical aspects of Ramadhan which I try to aim to complete:"
        },
        {
            "heading": 2,
            "text": "What is my daily routine like during the month of Ramadhan?"
        },
        {
            "text": "I eat Suhoor (morning meal to start the fast) anytime before the first of our five prayers which is at 5am currently. For this breakfast I like to eat porridge, a banana, some dates and plenty of fruit and water to ensure hydration and energy throughout the day. I’ll then go to the mosque to perform the Fajr prayer before sunrise."
        },
        {
            "text": "In Ramadhan, I am only working half days to make the fast easier. After resting in the morning, I wake up and recite a few verses of the Quran, before once again going to the mosque for the 2nd daily prayer, Zuhr."
        },
        {
            "text": "After completing my afternoon work, I tend to speak to family and friends to see how their fasts are going. I might also use this time to do some grocery shopping, which is always a challenge walking down the food aisles!"
        },
        {
            "text": "I’ll then get ready to go to the mosque for the 3rd prayer of the day, Asr, which is 1 hour before sunset. The vibe after this prayer is amazing because the whole community is sat in the mosque whilst various acts of worship are occurring such as religious advice from the imam (Islamic equivalent of a priest) and individual recitation of the Quran may also be taking place."
        },
        {
            "text": "I spend up to 1 hour in the mosque before the 4th prayer, Maghrib, whereby I would then break my fast in the mosque. The mosque provides fresh dates and water for all in this blessed month. The evening meal with which we break our fast is called “Futoor”. After establishing the Maghrib prayer with congregation at the mosque, I’ll rush home and instantly be hit by the lovely smell of food that my wife has cooked for our family."
        },
        {
            "text": "I have around 1 to 1.5 hours to indulge in food before again heading to the mosque for the 5th and final prayer of the day, Esha. The 5 daily prayers are obligatory throughout the year but in the month of Ramadhan we are lucky to be blessed with another prayer after Esha which is called “Taraweeh”. In this prayer, 1 chapter of the Holy Quran is recited each night and, in this way, the entire Quran is completed over 30 days. The Taraweeh prayer usually lasts up to 1 hour (mostly standing), so it’s crucial to get your stretches in beforehand!"
        },
        {
            "text": "After completing the night prayers, I’ll come home and enjoy some desserts and tea. Then I will go to sleep before waking up in the early hours of the morning to have Suhoor and begin another day of fasting."
        },
        {
            "heading": 2,
            "text": "How does Ramadhan end?"
        },
        {
            "text": "After 30 days, we are blessed with the celebratory day of Eid. It is gifted to us for the sacrifices we have gone through given in Ramadhan. It is a day of exchanging gifts with family and friends and reminiscing over the countless blessings we were blessed with during the month of Ramadhan. This is an amazing time to catch up and reconnect with family members who we have not seen for a while."
        },
        {
            "text": "To summarise, the month of Ramadhan is a month to become closer to Allah. It is a month to recite the Holy Quran (as we believe it is Allah’s words). It is a month of charity and self-reflection. The amount of charity given in this month is unbelievable as we hope to make a difference around the world. Fasting allows us to empathise with those around the world who are struggling with starvation and the main goal is to try and gain piety."
        }
    ]
}