{
    "url": "https://food.blog.gov.uk/2023/03/29/chief-executives-message-to-stakeholders-precision-breeding-and-importance-of-consumer-information/",
    "title": "Chief Executive’s message to stakeholders - Precision breeding and importance of consumer information",
    "authors": [
        "Emily Miles, Chief Executive"
    ],
    "categories": [
        "Our mission",
        "Science"
    ],
    "pub_date": "2023-03-29T17:26:33+01:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "Defra’s Precision Breeding Bill received Royal Assent last week, meaning it has formally become an Act of Parliament. This creates the powers for a new regulatory framework for precision-bred food and feed products, in England."
        },
        {
            "text": "The Government hopes that precision breeding techniques will help us adapt to the impacts of climate change, enhance sustainability in the food system, and enable the development of more nutritious crops. Any precision-bred food and feed must be safe to consume. The FSA will now work up the authorisation regime for precision-bred food and feed products, which will use the best available science to assess safety."
        },
        {
            "text": "Last Wednesday, FSA Board members considered a number of issues around precision breeding including traceability and the importance of helping people have access to reliable, evidence-based information about precision breeding. The FSA welcomes your continued input as we develop our thinking about the authorisation regime for precision-bred food and feed."
        },
        {
            "text": "Consumer information is at the heart of our Food Hygiene Rating Scheme (FHRS). The FSA recently published research into the perceived value of the FHRS to our consumers, businesses and the local authorities and district councils that deliver the scheme. The findings confirm wide-ranging support for the scheme and reinforce our commitment to a mandatory scheme in England, bringing it in line with Wales and Northern Ireland."
        },
        {
            "text": "Finally, MPs have voted to support the Windsor Framework, which will introduce new arrangements for food and feed crossing between Great Britain and Northern Ireland. The Government will update its guidance in due course, giving businesses and ports time to prepare for any changes. In the meantime, businesses must continue to follow existing guidance."
        },
        {
            "text": "If you have any thoughts or questions on the issues I’ve discussed in this blog, please do let us know in the comments section below."
        },
        {
            "heading": 2,
            "text": "Neges i randdeiliaid gan y Prif Weithredwr - Bridio manwl a phwysigrwydd gwybodaeth i ddefnyddwyr"
        },
        {
            "text": "Cafodd Bil Bridio Manwl Adran yr Amgylchedd, Bwyd a Materion Gwledig (Defra) Gydsyniad Brenhinol yr wythnos diwethaf sy’n golygu ei fod, yn swyddogol, wedi dod yn Ddeddf Seneddol. Mae’n creu’r pwerau ar gyfer fframwaith rheoleiddio newydd yn Lloegr ar gyfer cynhyrchion bwyd a bwyd anifeiliaid wedi’u bridio’n fanwl."
        },
        {
            "text": "Mae’r Llywodraeth yn gobeithio y bydd technegau bridio manwl yn ein helpu i addasu i effeithiau newid yn yr hinsawdd, yn gwella cynaliadwyedd yn y system fwyd, ac yn ei gwneud yn bosib datblygu cnydau mwy maethlon. Rhaid i unrhyw fwyd a bwyd anifeiliaid sydd wedi’u bridio’n fanwl fod yn ddiogel i’w bwyta. Bydd yr Asiantaeth Safonau Bwyd (ASB) yn mynd ati’n awr i lunio’r drefn awdurdodi ar gyfer cynhyrchion bwyd a bwyd anifeiliaid sydd wedi’u bridio’n fanwl, a fydd yn defnyddio’r wyddoniaeth orau sydd ar gael i asesu diogelwch."
        },
        {
            "text": "Ddydd Mercher diwethaf, bu aelodau Bwrdd yr ASB yn ystyried nifer o faterion yn ymwneud â bridio manwl, gan gynnwys olrheiniadwyedd a phwysigrwydd helpu pobl i gael gwybodaeth ddibynadwy, sy'n seiliedig ar dystiolaeth, am fridio manwl. Mae’r ASB yn croesawu eich mewnbwn parhaus wrth i ni ddatblygu ein ffordd o feddwl am y drefn awdurdodi ar gyfer bwyd a bwyd anifeiliaid wedi’u bridio’n fanwl."
        },
        {
            "text": "Mae gwybodaeth i ddefnyddwyr wrth wraidd ein Cynllun Sgorio Hylendid Bwyd (CSHB). Yn ddiweddar, cyhoeddodd yr ASB ymchwil ar werth canfyddedig y CSHB i ddefnyddwyr, busnesau, a’r awdurdodau lleol a’r cynghorau dosbarth sy’n darparu’r cynllun. Mae’r canfyddiadau’n cadarnhau bod yna gefnogaeth eang i’r cynllun ac yn atgyfnerthu ein hymrwymiad i gyflwyno cynllun gorfodol yn Lloegr, a fydd yn ei gysoni â’r drefn orfodol yng Nghymru a Gogledd Iwerddon."
        },
        {
            "text": "Yn olaf, mae Aelodau Seneddol wedi pleidleisio o blaid cefnogi Fframwaith Windsor, a fydd yn cyflwyno trefniadau newydd ar gyfer bwyd a bwyd anifeiliaid sy’n cael eu cludo rhwng Prydain Fawr a Gogledd Iwerddon. Bydd y Llywodraeth yn diweddaru ei chanllawiau maes o law, gan roi amser i fusnesau a phorthladdoedd baratoi ar gyfer unrhyw newidiadau. Yn y cyfamser, rhaid i fusnesau barhau i ddilyn y canllawiau presennol."
        },
        {
            "text": "Os oes gennych unrhyw syniadau neu gwestiynau am y materion a drafodir yn y blog hwn, rhowch wybod i ni yn yr adran sylwadau isod."
        }
    ]
}