{
    "url": "https://hodigital.blog.gov.uk/2023/03/29/clear-career-pathways-the-it-profession-at-the-home-office/",
    "title": "Clear career pathways: The IT Profession at the Home Office",
    "authors": [
        "Heather Hawkins, Community Lead, IT Operations",
        "Nicola Gibson, Head of Role, IT Operations"
    ],
    "categories": [
        "Continuous improvement",
        "IT Operations"
    ],
    "pub_date": "2023-03-29T11:14:37+01:00",
    "content": [
        {
            "heading": 2,
            "text": "What is IT Operations at the Home Office? "
        },
        {
            "text": "IT Operations at Home Office Digital, Data and Technology (DDaT) is a thriving cluster of over 600 people working on exciting projects which impact the daily operations of critical services in the United Kingdom (‘the UK’).  "
        },
        {
            "text": "We support services such as Border Force, Policing, and Immigration at airports and seaports around the country. Internally, we provide critical service support for national infrastructure and Home Office systems, with the objective of maintaining live services 24 hours a day, 7 days a week.  "
        },
        {
            "text": "We oversee IT Service Management functions such as the Service Desk, Incident Management, Change Management and Service Management.  "
        },
        {
            "text": "IT Operations also includes Service Architecture and Design and Service Transition teams who are responsible for producing comprehensive and forward-looking service designs. These teams help manage the structured and safe transition of projects to live service. "
        },
        {
            "heading": 2,
            "text": "The benefits of belonging to the IT Operations Profession "
        },
        {
            "text": "Heather Hawkins is the Community Lead of IT Operations at Home Office DDaT. She is part of the wider DDaT Professions team dedicated to providing clear career paths and continuous learning programmes to our digital, data and technology teams.  "
        },
        {
            "text": "Here Heather highlights the initiatives the team have introduced to support our IT Operations colleagues:"
        },
        {
            "text": "We’re proud to have built a strong IT Operations community within the DDaT Profession. The community acts as a support network to: "
        },
        {
            "text": "Continuous professional development is a key focus for our IT Operations colleagues. We encourage the community to complete courses such as ITIL v4 and Agile Service Manager which provide a core foundation and central structure in IT Operations. We’ve set up a dedicated course booking service to make it easy for our colleagues to undertake the right courses to advance their careers. "
        },
        {
            "text": "We provide mentoring and coaching so our teams can learn from each other by giving back, and receiving, learning. "
        },
        {
            "text": "We’ve developed a comprehensive Training Catalogue bespoke to each IT Operations role featuring bite-sized learning on multiple platforms, recognising that we all have different learning styles. For example, the Catalogue caters for audio learners through podcasts and audiobooks.  "
        },
        {
            "text": "We run monthly ‘Serving Up Knowledge’ sessions. These sessions provide a forum for our teams to learn about initiatives from their peers and serves as a place to generate new ideas. "
        },
        {
            "text": "We’ve set up a ‘mock interview’ initiative to provide interview coaching and feedback for those wanting to excel at interviews and advance their careers. "
        },
        {
            "text": "We encourage work shadowing so our teams can learn from the way other areas work. Work shadowing is also encouraged for those looking for insight into potential new roles. If our colleagues do identify a new role they would like to move into we support them in preparing for the move. "
        },
        {
            "text": "The IT Operations Profession is evolving to continue delivering value to the Home Office and to our customers, especially in parallel with different ways of working, such as Product Lifecycle Management. To achieve this, we’ve established the IT Service Management Strategy Group, a dedicated focus group working to transform and innovate the way we work, keeping IT Operations at Home Office DDaT relevant and critical.  "
        },
        {
            "heading": 2,
            "text": "‘Loads of variety and a sense of pride in the work I do’: Meet Aaron "
        },
        {
            "text": "Hi, I’m Aaron Brock. I work as a Senior Service Manager in IT Operations in the Migration and Borders Technology Portfolio, supporting Immigration IT Services. I oversee and assure the services once they are live. Seeing them in action is so rewarding.  "
        },
        {
            "text": "I had never considered working in tech or in the Civil Service. I started on an emerging talent scheme in the Home Office to familiarise myself with an organisation of this scale. I was introduced to Agile Service Management while working in multidisciplinary teams delivering industry-leading services to the public and to Home Office colleagues.   "
        },
        {
            "text": "There are so many different programmes and services that you have the chance to get involved with. "
        },
        {
            "text": "In my area of work, we look after these programmes and services after they have gone live. So, when I watch TV and see how many people we have been able to support through the Homes for Ukraine scheme, for example, I do feel a great sense of pride. "
        },
        {
            "heading": 2,
            "text": "What does a Senior Service Manager in IT Operations do? "
        },
        {
            "text": "I love that no two days are ever the same. The type of work I’m involved with includes:  "
        },
        {
            "heading": 2,
            "text": "Career development opportunities in the IT Operations Profession "
        },
        {
            "text": "The IT Operations Profession team encourage me to continue developing my skills through a development plan tailored to my career goals. "
        },
        {
            "text": "The team provide opportunities for me to deputise for the Lead Service Managers at our Delivery and Prioritisation Boards. This means I’m able to help guide the strategic decisions made on our IT systems.   "
        }
    ]
}