{
    "url": "https://childrenssocialcare.blog.gov.uk/2023/03/29/creating-a-smooth-transition-from-education-into-the-world-of-work/",
    "title": "Creating a smooth transition from education into the world of work",
    "authors": [
        "Kate James"
    ],
    "categories": [
        "SEND"
    ],
    "pub_date": "2023-03-29T15:25:17+01:00",
    "content": [
        {
            "text": "Kate James is an Employment Support Officer for Kent Supported Employment. Here she discusses her role as a job coach to help young people with Special Educational Needs and Disabilities (SEND), aged 16 or above, to gain and sustain suitable paid employment."
        },
        {
            "heading": 3,
            "text": "Realising my own potential"
        },
        {
            "text": "I wear two hearing aids and have been partially deaf since birth. I never really considered myself disabled but knew I wanted to help support others with disabilities. I became a job coach having been inspired by members of Kent Supported Employment; I completed a short work experience placement and quicky realised its where I wanted to be."
        },
        {
            "text": "My role supports young people involved in the Supported Internship Programme which provides career guidance coaching to support young people with SEND to make informed choices. This work entails understanding the positive contribution people can make in the workplace, taking a fully inclusive approach and offering choice and control regarding work."
        },
        {
            "text": "When working with a young person, it’s important to match their needs to the job role. This entails getting to know the young person and using career-based assessments to determine what their career goals are and what motivates and inspires them. There is nothing better than supporting a young person, likely to become Not in Education, Employment or Training (NEET), to help them to realise their potential."
        },
        {
            "heading": 3,
            "text": "Securing the right placement"
        },
        {
            "text": "As part of my role, I identify and approach employers to secure a supported internship for the young person. I work with training providers and colleges to secure smooth transition from education into the world of work. This includes delivering disability confident training and deaf awareness training, implementing reasonable adjustments and sourcing natural support within the workplace."
        },
        {
            "text": "For example, I work with Access to Work to ensure any aids or adaptations including interpreters are funded, and support young people to contact interpreters to support them both at interview and within the workplace for meetings and training."
        },
        {
            "text": "When securing a successful internship, the employer gets to support a young person to flourish, supporting business objectives, and for the young person, they gain skills in relationship building, independence, travel confidence and responsibility. I help achieve this by:"
        },
        {
            "heading": 3,
            "text": "Helping young people achieve their goals"
        },
        {
            "text": "Through the Supported Internship Programme, training providers and schools can refer young people direct resulting in some being able to intern and then progress to a paid apprenticeship. This has helped to bridge the gap that young people aged 16 and over often fall into when they finish college. This helps avoid situations of people reaching their mid-twenties having not had opportunities or access to work environments, the chance to learn vital social and cultural aspects, or gain valuable skills and experience."
        },
        {
            "text": "Below is some advice for anyone in a similar coaching role or considering it as a career themselves:"
        }
    ]
}