{
    "url": "https://defrafarming.blog.gov.uk/2023/03/29/new-entrant-support-scheme-an-update-on-our-pilots/",
    "title": "New Entrant Support Scheme: an update on our pilots",
    "authors": [
        "Henry Leveson-Gower"
    ],
    "categories": [
        "Payments for entering farming",
        "Things we're doing"
    ],
    "pub_date": "2023-03-29T11:45:23+01:00",
    "content": [
        {
            "heading": 2,
            "text": "Our participants"
        },
        {
            "text": "Almost 200 people are taking part in the pilots. Together they make up a varied and fascinating group. Most of them don’t fit the typical farmer profile. For example:"
        },
        {
            "text": "A wide range of paths have brought them to take part in the pilots. "
        },
        {
            "text": "For example: "
        },
        {
            "heading": 2,
            "text": "Reports from our pilot leads "
        },
        {
            "text": "We are already starting to learn from the pilots."
        },
        {
            "text": "We've been hearing from those working in our pilots to support the participants:"
        },
        {
            "text": "Claire Biden at The School for Social Entrepreneurs, which leads the north-east peri-urban and south-west rural pilots, told us: \"Their pilots show a real desire from participants to develop innovative approaches to common challenges.\" Liz Wright, also of the School for Social Entrepreneurs, said: \"Participants are developing their skills, deepening their networks and inspiring each other to greater innovation.\""
        },
        {
            "text": "Polly Gibb of Harper Adams University, which leads a rural pilot in the West Midlands, said: \"I’m struck by the energy and diverse skills set that our delegates bring to the programme. Some are young adults and always knew that farming is their future, so everything so far has been completely focussed on that goal. Others have already had a career elsewhere and so bring very high levels of knowledge about finance, marketing, the third sector and business. This is leading to innovative thinking and a lot of sharing and collaboration.\""
        },
        {
            "text": "Nicola Scott of Shared Assets, which leads the south-east peri-urban pilot said: \"Everyone is loving the in-person sessions and getting so much from the farming site and its ethos, as well as meeting and hearing from others.\" She said that most participants have developed more confidence to create business plans, adding that they \"now feel like they can give it a go.\" "
        },
        {
            "text": "Rachael Forster from Tamar Grow Local, who is coordinating the south-west peri-urban startup cohort said: \"Participants have fed back that the peer-to-peer sessions has been so valuable in building community and meeting others following the same paths. Although stretched for time by the programme overlapping into the growing season and other work or family commitments, the vast majority participants have remain very engaged with the programme and have found the blended and varied approaches to learning and grounding in business development valuable.\""
        },
        {
            "heading": 2,
            "text": "Next steps "
        }
    ]
}