{
    "url": "https://mattersoftesting.blog.gov.uk/what-were-working-on-using-advisories-correctly-and-connected-cameras-in-garages/",
    "title": "What we’re working on: using advisories correctly and connected cameras in garages",
    "authors": [
        "Chris Price"
    ],
    "categories": [
        "Annual training and assessment",
        "MOT Modernisation",
        "News and updates"
    ],
    "pub_date": "2023-03-29T14:02:58+01:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "It’s been a while since we gave you a roundup of what’s happening with the MOT world and what we’ve been working. Over the next few months, I’d like to start sharing more regular updates with you to keep the industry better informed of our plans – especially the improvements we’re making to our digital services. "
        },
        {
            "text": " In today’s blog post, I want to give you an update on using advisories correctly, information on connected cameras and give a final nudge to those of you that are yet to complete their annual training and assessment.  "
        },
        {
            "heading": 2,
            "text": "Keeping Britain’s roads safe"
        },
        {
            "text": "The MOT is widely recognised as helping maintain Britain’s high standards of road safety - a testament to the hard work you and your colleagues do every day. "
        },
        {
            "text": " But, the way test results are recorded  doesn’t just reflect on the test itself. It also reflects on the motor trade, the garage at which the test’s conducted and the tester themselves.  "
        },
        {
            "text": " So it’s important to get it right by ensuring comments and details are factual and relevant.    "
        },
        {
            "text": " A key part of the test is using advisories to tell drivers of emerging issues that could affect the vehicle’s safety and performance in the future.  "
        },
        {
            "heading": 2,
            "text": "Advice on inputting advisories "
        },
        {
            "text": "We’ve become aware that advisories aren’t always used properly. There are three main issues that I want to share with you. "
        },
        {
            "heading": 3,
            "text": "Using free text when it’s not needed "
        },
        {
            "text": "MTS (MOT testing service) has a range of standard wording for advisories listed against the components that are checked during the test and additionally has a list of pre-defined non-component advisory items that can be easily selected. All you need to do is search for the term you want and there’s a good chance the wording’s already there. Please don’t use free text if there’s already something in the system. "
        },
        {
            "heading": 3,
            "text": "Putting the right things on "
        },
        {
            "text": "Advisories must be meaningful and relevant and are for the issues you find - not the ones you were unable to find. We have looked at some test data and have identified that on a significant number of occasions the same advisory defects have been repeated when a vehicle has been tested a year later. This obviously questions the validity and value of these items. Additionally, there’s no value in stating things like a vehicle’s standard fitment undertray stopped you from taking a full look under the vehicle.  "
        },
        {
            "heading": 3,
            "text": "Taking action against inappropriate content "
        },
        {
            "text": "You may well have seen media reports that some testers have used advisories to insult customers, make irrelevant comments and swear. It doesn’t need to be said, but this reflects badly on the MOT, the tester and their employer. DVSA is expanding the list of words that can’t be used for advisories on MTS. If we become aware of testers using them inappropriately, our enforcement teams will visit the test station to check that this is not the only area of their operations with poor standards. This could lead to the suspension of the tester and sanctions to their employer.  "
        },
        {
            "text": " We know that testers find the manual advisory feature helpful. But if they continue to be misused in the ways we’ve outlined, we’ll consider removing the feature.   "
        },
        {
            "heading": 2,
            "text": "Getting mileage right  "
        },
        {
            "text": "As you know, we recently introduced a new feature to MTS to help identify mileage errors. If the reading input by the tester is considerably different or the same as that recorded at the last MOT, an interrupt screen will warn them. "
        },
        {
            "text": "When this screen is shown, testers have to confirm that the reading they’ve entered is correct or edit and correct the reading. "
        },
        {
            "text": "We’ll do a further blog post to discuss this issue in more detail in the next couple of weeks. "
        },
        {
            "heading": 2,
            "text": "Developing new connected equipment "
        },
        {
            "text": "Over the past year, we’ve been investigating and trialling the use of connected cameras in garages. Using a device with a camera built in, like a phone or tablet, will allow the you to take a photo of the vehicle’s number plate that you’re testing and upload it to MTS.  "
        },
        {
            "text": "This will help reduce record keeping errors as you won’t need to enter the registration plate manually. This should also help save time during the test. "
        },
        {
            "heading": 3,
            "text": "What’s next for connected cameras "
        },
        {
            "text": "Following the first successful trial last year, we’ve been reviewing the findings and have made some improvements and are we're now planning to carry out a further trial. I want to thank all the garages who took part in the first trial to help us understand more about how this could work. Your feedback has been incredibly useful.  "
        },
        {
            "text": "If there are no significant issues identified in the second trial, we plan to launch this feature as the primary method of registering tests.  "
        },
        {
            "text": "We’ll let you know how the second trial goes and, if we decide to adopt connected cameras for all MOTs, we’ll give you plenty of warning of any changes.  "
        },
        {
            "heading": 2,
            "text": "MOT training and assessment "
        },
        {
            "text": "It’s been great to see that the vast majority of you have completed this year’s MOT training and annual assessment. The deadline is 31 March 2023, so there’s still time to get it done if you hurry.  "
        },
        {
            "heading": 2,
            "text": "Call for evidence and consultation "
        },
        {
            "text": "I also wanted to take the opportunity to thank you all for giving your thoughts to the Department for Transport on their consultation and call for evidence on changes to the MOT. There were over 4,000 replies, which are now being collated by DFT and analysed. We’ll share more about the outcome of the consultation and call for evidence when we can.  "
        },
        {
            "heading": 2,
            "text": "That’s all – for now "
        },
        {
            "text": "I hope you’ve found this update useful. As I said, they’ll be much more frequent now; we have a great deal we’ll be needing to update you on in the coming months and I look forward to letting you know about the improvements to the MOT as we roll them out.  "
        },
        {
            "text": "We’d also like to know what you want to hear about – let us know in the comments box. "
        }
    ]
}