{
    "url": "https://disabilityunit.blog.gov.uk/2022/05/18/emmas-story-caring-for-my-grandma-with-dementia/",
    "title": "Emma's story: caring for my Grandma with dementia",
    "authors": [
        "Emma Bould"
    ],
    "categories": [
        "Raising Awareness"
    ],
    "pub_date": "2022-05-18T16:29:10+01:00",
    "content": [
        {
            "text": "The theme for this year's Dementia Action Week is diagnosis. Alzheimer's Society research shows that the misconception around memory loss being a sign of normal ageing is the biggest barrier to people seeking a dementia diagnosis. We hear from Emma about her Grandma's experience:"
        },
        {
            "text": "I didn’t know I was a carer until an amazing manager helped me realise. It was just our life. My Grandma is my idol. She’s kind, funny, artistic, and, despite being shy, a massive glamourpuss. "
        },
        {
            "text": "I lived next door to my grandparents when my Grandma started developing Alzheimer’s Disease in her sixties. Initially, it was small things like getting confused with our names, forgetting to pick me up from my part-time job at a call centre or putting things in the wrong place, like putting the milk in a cupboard. "
        },
        {
            "text": "When I moved into my Grandparents house after university, my caring responsibilities increased, along with my 85-year-old grandfather’s. My Grandma would think her Mum and Dad were alive and she would worry she hadn't picked me up from school. "
        },
        {
            "text": "I used to drive back from work, help cook dinner, do any cleaning or washing needed and watch my Grandma until she went to bed. As her dementia progressed, she needed constant attention and care, with no concept of day or night, time or even danger. Most of the time she didn’t know where she was and who we were. "
        },
        {
            "text": "Often, in the evenings, she would often want to go back to her parents. She would get angry a lot, frustrated, and sometimes aggressive, which was incredibly upsetting. She needed someone with her 24/7 to stop her walking off or getting lost. She went missing a couple of times and was found by the police. A few years ago, my Grandad slipped over while trying to follow her and broke his shoulder. "
        },
        {
            "text": "It was difficult holding down my first ever job while doing the right thing by my grandparents. I often took calls at work when she disappeared and I was using my annual leave to give my Grandad a break so he could have a couple of days with his friends. I loved spending time with my Grandma in the evenings and weekends helping her and watching TV, but being a carer was so isolating and lonely. It was hard when my friends were carefree, going clubbing and I was left behind. By contrast, my Grandma was not aware of what was happening with her dementia. She often got upset, confused and felt misunderstood. "
        },
        {
            "text": "I was so lucky to have such great support from my line manager. He gently helped me realise that I was a carer and that my grandparents and I needed support. He boosted my confidence in being a carer, showing me it had given me valuable skills and experiences of patience, problem solving and communication. He challenged HR when they said I could not work from home one day a week. His support changed my world and career. This support from my manager gave me the confidence to set up a carers network at my organisation, which helped me connect with others in similar situations. It also helped me build my CV, which led me to a job at the Alzheimer’s Society."
        },
        {
            "text": "By helping others and running events for the network, I found out more about local support and the benefits my grandparents were entitled to. We successfully got respite care, introduced equipment at home to help and other family members began to understand and support more. This increased my independence and helped me to move out of my grandparents’ house. This support meant I could support my grandparents on weekends and holidays instead."
        },
        {
            "text": "My Grandma now has advanced dementia, but is happily living with my aunt and Grandad in the New Forest. Her and my Grandad recently celebrated their 60th Diamond Wedding Anniversary and received a card from the Queen. Her mobility is reduced and she finds it challenging to communicate, needing quiet surroundings and patience to allow her to formulate what she wants to say. She loves music, watching bands or singers in the local pubs. My family try to make sure she does the things she enjoys in different ways, whether that's helping her paint with a water painting book, helping my grandparents go on holiday, doing her makeup and hair or putting on old musicals that she can sing and tap along to. "
        },
        {
            "text": "My current manager is just as supportive as my first, helping me work a condensed working pattern which lets me drive down on weekends to visit my grandparents. This has made helping clean the house, taking my Grandma to her day centre and just sit together, watching birds in the garden, so much easier. "
        },
        {
            "text": "During this year’s Carers Week (6 to 12 June) the Civil Service Carers Network is holding an awareness session on dementia and Alzheimer’s Disease for Civil Servants with caring responsibilities or an interest in dementia. Please contact emma.bould@cabinetoffice.gov.uk if you would like to attend. "
        }
    ]
}