{
    "url": "https://educationhub.blog.gov.uk/2022/05/18/how-can-i-improve-my-maths-skills-how-the-multiply-programme-supports-adult-learners/",
    "title": "How can I improve my maths skills? How the Multiply programme supports adult learners",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Further education"
    ],
    "pub_date": "2022-05-18T00:30:05+01:00",
    "content": [
        {
            "text": "Having a good understanding of numbers is vital for everyday life, from working out a restaurant bill, managing personal finances, cooking, or helping children with their homework."
        },
        {
            "text": "This National Numeracy Day (18 May) we have launched a new online quiz designed to get adults to think about their numeracy skills and take action to boost them."
        },
        {
            "text": "This is part of the rollout of our Multiply programme to help adults across the UK to brush up their numeracy skills and boost their number confidence."
        },
        {
            "text": "Here’s everything you need to know about Multiply."
        },
        {
            "heading": 3,
            "text": "What is the Multiply programme?"
        },
        {
            "text": "Multiply will offer adults who want to improve their numeracy and do not already have a GCSE grade C/4 or higher in Maths or equivalent, free flexible courses that fit around their lives."
        },
        {
            "heading": 3,
            "text": "Why is it important?"
        },
        {
            "text": "People with good numeracy skills are more likely to be in employment, have higher wages, and better wellbeing, but around 17 million adults in England – half of the working-age population – have the numeracy skills of primary school children."
        },
        {
            "text": "Poor numeracy skills can hold people back from having the confidence to get on in life and into work."
        },
        {
            "text": "Multiply has the potential to reach adults across the whole United Kingdom over the next three years and will support our Levelling Up mission to ensure that by 2030, the number of people successfully completing high-quality skills training will have significantly increased in every area of the United Kingdom."
        },
        {
            "heading": 3,
            "text": "Who is it for?"
        },
        {
            "text": "Adults aged 19+ who do not already have a GCSE at grade C (or equivalent) in maths can apply for the Multiply programme."
        },
        {
            "text": "You can check where your everyday skills are at, and where you could improve, through the Multiply quick quiz."
        },
        {
            "heading": 3,
            "text": "When will it be available? "
        },
        {
            "text": "The new Multiply courses are expected to be available from this autumn in person or online, at work or at home, and either on a part time or intensive basis. These are in addition to the existing courses that you can search for through the Multiply page right now."
        },
        {
            "text": "Where can I find out more about the Multiply programme?"
        },
        {
            "text": "You can find out more on the Multiply page, where you can search for maths courses already available near you and register to hear about Multiply courses as they launch."
        },
        {
            "heading": 3,
            "text": "What else are you doing to help improve numeracy skills in adults?"
        },
        {
            "text": "This Multiply programme investment is in addition to help already available for adults to improve maths and numeracy skills, including through the Adult Education Budget in England."
        },
        {
            "text": "In addition to providing funding to local areas to deliver innovative solutions to increase adult numeracy levels, we will also be launching a national digital numeracy platform as part of Multiply. This will give people the ability to learn at their own pace, including through access to tutoring."
        },
        {
            "text": "We will also be launching a programme of evaluation to test innovative approaches to reducing adult learning barriers and improving adult numeracy (such as through randomised control trials) and build the evidence base on what works."
        }
    ]
}