{
    "url": "https://civilservice.blog.gov.uk/2022/05/18/how-wonder-of-workplace-adjustments-made-life-easier/",
    "title": "How wonder of workplace adjustments made life easier",
    "authors": [
        "Kerry Twort"
    ],
    "categories": [
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Innovative Civil Service"
    ],
    "pub_date": "2022-05-18T09:42:48+00:00",
    "content": [
        {
            "heading": 3,
            "text": "To mark Global Accessibility Awareness Day on 19 May, Kerry Twort reveals how assistive technology and workplace adjustments have transformed her life for the better. Now she’s even on track to achieve A-grade success."
        },
        {
            "text": "Last year, I started an evening class to retake my GCSE English. I was terrified that the confusion I expected to feel in the classroom would take me right back to being a teenager in school. I left school convinced I was rubbish at English and would never be able to understand it."
        },
        {
            "text": "I have some long-term health conditions and those, combined with my neurodiversity, mean my cognitive functioning is compromised. Two years ago, I wrote about how assistive software made a profound  difference to life at work. Two years on, it’s time to update my story. I am now very proud to say that assistive software is helping me fulfil my ambitions in other areas of my life too. "
        },
        {
            "text": "Last month, I took a mock exam, and I’ve just found out that I’m expected to achieve a grade A* in my final exams. I was absolutely blown away and expected someone to tell me it's all a joke. I’m so happy my adjustments have given me the tools to really showcase my skills and fulfil my potential. "
        },
        {
            "heading": 4,
            "text": "Laptop boosts learning"
        },
        {
            "text": "At college now, I use my laptop to take notes during lessons. I have an agreement with my teacher to add any material that we cover during the lesson to the classroom online platform. Then I can use the laptop’s screen reader ‘speak as I type’ software, and I can also use that software in my exams."
        },
        {
            "heading": 4,
            "text": "Civil Service help"
        },
        {
            "text": "More than a decade ago, I reached out to my line manager regarding the struggles I was facing at work. Since then, assistive software has provided a golden lifeline. It has enabled me to open my mind up to what was once unreachable."
        },
        {
            "heading": 4,
            "text": "From confusion to clarity"
        },
        {
            "text": "At work, I use the latest software to help me. I still use Claroread to read emails and documents as well as ‘speak as I type’ when I am creating documents or replying to emails; this allows me to consciously craft as I write, such as I’ve done for this blog post. Sonocent Audio Notetaker records meetings, allowing me to fully engage without the anxiety of missing key content. (This software has some privacy challenges in my role, but these are easily mitigated.) Finally, Mindview supports me with planning my work - it allows me to map out in a visual spider graph format, bringing clarity out of the fog of my often confused mind."
        },
        {
            "heading": 4,
            "text": "Gamechanger"
        },
        {
            "text": "Assistive software is a game changer for some colleagues who need workplace adjustments. However in my experience, they generally cannot be used in isolation, but as a supplement to other adjustments. If you think that assistive software could help you, talk to your manager about the workplace adjustments you might need. You will need to complete a Workplace Adjustment Passport which is available on departmental websites. You can also seek advice through the Civil Service Disability Network and Civil Service Dyslexia and Dyspraxia Network."
        }
    ]
}