{
    "url": "https://forestrycommission.blog.gov.uk/2022/05/18/introducing-the-new-groups-grant-to-protect-against-oak-processionary-moth/",
    "title": "Introducing the new groups grant to protect against Oak Processionary Moth",
    "authors": [
        "Andrew Hoppit"
    ],
    "categories": [
        "Tree health"
    ],
    "pub_date": "2022-05-18T09:18:53+01:00",
    "content": [
        {
            "text": "The start of May marks the beginning of the greatest risk period for the tree pest, the Oak Processionary Moth (OPM). From this time until August, caterpillars emerge and feed on oak trees before turning into adult moths."
        },
        {
            "text": "These non-native tree pests, first identified in England in 2006, nest on oak trees and eat their leaves, leaving them vulnerable to threats including drought and other pests and diseases. OPM caterpillars and their nests are also a hazard to human and animal health, as they are covered in hairs which can cause itchy rashes, eye and throat irritations and occasionally breathing difficulties and allergic reactions."
        },
        {
            "heading": 2,
            "text": "New Oak Processionary Moth Groups Grant announced"
        },
        {
            "text": "To support the existing package of measures already available for owners of oak trees with OPM, a new funding initiative to support the long-term management of the tree pest in local communities has been announced by Government on Wednesday 18 May."
        },
        {
            "text": "The new Oak Processionary Moth groups grant scheme is available through the Forestry Commission’s Tree Health Pilot which runs until August 2024. The new scheme aims to establish better coordination between landowners and managers at a local level to help tackle the hazardous pest."
        },
        {
            "heading": 2,
            "text": "Calling all owners of infested or at-risk oak trees in the Oak Processionary Moth Established Area"
        },
        {
            "text": "The scheme will be open to anyone in the Established Area of Oak Processionary Moth only (a designated area within London and the South-East), and via a dedicated group facilitator, will bring a group together, survey their oak trees, and create a collective plan for management."
        },
        {
            "text": "This management plan will help communities independently manage their oak trees, to preserve this beautiful and iconic species, while minimising damages to human health."
        },
        {
            "heading": 2,
            "text": "How will the Oak Processionary Moth Group Grant work?"
        },
        {
            "text": "The grant will support a lead facilitator to form a group (of owners and managers of oak trees). It will cover costs for a survey to be carried out of the group’s oak trees and pay the facilitator for their time to form the group and create a management plan, helping local communities understand the risks associated and advising them on what they can do to successfully manage those trees."
        },
        {
            "heading": 2,
            "text": "What level of funding can I apply for?"
        },
        {
            "text": "The OPM grant will pay facilitators a fee of £20 per hour to coordinate a group to create a local OPM Management Plan. The total funding given will therefore depend on how long this takes, which will in turn depend on the size and complexity of the group."
        },
        {
            "text": "The OPM grant will also cover the cost of a contractor to complete a survey for OPM."
        },
        {
            "heading": 2,
            "text": "How do I apply?"
        },
        {
            "text": "If you’re interested in applying, please complete an expression of interest form."
        },
        {
            "text": "If you meet the basic eligibility criteria, you will then be contacted by a Forestry Commission Woodland Officer."
        },
        {
            "text": "The Forestry Commission will be hosting a series of workshops for groups to attend and learn from specialists about managing oak trees with OPM, the risks they pose as well as answering any questions they might have about their application."
        },
        {
            "text": "The OPM Groups Grant is open for applications until 2024. If you think you might be eligible, we’d love to hear from you. Check your eligibility and apply on GOV.UK."
        },
        {
            "text": " "
        }
    ]
}