{
    "url": "https://openpolicy.blog.gov.uk/2022/05/18/launching-our-experimental-policy-design-methods/",
    "title": "Launching our experimental policy design methods",
    "authors": [
        "sanjansabherwal",
        "nehasharma"
    ],
    "categories": [
        "News",
        "Skills, tools and techniques"
    ],
    "pub_date": "2022-05-18T10:32:28+00:00",
    "content": [
        {
            "text": "Since it was founded in 2014, Policy Lab’s mission has been to explore the cutting edge of policy design practice: to radically improve policymaking through design, innovation and people-centred approaches. Back then, applying design thinking to a policy challenge was a very new and different way to frame, research and solve policy problems. Today these methods have been adopted way beyond our team. User centred design, service design and systems thinking are now part of the latest Policy Professions Standards and there are teams across the civil service pursuing these methods. "
        },
        {
            "text": "Design thinking continues to permeate our work but, over the last year we have been scanning the horizon to identify the next wave of innovative methods that could improve the way policy is made, tested and delivered."
        },
        {
            "heading": 2,
            "text": "12 new methods for policymaking"
        },
        {
            "text": "Today we are launching a set of virtual cards which describe 11 experimental methods and approaches which we think have the potential to shift how policy is developed, in radically different ways. The last one is blank because our horizon scanning work for policymaking is an ongoing process and we expect to discover more new methods."
        },
        {
            "text": "Some of these methods, like serious games, are already gaining ground in a policy context - we’ve included them because we think they have the potential to be used more widely across government. For example, Policy Lab worked with the Maritime Autonomous Regulation Lab (MARLab) during 2019 and 2020 to develop a serious game that explored the future of maritime regulation. "
        },
        {
            "text": "Legislative theatre first emerged in Brazil in the 1970s, with the aim to inspire and create social change and it has recently been spearheaded in the UK through work at Greater Manchester Authority and Haringey Council to tackle policy issues related to homelessness. "
        },
        {
            "text": "Other methods draw on expertise and technologies used in different sectors. For example Formula One uses digital twins to identify opportunities for improvement and efficiency using data. Similarly, the world of art has long mastered the ability to engage, inspire and provoke, something which Stephen’s recent blog explores, reflecting on 6 effects of art in policy.  "
        },
        {
            "text": "Some of these experimental policy design method cards may provoke and encourage us to ask big questions: "
        },
        {
            "text": "Over a short series of blogs, we will be introducing these new experimental methods in more detail. As we start to introduce them in our work, we are excited to see what we will learn about how the policy system could adopt these approaches. We hope some, if not all, of the methods might make it into the Policy Profession Standards of the future. As Matthew Syed said in his book, Rebel Ideas: there was once a time when adding wheels to a suitcase seemed absurd. "
        },
        {
            "text": "We hope these methods will spark your curiosity to ask what more we could all be doing to change the way policy is designed and developed. "
        },
        {
            "heading": 2,
            "text": "Join the experimentation"
        },
        {
            "text": "The next stage of transforming how policy is made starts here, with all of us."
        },
        {
            "text": "We are keen to hear about your own experiences. If you’ve trialled any of these methods, or have come across other examples where they’re being used, it could inform how we test them in practice so we’d love to hear from you - please get in touch. "
        },
        {
            "text": "Something missing? As mentioned, the twelfth card in our pack is blank to leave space for new ideas - share your suggestions with us for other methods which you think are important to try by leaving a comment below, emailing us or tagging us on Twitter. "
        },
        {
            "text": "And if you’re keen to trial any of these methods with us in your policy area, contact Sanjan Sabherwal, Head of Innovation & Design at Policy Lab. "
        }
    ]
}