{
    "url": "https://despatch.blog.gov.uk/2022/05/18/launching-the-trailer-safety-accreditation-scheme/",
    "title": "Launching the trailer safety accreditation scheme",
    "authors": [
        "Mark Winn"
    ],
    "categories": [
        "Feature",
        "Road safety features"
    ],
    "pub_date": "2022-05-18T12:20:34+01:00",
    "content": [
        {
            "text": "In November, I explained the work we have been doing with the trailer training industry to develop the accreditation scheme."
        },
        {
            "text": "Last month we launched the first part of the scheme, encouraging trailer training providers to become accredited, and now we’re ready to promote this training to motorists."
        },
        {
            "text": "Before we get to that, I want to explain what’s happened since November. If you remember, we’d just held some workshops to look at what the accreditation scheme could achieve and how it should be delivered. I know many of you had a lot of questions about how the scheme would work, and I hope we’re now in better position to answer these."
        },
        {
            "heading": 2,
            "text": "Following up the workshops"
        },
        {
            "text": "After the workshops, we had 3 priorities to focus on:"
        },
        {
            "text": "The legislation to bring the car and trailer test changes into force was passed on 16 December 2021. This removed the need for motorists to take a mandatory B+E test to tow a trailer or caravan."
        },
        {
            "heading": 2,
            "text": "Setting up a Council"
        },
        {
            "text": "In January we held the first meeting of the National Council for Accredited Trailer Training. The Council members are:"
        },
        {
            "text": "The Council is a forum to look at how the scheme is working and will meet regularly to check on how things are working. This includes reviewing take up rates for accredited training, whether overall standards are being met and feedback from training providers and customers."
        },
        {
            "heading": 2,
            "text": "Developing standards"
        },
        {
            "text": "To help the accrediting bodies make sure standards of training are being maintained, we have introduced a B+E training syllabus."
        },
        {
            "text": "This sets out how to train drivers in the skills, knowledge and understanding they need to be a safe and responsible driver when towing a trailer with a category B motor vehicle."
        },
        {
            "text": "We developed the syllabus in partnership with the Trailer Towing Advisory Group (TTAG), focusing on our common goal of keeping everyone safe on Britain’s roads."
        },
        {
            "text": "The syllabus represents current good practice for driver training. Importantly, it recognises that there will be many different, valid ways to deliver the learning outcomes as we know many of you asked about whether the scheme can be tailored to the individual and their level of skill. Providing client-centred learning is really important, and we hope the syllabus will help you do this."
        },
        {
            "text": "The syllabus has now been published on GOV.UK. I’d encourage you to familiarise yourself with it and use it when training."
        },
        {
            "heading": 2,
            "text": "Recognising the accrediting bodies"
        },
        {
            "text": "To deliver the accreditation scheme, we needed to formally recognise organisations who were interested in providing accreditation to training providers."
        },
        {
            "text": "So far, we’ve formally recognised 3 accrediting bodies:"
        },
        {
            "text": "Accrediting bodies set their own fee structures and decide how they want to operate their schemes. They are responsible for making sure that the standards and syllabus are being monitored and maintained by accredited trainers on their scheme. To find out more about what each accrediting body offers, and how much they charge you will need to visit their website or speak to them directly."
        },
        {
            "text": "The accrediting bodies will also play a vital role in communicating the scheme to prospective customers, encouraging people to take up accredited training before towing."
        },
        {
            "heading": 2,
            "text": "Launching to training providers"
        },
        {
            "text": "On 17 March, we held the first of four webinars to launch the accreditation scheme to trailer training providers and introduce the three accrediting bodies to them."
        },
        {
            "text": "We shared details about the accredited bodies and their schemes, as well as contact details so training providers could seek further information on how to apply and get accredited."
        },
        {
            "text": "Over 100 participants took part in the webinars, many of whom got to pose questions to the policy team and myself about the scheme and how it will work."
        },
        {
            "heading": 2,
            "text": "How can you help?"
        },
        {
            "text": "Today, we’re going to start promoting the scheme to motorists who want to tow. We know that you are as committed to keeping Britain’s roads safe as we are."
        },
        {
            "text": "Promoting accredited training to your pupils, especially if they’re looking to tow trailers when they have passed their test, will help to raise awareness and hopefully increase take up."
        },
        {
            "text": "We are also clear that this training is for everyone. There are many drivers that have always been able to tow without taking the B+E test and we know that many of them would benefit from professional, accredited training. So, if you have any other ways to signpost the scheme to motorists, including any of your former pupils, that will help us to raise awareness with existing trailer users."
        }
    ]
}