{
    "url": "https://naturalengland.blog.gov.uk/2022/05/18/people-and-nature-survey-how-has-covid-19-changed-the-way-we-engage-with-nature/",
    "title": "People and Nature Survey: How has COVID-19 changed the way we engage with nature?",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Mental health and wellbeing",
        "Natural England",
        "Science and evidence"
    ],
    "pub_date": "2022-05-18T11:02:48+01:00",
    "content": [
        {
            "text": " Dr Tom Marshall, Senior Responsible Officer for the People and Nature Survey shares what new data can tell us about how our relationship with nature has changed since coronavirus. "
        },
        {
            "text": "It has been over two years since coronavirus restrictions were first put in place in England. Few could have predicted how being asked to remain indoors for large periods of time would inspire the country to connect with nature. But people are now spending more time in green spaces and have developed a deeper connection to nature. "
        },
        {
            "text": "Nearly half of adults in England report spending more time outdoors than before the pandemic (45%, March 2022). Close to four in ten say that nature and wildlife are more important than ever to their wellbeing (39%, March 2022). "
        },
        {
            "text": "Since April 2020 the People and Nature Survey has been collecting data on the impact of coronavirus restrictions on people's enjoyment, access, and attitude towards nature. Today we have published the last in our monthly series of data releases for March 2022 specifically looking at the impact of the pandemic. We now have a valuable set of data to analyse, helping to show the changes in the way we engaged with nature as the country navigated lockdowns and the easing of restrictions.  "
        },
        {
            "text": "For many people, coronavirus restrictions allowed them to find new ways to connect with nature, whether it was bird watching in their local park, or growing vegetables on a balcony, or having a socially distanced picnic on the beach. 68% of people said they were taking more time to notice and engage with every day nature (March 2022). This includes things like listening to birdsong and noticing butterflies. "
        },
        {
            "text": "However, this transformation was not felt by all. The People and Nature Survey has revealed that for many people, spending time outside in nature is not always easy. 26% of adults surveyed said they had not spent any time in green and natural spaces in the previous 14 days (March 2022). This was higher for people from lower income households (37%, income less than £15,000, March 2022) suggesting that existing inequalities in accessing nature were not negated. "
        },
        {
            "text": "Given the restrictions on movement and travel it is understandable that people explored nature near to where they lived. 33% reported visiting local green and natural spaces more often since coronavirus restrictions were put in place, and 40% of respondents said that this has been even more important to their wellbeing (March 2022). The type and quality of local green space was dependent on where you lived. For people who lived in towns and cities, this often-meant places such as parks or playing fields, with 48% of people who spent time outdoors visiting an urban green space (March 2022). "
        },
        {
            "text": "Personally, the initial coronavirus restrictions and beautiful weather of spring 2020 provided new opportunities to engage with nature in places that I’d often overlooked. Amid the anxiety and endless video calls of the early days of pandemic, getting out into nature on a daily basis was essential for my wellbeing. Looking back from 2022, I’m grateful for the opportunity to connect with the nature on my doorstep. Living on the edge of Bristol, I explored footpaths within a couple of miles of my house that I had never used before. With some of these paths having become firm favourites, I try to spend more time in nature and continue to go for regular walks from home as we come out of the pandemic. "
        },
        {
            "text": "I hope that as life continues to return to normal, this increased connection with nature doesn’t disappear. It can be hard to find as much time for nature now that other life commitments and plans have restarted but I hope people don’t forget about the joy nature can bring in tough times. 81% of adults reported that being in nature makes them happy (March 2022). "
        },
        {
            "text": "May is National Walking month so why not take the opportunity to get outside and explore a new route? 71% of people who had spent time outside had gone for a walk (March 2022). If you are looking for ideas, you could pick a new National Trail to explore, or take part in the Slow Ways project. Or get involved with the Tree Council’s Walk Where You May campaign about exploring nature in a way that is accessible to you. "
        },
        {
            "text": "The People and Nature Survey will continue to investigate how barriers to access can be overcome because nature should be a free and easily accessible resource for all. The evidence gathered by the survey is crucial for shaping how we deliver our Connecting People with Nature programme and allows our work on inclusion to be evidence led. Data from the survey is also being used to inform initiatives across Natural England including Green Social Prescribing, Green Infrastructure and Local Nature Recovery Strategies. "
        },
        {
            "text": "---"
        },
        {
            "text": "The People and Nature Survey is run by Natural England to assess people's enjoyment, access and attitude to the natural environment and its contribution to wellbeing.  "
        },
        {
            "text": "To find out more about the survey, please visit our User Hub. We will continue to release data on a quarterly basis so sign up to be sent the latest publications."
        },
        {
            "text": "The data is available for all to explore and use. If you have any questions about the survey and how to use the date, please email people_and_nature@naturalengland.org.uk. "
        },
        {
            "text": "We’d love to hear how you are using it! "
        }
    ]
}