{
    "url": "https://mojdigital.blog.gov.uk/2022/05/18/review-ucd-conference-day/",
    "title": "Review: UCD Conference Day",
    "authors": [
        "Nikola Goger"
    ],
    "categories": [
        "UCD Conference Day"
    ],
    "pub_date": "2022-05-18T13:28:34+01:00",
    "content": [
        {
            "text": "Our design values talk about encouraging an environment of learning and sharing knowledge. And in that theme, last  February, we held our first UCD Conference."
        },
        {
            "text": "The day was full of talks, first hand service user experiences and conversations   around user-centred working at the Ministry of Justice (MoJ). Our goals for the day were:"
        },
        {
            "text": "In this blog, we wanted to share some of the key insights and feedback we received for the day."
        },
        {
            "heading": 2,
            "text": "Lead talks by industry leaders "
        },
        {
            "text": "Tech leader Ani Møller dialled in from Australia to talk about “Neurodiversity in Digital: designing for and working with neurodiverse people”."
        },
        {
            "text": "It’s a very complex, but very important issue to be discussing and paying attention to in our work, as MoJ’s Chief Operating Officer, James McEwen, pointed out: “I attended the keynote session and learnt a tonne. The importance of compassionate leadership, and having a neuro-inclusive culture, is something I am working towards in my role as ExCo Disability Champion.”"
        },
        {
            "text": "Eve Bayram, an interaction designer at MoJ, also reflected on Ani’s presentation:"
        },
        {
            "text": "“The keynote session was fantastic. We always consider physical accessibility when we design services, but we need to be thinking about the impact of our choices on everyone. Sometimes design decisions might seem small, but they have a big impact. Like choosing a highly contrasting colour palette that makes somebody feel physically sick.”"
        },
        {
            "text": "“These considerations are important wherever you work, but in the criminal justice system there is a higher percentage of neurodiverse people, so we especially need to take the time to listen to people’s personal stories and educate ourselves."
        },
        {
            "text": "“What I loved most about the session was that it wasn’t just about digital services. It was about workplace culture. Ani gave some great advice about creating a neuro-inclusive culture at work and how ultimately everyone benefits from this. This session was so thought provoking and it left me feeling energised for the day and excited to learn more.”"
        },
        {
            "text": "Phoebe Brocket, also an interaction designer at MoJ, shared her insights on the talk: “I haven't seen neurodiversity talked about much in the workplace, especially in how it relates to design, so I learnt loads and it made me excited to see MoJ-endorsed promotion of embracing differences in how we think and work — really insightful and positive!”"
        },
        {
            "text": "Next up was Filippo Cuttica, Lucia Prroni and David Etheridge from the UK Health Security Agency who talked about “Beyond accessibility: embedding inclusive design in public sector services” and facilitated a hands-on interactive workshop on their new framework."
        },
        {
            "text": "We also had A Heads of Profession (HoP) session that gave an overview of the work the HoP team has been doing in the last half year and finished with an open Q&A."
        },
        {
            "heading": 2,
            "text": "Learning from those with lived experiences"
        },
        {
            "text": " The 3 afternoon talks focused on lived experience of the criminal justice system:"
        },
        {
            "text": "Karen Simpson, an interaction designer at MoJ, said: “I wasn’t aware we had people with lived experience of prison and probation working in some of our teams until the UCD conference. I found listening to their journeys incredibly insightful. They bring a much needed perspective to the work we do and a genuine understanding of how we can improve our services.”"
        },
        {
            "text": "Interaction designer Liam McMurray added: “I thought the sessions were excellent. Hearing their stories really re-humanised the process — we’re always in danger of losing the people in the digital process.”"
        },
        {
            "text": "We are planning the next UCD Conference in September. We’re excited to continue the journey to create opportunities for learning and knowledge sharing for our UCD communities at MoJ Digital. "
        }
    ]
}