{
    "url": "https://mojdigital.blog.gov.uk/2022/05/18/taking-a-leap-of-faith-changing-careers-during-a-pandemic/",
    "title": "Taking a Leap of Faith: Changing Careers During a Pandemic",
    "authors": [
        "Matthew Howell"
    ],
    "categories": [
        "a great place to work",
        "Our services"
    ],
    "pub_date": "2022-05-18T16:14:28+01:00",
    "content": [
        {
            "text": "Before joining LAA Digital, I worked in the Higher Education sector teaching Computer Science at a Midlands University. It wasn’t something I’d planned or aspired to, but I fell in love with the role and the opportunity to shape the lives of future generations. I put in countless hours to ensure marking was finished on time and frequently gave up weekends to help run open days and events. However, this all changed during the pandemic."
        },
        {
            "text": "The transition to online learning was relatively well managed, and I was determined to ensure the students still had the best experience, so I invested in a green screen and professional camera. However, with more to do than ever before, and the demands of the role continuing to increase, eventually… I burnt out."
        },
        {
            "text": "The passion and motivation I’d had were gone, but it took a while for me to acknowledge this as I’d always prided myself on my mental fortitude and work ethic. I talked to friends and family, who were extremely supportive, and I began to ask myself - Is this really what I want?"
        },
        {
            "text": "I’d entered HE thinking it would be the perfect role to continue my personal development. Ironically, when you’re spending all your time preparing material and marking work, there isn’t a lot of time left over for learning. I eventually came to the conclusion that software development is my true passion, having enjoyed creating new assignments or problem sets for students, times when I could really get my hands dirty."
        },
        {
            "text": "Turning Point"
        },
        {
            "text": "However, I had trouble letting go. I felt responsible for the students in my care and the teaching material I’d developed. How could I leave all of this behind? Was I good enough? Would anyone want to hire me? Then, personal tragedy struck. I lost a dear friend in a motorcycle accident at the age of 28. Even now almost a year on, I’m still not sure if I’ve fully come to terms with his passing. He always lived life to the fullest, and it gives me great solace knowing that he died doing something he loved. He made me realise that life is too short to spend it being unhappy, so I began job hunting and eventually, something caught my eye."
        },
        {
            "text": "LAA Digital Team"
        },
        {
            "text": "LAA Digital Team were advertising development roles nationwide, touting a strong commitment to L&D and an opportunity to work on public facing systems. So I buried my doubts and applied for the position. I’ve been with LAA Digital for around 7 months now and am content to say It’s everything I hoped it would be, and more!"
        },
        {
            "text": "I’d imagined the civil service as an old, outdated, behind the times employer, but now realise how wrong I was. I’m routinely utilising modern tools and technologies, my technical knowledge continues to reach new heights, and I’m contributing to something valuable. They also emphasise the importance of feedback with fortnightly surveys and opportunities for teams to meet the senior management team, who genuinely want LAA Digital to be the best place to work."
        },
        {
            "text": "I work in the Crime apps team who develop and maintain the software that drives the criminal legal aid process. Right now, our main focus is centred around modernisation, and migrating large parts of our legacy estate via the development of new microservices, allowing us to take advantage of modern technologies and tooling. Some of our software is decades old, so it’s exciting to be involved in these efforts, which will undoubtedly improve the experience of our stakeholders when applying for legal aid."
        },
        {
            "text": "Continuous development"
        },
        {
            "text": "One of the best things about LAA Digital is their commitment to L&D. Funding is available to invest in conferences, online learning platforms, certifications etc, and I’ve been able to make a strong contribution to my team. Everyone I work with is wonderful and genuinely wants to deliver quality software, and we have top notch equipment and development resources available to support us to do that."
        },
        {
            "text": "I took a leap of faith, and I’m so glad I did. If you’re considering new horizons, my advice is - do it. We only regret the opportunities we don’t take."
        }
    ]
}