{
    "url": "https://dragonsden.blog.gov.uk/2023/02/16/dragons-den-series-20-episode-7/",
    "title": "Dragons’ Den, Series 20 Episode 7",
    "authors": [
        "Oliver Downey"
    ],
    "categories": [
        "Copyright",
        "Designs",
        "IP",
        "Patents",
        "Trade marks"
    ],
    "pub_date": "2023-02-16T21:05:06+00:00",
    "content": [
        {
            "text": "Tonight’s booming episode of Dragons’ Den was as productive as it gets! Various deals were shared around the Den, offered by free-handed investors and rejected by wary, self-assured entrepreneurs. "
        },
        {
            "text": "In this week’s blog, I’ll focus on two pitches and consider what is patentable and the difference between designs and patents.  "
        },
        {
            "heading": 2,
            "text": "Swapping divas for Dragons"
        },
        {
            "text": "First in the Den was Alex Brees, CEO and founder of Un:Hurd, a data-driven music marketing company which helps independent musicians access streams via playlists and run ads on social media platforms."
        },
        {
            "text": "   "
        },
        {
            "text": "With a background in data analytics, as well as an impressive portfolio of celebrity connections, Alex noticed that the independent music sector didn’t have the tools to promote music across various marketing channels. And so in December 2021, he launched an ‘in your pocket music promotions hub’. "
        },
        {
            "text": "Seeking £120k for a 4% equity stake in his start-up, Alex entered the Den confident that he had already signed up 2,400 artists organically since the company’s launch. But was his performance in the Den as impressive? "
        },
        {
            "text": "Alex explained that his company’s algorithm takes an artist’s data and then turns it into targeted and practical marketing. Although there was no mention of intellectual property (IP) during the pitch, is it possible to protect an algorithm with an IP right?  "
        },
        {
            "text": "Section 1 of the UK Patents Act 1977 sets out four conditions that an invention must satisfy for the grant of a valid patent: "
        },
        {
            "text": "However, there are many other forms of IP protection from which Alex and others might benefit. For example, trade secret protection might be considered to protect confidential information or know-how which has some commercial value. A trade mark might help to protect a brand name or logo. Copyright may protect a business’ marketing materials and an app’s program code, and the look and feel of an app might be covered by design rights.  "
        },
        {
            "text": "Alex's pitch was clearly music to the Dragons' ears as Touker Suleyman, Peter Jones and Deborah Meaden all offered the full investment for 15% of the business. In the end, Alex accepted a joint-offer from Peter and Deborah for 7.5% each."
        },
        {
            "heading": 2,
            "text": "The IQ to navigate IP"
        },
        {
            "text": "Next up was Zoe Chapman, founder of KiddiWhizz. Her invention, The Whizzer, is an on-the-go solution for children who are at the potty-training stage. She entered the Den looking for a £50k investment in return for 10% of her business."
        },
        {
            "text": "Zoe states in the episode – to the Dragons’ delight - that she had already applied for intellectual property protection. She hasn’t spent much money on IP because she has applied for all of it herself. While this is something which can be done, we would always advise seeking legal advice via an IP attorney when applying for rights, especially patents.  "
        },
        {
            "text": "Zoe told the Dragons that she has applied for a ‘design utility patent’. In the U.S. system, this is basically a registered design. However, in the UK, we don’t grant design utility patents. Therefore, I was initially unsure as to whether Zoe had obtained patent or design protection.  "
        },
        {
            "text": "A design registration lasts 5 years and you must renew your design registration every 5 years to keep it protected – up to a maximum of 25 years. "
        },
        {
            "text": "I checked our designs register and Zoe was granted design protection in February 2021, so she would need to renew her design protection every 5 years to keep her product covered by design IP rights.  "
        },
        {
            "text": "Zoe certainly impressed the Dragons, but two Dragons were especially ‘whizzed’ up by Zoe’s pitch. Sara Davies and Steven Bartlett went head-to-head to convince Zoe that their area of business was the one she needed to take her product to the next level. In the end, Zoe accepted a joint offer from Sara and Steven, each offering £25k in return for a 12.5% stake each."
        },
        {
            "text": " "
        }
    ]
}