{
    "url": "https://educationhub.blog.gov.uk/2023/02/16/get-the-facts-on-student-loans/",
    "title": "Get the facts on student loans",
    "authors": [
        "Media Officer"
    ],
    "categories": [
        "Higher Education",
        "Universities"
    ],
    "pub_date": "2023-02-16T14:00:51+00:00",
    "content": [
        {
            "text": "Whether you’re just thinking about your options, or you’ve already submitted your UCAS form, now is the time to think about how you’ll pay for your studies."
        },
        {
            "text": "Lots of people choose a student loan offered by Student Finance England to fund their studies, but other sources of finance may be available. Before making your decision, make sure you have the facts on how student loans work and how they’re repaid."
        },
        {
            "text": "Here we answer your questions about student loans for those living in England and starting an undergraduate degree from this September."
        },
        {
            "text": "It’s important to mention that student loans are different for those who have already started their studies, are doing a postgraduate degree or live outside England."
        },
        {
            "heading": 3,
            "text": "Are student loans the same as other loans? "
        },
        {
            "text": "No. Student loans are different to other loans. They come from the government and provide some important protections that are not always available on commercial loans, like when borrowing on a credit card or using loans used to buy a car or a house."
        },
        {
            "text": "With most commercial loans you start repaying your loan immediately or after an interest-free period. With a student loan, you’re only liable to repay from the April after you leave your course, and your repayments will only start if you’re earning more than the repayment threshold of £25,000 a year."
        },
        {
            "text": "The amount you pay back each month on commercial loans is set at the time you take out the loan and depends on a few factors, including how much you’ve borrowed."
        },
        {
            "text": "For a student loan, the amount you repay each month, if you’re paid monthly, depends on how much you earn over the repayment threshold. So, the more you earn, the more you repay and if your earnings fall below the threshold, you’re not required to pay back anything."
        },
        {
            "text": "Finally, unlike commercial loans, if you have not repaid your student loan after 40 years, the amount you still owe is automatically cancelled, regardless of how much it is."
        },
        {
            "heading": 3,
            "text": "How do I apply for a student loan?"
        },
        {
            "text": "Students can apply online through the dedicated Student Finance England (SFE) application portal, which opens late February/early March for those doing full-time courses. Those doing part-time courses and short courses apply later in the year."
        },
        {
            "text": "Visit the SFE website for more information or follow SFE on social media to get alerts about upcoming deadlines and when it's time to apply."
        },
        {
            "heading": 3,
            "text": "How much can I borrow?"
        },
        {
            "text": "You can borrow money for your tuition fees and for living expenses. A tuition fee loan goes towards the cost of your course, up to a maximum of £9,250 per year – which is the full cost of tuition in most cases – and is paid directly to your university or college."
        },
        {
            "text": "A maintenance loan helps with the everyday costs of being a student like accommodation, food and transport. It’s paid directly into your bank account in instalments at the start of each term."
        },
        {
            "text": "The amount you can apply for depends on several factors, including where you live and study and your household income. Use this link to find out how much you’re entitled to."
        },
        {
            "heading": 3,
            "text": "How much will my total loan be when I finish? "
        },
        {
            "text": "Your total loan is made up of everything you borrowed while studying, plus interest."
        },
        {
            "text": "Interest is added from when the first amount is paid either to you or to your university or college, until the loan is paid off or cancelled. The interest rate is set at the start of each academic year and is linked to the rate of inflation as measured by the Retail Price Index (RPI). This means that the amount you owe does increase but only by about as much as the price of things in general."
        },
        {
            "text": "While interest added will affect how long it takes you to fully repay your student loan, the amount you repay each week, month or year is based solely on what you earn, not what you owe."
        },
        {
            "heading": 3,
            "text": "How do I repay my student loan?"
        },
        {
            "text": "The biggest difference between student loans and other loans is in the repayments. You only start paying it back when your income is over the repayment threshold of £25,000 a year, which is £2,083 a month or £480 a week."
        },
        {
            "text": "Repayments are calculated at 9% (or 9p in every £1) on everything you earn over the threshold. This amount is automatically deducted from your salary by your employer, at the same time as tax and National Insurance, or calculated from your tax return if you’re self-employed."
        },
        {
            "text": "For example, imagine your annual income is £28,000 and you’re paid a regular monthly wage. This means that each month you earn £2,333 (£28,000 divided by 12). This is £250 over the threshold of £2,083 (£2,333 minus £2,083 is £250). Therefore, your repayment is 9% of £250 (£250 multiplied by 9 and divided by 100) which is £22.50. This is rounded down to the nearest pound, so you would repay £22 each month on your student loan."
        },
        {
            "text": "To find out more, watch this explainer video or visit our page on The Student Room to look at the guide to understanding student loans and the full list of frequently-asked questions."
        }
    ]
}