{
    "url": "https://forestrycommission.blog.gov.uk/2023/02/16/how-trees-can-stack-up-to-help-your-farm-business-diversify/",
    "title": "How trees can stack up to help your farm business diversify",
    "authors": [
        "Peter Knox"
    ],
    "categories": [
        "Tree Planting",
        "Woodland creation",
        "Woodland management"
    ],
    "pub_date": "2023-02-16T09:00:10+00:00",
    "content": [
        {
            "text": "Farmers are facing a challenging marketplace. Figures taken from Farmers Weekly [note 1] and Andersons Ltd [note 2] show that in the past year farmers have experienced a 42% rise in sale prices of their produce but their costs have increased by 79% over the same period. This has resulted in many farms being 37% worse off.  "
        },
        {
            "text": "Global events have resulted in greater fluctuations within the agricultural markets than have been seen for over a generation. This has made it riskier for a farm business to do one thing very well. And while being a ‘jack of all trades’ may be better than the master of one, perhaps the overriding aim is to become the ‘jack of all trades and the master of one’. "
        },
        {
            "text": "There of course is a caveat to this. You can’t do everything, everywhere, all of the time. The strain on finances, space, time, and soils will be a business’s undoing. The answer to this is layering, allowing enterprises to utilise resources harmoniously to give back and support each other.  "
        },
        {
            "text": "Utilising more marginal land to plant trees under the England Woodland Creation Offer (EWCO) provides three layers of funding: "
        },
        {
            "text": "In addition, revenue streams can be generated from planting through the sale of carbon credits under the Woodland Carbon Code. Furthermore, harvesting trees for timber and firewood can also provide reliable short or long-term income streams for your business. Still, the opportunities spread beyond this, both tangibly and intangibly.  "
        },
        {
            "heading": 3,
            "text": "The wider benefits of trees "
        },
        {
            "text": "Trees improve soil structure through the decomposition of leaf litter, reduce flooding and associated nutrient run-off while also lowering drought risk. This in turn further improves the quality of the adjacent profitable land, allowing for reduced inputs without compromising crop yields or stocking densities. By providing shelter, trees can reduce crop losses from wind damage and offer livestock shelter in winter months and shade during hot weather.  "
        },
        {
            "heading": 3,
            "text": "Farmers walking the talk "
        },
        {
            "text": "During a farm walk hosted by a local Rivers Trust, I saw first-hand these benefits in practice. The farmer advised he was almost able to go a full year without bringing his cattle inside because the land was no longer being poached (the physical breakdown of soil structure under heavy animals) in the winter and the trees offered sufficient shade and shelter to the livestock, thereby reducing feed and bedding costs. In addition, the management of the trees offers sufficient woodchip to heat the farmhouse all year-round, and would no doubt be sold locally if it were not for the installation of their biomass boiler.  "
        },
        {
            "text": "I recently visited a farm in the North Pennines and they took this one step further. The farmer has invested in a flock of chickens that could roam the woodland and pastureland based on evidence [note 3] that shows chickens are less stressed and produce more and higher quality eggs when in a woodland environment. The chickens also feed on the insects and larvae occupying the soils, grasses, and dung. This helps to reduce livestock insect irritations such as flystrike and mastitis thereby reducing farm inputs, while also producing sufficient eggs to sell locally – up to eight dozen a week during peak season. All this has improved the financial viability of the farm whilst reducing the farm’s inputs. "
        },
        {
            "heading": 3,
            "text": "Making the most of your woodland setting "
        },
        {
            "text": "Campsites have seen a huge increase in the last couple of years, as has glamping, static caravans and holiday cottages, with the pandemic causing a 500% increase [note 4] in such holidays. A farm in County Durham has seen increased demand and a higher nightly fee for their holiday cottages since undertaking planting and setting aside paths for holiday makers on their 75-acre farm.  "
        },
        {
            "text": "A smallholding I visited on the edge of the Lake District has embraced all these aspects with a perfect outcome. The planting of small coppices of woodland has allowed pigs, chickens, and native rare breed cattle to remain outside all year round, with produce sold at a premium price to local farm shops and high-end restaurants. The improved flora is now a feeding ground for bees from the twelve hives they manage on the farm. While during the summer months, one of the fields is used as a small campsite for 28 days of the year, with campers now in the market for locally produced firewood, honey, eggs and meat.  "
        },
        {
            "text": "My partner and I have just bought a smallholding in the Lake District National Park. The land has a couple of footpaths passing over it and we intend to maximise as many diversification opportunities as possible.  "
        },
        {
            "heading": 3,
            "text": "Things to consider before you diversify "
        },
        {
            "text": "It’s important to research local market demand and consider your surroundings before you think about diversifying. Not every enterprise is suitable for every farm business. For example, having a nearby community helps with the sale of farm produce, whilst a flat field with good public rights of way and some washing facilities makes for a better campsite location. Not every farm has all of these, but by speaking to your local Business Development Advisor they can help identify potential tree planting schemes that align with your objectives. "
        },
        {
            "text": "Be it large or small, every farm can diversify and improve their farm business through woodland creation. "
        },
        {
            "text": "Notes:"
        },
        {
            "text": "1. Farmers Weekly. Market trends [printed publications] "
        },
        {
            "text": "2. Andersons The Farm Business Consultants Ltd. Farm Business Review 2022 [report] "
        },
        {
            "text": "3. Woodland Trust, July 2014. The role of trees in free range poultry farming [guidance] "
        },
        {
            "text": "4. This Is Money, 7 June 2021. Grace Gausden – Article 9648049 [blog article] "
        }
    ]
}