{
    "url": "https://naturalengland.blog.gov.uk/2023/02/16/poisonings/",
    "title": "Gamekeeper sentenced for raptor persecution illustrates wider problem of wildlife poisonings",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Licensing",
        "Protected sites and species",
        "Wildlife"
    ],
    "pub_date": "2023-02-16T16:42:13+00:00",
    "content": [
        {
            "text": "By Stephanie Bird-Halton, National Delivery Director."
        },
        {
            "text": "Today, Paul Allen, a gamekeeper working on the Shaftesbury Estate in Dorset, was sentenced for offences of possession of dead buzzards, keeping of banned pesticides and failing to comply with conditions of shotgun and firearms certificates."
        },
        {
            "text": "Natural England is determined to tackle the scourge of raptor persecution. One of our roles involves investigating incidents where wildlife has been poisoned and we assisted Dorset Police in in this prosecution, gathering evidence and providing specialist technical advice. We are extremely pleased that he has been held to account for his appalling offences against wildlife."
        },
        {
            "text": "This case, and the death in Dorset of one of the stunning White-tailed Eagles reintroduced to the Isle of Wight, are clear examples of a wider problem: the widespread misuse and abuse of poisons in the countryside which is killing birds of prey, and poses ongoing risks to the public."
        },
        {
            "text": "During the coronavirus lockdown period, there was a spike in the number of poisoning cases reported with 230 accepted into the Wildlife Incident Investigation Scheme (WIIS) in 2020/21 as compared with 124 in 2019/20 and the problem has not gone away. In 2021/22, Natural England accepted 133 incidents of animal deaths suspected to be poisonings into WIIS. Cases remain unevenly spread throughout England with the highest number of incidents consistently being found in North Yorkshire (28 in 2019/20 and 54 in 2020/21)."
        },
        {
            "text": "When we investigate an incident and confirm it is a poisoning, we assess the evidence gathered, post-mortem results and tissue analysis to find out if the poisoning was as a result of a misuse or abuse of pesticides. Misuse is not following the legal requirements of use, whereas abuse is deliberate use in an illegal manner to poison animals. Where the evidence is unclear, cases are classified as “unspecified”. Not all cases accepted into investigation reach the assessment process, particularly where it becomes clear that pesticides have not been involved in the death of the animal."
        },
        {
            "text": "In 2020/21, 37 cases of animal poisoning were assessed as being the result of abuse. There were six cases of misuse and 140 unspecified. 21 of the abuse cases related to the poisoning of raptors and these cases were passed on to the Police for further investigation."
        },
        {
            "text": "The RSPB’s Bird crime 2021 report, published last November tells the same story of raptor persecution, with 80 confirmed incidents of bird of prey persecution in England, mainly through shooting, trapping or poisoning."
        },
        {
            "text": "Based on data from WIIS, from 2016 onward, Natural England has observed a particular increase in frequency of Second-Generation Anticoagulant Rodenticides (SGARS) being linked to the cause of death in animals or being found in relatively high concentrations in those animals."
        },
        {
            "text": "Rodent control is essential to public health and users of rodenticides, including SGARS, span many industries including pest controllers, farmers and food producers. Other users of rodenticides include the game shooting industry. The use of anticoagulant rodenticides by professional users must follow the requirements of the industry led rodenticide stewardship regime Campaign for Responsible Rodenticide Use UK set up in 2016, as well as complying with the product label requirements."
        },
        {
            "text": "It is imperative that anyone dealing with a rodent problem keeps within the law, follows the best practice guidelines, only using rodenticides after alternatives have been explored and doing so in a graduated, careful and responsible way, ensuring that rodent carcasses are disposed of promptly. However, cases of raptors dying with high levels of rodenticides in their system suggest there is a problem with the use of rodenticides – whether this be from deliberate abuse or misuse."
        },
        {
            "text": "NE will continue to play its part, investigating poisoning incidents and working with the police and other partners to prosecute offences. Anyone can help - reports from the public can play an essential part in identifying cases of raptor persecution. However, without all landowners, land managers and gamekeepers complying with the law and reporting illegal activity, the impact on our wildlife will continue."
        },
        {
            "text": " "
        },
        {
            "text": "If you see dead birds of prey, please report them to the police but do not pick them up due to the dangers of poisons and bird flu. A wildlife crime in progress is a 999 call, an urgent suspicious finding needs to be called in on 101 immediately."
        }
    ]
}