{
    "url": "https://ssac.blog.gov.uk/2023/02/16/social-security-advisory-committee-a-unique-and-valuable-body/",
    "title": "Social Security Advisory Committee: a unique and valuable body",
    "authors": [
        "Victoria Todd"
    ],
    "categories": [
        "About the Committee",
        "DWP",
        "HMRC",
        "Legislation",
        "social security",
        "SSAC Independent Work Programme",
        "SSAC Occasional Papers",
        "Stakeholders",
        "Universal Credit"
    ],
    "pub_date": "2023-02-16T16:27:01+00:00",
    "content": [
        {
            "text": "Prior to my appointment to the Social Security Advisory Committee (SSAC), my work at the Low Incomes Tax Reform Group was primarily focused on tax and tax credits. At that time, I had developed a special interest in the tax credit system and had an in-depth knowledge of the legislation and practical operation of the system. I was attracted to apply to SSAC as I thought it was a great opportunity to use the tax credits expertise that I had, to get more involved in the legislative process at an earlier point and perhaps to have some small influence on future legislation. The role turned out to be all of those things and so much more."
        },
        {
            "text": "One of SSAC’s statutory functions is to scrutinise secondary legislation relating to social security. Before joining SSAC, I assumed that most members would have similar experience to me in terms of technical social security knowledge. However, what I found was that the SSAC Committee members come from a really wide range of backgrounds and each member brings different skills to the Committee. As I look back on my time with the Committee, it was this time spent with that wide range of Committee members, and the discussions that we had, that I valued most about the experience. Whilst I often looked at things from a purely technical perspective, my colleagues offered observations about how the specific proposals fit with wider policies and considered impacts that perhaps wouldn’t have occurred to me. That combined knowledge and experience is what I think makes SSAC a particularly unique and valuable body. From a personal perspective, I left the Committee with a far greater understanding of the wider social security system and the broader economic social context than I had before I joined and that continues to benefit my work today.  "
        },
        {
            "text": "There were many highlights in my time on the Committee but I was particularly proud of the work that the Committee did on the managed migration regulations in 2019. Whilst naturally appealing to my love of technical work, I also welcomed discussing issues with officials from the Department for Work and Pensions (DWP) and HM Revenue and Customs hearing about the issues from their perspective. I also particularly enjoyed the visits that I took part in with SSAC. Some were to different parts of DWP operations, for example spending time in a Jobcentre with Universal Credit work coaches or visiting a telephone contact centre. Other visits involved spending time with third party organisations, seeing their work in the community and listening to the issues that their users faced daily in accessing the social security system. These opportunities were unique to being a SSAC Committee member. Not only did they allow me to understand far more about claimant experience of the system, they allowed me to see and understand the system from DWP staff perspective. All of these insights have continued to be valuable in the work I do today.  "
        },
        {
            "text": "NOTE: The Department for Work and Pensions is seeking to appoint five new members to the Social Security Advisory Committee.  If you are interested in providing impartial, credible, evidence-based advice to the Secretary of State for Work and Pensions, and have the necessary skills and experience, find out how to apply here.  Closing date for applications is 10 March."
        }
    ]
}