{
    "url": "https://despatch.blog.gov.uk/2023/02/16/the-new-driver-services-platform-the-work-done-so-far-and-whats-next/",
    "title": "The new driver services platform: the work done so far and what's next",
    "authors": [
        "Jacqui Turland"
    ],
    "categories": [
        "Driving instructors",
        "Driving test",
        "Learning to drive"
    ],
    "pub_date": "2023-02-16T14:34:02+00:00",
    "content": [
        {
            "text": "Back in May 2022 we committed in our 2022 business plan to looking at the technology that supports driving test bookings and instructor registration.  "
        },
        {
            "text": "Since then, we have said very little externally about the work we’ve been doing. Not because we haven’t done anything, but because we wanted to wait until we had completed the first stage so we could give you the full picture. "
        },
        {
            "heading": 2,
            "text": "Understanding the current system "
        },
        {
            "text": "The first stage of the project, known as the discovery phase, focused on research. It involved looking at the existing system through the eyes of current users. This helped us to get a better understanding of what users, both internal and external, needed from an updated system, and any constraints we face and the opportunities there are to improve things. "
        },
        {
            "text": "Over three months of research with a wide list of users to talk to, which included; learner drivers, driving and riding instructors and trainer bookers, we began to get a picture of what they thought of the current system.  "
        },
        {
            "text": "We also spoke to our own colleagues who use the system, including local driving test managers, deployment, the ADI team and the customer service centre (CSC) as the new system will need to take their needs in to consideration as well "
        },
        {
            "heading": 2,
            "text": "What we learnt  "
        },
        {
            "text": "The detail and insights we uncovered through the research phase were extremely useful. The main trends were: "
        },
        {
            "text": "Participants in our research were open and honest about their experiences. This phase helped us better understand what users need, what constraints we face, and what opportunities there are to improve things moving forward. "
        },
        {
            "text": "These research sessions made it clear people were struggling with the system. The theme of the discussions showed the current system is not a positive user experience. It is important to us that it is.  "
        },
        {
            "text": "For our colleagues, it is not making their jobs as straightforward as they could be. We want to ensure we are working towards a more efficient, straightforward system for them to be able to perform their jobs with up-to-standard facilities. It’s important we make our new driver services platform a positive user experience for all our colleagues and customers.  "
        },
        {
            "heading": 2,
            "text": "Building on the research "
        },
        {
            "text": "The next step in the process was the ‘alpha’ phase. The alpha phase of any project is about building on the findings from the user research and starting to look at different ideas and testing very early solutions. "
        },
        {
            "text": "We spent time with colleagues in the different areas of DVSA such as CSC, operations and deployment team, to see how they use the current system to support our customers and if any limitations affect the service we provide. "
        },
        {
            "text": "The time we spent with local driving test managers highlighted that their current level of access to the system hinders their ability to support candidates who asked for additional support.  "
        },
        {
            "text": "Time with CSC showed the level of access they have on the current system means they have to pass queries onto deployment to solve, rather than being able to fix a caller’s problem there and then. "
        },
        {
            "text": "From the discovery phase we knew the Deployment team feels constant pressure to use DEs’ time to the maximum and provide as many tests as possible in the areas where our customers most need them. "
        },
        {
            "text": "We spoke to learner drivers who had booked a practical test, and focussed in particular on customers with additional requirements to understand who we can best help them. \n "
        },
        {
            "heading": 2,
            "text": "Next steps "
        },
        {
            "text": "Having reached the end of alpha, the next stage in the project is ‘ beta’. In simple terms this phase includes building versions of the new system and trialling them in small areas to see how they perform. "
        },
        {
            "text": "We are currently in the process of finding a supplier to work with us on delivering the next phase of the project. We will keep you updated on progress when we can. "
        }
    ]
}