{
    "url": "https://educationinspection.blog.gov.uk/2023/02/16/what-does-high-quality-curriculum-and-teaching-look-like-in-further-education-and-skills/",
    "title": "What does high-quality curriculum and teaching look like in further education and skills?",
    "authors": [
        "Paul Joyce, Deputy Director, Further Education and Skills"
    ],
    "categories": [
        "curriculum",
        "further education and skills"
    ],
    "pub_date": "2023-02-16T10:00:54+00:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "Our Annual Report 2021/22 showed a broadly positive picture for the further education and skills sector. 80% of providers are good or outstanding. Most of the sector is providing high-quality education for learners and apprentices, despite the pandemic and new economic challenges."
        },
        {
            "text": "This blog describes some of the factors that contribute to a successful learning experience."
        },
        {
            "text": "Ambitious and challenging programmes"
        },
        {
            "text": "Across all subjects and types of provision, good teachers use their subject and industrial expertise to design programmes around ambitious, challenging content. This provides a solid basis for learners’ next steps in education, employment and wider life. Good teachers design ambitious and challenging programmes around questions like:"
        },
        {
            "text": "Well-ordered curriculums"
        },
        {
            "text": "We know too that effective teachers also think carefully about the order in which they teach topics. They consider what apprentices and learners need to learn securely to perform specific tasks at work. Construction apprentices, for example, need a good knowledge of maths – how to calculate area and volume, for instance – before they can order materials. Beauty therapy apprentices need knowledge of anatomy and physiology before they can design and carry out appropriate courses of treatment. Our evidence shows that good teachers across the sector plan and order the curriculum to ensure success and enable learners and apprentices to build their knowledge, skills and understanding on firm and useful foundations over time."
        },
        {
            "text": "Carefully selected teaching methods"
        },
        {
            "text": "Our inspection evidence shows that good teachers also give a lot of thought to the teaching methods they use. Common factors include:"
        },
        {
            "text": "This kind of secure, deep-rooted learning helps learners to apply their knowledge with increasing expertise and confidence. Over time, it will allow them to develop and contribute well-informed insights, evaluations and critiques."
        },
        {
            "text": "Well-supported teachers"
        },
        {
            "text": "Unsurprisingly, our evidence shows that teachers can do their best work when they are well supported by the leaders and managers in their institution."
        },
        {
            "text": "Access to high-quality training and professional development that develops teachers’ subject knowledge, their teaching skills and their awareness of contemporary practice is invaluable."
        },
        {
            "text": "Good teachers are experts in their subjects – although it’s not always the case that subject experts are good teachers. Teaching is a complex skill that requires considerable knowledge of how learners learn and how a subject should be sequenced to facilitate progress."
        },
        {
            "text": "A positive national picture"
        },
        {
            "text": "Most further education and skills providers know and do all of this. They also pay attention to learners’ wider, personal development. And they ensure that learners benefit from focused, calm, inclusive environments, appropriate for work, study and positive social interactions."
        },
        {
            "text": "When these elements are in place, learners and apprentices are inspired and motivated. They live up to high expectations and appreciate being challenged to achieve their best. They make progress in their subjects, gain greater independence, and move on to good jobs or further study. What they have learned in further education sets them up well for life."
        },
        {
            "text": "We will continue promoting improvement through inspection this year and we hope to see an even higher proportion of providers being graded as good or outstanding at inspection in our next annual report."
        }
    ]
}