{
    "url": "https://childrenssocialcare.blog.gov.uk/2025/06/11/changing-the-script-on-social-work/",
    "title": "My journey: from vulnerability to Changing the Script on social work ",
    "authors": [
        "Clair Graham"
    ],
    "categories": [
        "Foster care",
        "Leadership",
        "Leadership",
        "Social Work",
        "Working in children's social care"
    ],
    "pub_date": "2025-06-11T16:40:08+01:00",
    "content": [
        {
            "text": "Growing up in the West Midlands, I never imagined I’d one day be leading a team protecting vulnerable children. Now, I'm Head of Service for Contextual Safeguarding at Birmingham Children's Trust. This involves leading a multi-agency partnership hub to protect children from exploitation, those reported missing, involved in serious violence, or vulnerable to radicalisation. I'm also a foster carer and proud Birmingham City University alumna, recognised with the High Sheriff award for community work. "
        },
        {
            "heading": 2,
            "text": "Overcoming childhood challenges "
        },
        {
            "text": "But my story begins very differently. I lived in a deprived area where poverty drove my offending behaviour and negative peer group associations. In an unsafe home environment with mental health issues and neglect, I was frequently reported missing, sometimes for weeks at a time. At 14, I was permanently excluded from school, and by 15, placed in local authority care after being declared \"beyond parental control.\"  "
        },
        {
            "heading": 2,
            "text": "Transforming my life path "
        },
        {
            "text": "Research suggested my future looked bleak; \"dead or in prison\" were the predicted outcomes. But everything changed when I gave birth to my son at 17. Realising somebody truly depended on me transformed not just my present circumstances but  my entire future. I wanted to be the adult that I needed as a child - which is why I chose to study social work. "
        },
        {
            "heading": 2,
            "text": "Championing social work’s true impact "
        },
        {
            "text": "This drives my passion for Social Work England's 'Change the Script' campaign. Social workers protect, support, and empower people to improve their chances in life. Yet, the way people talk and write about social work doesn't always reflect this reality. "
        },
        {
            "heading": 2,
            "text": "Seeing beyond labels "
        },
        {
            "text": "My experiences provide invaluable insight in my professional life, and I have a deeper understanding of risks and trauma and their impact. When others might see a \"difficult\" or “troubled” child, I see potential waiting to be unlocked. "
        },
        {
            "text": "The challenges I faced taught me that with proper support, anyone can rewrite their story. That's what drives me - ensuring every child has the chance to fill the remaining pages of their story with hope, achievement, and possibility. "
        },
        {
            "text": "The perception that social work isn't respected in society doesn't recognise the profound impact we have. As a regulated profession - like doctors, nurses, and solicitors – social workers must have recognised qualifications and meet professional standards that reflect the value and diversity of social work practice. "
        },
        {
            "text": "Every day, we help rewrite stories for vulnerable people. We're changing perceptions one interaction at a time. My journey from vulnerability to safeguarding others demonstrates how social work transforms lives. By sharing authentic stories, we can change the script on social work together. "
        },
        {
            "heading": 2,
            "text": "Find out more  "
        },
        {
            "text": "Visit the Social Work England website to learn more about social work and support the Change the Script campaign. "
        }
    ]
}