{
    "url": "https://mhclgmedia.blog.gov.uk/2025/06/11/deputy-prime-minister-scraps-outdated-vagrancy-act/",
    "title": "Deputy Prime Minister scraps outdated Vagrancy Act",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Homelessness"
    ],
    "pub_date": "2025-06-11T16:10:39+01:00",
    "content": [
        {
            "text": "It was confirmed this week (Wednesday 10th July) that the Government will formally scrap the Vagrancy Act by Spring next year. New legislation brought forward through the Home Office’s Crime and Policing Bill will instead focus on real crimes such as organised begging by gangs and trespassing—protecting communities without penalising vulnerable people."
        },
        {
            "text": "The news has generated prominent coverage across broadcast, print and online outlets. "
        },
        {
            "text": "The Daily Telegraph’s splash story leads on the Deputy Prime Ministers decimalise rough sleeping, echoing the government’s pledge to increase funding for homelessness services by an extra £233 million, bringing the total investment for this financial year to nearly £1 billion. The article carries comments from key voices such as Matt Downie, the chief executive of Crisis who says the move ‘will change lives and prevent thousands of people from being pushed into the shadows, away from safety’ in addition to St Mungo’s chief executive who said the Act’s repeal ‘cannot come soon enough’."
        },
        {
            "text": "An exclusive op-ed from the Deputy Prime Minister is also carried in the Mirror, marking how the announcement is a major shift to how the government is responding to the rough sleeping crisis. A wider piece by the outlet details the wider steps the government is making to fix the housing crisis, including the Renters’ Rights Bill and reforms to Right to Buy."
        },
        {
            "text": "Elsewhere, support from homelessness charities such as Crisis and St Mungo’s has been positively covered by The I paper, Evening Standardand Express and Star who report charities have hailed it as a ‘landmark moment’. St Mungo’s CEO, Emma Haddad also features on the R4 Today Programme expressing her support of the decision.  In the Big Issue,  history of the Vagrancy Act is echoed noting that intention to repeal the act first started in 2021 however was never pursued, the piece notes that amendments to the Crime and Policing Bill will ‘finally consign he Vagrancy Act to the history books’."
        },
        {
            "text": "The Deputy Prime Minister Angela Rayner said:    "
        },
        {
            "text": "“We are drawing a line under nearly two centuries of injustice towards some of the most vulnerable in society, who deserve dignity and support. "
        },
        {
            "text": "“No one should ever be criminalised simply for sleeping rough and by scrapping this cruel and outdated law, we are making sure that can never happen again.”   "
        },
        {
            "text": "The Minister for Homelessness Rushanara Ali said:   "
        },
        {
            "text": "“Today marks a historic shift in how we’re responding to the rough sleeping crisis, by repealing an archaic Act that is neither just nor fit for purpose."
        },
        {
            "text": "“Scrapping the Vagrancy Act for good is another step forward in our mission to tackle homelessness in all its forms, by focusing our efforts on its root causes.”"
        }
    ]
}