{
    "url": "https://naturalengland.blog.gov.uk/2025/06/11/nature-for-health-greening-healthcare-sites-for-people-and-wildlife/",
    "title": "Nature for Health: Greening Healthcare Sites for People and Wildlife",
    "authors": [
        "Lucy Prescott"
    ],
    "categories": [
        "Connecting People with Nature",
        "Development",
        "Green Infrastructure",
        "Mental health and wellbeing",
        "Natural England",
        "Nature",
        "Nature Recovery Network",
        "Wildlife"
    ],
    "pub_date": "2025-06-11T12:21:42+01:00",
    "content": [
        {
            "text": "By Lucy Prescott, Health and Nature Senior Officer"
        },
        {
            "text": "Restoring nature goes beyond protecting wildlife and increasing biodiversity. It is also about rebuilding everyday connections between people and the natural world. "
        },
        {
            "text": "To achieve this, we must broaden our partnerships and engage across diverse sectors and communities, including those for whom nature recovery is not a day-to-day concern. By understanding different perspectives and values, we can make nature relevant to everyone and inspire collective action to embed nature at the heart of a fairer, healthier society."
        },
        {
            "text": "When we think about nature recovery, the health sector might not be the first partner that comes to mind. The healthcare estate may not offer vast landscapes for large-scale ecological restoration, but, as an anchor institution, the NHS has a key role to play in supporting positive social and environmental outcomes for the communities it serves. "
        },
        {
            "text": "By enhancing green spaces around hospitals, clinics, and community health centres, we can bring accessible nature closer to where people live, work, and receive care - making it part of their everyday life."
        },
        {
            "text": "At Natural England, we’ve been working with the NHS to do just that. "
        },
        {
            "text": "Together, we’re exploring how green spaces in and around healthcare sites can support NHS priorities to improve patient care, enhance staff wellbeing, tackle health inequalities, and build a Net Zero, climate-resilient health service. "
        },
        {
            "text": "At the same time, we are promoting the role of the healthcare estate in supporting local wildlife through increasing the connectivity of urban habitats."
        },
        {
            "text": "Loss of nature and declining health outcomes are two of the biggest issues facing our society, yet they are inextricably linked. As such we cannot achieve healthy nature and healthy people by working in isolation, we need to work with the health sector to address these challenges together. When we do that, everyone can win."
        },
        {
            "heading": 4,
            "text": "Nature for Health: A Resource Hub for Healthcare Sites"
        },
        {
            "text": "To support the creation of a nature-friendly healthcare estate, Natural England has partnered with the Centre for Sustainable Healthcare to understand how we can improve the provision of guidance and resources for the health sector. "
        },
        {
            "text": "This work has highlighted a need for sector-specific materials that reflect the operational challenges faced by healthcare sites and enable nature-based actions to be embedded across roles and responsibilities, including estates management, sustainability and clinical care. "
        },
        {
            "text": "It has also identified opportunities to build capacity and increase awareness of the vital link between health and nature across the sector."
        },
        {
            "text": "To improve the accessibility of existing resources, Nature for Health - A Resource Hub for Healthcare Sites, has been launched by the Centre for Sustainable Healthcare, signposting to free, practical tools. "
        },
        {
            "text": "Join us on 25 June, 12:00 – 12:45 pm, as we introduce the hub and explore how, together, we can create greener, healthier healthcare settings: https://www.eventbrite.co.uk/e/nature-for-health-a-resource-hub-for-healthcare-sites-tickets"
        },
        {
            "heading": 4,
            "text": "Green Therapy in Bradford District Care NHS Foundation Trust"
        },
        {
            "text": "One place already putting these principles into practice is Bradford, where local partners are demonstrating how nature can be embedded in healthcare settings, to support both people and the environment."
        },
        {
            "text": "As part of the Bradford and South Pennines Nature Recovery Project, an innovative Green Therapy approach has been supported within hospital and community mental health services. "
        },
        {
            "text": "Nature connection has been embedded throughout patient care and staff wellbeing; whether that’s bringing nature indoors through virtual reality, habitat creation on the hospital grounds or connecting people to nature within their communities and even further afield. This approach provides stepping stones, to increase patient’s sense of belonging in nature and recognition that nature recovery should be for everyone’s benefit."
        },
        {
            "text": "Partnerships have played a crucial role in the success of the Green Therapy project. Strong connections have been built across the hospital community, to coordinate approaches for patient care, grounds maintenance, and sustainability. "
        },
        {
            "text": "Additionally, collaboration with local communities, charities, universities, and local authorities has been instrumental in designing new activities and securing funding to embed Green Therapy within service provision for the long-term."
        },
        {
            "text": "Joe Courtney, Green Therapy Project Development Officer, at Bradford District Care NHS Foundation Trust said: "
        },
        {
            "text": "‘This project has clearly demonstrated the therapeutic value of nature-based interventions in supporting mental health."
        },
        {
            "text": "Patients have reported reduced stress levels, improved mood, and a greater sense of wellbeing after spending time in green spaces. The positive outcomes we’ve seen show the importance of access to nature into mental health care. "
        },
        {
            "text": "We now have service users that were involved in some of the projects coming back as volunteers as it has meant that much to them. We’re proud of the success so far and look forward to continuing this work with more patients, while deepening our partnership with Natural England to expand the benefits even further.”"
        }
    ]
}