{
    "url": "https://ipo.blog.gov.uk/2019/06/11/copyright-and-gdpr-for-photographers/",
    "title": "Copyright and UK GDPR for photographers",
    "authors": [
        "Rebecca Trussell"
    ],
    "categories": [
        "Copyright"
    ],
    "pub_date": "2019-06-11T11:43:00+01:00",
    "content": [
        {
            "text": "I’m always amazed at how a moment can be captured so perfectly, displaying every emotion and eternalising them. It could be a wedding photographer, clicking the moment a father first sees his daughter in her wedding dress. Or a nature photographer, catching the ripples behind a swan skimming a lake in the early summer."
        },
        {
            "text": "A photograph not only has meaning to those within the image, or those who it is shared with, but to the person who took it. We know that a lot of time, effort and emotional investment goes into the perfect photograph. That’s why all photographers should understand copyright and how it can help protect their work."
        },
        {
            "heading": 2,
            "text": "What is copyright?"
        },
        {
            "text": "Copyright is a property right which is intended to reward the making of, and investment in, creative works. It protects literary, dramatic, musical and artistic works, sound recordings, films, broadcasts and published editions. Photographs are generally protected by copyright as artistic works."
        },
        {
            "text": "In the UK, copyright automatically comes into being when a qualifying work is created; there is no formal registration. The term of protection for most copyright material is the life of the creator, plus 70 years from the date of their death."
        },
        {
            "heading": 2,
            "text": "How can it help me?"
        },
        {
            "text": "Copyright grants the creator the right to authorise or prohibit copying, distribution to the public, rental/lending, public performance, adaptation, and communication to the public."
        },
        {
            "text": "We know that a portfolio can involve a lot of emotional and intellectual investment, and you, the photographer, have ‘moral rights’ over your creative work."
        },
        {
            "text": "Moral rights include:"
        },
        {
            "text": "You can find out more about moral rights, and the other rights granted by copyright, on our website."
        },
        {
            "heading": 2,
            "text": "Who owns the image?"
        },
        {
            "text": "The person who creates an image will generally be the first owner of the copyright unless there has been some agreement to the contrary. However, there are situations in which this may not be the case. If an image was created as part of your employment, the employer will generally own the copyright. Whether you’re a freelancer or employed by a company full-time, it’s always best to check the Terms & Conditions of your contract first."
        },
        {
            "text": "‘Licensing’ means giving another person/organisation permission to use a work - such as an image - often in return for payment and/or on certain conditions for a specific period. You may allow a person/organisation to license the work on your behalf (e.g. through a collective management organisation or photo library), license the copyright directly, or transfer (‘assign’) the copyright to another person."
        },
        {
            "text": "There are some circumstances where ownership of copyright is transferred automatically without any intervention by the first or new owner. Examples of this include inheritance and insolvency."
        },
        {
            "text": "Find out more about the ownership of copyright works here."
        },
        {
            "heading": 2,
            "text": "What about GDPR?"
        },
        {
            "text": "As a photographer, you probably want to share your work widely with the public to help grow your business and promote your greatest pieces. That’s why, besides from copyright, it is also important to understand UK GDPR."
        },
        {
            "text": "We know that photographs not only have meaning to the photographer, but to the people in the image. And there may be times when a model in a photograph objects to their image being shared. In this scenario, under UK GDPR a photograph is classed as someone’s personal data. "
        },
        {
            "text": "Choose the lawful basis that most closely reflects the relationship with the individual and the purpose of publication:"
        },
        {
            "text": "If you decide consent is the right lawful basis, here is what’s new under UK GDPR..."
        },
        {
            "text": "Valid consent is freely given, with genuine choice and control. It must be targeted to your purpose and easy to understand. There must also be a clear signal from the individual they agree. There are no specific timescales for expiry of consent in GDPR and consent can be withdrawn at any time."
        },
        {
            "text": "To obtain valid consent, make it clear and don’t be confusing. Keep it separate from other T&Cs and include individual consent for separate items. You can obtain consent by including an opt-in box either online or offline, or the individual must say ‘yes’ to a clear oral request for consent."
        },
        {
            "text": "You need to keep evidence of consent including: who, when, what and how. Keep it under regular review, and refresh if your purpose changes."
        },
        {
            "text": "For more information visit the Information Commisioner's Office website."
        },
        {
            "text": "For a real-life example of how a photographer has benefitted from understanding copyright, read our case study with Satureyes Media. Rick Bronks, who heads up the company, discusses how he has developed his strategy and enforces his rights."
        },
        {
            "text": "Content last updated: January 2026"
        }
    ]
}