{
    "url": "https://educationhub.blog.gov.uk/2025/08/why-school-attendance-matters-and-what-were-doing-to-improve-it/",
    "title": "Why school attendance matters, and what we’re doing to improve it ",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Attendance",
        "school absence",
        "Schools"
    ],
    "pub_date": "2025-08-31T00:01:00+01:00",
    "content": [
        {
            "text": "Every day at school counts. The evidence is clear - even a few days of missed school can have a significant impact on a child's education and future prospects. "
        },
        {
            "text": "Since the pandemic, we've seen school absence rates rise. Before COVID-19, the overall absence rate was 4.7%. This jumped to 7.6% in 2021/22 before falling to 7.1% in 2023/24. Indicative figures from the daily data shows a further decrease to 6.9% in 24/25."
        },
        {
            "text": "Even more concerning is the rise in persistent absence  – this means missing more than 10% of school days. The number of children who are persistently absent has nearly doubled since the pandemic, although it is falling, from 21.2% in 2022/23 to 20% in 2023/24. Indicative figures from the daily data shows it further decreased to 18.7% in  24/25. Severe absence – meaning missing more than half of school – has more than doubled from 0.8% to 2%."
        },
        {
            "heading": 3,
            "text": "How attendance affects attainment "
        },
        {
            "text": "Recent research by the Department for Education shows just how closely attendance and attainment are linked. "
        },
        {
            "text": "At primary school, children who attend nearly every day in Year 6 (95–100% attendance) have 30% higher odds of reaching the expected standard in reading, writing and maths compared to similar pupils who attend 90–95% of the time."
        },
        {
            "text": "The link is even stronger at secondary school. Year 11 pupils with near-perfect attendance have almost double the odds of achieving grade 5 in English and Maths GCSE compared to similar pupils attending 90–95% of the time. In other words, missing just 10 extra days is associated with half the odds of achieving these grades."
        },
        {
            "heading": 3,
            "text": "The long-term impact on earnings "
        },
        {
            "text": "Missing school doesn't just affect exam results and a child’s time in education – it can impact future earnings too. "
        },
        {
            "text": "Persistently absent pupils in secondary school could earn £10,000 less at age 28 compared to pupils with near-perfect attendance. "
        },
        {
            "text": "For each additional day of absence between Years 7 to 11, the typical pupil could miss out on an average of £750 in future lifetime earnings. "
        },
        {
            "heading": 3,
            "text": "Free breakfast clubs "
        },
        {
            "text": "We're introducing free breakfast clubs in every primary school across England. These 30-minute sessions before school ensure children start the day well-nourished and ready to learn. They also improve behaviour, attendance and attainment while helping parents with childcare, saving working families up to £450 a year. "
        },
        {
            "heading": 3,
            "text": "The RISE programme "
        },
        {
            "text": "We've launched the Regional Improvement for Standards and Excellence teams (RISE) programme to help spread best practice and excellence across the whole school system.  "
        },
        {
            "text": "This is done in two ways: there is a targeted service, focused on stuck schools and a universal offer which aims to support all schools to continuously improve and to achieve high standards. "
        },
        {
            "text": "RISE teams are focusing on 4 key areas: inclusion, attainment with a focus on English and Maths; reception quality, and attendance.  This is on top of support offered to schools and families through the government’s attendance hubs and attendance mentoring programme which are already supporting thousands of children to attend school regularly.  "
        },
        {
            "heading": 3,
            "text": "What can you do? "
        },
        {
            "text": "As a parent or carer, you have an important role in making school attendance a priority. Only keep your child off school when they are genuinely too ill to attend. Book medical appointments and holidays outside of school time whenever possible. And talk to your child's school if you're having difficulties with attendance. "
        },
        {
            "text": "However, it’s important to recognise that children with long-term medical conditions, serious mental health challenges, or special educational needs and disabilities (SEND) may encounter additional obstacles. For those experiencing complex barriers to attendance, schools should engage in compassionate discussions with both children and their families, collaborating to provide tailored support that meets their specific needs. "
        }
    ]
}