{
    "url": "https://dragonsden.blog.gov.uk/2025/01/23/dragons-den-ip-blog-series-22-episode-3/",
    "title": "Dragons' Den IP Blog - Series 22 Episode 3",
    "authors": [
        "Jenny Manders"
    ],
    "categories": [
        "Business",
        "International",
        "IP",
        "IP Attaché network",
        "Patents"
    ],
    "pub_date": "2025-01-23T21:00:00+00:00",
    "content": [
        {
            "text": "A viewer can be taken on a roller coaster ride of reactions when tuning in to the adrenalin in the Den, but I don’t think even the Dragons were prepared for the emotional rush when they heard the first of this week’s entrepreneur stories. It was both humbling and inspirational."
        },
        {
            "heading": 3,
            "text": "“Made in Ukraine with love and bravery”"
        },
        {
            "text": "Ukrainian Yana Smaglo arrived in Leeds two years ago, finding help through the UK’s refugee hosting programme. Like thousands of her fellow Ukrainians she had left at a moment’s notice, carrying with her a backpack, her laptop and some cash savings."
        },
        {
            "text": "Back in Ukraine, Yana had achieved a Masters in Finance and had been selling her own fashion brand through retail partners. Once safe in her new UK home, she wanted to do something to help her fellow Ukrainians. Using her experience and her savings, she started a reseller company distributing fashion items designed and manufactured in Ukraine. She called it Nenya, which translates as 'Motherland'."
        },
        {
            "text": "Today, Yana’s turnover has reached £100k, and she now needs help to scale up her business. She asked the Dragons for £80k in exchange for a 10% share of her company. Her goal, she said, was to be the biggest distribution company with the best Ukrainian products and services, all \"made in Ukraine with love and bravery\". Her pitch left the Dragons visibly moved. I was too. "
        },
        {
            "text": "The Dragons set to work questioning Yana about her business model. We heard that she has so far built up nearly a hundred wholesale partners across three continents and has forged relationships with two department stores in the UK and the USA. She has set up an exclusive license with all her brand partners to sell their products outside Ukraine. But, she explained, her refugee status makes it hard for her to get a loan to expand."
        },
        {
            "text": "Yana received praise from all the Dragons for her courage and drive, receiving offers from Deborah Meaden, Sara Davies and Steven Bartlett of exactly what she had asked for to help her develop her reseller brand. Touker offered too, while Peter Jones expressed his delight at this result. He explained that he didn’t feel that the business was unique but admitted if no one else had made an offer then his heart would have led him to!  The thankful Yana accepted a joint offer from Deborah and Steven for all of the money for a 5% share each in the 10% equity."
        },
        {
            "heading": 3,
            "text": "A long wait for the bathroom"
        },
        {
            "text": "Paul Hernon’s space-saving Vertebrae bathroom has been a long time coming. When Paul entered the Den to ‘plug’ his product, he was looking for £100k for a 10% stake in his business. It was twenty three years ago that he first came up with the undoubtedly sleek design – bathroom components including basin, toilet, storage and shower that swivel out from one central backbone. His search for perfection has meant years of prototypes and refining. Touker Suleyman was quick to put the compact convenience through its paces!"
        },
        {
            "text": "\n\nMy antennae went up when Peter Jones asked if the IP in Paul’s product was protected. Paul admitted that he had indeed patented his invention some years ago but the patent had ceased due to being more than twenty years old. This means that Paul no longer has exclusive rights and others may be able to make his invention without his permission. \n\nRenewing patents\nUK patents need to be renewed regularly to keep the patent in force, and this can be done for up to a maximum of twenty years. If a patent is allowed to lapse before this, there is a grace period during which an inventor could apply to restore their patent, but it is a sobering thought that they could lose exclusive rights to their own ideas if they forget to renew.\nFind out about renewing and restoring patents through the following link: Renew a patent - GOV.UK\n\nThe Dragons agreed that Paul’s Vertebrae bathroom was a great-looking product that would do well in an upmarket setting. While none felt able to invest, Paul’s pitch wasn’t completely down the pan: co-living investor Touker offered to introduce Paul to people who may be able to help him develop his product further and bring it to market.\nDid you know?\nIf you enjoyed reading this Dragons' Den IPO Blog, you can subscribe to get future updates sent straight to your inbox! Sign up (link): Subscribe - Dragons' Den: the Intellectual Property blog \nDisclaimer:\nThe purpose of the IPO's Dragons' Den IP blog is to help identify the IP in entrepreneurs’ pitches and highlight how IP works, or could work, in the real-life examples featured. IPO’s authorship of this blog does not constitute its endorsement or sponsorship of any products, individuals or businesses referenced within it.\n"
        }
    ]
}