{
    "url": "https://stratcommand.blog.gov.uk/2025/01/23/focus-on-jhub/",
    "title": "Focus On: jHub",
    "authors": [
        "bobsendall"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2025-01-23T17:14:55+00:00",
    "content": [
        {
            "text": "Established in 2017, jHub is Strategic Command’s central innovation hub, dedicated to accelerating the adoption of new technology within Defence. By providing frontline users with cutting-edge technology and processes, jHub delivers battle-winning capabilities in the shortest possible time."
        },
        {
            "text": "jHub achieves this by adapting and combining the latest commercially available technology for Defence needs. By focusing on mature solutions and dual-use technologies, jHub acts as a broker, connecting world-class technology providers and talent with Defence users."
        },
        {
            "text": "jHub works with users to analyse specific problems, identify potential solutions, fund pilot projects, and iterate and adapt solutions rapidly. Throughout, their collaboration with industry and academia is essential."
        },
        {
            "text": "Recent successes include Project EFFINGO, which involves creating replicas of enemy one way attack (OWA) drones - providing an accurate representation of enemy drones across multiple parameters to aid in the effective prosecution of targets. Notoriously difficult to track and intercept due to their small size and quiet operation, one-way attack drones pose a threat to our forces around the world. By rapidly replicating enemy drones, our forces can better prepare to defend against this threat."
        },
        {
            "text": "Similarly, Project SPIELBERG demonstrates jHub's innovative approach to military training. The project provides realistic battle effects simulation technology which is now being used by the Army, RAF, Ministry of Defence Police and training regiments. By removing the need for live or blank rounds while maintaining realistic training conditions, SPIELBERG makes training safer and more accessible. This project shows jHub's ability to deliver practical solutions that enhance UK defence capabilities."
        },
        {
            "text": "Another notable example is Project ROSETTA, which takes an innovative approach to accelerate modern foreign language training. The project creates an immersive environment where participants learn through a 9-day intensive programme, being fully immersed in the target language and culture. This creative solution demonstrates jHub's commitment to innovate beyond technology, and across all aspects of Defence."
        },
        {
            "text": "The jHub team is a small group of innovation project managers from a range of background, including military, civil service, and industry. They work with users across Defence, and are trusted with finding and fielding new technology, as well as running projects with the goal of securing funding for the most successful pilots. Based in London, they often work with small and medium businesses, including those who haven’t traditionally worked with Defence."
        },
        {
            "text": "The UK’s strength and technological edge are built on our partnerships across government, with academia, industry, and our international partners. jHub embodies this collaborative approach, delivering tangible benefits to users across Defence. "
        },
        {
            "text": "If you are interested in learning more about jHub, please reach out to the team: UKStratCom-jHubXIndustry@mod.gov.uk"
        }
    ]
}