{
    "url": "https://naturalengland.blog.gov.uk/2025/01/23/partnership-sees-experimental-disco-scallop-method-develop-into-full-scale-commercial-low-impact-fishery/",
    "title": "Partnership sees experimental 'Disco Scallop' method develop into full-scale, commercial low-impact fishery",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Marine environment"
    ],
    "pub_date": "2025-01-23T11:18:03+00:00",
    "content": [
        {
            "text": "By Mark Duffy, Marine Principal Adviser, Natural England"
        },
        {
            "text": "Over the past three years Natural England has supported and invested in the “Potting for Scallops” initiative to help sustainable fishing of the mollusc and protect seabeds."
        },
        {
            "text": "The technique in the initiative is crab pots illuminated with LED lights, which has led to the scallops caught this way being dubbed and trademarked ‘Disco Scallops’."
        },
        {
            "text": "We have funded three separate phases of the work on the initiative, and as a result Natural England is the majority funder for this new fishery."
        },
        {
            "text": "Natural England has been keen to support and facilitate the development of new fisheries where innovation can help reduce pressures on our seas, not least on our seabed which remains some way off from reaching Good Ecological Status. Indeed, ‘Embracing adaptation, innovation and working strategically with partners in seeking solutions that tackle the causes of pressures, rather than the symptoms’ is one of our key marine Nature Recovery Principles."
        },
        {
            "text": "The ‘Disco Scallop’ technique is heralded as a breakthrough in providing a commercially viable alternative method to catching scallops that does significantly less damage to our seabed. This started out as a scientific experiment led by Fishtek Marine and operated by the Cornish fisherman Jon Ashworth. Together they uncovered the potential for illuminated crab pots to attract scallops. After two years of fine-tuning the gear and technique, with support from a combination of partners including Natural England, this experimental fishery has led to the inception of a fully commercial fishery currently operated by more than 40 vessels across the UK."
        },
        {
            "text": "The produce, Disco Scallops, is a high quality, low-impact product that can command a premium price for the fisher with the target market being high-end restaurants. In parallel to the development of the fishery Fishtek Marine has helped facilitate the establishment of a marketing co-operative to help fishers get a fair price for their premium product. This will be essential otherwise there will be limited incentive for existing fishers to fish with this particular gear."
        },
        {
            "text": "It is early days, but Natural England welcomes this transition, be it for potters to augment their crab and lobster catches with scallop or for existing scallopers (dive caught or dredgers) to try their hand at this. The Marine Management Organisation is watching how the fishery unfolds to see if special regulations need to be put in place. As it will be an additional pressure on the existing scallop stock it is imperative that the new King Scallop Fisheries Management Plan incorporates this mode of fishing into its long-term vision for more sustainable scallop fisheries. Natural England looks forward to further partnership working with Fishtek in all aspects of sustainable fishing."
        },
        {
            "text": "For more information on the study, see the paper, Scallop potting with lights: A novel, low impact method for catching European king scallop (Pecten maximus)."
        }
    ]
}