{
    "url": "https://mhclgdigital.blog.gov.uk/2024/09/09/adaptive-funding-8-ways-to-make-funding-effective-in-solving-complex-problems/",
    "title": "Adaptive funding: 8 ways to make funding effective in solving complex problems",
    "authors": [
        "Reuben Kenton-Harris, Policy Design Lead"
    ],
    "categories": [
        "Funding Service",
        "Policy design"
    ],
    "pub_date": "2024-09-09T11:40:07+01:00",
    "content": [
        {
            "heading": 2,
            "text": "Complex problems "
        },
        {
            "text": "Most of the problems that today’s governments are trying to address are complex. If they had a simple answer, they probably would have been solved by now.  "
        },
        {
            "text": "By ‘complex’, I mean that various factors interact in unpredictable ways to produce unpredictable outcomes, and we can therefore only understand why things happen in retrospect. As per Dave Snowden’s Cynefin framework, complex problems differ from ‘complicated’ problems, which also involve a wide range of factors, but once these are analysed, we can make reliable predictions and have confidence in our solutions. In Donald Rumsfeld’s words, complicated problems deal with “known unknowns”, whereas complex problems operate in the realm of “unknown unknowns”. "
        },
        {
            "text": "As government programmes continue to tackle many complex challenges, there is an opportunity to evolve our delivery approaches to ensure they are optimally structured to deal with complexity. "
        },
        {
            "heading": 2,
            "text": "Complexity and the Agile mindset "
        },
        {
            "text": "The more traditional ‘waterfall’ approach to project management, which puts more emphasis on sticking to long-term project plans with clearly defined boundaries and pre-planned timelines, can be an ideal way to manage complicated projects, because with the right expertise and analysis, you can clearly define the problem and build a solution that you are confident will solve it.  "
        },
        {
            "text": "But when you are dealing with complexity, this comparatively rigid approach often results in delays, overspend and solutions that you ultimately discover are not fit for purpose. That’s where ‘Agile’ comes in. "
        },
        {
            "text": "In 2001, 17 software engineers met at a ski resort in Utah to discuss their approaches to software development. That meeting ultimately resulted in the publication of the ‘Manifesto for Agile Software Development’, which set out some of the values and principles they had adopted to deal with the complex problem of building software that meets user needs.  "
        },
        {
            "text": "The Manifesto set out 4 core values: "
        },
        {
            "heading": 2,
            "text": "Agile and policy development "
        },
        {
            "text": "Since the publication of the Agile Manifesto, this approach has been successfully applied in various other sectors, including government services. In 2009, Henry David Venema and John Drexhage made a case for public policies which embrace the Agile mindset in Creating Adaptive Policies: "
        },
        {
            "text": "This sentiment has been echoed in a recent paper, The Radical How, which advocates powerfully for an approach to delivering government programmes “that deliberately and specifically acknowledges complexity and uncertainty, and mitigates for both”. "
        },
        {
            "heading": 2,
            "text": "Adaptive funding "
        },
        {
            "text": "One of the big ‘levers’ government has at its disposal is funding. Whether we are dealing with climate change, housing or healthcare, we can only go so far without fronting up some cash.  "
        },
        {
            "text": "But funding programmes tend to be delivered according to the waterfall approach to project management. With the upcoming Spending Review offering an opportunity to reset how government funding is delivered, the time is ripe for a shift towards a more adaptive approach. "
        },
        {
            "text": "The Ministry of Housing, Communities and Local Government (MHCLG), has already started to design funds to account for complexity and uncertainty. But, as far as I can tell, this has happened because different teams could see that the rigid approach previously in place may not be working, rather than because they were consciously trying to create Agile funding programmes. "
        },
        {
            "text": "Adaptive funding is about building flexibility and adaptability into the design and delivery of funding programmes, to account for the complex and uncertain nature of the problems the funding is trying to solve. Embracing the adaptive policy framework can help policymakers develop a coherent approach to programme design, which should help the government make progress against the complex missions it has set itself. "
        },
        {
            "heading": 2,
            "text": "8 ways to design and deliver adaptive funding "
        },
        {
            "text": "Based loosely on Darren Swanson et al.’s 7 guidelines for crafting adaptive policies, and inspired by policy developments I have seen during my time within MHCLG, I have come up with 8 ways to design and deliver adaptive funding: "
        },
        {
            "heading": 3,
            "text": "1. Decentralise decision-making over funding and promote policy variation.  "
        },
        {
            "text": "The idea that central government knows best is rarely true, and usually leads to crude ‘one-size-fits-all’ policies. Different local manifestations of an issue add additional layers of complexity which make already complex problems even more difficult to solve. Local leaders often have a more detailed understanding of the problems in their areas than those in central government. Giving devolved institutions and local authorities greater flexibility to deliver funding according to local priorities and opportunities and allowing different places to come up with different solutions has the potential to increase the chance of success across many policy domains. "
        },
        {
            "heading": 3,
            "text": "2. Test risky assumptions and unknowns with users.  "
        },
        {
            "text": "Designing funding programmes based on assumptions that have not been tested with users can lead to huge costs if they turn out to be wrong. To set a programme up for success, policy teams should engage with users (for example, funding recipients or delivery organisations) to test their riskiest assumptions before funding is delivered. This will allow funding teams to refine the design of the programme before huge costs have been incurred.   "
        },
        {
            "heading": 3,
            "text": "3. Deliver short, small-scale pilot funds or experiments to test specific hypotheses.  "
        },
        {
            "text": "Even if we test assumptions with users before launching a programme, in a complex environment there is always an element of uncertainty about how successful the programme will be. To reduce risk as much as possible, why not start small and scale up as you gain more confidence in each hypothesis? The authors of The Radical How are right, however, in cautioning against simply running lots of pilots. One problem is that pilots often test a whole policy solution rather than a specific hypothesis, which doesn’t always give you the nuanced understanding you need. To rectify this, pilots or experiments should be explicitly designed to test the specific hypotheses upon which the success of the programme depends. It’s also critical that, instead of waiting for a pilot to end before evaluating its success, we seek to learn throughout the pilot. "
        },
        {
            "heading": 3,
            "text": "4. Prioritise continuous learning alongside longer-term evaluations.  "
        },
        {
            "text": "Although HM Treasury recommends that government interventions should be evaluated during the intervention as well as after, most funding programmes tend to prioritise the latter. While these evaluations often provide invaluable insights, they usually come to light too late to influence the design of the programme. Conducting user testing will enable teams to iterate based on real-time feedback and correct any design features based on faulty assumptions. Departments should also monitor and evaluate the success of different local initiatives, to identify which solutions are working well, and which are not. By doing this, government can highlight, champion and encourage examples of good practice. "
        },
        {
            "heading": 3,
            "text": "5. Iterate during the course of the programme based on user feedback.  "
        },
        {
            "text": "Once a funding team identifies that an assumption is incorrect, or an element of the policy is not working, it’s important that the team is able to make iterations. This will not be possible in all cases (particularly if the fund has already been designed according to a waterfall approach), but where such changes do not cause significant disruption, in-flight course corrections can help to steer the programme in the right direction. For example, if a fund has multiple ‘bidding rounds’, amending the guidance between rounds may help to improve the quality or quantity of future applications. "
        },
        {
            "heading": 3,
            "text": "6. Do not expect funding recipients to set out detailed project plans at the start of a programme.  "
        },
        {
            "text": "As it is often difficult (or impossible) to predict what the best solution to a complex problem is, where possible, we should avoid requiring funding recipients to set out highly detailed plans from the outset. This does, of course, involve some risk, as a department would have limited assurance at the outset that the recipient will deliver what it wants (or at least what the department thinks it wants). But there is also significant risk in tying an organisation down to an overly specified plan which has not been tested. This approach might not be appropriate for all organisation types, but local and devolved authorities should be given the space to develop their plans as more becomes known. "
        },
        {
            "heading": 3,
            "text": "7. Give funding recipients flexibility to make changes to their plans.  "
        },
        {
            "text": "Linked to the above, government should give local leaders flexibility to make swift changes once it becomes clear that the original plan is no longer fit for purpose. For example, if private sector match funding ceases to be available, a project will need to be re-scoped. Providing trusted funding recipients with more autonomy to adapt their projects and programmes will enable them to respond nimbly to the risks and opportunities of a dynamic and ever-changing world. "
        },
        {
            "heading": 3,
            "text": "8. Simplify funding by adopting a ‘systems thinking’ approach.  "
        },
        {
            "text": "The difficulty of tackling a complex problem is often compounded by a complex system of government interventions. Taking a step back and adopting a ‘systems thinking’ approach can help to identify where government has made things unnecessarily difficult for external partners to navigate. Streamlining and simplifying the funding landscape can help to maximise impact by reducing duplicative and unnecessary administrative costs. Even if we cannot make the problem less complex, we can at least try to avoid compounding this complexity with byzantine ‘solutions’. "
        },
        {
            "heading": 2,
            "text": "Considerations and trade-offs "
        },
        {
            "text": "If this adaptive approach is to be given the best chance of success, there are some foundations which should first be in place: "
        },
        {
            "text": "As with any policy approach, there will be trade-offs. For instance, an adaptive approach to funding policy may not provide delivery partners with the certainty they understandably crave. But by giving grant recipients flexibility in delivery, in-flight changes should not create so many issues, particularly if those changes respond to user feedback and are tested before roll-out.  "
        },
        {
            "text": "You might also argue that this approach will lead to more unequal outcomes across the country. It is true that giving places more flexibility will inevitably lead to some areas doing better than others. But if recipients are also encouraged to start small, test their hypotheses, and remain vigilant to approaches that are being tested elsewhere, more places should start to move in a positive direction. By embracing an adaptive approach to funding, we have a chance to reset how we work with public, private and third sector organisations, and give ourselves the best chance of achieving our missions. "
        }
    ]
}