{
    "url": "https://marinedevelopments.blog.gov.uk/2024/09/09/can-we-really-build-a-windfarm-in-two-years/",
    "title": "Can we really build a windfarm in two years?",
    "authors": [
        "Paul Gilliland, MMO Head of Marine Planning"
    ],
    "categories": [
        "marine planning"
    ],
    "pub_date": "2024-09-09T14:40:50+01:00",
    "content": [
        {
            "text": "The MMO’s Strategic Renewables Unit (SRU) was established in 2021 to enhance MMO’s role in renewables deployment by supporting improvements to renewables rollout beyond individual cases."
        },
        {
            "text": "Recently, the assertion has been made that if it wasn’t for delays with consenting and grid connection, an offshore wind farm (OWF) could be built in two years. To support making the most effective interventions, it is essential that the ‘problem’ is properly defined. The facts about perceived delays in the planning/consenting stage of OWF deployment need to be set in the context of the time taken for all stages, how those have changed over time, and therefore where there is most potential for reducing delay."
        },
        {
            "text": "The SRU have reviewed available information, including from Renewable UK and the Crown Estate, on the time taken for different stages in deployment, from strategic planning to generating energy. The analysis reveals that:"
        },
        {
            "text": "The two stages with most potential for accelerating deployment or changing the approach are pre-application and pre-construction, although measures to do so could be applied during other stages."
        },
        {
            "heading": 4,
            "text": "Pre-application"
        },
        {
            "text": "It is during the pre-application stage that sites are assessed for their impact, both environmental and social. The bullet points below provide examples of where the process can and is being improved:"
        },
        {
            "text": "To facilitate appropriate OWF development, the MMO contributes to strategic planning including through our role as the marine planning body in England, support to the Defra-led x-government Marine Spatial Prioritisation Programme, and input to the Strategic Spatial Energy Plan."
        },
        {
            "heading": 4,
            "text": "Pre-construction"
        },
        {
            "text": "In England there are 14.72GW of offshore wind currently in pre-construction, that is the same as the current installed capacity of the UK. Accelerating this stage would have significant impacts on our ability to achieve our 2030 targets. The bullet points below set out some areas of improvement that are currently being implemented or investigated."
        },
        {
            "text": "To realise the potential of offshore wind and ensure all are brought into the process, it would help to move beyond the language of ‘barriers’, which can be divisive and come from one perspective and instead emphasise enablers and delivering for multiple interests."
        },
        {
            "text": "SRU’s analysis shows that it is the period either side of consenting that could be accelerated to improve the rollout of offshore wind in the coming years. Several programmes are underway to deliver these improvements and the SRU are heavily involved in many on behalf of the MMO."
        }
    ]
}