{
    "url": "https://opss.blog.gov.uk/2024/09/09/from-intern-to-innovator-alliyahs-inspiring-civil-service-journey/",
    "title": "From Intern to Innovator: Alliyah's Inspiring Civil Service Journey",
    "authors": [
        "Alliyah Bi"
    ],
    "categories": [
        "Careers at OPSS",
        "Civil Service Careers",
        "Diversity and Inclusion",
        "General"
    ],
    "pub_date": "2024-09-09T10:45:00+01:00",
    "content": [
        {
            "text": "Alliyah fulfilled her aspiration to work in the public sector when she secured a place on the Summer Diversity Internship Programme (SDIP) (Now known as the Fast Stream Summer Internship Programme (SIP)."
        },
        {
            "text": " Since then, she has advanced quickly, becoming a permanent team member and continually expanding her skills and knowledge in her role. She reflects positively on her journey and values the experiences she has gained with the team. Read her story."
        },
        {
            "text": "In 2022, I graduated with a BSc in Business and Management from Aston University, a journey that significantly influenced my career aspirations and deepened my interest in IT, marketing, and HR. My university experience was dynamic, providing a broad understanding of business principles and allowing me to delve into specific areas like Marketing Communications and Employment Law. As I neared the end of my studies, I was eager to apply this knowledge in a meaningful public sector career, especially after completing a placement year with City Year, an education charity focused on addressing educational inequality in schools."
        },
        {
            "text": "Like many graduates, I was drawn to the Civil Service Fast Stream scheme, known for its rigorous selection process and potential to accelerate careers within the UK Government. The prospect of working in a challenging environment where I could make a tangible impact on public policy was incredibly appealing. With my background in Business and Management, and a strong interest in IT and HR, I felt confident in my skills and motivation to succeed."
        },
        {
            "text": "However, despite my best efforts, I did not make it onto the Fast Stream Programme. This was initially a significant disappointment, as I had set my sights on this goal for some time. Not achieving it made me question my suitability for a career in the Civil Service. Yet, as is often the case, when one door closes, another opens."
        },
        {
            "text": "Shortly after learning that I hadn’t been selected for the Fast Stream, I was offered a place on the Summer Diversity Internship Programme (SDIP). This opportunity came as a surprise but a welcome one. The SDIP is designed to give students and recent graduates from diverse backgrounds the chance to gain valuable experience within the Civil Service. I was thrilled to accept the offer and saw it as a second chance to prove my potential."
        },
        {
            "text": "I joined OPSS, the Internal Engagement team. This was a perfect fit for my interests in IT, marketing, and HR, as it involved communicating key messages and deliverables to engage staff and keep them informed about key developments within OPSS and the wider department."
        },
        {
            "text": "My time in the Internal Engagement team was an incredible experience. As a newcomer to the professional world, I was a bit nervous, but the team were welcoming and supportive. I quickly found my footing and began contributing to various projects. One of my primary duties was assisting in the planning and execution of staff communications, including the weekly All-Staff meeting. This online event provided a summary of news and team updates, with presentations from various speakers. There were countless moments of self-doubt, but rather than giving up, I kept pushing forward. After delivering a successful All-Staff meeting, I realised that I was capable of more than I had imagined. Every new challenge became an opportunity rather than an obstacle."
        },
        {
            "text": "Following my nine weeks with the Internal Engagement team, my contract was extended until the end of the year. I was then assigned to the HR Casework team after expressing my interest in that area. This transition marked a significant shift in my role, from a focus on communications and marketing to a more specialised area of HR. The HR Casework team handles sensitive and complex staffing issues, providing advice and support to managers and staff across OPSS."
        },
        {
            "text": "This new role was both challenging and rewarding. I was involved in handling employee relations cases, advising on HR policies, and ensuring that all HR policies and procedures were followed correctly. The experience enhanced my HR knowledge and equipped me with practical skills that I still apply in my current role as a Workplace Adjustments Lead and Casework Support Officer. I also developed greater confidence in handling challenging situations and making impactful decisions that affect individuals’ careers."
        },
        {
            "text": "As my SDIP placement extension was concluding in 2023, a vacancy in HR Policy and Casework became available. I applied for the position and gained a permanent role within the team. This marked a significant milestone in my career, signifying the start of my journey as a permanent member of OPSS, DBT, and the Civil Service."
        },
        {
            "text": "Looking back on my path from Aston University to landing a permanent position in the Civil Service, I recognise the significant professional and personal growth I’ve experienced. Although my journey didn’t go exactly as planned, it opened doors to opportunities that have shaped my career in unexpected ways, all thanks to the programme and the extensive support from OPSS."
        },
        {
            "text": "The experiences I gained during my SDIP placement helped me develop a variety of skills, including networking, influencing, and boosting my confidence. I had the chance to meet and connect with like-minded individuals, from colleagues in the HR function to other interns and staff across OPSS and the department. I’ve formed friendships that I know will last a lifetime."
        },
        {
            "text": "Alliyah’s journey illustrates how perseverance, a positive mindset, and flexibility in embracing new opportunities can propel progress.  For those starting out in their careers, she advises:"
        },
        {
            "text": "Find out more about the Civil Service Summer Internship Programme"
        },
        {
            "text": "At OPSS, we are dedicated to fostering a diverse workforce, understanding that inclusivity is key to achieving excellence. We offer a variety of roles suitable for individuals at different career stages."
        },
        {
            "text": "See our Current Vacancies"
        }
    ]
}