{
    "url": "https://space.blog.gov.uk/2024/09/09/game-changing-life-support-system-for-mars-missions/",
    "title": "Game-changing life support system for Mars missions",
    "authors": [
        "Michael Maughan"
    ],
    "categories": [
        "Applications",
        "Space exploration"
    ],
    "pub_date": "2024-09-09T16:11:45+01:00",
    "content": [
        {
            "heading": 2,
            "text": "Paving the way for sustainable space exploration"
        },
        {
            "text": "As humanity looks beyond Earth to establish a sustainable presence on the Moon and Mars, the development of efficient and reliable life support systems is crucial."
        },
        {
            "text": "One of the most critical components of these systems is the ability to recycle water, a vital resource for astronauts on long-duration missions."
        },
        {
            "text": "The UK Space Agency-funded project, led by MAC SciTech, has made a significant leap in this area with the successful development of the Carbon dioxide Hydrogen Recovery System (CHRSy)."
        },
        {
            "text": "This innovative hardware is set to transform how we approach closed-loop life support in space."
        },
        {
            "heading": 2,
            "text": "Addressing the challenges of life support in space"
        },
        {
            "text": "In space, water is an invaluable resource essential for drinking, producing breathable air, and cultivating plants for food."
        },
        {
            "text": "Current systems, like the Sabatier reactor on the International Space Station, are limited, recycling only about half of the water used in oxygen production."
        },
        {
            "text": "As we prepare for missions to the Moon, Mars, and beyond, the demand for more efficient and reliable water recycling systems has never been higher."
        },
        {
            "text": "Enter the CHRSy system - a revolutionary technology capable of recycling up to 100% of water in a closed-loop life support system. This leap in efficiency minimises the need for resupply missions and reduces reliance on water resources on Mars that are challenging to access, ultimately ensuring the sustainability of long-term space exploration."
        },
        {
            "heading": 2,
            "text": "Innovative solutions for a critical problem"
        },
        {
            "text": "The CHSRy system offers a catalyst-free approach to converting carbon dioxide and hydrogen into carbon monoxide and water. Without a catalyst, it is easier to service, maintain, and operate than existing technologies."
        },
        {
            "text": "Additionally, the system is also suitable for processing carbon dioxide directly from the Mars’ atmosphere, further enhancing its versatility and potential applications in future Mars missions."
        },
        {
            "text": "Unlike the NASA’s MOXIE ISRU system, which operates at high temperatures and has a limited lifespan due to its reliance on rare Earth catalysts and exotic materials, the CHSRy system is designed to be low-weight, low-energy, and long-lasting."
        },
        {
            "text": "This project, developed and tested by MAC SciTech Limited, is a testament to the innovative spirit driving the UK’s space sector."
        },
        {
            "heading": 2,
            "text": "Achievements and impact"
        },
        {
            "text": "The CHRSy system offers a more efficient and sustainable solution for water recycling in space, and sets a new standard for future life support systems."
        },
        {
            "text": "The project has allowed a >90% reduction in size and weight of the CHRSy reactor as well as reducing energy use and enabling successful testing and validation of this technology marking a critical milestone, increasing the system's Technology Readiness Level (TRL) and bringing it closer to deployment in real-world space missions."
        },
        {
            "heading": 2,
            "text": "Broader implications and future applications"
        },
        {
            "text": "Beyond its primary application in space exploration, the CHRSy system has the potential to benefit Earth-based industries as well."
        },
        {
            "text": "Instead of harvesting the carbon dioxide from the air astronauts exhale or other sources in space, it can be taken from the output of a plethora of terrestrial industries, such as fermentation, farming, and energy generation. MAC SciTech is currently taking advantage of its low-energy, catalyst-free design in new approaches to storage of energy as liquid fuels made from carbon dioxide."
        },
        {
            "text": "Additionally, the system's ability to operate efficiently in harsh environments could lead to innovations in other sectors, such as chemical manufacturing and defence."
        },
        {
            "heading": 2,
            "text": "Looking ahead: A bright future for UK space technology"
        },
        {
            "text": "The successful development of the CHRSy system underscores the UK's growing leadership in space technology and its commitment to supporting sustainable space exploration. As we continue to push the boundaries of what is possible, innovations like CHRSy will play a crucial role in ensuring that future missions are both feasible and sustainable."
        },
        {
            "text": "The UK Space Agency's investment in this project highlights the importance of developing cutting-edge technologies that contribute to the global space community and strengthen the UK's position in the space sector."
        }
    ]
}