{
    "url": "https://charitycommission.blog.gov.uk/2024/09/09/improving-our-trustee-guidance-on-making-decisions/",
    "title": "Improving our trustee guidance on making decisions",
    "authors": [
        "Sam Jackson, Assistant Director of Policy"
    ],
    "categories": [
        "Guidance"
    ],
    "pub_date": "2024-09-09T08:41:05+01:00",
    "content": [
        {
            "text": "The Charity Commission first published its guidance on trustee decision-making 11 years ago. Trustees have always been required to make decisions in a way that complies with their legal duties – for example, the duty to further the charity’s purposes and act in its best interests. But the guidance (which we refer to in shorthand as CC27) pulled together 7 principles developed by the courts when they reviewed decisions made by charity trustees.  "
        },
        {
            "text": "These principles serve as the backbone of our decision-making guidance. By sticking to these principles, trustees can make better decisions and comply with the law.  "
        },
        {
            "text": "We decided this year to review and improve CC27, but these 7 principles, and what they mean, remain unchanged and stand at the centre of our refreshed guidance. It is critical for trustees to understand them properly. So as a reminder, when making decisions, trustees must: "
        },
        {
            "text": " Why do we review our guidance? "
        },
        {
            "text": "The Charity Commission provides comprehensive guidance on a broad range of topics. Unfortunately, we are starting from a point where not enough trustees – our primary audience – use our guidance when undertaking their leadership roles.  "
        },
        {
            "text": "Our 2024 research indicates that 26% of trustees used Commission guidance more often than other sources; most trustees asked a colleague or another trustee. This is despite the research showing that those who do consider our guidance have a more accurate understanding of their responsibilities and how to go about them."
        },
        {
            "text": "The 2024 research also showed that most trustees know what they should always do when making decisions, but they are less sure about certain aspects of decision-making, such as basing decisions on personal views. Almost 60% considered that trustees should never ask awkward questions.  "
        },
        {
            "text": "When we have researched why some trustees do not access our support, we heard that the length and style of our older guidance can put some people off. So, on starting a programme of improving our guidance, our objectives were clear. We want trustees to be able to read and understand our guidance, and to put our guidance into practice. We want to help trustees improve their knowledge and in turn the governance of their charities. We want to support trustees to get it right.  "
        },
        {
            "text": "To achieve these objectives, our improvement programme focuses on how we write (using plain English) and how we structure the information to make the guidance accessible and easier to read. This is particularly important now that many of us read information online, on phones or tablets, which is a different experience to reading printed material.  "
        },
        {
            "text": "A refreshed CC27 "
        },
        {
            "text": "So that’s what we have done with our refresh of CC27. Today, we publish a new, improved version of our trustee decision-making guidance.  "
        },
        {
            "text": "The legal requirements and expectations remain the same. The guidance covers the 7 principles listed above, and advice on other areas where we have seen some charities fall short, particularly:  "
        },
        {
            "text": "CC27 is now more concise which means it should take around 12 minutes to read (compared with 24 minutes for the previous version).  "
        },
        {
            "text": "The 7 principles originated from trustee decisions being challenged through the courts. We are clear that by using the principles and the guidance, trustees can: "
        },
        {
            "text": "We know from responses we have already received - such as to our guidance about charity meetings published this summer - that the improvements we are making to guidance are resonating with our audience. If you are a trustee and you have not consulted CC27 recently, even if you are an experienced trustee, I urge you to take those 12 minutes to read the revised version. Making decisions is an experience that unites all trustees, whatever size your charity or sector you work in. It is critical to your charity, its governance and people.  "
        }
    ]
}