{
    "url": "https://ruralpayments.blog.gov.uk/2024/09/09/inside-the-rpa-gareth-jones/",
    "title": "Inside the RPA: Gareth Jones",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Inside the RPA"
    ],
    "pub_date": "2024-09-09T13:06:59+01:00",
    "content": [
        {
            "text": "In a series from the Rural Payments Agency’s customer team, we’re featuring video interviews and blogs from some of the key people whose roles are focussed on delivering and improving the services provided to customers. In the third video and blog of the series, our Head of Customer Experience Gareth Jones talks about his role and the importance of customer service within RPA."
        },
        {
            "text": "Hi, I’m Gareth and I’m the Head of Customer Experience at RPA – my role is as much about organisational change as it is about improving individual customer interactions. At RPA we’re looking to become more customer-focussed in the way we offer and administrate the products and services we deliver. My role is to act as a catalyst in instilling a customer experience ethos across RPA that eventually becomes embedded into everything we do."
        },
        {
            "text": "I joined RPA in April this year, and it's fair to say that no two days have been the same. My immediate focus is on getting some solid customer experience foundation stones in place. These include understanding in more detail who our customers are and how they interact with us, as well as mapping the core journeys customers go through and identifying improvement opportunities. I have also started to look at our overall customer strategy and review how we communicate with our customers - from written letters to handy ‘how to’ YouTube content – as well as working out how we measure our performance from the customers' perspective."
        },
        {
            "text": "Moving forward, the role will evolve. I see it becoming much more about listening to the voice of our customers, representing those voices in decision-making and ensuring our solutions deliver in a way that’s easy to understand, cuts through bureaucracy and has a positive impact on our customers. The ultimate goal is to embed a customer culture within RPA’s DNA."
        },
        {
            "text": "Before this role I was head of customer experience at the Driver and Vehicle Standards Agency, but most of my career has been spent working in customer experience functions within the Financial Services industry. I live on the Monmouthshire/Gloucestershire border and have children at secondary school. I was brought up in rural communities where my father was an agricultural manager for one of the big high street banks."
        },
        {
            "text": "Outside work I enjoy being an active member of the roundtable family, getting involved in community activities and charitable fundraising. I also enjoy being outdoors and have completed the Three Peaks Challenge and have walked the length of Hadrian’s Wall in the past. I’m currently slowly working my way through climbing the top 100 highest peaks in Wales."
        },
        {
            "text": "We’ll be publishing more blogs soon in this series to introduce you to the people that lead on key customer areas – Emily Edwards, Head of Customer Insight, Kath Illidge, Head of Customer Engagement and Support and Alison Chapman, National Customer Operation Lead - so keep an eye out for those and read more about how they work together to support those who use our services. "
        },
        {
            "text": "You can watch the first two videos and blogs in this series – a video interview with Customer Director Marie Hardeman and her thoughts on customer service here, as well as a video with Marie, Gareth and Emily here."
        }
    ]
}