{
    "url": "https://hmlandregistry.blog.gov.uk/2024/02/08/i-want-to-ask-for-guidance-but-what-is-a-complex-case/",
    "title": "I want to ask for guidance, but what is a complex case? ",
    "authors": [
        "Mike Harrison, Senior Caseworker"
    ],
    "categories": [
        "Law and practice"
    ],
    "pub_date": "2024-02-08T10:04:33+00:00",
    "content": [
        {
            "text": "Last year, we launched the Specialist Services Hub, which brought our five specialist services together in one place, including Ask for Guidance. "
        },
        {
            "text": "Roughly 65% of complex cases receive requisitions. This is because some points are hard to anticipate in advance and we are keen to work directly with customers to ensure everything is in place before we receive the application. "
        },
        {
            "text": "This service provides expert guidance on complex cases, help to navigate through the registry processes and support in avoiding unnecessary errors before lodging an application.  "
        },
        {
            "text": "But customers often ask: what constitutes a ‘complex case’? In this series, we look at real examples of thorny issues that our experts have resolved, from lifting a 100-year-old caution against dealings, to enquiries under the Settled Land Act 1925 and Mission and Pastoral Measure 2011, and this one, about removing a historic, paid-up charge. "
        },
        {
            "heading": 2,
            "text": "The case of the missing lender "
        },
        {
            "heading": 3,
            "text": "Historic charge "
        },
        {
            "text": "The Ask for Guidance team was contacted by a solicitor whose client had a query about a charge on the register of a property he had recently inherited.  "
        },
        {
            "text": "The client wanted to sell the property but was thwarted by a registered charge in the name of a private individual, who could not be traced to provide the necessary discharge evidence. He had reason to believe no loan money was ever received, but there was no paperwork in regard to the charge.  "
        },
        {
            "text": "The solicitor’s enquiries had revealed the lender no longer resided at the address in the register, so they couldn’t be traced that way. The solicitor contacted us looking for the best way to proceed.  "
        },
        {
            "heading": 3,
            "text": "Company connection "
        },
        {
            "text": "We told the solicitor we had reviewed historical versions of the register to try to locate any previous addresses for, or information about, the lender. In doing so, we had inspected the transfer to the current registered proprietor. This showed the absent lender was a signatory to the transfer in his capacity as director of the transferor, a company from the British Virgin Islands (BVI).  "
        },
        {
            "text": "The historic register revealed an additional “care of” address for the BVI company so, in our response, we suggested the director might be contactable there. We also pointed out that, alternatively, the BVI company register might reveal the company’s contact details; and at the very least it might indicate whether or not the company was still active. It was likely the director of the BVI company (being the private individual holding the charge) could be found that way. "
        },
        {
            "heading": 3,
            "text": "Rule 114(4) "
        },
        {
            "text": "If the matter couldn’t be resolved by locating the individual lender, there was another option to be considered. We could accept evidence under Rule 114(4) Land Registration Rules 2003:  "
        },
        {
            "text": "Evidence varies according to circumstance, but as an example, the information might comprise a Statutory Declaration or Statement of Truth by the borrower, supplemented by documentary proof of the sum secured by the charge, together with bank statements showing repayments for the duration of the loan term to final redemption.  "
        },
        {
            "text": "On another occasion, it might constitute a written receipt of the final payment or other documentary evidence of redemption from the lender, such as an endorsed receipt on the charge.  "
        },
        {
            "text": "Essentially, under the Rule, independent documentary evidence must convince the registrar that the loan has been repaid. "
        },
        {
            "heading": 3,
            "text": "A two-way street"
        },
        {
            "text": "The information gathered through the Ask for Guidance service also allows us to update our own guidance.  As a result of this enquiry, practice guide 31 was updated and section 2.6 added to include the advice regarding Rule 114(4) of the Land Registration Rules 2003 given above. Section 2.6 states that: "
        },
        {
            "heading": 2,
            "text": "How to access Ask for Guidance "
        },
        {
            "text": "If you have a complex casework query that: "
        },
        {
            "text": "head to our website for details of how to contact our expert Ask for Guidance team.  "
        },
        {
            "text": "And finally, to obtain historic editions of the register, head to practice guide 11, section 7 for more information. "
        }
    ]
}