{
    "url": "https://defradigital.blog.gov.uk/2024/02/08/meet-the-apprentice-ulrike-hartmann-cadey/",
    "title": "Meet the Apprentice – Ulrike Hartmann-Cadey",
    "authors": [
        "barryshaw"
    ],
    "categories": [
        "Defra digital"
    ],
    "pub_date": "2024-02-08T07:00:28+00:00",
    "content": [
        {
            "text": "In National Apprenticeship Week Ulrike Hartmann-Cadey tells us about her experiences completing her ‘Women in Leadership Level 5 Apprenticeship‘."
        },
        {
            "text": "I started my apprenticeship in March 2022, and my final Endpoint Assessment was December 2023. So, in total, the programme lasted 18 months. My apprenticeship had no impact on my full-time permanent role here in Defra (as Hosting Lead in our Group Infrastructure and Operations Delivery Portfolio); I completed the apprenticeship alongside my existing job."
        },
        {
            "text": "I am originally from Germany and I moved to Bristol in 2005, meaning English isn’t my first language. Working in a Civil Service IT environment as a delivery professional was never part of the plan either – my degree is in East and South East European History – it seems I just fell in with the wrong (IT) crowd and never looked back."
        },
        {
            "text": "As a programme manager I have completed a lot of qualifications that are relevant to my role, such as Managing Successful Programmes, Management of Risk etc. But I found myself at a point where I wanted to do something that would enable me to look beyond the day job, and acquire skills that would be wider."
        },
        {
            "text": "I spotted that a number of apprenticeships were advertised on our intranet, and initially thought that I would be far too old, at age 43, but also not eligible as I hold a master’s degree already. I decided to attend an overview session, just in case, and swiftly discovered that anyone can apply for an apprenticeship, as long as they do not hold a qualification in the same subject already."
        },
        {
            "text": "Next step was to discuss the opportunity with my line manager, and he encouraged me to put an application in."
        },
        {
            "heading": 2,
            "text": "My experience on the apprenticeship programme"
        },
        {
            "text": "The apprenticeship covered three themes: leading self, leading others and leading the business. There were eight, one-day-workshops in total; covering everything from Self-Awareness to Building Relationships, from Leading People to Project Management and Finance. I had to complete assessments for both knowledge and skills in each of the eight topics."
        },
        {
            "text": "The evidence was then submitted to an external assessment provider. The final assessment included a project proposal and presentation, as well as a professional discussion covering the apprenticeship in its entirety."
        },
        {
            "text": "As I didn’t attend school in the UK I did not have evidence of maths and English GCSEs. However, that wasn’t a problem. My German A-levels were accepted for maths, and I had to sit a brief exam to confirm that my English skills were up to scratch."
        },
        {
            "heading": 2,
            "text": "The best (and most difficult) things about my experience"
        },
        {
            "text": "There are two things that stand out. Firstly, my entire cohort consisted of women working across Defra, Animal and Plant Health Agency, and the Environment Agency. I have met some colleagues that I would have otherwise been unlikely to cross paths with. That has been absolutely fantastic."
        },
        {
            "text": "Secondly, the apprenticeship has enabled me to do exactly what I had hoped for; learn some really interesting things and spend some time looking beyond the day job, really thinking about how I engage with colleagues, what drives me, and what I would like to achieve going forward."
        },
        {
            "text": "The hardest part was finding the time! In theory, 20% of my time would have been ringfenced for the apprenticeship. In reality I did a lot of the work on assessments and submissions in my own time. I did block time out for critical bits of work, but in reality there was often something else in my ‘day job’ that needed to be picked up urgently."
        },
        {
            "text": "The key lesson for me throughout was to keep an open mind. I never thought that an apprenticeship would be for me but it turned out that it very much was."
        },
        {
            "text": "If you are thinking of applying to a talent programme such as an apprenticehsip, I’d say to think carefully about your reasons why, and consider the time commitment. Otherwise, keep an open mind, look at the various opportunities on offer, and do discuss those with your line manager before deciding how to proceed."
        },
        {
            "heading": 2,
            "text": "Where do I go from here?"
        },
        {
            "text": "I am still in the same permanent Defra role, as my apprenticeship was not vocational. However, the feedback that I sought and received from colleagues throughout the process was really insightful. It’s made me think that I might want to seek out further leadership opportunities. I have recently applied for the Civil Service Future Leaders Scheme and should hear in February whether I have been accepted onto that."
        }
    ]
}