{
    "url": "https://moderncivilservice.blog.gov.uk/2024/02/08/meet-the-modern-civil-service-sue-bateman/",
    "title": "Meet the Modern Civil Service: Sue Bateman",
    "authors": [
        "Government Reform"
    ],
    "categories": [
        "A Modern Civil Service",
        "Capability",
        "Data science",
        "Government Reform",
        "Innovation",
        "Interview",
        "Professional Networks",
        "Proud Civil Servant"
    ],
    "pub_date": "2024-02-08T11:00:45+00:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "Hello! Welcome to the third interview in the Meet the Modern Civil Service series. The aim of this series is to showcase the people in the civil service who are innovating change, whether that be through being a learning champion, embracing digital and data into their daily working or helping develop new hubs across the UK."
        },
        {
            "text": "Deepa Thomas-Sutcliffe from the Modernisation and Reform Unit spoke with Sue Bateman, Chief Data Officer (Interim) at Central Digital and Data Office (CDDO), about what A Modern Civil Service means to her, as well as how she sees reform in action and how all civil servants will benefit from these positive, digital and data-driven changes."
        },
        {
            "heading": 2,
            "text": "What does A Modern Civil Service mean to you?"
        },
        {
            "text": "For me, it's about having a civil service that's innovative, that's dynamic, and that brings in and develops people so that we can deliver better public services, better research, better analysis, and better policies using all of the tools and data,  that will mean that we're world-class in terms of civil service."
        },
        {
            "heading": 2,
            "text": "Insights from One Big Thing training"
        },
        {
            "text": "In the role that I am currently, as you'd expect, I was really excited about the focus on data during One Big Thing. I think capability for data experts and people who are in policy and operational jobs is so important. It is part of a way of working that we all need to be comfortable with."
        },
        {
            "text": "I suppose a big takeaway for me, having seen all of the activities that happened across the civil service, was just how interested and engaged people are in whatever role they're doing in the civil service, and how they have an understanding of the need to improve capability in data skills. I also got to see the kinds of questions that you get from people who are not in those data expert roles. I think we're progressing in terms of our data literacy."
        },
        {
            "text": "I also learned a few things through the week-long celebration of data that we run now on an annual basis, Data Connect. We also had a mini-series of things that we ran in CDDO for our own team members, which was great. I suppose my big takeaway is just the variety of uses that data is being put to with a combination of different kinds of tooling and technology that wouldn't have been there three or four years ago."
        },
        {
            "text": "One Big Thing has been a great initiative and my hope is for the coming year that people continue to put a focus on that as an important ongoing learning and development activity."
        },
        {
            "heading": 2,
            "text": "Role of data in decision making"
        },
        {
            "text": "The first thing that I always say is: data is an enabler. Thinking about data capability, about how we design systems and services that have data at the heart — those are the means for us to be able to deliver great services to the public and to us as civil servants, and develop data best practice policies in a world that is increasingly complex."
        },
        {
            "text": "We've got some way to go where data is seen as a natural part of designing public services and policies. We need to get to a position where everybody, regardless of their role, sees the use of data as another thing in their toolkit that is going to help them to do their job better. From a CDDO and from a data team perspective, we're doing lots of things to enable that. Whether that be from creating the new legislation that enables data sharing through to helping organisations think about how they make their data more discoverable and usable through to sharing data with others, underpinning all of that capability."
        },
        {
            "heading": 2,
            "text": "Transformation of Civil Service through Digital and Data"
        },
        {
            "text": "Some of the difficulties that we have as a civil service are departments and agencies working on their own to try and solve problems, as it will only get us so far in terms of dealing with the challenges and opportunities that we have. "
        },
        {
            "text": "There are lots of programs and initiatives where you see a recognition that working across those departmental boundaries is really important to thinking about some of those big policy questions in a holistic way. And so if you think of that as being the way that we are looking at a modern civil service, then data and digital becomes absolutely integral and foundational to helping that."
        },
        {
            "text": "I've definitely seen in the last 10 to 15 years that I've been working in digital and data a greater understanding, but more importantly, increasing adoption across organisations of joint working and the importance of data and digital as part of that joint working."
        },
        {
            "heading": 2,
            "text": "Real-life examples of data utilisation"
        },
        {
            "text": "There's an initiative called the Shared Outcomes Fund that the Treasury leads, which is an innovation fund where organisations can jointly bid to try and tackle a problem that they're experiencing. So one great example, but also one where some of the learnings and maybe some of the guidance and blueprints can be replicated elsewhere, is the BOLD (Better Outcomes through Linked Data) Programme. It's a program being led by the Ministry of Justice in partnership with a number of other organisations which looks at how you start to join up information across the system to help with issues around offending and, ultimately, aims to reduce reoffending. "
        },
        {
            "text": "Another quick example that is more in the realms of data sharing and joined up ways of working is the Digital Economy Act. There are some powers that were created a few years ago now with the aim of helping people who were struggling financially and potentially being classed as in fuel poverty. Now the only way that people could previously get assistance for fuel and other kinds of energy support from the government would be to go to the government to get that support."
        },
        {
            "text": "Through the Digital Economy Act, and then through the partners in government and the energy suppliers, there's now an automated regime where the government is now able to offer support to those people directly through targeted support. It’s a great example of different government agencies working together and then working with the energy providers who provide the ultimate service."
        },
        {
            "heading": 2,
            "text": "The Data Marketplace and its potential"
        },
        {
            "text": "If I go back a few years when we were looking at developing national data strategy and then the digital and data roadmap, one of the ongoing issues that we often hear from departments is that we don't know what data there is across government that could be useful. "
        },
        {
            "text": "We recognise that as part of any ecosystem where we want to encourage better data use and better data sharing, there's some basic things that we need to support around discoverability, understanding, usability and, ultimately, more effective reuse of data."
        },
        {
            "text": "So the marketplace for me is that front door where users are going to be able to come through to find out what data there is, how useful it's going to be, then find out how to use it. We need to think about data within government, but also look at building a separate repository around open data, where we make that openly available for reuse."
        },
        {
            "text": "We are thinking very carefully about the support that we offer as a team, but also building the capability in communities to be able to grow the marketplace into a thriving hub and ecosystem where you can also go for kind of knowledge and guidance as well as information about data that might be useful for you."
        },
        {
            "heading": 2,
            "text": "Future Plans for Data Utilisation"
        },
        {
            "text": "There's a lot of interest at the moment in large language models and generative AI, and quite rightly we are recommending that we proceed with caution on some of that, because we're still learning. One of the areas that I'm responsible for is the knowledge, information, and records management policy team, and one long standing issue is the fact that all of us in our day to day jobs are creating more and more new information. "
        },
        {
            "text": "And that's where the advent of some of this new technology to help us order and curate that information more effectively becomes really exciting because for a number of years now, we've thought of it as being one of the more difficult issues for us of tackling this digital heap."
        },
        {
            "text": "As a modern civil service, we dynamically, innovatively, and creatively manage our information and records, and get more out of the information that we've created to help us with our ultimate aims of better policies, decision making, services and outcomes. "
        },
        {
            "text": "In 2024 we want to do a wide range of department assessments, and we want to start doing some supportive benchmarking to help departments understand where they need to invest in their data management functions and across their organisation."
        },
        {
            "text": "We've also got the Civil Service Data Challenge, which is running for its third year. I'm part of that as one of the judges, and it's one of the highlights of my year seeing those ideas developing into real projects. We've already started planning for Data Connect 24 as well, which will be another week-long celebration of everything that people are doing across the civil service and the wider public sector, and all of the great initiatives that are happening in those spaces that we can learn from."
        }
    ]
}