{
    "url": "https://educationhub.blog.gov.uk/2024/02/new-guidance-on-raac-in-education-settings/",
    "title": "What we’re doing to permanently remove RAAC from schools and colleges",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "School building",
        "Schools"
    ],
    "pub_date": "2024-02-08T12:50:03+00:00",
    "content": [
        {
            "text": "This article was first published on 31 August and has been updated to reflect the latest information.    "
        },
        {
            "text": "Nothing is more important than the health and safety of children and staff. This is why we changed our approach to managing a building material found in some school buildings and other education settings, known as Reinforced Autoclaved Aerated Concrete (RAAC)."
        },
        {
            "text": "In August, we published new guidance advising schools and colleges to vacate areas that are known to contain RAAC until suitable mitigations are in place."
        },
        {
            "text": "With thanks to the hard work of education leaders, all schools and colleges with confirmed RAAC are providing full time face-to-face education for all pupils."
        },
        {
            "text": "We are taking action to permanently remove the aerated concrete from all school and college buildings across England.\nThis will be funded through grants or the School Rebuilding Programme. We explain more below."
        },
        {
            "text": "It’s important to remember that only around one percent of schools and colleges in England have confirmed RAAC."
        },
        {
            "heading": 3,
            "text": "What is RAAC?"
        },
        {
            "text": "RAAC is a lightweight, ‘bubbly’ form of concrete commonly used in construction between the 1950s and mid-1990s. It is predominantly found as precast panels in roofs, commonly found in flat roofs, and occasionally in floors and walls."
        },
        {
            "text": "It means it may be found in any school and college building that was either built or modified in this time period."
        },
        {
            "heading": 3,
            "text": "How many schools have confirmed RAAC?"
        },
        {
            "text": "There are over 22,000 schools and colleges in England. 234 education settings have confirmed RAAC."
        },
        {
            "text": "119 of these schools will need one or more buildings rebuilt or refurbished where work to remove RAAC are more extensive and complex."
        },
        {
            "text": "The 110 schools and colleges where work to remove RAAC will be on a smaller scale will have access to grant funding to pay for the work."
        },
        {
            "text": "We’re working with 5 schools and colleges that have alternative arrangements in place to address the removal of RAAC, for example the building will not be part of the school or college estate over the longer term."
        },
        {
            "text": "The list of schools and colleges with confirmed RAAC has been published on Gov.uk alongside information on how we will fund them to remove RAAC permanently."
        },
        {
            "text": "In 2022, we sent a questionnaire to responsible bodies, asking them to provide information to help us understand the use of RAAC across the school estate and make sure the correct support is in place."
        },
        {
            "text": "Responsible bodies have submitted responses to the questionnaire for 100 percent of schools with blocks built in the target era. Any school or college that advised us they suspect they might have RAAC has had a survey to confirm if RAAC is present. Other than the 234 education settings, the surveys found no evidence of RAAC."
        },
        {
            "text": "A small number of schools and colleges are carrying out additional checks for further assurance in some spaces, and we’re supporting responsible bodies to complete them as quickly as possible."
        },
        {
            "heading": 3,
            "text": "How will this be funded?"
        },
        {
            "text": "The government will spend whatever it takes to keep children safe."
        },
        {
            "text": "Schools and colleges where removing RAAC will be on a smaller scale, will be able to access grant funding to help pay for the work."
        },
        {
            "text": "Cases where works to remove RAAC are more extensive or complex will be funded through the School Rebuilding Programme."
        },
        {
            "text": "Over this decade, our School Rebuilding Programme is transforming over 500 schools in the most need of renovation through rebuilding and refurbishing buildings."
        },
        {
            "text": "119 schools with confirmed RAAC are now included in the programme – 13 of which were already included. A further 8 have also been added to address buildings in poor condition following further assessments."
        },
        {
            "text": "The programme prioritises school buildings in the worst condition across England. Most of the schools on the programme were selected for reasons other than RAAC."
        },
        {
            "text": "Where a responsible body has a serious issue with its buildings that cannot be managed independently, the department provides additional advice and support on a case-by-case basis."
        },
        {
            "heading": 3,
            "text": "How are you supporting schools and education settings where RAAC is present?"
        },
        {
            "text": "Every school or college with confirmed RAAC is assigned dedicated support from a team of caseworkers. Project delivery teams are on site to support schools and colleges to implement mitigation plans."
        },
        {
            "text": "They will work with them to put in place a bespoke plan that based on their circumstances."
        },
        {
            "text": "This could include using other on-site buildings, local spaces, building works in the affected area and, in some cases, installing temporary buildings."
        },
        {
            "text": "we’ve supported schools with confirmed RAAC with additional funding for mitigation work that is capital funded where needed, such as propping and temporary accommodation on site."
        },
        {
            "text": "We are now taking action to permanently removing RAAC from schools and colleges with RAAC and will fund schools and colleges to permanently remove RAAC."
        },
        {
            "heading": 3,
            "text": "How are you keeping school buildings safe?"
        },
        {
            "text": "The government compiled one of the largest and most comprehensive surveys of school building conditions in Europe– the first of its kind – to help us understand the condition of the school estate, and target funding to where it is most needed."
        },
        {
            "text": "A new survey is underway to provide updated information on the estate."
        },
        {
            "text": "We have invested over £15 billion since 2015 to keep schools in good working order, including £1.8 billion committed for 2023-24."
        },
        {
            "text": "We are also investing in over 500 projects for new and refurbished school buildings through our School Rebuilding Programme."
        },
        {
            "text": "Where the department is alerted to significant safety issues with a building, that can’t be managed within local resources, we consider additional support on a case-by-case basis."
        },
        {
            "text": "We also regularly conduct systemic studies to identify risks to building safety."
        },
        {
            "text": "You can read more about how we’re keeping school building’s safe on the Education Hub."
        }
    ]
}