{
    "url": "https://socialcare.blog.gov.uk/2024/02/08/the-messenger-review-a-roadmap-for-great-leadership/",
    "title": "The Messenger Review: a roadmap for great leadership",
    "authors": [
        "Deborah Sturdy"
    ],
    "categories": [
        "Leadership",
        "Social care reform",
        "Viewpoint",
        "Workforce"
    ],
    "pub_date": "2024-02-08T15:24:43+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Ambition for excellence"
        },
        {
            "text": "The Messenger Review, published in 2022, set out an ambition to review system wide leadership development. It was an opportunity to help the health and social care system strengthen leadership and management across both sectors in England. It was also a way to help people new to their roles to better understand what is expected of them."
        },
        {
            "heading": 2,
            "text": "Social care is on the case"
        },
        {
            "text": "The commitment to include the whole system is refreshing and needed. Indeed, as recently evidenced by the announcement of a package of adult social care workforce reforms, the care sector is already re-shaping itself in the spirit of these recommendations."
        },
        {
            "text": "These reforms, developed and rolled out in close collaboration with our friends at Skills for Care, Think Local Act Personal and other valued sector partners, include the launch of a new Care Workforce Pathway. This is the first time the various social care roles and career paths have been brought together in a single place for care colleagues, providers and trainers to create and progress through rewarding, long term career plans."
        },
        {
            "text": "Also, in the spirit of Messenger’s recommendations, we have a new, accredited entry level qualification, the Care Certificate. Having this accreditation is so important to foster confidence in care providers, people drawing on services and care colleagues themselves. You cannot underestimate the value this peace of mind generates if everyone knows the right skills, experience and values are being demonstrated."
        },
        {
            "text": "Lastly, £75 million of funding has been released for hundreds of apprenticeships and digital training courses to help more colleagues embrace the latest technology and apply it in care settings."
        },
        {
            "heading": 2,
            "text": "Joined up thinking"
        },
        {
            "text": "These initiatives, each in their own way, mirror or complement similar actions and goals in the NHS. The joint approach has been led by Skills for Care colleagues. Part of this involved creating a comprehensive induction package; a generic resource helping care and NHS colleagues to understand the context, expectation and diversity of the services they provide."
        },
        {
            "text": "In collaboration with NHS colleagues, this resource aims to foster a mutual understanding of how the health and care system works in the best interests of all. Contributions from national organisations and front line providers have been critical in creating meaningful content and making sure it resonates with the needs of the workforce and the people they support."
        },
        {
            "text": "We need to make sure people joining the care sector know and value that they are part of something bigger than their role. So much of what we do is about fostering community spirit and the supportive connections that spring from it. Core induction standards, which speak to this ideal, will be published later this year for all to access."
        },
        {
            "text": "Forging a shared understanding of the health and social care system – and the increasingly diverse population it serves - is vital if we are to develop leaders fit for a different and more positive future."
        },
        {
            "text": "Resourcefulness and creativity must go hand in hand with inclusivity and diversity if we are to solve the societal problems of our age."
        },
        {
            "text": "On these points of inclusivity and diversity, I am so proud of the work with the Florence Nightingale Foundation and their leadership programmes for global majority nurses."
        },
        {
            "text": "Elsewhere, we are working with NHS colleagues to explore how we can create joint learning programmes for aspiring managers to become the leaders our system needs. Learning together, they will grow their skill sets and aspirational leadership in the best interests of their teams, services and the people they support. The Messenger review has shone a helpful light on the exciting road ahead."
        }
    ]
}