{
    "url": "https://marinescience.blog.gov.uk/2025/08/14/spurdog-returns-how-science-and-fishers-are-working-together-to-protect-a-recovering-shark/",
    "title": "Spurdog Returns: How Science and Fishers Are Working Together to Protect a Recovering Shark",
    "authors": [
        "Joanna Murray"
    ],
    "categories": [
        "Fisheries",
        "Science",
        "Vulnerable species"
    ],
    "pub_date": "2025-08-14T14:59:35+01:00",
    "content": [
        {
            "text": "Spurdog (also known as the spiny dogfish, scientific name Squalus acanthias) is a type of small shark found in oceans around the world. It can travel long distances and has been an important species for commercial fishing in the past."
        },
        {
            "text": "However, the number of spurdog in the Northeast Atlantic (the part of the Atlantic Ocean near Europe) dropped significantly in the early 2000’s compared to how many there were in the 1950s and 60s. Because of this sharp decline, governments introduced strict fishing rules to help the population recover."
        },
        {
            "text": "From 2010 to 2022, fishermen were not allowed to catch spurdog on purpose, and the total amount of spurdog that could be legally caught, called the Total Allowable Catch (TAC), was set to zero. The only exception was a small amount that could be kept if the fish were accidentally caught while fishing for other species. This was part of what’s called a Bycatch Avoidance Scheme, which is a program designed to reduce the number of unwanted fish caught by accident (called bycatch)."
        },
        {
            "text": "In 2017, spurdog was officially listed as a prohibited species, which meant it was illegal to keep or land any spurdog, even if caught by accident."
        },
        {
            "text": "But in 2022, the International Council for the Exploration of the Sea (ICES), a group of scientists that gives advice on ocean health and fish stocks, said that spurdog populations had improved enough to allow limited fishing again. So, for 2023 and 2024, a controlled amount of spurdog fishing (a TAC) was allowed, and the species was no longer officially prohibited."
        },
        {
            "text": "Even with this change, a careful, precautionary approach was still needed to protect the population. One key measure was that any spurdog longer than 100cm must still be protected. These larger sharks are usually females that can produce many pups, so protecting them helps the population stay healthy and grow."
        },
        {
            "heading": 2,
            "text": "Cefas research project"
        },
        {
            "text": "In April 2023, the UK government's Department for the Environment, Food and Rural Affairs (Defra), asked scientists at Cefas to carry out a research project on spurdog. The goal was to help manage the spurdog, a species that was fully protected until 2023 but is now allowed to be caught in limited amounts under new commercial fishing rules. Even though fishing is now allowed, the larger spurdog, which are usually females that can produce the most and biggest pups, are still protected and cannot be landed."
        },
        {
            "text": "As part of this project, Cefas is working on several key areas:"
        },
        {
            "text": "Our Spurdog video will explain more."
        },
        {
            "heading": 2,
            "text": "How are we doing this?"
        },
        {
            "text": "Working with the Fishing Industry and Other Stakeholders"
        },
        {
            "text": "We’re speaking with a wide range of people who are involved with or affected by spurdog fishing. This includes local and national organisations like UK fishing groups, scientists, conservation groups such as the Shark Trust, and recreational fishing representatives like the Angling Trust. We want to understand their concerns, expectations, and how they’re responding to the return of commercial spurdog fishing."
        },
        {
            "text": "We’re also holding national project meetings to share progress, discuss the latest research, and make sure everyone involved is on the same page."
        },
        {
            "text": "At the quayside, we’ve been talking directly with skippers to find out if they plan to change how they fish now that spurdog can be caught again. We’ve also asked whether they’d be willing to voluntarily report their catches, including how much spurdog they keep, and how much they discard, whether dead or alive, using the Clean Catch app."
        },
        {
            "text": "By talking to those involved in the onshore industry such as processors and sellers of spurdog, we have been exploring the relationship between current market conditions for spurdog, and the fisheries management measures introduced in April 2023."
        },
        {
            "text": "Tracking What’s Being Caught"
        },
        {
            "text": "We’ve set up a baseline, a picture of what spurdog catches and discards looked like before the fishing rules changed (from 2016 to 2022). Most of that data came from:"
        },
        {
            "text": "These sources give us some of the best available information, and they continue to be essential for understanding how things are changing now that spurdog fishing is allowed again."
        },
        {
            "text": "We’re using:"
        },
        {
            "text": "This helps us see where and when spurdog are being caught, and how that compares to previous years."
        },
        {
            "text": "We’re also collecting information on recreational catches, to understand how important spurdog is to the sector."
        },
        {
            "text": "Looking at What Happens After Spurdog Are Caught and Released"
        },
        {
            "text": "We’ve reviewed previous scientific studies to understand how many spurdog survive after being caught and then released, both right away and over time."
        },
        {
            "text": "We combined this with:"
        },
        {
            "text": "We’re also figuring out what extra information is needed to improve these estimates and make them more reliable."
        },
        {
            "text": "Improving the App and Data Collection"
        },
        {
            "text": "The information that fishers shared during the bycatch avoidance scheme has turned out to be some of the most valuable data we have. It helped us understand spurdog catches during the time when fishing was banned and allowed us to see how fishing patterns changed once new rules came in."
        },
        {
            "text": "This data was also critical for understanding how many spurdog survive after being discarded, especially for different types of fishing methods like gillnetting and trawling."
        },
        {
            "text": "Now, with the Clean Catch app, fishers can continue to submit valuable data. The app makes it easy to record details about:"
        },
        {
            "text": "This data is held by the app developers but can be accessed by Cefas to improve our understanding of how well spurdog survive after being released, especially for the bigger, protected individuals and how the fishery is changing overall."
        },
        {
            "text": "If you are a fisherman and want to submit data on your spurdog catches, watch this video to find out how to download the app and use it:"
        },
        {
            "text": "Spurdog Clean Catch UK app tutorial video"
        }
    ]
}