{
    "url": "https://foresightprojects.blog.gov.uk/2025/08/14/young-people-and-the-future-of-scotland-how-to-get-young-people-involved-in-strategic-foresight/",
    "title": "Young People and the Future of Scotland - How to get young people involved in strategic foresight",
    "authors": [
        "mikeaskew"
    ],
    "categories": [
        "Futures Procurement Framework",
        "Methodologies",
        "Participatory futures",
        "Young people"
    ],
    "pub_date": "2025-08-14T11:48:32+01:00",
    "content": [
        {
            "text": "By Claire Elliott, Scottish Government"
        },
        {
            "text": "Introduction"
        },
        {
            "text": "A bold approach to a futures project, bringing young people into Scotland’s long-term policy thinking, made possible through financial support via GO-Science Futures’ co-funding initiative."
        },
        {
            "text": "Young People and the Future of Scotland was a pilot initiative under the Scottish Government’s Horizon Scanning 2024-25 programme, designed to bring young voices into long-term policy thinking."
        },
        {
            "text": "The project team had been working towards identifying the Future Trends for Scotland in the next 10-to-20 years, drawing on the expertise of more than 180 individuals representing government, public sector, third sector organisations, academia and businesses. Recognising that young people have the longest stake in Scotland’s future - and may experience emerging trends differently - the project team wanted to capture their perspectives."
        },
        {
            "text": "Through GO-Science’s Futures Procurement Framework the team contracted Demos Helsinki to provide futures expertise. Using the Scottish Government Children and Young People’s Participation Framework, Scottish Youth Parliament was contracted as an expert in participatory engagement."
        },
        {
            "text": "In February 2025, a diverse group of young people came together for a day in Edinburgh to explore possible futures for Scotland. The day was co-designed with young people and delivered in partnership with Demos Helsinki and the Scottish Youth Parliament. Co-creation was a core foundation of the methodology, with young people designing tools and methods, leading the project and participating in fun and creative activities, which helped engage participants throughout the day. These included a creative task to design an artefact from the future and an immersive gallery approach to exploring potential future states. The positive feedback received after the event is a testament of the success of the approach. Young people found that engaging in futures thinking was empowering, helped build their confidence and develop skills, with one participant stating: “Our involvement ensures decisions reflect the needs of our generation, making the outcomes from projects like this more forward-thinking and impactful to those it will actually impact.”"
        },
        {
            "text": "The published findings reveal that young people in Scotland perceive the nation’s future challenges – climate change, economic fairness and public service resilience – as deeply interconnected. One of the youth participants suggested: “Stop dealing with climate change at the surface and fix the root causes”, while others argued that fair wealth distribution and strategic investment are essential to funding initiatives that protect the environment and strengthen communities. Moreover, they highlighted the importance of political and digital education in empowering citizens to identify misinformation and build trust in decision-makers, underscoring a growing awareness among Scotland’s youth that systemic change requires collaboration, transparency, and long-term thinking."
        },
        {
            "text": "The project team reflected that collaboration was central to the approach, and that shared values and flexibility were essential to delivering a high-quality engagement in a short timeframe. GO-Science provided helpful support and proportionate oversight throughout the project. The GO-Science’s Futures Procurement Framework and the Scottish Government’s Children and Young People’s Participation Framework were easy to use and complemented each other well."
        },
        {
            "text": "This project has laid the groundwork for embedding youth voices in strategic foresight. The published tools and methods are now available for others to adapt and use in their own engagement work. The Scottish Government hopes to build on this work, exploring further opportunities to engage young people in long-term thinking across different policy areas."
        },
        {
            "text": "Find out more by reading the full report, where you can explore the tools used, and accessing the young person’s guide to the findings."
        },
        {
            "text": "Learn more about how you can procure expert futures support by visiting Futures Procurement Framework - GOV.UK or contacting the GO-Science Futures team. Likewise, contact the Futures team to hear about our co-funding initiatives."
        }
    ]
}