{
    "url": "https://defradigital.blog.gov.uk/2024/04/26/being-assessed-and-assessing-a-tale-of-two-perspectives-part-two/",
    "title": "Being assessed and assessing – a tale of two perspectives: Part two",
    "authors": [
        "David Thomas, Delivery Manager"
    ],
    "categories": [
        "Defra digital",
        "Defra services"
    ],
    "pub_date": "2024-04-26T07:00:22+01:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "David Thomas reflects on his recent work assessing the Defra Forms service, and offers some useful tips for teams preparing for assessment and for colleagues on the other side of the fence."
        },
        {
            "text": "In the first part of this blog my colleague Jenny shared her experiences of having her work to design a new Defra Forms service assessed, along with some reflections on how she will apply the learnings in her future work."
        },
        {
            "heading": 2,
            "text": "Assessing Defra Forms"
        },
        {
            "text": "I have been a lead assessor for a number of years and have been on both sides of assessments. As Jenny mentioned, it can be a really stressful experience. For this reason, one of my priorities when running an assessment is to try and make it as positive an experience as possible."
        },
        {
            "text": "An important function of the Service Standard is to make sure that everything on GOV.UK is of an appropriate standard. However, equally important should be to try and raise the standard of the work we do. If service assessments are a negative experience, then people will try to work round them rather than engage with them."
        },
        {
            "text": "There are several ways of making a positive experience:"
        },
        {
            "heading": 2,
            "text": "Get everyone on the same page as early as possible"
        },
        {
            "text": "One common area where tensions can be raised is if people have differing expectations of what will happen in an assessment. Jenny has mentioned a common pitfall of service teams providing too much information up front."
        },
        {
            "text": "By communicating regularly beforehand, the assessment team made it clear to the Defra Forms team that the initial presentation should just cover context and a demonstration of the service. The presentation was exactly what we were after and completed inside 20 minutes."
        },
        {
            "heading": 2,
            "text": "Remember, an assessment is peer review"
        },
        {
            "text": "Each member of an assessment panel should be an expert in their respective domain. The same will normally be true of the members of the service team being assessed. It is easy to forget this as an assessor, as you are being asked to provide judgement on someone else’s work."
        },
        {
            "text": "The assessment panel talked about this a lot before the assessment, and we reminded ourselves to approach the task in the spirit of curiosity, rather than judgement. By doing this both the panel and the service team worked together, meaning that it felt like we all agreed with our conclusions at the end of the assessment."
        },
        {
            "heading": 2,
            "text": "Keep talking lots after the assessment"
        },
        {
            "text": "An assessment isn’t an exam like you would take in school. We’re trying to find out as much as possible about how a service team has developed their service. It’s really hard to do this in the four hours that are set aside for an assessment."
        },
        {
            "text": "We spent the days after the assessment asking lots of questions, that we either hadn’t thought about, or hadn’t had time for during the assessment. In some cases, this made it clear that the team had met the service standard, where we previously thought they hadn’t."
        },
        {
            "text": "In other cases, it opened up more areas to explore. Either way, carrying on talking to the service team while we wrote up our report massively increased its quality."
        },
        {
            "heading": 2,
            "text": "Be nice!"
        },
        {
            "text": "We should all care about each other’s welfare at work, but sometimes this seems to get forgotten in assessments. Just remembering that an assessment is a stressful experience for the team being assessed will help change the way you ask questions and improve the experience for everyone."
        },
        {
            "text": "After the assessment Jenny told me that the team felt really positive and buoyant. This is despite the fact it was pretty clear that they would be getting an amber rather than a green. Hopefully this shows that you can be nice and be rigorous at the same time."
        },
        {
            "text": "Jenny and the Defra Forms team plan to provide more updates soon about the project and the service as it evolves. We’d love to hear your feedback from your experiences in this area, so do leave us a comment."
        },
        {
            "text": " "
        }
    ]
}