{
    "url": "https://deframedia.blog.gov.uk/2024/04/26/coverage-about-the-cost-of-new-border-checks/",
    "title": "Coverage about the cost of new border checks",
    "authors": [
        "defrablogs"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2024-04-26T18:26:59+01:00",
    "content": [
        {
            "text": "There has been reporting today that new border checks for EU imports, which will begin on 30 April, could increase food prices."
        },
        {
            "text": "These border checks are fundamental in protecting our farmers and countryside from the threat of plant and animal diseases, such as African Swine Fever, reaching these shores."
        },
        {
            "text": "These figures are based on analysis that we do not recognise. Our own analysis has shown that the new border controls will have minimal impact on food prices, with a 0.2 percentage point inflationary impact over the next three years."
        },
        {
            "text": "Our new risk-based system for border checks has been designed to minimise costs for businesses and consumers – saving traders £520m a year compared to the import model originally proposed following our exit from the EU."
        },
        {
            "text": "A major outbreak of plant or animal disease could be far more costly and have a devastating impact on the economy, our natural environment and on public health."
        },
        {
            "text": "That is why a robust and proportionate border regime is vital to ensure we can protect our food system against biosecurity threats, while allowing the flow of international trade to continue."
        },
        {
            "text": "A Government spokesperson said:"
        },
        {
            "text": "“We are confident in our analysis and our figures which, unlike these figures, have been produced through a rigorous analytical assessment."
        },
        {
            "text": "“These border checks are fundamental to protecting the UK’s food supply chain, farmers and natural environment against costly diseases reaching our shores."
        },
        {
            "text": "“Our robust analysis has shown they will have minimal impact on food prices and consumers, with just a 0.2 percentage point increase on food prices over the next three years."
        },
        {
            "text": "“The cost of checks is negligible compared to the impact of a major disease outbreak, such as Foot and Mouth disease in 2001 which cost businesses and our wider economy more than £12.8 billion in 2022 prices.”"
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}