{
    "url": "https://nda.blog.gov.uk/leading-the-charge-embracing-low-carbon-construction-in-nuclear/",
    "title": "Leading the charge: Embracing low carbon construction in nuclear",
    "authors": [
        "Andy Sharples"
    ],
    "categories": [
        "Innovation/savings",
        "Supply Chain",
        "Sustainability"
    ],
    "pub_date": "2024-04-26T14:21:51+01:00",
    "content": [
        {
            "text": "Eirini Etoimou, our head of corporate sustainability and supply chain development and sourcing, sets out what sustainability means here at Sellafield Ltd."
        },
        {
            "text": "At Sellafield Ltd, our purpose is to create a clean and safe environment for future generations."
        },
        {
            "text": "Sustainability isn’t therefore something we ‘should’ do, it must be integrated in everything we do."
        },
        {
            "text": "For us, this means working with our people, our suppliers, our communities, authorities, industry experts and academia to inspire everyone that forms our business community."
        },
        {
            "text": "We have one of the most complex portfolios of major infrastructure projects in the world, and with that comes the opportunity to integrate sustainability into project delivery from the conceptual phase."
        },
        {
            "text": "We are thrilled to share our commitment to embedding low carbon construction practices within our major infrastructure programme to propel us closer to achieving net zero carbon emissions."
        },
        {
            "heading": 4,
            "text": "Andy Sharples,  our project director, explains what this commitment looks like for major infrastructure delivery."
        },
        {
            "text": "At our site on the edge of the Lake District, our community and environment is at the core of our purpose, so it is important that we walk the walk when it comes to carbon reduction. This is why we are wholeheartedly supporting the Construction Leadership Council’s CO2nstructZero initiative."
        },
        {
            "text": "CO2nstructZero is the construction sector’s response to the UK’s Government plan for a green industrial revolution, which sets out a path to net zero by 2050."
        },
        {
            "text": "It focusses on 5 topics within the infrastructure sector to tackle 80% of carbon emissions associated with construction."
        },
        {
            "text": "As construction clients, we are excited to demonstrate leadership in low carbon construction by setting out our commitments against each of the topics."
        },
        {
            "text": "We're not alone in this, we work with more than 950 suppliers, and have our 20-year Programme and Project Partners (PPP), all ready to embrace low carbon construction methods in our major infrastructure projects."
        },
        {
            "text": "Together, we will not only reduce our environmental footprint, but also demonstrate leadership to the wider industry."
        },
        {
            "text": "Our commitment to finding and driving innovative technologies and sustainable practices will help to significantly reduce carbon emissions throughout the construction lifecycle."
        },
        {
            "text": "This is why we place a heavy focus on empowering our people – we need diverse and inclusive teams, so that we get diversity of thought and new ideas."
        },
        {
            "text": "Furthermore, our support for CO2nstructZero underscores our belief in collective action."
        },
        {
            "text": "We want to encourage others across industry to follow suit. In an era defined by the urgent need for environmental stewardship, it is crucial that every sector contributes to tackling climate change."
        },
        {
            "text": "The construction industry, traditionally associated with significant carbon emissions, has a huge role to play in transitioning towards a more sustainable future."
        },
        {
            "text": "By collaborating with stakeholders across the sector, we aim to accelerate the adoption of low carbon construction practices and drive systemic change. Together, we can redefine industry practices and pave the way for a more sustainable future."
        },
        {
            "text": "All that being said, as a publicly funded subsidiary of government, we recognise that our journey towards net zero carbon is ongoing, it requires continuous improvement and must be balanced with providing value to the UK taxpayer. While our current efforts mark a significant milestone, we understand that there is still much work to be done."
        },
        {
            "text": "In conclusion, our embrace of low carbon construction in major infrastructure projects reflects our unwavering commitment to sustainability and environmental stewardship."
        },
        {
            "text": "By demonstrating leadership in carbon reductions, supporting industry-wide initiatives like CO2nstructZero, and recognising that this journey is ongoing, we affirm our role as leaders in building a greener, more sustainable future for future generations to come."
        },
        {
            "text": "Together, let us continue to strive towards a world where net zero carbon is not just a goal, but a reality."
        },
        {
            "text": "For major infrastructure delivery at Sellafield Ltd our ambition is to embed low carbon construction ahead of the UK’s net-zero target in 2050 by working with the market to embed low carbon materials and technologies:"
        },
        {
            "text": " "
        }
    ]
}