{
    "url": "https://ruralpayments.blog.gov.uk/2024/04/26/shropshire-petals-on-applying-for-grants/",
    "title": "Shropshire Petals on applying for grants",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Grants"
    ],
    "pub_date": "2024-04-26T16:49:27+01:00",
    "content": [
        {
            "text": "RPA offers a wide range of grants rural payments to farmers and businesses. In this blog, RPA talks to farmer Jim Bubb, on how the Improving Farm Productivity grant has made his business more efficient with the addition of droid robots."
        },
        {
            "text": "J M Bubb and Son is a fourth-generation arable farming business growing potatoes, oilseed rape and wheat across 420 hectares. As part of the business, Shropshire Petals grows a wide range of sustainable petal confetti for weddings and dried flowers for home décor and gifts. The flowers are grown during the summer months and picked by hand, then dried on the Shropshire farm, from which they’re then delivered worldwide."
        },
        {
            "text": "Owner Jim Bubb applied for a Farming Transformation Fund (FTF) grant and was successful in his bid to purchase two farm droid robots to plant flowers and weed around them, with an FTF Grant contribution of £50,538 (40% intervention)."
        },
        {
            "text": "Before the arrival of the droids, the flowers were planted by hand or tractor with many hours spent weeding by hand. The droids now drill and manage 20 hectares of flowers - where they weed and drill the field completely, powered by four large solar panels that provide enough energy to keep the robots working for 18-25 hours, with no need to stop to refuel or charge."
        },
        {
            "text": "Jim said:"
        },
        {
            "text": "The machines have increased the quality of the flowers that Shropshire Petals is growing, and they’ve also seen some improvement in the yield and because of the increased accuracy of weeding, they’ve been able to reduce the use of herbicides. The robots weed the flower fields continually once the planting is complete and therefore weeds will never grow big enough to out-compete the flower plants."
        },
        {
            "text": "He added:"
        },
        {
            "text": "Jim added that Shropshire Petals were also currently looking at other grants as they were considering installing a new processing facility, looking at new products for their flower petals as well as a new, more efficient dispatch area, to ensure they can get the end product to customers at the best price possible."
        },
        {
            "text": " "
        }
    ]
}