{
    "url": "https://ipo.blog.gov.uk/2024/04/26/sustainable-innovation-that-makes-you-go-ooho/",
    "title": "Sustainable innovation that makes you go “Ooho”",
    "authors": [
        "christinawatts"
    ],
    "categories": [
        "Business",
        "Innovation",
        "Patents",
        "Trade marks"
    ],
    "pub_date": "2024-04-26T10:55:21+01:00",
    "content": [
        {
            "text": "The best way to start any trip to the beach is getting there early to find the perfect spot on the sand, away from the seaweed-covered rocks. "
        },
        {
            "text": "One business, Notpla, has embraced the slippery algae, however. Since 2014, its co-founders Pierre Paslier and Rodrigo Garcia Gonzalez have developed a way of making a substance obtained from brown seaweed into a range of sustainable, biodegradable, plastic-free packaging solutions.  "
        },
        {
            "text": "We spoke to Pierre Paslier about how owning intellectual property (IP) has played a vital role in the success of his company. "
        },
        {
            "heading": 3,
            "text": "Where did the Notpla story begin?  "
        },
        {
            "text": "Pierre met Rodrigo when they were studying Innovation Design Engineering at Imperial College London and the Royal College of Art.  "
        },
        {
            "text": "“We ‘spun’ out of Imperial College” Pierre told us. Now based in Hackney Wick, London, Notpla describe themselves as being ‘on a mission’ to make plastic packaging - and society’s reliance on single-use plastic - disappear.  "
        },
        {
            "text": "The brand name ‘Notpla’ is an abbreviation of ‘not plastic’. “We have trade marks for our name and brands”, Pierre told us. "
        },
        {
            "heading": 3,
            "text": "The first Notpla Patent "
        },
        {
            "text": "We asked Pierre about where their work with seaweed began. "
        },
        {
            "text": "The patent that Notpla had granted for this edible bubble was given the brand name of ‘Ooho’, which was assigned a trade mark in 2017.  "
        },
        {
            "text": "Two years later, Ooho capsules were used in the 2019 London Marathon when Notpla partnered with Lucozade. It wasn’t just the marathon runners who benefited that day - in a great win for the environment, an incredible 36,000 Ooho’s were used in place of single-use plastic cups and bottles. "
        },
        {
            "heading": 3,
            "text": " So where did the Notpla team go from there? "
        },
        {
            "text": "Notpla went on to partner with Just Eat Takeaway.com to replace the plastics and chemicals that line the food boxes that were traditionally used by the takeaway industry.  "
        },
        {
            "heading": 3,
            "text": "IP and partnership working "
        },
        {
            "text": "We asked Pierre if IP rights are helpful when working with technology partners. "
        },
        {
            "heading": 4,
            "text": "Notpla awards and accolades"
        },
        {
            "heading": 3,
            "text": "Has IP played a part in Notpla attracting funding from investors? "
        },
        {
            "text": "Notpla secured their first venture capital funding in 2018 from Sky Ocean Ventures. "
        },
        {
            "heading": 3,
            "text": "So what does the future hold for Notpla and its IP? "
        }
    ]
}