{
    "url": "https://food.blog.gov.uk/2024/04/26/world-vets-day-2024-veterinarians-are-essential-health-workers/",
    "title": "World Vets Day 2024: Veterinarians are essential health workers",
    "authors": [
        "Jane Clark, Director of Veterinary Services"
    ],
    "categories": [
        "Our mission"
    ],
    "pub_date": "2024-04-26T14:55:25+01:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "As the global veterinary community celebrates World Veterinary Day 2024 tomorrow, Jane Clark, Director of Veterinary Services for the Food Standards Agency, shares her thoughts on the vital role of Veterinarians in public health and the opportunities and challenges facing the profession."
        },
        {
            "text": "We all know about the incredible work veterinarians carry out every day to protect and improve the health and welfare of animals. However, it’s often easy to miss the vitally important role they also play in protecting the health of humans too. From pet owners to farmers and all those who consume foods of animal-origin, vets are a vital line of defence between us and the diseases that affect animals and people and productivity of livestock. It’s estimated that around 60% of current human infectious diseases are zoonotic, and that 75% of emerging diseases such as Ebola or influenza have an animal origin."
        },
        {
            "text": "And did you know that on 19 February 2001, when the devastating foot and mouth outbreak hit the UK, the first case of the disease was detected by an Official Veterinarian (OV) at an abattoir in Essex?"
        },
        {
            "text": "So, I’d like to talk to you about our OVs and Meat Hygiene Inspectors (MHIs), who work across England and Wales’s 270 abattoirs and 1000 cutting plants. They play an incredibly important role in ensuring the welfare of animals and safety of the meat produced at these plants. They not only help to uphold the UK’s high standards of animal health and welfare, they also protect public health and the reputation of our domestic and international meat industry, upon which thousands of jobs and livelihoods depend."
        },
        {
            "text": "Since the COVID-19 pandemic, we have been reminded again of the devastation that can be caused by new and emerging infections and how essential surveillance and horizon scanning is, as well as assuring that foods of animal origin entering the market are safe to eat. A ‘One Health’ approach recognises that human health is closely linked to animal health, welfare and our shared environment. One Health is not a new phenomenon, but in recent years it has increasingly been used to describe the work vets carry out with our fellow health professionals. I am also a keen advocate of approaching our role through the lenses of One Welfare and One Planet too – recognising the important interdependencies we need to hold in the balance to build a healthy and sustainable future."
        },
        {
            "heading": 2,
            "text": "Vet shortages"
        },
        {
            "text": "There is a global shortage of vets, and it's one that's felt acutely in the OV profession. Anyone who is part of the veterinary community will know that we are part of a profession facing increasing pressures, emerging risks and new challenges from caring for our pets, through working in a range of roles protecting livestock health and welfare, food safety and international trade. Ultimately , we're struggling to recruit the vets we need to carry out this essential work."
        },
        {
            "text": "We are continually working to review and strengthen the current system. Readers may well be aware of the recent EFRA committee on how to tackle vet shortages where FSA Chief Executive, Emily Miles, raised these concerns. We are also building on our experiences to deliver a range of ways to recruit OVs such as the 'Vet Track' programme which allows veterinarians from overseas to carry out MHI duties for up to two years while completing the English language qualifications required for Royal College of Veterinary Surgeons (RCVS) registration."
        },
        {
            "text": "While we are working hard to encourage UK graduates to consider these roles, the UK relies on Veterinarians from overseas to work as OVs in our abattoirs and our current OV workforce has almost entirely been recruited from overseas."
        },
        {
            "text": "Our OVs and MHIs provide an essential service to public health and the £9.1bn domestic meat industry here in the UK. Their work also assures our animal welfare standards, which we know is a consistently important issue for society, with the FSA’s latest Consumer Insights Tracker (March 2024) showing a high proportion (68%) reporting animal welfare as a top concern about food. Our OVs and MHIs are protecting around 90% of UK population so that they can eat safe meat and the global reputation of our £2.1bn meat export market."
        },
        {
            "text": "In an ever-evolving agri-food system, it is essential we continue to strengthen our defence against emerging diseases and threats to animal and human health. We will continue to work across the profession to future-proof the essential work of veterinarians in the UK, supporting the vital role they play in protecting both human and animal health."
        },
        {
            "text": "On this World Veterinary Day, I want to thank everyone working tirelessly in our One Health profession and, of course, to express my particular thanks to the hundreds of OVs and MHIs working within our food system to uphold animal health, welfare and the health of consumer across the UK and beyond."
        },
        {
            "heading": 1,
            "text": "Diwrnod Milfeddygon y Byd 2024: Mae milfeddygon yn weithwyr iechyd hanfodol"
        },
        {
            "text": "Wrth i’r gymuned filfeddygol fyd-eang ddathlu Diwrnod Milfeddygon y Byd 2024 yfory, mae Jane Clark, Cyfarwyddwr Gwasanaethau Milfeddygol yr Asiantaeth Safonau Bwyd, yn trafod rôl hanfodol milfeddygon ym maes iechyd y cyhoedd a’r cyfleoedd a’r heriau sy’n wynebu’r proffesiwn."
        },
        {
            "text": "Rydym ni i gyd yn ymwybodol o’r gwaith anhygoel y mae milfeddygon yn ei wneud bob dydd i ddiogelu a gwella iechyd a lles anifeiliaid. Fodd bynnag, nid ydym yn aml yn ystyried y rôl hanfodol bwysig y maent hefyd yn ei chwarae wrth ddiogelu iechyd pobl. O berchnogion anifeiliaid anwes i ffermwyr a phawb sy’n bwyta bwydydd sy’n dod o anifeiliaid, mae milfeddygon yn gwneud gwaith hanfodol i’n diogelu ni rhag clefydau sy’n effeithio ar anifeiliaid a phobl a chynhyrchiant da byw. Amcangyfrifir bod tua 60% o’r clefydau heintus presennol ymysg pobl yn filheintiol, a bod 75% o’r clefydau sy’n dod i’r amlwg fel Ebola neu’r ffliw yn tarddu o anifeiliaid."
        },
        {
            "text": "Oeddech chi’n gwybod, ar 19 Chwefror 2001, pan darodd clwy’r traed a’r genau y DU, mai Milfeddyg Swyddogol mewn lladd-dy yn Essex wnaeth ganfod achos cyntaf y clefyd."
        },
        {
            "text": "Felly, dyma dynnu eich sylw at ein Milfeddygon Swyddogol a’n Harolygwyr Hylendid Cig, sy’n gweithio ar draws 270 o ladd-dai a 1000 o ffatrïoedd torri cig yng Nghymru a Lloegr. Maent yn chwarae rhan hynod bwysig wrth sicrhau lles anifeiliaid a diogelwch y cig a gynhyrchir yn y ffatrïoedd hyn. Yn wir, maent yn helpu i gynnal safonau uchel y DU o ran iechyd a lles anifeiliaid ,ond maent hefyd yn diogelu iechyd y cyhoedd ac enw da ein diwydiant cig domestig a rhyngwladol, y mae miloedd o swyddi a bywoliaethau yn dibynnu arno."
        },
        {
            "text": "Roedd y pandemig COVID-19 wedi ein hatgoffa o’r dinistr y gall heintiau newydd a rhai sy’n dod i’r amlwg eu hachosi, a pha mor hanfodol yw gwaith gwyliadwriaeth a sganio’r gorwel, yn ogystal â sicrhau bod bwydydd sy’n dod o anifeiliaid sy’n dod i mewn i’r farchnad yn ddiogel i’w bwyta. Mae dull ‘Un Iechyd’ yn cydnabod bod cysylltiad agos rhwng iechyd pobl ac iechyd a lles anifeiliaid a’r amgylchedd a rennir. Nid yw ‘Un Iechyd’ yn syniad newydd, ond yn ystod y blynyddoedd diwethaf fe’i defnyddiwyd fwyfwy i ddisgrifio’r gwaith y mae milfeddygon yn ei wneud gyda’n cyd-weithwyr iechyd proffesiynol. Rwyf hefyd yn credu’n gryf dros fynd i’r afael â’n rôl drwy lensys Un Lles ac Un Blaned hefyd – gan gydnabod pwysigrwydd cynnal rhyngddibyniaethau er mwyn adeiladu dyfodol iach a chynaliadwy."
        },
        {
            "heading": 2,
            "text": "Prinder milfeddygon"
        },
        {
            "text": "Mae prinder byd-eang o filfeddygon, sy’n effeithio’n benodol ar y proffesiwn milfeddygon swyddogol. Bydd unrhyw un sy’n rhan o’r gymuned filfeddygol yn gwybod bod y proffesiwn yn wynebu pwysau cynyddol, risgiau sy’n dod i’r amlwg a heriau newydd, o ofalu am ein hanifeiliaid anwes, i weithio mewn amrywiaeth o rolau sy’n diogelu iechyd a lles da byw, diogelwch bwyd a masnach ryngwladol. Yn y pen draw, rydym yn cael trafferth recriwtio’r milfeddygon sydd eu hangen arnom i wneud y gwaith hanfodol hwn."
        },
        {
            "text": "Rydym yn gweithio’n barhaus i adolygu a chryfhau’r system bresennol. Mae’n bosib y byddwch eisoes yn ymwybodol o bwyllgor diweddar EFRA ar sut i fynd i’r afael â phrinder milfeddygon lle cododd Prif Weithredwr yr ASB, Emily Miles, y pryderon hyn. Rydym hefyd yn adeiladu ar ein profiadau i gyflwyno amrywiaeth o ffyrdd o recriwtio Milfeddygon Swyddogol, fel y rhaglen 'Vet Track' sy'n caniatáu i filfeddygon o dramor gyflawni dyletswyddau Arolygwyr Hylendid Cig am hyd at ddwy flynedd wrth gwblhau cymwysterau Saesneg sy’n ofynnol er mwyn gallu cofrestru gyda Choleg Brenhinol y Milfeddygon."
        },
        {
            "text": "Er ein bod yn gweithio’n galed i annog graddedigion y DU i ystyried y rolau hyn, mae’r DU yn dibynnu ar filfeddygon o dramor i weithio fel Milfeddygon Swyddogol yn ein lladd-dai, ac mae nifer helaeth o’r Milfeddygon Swyddogol sy’n ffurfio ein gweithle ar hyn o bryd yn dod o dramor."
        },
        {
            "text": "Mae ein Milfeddygon Swyddogol a’n Harolygwyr Hylendid Cig yn darparu gwasanaeth hanfodol i iechyd y cyhoedd a’r diwydiant cig domestig gwerth £9.1 biliwn yn y DU. Maent hefyd yn gweithio i sicrhau ein safonau o ran lles anifeiliaid, sy’n fater pwysig i’r gymdeithas, gydag Arolwg Tracio Mewnwelediadau Defnyddwyr diweddaraf yr ASB (Mawrth 2024) yn dangos bod cyfran uchel (68%) yn nodi bod lles anifeiliaid yn un o’r prif bryderon o ran bwyd. Mae ein Milfeddygon Swyddogol a’n Harolygwyr Hylendid Cig yn diogelu tua 90% o boblogaeth y DU fel y gallant fwyta cig diogel, ac maent yn amddiffyn enw da byd-eang ein marchnad allforio cig gwerth £2.1 biliwn."
        },
        {
            "text": "Mewn system bwyd-amaeth sy’n esblygu’n barhaus, mae’n hanfodol ein bod yn parhau i gryfhau ein hamddiffyniad yn erbyn clefydau sy’n dod i’r amlwg a bygythiadau i iechyd anifeiliaid a phobl. Byddwn yn parhau i weithio ar draws y proffesiwn i ddiogelu gwaith hanfodol milfeddygon yn y DU yn y dyfodol, gan gefnogi’r rôl hanfodol y maent yn ei chwarae wrth ddiogelu iechyd pobl ac anifeiliaid."
        },
        {
            "text": "Ar Ddiwrnod Milfeddygol y Byd eleni, hoffwn ddiolch i bawb sy’n gweithio’n ddiflino yn ein proffesiwn ‘Un Iechyd’ ac, wrth gwrs, diolch yn arbennig i’r cannoedd o Filfeddygon Swyddogol ac Arolygwyr Hylendid Cig sy’n gweithio yn ein system fwyd i gynnal iechyd a lles anifeiliaid, ac iechyd defnyddwyr ledled y DU a thu hwnt."
        }
    ]
}