{
    "url": "https://forestrycommission.blog.gov.uk/2022/04/14/behind-the-scenes-at-the-forestry-commission-managing-the-outbreak-of-phytophthora-pluvialis/",
    "title": "‘Behind the Scenes’ at the Forestry Commission: Managing the outbreak of Phytophthora pluvialis",
    "authors": [
        "Jan Strelczenie"
    ],
    "categories": [
        "Tree health"
    ],
    "pub_date": "2022-04-14T13:30:33+01:00",
    "content": [
        {
            "text": "Since the first discovery of Phytophthora pluvialis in the UK last September, the Forestry Commission have been working at pace as part of a collaborative UK wide approach to learn more about this fungus-like tree disease."
        },
        {
            "heading": 2,
            "text": "Collaboration and positive action"
        },
        {
            "text": "Since that first finding, extensive ground and aerial surveillance has been undertaken in which a staggering 1,930 sites have been visited across the UK, with numerous samples being collected and tested.  Demarcated notices have also been introduced around affected areas to help combat its potential spread.  Consultation, planning and action is being undertaken, with all four countries actively participating in the Forestry Commission led Incident Management Team under direction of the Chief Plant Health Officer, ensuring that we have a strong and coordinated UK wide approach via the UK Plant Health Service."
        },
        {
            "text": "Forestry Commission and Forest Research specialist teams have also been providing training for surveyors from Natural Resources Wales, Scottish Forestry and DAERA (Northern Ireland) and vice versa, ensuring the latest intelligence is used to provide a uniform approach to each country’s surveillance.  Findings of P. pluvialis have been made in England, Wales and Scotland (although no findings have been made so far in Northern Ireland)."
        },
        {
            "heading": 2,
            "text": "Surveillance - what we are we looking for"
        },
        {
            "text": "Species in focus are western hemlock and Douglas fir. Although not widely planted in the UK, stands of radiata pine have also been inspected as this is a known host in New Zealand, and vigilance is being maintained for possible symptoms on other species."
        },
        {
            "text": "Aerial surveillance is concentrated on identifying symptoms such as canopy dieback and defoliation. Ground-based surveys focus on partial branch dieback, with associated resinous cankers; and needle cast (where needles have turned brown or fallen off). Where symptoms do occur, they tend to be forest edges along corridors such as roads, rides, and watercourses."
        },
        {
            "text": "Aerial surveillance is undertaken, both from helicopters and using drones. 12 helicopter flights have taken place covering the south-west and south-east of England and in Wales. As well as being able to target specific areas, aerial surveys are also adaptable; for example P. pluvialis aerial surveillance can be conducted simultaneously with that of Ips typographus or Phytophthora ramorum, therefore monitoring overall tree health of an area. Surveillance via drones is providing high resolution panoramic imagery, mapping products for monitoring symptom progression, and contextual site information."
        },
        {
            "text": "In addition, Rainwater and streams are also monitored to complete the surveillance, which increases the understanding of the conditions needed for spore production and spread, and act as an early warning system to identify areas at possible risk."
        },
        {
            "text": "These surveillance techniques help to identify outbreaks of P. pluvialis at the earliest point enabling measures to be put in place that minimise the spread of the disease. Any new findings undergo further intensive investigation to ascertain the extent of infection. This informs decision making on the appropriate restrictions required, such as on timber movement or specifying work to be undertaken under a Statutory Plant Health Notice e.g. tree felling or understorey removal of affected material."
        },
        {
            "text": "Surveillance has identified findings of P. pluvialis at 31 woodland sites across Great Britain since commencing in September last year. The majority of these findings are on western hemlock, and in most cases, affected sites consist of a small number of infected trees forming part of the roadside understorey and in other cases findings are limited to individual young trees with partial branch dieback."
        },
        {
            "text": "Findings in Douglas fir have been fewer and generally made in association with heavier western hemlock infection. However, survey and sampling teams remain vigilant, and work is ongoing to understand the full range of symptoms across a range of species to assess the potential impacts that the disease may have."
        },
        {
            "text": "Intelligence collected through surveillance activities feeds into the essential scientific work undertaken by Forest Research, allowing evidence based decisions to be made and to improve our understanding as to how the disease is acting in the environment across the UK."
        },
        {
            "text": "For more on symptom identification the following video is available Phytophthora pluvialis | symptoms in western hemlock - YouTube"
        },
        {
            "heading": 2,
            "text": "Scientific investigation"
        },
        {
            "text": "A continuous programme of works remains in place with thorough investigations of samples taken from the identified sites. Forest Research have tested over 1,170 samples since the first outbreak. This is a comprehensive study, testing material from stems, branches, foliage (needles), bark, roots, soil/leaf litter, saplings/seed trails, water baits in streams, and rainwater traps capturing aerially transmitted spores. Real-time PCR based methods are used for testing the samples for P. pluvilais ensuring rapid results with high levels of accuracy."
        },
        {
            "text": "Site visits to Wales and Scotland are helping us to understand how the pathogen is behaving in different geographic locations throughout the UK. This sharing of knowledge on the surveying, sampling and the testing helps to provide comparable data. We also have continued collaboration with scientific experts in overseas countries, such as the USA and New Zealand, who have been studying this disease over the past few years. This intelligence has helped Forest Research to improve P. pluvialis diagnostics, information that is shared with partners at Fera Science and SASA (Science and Advice for Scottish Agriculture) thus supporting wider scientific and practitioner understanding of P. pluvialis."
        },
        {
            "text": "In addition, comprehensive research and modelling are being used to determine high risk areas for P. pluvialis based on historic weather data. This includes the analysis of weather variables of daily temperature, daily rainfall and daily relative humidity to estimate where the risk of P. pluvialis establishing or persisting might be greatest."
        },
        {
            "text": "Last month, confirmation was made that P.pluvialis is the primary cause of the symptoms identified and a report was published on the ‘new disease reports’ portal. This report covered the first identification of this pathogen in Europe, as well as being the first published report of P.pluvialis causing resinous cankers on western hemlock. Such reports are shared with peers in other European countries allowing them to consider this pathogen as part of their surveillance strategies for the disease."
        },
        {
            "heading": 2,
            "text": "Controlling the spread"
        },
        {
            "text": "As with any new pest or disease outbreak, our first response is generally aimed at eradication, this prompts the serving of Statutory Plant Health Notices requiring the felling and destruction of infected trees. Teams are mobilised rapidly to prepare a site for harvesting and any critical features of interest are identified. For example, plans for the protection of special habitats, watercourses and archaeological features are agreed and defined. Special maps are created showing the location of each feature with a description of the controls and requirements. On the ground they are marked using paint, signs, and tape, while the harvesting team are fully briefed before any work can commence. Signs inform visitors of the timing and extent of works, and also advise the public not to enter the work site or approach any of the machines for biosecurity and safety reasons. All machines are washed down before leaving a site, while tools, equipment and clothing are treated with disinfectant. Visitors are also asked to undertake good biosecurity practices, such as washing mud from their footwear and pets before leaving a site."
        },
        {
            "text": "Some trees are felled using specialist machines which hold the tree as it is cut down, enabling them to be cut and lowered to the ground in a controlled way. The machine then strips the branches off, cuts the trunks into pre-determined lengths and places these in a way that allows a second machine to collect them and move them to the forest road, accessible to lorries. Other trees may need to be cut by experienced tree fellers, for instance, in protected areas where machines are prohibited."
        },
        {
            "text": "Older, larger trees offer the greatest risk of spreading the disease by releasing the spores high up, where the wind can carry spores across the landscape. The most infectious parts of the trees are the branches and foliage which are removed as the trees are felled. The highly infectious material is burnt within the infected site ensuring material cannot be moved to other areas. The remaining logs are then transported from the felling area to the specially prepared stacking area before being utilised by specially authorised mills which can meet the biosecurity rules required. This makes sure that any infectious parts of the tree are disposed of carefully as the log is processed."
        },
        {
            "text": "Elsewhere in the demarcated areas, inspectors check any sites where landowners plan to fell trees to ensure there are no signs of infection. Even healthy trees can only be felled and moved off site if they are sent to authorised timber mills. This way the risk of spreading the infection through movement is minimised."
        },
        {
            "heading": 2,
            "text": "How can you help?"
        },
        {
            "text": "P.pluvialis has been found in samples of leaf litter taken from sites with positive identification, so it is vital that everyone takes the necessary precautionary biosecurity controls to avoid the risk of spreading this pathogen. We can all do our bit by taking some simple steps to help limit the spread:"
        }
    ]
}