{
    "url": "https://homeofficemedia.blog.gov.uk/2022/04/14/factsheet-linton-asylum-accommodation/",
    "title": "Factsheet: Linton-on-Ouse Asylum Accommodation",
    "authors": [
        "Home Office news team"
    ],
    "categories": [
        "Fact sheet",
        "Leading stories"
    ],
    "pub_date": "2022-04-14T14:14:29+01:00",
    "content": [
        {
            "text": "The unprecedented and unacceptable rise in dangerous small boat crossings continues to put huge pressure on the UK’s broken asylum system."
        },
        {
            "text": "The sharp increase in crossings means about 37,000 destitute migrants are currently being accommodated in hotels – costing the taxpayer, when including those on resettlement schemes in hotels, £4.7 million a day."
        },
        {
            "text": "This severe pressure on the system means claims from genuine asylum seekers are taking too long to process and is taking away from resources to support people through safe and legal routes to the UK."
        },
        {
            "text": "The New Plan for Immigration will fix this broken asylum system, allowing us to support those in genuine need while preventing abuse of the system and deterring illegal entry to the UK."
        },
        {
            "text": "What happens to migrants once they arrive in the UK via small boat?"
        },
        {
            "text": "Asylum reception centres - more cost-effective accommodation for asylum seekers"
        },
        {
            "text": "What is Linton-on-Ouse? "
        },
        {
            "text": "Who will be accommodated in the new asylum reception centre at Linton-on-Ouse? "
        },
        {
            "text": "Why Linton-on-Ouse? "
        },
        {
            "text": "How long will asylum seekers be accommodated at Linton-on-Ouse? "
        },
        {
            "text": "How many asylum seekers will be housed at Linton-on-Ouse? "
        },
        {
            "text": "What about local people living near Linton-on-Ouse? "
        },
        {
            "text": "Are people able to come and go as they please?"
        },
        {
            "text": "Will people who come here through safe routes be accommodated at Linton-on-Ouse?"
        },
        {
            "text": "How much is this going to cost the UK taxpayer? "
        },
        {
            "text": "Is Linton-on-Ouse suitable for accommodating people? "
        },
        {
            "text": "Will vulnerable people be housed at Linton-on-Ouse? "
        },
        {
            "text": "Who is running Linton-on-Ouse?"
        },
        {
            "text": "Has a final decision been made on the asylum reception centre at Linton-on-Ouse? "
        },
        {
            "text": "When will the site at Linton-on-Ouse open?"
        },
        {
            "text": "Updated on 7th June, 2022"
        },
        {
            "text": " "
        }
    ]
}