{
    "url": "https://homeofficemedia.blog.gov.uk/2022/04/14/factsheet-migration-and-economic-development-partnership/",
    "title": "Factsheet: Migration and Economic Development Partnership",
    "authors": [
        "Home Office news team"
    ],
    "categories": [
        "Fact sheet",
        "Leading stories"
    ],
    "pub_date": "2022-04-14T13:56:07+01:00",
    "content": [
        {
            "text": "On Thursday 14 April, the UK and Rwanda announced a new Migration and Economic Development Partnership to redress the imbalance between illegal and legal migration routes."
        },
        {
            "text": "The Partnership will see those travelling to the UK through illegal, dangerous and unnecessary methods considered for relocation to Rwanda, where they will have their asylum claim processed. Those whose claims for protection are rejected will either be offered the chance to stay in Rwanda or return to their home country – they will not return to the UK once their claims have been decided by Rwanda."
        },
        {
            "text": "All needs will be met by Rwanda who will create a safe environment for migrants to start a new life, with education, employment and accommodation."
        },
        {
            "text": "Everyone considered for relocation will be screened and have access to legal advice. Decisions will be taken on a case-by-case basis, and nobody will be removed if it is unsafe or inappropriate for them."
        },
        {
            "text": "The number of people who can be relocated under the agreement is unlimited."
        },
        {
            "text": "People will have all their needs looked after while their asylum claims are being considered in Rwanda. This includes safe and clean accommodation, food, healthcare and amenities. They will have full access to translators and will be able to access legal support in order to appeal decisions in Rwanda’s courts."
        },
        {
            "text": "Those relocated will be given a generous support package, including up to five years of training, accommodation and healthcare."
        },
        {
            "text": "People are free to leave if they wish and they will not be detained. But those in genuine need of international protection will be provided with it in Rwanda."
        },
        {
            "text": "This Partnership builds on our work so far within the New Plan for Immigration to help those in need to resettle in the UK through what are safe and legal ways to come here. We've welcomed over 97,000 BNOs from Hong Kong and 25,000 Syrians and have issued more than 40,000 visas under our Refugee Family Reunion Scheme since 2015. More recently, we have opened the Afghan Citizens Resettlement Scheme (ACRS) which will give up to 20,000 people at risk a new life in the UK and have granted over 50,000 visas for Ukrainians through our Ukrainian Resettlement Schemes."
        },
        {
            "text": "This strategic alliance forms part of a suite of measures under the New Plan for Immigration – the most comprehensive reform in decades, to fix the broken asylum system."
        },
        {
            "text": "What will the strategic Partnership deliver?  "
        },
        {
            "text": "This innovative, ambitious, and long-term agreement sets a new international standard to:"
        },
        {
            "text": "Why are we doing this? "
        },
        {
            "text": "About the Partnership with Rwanda"
        },
        {
            "text": "What does this mean for people arriving to the UK illegally? "
        },
        {
            "text": "How the process works"
        },
        {
            "text": "Our legal and international obligations "
        },
        {
            "text": "Have other countries implemented this before?"
        },
        {
            "text": "Funding "
        }
    ]
}