{
    "url": "https://homeofficemedia.blog.gov.uk/2022/04/14/factsheet-maritime-primacy/",
    "title": "Factsheet: Maritime primacy",
    "authors": [
        "Home Office news team"
    ],
    "categories": [
        "Breaking news",
        "Fact sheet"
    ],
    "pub_date": "2022-04-14T14:04:22+01:00",
    "content": [
        {
            "text": "On 14 April 2022, the Prime Minister officially announced that the Ministry of Defence (MoD) will take operational command of responding to small boat crossings in the English Channel as part of a cross-government effort to tackle illegal migration, which will step up boat detection and help crackdown on criminal ‘pilots’."
        },
        {
            "text": "Alongside this action, which will help to disrupt the business model of people-smuggling gangs, the military, including Royal Navy officers and assets will work side by side in partnership with Border Force officers with a single joint command structure in place."
        },
        {
            "text": "This will happen with immediate effect and will bolster Border Force teams with expert military personnel and provide additional maritime vessels and aerial surveillance, including a Wildcat helicopter. The change will be backed up by £50million in new funding, which over time will deliver new boats and surveillance assets."
        },
        {
            "text": "Migrants who cross the Channel will go through initial checks at Western Jet Foil, Dover before being transferred to a new processing site at Manston, Kent for further checks."
        },
        {
            "text": "Small boat arrivals will be intercepted before or as soon as they land on coast, processed efficiently and, where their claim is deemed inadmissible, they may be removed to a safe third country. For more information, go to the Migration and Economic Development Partnership factsheet."
        },
        {
            "text": "Strengthening collaboration between the Border Force and Defence, this will significantly enhance the ability to detect boats and ensure control of UK borders. One important part of the new approach is increasing Border Force capacity to gather evidence for criminal investigations, ensuring more people-smugglers who trade in these life-threatening journeys can be referred for prosecution and brought to justice. This move forms part of the government’s wider plan to tackle illegal migration through the New Plan for Immigration, ramp up cross-government action to prevent dangerous small boats crossings and ultimately save lives."
        },
        {
            "text": " Why is the MoD taking over primacy in the Channel?"
        },
        {
            "text": "How will this work in practice? "
        },
        {
            "text": "What will Home Office’s involvement be?"
        },
        {
            "text": "Who will lead on gathering / issuing data for small boat crossings?"
        },
        {
            "text": "Will the Home Office still publish quarterly small boat statistics?"
        },
        {
            "text": "Crackdown on criminal ‘pilots’"
        }
    ]
}