{
    "url": "https://vmd.blog.gov.uk/2022/04/14/importing-unauthorised-veterinary-medicines-is-criminal/",
    "title": "Importing unauthorised veterinary medicines is criminal",
    "authors": [
        "Simon Hack"
    ],
    "categories": [
        "Enforcement"
    ],
    "pub_date": "2022-04-14T16:47:22+01:00",
    "content": [
        {
            "text": "Shopping for the best deals online from the comfort of your home or office can make for savvy shoppers – but buyer beware! A farmer received a nine-month prison sentence suspended for 3 years, for doing just that."
        },
        {
            "text": "In a recent incident, Border Force officers carrying out routine checks of products coming in from other countries discovered a large amount of veterinary antibiotics coming from China destined for a farm. A joint taskforce was formed with the police and other enforcement agencies, including the Veterinary Medicines Directorate, to raid and search the farm premises."
        },
        {
            "text": "Further evidence of the illegal importation of veterinary medicines was found resulting in a prosecution before the Courts. The farmer pleaded guilty to various charges including unlawful importation and attempted importation, and received a nine-month prison sentence, suspended for three years."
        },
        {
            "text": "Harsh reality"
        },
        {
            "text": "Harsh? You might think that there is no harm in using a cheaper supplier abroad, but not only could you be committing a criminal offence, you could be buying a sub-UK-standard or counterfeit product.  You should also be aware that illegal veterinary medicines can be linked to serious organised crime, which you may inadvertently be supporting."
        },
        {
            "text": "The regulatory system and controls we have in place are there to protect the animals, the environment, and the food we eat."
        },
        {
            "text": "Requirement for a veterinary medicines marketing authorisation"
        },
        {
            "text": "All veterinary medicines in the UK must have a valid marketing authorisation and only authorised companies can import medicines from outside of the UK. Vets may import unauthorised medicines, but only in exceptional circumstances and with special permission from the VMD using the Special Imports Scheme."
        },
        {
            "text": "Antimicrobial resistance"
        },
        {
            "text": "The offender in this case illegally imported prescripti on antibiotics for use on his farm. Antimicrobial resistance is well documented as one of the most serious threats to health. The emergence and spread of drug-resistant bugs is driven by over-use and inappropriate use of antibiotics in both humans and animals. To reduce the spread of resistance in animals, vets must be consulted before treatment to ensure that antibiotic use is appropriate and responsible."
        },
        {
            "text": "Antimicrobial resistance to veterinary medicines not only affects human and animal health and welfare, it could also severely affect the whole agricultural industry through its potential impact on domestic and international trade."
        },
        {
            "text": "Valuable lesson"
        },
        {
            "text": "There is a valuable lesson to be learned from this cautionary tale of illegal importation. Don’t risk facing a public court case and a criminal record, or jeopardise the health and welfare of your animals, by illegally buying from an unauthorised online seller."
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}