{
    "url": "https://ukhsa.blog.gov.uk/2022/04/14/ukhsas-weekly-surveillance-report-focusing-on-pillar-1-data/",
    "title": "UKHSA’S weekly surveillance report: focusing on ‘Pillar 1’ data",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Coronavirus (COVID-19)",
        "Data blog"
    ],
    "pub_date": "2022-04-14T13:26:31+01:00",
    "content": [
        {
            "text": "Throughout the pandemic UKSHA has published over 100 weekly national flu and COVID-19 surveillance reports."
        },
        {
            "text": "These reports provide an important picture of the pandemic by detailing numbers of confirmed cases, outbreaks, hospitalisations and deaths - where possible broken down by factors including age, gender, region and setting."
        },
        {
            "text": "As we learn to live with COVID-19, and as outlined in the government’s Living with COVID-19 plan, the virus will be now managed much like other respiratory infections, such as flu. This means that we will test, monitor and report on the virus in a way that’s closer to what we do so for other infectious diseases."
        },
        {
            "text": "Changes to how we carry out and support COVID-19 testing mean that ‘Pillar 2’ testing data, which includes community LFD and PCR testing of both symptomatic and asymptomatic cases, will no longer provide the same volume of data; it will therefore not be the key component of our weekly reports, which will be dominated by ‘Pillar 1’ test results from the NHS."
        },
        {
            "text": "Of course, testing remains in place for certain high-risk groups such as patients in NHS hospitals, those eligible for COVID-19 antiviral and other treatments and staff working in the NHS and adult social care."
        },
        {
            "text": "This data has formed the basis of ‘Pillar 1’ testing throughout the pandemic. Focusing on these test results will enable us to continue to monitor and protect those most at risk of hospitalisation, severe disease and potentially death. Pillar 1 data will also continue to support genomic surveillance which helps track the evolution of the virus."
        },
        {
            "text": "However, community testing data will continue to be published alongside this key data and will provide a useful wider context as we monitor the overall impact of COVID-19."
        },
        {
            "text": "The RCGP sentinel swabbing scheme will continue to provide an important indicator for COVID-19 cases and positivity in the community. By sampling over 200 GP practices, the scheme provides a positivity rate which monitors week by week, by age and by region to see if the proportion of people with COVID-19 increases."
        },
        {
            "text": "Real-time syndromic surveillance is used daily by health professionals to look for changing trends which indicate higher levels of illness in the population. This surveillance method collects and analyses anonymised health data from across England – tracking symptoms presented by patients rather than laboratory tests for particular infections."
        },
        {
            "text": "All of our surveillance methodologies are chosen so that data can be measured regularly and consistently over the long term. No single source of data tells the whole story of disease activity, nor can any system provide a definitive figure for exactly how many people could have a disease such as COVID-19."
        },
        {
            "text": "But as we learn to live with COVID-19 our surveillance will continue to provide a strong understanding of COVID-19 activity and give valuable insights to inform public health action and health services."
        }
    ]
}