{
    "url": "https://vets.blog.gov.uk/2022/04/14/veterinary-medicine-directorates-vmd-extramural-studies-ems-placement/",
    "title": "Veterinary Medicines Directorate’s (VMD) Extramural Studies (EMS) Placement",
    "authors": [
        "kenmeger"
    ],
    "categories": [
        "Government Veterinary Services",
        "Jobs and Experiences",
        "Professional development"
    ],
    "pub_date": "2022-04-14T16:21:13+01:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "Hello! My name is Alison Anderson and I am a fourth year veterinary student at the University of Nottingham.  In summer 2021 I was one of six vet students from UK vet schools to be part of the Veterinary Medicines Directorate’s first extra-mural studies (EMS) placement. As a mature student, I had previously worked in regulatory and policy roles in other sectors so I was interested to learn more about this in relation to veterinary medicines."
        },
        {
            "text": "Due to COVID, the two-week placement was run remotely using online technology.  There was a mixture of presentations, workshops, discussions and self-directed research, which provided a great way of learning new things as well as providing opportunities to consolidate and apply this new knowledge."
        },
        {
            "text": "The placement started with an introduction to the VMD and an overview of the work of the different teams. We then walked through the whole process of regulation of veterinary medicines from clinical trials and dossier requirements through to post-authorisation pharmacovigilance.  I found it really useful to understand the whole lifecycle and broad range of factors beyond just the safety and efficacy for the target animal and, for food-producing animals, the consumer.  For instance, I hadn’t previously fully appreciated requirements to consider safety to those administering the medicine, or for demonstrating the suitability of the packaging of the product as well as its contents.  I also heard about how the VMD evaluates any potential impact of a medicine on the environment.  Since the placement I have seen a press release from the VMD providing advice about cascade use of a veterinary medicine, which I suspect happened as a consequence of the pharmacovigilance process.  Having discussed the concept at the placement, seeing this afterwards really reinforced for me the importance of reporting suspected adverse events as this demonstrated that changes happen as a result."
        },
        {
            "text": "Alongside the various presentations, there were workshops in which we reviewed some case studies and debated whether we would approve those medicines and if so, with what conditions.  Each considered a different aspect such as efficacy, safety, palatability or bioequivalence.  I found this really helpful as it enabled me to understand the summary of product characteristics documentation much better and as a result I now find myself critically analysing these in a way that I had not done so before.  It has also made me better appreciate additional things to watch out for - for instance whether a medicine should be stored away from sunlight or given with food."
        },
        {
            "text": "We also explored areas such as prescribing and responsible use of veterinary medicines, antimicrobial and anthelmintic resistance, and we heard about biological products and novel therapies. I was not previously aware of the VMD’s legislation, inspection and enforcement programme, so it was fascinating to also hear about these and understand their potential impact, and to understand why certain regulations and guidelines exist. I particularly enjoyed discussing the prescribing cascade, as this is something that we are taught from a clinician’s point of view, so it was helpful to hear (and feel reassured!) about it from the regulator’s perspective too."
        },
        {
            "text": "As well as the more technical side of the work of the VMD, we discussed careers in the civil service and had a Q&A session with a panel of VMD vets. This was a lively, wide-ranging discussion and was a great opportunity to hear more about various career paths and helped with my own thinking around different future career options.  One of the things that surprised me was discovering the high level of pragmatism and judgement required by VMD staff to best balance risk and benefit in each situation, and the diversity of veterinary roles available both within the VMD and in the civil service beyond."
        },
        {
            "text": "The placement culminated in a ‘journal club’ presentation.   Each student picked a recent journal article and throughout the fortnight developed a presentation on its relevance to the work of the VMD.  The variety of articles chosen by students was fascinating – ranging from pesticides in rivers to 3D printing of medicines.  We each presented our chosen topic to staff from across the VMD followed by a Q&A and discussion.  At the start of the placement I found the thought of this terrifying, but by the end I found this so helpful, as it gave me an opportunity to consolidate the things I had learnt, apply them to a real situation and hear views from the experts on those topics."
        },
        {
            "text": "I thoroughly enjoyed this placement and would recommend it to any vet student. Gaining a deeper appreciation of the lifecycle and rationale of veterinary medicine regulation was really beneficial to me.  My new knowledge and skills from the placement will certainly be helpful in my future career – whether in clinical practice or otherwise, and would like to thank the VMD for being so open and supportive and providing us with such a well-organised and helpful placement."
        },
        {
            "text": " "
        }
    ]
}