{
    "url": "https://defradigital.blog.gov.uk/2022/04/14/what-its-like-to-be-a-lead-content-designer-at-defra/",
    "title": "What it’s like to be a Lead Content Designer at Defra",
    "authors": [
        "Jeni Street"
    ],
    "categories": [
        "Defra content design",
        "Defra digital",
        "Defra services",
        "User centred design"
    ],
    "pub_date": "2022-04-14T12:24:32+01:00",
    "content": [
        {
            "text": "With Defra recruiting Lead Content Designers, Jeni Street shares her experience of becoming Defra's first Lead Content Designer, how she spends her time and what she has learned so far in the role."
        },
        {
            "text": "A picture of Jeni on the top of Cat Bells, a favourite hill in the Lake District."
        },
        {
            "text": "Have you ever looked at a job advert and thought to yourself, ‘what would that role really be like’? That’s exactly what I wondered when I applied for the role of Lead Content Designer. "
        },
        {
            "text": "The truth is, nobody knew yet because it was a new role for Defra. Since I started in June 2021 I’ve been working with our Head of Content to shape the role along the way. "
        },
        {
            "text": "We’re now recruiting for two more Lead Content Designers to join our content community at Defra. Our community has grown in the last 12 months and it’s exciting to be recruiting for these new lead roles to help us support our content designers. "
        },
        {
            "text": "To help candidates wondering what the role would be like, I’m sharing how I’ve found the last nine months and what I’ve learned."
        },
        {
            "heading": 2,
            "text": "Supporting great content designers"
        },
        {
            "text": "A big part of a Lead Content Designer’s job is to support people and help resolve problems."
        },
        {
            "text": "I manage a group of people at the moment. Half are permanent civil servants. I also support the wider community of content designers by answering questions, talking through approaches and resolving problems."
        },
        {
            "text": "I haven’t managed this many people before and at first I felt overwhelmed. Firstly, it was fuel to my impostor syndrome. I was involved with their recruitment and had been dazzled by their CVs, applications, and interviews. How could I lead and direct these amazing people? Secondly, I knew looking after these people, new to Defra, would take time. How could I do it justice and make sure I had all of the answers when they needed it?"
        },
        {
            "text": "Actually, what I learned is that they didn’t expect me to be an omniscient content designer. They just needed someone to be there for them. To feel supported. To be asked how they’re getting on, and given a safe space to say what’s going well and what’s giving them a headache. And I’m there to listen, to coach, to guide and to work out next steps. "
        },
        {
            "text": "I’ve learned that chatting to my team regularly is best. This books up my diary, for sure, but it’s important to create safe opportunities for people to share what’s not going so well so we can find solutions together. These solutions might be to learn more about a particular tool for prototyping, talk to a service manager about ways of working, or talk to stakeholders about why a user-centred design approach is needed."
        },
        {
            "text": "Also, the great thing about managing talented people is you’re secretly learning from them all the time. "
        },
        {
            "heading": 2,
            "text": "Resourcing teams: advanced level Tetris "
        },
        {
            "text": "I’ve often woken at 1am and thought of how we can solve a gap where a content designer is needed on a new project. It reminds me of playing on my brother’s GameBoy Colour and dreaming of all of the blocks falling into the right place."
        },
        {
            "text": "Resourcing teams has been a major part of this role from the off. I work with the other Lead Content Designers to:"
        },
        {
            "text": "Often there aren’t people to move around as they’re all working on important projects. That’s where we’ve needed to recruit and grow our content community. I’ve learned so much about recruitment and it’s been invaluable. "
        },
        {
            "text": "When it comes to resourcing new projects, I’ve learned to make a plan, and have a back up plan. I’ve also learned to keep my cool when things inevitably change – there are lots of factors and they’re not all within our control."
        },
        {
            "heading": 2,
            "text": "Bringing people together"
        },
        {
            "text": "The things I’ve already mentioned can eat up time. But I’ve made sure to protect time for things that will benefit the whole content community. I’ve learned that there will always be people and projects moving around and fires to put out."
        },
        {
            "text": "I found that a few people who were new or newer to working on transactional content and services lacked confidence. I did a short discovery to see if others felt similar and what people needed. Over half of the content community said they would like support, and many others offered help and got involved. "
        },
        {
            "text": "We’re now buddying people up and focusing on individual development. We’re also running sessions to build knowledge and confidence in the areas that the survey showed us. For example:"
        },
        {
            "text": "Every time we get the content community together, I learn something new. I’m keen to continue those connections by exploring certain topics, show and tells and crits."
        },
        {
            "text": "We’ve also worked to bring together content designers that work on:"
        },
        {
            "text": "We have a ‘business as usual’ (BAU) team that looks after all our GOV.UK content. We call them the ‘beautiful and unique’ team as there’s no such thing as business as usual. They’re very much part of our content community and report to our Head of Content. We’ve now made sure that it’s clear to everyone who joins us who the BAU team are. It’s important that content designers working on products and services talk to the BAU team early, so they’re supported and have guidance to start from if they need it. "
        },
        {
            "heading": 2,
            "text": "Content strategy"
        },
        {
            "text": "I think I speak for the whole of Defra’s content community when we say we were inspired by a talk that the Department for Education’s content team gave on developing content strategies for Services Week 2022. We’re not there yet but some of our content designers have got started and we’re looking forward to bringing those together."
        },
        {
            "text": "Now that a lot of our recruitment is complete, and the Lead Content Designers are more settled in our roles, we’ve got a bit more breathing space. We had been supporting programmes, services and products as things came up. We’re hoping our new Lead Content Designers can help share this work but we want to be more strategic and align ourselves to Defra’s objectives. This will make it easier for us to get to know other teams in Defra and its agencies, our users’ needs and work out how we can help each other."
        },
        {
            "heading": 2,
            "text": "Apply for the role "
        },
        {
            "text": "Does this role sound like it’s up your street? We’d love to hear from you."
        },
        {
            "text": "Apply for the Lead Content Designer role."
        },
        {
            "text": "Our Applying for content design roles at Defra blogpost may also be useful."
        },
        {
            "text": "Jeni Street is Lead Content Designer at Defra."
        }
    ]
}