{
    "url": "https://prisonjobs.blog.gov.uk/2022/04/14/what-its-like-working-as-a-prison-caterer/",
    "title": "What it’s like working as a prison caterer",
    "authors": [
        "Ministry of Justice"
    ],
    "categories": [
        "Personal stories",
        "Prison catering",
        "Ways of working"
    ],
    "pub_date": "2022-04-14T16:54:49+01:00",
    "content": [
        {
            "text": "Working in a prison kitchen isn’t your average catering job. There are no late evenings, you’ll enjoy a range of great Civil Service benefits, plus you’ll get real job satisfaction supervising prisoners to learn new skills. If you're looking for a catering job where you can make an impact far beyond the kitchen, read on to see what one of our current caterers has to say about his work, and take a look at our current vacancies."
        },
        {
            "text": "Dave, who has been a caterer for over 25 years, tells us about his role and what he likes about it."
        },
        {
            "text": "“I worked in industrial sized kitchens in hospitals, army barracks and schools for many years so I’m used to cooking on a large scale. Working in a kitchen that prepares meals for an entire prison therefore felt very familiar in many ways."
        },
        {
            "text": "One of the things that appealed to me was knowing it was a long-term career opportunity, not just a job – which you don’t often get working in catering. The shift patterns and working hours – particularly not having to do antisocial hours – are also a real bonus.”"
        },
        {
            "text": "Day-to-day life as a prison caterer\n“I start work at 8am, check what food I’m preparing and any handover notes from the previous day. We let the prisoner workers in at 8.30am. I work with a team of other caterers and we’re each allocated to a particular workstation. I’m generally on the hot meal section and start by briefing the team of prisoners I’ll be working with on what meals we’ll be preparing and what they need to do. I’ll demonstrate any new dishes and supervise what they’re doing throughout the day. We prepare and serve lunch and dinner menus."
        },
        {
            "text": "I work shifts – including some weekends – and depending on how my shift pattern falls, I get to enjoy four days on, followed by four days off.”"
        },
        {
            "text": "Working in a prison\n“Before I started in adult prisons, I had a catering job in a young offenders’ institution. While I didn’t supervise offenders, it gave me experience of working in a custodial setting. I’d also previously taught cooking to young people. So, working in a prison catering role where I’d get to pass on my skills to adult offenders, felt like a logical next step."
        },
        {
            "text": "As I’d already seen the security measures that were in place in my youth offending job, I wasn’t daunted by the idea of working alongside prisoners. I carry a radio, there are panic buttons around the kitchen if we need them, and processes to follow that keep everyone safe. I’ve never had to use any of them.”"
        },
        {
            "text": "Making a positive difference \n“My attitude is that, while the prisoners have made mistakes that have landed them in prison, they’re not necessarily bad people. Generally, they’re happy to be working and keen to learn how to make new dishes. I enjoy seeing them becoming more confident and knowing the difference this can make. Working in the kitchen gives them an opportunity to learn new skills they can use when they leave custody. Plus they have opportunities to get qualifications in food hygiene or study for a catering NVQ, which can increase their potential to find paid work."
        },
        {
            "text": "Working as a prison caterer is an excellent career. I love cooking and get to combine my passion with working with a great team of people while passing on my skills to help prisoners potentially reduce their risk of reoffending. That’s a great feeling, and very rewarding.”"
        }
    ]
}