{
    "url": "https://hmlandregistry.blog.gov.uk/2022/04/14/whats-in-a-name/",
    "title": "What’s in a name?",
    "authors": [
        "Andrew Robertson, Head of Customer Policy and Service Improvement"
    ],
    "categories": [
        "Law and practice"
    ],
    "pub_date": "2022-04-14T12:09:10+01:00",
    "content": [
        {
            "text": "Every year, we send more than 200,000 requests for information (requisitions) in relation to variations in names in applications, such as spelling discrepancies or the order of first and second names."
        },
        {
            "text": "Most could be avoided with a few quick checks in line with one simple principle:"
        },
        {
            "text": "This requirement applies to all name variations, including spelling errors and the order of names."
        },
        {
            "heading": 2,
            "text": "What goes wrong?"
        },
        {
            "text": "It could be that the names in deeds sent to us for registration don’t match. Or that names in deeds sent for registration don’t match the names of the registered proprietors in the register and/or the identity panels of our application forms. In rarer cases, a name variation can be an indicator of fraud. In each of these cases, we have to send a requisition to account for the variation(s)."
        },
        {
            "text": "This causes a delay to your application’s processing time, so you can see that a few simple, pre-submission checks will reduce the delays that are caused when we have to seek further information."
        },
        {
            "heading": 2,
            "text": "What steps can I take?"
        },
        {
            "text": "Check every name as early in the transaction process as possible, and if there is a variation in any deed or form, or between any deed or form and the register, take action to resolve it before sending the application to us."
        },
        {
            "text": "If your application involves deeds that have been signed electronically, refer to Practice Guide 82: electronic signatures accepted by HM Land Registry for further information and guidance on how to amend them."
        },
        {
            "text": "See our useful Variations in names flowchart to find out what action you need to take to resolve variations in names when lodging an application with us."
        },
        {
            "heading": 2,
            "text": "What if there is a variation?"
        },
        {
            "text": "When there is a variation in the name in the deeds you send us and the name in the register, you’ll need to send us evidence to account for the variation before we can process the application and update the register."
        },
        {
            "text": "The documents we will accept as evidence are:"
        },
        {
            "text": "The conveyancer must either represent the registered proprietor or provide the proprietor’s signed authority to apply to update the register on their behalf."
        },
        {
            "text": "Alternatively, conveyancers can provide a letter that tells us the following information:"
        },
        {
            "text": "When sending details of your authority to us, you can use the suggested wording below. You can also use it for changes to deeds signed in wet ink sent for registration which may contain other errors, such as spelling mistakes that need to be corrected on behalf of the registered proprietor."
        },
        {
            "text": "For changes made to a deed signed with a conveyancer-certified electronic signature, please see section 3.3 of Practice Guide 82: electronic signatures accepted by HM Land Registry."
        },
        {
            "heading": 2,
            "text": "What if I simply want to correct a name?"
        },
        {
            "text": "You can make an application to change or correct a name using our e-con service, subject to some limitations. See HM Land Registry portal: change of name (e-CON)."
        },
        {
            "heading": 3,
            "text": "Further help and guidance"
        },
        {
            "text": "For more information, examples of common errors in relation to names and expert guidance on what to do, watch our customer webinar."
        },
        {
            "heading": 3,
            "text": "And finally"
        },
        {
            "text": "Fewer requisitions mean faster processing, so remember one simple rule:"
        },
        {
            "text": " "
        }
    ]
}