{
    "url": "https://educationhub.blog.gov.uk/2022/05/10/claims-that-having-academy-status-makes-schools-less-likely-to-be-rated-good-or-outstanding-are-misleading-heres-why/",
    "title": "Claims that having academy status makes schools less likely to be rated good or outstanding are misleading – here’s why",
    "authors": [
        "Media Officer"
    ],
    "categories": [
        "Academies",
        "Schools"
    ],
    "pub_date": "2022-05-10T09:41:47+01:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "We’re aware of claims that suggest that schools with academy status are less likely to get good or outstanding Ofsted ratings than their council run counterparts. These claims are misleading – and here’s why."
        },
        {
            "text": "Firstly it’s useful to explain what academies are. Academies are state-funded schools but they’re independent from local authorities meaning they aren’t run by councils."
        },
        {
            "text": "They’re still funded by the government but they get to decide how they spend their money, from how much they pay teachers to how much they spend on classroom equipment."
        },
        {
            "text": "Over half of pupils are already educated in academies and there are three types:"
        },
        {
            "text": "Sponsored academies make up a significant proportion of the overall number of academies around the country. Generally, these schools were previously underperforming under local authority control and have been taken out of local authority control and made into academies to bring about improvement. Since 2016, the Secretary of State has been required by law to convert schools in receipt of an Inadequate judgement into sponsored academies. By taking the lowest rated schools off local authorities it inevitably means the quality of their remaining schools appears higher and the average for academies becomes lower."
        },
        {
            "text": "Sometimes it can take a number of years and over the course of more than one inspection cycle for that improvement to take place"
        },
        {
            "text": "That’s why claims that suggest academies have lower Ofsted ratings than local authority maintained schools because of their academy status are misleading."
        }
    ]
}