{
    "url": "https://mhrainspectorate.blog.gov.uk/2022/05/10/compliance-monitor-process-part-2-cm-role-and-application-process/",
    "title": "Compliance Monitor Process (Part 2)– CM role and application process",
    "authors": [
        "Ewan Norton",
        "Tony Orme",
        "Joanne Parkin"
    ],
    "categories": [
        "Compliance matters"
    ],
    "pub_date": "2022-05-10T09:01:51+01:00",
    "content": [
        {
            "text": "This is the second part a two-part blog series on the Compliance Monitor Process which is being piloted by the MHRA from April 2022."
        },
        {
            "text": "As outlined in the first part of this blog, the MHRA is starting a pilot in April 2022 whereby Compliance Monitors (CM) will supervise the completion of an agreed Compliance Protocol (CP) for eligible Inspection Action Group (IAG) cases.  It is common for companies that are at IAG to employ consultants to assist with remediation activities. Our pilot for the compliance monitor process will establish a framework for the CM to carry out the remediation work but also report on progress to the MHRA. This second blog provides details on the CM role and application process."
        },
        {
            "text": "CM role"
        },
        {
            "text": "The CM, selected by the company from the CM register and accepted as suitable by the MHRA for that case, will work with the company to deliver the CP actions."
        },
        {
            "text": "CM eligibility "
        },
        {
            "text": "To ensure a robust supervision process, consultants applying for this programme will be assessed by the MHRA based on the principles of eligibility and suitability. The eligibility for a CM to be named on the register will be based on a number of factors, including:"
        },
        {
            "text": "CM suitability "
        },
        {
            "text": "The suitability of a CM will be assessed as and when they are nominated by a company.  The CM will be assessed based on the following, as a minimum:"
        },
        {
            "text": "How to apply"
        },
        {
            "text": "Further details on the process, the MHRA training, and related documents can be found here, and we would like to invite anyone who meets the criteria, and is interested in the position, to apply."
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}