{
    "url": "https://competitionandmarkets.blog.gov.uk/2022/05/10/digital-markets-and-the-new-pro-competition-regime/",
    "title": "Digital markets and the new pro-competition regime",
    "authors": [
        "Will Hayter"
    ],
    "categories": [
        "CMA Digital",
        "Markets"
    ],
    "pub_date": "2022-05-10T13:43:31+01:00",
    "content": [
        {
            "text": "Overall, consumers and society benefit hugely from digital markets, from the vast range of products and services we’re able to use to the ways we keep in touch with friends and family, but as more of us are immersed in the digital economy, we’re starting to see competition break down. The digital landscape is dominated by a small group of tech giants, and that can lead to negative consequences for all of us, for example:"
        },
        {
            "text": "Such consequences of reduced competition not only impact spending costs; there is also a direct cost for society. For example, the spreading of ‘fake news’ and the restriction of revenue to media services that play a vital role in our democracy."
        },
        {
            "text": "The DMU and the new pro-competitive digital regime"
        },
        {
            "text": "Digital markets are fast-paced and worldwide, it’s agreed that existing competition laws are not always equipped to keep up. A new pro-competition approach is needed to oversee the most powerful digital firms and, in December 2020, our Digital Markets Taskforce proposed a blueprint for this regime."
        },
        {
            "text": "This proposed regime will provide a specially designed toolkit that can tackle the problems seen exclusively in digital markets today and will be proactive rather than reactive to these problems, and flexible in its solutions. This will help ensure digital markets are competitive and innovative."
        },
        {
            "text": "Today’s Queen’s Speech announced the government’s plans to publish draft measures, and while this means a Bill won’t be introduced in the next Parliamentary session (2022 to 2023), the government last week re-confirmed its intention to legislate as soon as Parliamentary time allows. We support the final proposals and will work with the government on the draft measures and with Parliament and stakeholders."
        },
        {
            "text": "Current digital markets work"
        },
        {
            "text": "With this in the works, we are working hard to prepare for the full DMU role whilst taking action using our existing CMA powers."
        },
        {
            "text": "We are already using our existing tools in digital markets on many fronts:"
        },
        {
            "text": "This portfolio will continue to grow as we do more and more to tackle problems in digital markets using our current CMA powers."
        },
        {
            "text": "Our next steps"
        },
        {
            "text": "Since April 2021, we have made significant progress in building the knowledge, capability and skills we need to oversee the new regime effectively. Roughly 70 people now work in the DMU and more will continue to join as and when the legislation progresses."
        },
        {
            "text": "We’re working closely with technical experts in our DaTA team to identify future trends, and building relationships with a wide range of key stakeholders. We’re working closer than ever before with other regulators via the Digital Regulation Cooperation Forum, the DRCF, which published its workplan last week. We will also keenly follow the progress of the Digital Markets Act (DMA) in the EU. Collaboration with other jurisdictions is vital and we will work to ensure actions firms take to comply with their obligations result in good outcomes for UK consumers and businesses. Our success in securing a global commitment from Google relating to its Privacy Sandbox is a prime example of this."
        },
        {
            "text": "Overall, competition in the digital economy is not working well enough for UK consumers and businesses. A new pro-competition regime is needed to preserve and enhance a dynamic and innovative tech sector in the UK. While legislation develops, we will continue to protect consumers and businesses with our existing CMA powers and will build capacity, capability and knowledge in the DMU to make sure we are well-placed to use the new powers when they arrive."
        },
        {
            "text": "Find out more on the Digital Markets Unit collection page."
        },
        {
            "text": " "
        }
    ]
}