{
    "url": "https://insidedvla.blog.gov.uk/2022/05/10/encouraging-nature-recovery-at-dvla/",
    "title": "Encouraging nature recovery at DVLA",
    "authors": [
        "Andrew Lees"
    ],
    "categories": [
        "Features",
        "Sustainability"
    ],
    "pub_date": "2022-05-10T14:36:08+01:00",
    "content": [
        {
            "text": "As Senior Sustainability and Travel Services Manager, my role involves ensuring DVLA meets its legislative responsibilities for the natural environment across the estate. Additionally, I encourage and recommend ways to increase biodiversity in line with our Greening Government Commitments (GGC). We have created a biodiversity steering group and meet every quarter to talk about the opportunities available to progress towards targets and ensure we keep on track to meet our Biodiversity Action Plan (BAP) measures and the GGCs, which are inextricably linked."
        },
        {
            "text": "In our commitment towards a more sustainable future, I’m pleased to report that last December we successfully completed a business plan measure. This was to enhance habitats which are designed to increase biodiversity on our estate. So, what did we do to achieve this milestone?"
        },
        {
            "heading": 2,
            "text": "Improving the biodiversity of our estate "
        },
        {
            "text": "Ecological assessments were carried out to inform the findings and conclusions of the biodiversity action plan. The rationale was to work with what we have rather than try to artificially create habitats that would be difficult to maintain. We then identified two areas at one of our sites with different habitats which would benefit from a project to enhance conditions for wildlife."
        },
        {
            "heading": 3,
            "text": "First habitat"
        },
        {
            "text": "The attenuation pond was created to make sure rainwater is properly managed. If the pond becomes choked with vegetation, it can lose its ability to work properly and have a detrimental effect on some species of wildlife. There is no ideal amount of vegetation from a wildlife perspective, although more is often better. Frogs, toads and newts need both cover and a more open aspect."
        },
        {
            "text": "Work in this area included removing a third of the vegetation. This will give ample opportunity for amphibians to use the open water. An added benefit is removing nutrients from the water to prevent algae building up to levels which do not support wildlife. The vegetation has been left around the pond, which provides natural shelter for a variety of wildlife including amphibians, reptiles and small mammals."
        },
        {
            "heading": 3,
            "text": "Second habitat"
        },
        {
            "text": "Large grassy areas have become increasingly covered by scrub and tall ruderals. This sort of scrub is great for many species, such as birds, but does increasingly become less beneficial for others. For example, common lizards that can be found on site require open spaces to enjoy the sunshine. However, they still need cover to hide from predators."
        },
        {
            "text": "Clearing an area of scrub opened it up to encourage wildflowers to grow as the natural seedbank permits. We left plenty of cover for birds and some small mammals, but this open aspect also provides suitable areas for the common lizard to bask."
        },
        {
            "heading": 2,
            "text": "What’s next?"
        },
        {
            "text": "This year, we plan on using native meadow seed mix to encourage more pollinator friendly species and to introduce some native hedging to increase the habitat for birds and mammals. We will do our best to make sure that current species using our estate will always be present in healthy numbers for years to come."
        },
        {
            "text": "The biodiversity on our estate is a natural asset which we need to protect and can use to enhance our quality of life. Through our Biodiversity Action Plan, the Sustainability team aim to encourage staff, local communities and organisations to work with us to help conserve and enhance the rich diversity of habitats and species and ensure they are protected for the benefit and enjoyment of future generations."
        },
        {
            "text": "If you are interested in biodiversity on the DVLA estate, you can find out more in our Biodiversity Action Plan, and read more about our goals for a sustainable future in our Sustainability Report."
        },
        {
            "text": " "
        },
        {
            "text": "Follow DVLA on Twitter, follow us on Facebook and connect with us on LinkedIn. You can also subscribe to the DVLA digital services blog."
        }
    ]
}