{
    "url": "https://ofqual.blog.gov.uk/2022/05/10/exams-are-starting-2/",
    "title": "Exams are starting",
    "authors": [
        "Julie Swan"
    ],
    "categories": [
        "A levels and GCSEs",
        "Exams",
        "Uncategorized",
        "Vocational and technical qualifications"
    ],
    "pub_date": "2022-05-10T10:00:03+01:00",
    "content": [
        {
            "text": "Next week, summer exams start for GCSEs, AS and A levels – the first summer exams for 3 years. More than a million students will sit exams in thousands of different exam centres. More than 70,000 examiners and moderators will mark students’ work or moderate teachers’ marking, so that 5.7 million results can be issued in August. That’s on top of the many thousands of exams and formal assessments already underway and still to be taken for vocational and technical qualifications. "
        },
        {
            "text": " This summer’s exams are a big step on the way back to normality. And, as always, fairness to students is our priority. An unprecedented package of support is in place for students this year, including the spacing out of exams so there are at least 10 days between the first and last exam in a subject, a choice of content in some subjects, the provision of formulae sheets in some exams, and advance information in most subjects to help students focus their revision. At the heart of all this are the students. But there are also parents, teachers, exams officers, invigilators, examiners and moderators all playing a part.  "
        },
        {
            "text": "To make sure exams and formal assessments run smoothly, here are a few reminders. "
        },
        {
            "heading": 2,
            "text": "Students "
        },
        {
            "text": "Please remember: "
        },
        {
            "heading": 2,
            "text": "Exams officers  "
        },
        {
            "text": "We know how much students and teachers depend on exams officers to make sure exams and formal assessments run smoothly.  Most exams and assessments do run smoothly, thanks to your hard work, but we know that in a system of this scale, there are a few things that catch some people out every year that are worth bearing in mind: "
        },
        {
            "text": "JCQ requires 2 people to check each packet before opening, because the consequences of giving out the wrong paper can be serious and can be distressing for the students involved. Depending on when the mistake was noticed, students might have sat part of an exam they weren’t prepared for and missed the opportunity to take the scheduled paper. And they are likely to be interviewed and asked to sign confidentiality statements. If this happens and students are involved, don’t let students out of the exam hall and make sure they are supervised while you get in touch with the exam board for advice."
        },
        {
            "text": "Exam boards will never ask you to email confidential material, nor will they ask you to confirm any secure login details over the phone. If you’re in any doubt about whether a request is genuine, contact the exam board to check."
        },
        {
            "text": "For example, fire alarms sometimes go off, so make sure you know what to do if your students have to be evacuated in the middle of an exam. The JCQ guidance is available on their website. "
        },
        {
            "heading": 2,
            "text": "As for us… "
        },
        {
            "text": "We won’t generally respond to media and social media comments about exams during the exam period, because we don’t want to distract students or teachers from the exams themselves. But we will review any issues that arise, we’ll oversee how exam boards are managing them, keeping an eye on progress towards those August results days. And in all this, our goal will be making sure that this summer’s exams and formal assessments are as fair as possible for this year’s students. "
        }
    ]
}