{
    "url": "https://forestrycommission.blog.gov.uk/2022/05/10/five-tips-to-help-you-apply-for-the-england-woodland-creation-offer/",
    "title": "Five tips to help you apply for the England Woodland Creation Offer",
    "authors": [
        "Sophie Ward"
    ],
    "categories": [
        "Woodland creation"
    ],
    "pub_date": "2022-05-10T13:05:34+01:00",
    "content": [
        {
            "text": "The England Woodland Creation Offer (EWCO) is our flagship grant to support woodland creation across England. It launched in June 2021 and is available all year round, with applications so far ranging from one to over 100 hectares in area."
        },
        {
            "text": "The application process requires a range of information to be provided via an application form so we can ensure a scheme is eligible for the grant. This then enables us to administer the payments which currently average £11,800 per hectare and have the potential to be as high as £19,500 per hectare in some locations."
        },
        {
            "text": "For the application process to be quick for both applicants and ourselves there are certain steps you can take to ensure it is processed as smoothly as possible."
        },
        {
            "text": "In this blog post we’ve set out the five key things you should consider doing before making an EWCO application."
        },
        {
            "text": "All lead applicants and agents (if they will be authorised to claim grant payments) must be fully verified on the Rural Payments service so we know who is applying and can make payments to the right person. This must be completed before we are able to run eligibility checks on your application. It’s worth checking your details on the Rural Payments service to make sure they’re up-to-date and any outstanding notifications have been resolved before making a EWCO application."
        },
        {
            "text": "Under ‘People and permissions’ of your business on Rural Payments, we will check if there is a ‘More information required’ notification next to the name of the lead applicant and agent for the application. If there is a notification, we will ask that this is amended by contacting the Rural Payments service at ruralpayments@defra.gov.uk or by phone on 03000 200 301. This could be as simple as a change of address and is often easily rectified. However, we are only able to proceed with processing your application once this notification is resolved, or if we have been provided with evidence the RPA is currently processing any change."
        },
        {
            "text": "Once you’re registered on the Rural Payments service, you will receive a Customer Registration Number (CRN), a Firm Reference Number (FRN) and a Single Business Identifier (SBI). We need SBIs and CRNs to conduct our due diligence checks on applications and to enable payments. This means SBIs and CRNs are a mandatory requirement for the lead applicant on the EWCO Application Form (both Parts A and Part B)."
        },
        {
            "text": "Please ensure these numbers are the correct length before submitting your application: your SBI will be nine digits long and your CRN ten digits."
        },
        {
            "text": "If you are unable to locate your SBI or CRN, we recommend contacting the Rural Payments Service at ruralpayments@defra.gov.uk or by phone on 03000 200 301."
        },
        {
            "text": "If an agent will be acting on your behalf to make an application or claim, you need to give them the appropriate permission levels by completing a Forestry Commission Agent Authority Form. If you have already authorised your agent to act on your behalf with us and wish these existing permissions to apply to your EWCO application, you need to confirm this on your EWCO Application Form Part A."
        },
        {
            "text": "As of January 2022, you must submit a v4.0 Forestry Commission Agent Authority Form alongside your application documents to authorise a new agent. Both the agent and the applicant/agreement holder(s) must sign this form."
        },
        {
            "text": "You can sign this form in either of the following ways:"
        },
        {
            "text": "If you wish to sign electronically please complete the form without a signature and date, and email it to aafes@forestrycommission.gov.uk. We will then email you a link so you can sign an online version of the form."
        },
        {
            "text": "If you have signed the form by hand, please send your completed and signed form to us by either:"
        },
        {
            "text": "The signature pages must be included in the document/file as the rest of the Agent Authority Form and not as separately as an individual page/file."
        },
        {
            "text": "A map showing all areas of proposed woodland creation and associated capital items must be provided with your EWCO application. If your application is successful and you are offered an Agreement, your application map will become the “Agreement Map”. The map therefore needs to be clear, legible and meet the standards set out below:"
        },
        {
            "text": "We will not accept screenshots from internet map browsers such as Google Maps as base maps.\nMaps should be clear and easily read, such as this example map, and poor photocopies or poor image quality will not be accepted."
        },
        {
            "text": "Base maps can be requested from the Forestry Commission through the Map Request Service for use in your application. You can also use free mapping tools such as the Sylva Foundation’s My Forest system to create an application map, using their guidance on how to produce EWCO compliant maps."
        },
        {
            "text": "It is essential that work does not begin on any activity that will be funded through EWCO until you have formally accepted you grant agreement by returning the acceptance letter. Work carried out before you have a signed your EWCO agreement will be ineligible for funding. You should, however, speak to nurseries early about availability of planting stock. The more notice you can give your nursery, the more likely they are to be able to fulfil any order you make later."
        }
    ]
}