{
    "url": "https://digitaltrade.blog.gov.uk/2022/05/10/how-continuous-learning-for-our-product-profession-helped-improve-our-business-and-stakeholder-strategy/",
    "title": "How continuous learning for our Product profession helped improve our business and stakeholder strategy",
    "authors": [
        "Tom Dolan, Head of Product"
    ],
    "categories": [
        "Careers",
        "People and Skills"
    ],
    "pub_date": "2022-05-10T11:43:57+01:00",
    "content": [
        {
            "text": " There are talks and blog posts explaining amazing tactics that you can put into practice immediately. There are also slow burners, where you know that you have seen and heard something really important, but can’t see how to use it yet. "
        },
        {
            "heading": 2,
            "text": "Mind the Product "
        },
        {
            "text": "In 2017, I attended the “Mind the Product” conference, and a talk that quietly took root was by Teresa Torres. "
        },
        {
            "text": "Teresa talked passionately about her new idea, “opportunity solution trees”. These originated from a troubling misalignment about what to work on next between her and a developer. She found that when they reframed their problem space, they were talking about two different ways to address the same issue. This required much deeper thinking about the purpose of their work. This journey led to the creation of opportunity solution trees as her technique for alignment and idea generation.  "
        },
        {
            "text": "Over the next few years, I’d continued to enthusiastically watch and share the talk. However, I had also grown to suspect that there was something deeper going on, that I had missed the full value of Teresa’s words. I wasn’t quite sure what that was yet. "
        },
        {
            "heading": 2,
            "text": "Opportunity trees: the opportunity "
        },
        {
            "text": "As Miranda has blogged about previously, DIT is now in a different context than when it was formed. We needed to create a strategy for the next phase of our work. "
        },
        {
            "text": "We are an entrepreneurial organisation spread around the world, full of people with a lot of previous experience. This means we are sent countless ideas by stakeholders and have countless requests for projects we should work on. For some of these suggestions, it’s hard to see how they will help deliver value against the department’s  core outcomes.  "
        },
        {
            "text": "I also had the feeling that we were half-solving too many problems, leaving too many constraints in place. With guilt, I remembered Teresa’s comment about “shallow solutions”. "
        },
        {
            "text": "Teams knew they were solving genuine user problems and delivering value, but were sometimes struggling to get buy-in after launch. This meant that stakeholders kept suggesting new ideas to try and solve the problems we were already working on. I remembered Teresa’s developer. "
        },
        {
            "text": "All of these challenges felt like something opportunity trees could help us with. "
        },
        {
            "heading": 2,
            "text": "Warming up "
        },
        {
            "text": "It felt far too risky to immediately try out the opportunity trees technique with our most senior stakeholders. So, I booked out one of our fortnightly product profession meetings to build our skills together.  "
        },
        {
            "text": "Various themes emerged: "
        },
        {
            "text": "We all agreed that the technique was really promising, but also difficult and needed strong facilitation. We were onto something, but it wasn’t stakeholder-ready yet. "
        },
        {
            "heading": 2,
            "text": "On your marks "
        },
        {
            "text": "A few weeks later, we had the opportunity to try and tackle a smaller problem area in greater depth. It was a chance to get ten people together around a real whiteboard in the office and look at our export support space. "
        },
        {
            "text": "As before, a wide variety of outcomes emerged which were not easy to compare or prioritise. We knew that quality of data matters a lot to countless successful journeys, but how would improving that compare to more tangible features in practice? We often found we had so many possible opportunities in the middle of two trees that we couldn’t choose. This wasn’t a tree, one team pointed out, it was a shrub. "
        },
        {
            "text": "After lunch, I asked teams instead to only focus on the things we were proposing next quarter. From this, create a “spine” of opportunities that we could hang other opportunities and outcomes on later. "
        },
        {
            "text": "This was much more successful. "
        },
        {
            "text": "In one case, a truly clear narrative around a team’s work appeared. It ran through several levels of “in order to” that led to high-level business outcomes. Elsewhere, the opportunity shrub had gone and the service owner could see how they might work differently with stakeholders to create more impact. "
        },
        {
            "heading": 2,
            "text": "Get set "
        },
        {
            "text": "A few months later, we put opportunity trees into practice again. We wanted to look at some of the new plans for both Investment and Export promotion and this time, the workshops were a huge success. "
        },
        {
            "text": "In Investment, we spotted that several areas of work addressed completely independent goals, each with different levels of product risk. It was clear we could start getting benefits in a few areas, and the elements with most assumptions could be explored at their own pace. "
        },
        {
            "text": "In Export promotion, we discovered that several teams were in agreement about a particular piece of work in a way that hadn’t been apparent before. Seeing the problem spaces in this new way also helped us see how we might improve the mapping of individual teams to business opportunities. "
        },
        {
            "text": "We also uncovered countless ‘dead end’ ideas which we couldn’t tie to a particular outcome, or issues that were cultural rather than technological. "
        },
        {
            "text": "It was an exhausting series of workshops. However, they created clarity among the teams and confidence that we were ready to use the technique in the wider organisation. "
        },
        {
            "heading": 2,
            "text": "Go! "
        },
        {
            "text": "We will be taking an area of our Export tree into a workshop with policy stakeholders and using it to help unpack our collective thinking. We want to make sure we are all aligned on the way forward, and the order we’re going to tackle our product risks. "
        },
        {
            "text": "For our larger portfolios, we are going to treat this process as a regular event to share changing context. We will also be bringing this technique into more of our individual products. Encouraging Product Managers to work with their teams and stakeholders on a more tactical level will help to identify solutions for the most important problems. "
        },
        {
            "heading": 2,
            "text": "The victory lap "
        },
        {
            "text": "It has been great to see a technique iterated through our product community, and made ready for use more widely inside DIT.  "
        },
        {
            "text": "We are grateful to Teresa for starting us on this journey. We hope you try this out, too. If you’re in government and want to know more, do please get in touch. "
        },
        {
            "text": "If you want to be part of, or even lead, DIT’s amazing community of Product Managers, please keep an eye on our careers page! "
        }
    ]
}