{
    "url": "https://rpc.blog.gov.uk/2022/05/10/stephen-gibson-appointed-senior-fellow-of-the-mossavar-rahmani-centre-for-business-and-government-at-harvard-university/",
    "title": "Stephen Gibson appointed Senior Fellow of the Mossavar-Rahmani Centre for Business and Government at Harvard University",
    "authors": [
        "Stuart Sarson"
    ],
    "categories": [
        "Better regulation",
        "Independent scrutiny",
        "International"
    ],
    "pub_date": "2022-05-10T13:31:40+01:00",
    "content": [
        {
            "text": "The RPC are pleased to announce that our Chair, Stephen Gibson, has been appointed a Senior Fellow of the Mossavar-Rahmani Centre for Business and Government (M-RCBG) at Harvard Kennedy School, Harvard University[1]."
        },
        {
            "text": "Stephen will be researching the regulatory framework used by Government departments and sectoral regulators in the UK to introduce new regulations and how it could be more effective. This will complement his continued work with the RPC."
        },
        {
            "text": "Stephen said: “I am very excited by this fantastic opportunity. It is a great honour to have been selected as a Senior Fellow and I look forward to working within the Harvard team, researching the UK regulatory system.  This research and the lessons drawn will be an invaluable resource as the UK’s Better Regulation Framework is re-designed and the RPC works to improve the process of regulating by the Government in the future.”"
        },
        {
            "text": "--"
        },
        {
            "text": "[1] M-RCBG Senior fellows are distinguished professionals from government and/or business who come to Harvard for a year to address issues at the interface of the public and private sectors. Current Senior Fellows from the UK include the Rt Hon Sajid Javid MP, the Rt Hon the Lord Johnson of Marylebone and the Rt Hon Chris Skidmore MP."
        },
        {
            "text": " "
        }
    ]
}