{
    "url": "https://marinedevelopments.blog.gov.uk/2022/05/10/studland-bay-latest-patrols/",
    "title": "Studland Bay – Latest Patrols",
    "authors": [
        "David Patrick, Digital Communications Manager"
    ],
    "categories": [
        "marine conservation"
    ],
    "pub_date": "2022-05-10T09:59:33+01:00",
    "content": [
        {
            "text": "With four-mile sandy beaches, idyllic coastline, and breath-taking views of Old Harry Rocks, Studland Bay is a unique and popular place to visit for local residents and visitors from across the UK. The tranquil natural settings and well sheltered anchorage spots make the bay particularly popular for recreational activities such as boating."
        },
        {
            "text": "In 2020, an assessment was conducted by the Marine Management Organisation (MMO) to evaluate the potential impacts of marine non-licensable activities on the designated features of Studland Bay Marine Conservation Zone (MCZ). Marine non-licensable activities are generally recreational activities including sailing, powerboating and diving. The assessment found that management measures were needed to protect the site’s seagrass beds and seahorses from damage by anchoring."
        },
        {
            "text": "After much consultation with the boating community and users of the bay, a voluntary no anchor zone was introduced on 17 December 2021 in Studland Bay to help reduce damage caused by boats dropping and weighing anchors. The zone will also become a permanent larger area in June 2022."
        },
        {
            "text": "Over the last couple of weeks our South Team have been on-board the Southern Inshore Fisheries and Conservation Authority (IFCA) Fisheries Patrol Vessel ‘Endeavour’ in Studland Bay. These visits have been led by Senior Marine Officer Gordon Chittenden with Marine Officers Chris Sallows, Joshua Rose and Lucy Howarth-Forster."
        },
        {
            "text": "The purpose of these visits is to raise awareness amongst users of Studland Bay about the new measures and how they can work collectively with the MMO to protect the MCZ."
        },
        {
            "text": "Over the Easter weekend and May Bank Holiday, Gordon and the team spoke with over 70 vessels, 20 of which were inside the voluntary no anchor zone."
        },
        {
            "text": "Senior Marine Officer, Gordon Chittenden from MMO, who attended the patrols said:"
        },
        {
            "text": "“The sea conditions were favourable for the awareness raising activities in Studland Bay. Most people that we spoke with on the water were responsive and keen to receive the leaflet which explains the reasoning behind the voluntary no anchor zone and provides the co-ordinates which can be added to electronic charts to clearly define the boundaries."
        },
        {
            "text": "Approximately only 20% of people we engaged with said they were unaware of the voluntary no anchor zone which is an encouraging step in the right direction. Vessels were also making use of the advanced mooring systems (AMS) installed by Boatfolk and The Seahorse Trust during the sunny Bank Holiday weekend.\""
        },
        {
            "text": "The team will be continuing awareness raising activities and chatting to visitors over upcoming Bank Holidays for the Queen’s Platinum Jubilee."
        },
        {
            "text": "By working with everyone working together, this voluntary approach will lead to better protection for the MCZ for future generations, while still recognising the importance of the bay for recreational activities."
        },
        {
            "text": "The voluntary no anchor zone has been introduced to provide protection for Studland Bay’s long-snouted seahorse (Hippocampus guttulatus) and seagrass beds."
        },
        {
            "text": "The seagrass beds provide several vital ecological functions. Most notably, seagrass beds stabilise sediments, provide habitat for species such as commercially important fish and seahorses, and act as a sink for atmospheric carbon. It is also home to bass and endangered undulate rays. Long-snouted seahorses are a designated feature of the MCZ and a protected species."
        },
        {
            "text": "For more information on MMO’s work in Studland Bay MCZ, please visit the dedicated page on GOV.UK. If you have any questions, please contact us on Conservation@marinemanagement.org.uk."
        }
    ]
}