{
    "url": "https://dfedigital.blog.gov.uk/2022/05/10/value-of-networks/",
    "title": "Mental health and the value of networks",
    "authors": [
        "Ali Walker, Digital and Technology Recruitment Manager"
    ],
    "categories": [
        "culture"
    ],
    "pub_date": "2022-05-10T09:49:09+01:00",
    "content": [
        {
            "text": "*Trigger warning. This post focuses on miscarriage and fertility issues*"
        },
        {
            "text": "The theme for this year's Mental Health Awareness Week is loneliness."
        },
        {
            "text": "The first thing that may come to mind is being physically alone. But for me, I think of feeling mentally alone. This is a feeling I’m all too familiar with. Let me explain."
        },
        {
            "text": "In November 2015, I was diagnosed with anxiety. This came after months of experiencing an overbearing feeling of worry and paranoia."
        },
        {
            "text": "I went to see a doctor and was referred for online cognitive behavioural therapy (CBT). I had isolated myself because I felt like people didn’t want me around."
        },
        {
            "text": "My husband and I wanted to start a family. I was starting to have control over my anxiety so it felt like the right time. We were feeling positive and luckily pregnancy came along quickly."
        },
        {
            "text": "Sadly, a 10-week scan showed that we’d lost our baby."
        },
        {
            "heading": 2,
            "text": "Feeling mentally alone"
        },
        {
            "text": "At the time, I didn’t know anyone else who’d experienced miscarriage. It was a sad and lonely time, not knowing what to say to people. Plus, it had happened before I’d had a chance to tell people I was pregnant."
        },
        {
            "text": "Through Google I realised my feelings of grief were normal after an early loss. Luckily, I discovered charities such as The Miscarriage Association through which I found other people who’d been through similar experiences. I started to feel less alone."
        },
        {
            "heading": 2,
            "text": "The challenge of motherhood"
        },
        {
            "text": "I fell pregnant 3 months later and welcomed our son in June 2017. Exactly one year on from that fateful scan. Whilst I found motherhood a challenge, we wanted to have a second child."
        },
        {
            "text": "Along came 2020 – a year that changed so much for so many."
        },
        {
            "text": "The first lockdown saw us juggle parenting a 2-year-old with working from home. Attempts to get pregnant remained futile."
        },
        {
            "text": "I noticed some physical changes, which I put down to stress. Time passed, I contacted my doctor, and blood tests revealed I was menopausal. As a 34-year-old, this was the last thing I expected."
        },
        {
            "heading": 2,
            "text": "The menopause and mental health"
        },
        {
            "text": "I was referred to a specialist but I kept thinking how I was too young to go through this. I felt different from my peers, like I was old before my time."
        },
        {
            "text": "Once again I didn’t know anyone else who’d gone through the same experience. I’d never felt more alone. No one around me understood what I was feeling. Early menopause doesn’t run in the family, but I was now dealing with perimenopausal symptoms."
        },
        {
            "text": "I could see other people growing their families and having kids. This made my feelings of loneliness and grief all the greater. (I appreciate how lucky I am to already have a child, but it doesn’t ease the pain of knowing I could not have any more.)"
        },
        {
            "heading": 2,
            "text": "Setting up the DfE Fertility Network"
        },
        {
            "text": "Around this time, a message came up in the DfE parent network. They were looking for volunteers to set up a fertility network."
        },
        {
            "text": "I saw an opportunity to not only help myself, but to help others who may have had similar experiences to me. So I volunteered."
        },
        {
            "text": "Fourteen months on, we’ve established a network for all things fertility and pregnancy related including reproductive health, in vitro fertilisation (IVF), pregnancy, and baby loss."
        },
        {
            "text": "The network is a safe forum for colleagues with fertility issues to connect with each other, share experiences and useful resources, and to ask questions."
        },
        {
            "text": "Crucially we promote awareness of fertility issues across other networks and the department’s HR team."
        },
        {
            "heading": 2,
            "text": "Our network has influenced the department’s HR policies"
        },
        {
            "text": "Our network has reviewed and contributed to HR policies for maternity leave, parental leave, and adoption leave."
        },
        {
            "text": "It’s been uplifting to connect with other people who’ve also struggled with fertility and pregnancy."
        },
        {
            "text": "I’ve also joined the DfE Menopause Network. It’s been a comfort to know I'm not alone, and there are other people going through the same thing."
        },
        {
            "text": "Whether it’s fertility issues or something completely different, you don’t have to feel alone."
        },
        {
            "text": "My personal challenges over the last few years have felt incredibly hard and isolating. But I’m now part of a fantastic group of strong, resilient women."
        }
    ]
}