{
    "url": "https://vets.blog.gov.uk/2025/06/03/changing-perceptions-of-veterinary-public-health/",
    "title": "Changing perceptions of Veterinary Public Health",
    "authors": [
        "Government Vets Blog Team"
    ],
    "categories": [
        "Government Veterinary Services",
        "Jobs and Experiences",
        "Policy Work",
        "Professional development"
    ],
    "pub_date": "2025-06-03T14:12:04+01:00",
    "content": [
        {
            "text": "Written by the Deputy Chief Veterinary Officer for Wales Natalie Sampson MRCVS"
        },
        {
            "text": "Changing societal perceptions is hard, yet that is exactly what we set out to do four years ago when we faced an Official Veterinarian (OV) recruitment crisis that threatened FSA’s ability to deliver statutory meat official controls in abattoirs. That solution needed to tackle the immediate challenge and deliver long term sustainable change so that we didn’t face this threat again."
        },
        {
            "text": "Veterinary Public Health (VPH) is an umbrella term used to describe veterinary roles that look after both animal and human health & welfare, and includes an abattoir OV, whose role is to work with Official Auxiliaries (Meat Hygiene Inspectors) to ensure animal health & welfare at slaughter and good hygiene practice post slaughter to provide safe food. Not everyone is aware these roles exist, let alone how important they are. Those that do know about these roles, including in the UK veterinary profession, perceive the role to be unpleasant and unfulfilling. Yet on the continent, VPH roles are held in high regard, with a steady stream of vets wanting to work in this field. This discrepancy has meant that European vets have delivered the vital role of an abattoir OV in the UK and when we experienced the double challenges of COVID and Brexit, we realised how fragile this recruitment pipeline really is."
        },
        {
            "text": "The immediate mitigation included working with the UK veterinary regulator, the Royal College of Veterinary Surgeons (RCVS), to apply a flexibility allowing temporary registration of overseas-qualified vets who met the visa language standards, while they worked towards the higher language standards required to register with the RCVS in the UK. But this was only part of the answer. To create lasting change, we needed to change perceptions, so how did we go about it?"
        },
        {
            "text": "In parallel to FSA’s specific challenges, the wider UK veterinary profession has been experiencing a serious recruitment and retention challenge due to a wide range of factors. Most notably, due to disillusion and empathy fatigue in clinical practice, where most UK vets work. To us this was a real opportunity – if vets were looking to move away from clinical practice roles, could we show them the advantages of VPH roles and entice them to join our ranks? Did they even know how to change and transfer their skills between veterinary disciplines? Dividing the target populations into three, Veterinary Undergraduates, the wider veterinary profession and ministers/senior civil servants, our cultural change campaign began."
        },
        {
            "text": "Veterinary UndergraduatesWorking closely with VPH departments at English (and now Welsh) vet schools and working with Food Standards Scotland while they did the same with the Scottish Vet Schools, we increased our visibility and involvement in career days and lectures, tackling myths and perceptions about the variety of VPH roles available. We also launched a work experience programme for vet students (known as Extra Mural Studies ‘EMS’), inviting interested students to spend 2 days with FSA field vets before bringing them to London to talk to our wide variety of office-based vets in person about the roles they do. Even better, we pay their travel and subsistence – vital for cash strapped students."
        },
        {
            "text": "Natalie (standing centre) with EMS Students."
        },
        {
            "text": "Wider Veterinary ProfessionThis cohort were likely to have more entrenched views, which we needed to understand in more detail before we knew where to target. In addition to literature reviews, the FSA led on exploring interest in a government veterinary graduate entry programme and what that entails. We worked closely with the Government Veterinary Services team to speak at lunch & learns about our roles, and hosted stands at key veterinary conferences such as the London Vet Show, we widened our EMS programme to invite interested qualified vets to our office days and we built on our close relationship with RCVS and the British Veterinary Association (BVA) to increase our visibility in profession wide discussions."
        },
        {
            "text": "Government Veterinary Surgeons at London Vet Show November 2024."
        },
        {
            "text": "We also celebrate success and entered and won the BVA and European equivalent workplace wellbeing awards, which we continue to showcase."
        },
        {
            "text": "Celebrating Success: Monica is the FSA 2024 Vet of the year."
        },
        {
            "text": "Political and Senior SupportCross government, Ministerial and Senior Civil Service support was integral to our strategy. They had the power to effect and fund changes. We set up a Strategic Influencing and Engagement workstream as part of the FSA Operations led Veterinary Resourcing Programme and worked with others across the FSA to set up strategic meetings for the FSA Chair and CEO with key people of power, as well as showcasing the plight and impacts of veterinary shortages in the FSA’s Annual Report. Together this led to a 1-day Environment Food and Rual Affairs (EFRA) Committee inquiry into veterinary resourcing challenges, which in turn has provided a platform for potential reform of the outdated Veterinary Surgeons Act – something the profession has been calling out to change."
        },
        {
            "text": "ResultsWith all this hard work – have we been able to change perceptions? In short, yes. But the longer answer is more nuanced. We have been incredibly successful at raising the profile of the OV role and the value it brings to society. The OV pipeline is stable, but it will take time for us to see success with increased UK graduated vets’ boots on the ground – it has started. Where we have seen most success is with increased recognition and interest in VPH roles by the wider profession. A notable example of this is our invite to host a table at the Society of Practicing Veterinary Surgeons annual conference in January 2025 and talk about leadership in the profession, something that would never have happened previously. Historically the domain of clinical veterinary leaders, our invite signals a huge shift. Maximising the opportunity, we further built on our visibility, highlighting to delegates the skills and benefits working in civil service roles can bring to individual careers and the wider profession. Over fifty delegates and veterinary leaders joined our table, including the BVA president and RCVS Director for Advancement of the Profession, with discussions covering flexible working, leaderships styles, career progression and much more.Raising the profile of the FSA and all its veterinary roles, including the role of an OV, is not over but with the help of many people across the FSA we are far along the path of creating cultural change… who said changing the perception of a population was impossible?"
        },
        {
            "text": "Author: Natalie Sampson MRCVSMay 2025"
        }
    ]
}