{
    "url": "https://gott.blog.gov.uk/2025/06/03/commercialising-knowledge-assets-fund-opens-for-applications/",
    "title": "Commercialising Knowledge Assets Fund opens for applications",
    "authors": [
        "avneetkaur"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2025-06-03T11:15:54+01:00",
    "content": [
        {
            "text": "Author: Sarah Staniland, Head of Communities and Funding, GOTT"
        },
        {
            "text": "Today, the Government Office for Technology Transfer announced the opening of the autumn call of the new Commercialising Knowledge Assets Fund."
        },
        {
            "text": "The fund is designed to support government research organisations in accelerating their innovations towards the market. "
        },
        {
            "text": "It will help unlock the commercial potential of a wide range of projects, moving them closer to attracting private sector investment, supporting the government’s growth mission and delivering benefits for citizens."
        },
        {
            "heading": 2,
            "text": "What is the Commercialising Knowledge Assets Fund?"
        },
        {
            "text": "The Commercialising Knowledge Assets Fund offers funding ranging from £50,000 to £250,000 per project to move viable public sector Knowledge Assets with identified potential markets towards commercialisation."
        },
        {
            "text": "Successful applicants can also benefit from dedicated project support and expert advice from GOTT teams to help progress their projects."
        },
        {
            "text": "Funding can be used for a broad spectrum of activities to support your Knowledge Asset commercialisation journey, such as undertaking market and competitor intelligence, user testing or developing an IP strategy. "
        },
        {
            "text": "The  fund is agnostic to the type of Knowledge Asset you’re seeking to commercialise with possible examples ranging from a high-energy X-ray camera contributing to better diagnosis of patients to new tools to measure ground water helping to reduce water scarcity ."
        },
        {
            "heading": 2,
            "text": "The Commercial Readiness Framework"
        },
        {
            "text": "In order to guide and monitor the development of your Knowledge Assets towards commercialisation, we have introduced the Commercial Readiness Framework. "
        },
        {
            "text": "As part of the application process, applicants are asked to map their milestones against the framework. The framework covers four categories:"
        },
        {
            "text": "Using the framework will help guide your approach to commercialisation and project development, ensuring multiple aspects of commercialisation are considered from market strategy to organisational support."
        },
        {
            "heading": 2,
            "text": "Who can apply?"
        },
        {
            "text": "Funding is available to government Research Organisation, including but not limited to Public Sector Research Establishments (PSREs) and UKRI wholly owned institutes.  "
        },
        {
            "text": "Our full eligibility criteria and list of eligible organisations can be found on our About us page. "
        },
        {
            "heading": 2,
            "text": "Why apply?"
        },
        {
            "text": "The Commercialising Knowledge Assets Fund is a unique opportunity for you to scale the impact of your Knowledge Assets. "
        },
        {
            "text": "You will receive the funds and support to progress the commercialisation journey of your Knowledge Asset – for example through licensing, spinouts or joint ventures – thereby realising its value beyond your organisation for the benefit of the UK economy and its citizens. "
        },
        {
            "text": "You’ll have the opportunity to become part of a supportive cross-government community, act as a catalyst for innovation and entrepreneurship in your organisation and help progress the Knowledge Asset agenda across the public sector."
        },
        {
            "heading": 2,
            "text": "Find out more"
        },
        {
            "text": "Eligible organisations can apply now for the first round of the Commercialising Knowledge Assets Fund which closes on 4th of September 2025.  "
        },
        {
            "text": "To find out more, visit our funding page, or contact the team at grantfund.gott@dsit.gov.uk."
        },
        {
            "text": "We look forward to your application!"
        }
    ]
}