{
    "url": "https://ukhsa.blog.gov.uk/2019/03/18/health-matters-what-you-need-to-know-about-statins/",
    "title": "Health Matters: What you need to know about statins",
    "authors": [
        "Jamie Waterall",
        "Huon Gray"
    ],
    "categories": [
        "Health Matters"
    ],
    "pub_date": "2019-03-18T15:23:24+01:00",
    "content": [
        {
            "text": "This post was published in 2019 when Public Health England had responsibility for health advice relating to statins and may now be out of date. For the most recent information please visit the NHS website or search for the topic on the gov.uk website."
        },
        {
            "text": "\"Statins key to living longer\" - Daily Express."
        },
        {
            "text": "\"Statin side-effects questioned\" - BBC News."
        },
        {
            "text": "\"Doctors' fears over statins may cost lives, says top medical researcher\" - The Guardian."
        },
        {
            "text": "\"Statins do NOT have major side effects, claims study: Research finds users less likely to suffer maladies than control group\" - Mail Online."
        },
        {
            "text": "Statins are constantly in the news, with the media sometimes advocating the benefits, other times focusing on suggested side effects, and often being laced with controversy. Many of us may not fully understand the true facts about the medication, how it can benefit us, and whether or not it is of relevance to us."
        },
        {
            "text": "It is important that any inaccuracies or myths concerning statins are dispelled, as extensive research has confirmed that statin treatment is very effective, very safe and very affordable for those who might benefit from them. It is a vital medicine in the UK effort to save many thousands of preventable deaths every year caused by the biggest global and national killer – cardiovascular disease (CVD)."
        },
        {
            "heading": 2,
            "text": "What do statins do?"
        },
        {
            "text": "Statins are a group of medicines that can effectively lower the level of low-density lipoprotein (LDL) cholesterol in the blood, by reducing its production inside the liver."
        },
        {
            "text": "LDL cholesterol is often referred to as “bad cholesterol”, as it can lead to fatty deposits building up in the arteries, causing them to harden and narrow – known as atherosclerosis. This then leads to an increased risk of developing CVD, including conditions such as coronary heart disease, heart attack and stroke. Statins may also exert some benefit by their anti-inflammatory effect in areas of cholesterol build-up within the walls of arteries. High cholesterol is said to account for 7.1% of deaths in England."
        },
        {
            "heading": 2,
            "text": "Why the controversy?"
        },
        {
            "text": "One of the reasons for differences in press coverage is the frequent failure to distinguish what we mean when we talk about “prevention” of CVD. When a person has already had a cardiovascular event, such as a stroke or heart attack, it is obvious that one would want to reduce the likelihood of any future event. Approaches to prevention for these individuals is often referred to as ‘secondary’ prevention; preventing a future event after a first one has occurred. There is no debate about the benefit of statins for such people, and clinicians would always advise their use wherever possible in these circumstances."
        },
        {
            "text": "The situation is often seen as different for people who have not yet been identified as having cardiovascular disease, but who may be at increased risk of having a future cardiovascular event because they may have risk factors (such as smoking, diabetes, high blood pressure, a family history of CVD, a raised cholesterol etc.). Attempts to reduce the future risk of a CV event in these individuals, who have not yet shown signs of having CVD, is often termed ‘primary’ prevention, and it is in this area where most controversy exists."
        },
        {
            "text": "Some argue the case for statins for almost all who have an increased CV risk, whereas others argue that this represents ‘medicalising’ the population and results in over prescribing. Scoring systems have been used to assess an individual’s future CV risk, the most commonly used taking a ten year time scale, but others using a lifetime horizon."
        },
        {
            "text": "For every 1 mmol reduction in cholesterol, however the reduction is achieved, the risk of a future cardiovascular event is reduced by around 23%."
        },
        {
            "heading": 2,
            "text": "Statin side effects"
        },
        {
            "text": "Reports on side effects of statins may be at the root of much of the controversy, particularly when they are emphasised in the media. This type of coverage can lead to doubt about the benefits of statins among both health professionals and the public. Consequently, it has led to some patients stopping their statin treatment because of concerns about the perceived side effects."
        },
        {
            "text": "Like all medicines, statins can cause side effects in some people, although analysis of multiple clinical trials has suggested that side effects of statins (such as muscle ache) in the trial populations may be little different from the placebo arm of the trials. Serious adverse effects are extremely rare and the vast majority of people can tolerate them well and do not experience any problems. This has been confirmed by extensive research and a major review of evidence which has confirmed that the benefits of statins for those who might benefit from them far outweigh any possible adverse effects."
        },
        {
            "heading": 2,
            "text": "What are the current guidelines?"
        },
        {
            "text": "PHE encourages people to make positive behaviour changes as the first step in primary prevention of CVD, in line with recommendations set out by NICE. These positive behaviour changes include:"
        },
        {
            "text": "NICE has made recommendations based on extensive evidence of the potential benefit achieved for primary prevention when statins are offered to people whose ten year risk of CVD is greater than 10%, if lifestyle changes are insufficient at reducing the risk below 10%."
        },
        {
            "text": "The majority of those who have a raised blood cholesterol have many genes which exert an influence, so called polygenic hypercholesterolaemia. However, there are some people (over 150,000 in England) who have a raised cholesterol due to a single gene variation, a condition known as familial hypercholesterolaemia (FH). The genetic abnormality is inherited from a parent, causing high LDL cholesterol levels from birth, and behaviour change alone is insufficient to lower cholesterol adequately. FH patients will always need the addition of statin treatment, for LDL levels and CVD risk to be significantly lowered."
        },
        {
            "heading": 2,
            "text": "Current statin prescribing "
        },
        {
            "text": "Although NICE recommends offering statin for those with a 10 year CVD risk score of ≥10%, available evidence suggests that for people with the higher CVD risk score of ≥20% only about 35% of have been initiated on a statin. Overall low statin use could be because they are not being prescribed to eligible individuals, because patients refuse treatment, or because they stop taking the medication. As a result, it means that statin use is suboptimal, leaving significant numbers of people at risk of a preventable CVD event.  To address this, PHE, NHS England and a coalition of system partners – known as the National CVD Prevention System Leadership Forum (CVDPSLF) – is calling for statin use to be optimised."
        },
        {
            "text": "Launched at PHE’s recent CVD Prevention Conference, these ambitions are set out in the latest edition of Health Matters. When good progress has been made, this ambition will be reviewed and a revised target for treating people who have a 10% or greater risk of developing CVD will be set, as per NICE guidelines."
        },
        {
            "heading": 2,
            "text": "Types of statin and dosage"
        },
        {
            "text": "In addition to increasing statin initiation amongst people with a CVD risk of ≥20%, an optimisation strategy is proposed which involves ensuring that these people are taking the correct dose."
        },
        {
            "text": "There are five commonly given statins in the UK, which are split into two groups: low-intensity statins (pravastatin, fluvastatin and simvastatin), and higher-intensity statins (atorvastatin and rosuvastatin)."
        },
        {
            "text": "The NICE guideline recommends offering 20 mg atorvastatin daily for primary prevention to people who have a 10% or greater 10-year risk of developing CVD. This includes those with Type 2 diabetes and chronic kidney disease. The ambition is therefore that all people with a CVD risk of ≥20% should be prescribed this dose."
        },
        {
            "text": "For secondary prevention in people with pre-existing CVD (for example a previous heart attack or stroke), high dose statin treatment (usually atorvastatin 80mg) is recommended as a first line of treatment."
        },
        {
            "heading": 2,
            "text": "The key take home messages"
        },
        {
            "text": "The media may sometimes interpret and communicate treatment guidelines, new research, and medicines in a way that can sensationalise and lead to them being misconstrued by the general public. In the case of statins, healthcare professionals can be confident that current recommendations on their use are based on robust and extensive evidence. No one doubts the benefit of statins when prescribed for those who are known to have CVD, so individuals in this category should be reassured of their benefits and encouraged to take their medication if at all possible."
        },
        {
            "text": "For those at risk of developing CVD, but not yet known to have the condition, taking action to prescribe statins, in line with NICE guidelines, will contribute to achieving the ambition to reduce their risk and individuals at increased risk should be offered advice about the benefits of lifestyle change and potential use of statins. Getting more individuals with a >10-20% ten-year risk of developing CVD on to statin therapy will save thousands of lives and help reduce the number of people suffering the burden of living with CVD."
        }
    ]
}