{
    "url": "https://socialcareinspection.blog.gov.uk/2025/09/03/finding-out-more-about-residential-family-centres/",
    "title": "Finding out more about residential family centres",
    "authors": [
        "Yvette Stanley"
    ],
    "categories": [
        "residential family centres",
        "social care professionals"
    ],
    "pub_date": "2025-09-03T11:17:23+01:00",
    "content": [
        {
            "text": "Residential family centres (RFCs) are establishments where vulnerable families are given accommodation, their capacity to parent safely and effectively is assessed, and they can be given the advice, guidance or counselling they need.  "
        },
        {
            "text": "RFCs are designed to contribute to the most important decision that the state can make in relation to a family: whether a child continues to live with their parents.  "
        },
        {
            "text": "The children and parents in RFCs are among the most vulnerable in our society. In this blog, I’ll explain more about RFCs, Ofsted’s role in relation to them, and why we want to better understand them as a matter of urgency. "
        },
        {
            "heading": 2,
            "text": "The context of RFCs "
        },
        {
            "text": "There are 98 RFCs in England. They accommodate and assess vulnerable families at a stressful time in their lives. A family can be referred to an RFC by the courts or local authorities. "
        },
        {
            "text": "These can be very high-risk placements. Children in them will already have been identified as being at risk of serious harm​ from their parents’ poor parenting capabilities. "
        },
        {
            "text": "The needs of the families are often very complex.  "
        },
        {
            "text": "Parents may have multiple needs of their own, for example a learning disability, trauma from their own experience of abuse, neglect or exploitation, and a history of substance misuse.  "
        },
        {
            "text": "Their children may have a range of health, emotional or developmental needs that mean they require specialist intervention and support to help them to thrive.  "
        },
        {
            "text": "Making a safe assessment about these families requires a highly specialised and qualified social worker. They will work alongside care staff who understand the risks to children from unsafe parenting, and who can recognise when a child may come to harm from their parents.  "
        },
        {
            "text": "The staff who gather evidence to inform these assessments must have the right skills and knowledge to support, coach, observe and monitor the parents’ and children’s behaviour. They must use this to report methodically, fairly and reliably on family relationships and the child’s experiences. "
        },
        {
            "heading": 2,
            "text": "What is Ofsted’s role in relation to RFCs? "
        },
        {
            "text": "Ofsted is the regulator of RFCs. This means that an RFC must be registered with us before it starts to operate.  "
        },
        {
            "text": "We inspect RFCs every 3 years but will return much more quickly if we are concerned.  "
        },
        {
            "text": "If we believe that children are unsafe or we are concerned about the quality of the assessments, we will let the relevant local authorities know and may use our enforcement powers to restrict the RFC from working with any more families, stop it operating temporarily or even close it completely.  "
        },
        {
            "text": "It's important that local authorities understand the quality of the RFCs that they are using, as their assessments inform such important, life-changing decisions. "
        },
        {
            "heading": 2,
            "text": "What do we know about the impact of RFCs on children’s and parents’ lives?  "
        },
        {
            "text": "The number of RFCs has increased significantly, doubling in the last 6 years from 43 in 2018 to 98 in 2024. The number of applications for registration continues to grow.  "
        },
        {
            "text": "There are significant disparities in the spread of RFCs across the country – some areas, such as London and the North West, have many; others hardly any. "
        },
        {
            "text": "There is very limited data about children’s and families’ experiences and outcomes when they’re in an RFC, or whether the RFC made the best and safest recommendation for the child’s future.  "
        },
        {
            "text": "We also do not know why local authorities and the judiciary are deciding that more families should have an assessment in an RFC. It is not clear how decisions are made about which families would benefit from being assessed in an RFC rather than alternative options, such as community-based assessments or a specialist foster carer placement.  "
        },
        {
            "heading": 2,
            "text": "What does good practice look like in RFCs? "
        },
        {
            "text": "To be clear, we do see excellent practice in some RFCs. They have an important role to play in protecting children and in assessing and supporting their families. "
        },
        {
            "text": "We see: "
        },
        {
            "heading": 2,
            "text": "Have the parents’ and children’s rights been considered?  "
        },
        {
            "text": "As I explained earlier, the core purpose of a placement in an RFC is to monitor and assess a family’s parenting capability. However, we are starting to see families being placed in RFCs without a plan for an assessment or staying there after their assessment is complete.  "
        },
        {
            "text": "An RFC is not a place to live. It is not a home.  "
        },
        {
            "text": "Parents and children sometimes move a long way from home at very short notice to stay in an RFC, often with a new baby.  "
        },
        {
            "text": "Typically, assessments are commissioned to last 12 to 14 weeks. But the reality for some families is that they remain in the RFC for 6 months or more.  "
        },
        {
            "text": "They may have to give up their own home. Then, they may not have an identified place to call home to return to after the assessment is complete.  "
        },
        {
            "text": "This prolongs their stay in the RFC, which means the RFC is being used for reasons other than its intended purpose. It can also leave the family in the stressful position of moving around temporary accommodation like hostels. We expect families to know where they will live once the temporary accommodation provided for the assessment period in the RFC ends. "
        },
        {
            "text": "Parents may also be subject to constant surveillance and routine drug or alcohol testing while in the RFC.  "
        },
        {
            "text": "It’s good to stand back and think about how assessments in an RFC feel for families. Are there enough safeguards for parents and children? Has the experience improved the children’s life chances? How well were the parents’ rights respected?  "
        },
        {
            "heading": 2,
            "text": "Is the role of RFCs clear?  "
        },
        {
            "text": "The regulations for RFCs state that a ‘family’ is a child with their parents.  "
        },
        {
            "text": "On that basis, pre-birth assessments do not fall within the scope of the regulated activity of an RFC. Despite this, they are still happening in RFCs.  "
        },
        {
            "text": "We will be engaging with all relevant stakeholders to consider how this impacts on how we register and inspect RFCs. We will use this information to update the social care common inspection framework (SCCIF) to set out our expectations around this more clearly. For now, we are concerned about how an RFC can offer the right nurturing environment for parents-to-be and what that means for the birth of the baby.  "
        },
        {
            "text": "This is even more complex when that parent-to-be is a child themselves. They will need special care and support to be prepared for the birth of their child, and RFCs are unlikely to have staff with those specialist skills.  "
        },
        {
            "text": "We also question how this must feel for pregnant children. They are ‘removed’ from communities and family networks that could offer them valuable support and placed in a new environment away from home.  "
        },
        {
            "text": "Our greatest concern is about parents who are children being placed in an RFC. This is especially concerning when the parent-child is under 16. We know that an RFC may, in exceptional circumstances, offer services for families in which the parents are aged under 18. However, children who are parents have unique needs because they are still children themselves. They need care and support rather than simply a place to stay while their capability to be a parent is being assessed. "
        },
        {
            "text": "We believe that, in most circumstances, an RFC is not the right place for a young and vulnerable mother because the overarching role of an RFC is not to provide care for children.  "
        },
        {
            "text": "We want to see what local authorities and RFCs are doing to take account of the individual needs and vulnerabilities of children who are parents, so that they can care for and protect them, as well as their children.  "
        },
        {
            "text": "Any RFCs that are offering services to children as parents should expect their registration visit and inspection to focus on how they show that they can meet a child’s needs as a parent. "
        },
        {
            "text": "As RFCs provide accommodation and assessment for a fixed period, local authorities should not be expecting any children to see an RFC as their home. We all know that children need stability and a sense of belonging. They should have a place – a home – that they know they will go to once the assessment is complete. "
        },
        {
            "text": "We know that local authorities are finding it hard to find the right places to live for some children, but we need to be clear that RFCs are not homes. I know we all want to avoid children living in inappropriate places. "
        },
        {
            "heading": 2,
            "text": "What we need to know about RFCs and next steps "
        },
        {
            "text": "We are in a time of reform in social care. There is a strong emphasis on parents and family networks and children being supported in their communities. It seems to me that there is a potential disconnect between the increase in the number of RFCs and the strong emphasis on working in partnership with families and family networks in the reforms.  "
        },
        {
            "text": "There are lots of unanswered questions about the contribution that RFCs make to children’s and parents’ lives and decisions about their futures: "
        },
        {
            "text": "It is important that we know more about outcomes for these vulnerable children and families. ​We need to understand better how families’ lives are changed after a period of assessment, and whether the decisions made were the best ones at the time. "
        },
        {
            "text": "The current regulations and national minimum standards that underpin Ofsted’s regulatory and inspection work are out of date and need urgent revision. This limits our ability to regulate services well.  "
        },
        {
            "text": "We will keep the framework for inspecting local authority services for children (ILACS) under review. We will also explore whether we can request data from local authorities about how they commission assessments so we can better understand their decisions about using RFCs. "
        },
        {
            "text": "We must prioritise this conversation. The children and parents placed in RFCs are among the most vulnerable in our society, and with urgency we need to better understand what their experiences and outcomes are and ensure effective assessment and decision-making.  "
        },
        {
            "text": "I urge the government to consider research into this sector and begin a review of the RFC regulations and national minimum standards to reflect the needs of families today. "
        }
    ]
}