{
    "url": "https://environmentagency.blog.gov.uk/2025/09/03/managing-the-impacts-of-drought-in-the-midlands/",
    "title": "Managing the impacts of drought in the Midlands",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Climate change",
        "Drought",
        "Environment Agency",
        "Fisheries and biodiversity",
        "hydrometry",
        "Nature",
        "Ofwat",
        "Rivers",
        "Sustainability",
        "Water",
        "Water Monitoring"
    ],
    "pub_date": "2025-09-03T09:00:45+00:00",
    "content": [
        {
            "text": "What is the situation in England? Drought was declared in the West and East Midlands on 15 July, joining the North-West and Yorkshire which went into drought in June.Dry weather continues to impact water resources across England requiring water companies to take action to manage demand with the public being urged to use water wisely. Across England, rainfall was 20% less than long term average for June. June was also the hottest on record for England, with two heatwaves driving unusually high demand for water."
        },
        {
            "text": "What is the water situation in the Midlands?  In the Midlands, public water supplies are currently secure, but we are seeing adverse effects on the natural environment due to the ongoing lack of rain. And while groundwater levels have been normal across the region, they are starting to fall. Meanwhile, river levels are already low with some river flows in the region at their lowest for June since 1976. For example, the River Severn catchment received only two-thirds of the rainfall it normally does in June, while the Trent catchment fared worse, with only 37% of its long-term average for June. Lack of rain combined with warm temperatures lead to low water levels and less oxygen in rivers and streams – a stressful situation for the wildlife that depend on them. "
        },
        {
            "text": "Replenishing rivers One of the Environment Agency's roles is to ensure there is enough water for wildlife as well as for the public water supply. So, what is the Environment Agency in the Midlands doing to achieve this during the current prolonged period of dry weather? We operate water supplement schemes that support rivers – such as the River Severn Regulation."
        },
        {
            "text": "River Severn Regulation"
        },
        {
            "text": "The Environment Agency constantly monitors the River Severn to ensure that demands for water are met without compromising the river’s ability to support the natural environment."
        },
        {
            "text": "If levels drop too low, we can top up the river by releasing water from two reservoirs in Wales or the Shropshire Groundwater Scheme."
        },
        {
            "text": "On 12 August, the Shropshire Groundwater Scheme was switched on due to the current drought, and is pumping nearly 40 Olympic sized swimming pools of fresh groundwater every day into the River Severn."
        },
        {
            "text": "The scheme pumps groundwater stored naturally in sandstone underlying much of North Shropshire, and delivers it into the River Severn through a 53km network of pipes that are 80 metres underground. It can release up to 240 million litres per day."
        },
        {
            "text": "How is the Environment Agency supporting fish? "
        },
        {
            "text": "We respond to reports to our incident hotline of fish in distress, due to low water or low oxygen – or both. You can report sightings of fish in distress to our incident hotline on 0800 80 70 60. "
        },
        {
            "text": "In August, our officers conducted a fish rescue in the Peak District. More than 750 brown trout were rescued from a 1km section of the River Lathkill that was drying up. "
        },
        {
            "text": "The team used electric fishing to safely remove the fish, and moved them further downstream where water levels were higher. Once water levels return to normal, the fish will be able to make their way back to their original habitat."
        },
        {
            "text": "We also help fisheries managers such as angling clubs to protect fish stocks – for example, by providing equipment to pump oxygen into the water."
        },
        {
            "text": "At Dowdeswell reservoir in Gloucestershire, our fisheries team is monitoring low water levels which are dropping significantly. While the reservoir is for flood storage, not public water supply, low levels could impact fish in the reservoir and downstream."
        },
        {
            "text": "Our officers are advising the angling club owner on best methods to protect the fish, and are ready to conduct a fish rescue if required. Officers have also installed sediment mats on the River Chelt to capture excess silt that could move downstream due to the reservoir’s low water levels. Excess silt can be harmful to aquatic life."
        },
        {
            "text": "How is the Environment Agency working with abstractors? As the government body responsible for licensing abstractions in England (taking water from the environment), we encourage farmers and growers to take and use water in a sustainable way. This includes putting temporary limits on abstraction licences and supporting water transfers (where someone with water to spare supplies another abstractor). We also ensure water companies have robust drought plans in place, should they need to activate them (it's your water company who will decide whether or not a hosepipe ban is needed this summer). Find out more about how we are supporting the farming community to manage the impacts of dry weather. "
        },
        {
            "text": "Last but not least, we monitor environmental indicators – including rainfall data provided by the Met Office as well as the water level information provided by our network of river and groundwater gauges. So that's what we do. But it's fair to say that everyone has a part to play in ensuring there's enough water for wildlife as well as for people – water companies, farmers and growers, businesses and the general public."
        },
        {
            "text": "What can I do? You can do your bit by only using the water you really need to at home. There are lots of tips on the Water Wise website or you can follow Waterwise on Facebook to get more ideas."
        }
    ]
}