{
    "url": "https://cddo.blog.gov.uk/2023/06/14/cddo-is-an-exciting-place-for-a-technologist-like-me/",
    "title": "CDDO is an exciting place for a technologist like me",
    "authors": [
        "David Knott, Chief Technology Officer for UK Government, CDDO"
    ],
    "categories": [
        "CDDO",
        "Cross-government strategy",
        "Digital transformation"
    ],
    "pub_date": "2023-06-14T17:11:38+01:00",
    "content": [
        {
            "text": "Last month, I joined the Central Digital and Data Office as the Chief Technology Officer for UK Government, leading a team of experts delivering the commitments outlined in the digital transformation roadmap. "
        },
        {
            "text": "Big goals"
        },
        {
            "text": "We’ve got big goals for a small team, but that doesn’t worry me: I’ve always believed that small teams can make a big difference, especially when their work is amplified by the power of technology. Our priorities include:"
        },
        {
            "text": "It’s an exciting place for a technologist like me to be."
        },
        {
            "text": "Furthermore, we’re not alone - and we couldn’t realistically get anything done on our own. As a team, we’re part of the much wider community of Digital, Data and Technology (DDaT) professionals across government, and most of the action will happen within departments themselves. "
        },
        {
            "text": "I chair the Chief Technology Officer (CTO) Council: the group of CTOs from across government who collaborate on a shared agenda. I’m confident that the combined experience, capability and commitment represented by that group makes it possible to do astonishing things. "
        },
        {
            "text": "Our Chief Executive, Megan Lee Devlin has previously outlined the importance of revitalising digital and data communities across government to lay the foundations for the roadmap. "
        },
        {
            "text": "Digital transformation at scale"
        },
        {
            "text": "I’m fascinated by the sheer range of applications of digital and data in government and the differences we can make to people’s lives. I’ve spent much of my career in financial services, which is important but (with apologies to my banking friends) is mostly moving data around. Having the chance to work with technology which actually connects directly to the physical world in so many ways is very exciting."
        },
        {
            "text": "A humbling return"
        },
        {
            "text": "When preparing for my interviews for this role, I was really excited to read about Mission 5 of our roadmap, to build digital skills at scale, and even more excited to hear about our plans for apprenticeships. Although I’ve spent most of my career in the private sector, I owe so much to the start that the Civil Service gave me. My first real technology job was at HM Customs and Excise, as it was known then, and helping others get that start is important to me. "
        },
        {
            "text": "It’s truly humbling and inspiring that in this role I will have the chance to help the careers of Civil Service technologists, whether they are starting out or part way through their career. "
        },
        {
            "text": "Everybody who works on technology likes to see it being used in the hands of real people. And there are a lot of people who rely on government services. What we build matters."
        }
    ]
}