{
    "url": "https://nda.blog.gov.uk/dounreay-managing-director-experiences-hands-on-decommissioning/",
    "title": "Dounreay Managing Director experiences 'hands-on' decommissioning",
    "authors": [
        "Mark Rouse"
    ],
    "categories": [
        "skills",
        "Uncategorized"
    ],
    "pub_date": "2023-06-14T11:44:57+01:00",
    "content": [
        {
            "text": "Mark Rouse recently had the opportunity to try his hand at being an airfed suit operator in the training simulator at Dounreay."
        },
        {
            "text": "“I think it was a few years ago when I was first at Dounreay, I expressed an interest in experiencing things that the workforce went through – and airfed suits was one that particularly interested me. It's one of the things that makes my job interesting. I get to experience the whole breadth of the company. However, I've also been conscious that I shouldn't make it some kind of gimmick that the MD goes and does."
        },
        {
            "text": "“I've been in the nuclear business a long time and worked directly on nuclear plant in the past, but only recently through Dounreay have I been engaged in work where I had to be protected from the radiation, rather than the plant being protected from me. If you look at submarines or a lot of the conventional power stations, we wear all this gear to protect the plant from us - the chlorides in your hands etc - but an airfed suit is genuinely protecting us from the things that we're working with, and it's one of the first thoughts when you get inside it, everything comes with a heightened awareness of vulnerability."
        },
        {
            "text": "“This was all about understanding a little bit more about what some of our colleagues go through when they enter really hazardous conditions and need a self-contained little plastic space suit to protect them from some pretty nasty stuff."
        },
        {
            "text": "“For a start, you can't put on an airfed suit on yourself, you must have people helping you. That's not a 'newbie' competence issue - you literally can't put these things on yourself. And as I've discovered, I've not spent much time recently balancing on one leg; I'm well out of practice! But when you must change and not touch things on the floor and contaminate things, you fnd yourself stood on one leg quite frequently. So it's helpful to have people around you to help you whilst you are guided into a cumbersome, muti-layered suit. It takes, I don't know, 10 minutes. It's not massively difficult, but just to know about the little techniques - put your glove that way, tape it in place this way because when you put on the suit it twists if it isn't lined up, all really helps."
        },
        {
            "text": "“I wasn't sure beforehand what it would be like - I've never worn anything quite like an airfed suit before - but I didn't find it uncomfortable or, as I half suspected I would, claustrophobic. I know it would get hot as you exerted yourself, but of course it's got quite an airflow from the breathing air feed. I didn't have the headset on but I could still hear reasonably well, despite the airflow going all the time that creates a little bit of noise."
        },
        {
            "text": "“I found you can't really look down and see your feet. The suit is quite cumbersome, and you've got these big boots on that are designed for protecting you. When you lift your foot up it often leaves the boot bag behind, so not everything moves in sync, and you've got to be quite attuned to that - you're sort of clumping around. Then there was me as an absolute amateur being given a ratchet spanner (that I didn't realise was a ratchet spanner) and being asked to do something…and of course you've got the big gloves on and it's hard enough just to hold the thing, let alone do something constructive with it!"
        },
        {
            "text": "“Then I was asked to screw a nut on and I was quite pleased with myself because I managed to screw the nut on without dropping it - but I was ever so conscious that if I dropped it, that was probably 20 minutes of my life that would be spent getting it back because I've got this big thing on that isn't going to bend very easily, or allow me to easily see or feel for something that small. Suddenly you become attuned to lots of other things. I'm sure colleagues who work in these regularly get very used to thinking like that and being exceptionally careful."
        },
        {
            "text": "“The undressing is an event in itself and probably the most significant part because again, it's protecting you from contamination. The undressing can often be the time when you are most susceptible to being contaminated; we see it even with non-radiological things. An absolute classic from one of my previous industrial jobs was when we found that operators took their goggles off and immediately blew the dust out of them - and then wondered why they had stuff in their eyes!"
        },
        {
            "text": "“So, it's always the riskiest time when you are taking even your normal overalls off - and of course it is back to balancing on one leg, but again with plenty of help from the support team (whom you have to be careful not to contaminate as well – there really is a lot to think about when disrobing)."
        },
        {
            "text": "“I always find this kind of real-world encounter – even if in a staged training environment – is a good reminder to me about just how significant the preparation for actually getting to many of our work fronts actually is. This morning, I rocked up 30 seconds before my meeting, turned on the laptop and I'm there in a meeting with people from all over the country with very little fuss and a bottle of water by my side. This is very, very different and not easy to tune in to without this kind of experience."
        },
        {
            "text": "“I have a huge amount of respect for everyone who works in an airfed suit. I was also really glad that we get our people some of the best equipment going. I can't say it enough; massive respect to those who work in airfed suits for long hours, because it's not easy. Even with the air flowing, it must get hot and sticky. It's an odd alien environment."
        },
        {
            "text": "“I don't think I have the kinds of skills needed to work in an airfed suit. Whilst it gives me an appreciation of it, you know, I see people around the site who can unscrew a can with a manipulator and make it look ever so easy. People who can work day in, day out and not trip over themselves and not drop the screws and all the other complicated things. So I don't do these with any pretence that I would have that level of skill. It was a great experience though and helps me do my job better. Big thanks to everyone that helped me out and once again, respect to those who work in our most hazardous environments on a regular basis.”"
        }
    ]
}