{
    "url": "https://teaching.blog.gov.uk/2023/06/14/how-using-air-cleaning-units-have-improved-our-learning-environment/",
    "title": "How using Air Cleaning Units have improved our learning environment ",
    "authors": [
        "Richard Lane"
    ],
    "categories": [
        "Primary schools",
        "Uncategorized"
    ],
    "pub_date": "2023-06-14T10:57:16+01:00",
    "content": [
        {
            "text": "Richard Lane, CEO at Mercia Primary Academy Trust, shares how his school is using CO2 monitors and Air Cleaning Units to manage ventilation for a healthier learning environment.  "
        },
        {
            "text": "What has the impact of using CO2 monitors been on managing ventilation in your school? "
        },
        {
            "text": "Good ventilation helps children to concentrate and be more alert, as well as helping to lower the spread of illness. CO2 monitors help make us aware when ventilation is poor and when it is at a healthy level – this helps us identify when it is beneficial to have the windows open to let fresh air in, or close them to keep warm (and save energy). They’re simple and easy to use, cost-effective and there has been no real maintenance.  "
        },
        {
            "text": "How are you managing ventilation in your school? "
        },
        {
            "text": "The CO2 monitors were effective in helping us identify issues with our ventilation levels, this allowed us to apply for DfE-funded air cleaning units (ACUs). They’ve been a game changer - they help control the spread of infection, helping keep our learners and teachers well. These now sit in the older classrooms and a mobile classroom. They’re placed out of the way and the floorspace they take is minimal with two per classroom. "
        },
        {
            "text": "Any tips on using Air Cleaning Units (ACUs) in a classroom? "
        },
        {
            "text": "For more information about how you can get the most out of your CO2 monitors and ACUs, take a look at the DfE’s ventilation gov.uk page here."
        }
    ]
}