{
    "url": "https://educationhub.blog.gov.uk/2023/06/14/ucu-marking-and-assessment-boycott-and-teacher-training-what-you-need-to-know/",
    "title": "UCU marking and assessment boycott and teacher training: what you need to know",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Schools",
        "Universities"
    ],
    "pub_date": "2023-06-14T14:30:44+01:00",
    "content": [
        {
            "text": "The University and College Union (UCU) announced a national marking and assessment boycott earlier this year, as part of strike action. This means that some university students might not receive their degree on time in 2023."
        },
        {
            "text": "The marking boycott has the potential to disrupt Initial Teacher Training as candidates usually need to prove that they have received their degree to start postgraduate courses."
        },
        {
            "text": "We know how valuable these new teachers are to our children and young people, and how important it is for these candidates to take the next steps in their training."
        },
        {
            "text": "That’s why we have made temporary changes to how Initial Teacher Training (ITT) candidates are assessed so all good candidates will be able to start their courses in September."
        },
        {
            "heading": 3,
            "text": "What is Initial Teacher Training?"
        },
        {
            "text": "In almost all scenarios, trainees must complete an ITT course that leads to Qualified Teacher Status (QTS) before starting to work as a teacher in state schools."
        },
        {
            "text": "There are several routes into ITT. Universities and schools run the courses and award qualifications."
        },
        {
            "text": "To be accepted onto an ITT course, candidates must have completed a degree."
        },
        {
            "heading": 3,
            "text": "What are you doing to make sure students can start Initial Teacher Training in September?"
        },
        {
            "text": "This year, to make sure that candidates can start their ITT in September, universities and school-led ITT providers that offer ITT will be able to recruit trainees whose degree status has not yet been confirmed because they have been impacted by the boycott."
        },
        {
            "text": "Later on, before candidates are able to formally complete their ITT and are awarded QTS, the provider will need to make sure that the degree has been awarded."
        },
        {
            "text": "This means that candidates will only be able to complete ITT once their graduate status has been confirmed. Universities must make this clear to candidates starting the ITT."
        },
        {
            "heading": 3,
            "text": "What are you doing to prevent UCU strike action?"
        },
        {
            "text": "The Government has no direct role in UCU industrial action as it’s the responsibility of individual colleges and universities to set pay for their staff."
        },
        {
            "text": "However, we want this disagreement resolved in a way that avoids disrupting students’ learning, especially given the difficulties students have faced during the pandemic."
        },
        {
            "text": "We strongly encourage a resolution that delivers good value for students, staff, and universities."
        }
    ]
}