{
    "url": "https://phescreening.blog.gov.uk/2021/09/28/cervical-screening-saves-lives/",
    "title": "Cervical Screening Saves Lives – evaluating the national campaign",
    "authors": [
        "Ruth Stubbs"
    ],
    "categories": [
        "NHS Cervical Screening Programme"
    ],
    "pub_date": "2021-09-28T15:34:44+01:00",
    "content": [
        {
            "text": "The first national ‘Cervical Screening Saves Lives’ campaign ran from 5 March 2019 to 30 April 2019 in England, as part of the wider Be Clear on Cancer initiative. An evaluation of the campaign shows there appears to have been a broadly positive impact and this can be used to help plan future interventions."
        },
        {
            "text": "Deciding whether to be screened is always a personal choice. The aim of the campaign was to raise awareness of the risks of cervical cancer and highlight the preventative benefits of screening to improve attendance across England."
        },
        {
            "text": "Worryingly, in 2018, coverage had reached a 20-year low, with 1 in 4 women in the UK not attending their test."
        },
        {
            "text": "The core campaign messages were:"
        },
        {
            "heading": 2,
            "text": "Campaign evaluation"
        },
        {
            "text": "Evaluating the effectiveness of the campaign helps us to plan future campaigns and understand whether messages from the campaign reached those who had not previously taken up the screening offer."
        },
        {
            "text": "A Public Health England (PHE) working group was formed with members from PHE Screening, NHS England and Improvement (NHSEI) and the PHE National Cancer Registration and Analysis Service (NCRAS). The group agreed a series of evaluation measures for the campaign, each focusing on a point in the patient pathway. For example, GP attendances for cervical screening and cervical screening coverage."
        },
        {
            "text": "Measures were selected for which routine data collections were already in place or could be obtained to support the campaign evaluation. Each of these data collections has a different schedule for collation, validation and analysis of data. The working group has been meeting regularly over the 2 years since the campaign to review and discuss the data as it has become available."
        },
        {
            "text": "For each measure a review of the data was carried out to assess the impact of the campaign. Data for the campaign period was compared with the previous year to see if there was a statistically significant change in the data."
        },
        {
            "heading": 2,
            "text": "PHE Screening data"
        },
        {
            "text": "Data was evaluated for the NHS cervical screening programme in England. Data measures included were from:"
        },
        {
            "text": "Nearly 340,000 cervical screening samples were received by laboratories in England during March 2019, the first month of the campaign. This was a 19% increase on the previous year. Statistically significant increases were seen over the next few months (12% to April 2019, 9% to May 2019, 2% to June 2019)."
        },
        {
            "text": "This seemed to show an increase in activity during the period of the campaign and just after."
        },
        {
            "heading": 2,
            "text": "NCRAS data"
        },
        {
            "text": "For the cancer registration data analysis, the impact of the campaign can be demonstrated in results such as the significant increase in GP attendances for women who were eligible for cervical screening and the impact on the numbers of all gynaecological and cervical cancer diagnoses recorded in the Cancer Waiting Times (CWT) database."
        },
        {
            "text": "Data on GP attendance for cervical screening tests was analysed for the periods before and after the campaign. There was a significant increase of 18.7% in women aged 25 to 49 years and 25.2% in women aged 50 to 64 years in GP attendances for cervical screening test per practice."
        },
        {
            "text": "The wider impact of the campaign may have extended beyond intended targets to the number of cervical screening test non-attenders and women who attend their GP practice to undergo cervical screening but are not eligible. "
        },
        {
            "heading": 2,
            "text": "Collaborative working"
        },
        {
            "text": "The ‘Cervical Screening Saves Lives’ campaign was the first national campaign for the NHS cervical screening programme and it was great to see the commitment, interest and collaborations at a local, regional and national level, as well as across the public, private and voluntary sectors."
        },
        {
            "heading": 2,
            "text": "PHE Screening blog"
        },
        {
            "text": "The PHE Screening blog provides up to date news from all NHS screening programmes. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new blogs. If you have any questions about this blog article, or about population screening in England, please contact the PHE screening helpdesk."
        }
    ]
}