{
    "url": "https://civilservice.blog.gov.uk/2021/09/28/cop-26-how-going-one-step-greener-can-help-the-planet/",
    "title": "COP 26 - how going one step greener can help the planet",
    "authors": [
        "Amber Warne, Campaigns and Marketing, Cabinet Office"
    ],
    "categories": [
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Ambitious Civil Service"
    ],
    "pub_date": "2021-09-28T11:32:00+00:00",
    "content": [
        {
            "heading": 3,
            "text": "In the lead up to COP26, to mark the Together for our Planet campaign, we want to hear how you’re helping to tackle climate change. Whether it's cycling to work or eating last night's leftovers for lunch, get involved!"
        },
        {
            "text": "Around the world storms, floods and wildfires are intensifying. Air pollution affects the health of tens of millions of people and unpredictable weather causes untold damage to homes and livelihoods. But while the impacts of climate change are devastating, advances in tackling it are leading to cleaner air, creating quality jobs, restoring nature and at the same time unleashing economic growth. "
        },
        {
            "text": "For nearly three decades, the UN has been bringing together almost every country on earth for global climate summits called COPs, which stands for ‘Conference of the Parties.’ This year’s conference (which was delayed by a year due to the pandemic) will be the 26th annual summit - giving it the name COP26. From 31 October to 12 November, the UK, in partnership with Italy, will host an event in Glasgow. Many believe COP26 could be the world’s last good chance to get runaway climate change under control. "
        },
        {
            "heading": 4,
            "text": "Tackling climate change"
        },
        {
            "text": "In advance of COP26, the UK is working with every nation to reach agreement on how best to tackle climate change. More than 100 world leaders are expected to arrive in Scotland, and together with tens of thousands of negotiators, government representatives, businesses and citizens, they will gather for 12 days of talks. Not only is it a huge task, it  goes way beyond another international summit. Experts believe COP26 has a unique urgency. "
        },
        {
            "text": "The UK is already leading the way on climate action. We have set a high bar for other countries to follow. The COP26 summit is the moment for other nations to come forward to share their ambitious plans to reduce greenhouse gas emissions."
        },
        {
            "heading": 4,
            "text": "UK’s year of climate action"
        },
        {
            "text": "The Together for our Planet campaign is building momentum for positive action on climate change across UK society, ahead of the COP26 summit."
        },
        {
            "text": "The campaign will showcase how individuals across the UK are making a difference in their daily lives and going #OneStepGreener - from the engineers working on offshore wind farms powering our homes and businesses, to local initiatives encouraging children and parents to walk to school. #OneStepGreener will show how ordinary people can make a difference, encouraging everyone else to do their bit, however large or small."
        },
        {
            "heading": 4,
            "text": "Going above and beyond"
        },
        {
            "text": "As part of the campaign, we will be working with 26 #OneStepGreener Ambassadors; extraordinary, everyday, people who are going above and beyond for the climate. #OneStepGreener Ambassadors symbolise the very best in UK climate leadership and will inspire the public to follow in their footsteps. "
        },
        {
            "text": "One of our ambassadors is Dame Jackie Daniel, NHS Trust CEO. Dame Jackie was appointed Chief Executive of Newcastle Hospitals in March 2018 and was recently named as one of the top five chief executives of the year in the Health Service Journal Awards for 2021. Since then, the Trust has retained its outstanding Care Quality Commission status and has become the first NHS organisation to pledge to reach Net Zero Carbon. Find out more about the #OneStepGreener Ambassadors here. "
        },
        {
            "heading": 4,
            "text": "Mass movement"
        },
        {
            "text": "The intention of the Together for our Planet campaign is to create a mass movement of green steps across the country in the lead up to COP26, showing how small actions culminate in large collective action. "
        },
        {
            "text": "Across government, departments have aligned their climate communications to boost engagement and spur the mass movement across social media channels all under the hashtag #OneStepGreener. "
        },
        {
            "text": "The #OneStepGreener call to action was launched on 1 July at Wimbledon Environment Day, with the official launch of the search for #OneStepGreener Ambassadors on 24 July to mark 100 days until the start of COP26."
        },
        {
            "text": "Major announcements such as the Department for Transport’s decarbonisation plan, BEIS’s  Funding for innovative smart energy systems and Defra’s Nature for Climate Fund linked into #OneStepGreener or #TogetherForOurPlanet. GCS Local was instrumental in amplifying comms to regional business groups and local authorities, with bulletins to almost 3,000 recipients. "
        },
        {
            "heading": 4,
            "text": "Small steps"
        },
        {
            "text": "Our individual actions may sometimes feel dwarfed, not to mention other factors that may constrain the choices many people can make in the first place. But we aren’t powerless - #OneStepGreener showcases that our choices do have an impact and do culminate in meaningful action against climate change. "
        },
        {
            "text": "Everyone's capabilities are different. Overall, it's important to find the ways in which you can go one step greener that work for your lifestyle and within your means. "
        },
        {
            "text": "We can no longer afford to wait to act against the threat of climate change. In the lead up to COP26, we must come together to protect our planet and people to ensure a greener, more resilient future for us all. We must all go #OneStepGreener. "
        }
    ]
}