{
    "url": "https://gfie.blog.gov.uk/2021/09/28/gfie-national-inclusion-week-2021/",
    "title": "GFiE - National Inclusion Week 2021",
    "authors": [
        "danmason"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2021-09-28T12:25:22+01:00",
    "content": [
        {
            "text": "'All employees feel more motivated when they feel that they are able to be their true selves at work'."
        },
        {
            "text": "For inclusion week we are talking to the MoD and the National Autistic Society (NAS) about how they are working in partnership to pilot a new scheme that will educate and upskill the whole team about working with neurodiverse people as well as offering an employment opportunity.  Ceri and Susan also offer some insights about how their partnership works and about tailoring a recruitment approach so that it removes barriers for autistic candidates."
        },
        {
            "text": "Ceri Whitelegg works for Defence Equipment and Support, MoD and spoke to us about their partnership with the National Autistic Society."
        },
        {
            "text": "Defence Equipment and Support (DE&S) has been working in collaboration with the National Autistic Society (NAS) to develop and implement an exciting pilot scheme specifically for people with autism. People with autism have great skillsets to offer an organisation and yet, according to the latest ONS report, only 22% of autistic adults are in some form of employment. As such, we wanted to support NAS’s Autism at Work programme to develop an autism- friendly recruitment process that helps more people with autism secure work at DE&S and join a diverse and inclusive workplace where they can really make a difference."
        },
        {
            "text": "At DE&S we are striving to create an inclusive environment and we want the key skills and experiences that only a diverse workforce can bring. We discovered NAS’s Autism at Work programme and from the outset, NAS was incredibly collaborative and supportive, especially while we analysed our recruitment process to identify barriers to autistic candidates and finding solutions."
        },
        {
            "text": "What did you do to remove barriers for Autistic candidates?"
        },
        {
            "text": "'Our pilot scheme launched in mid-June 2021 and our vacancy went live via NAS’s website with all applications going through NAS and its networks. We tailored our job advert to ensure it was autism friendly, created information packs, and a video tour to give candidates an accurate representation of what it is like to work on site. We also amended our interview process to include a practical assessment that was tailored to the vacancy,  which candidates could complete prior to the interview. Once the campaign closed, NAS conducted the CV sift and passed us the CVs of the candidates who met the essential criteria requirements, who have now been invited to interview and we are excited to see the results. The successful candidate will be hired on a Fixed Term Appointment (FTA) contract for 23 months, will receive full pay and have access to DE&S benefits. Once the FTA comes to an end, the candidate will have the opportunity to apply for a permanent position"
        },
        {
            "text": "What does the partnership bring to your scheme?  "
        },
        {
            "text": "'NAS’s Autism at Work programme ensures that not only are the candidates looked after, but that DE&S is fully supported and up-skilled too. We had an amazing Designated Employer Engagement Manager from NAS, who ran Autism Awareness sessions for the business, to help educate us all in what autism is, the benefits of hiring autistic candidates and how we can support an autistic colleague. NAS has been incredibly helpful and approachable in all aspects of the scheme to make sure we’re as autism-friendly as possible, while maintaining our ethos of being fair to all candidates'."
        },
        {
            "text": "What would you say to colleagues considering doing something similar?"
        },
        {
            "text": "Go for it and do not be afraid about the outcome. All companies are different and have their own recruitment process – there is no ‘one size fits all’ scheme. It is a trial and error approach to establish a process that works for your organisation while being as adaptable and friendly as possible for neurodiverse candidates. The importance of diversifying workforces must outweigh the apprehension of change'."
        },
        {
            "text": "' We are striving to create an inclusive environment and we want the key skills and experiences that only a diverse workforce can bring.'"
        },
        {
            "text": "Susan Askew works at the National Autistic Society (NAS) and spoke to us about the work she does to support employers to create neurodiverse workplaces."
        },
        {
            "text": "'We launched our Autism at Work programme in 2019, in association with Bloomfield Trust, with the aim of increasing the number of autistic people in sustainable paid employment. We do this by highlighting the skills and abilities that autistic talent can bring to business and the benefits to an entire organisation of creating a truly neurodiverse workforce. "
        },
        {
            "text": "Through Autism at Work, we have partnered with DE&S on a pilot programme, to recruit an autistic candidate into a role that has been identified as being particularly suited to aspects of autistic thinking style, such as a logical and methodical approach, strong focus and ability to maintain a high level of attention to detail. The recruitment process can present major barriers to autistic candidates due to features of autistic communication and thinking style. Autistic communication style can be literal and direct while thinking style can be logical and concrete. This, along with sensory differences and differences in body language, means that autistic candidates may have the skills and abilities to succeed in a role, but may not be able to demonstrate this in the typical assessment process.  In order to break down these barriers, we worked with the team at DE&S to develop an autism friendly recruitment process. The enthusiasm and strong commitment from the team at DE&S and their openness to suggestions for alterations to the recruitment process have made this a very positive partnership'."
        },
        {
            "text": "'How do you use the experience of people with autism to inform your work with employers?"
        },
        {
            "text": "The Employment Team and the National Autistic Society is diverse and made up of autistic and non-autistic members. We use our wide experience of living with autism and working with autistic people to inform our work with employers. Despite an increasing awareness, stereotypical ideas about autism still exist and our most important message to employers is that autistic people are infinitely varied. They may share a diagnosis, meaning they have differences in communication style, thinking style and the way they perceive the world in a sensory way.  However, they all have their own very individual autism profile, including strengths, skills, abilities and ambitions. In my role, I am often asked what kind of roles autistic people can do, and the answer to that is that there is no limit, it is entirely dependent on the individual. In the right role, an autistic employee is often able to outperform a non-autistic colleague due to a laser like focus and expert knowledge'."
        },
        {
            "text": "What would you say to a civil servant who is thinking of doing something similar? "
        },
        {
            "text": "'My message for a civil servant thinking of doing something similar would be that autistic people have skills and abilities that are valuable in the workplace and currently represent an untapped pool of talent. Creating a truly neurodiverse workforce, with teams made up of both neurotypical and neurodivergent thinkers, will produce the best outcomes. To solve complex problems, a variety of thinking styles is required so that issues are considered from different perspectives. In addition to attracting talent, a diverse and inclusive workforce brings further advantages the whole organisation. For example, all employees feel more motivated when they feel that their individual needs will be understood and that they are able to be their true selves at work'."
        },
        {
            "text": "'To solve the complex problems, a variety of thinking styles is required so that issues are considered from different perspectives.'"
        },
        {
            "text": "If you are interested in life chance recruitment get in touch with us gfie@cabinetoffice.gov.uk"
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}