{
    "url": "https://vets.blog.gov.uk/2021/09/28/how-do-government-vets-protect-the-uk-from-rabies-world-rabies-day-2021/",
    "title": "How Do Government Vets Protect the UK from Rabies? World Rabies Day 2021",
    "authors": [
        "Sam Holland",
        "Caroline Wilson"
    ],
    "categories": [
        "Disease outbreak",
        "Government Veterinary Services"
    ],
    "pub_date": "2021-09-28T10:21:06+01:00",
    "content": [
        {
            "heading": 3,
            "text": "Rabies across the world and the UK"
        },
        {
            "text": "A ‘global day of action and awareness for rabies prevention’ led by the Rabies Alliance, who work with the FAO (Food and Agriculture Organisation of the United Nations), OIE (World organisation for Animal Health), WHO (World Health Organisation) and charities such as the UK based Mission Rabies, aims to eliminate dog mediated rabies in humans by 2030."
        },
        {
            "text": "They are using a one health approach to achieve this, among other strategies aiming to vaccinate over 70% of dogs against rabies in endemic areas."
        },
        {
            "text": "Rabies is still a serious problem worldwide, it kills around 59,000 people a year, that’s one death every nine minutes, mostly in Africa and Asia. As many as half of the victims are children under fifteen, and the vast majority of human infections are caused by bites from the domestic dog. It is a fatal zoonotic disease, but can be controlled by vaccination."
        },
        {
            "text": "We are fortunate to be officially free of terrestrial rabies in the UK, as is much of Europe at this time. Rabies was however endemic in the UK as recently as the 1920s and in Western Europe in the early 2000s."
        },
        {
            "text": "Because of this status it is easy to become complacent about rabies, but incursions are always possible and part of the Animal and Plant Health Agency’s (APHA) role in protecting GB from outbreaks of exotic disease is to work to prevent incursions of this disease."
        },
        {
            "heading": 3,
            "text": "Investigating a potential case"
        },
        {
            "text": "Many APHA teams are involved in keeping our borders safe from rabies and other diseases, by creating and checking import paperwork, doing border checks and post import visits, monitoring disease incidents in other countries and investigating any reports of suspicion of disease."
        },
        {
            "text": "It is the teams of field vets located across Great Britain, who will carry out these disease investigations. If an owner, or more often a vet in practice, suspects that an animal in their care may have rabies, they can notify APHA by calling the relevant contact number for their country."
        },
        {
            "text": "One of a team of Duty Vets will then speak to them, gather information about the case and, using their experience and knowledge of risks and symptoms, will decide whether the case needs to be taken further."
        },
        {
            "text": "If it does then the veterinary inspectors based in local offices will undertake a veterinary investigation, with the support of veterinary advisors in the Veterinary Exotic Notifiable Diseases Unit (VENDU) who will oversee the inquiry."
        },
        {
            "text": "The veterinary inspector will visit the site where the animal is located. This could be at the owners dwelling place, veterinary practice, airport or even a boat at a marina. The first thing they do is formally serve movement restrictions to keep everybody safe and reduce the risk of spread."
        },
        {
            "text": "They will then take a full history including identifying any animal or human contacts that may have occurred with the suspect animal, observe the animals behaviour, and where possible clinically examine the suspect."
        },
        {
            "text": "These field vets have access to a full Kevlar suit, shield and dog catching equipment for the rare occasions where it is necessary to approach a high risk suspect to ensure everybody’s safety!"
        },
        {
            "text": "The vets in VENDU support and co-ordinate these investigations, speaking directly to the field vets to give them a friendly but critical ear to help them consider the case carefully, enabling them to come to a decision based on evidence and fact."
        },
        {
            "text": "If a decision has been made that a suspicion of disease cannot be ruled out, VENDU vets enable the next steps in the process such as laboratory testing."
        },
        {
            "text": "Communication is vital to the VENDU vets role. Policy customers, ministers, disease consultants, laboratory technicians, senior operational staff, the CVO, other teams in APHA (such as contingency planning) and the relevant public health authority for a zoonotic diseases such as rabies, all need to be contacted and kept well informed as to the progress of the case."
        },
        {
            "text": "These communications are established as soon as investigations are initiated, to make sure that everything is in place in good time in case testing yields a positive result."
        },
        {
            "text": "APHA physically investigated 3 rabies suspect cases in 2020 and 4 so far in 2021. We were able to rule out several more over the telephone based on history alone. Fortunately, all cases investigated were negative, but the risk is there, and all reports are taken seriously. We have to be prepared and ready to respond to the rare report for which identification and rapid action could stop rabies re-emerging again in Great Britain."
        }
    ]
}