{
    "url": "https://ukhsa.blog.gov.uk/2021/09/28/how-can-public-health-nurses-help-deliver-the-healthy-child-programme-this-winter/",
    "title": "How can public health nurses help deliver the Healthy Child Programme this winter?",
    "authors": [
        "Wendy Nicholson"
    ],
    "categories": [
        "Coronavirus (COVID-19)",
        "health visitors",
        "Nursing"
    ],
    "pub_date": "2021-09-28T10:34:48+01:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "This blog considers the challenges to children’s health this winter, and the ways in which health visitors and school nurses as clinicians and leaders of local services can advise and support families and young people to protect their health as part of the Healthy Child Programme."
        },
        {
            "heading": 2,
            "text": "Supporting families and communities"
        },
        {
            "text": "Health visitors and school nurses continue to be an essential part of the response to and recovery from the pandemic. They provide evidence-based clinical interventions and support families and communities through indirect impacts and ‘hidden harms’, especially among the most vulnerable and at-risk children and families."
        },
        {
            "text": "Throughout the pandemic health visitors and school nurses have found different ways of engaging with children and families to ensure delivery of the Healthy Child Programme has continued through all phases of COVID-19 restrictions."
        },
        {
            "text": "Winter is a time when we traditionally see many coughs and colds in children. This year some winter illnesses are peaking earlier as there has been limited mixing due to lockdown restrictions, which means children haven’t had the exposure to many of the viruses they normally would have. Health visiting teams and school nurses will play a vital role in ensuring parents are aware of these illnesses and will be well placed to promote and signpost parents to information to support their child’s health and wellbeing and how to protect others."
        },
        {
            "text": "As winter approaches, health visiting and school nursing services can use their clinical and public health expertise as well as their trusted relationships with children, families and communities to raise awareness of winter health issues and how to treat or prevent them. They can offer health promotion and prevention strategies including immunisations, such as the seasonal flu vaccine which comes in a painless nasal spray for school children. "
        },
        {
            "text": "One winter illness peaking early which health visitors and school nurses will be aware of is respiratory syncytial virus (RSV). Cases of RSV are higher than we would expect to see at this time of year as a result of fewer infections last winter due to the various COVID-19 restrictions in place. While still at low numbers, respiratory infections in young children are expected to rise as we go into the winter months."
        },
        {
            "text": "Most cases of RSV are mild and clear up within 2 to 3 weeks without the need for treatment, although some children have severe symptoms and may need to go to hospital. The early symptoms are similar to those of the common cold, such as a runny nose, a cough and a high temperature."
        },
        {
            "heading": 2,
            "text": "Preventing illness this winter"
        },
        {
            "text": "Here are some of the key prevention messages that will be really important in health visitors and school nurse’s family and clinical interventions over the winter:"
        },
        {
            "text": "As always, one of the most important pieces of advice health visitors and school nurses can pass on to parents is highlighting the importance of ensuring their child is up to date with their childhood vaccination programme. This programme provides vital protection to children and young people and results in indirect protection to those around them, including infants, older people, and those in clinical risk groups."
        },
        {
            "text": "In recent years, there has been a decline in the number of children getting important jabs such as their MMR vaccine, which protects against serious and sometimes life-threatening diseases including measles. This decline was exacerbated by the pandemic."
        },
        {
            "text": "As public health nurses, health visitors and school nurses have a vital role in winter planning, particularly during this early peak of unseasonal winter illnesses. Using their leadership, public health expertise and contacts with children and families, they can offer advice, guidance and reassurance whilst also support parents in ensuring children are healthy."
        },
        {
            "text": " "
        }
    ]
}