{
    "url": "https://disabilityunit.blog.gov.uk/2021/09/28/meet-the-new-minister-for-disabled-people-health-and-work-chloe-smith-mp/",
    "title": "Meet the new Minister for Disabled People, Health and Work: Chloe Smith MP",
    "authors": [
        "Chloe Smith MP"
    ],
    "categories": [
        "National Disability Strategy"
    ],
    "pub_date": "2021-09-28T13:03:57+01:00",
    "content": [
        {
            "text": "Chloe Smith MP was appointed the Minister for Disabled People, Health and Work in September 2021. Learn more about the Minister, her brief and the work of the Disability Unit."
        },
        {
            "heading": 2,
            "text": "Chloe Smith MP"
        },
        {
            "text": "I am delighted to be appointed as the new Minister for Disabled People, Health and Work. I am grateful to my predecessor, Justin Tomlinson MP, who leaves a significant contribution to the lives of disabled people through his work in helping to develop the National Disability Strategy."
        },
        {
            "text": "I am keen to build on this work, ensuring that the policies in the strategy are followed through and that we work together to develop new policies to transform disabled people’s everyday lives. Building on the National Disability Strategy will make the UK a place where disabled people can truly share opportunities and fully reach their potential to fully participate in our modern, forward looking society."
        },
        {
            "text": "The strategy was produced with the everyday experiences of disabled people at the heart of the process. The work we will continue to do will build on these lived experiences, and I will work closely with disabled people and their organisations."
        },
        {
            "heading": 2,
            "text": "My experience"
        },
        {
            "text": "I know that disability is broad and that different people will experience different impacts from their disabilities and health conditions. Having served as an MP for over a decade I’ve learned much from constituents and Parliament, and have a longstanding passion for helping disabled people, or those with health conditions, into work."
        },
        {
            "text": "Of course, I am keen to learn and broaden my understanding of disability beyond my personal, professional and family experience. I want to hear more of the lived experience of others, and make change happen."
        },
        {
            "text": "I’ve been very open about having had breast cancer in the last year. I’ve been lucky to make a full recovery and am grateful for the excellent NHS treatment and broader support I’ve had throughout. I was able and keen to carry on as normally as possible throughout, including by working in the job I love, but the challenges of this period have given me much to reflect on as I join the Department."
        },
        {
            "heading": 2,
            "text": "About Me"
        },
        {
            "text": "I’m proud to represent the people of Norwich North – I am from Norfolk and attended two comprehensive schools in West Norfolk, followed by York University where I studied English.   "
        },
        {
            "text": "I am an active charity volunteer and attempted Mt Kilimanjaro in 2006 to raise funds for the British Heart Foundation and Leukaemia Research, as well as taking fundraising challenges for charities in my constituency. I sit on the advisory board of the national Social Mobility charity, ‘Future First’, which works to broaden the horizons of children and young people by connecting them with past-pupils who have achieved successful careers and life outcomes.  "
        },
        {
            "text": "I am married with two young children who keep me busy alongside my work – if there’s any time spare I enjoy the arts and cycling."
        },
        {
            "text": "I have served as the Conservative MP for Norwich North since my election in July 2009, and have previously held various Ministerial positions including posts at the Treasury and Cabinet Office.  "
        },
        {
            "heading": 2,
            "text": "Minister for Disabled People, Health and Work"
        },
        {
            "text": "In my role as Minister, my responsibilities include:"
        },
        {
            "heading": 2,
            "text": "What’s next? "
        },
        {
            "text": "I am keen to work with disabled people and their organisations to continue the conversation the National Disability Strategy has started. There is still work to be done to level up and create a fairer society with equal opportunities for all.  "
        },
        {
            "text": "We can only do that if we work together to ensure that all disabled people, wherever they live across the UK and whatever their backgrounds, have better educational opportunities, better housing, better transport, better jobs and better support to help to achieve their incredible potential. "
        }
    ]
}