{
    "url": "https://gds.blog.gov.uk/2021/09/28/podcast-collecting-information-from-users/",
    "title": "Podcast: Collecting information from users",
    "authors": [
        "The GDS Team"
    ],
    "categories": [
        "People and skills",
        "Podcast",
        "Service design",
        "Transformation",
        "User research",
        "Ways of working"
    ],
    "pub_date": "2021-09-28T11:44:09+01:00",
    "content": [
        {
            "text": "In this month’s episode of the Government Digital Service (GDS) Podcast, we’re joined by Harry Vos and Moyosore Kolawole from GDS’s Collecting Information From Users team to talk about tackling the long-tail of PDF forms in government."
        },
        {
            "text": "As you might expect, many government services use forms to collect information from their users. But did you know that the number of PDF or other document-based forms hosted on GOV.UK is growing by approximately 6% per year?"
        },
        {
            "heading": 2,
            "text": "Making government forms accessible, easy to use and fast to process"
        },
        {
            "text": "Typically, these forms are inaccessible, hard to use and slower to process compared to online forms. That’s why a team at GDS is exploring options for a new common form-building platform for government."
        },
        {
            "text": "Working in close partnership with operations teams, policy teams and the cross-government form-building community, GDS hopes to create an affordable way for lower transaction services to quickly create accessible online forms."
        },
        {
            "text": "We’re also joined by Suzanne Mycock from the Home Office who is contributing to GDS’s user research. Suzanne, who works in a non-digital team that provides services to a small number of users, tells us about the difficulty her team faces when trying to create, and interpret, forms with limited software options and little design experience."
        },
        {
            "heading": 2,
            "text": "Get involved"
        },
        {
            "text": "We want policy teams to join our research panel and help us by testing prototypes and taking part in user research interviews."
        },
        {
            "text": "If you build or publish forms on GOV.UK as PDFs or other document formats - please get in touch. Our team would love to hear more about:"
        },
        {
            "text": "If you don’t work on forms directly, but know other people who do, why not share this post or connect us?"
        },
        {
            "heading": 2,
            "text": "Subscribe to our podcast"
        },
        {
            "text": "You can subscribe to the GDS Podcast on Spotify, Apple Podcasts and all other major podcast platforms. You can read a transcript of the podcast on Podbean."
        }
    ]
}