{
    "url": "https://aphascience.blog.gov.uk/2021/09/28/tackling-rabies-around-the-world/",
    "title": "APHA’s vital international outreach helps to tackle rabies around the world",
    "authors": [
        "Flavie Vial",
        "Anna La Rocca"
    ],
    "categories": [
        "Viral diseases"
    ],
    "pub_date": "2021-09-28T09:00:46+01:00",
    "content": [
        {
            "text": "This year marks the GARC (Global Alliance for Rabies Control) 15th World Rabies Day, a global day of action dedicated to rabies prevention with the aim to eradicate dog-mediated human rabies by 2030."
        },
        {
            "text": "Rabies is considered a major communicable disease threat to animal and human health. The disease has one of the highest case-fatality rates of any infectious disease once clinical signs have appeared. The majority of rabies cases in animals and humans occur in sub-Saharan Africa, on the Indian sub-continent and in South-East Asia, but the disease is under-reported in many rabies-endemic countries.  "
        },
        {
            "heading": 3,
            "text": " APHA and Rabies"
        },
        {
            "text": "Dr Anna La Rocca, Dr Flavie Vial and Prof. Anthony R. Fooks, disease experts from APHA, report that APHA’s International Reference Laboratory is actively involved in delivering global outreach programmes in countries where rabies is present, as part of its remit as an OIE (World Animal Health Organisation) reference laboratory and WHO (World Health Organisation) Collaborating Centre for rabies."
        },
        {
            "text": "The twinning projects helps to build diagnostic capability, which meets internationally recognised (OIE) standards in strategically positioned laboratories. Previous successful twinning projects have supported the establishment of an OIE recognised reference laboratory in both China and in India. The international team, led by APHA’s Prof. Anthony Fooks, is now undertaking a similar mission in Sierra Leone."
        },
        {
            "text": "Here we share some of the twinning project achievements:"
        },
        {
            "heading": 4,
            "text": "APHA in China"
        },
        {
            "text": "An OIE Twinning Project began in 2009 with the Changchun Veterinary Research Institute (CVRI) from the People’s Republic of China Since 2012, it has provided technical assistance, support and international consultancy, effectively and actively carrying out the tasks assigned by the OIE and its regional representatives in Asia."
        },
        {
            "text": "The work undertaken at the institute, in collaboration with APHA, has supported national and regional issues, as well as engaging with other international scientists in support of the global elimination campaign of dog-mediated rabies. Additionally, with APHA’s support serological testing for measuring rabies-specific antibodies in animals was instigated at the Diagnostic Laboratory for Rabies (DLR) at CVRI."
        },
        {
            "heading": 4,
            "text": "APHA in India"
        },
        {
            "text": "In 2016, APHA began a twinning project with the KVAFSU-CVA Rabies Diagnostic Laboratory, Veterinary College, in Hebbal, Bengaluru, India, in collaboration with the Centers for Disease Control and Prevention (CDC) in Atlanta, Georgia, USA."
        },
        {
            "text": "Acting as joint parent laboratories, APHA and CDC addressed the following objectives of the OIE Twinning Project:"
        },
        {
            "text": "The twinning programme enabled the KVAFSU-CVA Rabies Diagnostic Laboratory to achieve a successful quality standard for diagnostic testing (ISO: IEC 17025 / 2017) in 2020 followed by its recognition as an OIE Reference Laboratory for rabies."
        },
        {
            "text": "This made a significant impact on rabies diagnosis and surveillance leading to evolving strategies for control of rabies in the Indian subcontinent, with support from APHA."
        },
        {
            "text": "Currently, the laboratory is acting as a focal point for animal rabies work and for training veterinarians in the South Asian Association for Regional Cooperation. In addition, the KVAFSU-CVA Rabies Diagnostic Laboratory engages closely with the National Institute of Mental Health and Neuroscience (NIMHANS), also based in Bangalore, India, which is responsible for testing of rabies in humans. Together, these two laboratories work together as a genuine One Health exemplar to eliminate rabies in the Indian subcontinent."
        },
        {
            "heading": 4,
            "text": "APHA in Sierra Leone"
        },
        {
            "text": "Rabies is one of the top five priority zoonotic diseases in Sierra Leone. The disease is endemic in the country and is estimated to cause over three human deaths per 100,000 human population annually with vulnerable populations such as children of less than 15 years of age being the most affected. The domestic dog is responsible for the transmission of over 99% of all cases of rabies in humans."
        },
        {
            "text": "The urgent need for laboratory support in rabies control led to our collaboration, in April 2021withthe Sierra Leone Central Veterinary Laboratory (CVL), in Teko, Makeni."
        },
        {
            "text": "The CVL was revamped and equipped with state-of-art modern instruments following support from the Food and Agriculture Organisation of the United Nations (FAO) through the Emergency Center for Transboundary Animal Diseases (ECTAD)."
        },
        {
            "text": "Under the twinning project, there will be technology and knowledge transfer from APHA, while ensuring compliance with OIE standards in the diagnosis of rabies as well as other laboratory processes and procedures."
        },
        {
            "text": "Apart from serving Sierra Leone, CVL Teko may in future serve as a reference centre for rabies diagnosis in the West African region."
        },
        {
            "text": "During the third virtual twinning meeting between APHA, FAO Regional Office for Africa and the CVL of Teko, Dr Mamadou Niang, the Regional Laboratory Expert for FAO ECTAD West and Central Africa, expressed his satisfaction on the progress of the project and on the commitment and engagement showed by APHA in handling the twinning project."
        },
        {
            "heading": 3,
            "text": "Recognition for APHA’s Professor Tony Fooks"
        },
        {
            "text": "The Rabies Hero Awards have been introduced by MSD Animal Health in order to raise the profile of rabies with the public. They are intended to recognise those who have worked to make a difference in the fight against this disease - those working in the field, those in research, those in the political field, those working with limited resources and so on."
        },
        {
            "text": "It is with great pleasure that we can announce APHA’s Prof. Tony Fooks as having recently been awarded this title ‘in recognition of his achievements as a passionate fighter for freedom from rabies, both internationally and in the UK.’"
        },
        {
            "text": "You can read more about Prof. Fooks’ award in the Rabies Hero Hall of Fame."
        },
        {
            "heading": 3,
            "text": "Find out more"
        },
        {
            "text": "If you’d like to find out more about the work of APHA, please do take a look at the following (or ask us for copies):"
        },
        {
            "text": "Drew, T.W. and C. Tu (2014). OIE twinning programme for rabies: capacity-building in China. OIE Bulletin 3; 76-78."
        },
        {
            "text": "Mansfield, K.L., Banyard, A.C., Fooks, A.R., Franka, R., Isloor, S. and A. Rahman (2016). Supporting rabies control in India. Veterinary Record 179; 296-97."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}