{
    "url": "https://defrafarming.blog.gov.uk/2025/10/03/working-together-for-water-51-projects-receive-share-of-11-million-fund/",
    "title": "Working together for water: 51 projects receive share of £11 million fund",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Farming across the UK",
        "flood risk and water pollution."
    ],
    "pub_date": "2025-10-03T09:06:30+01:00",
    "content": [
        {
            "text": "If a water company breaks the rules, for example by polluting rivers or letting out sewage illegally, it can be taken to court and fined. "
        },
        {
            "text": "Last year, the money collected from fines on water companies from April 2022 to October 2023  was invested into the £11 million Water Restoration Fund. "
        },
        {
            "text": "This initiative formed part of ongoing efforts to hold water companies to account and to restore rivers, lakes and seas."
        },
        {
            "text": "Grants were made available to support local projects."
        },
        {
            "text": "There were 2 types of grants: "
        },
        {
            "text": "We’re pleased to say that a total of 51 projects secured funding. Some projects are now supporting groups of farmers to work together across a whole river catchment area so that projects can deliver bigger benefits than individual farms working alone. "
        },
        {
            "heading": 3,
            "text": "Successful delivery projects"
        },
        {
            "heading": 3,
            "text": "Successful development projects"
        },
        {
            "text": "These projects will bring rivers and landscapes back to life by using nature-based solutions. That could mean re-meandering rivers so they flow more naturally, restoring wetlands and other water-dependent habitats, or removing barriers so that fish can move freely. "
        },
        {
            "text": "Communities benefit when water companies are held to account, with better access to blue and green spaces. "
        },
        {
            "text": "Alongside this, some projects are testing out new technology to help them go further: using tools like data analysis, artificial intelligence, mapping software and remote sensing to guide and measure their work. "
        },
        {
            "heading": 2,
            "text": "Project spotlight: Swaledale & Wensleydale Environmental Farmers  "
        },
        {
            "text": "Swaledale & Wensleydale Environmental Farmers (SWEF), is a group of farmers and moorland managers working together across the upper catchments of the Swale and Ure rivers, covering 85,000 hectares. "
        },
        {
            "text": "Our goal is simple: to look after nature, tackle climate change, and improve water quality — all while keeping farming sustainable. "
        },
        {
            "text": "Working together means we can achieve more. By collaborating, we can restore and protect peatlands, enhance biodiversity, improve water quality, and manage our land in ways that help us move toward net zero carbon farming by 2040.  "
        },
        {
            "text": "At the same time, we’re exploring practical ways to make these actions financially viable and ensure farmers are rewarded for delivering these environmental benefits. "
        },
        {
            "text": "We also care about our communities. Integrating the social and cultural aspects of farming into our projects helps connect people with the land and with each other, while raising awareness about the importance of protecting our natural environment. "
        },
        {
            "text": "It starts with mapping. By creating a baseline of current land and water management, we can see what’s working well and where there might be opportunities to improve. "
        },
        {
            "text": "This approach isn’t just paperwork. It’s a way to make practical, targeted improvements that benefit both the farm and the wider landscape. "
        },
        {
            "text": "We’ve been building on methods used in National Lottery Heritage Fund projects, which let farms work together while keeping things consistent and based on best practice. "
        },
        {
            "text": "Experts including Jennie Stafford from the Game and Wildlife Conservation Trust and Abigail Mace from the Yorkshire Dales Rivers Trust have provided invaluable guidance, helping shape the work and plan the next steps. "
        },
        {
            "text": "The first of 8 individual farm plans is now in place. Stuart Raw, a farmer and ex-drystone waller from Castle Bolton, has worked closely with the project team, bringing an open and adaptive approach to potential plans on his farm. "
        },
        {
            "text": "The next step is to develop these plans into fully costed projects, creating practical templates for future work. Each plan is tailored to the farm’s unique needs, supporting productivity and environmental stewardship while ensuring farmers are fairly rewarded for delivering positive changes across the landscape. "
        },
        {
            "text": "Practical fieldwork is now underway. To improve soil structure, water infiltration, and pasture productivity we’re testing interventions.  "
        },
        {
            "text": "We’ve flown a high-resolution LiDAR survey, which uses light pulses to create detailed 3D maps of the landscape to monitor the surface impact, and after upcoming farmer training, detailed measurements of soil permeability, moisture, and compaction will begin to assess how well the interventions are working. "
        },
        {
            "text": "Training is an important part of the project. A number of sessions with Dr Nick Chappell from Lancaster University will help farmers build the skills to track progress and monitor the hydrological effects of the interventions they make. We want to create a local understanding of soil and water management, helping farmers to see what works and why. "
        },
        {
            "text": "We selected the site for the first new wetland scrape, and this has been installed. A scrape is a shallow depression constructed to fill with water at certain times of the year, forming a temporary pond or pool. Hydrological monitoring equipment has been set up alongside an existing scrape, providing data to optimise future scrape designs. It will also help us to understand how interventions affect water flow and quality.  "
        },
        {
            "text": "It’ll be possible to measure how well aeration works, by collecting solid data on how water moves through the soil, how wet it is, and how compacted it becomes. Community engagement is another important part of our work. At the Reeth and Wensleydale agricultural shows, farmers and visitors had the chance to explore monitoring equipment and learn more about water management. "
        },
        {
            "text": "Building on this enthusiasm, our plans include 2 water-testing campaign days to measure dissolved organic carbon, nitrate and turbidity (clarity of water) upstream and downstream of different interventions. "
        },
        {
            "text": "Thank you to all the farmers, professionals, and volunteers for their continued support."
        },
        {
            "heading": 2,
            "text": "Get in touch "
        },
        {
            "text": "If you’re working on a Water Restoration Fund project with farmers and would like to share your story on the Farming blog, leave a comment below and we’ll be in touch. "
        }
    ]
}