{
    "url": "https://ipa.blog.gov.uk/2023/03/08/1215/",
    "title": "A day in the life - IPA Communications Team",
    "authors": [
        "Laura Hanson"
    ],
    "categories": [
        "Communications",
        "Project Delivery"
    ],
    "pub_date": "2023-03-08T14:38:04+00:00",
    "content": [
        {
            "text": "Laura Hanson tells us about a typical day as a Communications Advisor and why she chose to work in government communications."
        },
        {
            "text": "I am a Communications Advisor at the Infrastructure and Projects Authority (IPA), and joined just under a year ago in May 2022. My team ensures that the IPA is delivering effective and high-quality communications, to external audiences such as the public through the media, construction industry, professional bodies, cross-government departments and internal audiences. "
        },
        {
            "text": "What is a Communications Advisor?"
        },
        {
            "text": "As Communications Advisor, my role is to support the IPA Head of Communications with all related activity. My role is fairly unique in that I get to work across a range of communications strands including: delivering engaging social media and digital content, developing strategic communications plans, supporting event management, working with the media and driving effective internal communications."
        },
        {
            "text": "Why did you choose communications? "
        },
        {
            "text": "I previously worked at DWP, where I took part in a career mentoring programme. My mentor supported me in finding a new role within the Civil Service that aligned with my experience. Having a degree in marketing and branding and experience in the PR sector, I already had many transferable skills within communications and felt I would be suited to this type of role. "
        },
        {
            "text": "What I like about communications is that no week is the same and we are always working on something new, which keeps it exciting and fast paced. "
        },
        {
            "text": "Describe a typical day? "
        },
        {
            "text": "I wake at 6.30am, before heading to the gym for an hour - I find this sets me up for the day. "
        },
        {
            "text": "Post gym I head home and get ready for work. On this day, I was working from the office. I am Birmingham based and my home office is located on Stephenson Street just outside New Street Station. At the IPA, we are moving away from being London centric and towards having more regional office locations - reflecting the diverse range of locations that projects and programmes we deliver are based in. "
        },
        {
            "text": "My working day began with daily media monitoring, checking for any important press coverage from the day before and looking through our social media channels for any IPA mentions. I then had a comms catch up with Nick Smallwood, IPA Chief Executive Officer to discuss and brief him on his upcoming events and media opportunities. "
        },
        {
            "text": "Part of my role is commissioning and editing blogs written by IPA colleagues to post on gov.uk. This particular week we were due to post a blog on a site visit to Sellafield - the highest hazard nuclear facility in Europe. Which meant managing the approval process between the project's parent department, site team and the IPA to ensure it was gov.uk ready. I then ensured the final draft of the blog was ready to post along with a LinkedIn caption. "
        },
        {
            "text": "The most part of my day was spent recording three episodes of the internal IPA podcast ‘The People Project’. This is something I have been working on, alongside our Digital Manager Paul Mayes, since October 2022, as part of the IPA internal communications campaign. The podcast aims to create a more joined up and collaborative IPA by offering colleagues the opportunity to talk about their career journey and personal experiences. In turn we gain a better understanding of the individual behind the role/screen, following a period where we were all working from home and had limited opportunities to connect. In turn, this filters down into delivering a better service for our stakeholders, because of higher quality information sharing and cross-team working. "
        },
        {
            "text": "We have the Government Project Delivery Profession Awards 2023 coming up and as part of the lead up to the event, I have been posting content on the Project Delivery Profession (run by the IPA) LinkedIn page, reflecting the awards communications plan. So, before heading home, I created a draft post ready to share the following day. We have some amazing projects nominated this year including: The Maritime Multi-Link Programme (Royal Navy), Sustainable Farming Incentive (Defra) and Birmingham 2022 Commonwealth Games (DCMS)."
        },
        {
            "text": "What’s the best thing about working for the IPA?"
        },
        {
            "text": "Working at the IPA, I feel privileged to be involved with such a range of major projects and programmes that you wouldn’t have the opportunity to outside of government - while also feeling like you are making a positive difference.  "
        },
        {
            "text": "I have also gained a wealth of knowledge since working in government communications. The IPA is full of talented people and developing my learning, and listening to their experiences has been incredibly valuable. "
        },
        {
            "text": " "
        },
        {
            "text": "Does a role in communications appeal to you? The IPA Function, Profession & Standards (FP&S) team are recruiting a Project Communications and Engagement Manager. Click here to find out more. "
        },
        {
            "text": "To learn more about the IPA, click here. "
        },
        {
            "text": "Find the IPA LinkedIn page here. "
        }
    ]
}