{
    "url": "https://mojdigital.blog.gov.uk/2023/03/08/celebrating-international-womens-day-around-the-organisation-at-justice-digital/",
    "title": "Celebrating International Women’s Day around Justice Digital",
    "authors": [
        "Sumiti Hamilton"
    ],
    "categories": [
        "a great place to work",
        "International Women's Day",
        "Women in Tech"
    ],
    "pub_date": "2023-03-08T09:52:14+01:00",
    "content": [
        {
            "text": "We are celebrating International Women’s Day! Learn what women around the organisation have to say about their experiences here."
        },
        {
            "text": "Yasmin Jones - Software Developer"
        },
        {
            "text": "I studied forensic science at university but found the transferable skills, attention to detail and methodological thinking I acquired to have been imperative in my developer journey here! I am proud to be a woman in tech working for Justice Digital."
        },
        {
            "text": "Abby Wade - Operations & Delivery"
        },
        {
            "text": "When I was 16 I worked in a pub for 5 years, working my way up to management. I decided not to go to university in and instead learned everything I could in my role to have the skills to eventually leave. I joined the Civil Service as the Office Manager for the Sheffield Studio back in February 2020 and have not looked back! I am so proud to call myself a woman in tech here at Justice Digital!"
        },
        {
            "text": "Salimah Chowdhury - Business Support Manager"
        },
        {
            "text": "Being a woman in tech to me means breaking stereotypes and increasing influence. It means permeating the female voice and impact through a sector which does not see or hear much of it and filling the gap in the digital world that calls for us."
        },
        {
            "text": "Sumiti Hamilton - Interaction Designer"
        },
        {
            "text": "When I first began my career as a woman in tech I had no digital art experience. At Justice Digital I was able to use my learning and development allowance for design training. I had a brilliant female mentor and coach who created a plan of learning activities to cover the different skills I would need to learn as an Interaction Designer. My dream career has now become a reality!"
        },
        {
            "text": "As Justice Digital we are always looking for women in tech to join the team. Why not take a look here for our open positions!"
        }
    ]
}