{
    "url": "https://companieshouse.blog.gov.uk/2023/03/08/closing-the-gender-pay-gap-at-companies-house/",
    "title": "Closing the gender pay gap at Companies House",
    "authors": [
        "Michelle Wall - Director of Finance"
    ],
    "categories": [
        "People and culture",
        "Personal blog posts",
        "Working at Companies House"
    ],
    "pub_date": "2023-03-08T13:32:11+00:00",
    "content": [
        {
            "text": "As executive diversity champion and chair of the Companies House equality, diversity and inclusion (EDI) steering group, it’s no surprise that I’m passionate about making sure equality and inclusivity remain at the heart of everything we do. But the commitment to ensuring fair treatment and reward for all isn’t just mine; it’s a key theme within our EDI strategy and a shared goal to deliver effective change for everyone at Companies House. As we look to celebrate this year’s International Women’s Day, it feels like a good time to reflect on one area we’re continuing to work on - our gender pay gap. "
        },
        {
            "heading": 2,
            "text": "What is the gender pay gap? "
        },
        {
            "text": "The gender pay gap is the difference between the average earnings of men and women, expressed relative to men’s earnings. In April 2017, gender pay gap reporting regulations were introduced. These require all employers of 250 or more employees to publish and report specific figures about their gender pay gap each year. The idea behind the reporting was to narrow and eventually eliminate pay differences between men and women.    "
        },
        {
            "heading": 2,
            "text": "The gender pay gap at Companies House "
        },
        {
            "text": "As our most recent report shows, in 2021 we had a mean pay gap of 12.3% (down from 13.6% in 2020) and a median pay gap of 20.4% (same as our 2020 figure). Mean is the average in the data set, and median is the middle number in the data set. "
        },
        {
            "text": "This pay gap is largely driven by an uneven gender split by grade across our organisation. Although 4 of our 7 most senior employees are women, including our chief executive and myself as director of finance and commercial, we have a significant number of women employed in the band B (administrative officer) grade, which results in a higher proportion of female employees in our lower and lower middle quartiles. In the upper middle quartile, we have a 50/50 split of men and women, and in the upper quartile the breakdown is 40.4% female and 59.6% male. "
        },
        {
            "text": "We’ve previously researched why there’s a lack of progression to higher roles from women in our band B grade and feedback included a perception that working part-time limited opportunities for promotion, alongside a lack of confidence or a perceived unlikelihood of success preventing them from applying for a promotion. The potential loss of government-paid benefits following promotion also came through.  "
        },
        {
            "text": "As a result of these findings, we’ve put a series of measures in place focusing on demonstrating that working part-time or using other flexible working patterns isn’t a barrier to progressing through the organisation. I’m proud to be a visible role model for other women, and that includes sharing my own career journey to help dispel negative perceptions. I worked part-time when my children were young but successfully progressed from a senior executive officer to a grade 6, and only went full-time when I took on my executive board role.  "
        },
        {
            "text": "Our post-pandemic shift to a hybrid working model, where we’re now working both at home and in the office, is also helping to open up more opportunities, giving people even more flexibility and ultimately a better work-life balance. "
        },
        {
            "heading": 2,
            "text": "Closing the gap "
        },
        {
            "text": "There’s no denying our gender pay gap, but we’re fully committed to doing as much as we can to reduce it. Over the last few years, we’ve continued to introduce positive actions and initiatives that will help us achieve this and move us closer to our overarching goal of creating a ‘culture that enables our brilliant people to flourish and drives high performance’.  "
        },
        {
            "text": "Some of the positive actions we’ve taken to help close the gap include:  "
        },
        {
            "text": "We also have 23 active people-led networks, including a women’s network and a working family network, and they really are making a huge difference to our organisational culture. They provide sound opportunities for self-development and for delivering improved performance and user experiences right across our organisation. They also importantly provide a safe place where differences are celebrated, new ideas are embraced, and people feel supported to do their best work and have a sense of belonging. "
        },
        {
            "text": "The gender pay gap in Companies House is complex and while there’s no quick fix, we're making progress. Over the next year, our EDI steering group will be developing a Gender Pay Gap Action Plan as we recognise that robust actions, which hold us to account, are needed to allow all our staff to feel supported and to flourish within the organisation. It’s our organisational goal to be more inclusive, more diverse and an organisation that people want to work for and we’re on a mission to get us there! "
        }
    ]
}