{
    "url": "https://deframedia.blog.gov.uk/2023/03/08/coverage-of-operator-self-monitoring/",
    "title": "Coverage of Operator Self Monitoring",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "water"
    ],
    "pub_date": "2023-03-08T15:07:01+00:00",
    "content": [
        {
            "text": "There has been coverage in i News on Operator Self Monitoring - the process introduced in 2009 by which water and sewerage companies must notify the Environment Agency if they are in breach of their permit conditions."
        },
        {
            "text": "It incorrectly implies Operator Self Monitoring is the only way EA checks that water companies are complying with their permits – this is not the case. EA also does its own monitoring and on-site inspections, both announced and unannounced."
        },
        {
            "text": "Operator Self-Monitoring was introduced in 2009 alongside guidance on Environment Agency inspections. The use of operator self-monitoring brings water and sewerage companies in line with other industries which have been monitored in this way for many years e.g. waste and chemical sectors. Under the polluter pays principle, they should also be the ones paying for it."
        },
        {
            "text": "In 2019 the EA increased, not decreased, its regulatory scrutiny of sewage treatment works to include auditing, data analysis and other interventions as well as inspections. This removed the outdated inspection guidance and replaced it with action to use a wider range of regulatory tools. This increases the level of scrutiny, rather than reduces it."
        },
        {
            "text": "We have placed new requirements on water companies to significantly increase their monitoring and reporting so that pollution data is available to all. We have also launched a major investigation into possible unauthorised spills at thousands of sewage treatment works - we will always seek to hold those responsible for environmental harm to account."
        },
        {
            "text": "An Environment Agency spokesperson said: "
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}