{
    "url": "https://food.blog.gov.uk/2023/03/08/equity-equality-and-veterinary-services-on-international-womens-day/",
    "title": "Equity, equality and veterinary services on International Women's Day",
    "authors": [
        "Jane Clark, Director of Veterinary Services"
    ],
    "categories": [
        "People"
    ],
    "pub_date": "2023-03-08T09:48:49+00:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "On International Women's Day, Jane Clark our Director of Veterinary Services shares her journey to the top of her profession and how the fight for equity continues."
        },
        {
            "text": "Let me introduce myself: I am a farmer’s daughter, from Yorkshire, and the granddaughter of a butcher – that was my grandmother in a real example of women breaking down cultural barriers. I am now the Director of Veterinary Services in the FSA. I live with my “feline supervisor”, Willow, in Cardiff – a little more from her later."
        },
        {
            "text": "It, therefore, seemed obvious that I could achieve my childhood ambition to be a vet. I was good at exams and science, and I had all the family connections to spend time working with vets and animals in my childhood. Now that is not to say it was “easy”, because getting a place at vet school is highly competitive, but I know that I was lucky to have so many of these unearned advantages."
        },
        {
            "text": "That is also why I am so delighted to be asked to write this blog for International Women’s Day and why I fully #EmbraceEquity. I also confess to not feeling as eloquent and engaging in my writing as previous authors (who I suspect may have degrees in the arts or humanities?) but I will try to counter that lack of confidence with a scientific approach and a talented proofreading and editing team!"
        },
        {
            "heading": 2,
            "text": "So what is Equity?"
        },
        {
            "text": "The first thing I did was to look at my trusty Griffin Savers dictionary (that really tells you my age because it was my first bank account with the Midland Bank, now HSBC) and that says: “equity (ek-wi-ti) n. fairness, impartiality.”"
        },
        {
            "text": "Great! A really concise and clear way of defining a word but what does it mean in action for society?"
        },
        {
            "text": "I also took the opportunity to follow up by reading the article “Equality versus Equity: What's the difference as we #EmbraceEquity for IWD 2023 and beyond?” on the International Women’s Day website. This explained the linguistic and legal roots and differences between equality and equity and also defined equality and equity in a social context:"
        },
        {
            "text": "“Equality means each individual or group of people is given the same resources or opportunities.”"
        },
        {
            "text": "“Equity recognizes that each person has different circumstances, and allocates the exact resources and opportunities needed to reach an equal outcome.”"
        },
        {
            "text": "Equity means providing different resources to different people to achieve those fair outcomes. This also reminds me of the advantages I had in pursuing my vocation and that this goes well beyond just getting a place in vet school…"
        },
        {
            "heading": 2,
            "text": "So why am I, a vet, writing about #EmbraceEquity?"
        },
        {
            "text": "It might not surprise you to know that we are not a very diverse profession, but did you know that 2019 data shows that 58% of vets in the UK are women?"
        },
        {
            "text": "The Royal College of Veterinary Surgeons’ demographic data also shows that well over half of our profession attended private or independent schools which also suggests we have a long way to go to achieve equity in our profession."
        },
        {
            "text": "Now, even more women are joining our profession as new graduates so you would think we had the equity thing all sorted, wouldn’t you?"
        },
        {
            "text": "Well, I am afraid not – in 2018 the British Veterinary Association and the University of Exeter collaborated on a research project that looked at how two vets (Mark and Elizabeth), with identical jobs and performance reviews, were treated in terms of their pay. Many of the managers rated “Mark” as more competent and said they would pay him a higher salary which would have resulted in an average 8% gender pay gap. Sadly, one of the key drivers in this difference was whether the managers thought bias still existed in the profession, and it was the managers who recognised that it did, who recommended roughly equal pay for “Elizabeth”."
        },
        {
            "heading": 2,
            "text": "So can we make a difference?"
        },
        {
            "text": "Yes! And, as the study above shows, it is vital to keep talking about these challenges to raise awareness and deliver equity in practice."
        },
        {
            "text": "I have now worked as a vet for almost 30 years (shush! don’t tell anyone) and have been fortunate to have an interesting and varied veterinary career. This started with a postgraduate project in Oman, before working in general practice in the UK, New Zealand and Hong Kong, and studying veterinary acupuncture before working as a Temporary Veterinary Inspector for the then State Veterinary Service (SVS) during the 2001 foot and mouth disease outbreak."
        },
        {
            "text": "This was an important career moment for me because I saw the important role that vets play in government and that the Civil Service is an employer that really works hard to challenge bias."
        },
        {
            "text": "Since then, I have worked in Defra and the Animal and Plant Health Agency in the operations, policy, veterinary and science directorates. This has included working as:"
        },
        {
            "text": "Here, I have benefitted from our “OWOW” (Our Ways of Working) offer that has been deservedly recognised outside the civil service, winning a workingmums.co.uk’s Top Employer Award for Innovation in Flexible Working in 2020. For me, this meant I could work from Cardiff rather than having to move to London for my new role."
        },
        {
            "text": "And something must be going right – I am so proud to be part of our amazing Government Veterinary Services profession. I’m also proud that until recently, three of our four Chief Veterinary Officers in the United Kingdom were women."
        },
        {
            "text": "So, I believe that an important part of my role now is to supply some of the “books to stand on” so that we can all achieve our potential, regardless of our gender or background. In delivering this, I am also privileged to be the current president of the European Association of State Veterinary Officers and work with amazing veterinary colleagues from all over Europe."
        },
        {
            "text": "I’ll also cheekily take this opportunity to share the Federation of Veterinarians of Europe – United in Diversity campaign - watch out for my and Willow’s video on “Diversity, Equity and Inclusiveness” which will be released in a few weeks’ time."
        },
        {
            "heading": 1,
            "text": "Tegwch, cydraddoldeb a gwasanaethau milfeddygol ar Ddiwrnod Rhyngwladol y Menywod"
        },
        {
            "text": "Gadewch i mi gyflwyno fy hun: Merch fferm ydw i, o Swydd Efrog, ac wyres i gigyddes. Roedd fy nain yn enghraifft go iawn o ferched yn chwalu rhwystrau diwylliannol. Fi bellach yw Cyfarwyddwr Gwasanaethau Milfeddygol yr Asiantaeth Safonau Bwyd (ASB). Rwy'n byw gyda fy nghath, Willow, yng Nghaerdydd – cewch glywed ychydig yn fwy ganddi nes ymlaen."
        },
        {
            "text": "Nid oes syndod felly mai fy uchelgais pan oeddwn i’n blentyn oedd bod yn filfeddyg, ac ymddengys yn amlwg i mi y gallwn gyflawni’r uchelgais honno. Roeddwn i’n un da am arholiadau a gwyddoniaeth, ac roedd gennyf ddigon o gysylltiadau teuluol i allu treulio amser yn gweithio gyda milfeddygon ac anifeiliaid drwy gydol fy mhlentyndod. Nawr, nid yw hynny'n golygu y bu’n “hawdd” i mi, oherwydd bod ennill lle i astudio milfeddygaeth yn y brifysgol yn hynod gystadleuol. Serch hyn, rwy’n gwybod fy mod i’n ffodus i gael y pethau hyn o’m plaid."
        },
        {
            "text": "Dyna pam roeddwn mor falch o gael fy ngofyn i ysgrifennu'r blog hwn ar gyfer Diwrnod Rhyngwladol y Menywod a pham rydw i'n #CofleidioTegwch yn frwd. Rwy’n cyfaddef nad wyf yn teimlo fy mod yn ysgrifennu mor huawdl a gafaelgar ag awduron blaenorol (mae’n rhaid bod ganddynt raddau yn y celfyddydau neu’r dyniaethau?). Ond fe wnaf geisio wneud yn iawn am y diffyg hyder drwy fy agwedd wyddonol a thrwy fanteisio’n llawn ar ddoniau’r tîm golygu a phrawfddarllen!"
        },
        {
            "text": "Felly beth yw Tegwch?"
        },
        {
            "text": "Y peth cyntaf a wnes i oedd edrych ar fy hen ffrind, geiriadur Griffin Savers (dwi wir yn datgelu fy oedran nawr, oherwydd ces i hwn drwy fy nghyfrif banc cyntaf gyda Midland Bank, neu HSBC erbyn hyn) ac mae hynny'n dweud: “equity (ek-wi-ti) n. fairness, impartiality.”"
        },
        {
            "text": "Gwych! Ffordd wirioneddol gryno a chlir o ddiffinio gair, ond beth mae’n ei olygu’n ymarferol i gymdeithas?"
        },
        {
            "text": "Yn ogystal, darllenais yr erthygl “Equality versus Equity: What's the difference as we #EmbraceEquity for IWD 2023 and beyond?” ar wefan Diwrnod Rhyngwladol y Menywod. Roedd yn egluro’r gwreiddiau ieithyddol a chyfreithiol a’r gwahaniaethau rhwng cydraddoldeb a thegwch. Roedd hefyd yn diffinio cydraddoldeb a thegwch mewn cyd-destun cymdeithasol:"
        },
        {
            "text": "“Equality means each individual or group of people is given the same resources or opportunities.”"
        },
        {
            "text": "“Equity recognizes that each person has different circumstances, and allocates the exact resources and opportunities needed to reach an equal outcome.”"
        },
        {
            "text": "Mae tegwch yn golygu darparu gwahanol adnoddau i wahanol bobl er mwyn iddynt allu cyflawni'r canlyniadau teg hynny. Mae hyn hefyd yn fy atgoffa o’r manteision oedd gen i wrth ddilyn fy ngalwedigaeth, a bod hyn yn mynd ymhell y tu hwnt i gael lle i astudio milfeddygaeth yn y brifysgol…"
        },
        {
            "text": "Felly pam ydw i, milfeddyg, yn ysgrifennu am #CofleidioTegwch?"
        },
        {
            "text": "Efallai na fydd yn syndod i chi wybod nad ydym yn broffesiwn amrywiol iawn, ond oeddech chi’n gwybod bod data 2019 yn dangos bod 58% o’r milfeddygon yn y DU yn fenywod?"
        },
        {
            "text": "Mae data demograffig Coleg Brenhinol y Milfeddygon hefyd yn dangos bod ymhell dros hanner ein proffesiwn wedi mynd i ysgolion preifat neu annibynnol. Mae hyn yn dangos bod gennym lawer o le i wella o ran sicrhau tegwch yn ein proffesiwn."
        },
        {
            "text": "Erbyn hyn, mae hyd yn oed mwy o fenywod yn ymuno â'n proffesiwn fel graddedigion newydd, felly byddai’n hawdd credu nad oes unrhyw broblemau o ran tegwch."
        },
        {
            "text": "Ond, mae gen i ofn - dyw hynny ddim yn wir. Yn 2018 cydweithiodd Cymdeithas Milfeddygon Prydain a Phrifysgol Caerwysg ar brosiect ymchwil a edrychodd ar sut roedd dau filfeddyg (Mark ac Elizabeth), oedd yn gwneud yr un swydd ac oedd ag adolygiadau perfformiad union yr un fath, yn cael eu trin o ran eu cyflog. Dywedodd llawer o’r rheolwyr fod “Mark” yn fwy cymwys, ac y byddent yn talu cyflog uwch iddo. Byddai hyn wedi arwain at fwlch cyflog rhwng y rhywiau o 8% ar gyfartaledd. Yn anffodus, un o’r prif ffactorau yn y gwahaniaeth hwn oedd p’un a oedd y rheolwyr o’r farn bod rhagfarn yn dal i fodoli yn y proffesiwn. Roedd y rheolwyr a oedd yn cydnabod bod rhagfarn yn parhau i fodoli yn argymell rhoi cyflog cyfartal  ar y cyfan, i “Elizabeth”."
        },
        {
            "text": "A allwn ni wneud gwahaniaeth?  "
        },
        {
            "text": "Gallwn! Fel y dengys yr astudiaeth uchod, mae'n hanfodol ein bod yn parhau i siarad am yr heriau hyn er mwyn codi ymwybyddiaeth a sicrhau tegwch yn ymarferol."
        },
        {
            "text": "Rwyf wedi bod yn filfeddyg ers bron i 30 mlynedd (shhhh! Peidiwch â dweud wrth neb) ac wedi bod yn ffodus i gael gyrfa ddiddorol ac amrywiol yn y maes. Dechreuodd hyn gyda phrosiect ôl-raddedig yn Oman, cyn gweithio ym maes practis cyffredinol yn y DU, Seland Newydd a Hong Kong, ac astudio aciwbigo milfeddygol cyn gweithio fel Arolygydd Milfeddygol Dros Dro ar gyfer y Gwasanaeth Milfeddygol Gwladol (SVS) fel yr oedd ar y pryd, yn ystod y brigiad o glwy’r traed a’r genau yn ystod 2001."
        },
        {
            "text": "Roedd hon yn foment bwysig yn fy ngyrfa i, oherwydd gwelais y rôl bwysig y mae milfeddygon yn ei chwarae yn y llywodraeth. Gwelais hefyd fod y Gwasanaeth Sifil yn gyflogwr sy'n gweithio'n galed iawn i herio rhagfarn."
        },
        {
            "text": "Ers hynny, rwyf wedi gweithio yn Defra a'r Asiantaeth Iechyd Anifeiliaid a Phlanhigion yn y cyfarwyddiaethau gweithrediadau, polisi, milfeddygol a gwyddoniaeth. Mae hyn wedi cynnwys gweithio fel Pennaeth Cysylltiadau’r UE ar gyfer Iechyd a Lles Anifeiliaid yn Defra rhwng 2012 a 2015; fel yr Arweinydd Milfeddygol ar gyfer firoleg adar yn Labordy Cyfeirio Cenedlaethol y DU yn APHA, Weybridge; ac fel un o Arweinwyr Milfeddygol APHA yng Nghymru cyn dod i’r ASB yn 2018. Yma, rwyf wedi elwa ar ein trefniadau ‘Ein Ffyrdd o Weithio’ (OWOW) sydd yn cael eu cydnabod hyd yn oed y tu allan i’r gwasanaeth sifil, gan ennill Gwobr Cyflogwr Gorau workingmums.co.uk am Arloesedd o ran Gweithio Hyblyg yn 2020. I mi, roedd hyn yn golygu y gallwn weithio o Gaerdydd yn hytrach na gorfod symud i Lundain ar gyfer fy rôl newydd."
        },
        {
            "text": "Ac mae’n rhaid bod rhywbeth yn mynd yn iawn – rydw i mor falch o gael bod yn rhan o broffesiwn anhygoel Gwasanaethau Milfeddygol y Llywodraeth. Rwyf hefyd yn falch bod 3 o'n 4 Prif Swyddog Milfeddygol yn y Deyrnas Unedig yn fenywod, tan yn ddiweddar."
        },
        {
            "text": "Felly, rwy’n credu mai rhan bwysig o fy rôl i nawr yw helpu i baratoi’r ffordd, fel y gallwn oll gyflawni ein potensial, waeth beth fo’n rhyw neu’n gefndir. Wrth wneud hyn, mae’n fraint i mi hefyd nodi mai fi yw llywydd presennol Cymdeithas Ewropeaidd Swyddogion Milfeddygol Gwladol lle rwy’n cael gweithio gyda chydweithwyr milfeddygol anhygoel o bob rhan o Ewrop."
        },
        {
            "text": "Rwyf hefyd yn mynd i achub yn ddigywilydd ar y cyfle hwn i rannu ymgyrch Unedig mewn Amrywiaeth, Ffederasiwn Milfeddygon Ewrop - cadwch lygad am y fideo gen i a Willow ar “Amrywiaeth, Tegwch a Chynhwysiant” a fydd yn cael ei ryddhau ymhen rhai wythnosau."
        }
    ]
}