{
    "url": "https://environmentagency.blog.gov.uk/2023/03/08/improving-water-quality-in-the-river-ryton-worksop/",
    "title": "Improving water quality in the River Ryton, Worksop",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Environment Agency"
    ],
    "pub_date": "2023-03-08T10:15:11+00:00",
    "content": [
        {
            "text": "Chloe Hayes, Environment Monitoring Officer in the Environment Agency’s East Midlands area, explains how teams are working together to improve water quality in the River Ryton in Worksop, Nottinghamshire."
        },
        {
            "text": "Teams within the Environment Agency’s East Midlands area are working together on a ‘priority place’ project, focusing on the River Ryton, Nottinghamshire, and its tributaries: Anston Brook, Pudding Dyke, Oldcoates Dyke, Owlands Wood Dyke and Hodsock Brook. There are multiple challenges in the catchment relating to water quality, water resources and flood risk, but my focus here is on the water quality."
        },
        {
            "text": "I joined the Environment Agency in May 2022 as an Environmental Monitoring Officer. My role primarily involves analysing samples taken of the aquatic macroinvertebrate communities in the river. Each species of macroinvertebrate has its own tolerances or sensitivities to water quality and other habitat conditions such as sediment and flow velocity. Through identifying the species present, and their abundance, we can learn about the water quality of the river. Finding a higher number of species intolerant of pollution is indicative of good river health. Macroinvertebrates also act as a valuable food source for other animals such as fish, thus more diverse macroinvertebrate communities drive higher overall biodiversity. We also survey the river habitat and any aquatic/semi-aquatic plants found in the river channel to gather more data on the river quality, in particular pressures relating to nutrient enrichment and eutrophication (the process by which a body of water becomes progressively enriched with mineral and nutrients)."
        },
        {
            "text": "The River Ryton and its tributaries have had long-term issues with phosphates and nitrates and the catchment has been classified as a ‘priority place’ for improvement, as part of the Environment Agency’s long term ambition for healthy land, air and water. All six waterbodies within the catchment are failing in terms of chemical status and, in particular, phosphate is characterised as poor."
        },
        {
            "text": "The phosphate levels in the Ryton catchment are influenced largely by sewage discharge from sewage treatment works and transport drainage, with some influence from agricultural inputs. The area is a Nitrate Vulnerable Zone, meaning it is at risk from nitrate pollution. These nutrients can impact the local biodiversity and our ability to reach the ecological targets set by the Water Framework Directive (WFD). The WFD is a piece of legislation that we use to classify the quality of our rivers by using the biological communities e.g. invertebrates, plants."
        },
        {
            "text": "One of the aims of our local outcome plan on the River Ryton is to reduce the amount of nutrients within the water – focusing particularly on nitrate and phosphate – and to improve water chemistry in the catchment. We aim to do this by engaging as an organisation with local landowners and the operators of sewage treatment works to target and minimise potential nutrient inputs into the watercourse. Due to the limestone bedrock in some areas, any water entering the catchment passes through to the groundwater quickly, meaning improvements to the wider area can ultimately improve the groundwater and river quality."
        },
        {
            "text": "While we are at the early stage of the project, which will continue over the next two years until 2025, we have been working across our teams to identify the areas to target for improvement. We have deployed sondes in the area, which will be used alongside information gathered from walkovers along the catchment, to identify potential spots for future monitoring."
        },
        {
            "text": "A sonde is a probe which monitors water chemistry over a longer period of time (typically 2-3 weeks), taking measurements at regular intervals (typically every hour). They can take multiple measurements at once, such as temperature, pH, conductivity, turbidity, ammonium, dissolved oxygen and chlorophyll. Sondes allow us to have a clearer, longer-term picture of the river’s water quality, and how it may change on a daily and weekly cycle."
        },
        {
            "text": "Sondes were initially deployed and collected in late 2022. The information gathered from these sondes is allowing us to identify areas potentially impacted by the different pressures on the watercourse and helping us to identify the problem sites to target with regular water quality sampling. Additionally, we deployed water pressure sensors with the sondes which is helping us to assess flow changes around Worksop to help inform flood management. We are currently in the process of using the data to identify sites for further monitoring."
        },
        {
            "text": "Further monitoring could include surveying the plant communities, which involves wading up and down a stretch of the river and identifying the plant species found and estimating their cover. The information from these surveys can be used to identify areas where nutrient pressures are impacting the river and plant communities. Nutrient enrichment can cause an increase in competitive species and reduce the plant diversity in the river. Monitoring could also involve the sampling of invertebrates to highlight potential nutrient inputs from discharge points, in addition to any other potential pressures on the river such as excesses of fine sediment."
        },
        {
            "text": "We aim to start further monitoring in the next couple of months and continue into 2024, with the data collected continuing to inform our efforts for the next stages of the project. We will share our data with our external partners and landowners, working together to improve the nutrient levels and overall water quality in the catchment."
        }
    ]
}