{
    "url": "https://socialcare.blog.gov.uk/2023/03/08/international-womens-day-a-message-from-the-chief-nurse-for-adult-social-care/",
    "title": "International Women's Day: a message from the Chief Nurse for Adult Social Care",
    "authors": [
        "Deborah Sturdy"
    ],
    "categories": [
        "Care and support",
        "Communities",
        "Events",
        "Leadership",
        "Social care reform",
        "Workforce"
    ],
    "pub_date": "2023-03-08T10:59:02+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Why this day matters to social care"
        },
        {
            "text": "There are many hundreds of awareness raising days throughout the year, but International Women’s Day is certainly one of the most important to me, not least because around 80 percent of people working in the social care profession are women."
        },
        {
            "text": "There are many long standing societal and cultural reasons for this imbalance, which would take a whole other blog to unpick, but the fact women make up the majority of the care workforce, means they are also an incredibly diverse and talented group, by sheer force of numbers."
        },
        {
            "text": "Care colleagues possess wide ranging life experience, drawn from their many and varied backgrounds – a reflection of the communities they support. That’s why this year’s theme, #EmbraceEquity, is so important and relevant to the work I and others are doing to upskill and enhance care colleagues throughout England."
        },
        {
            "text": "In the case of our profession, this is not just about empowering women of all ethnicities, circumstances and backgrounds, but matching our resources and support with their particular needs and gifts."
        },
        {
            "text": "As the organisers point out on their campaign website, equality is essential, but equity is about more than being fair, it’s about making sure individuals receive the particular recognition, tools and training they need to thrive."
        },
        {
            "text": "One size does not fit all. We already know this for the residents and people we care for, across a variety of residential and domiciliary care settings, so why should we impose career straitjackets on the unique aspirations of our colleagues (or indeed those yet to join us)?"
        },
        {
            "heading": 2,
            "text": "The equity endeavour"
        },
        {
            "text": "In this spirit, I continue to focus on nurturing and encouraging leadership, especially among ethnic groups who have, for too long, been underrepresented."
        },
        {
            "text": "The launch, last year, of the Florence Nightingale Foundation’s first leadership programme for global majority social care nurses is a case in point. It is a demonstration of my and others' commitment to making social care nursing truly representative of the communities we serve."
        },
        {
            "text": "This year, I am incredibly excited about the social care nursing advisory councils, currently being developed in every integrated care board in England and chaired by some incredibly talented nurses, mostly women."
        },
        {
            "text": "These councils are another opportunity for our profession to make its voice heard and to share learning between social care nurses and our clinical counterparts in the NHS. Our advocacy of person-centred care is another professional focus which chimes well with International Women’s Day’s #EmbraceEquity theme."
        },
        {
            "text": "Looking further ahead, I am working hard to see us roll out more continuous professional development opportunities, delegated healthcare interventions and the enhanced care worker role. I’m confident 2023 and beyond will be a great year for women, for social care and for anyone needing the very best care and support."
        }
    ]
}