{
    "url": "https://grantscommunity.blog.gov.uk/2023/03/08/international-womens-day-women-in-commercial/",
    "title": "International Women’s Day: Women in Commercial",
    "authors": [
        "govtgrantscommunity"
    ],
    "categories": [
        "Civil Service",
        "Government Commercial Function",
        "Government Grants Management Function",
        "International Women's Day",
        "Learning and development"
    ],
    "pub_date": "2023-03-08T10:45:17+00:00",
    "content": [
        {
            "text": "The commercial side of the Civil Service has traditionally been a male-dominated environment.  So how can the sector learn from the experiences of its female leaders and positively impact the lives of women across the Civil Service?"
        },
        {
            "text": "We hear from Melinda Johnson, Commercial Director at Department of Health and Social Care and Sam Ulyatt, Chief Commercial Officer at the Home Office on their experiences and their advice on succeeding in the commercial sector and, also, your chosen profession."
        },
        {
            "text": "Melinda and Sam bring decades of experience to their current roles within the Civil Service and are both Fellows in the Chartered Institute of Procurement and Supply. They have worked in the private and public sector, including for internationally renowned companies.  Both identified four key themes to help women reach their potential in the workplace – education, culture, mindset and attracting and retaining talent."
        },
        {
            "text": "You can read their full interviews here. "
        },
        {
            "text": " "
        },
        {
            "text": "Offer opportunities for learning"
        },
        {
            "text": "Melinda and Sam feel passionate that education is key to success. Both had similar experiences, entering the commercial sector via apprenticeships and training programmes rather than more traditional routes. "
        },
        {
            "text": "For Melinda and Sam, having a growth mindset and being willing to learn continuously have been central to their career progression, as has their willingness to take on challenging roles. "
        },
        {
            "text": "Sam said:"
        },
        {
            "text": "Both advocate that, to succeed, women – and men – need to allow time for self-reflection. Sam remembers her days as an apprentice and draws on those early experiences to ensure that her apprentices now have space to grow."
        },
        {
            "text": " "
        },
        {
            "text": "Create supportive networks"
        },
        {
            "text": "For women to reach their full potential, they must have support both internally and externally. Allyship is key. "
        },
        {
            "text": "Sam has led gender equality initiatives in previous roles after experiencing a particularly negative workplace:"
        },
        {
            "text": "Melinda and Sam have built formal mentoring networks inside and outside the Civil Service, which they believe really helps personally in their careers. They both also mentor widely and are mentored themselves. "
        },
        {
            "text": " "
        },
        {
            "text": "Foster a positive mindset"
        },
        {
            "text": "A broad perspective from a range of experience in the public sector has helped Melinda and Sam greatly in their current roles, for bringing new ideas and championing women in their Professions."
        },
        {
            "text": "Melinda says:"
        },
        {
            "text": "Sam believes that all too often, women will look at a job description when applying for a role and feel they have to tick every box when – in reality – jobs often morph into different roles and responsibilities. A role in commercial suits inquisitive problem-solvers who like people and enjoy building relationships."
        },
        {
            "text": " "
        },
        {
            "text": "See it, believe it: attracting the best talent"
        },
        {
            "text": "While the Civil Service’s workforce diversity is largely in line with the wider UK population, there is a less diverse representation at senior level. This is a challenge attracting women to commercial roles and so championing them is key to helping address the diversity challenge at senior level."
        },
        {
            "text": "Sam believes that “If you see it, you can believe it”  citing the need for visible women in leadership roles to inspire others."
        },
        {
            "text": "For Melinda and Sam, it’s essential to get the work-life balance right for both them and their teams.  Melinda was a key advocate of remote working years before the Covid-19 pandemic. She was driven by wanting everyone to enjoy a successful work-life balance so they could reach their full potential."
        },
        {
            "text": "Ultimately, attracting and retaining talent comes down to senior leadership creating the right environment where everyone can thrive, regardless of their background, and leading by example."
        },
        {
            "text": "Don’t forget - you can read the full interviews here. "
        },
        {
            "text": " "
        },
        {
            "text": "Interested in a career in Commercial or Grants? "
        },
        {
            "text": "The Commercial and Grants Functions have developed competency frameworks that are a good place to start to understand the skills, experiences and attitudes for a career in these professions. "
        },
        {
            "text": "With your gov.uk email address, you can access the Grants Centre of Excellence for the grants competency framework."
        }
    ]
}