{
    "url": "https://educationhub.blog.gov.uk/2023/03/08/international-womens-day-2023-apprenticeships-t-levels-support-women-stem-careers/",
    "title": "International Women’s Day 2023: How apprenticeships and T Levels support women in STEM careers",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Apprenticeships",
        "STEM",
        "T Levels"
    ],
    "pub_date": "2023-03-08T12:31:33+00:00",
    "content": [
        {
            "text": "On International Women’s Day, we celebrate the achievements of women around the world. It’s also a moment to reflect on gender-based inequality and what we can all do to ensure that everyone has the same opportunities.  "
        },
        {
            "text": "Education can play an important role in helping to get more women into industries that are traditionally dominated by men. For example, a recent study found that women make up only 29.4% of the science, technology, engineering and maths (STEM) workforce in the UK. "
        },
        {
            "text": "A university degree is one way of gaining the skills you need for a career in STEM. An apprenticeship or T Levels can get you there too. Here we explain how we’re supporting women to gain a career in STEM.  "
        },
        {
            "heading": 3,
            "text": "What is STEM and why is it important? "
        },
        {
            "text": "STEM subjects fall under the umbrella of science, technology, engineering and maths. The number of jobs in STEM is increasing as technology continues to become part of our everyday lives. "
        },
        {
            "text": "Careers in STEM tend to offer higher wages but despite this around 43% of STEM job vacancies are hard to fill.  "
        },
        {
            "text": "It’s particularly important that more women access STEM education, as they are currently underrepresented in the sector. "
        },
        {
            "heading": 3,
            "text": "What are you doing to help get women into STEM careers? "
        },
        {
            "text": "We’ve seen some fantastic progress in recent years, with 35% more women and girls taking a STEM subject at A level since 2010. Between 2010 and 2021, the number of women accepted onto full-time undergraduate STEM courses rose by almost 50%. However, we know there’s still work to be done. "
        },
        {
            "text": "In schools, we’re boosting the take-up of STEM subjects by funding tailored maths sessions. We’re also investing £100 million in improving computing teaching, to increase the number of pupils taking computer science at GCSE and A level in schools.  "
        },
        {
            "text": "This is alongside research programmes to tackle gender imbalance in STEM subjects, including the Improving Gender Balance national research trial for physics and the Gender Balance in Computing Programme, led by the Raspberry Pi Foundation. "
        },
        {
            "text": "For girls and women aged 16 and older, we’ve also developed the Apprenticeships Diversity Champions Network. It offers practical advice on how to attract more women into STEM roles to employers in industries that have been historically dominated by men.  "
        },
        {
            "text": "In the first quarter of 2022/2023 we saw 13% more women starting STEM apprenticeships than the previous year. "
        },
        {
            "heading": 3,
            "text": "How can T Levels help get you a career in STEM? "
        },
        {
            "text": "T Levels are technical courses, normally taken after GCSEs and are equivalent to three A Levels. They’re a brilliant option for young people looking to combine study with a job placement, helping you gain valuable work experience and industry-specific training. There are lots of STEM T Level options available in subjects including science, engineering, construction, digital and manufacturing.  "
        },
        {
            "text": " Alexandra, pictured, chose to do a T Level in design, surveying and planning to give her the training she needed to work in the construction industry. For Alex, the opportunity to do a work placement was a big factor in her decision to study a T Level, allowing her to get real experience to make informed decisions about her future in the industry.  "
        },
        {
            "text": "Following her T Level, Alex was offered a degree apprenticeship in civil engineering.  "
        },
        {
            "text": "She said: “I did my placement with the Transpennine Route Upgrade (TRU) East alliance. Before my placement I hoped to gain experience in quantity surveying and civil engineering so that I could ultimately decide which route I wanted to go down.  "
        },
        {
            "text": "“But what I experienced was so much more than that. I was able to see all aspects of the project and I realised that I liked planning and civil engineering as well as quantity surveying.  "
        },
        {
            "text": "“I’ve completed my course, equipped with a qualification, but also real word experience and knowledge about the job opportunities in the construction and engineering sector.” "
        },
        {
            "heading": 3,
            "text": "How can an apprenticeship help you get a career in STEM? "
        },
        {
            "text": "An apprenticeship is a paid job where you benefit from structured training whilst gaining valuable workplace experience. There are hundreds of different types of apprenticeships, including many in STEM industries such as digital, manufacturing and engineering."
        },
        {
            "text": "For example, Tamzin, in the video above, studied for a degree apprenticeship in cyber security, which allowed her to gain a Bachelor of Science degree at the same time as working in the field and earning a salary.  "
        },
        {
            "text": "“A lot of people think that cyber security and STEM careers are male-dominated,” she said, “but I think it’s really important to look back through history, like the women at NASA who sent astronauts to the moon. "
        },
        {
            "text": "“People like me being here and amplifying my voice means that nowadays we’re seeing a lot more women and young girls in this industry. My ultimate goal is to become a Chief Technical Officer, one of the highest technical ranks.” "
        },
        {
            "heading": 3,
            "text": "Where can I find out more about T Levels and apprenticeships? "
        },
        {
            "text": "From T Levels in engineering or construction, to apprenticeships in tech and mechanics, there are so many opportunities for women looking to get into STEM careers.  "
        },
        {
            "text": "You can read more about how we’re investing in T Levels and how they can benefit you on this page.  "
        },
        {
            "text": "Take a look here for 5 reasons why you should consider an apprenticeship.  "
        },
        {
            "text": "You can also visit the Get the Jump page to find out more about the wide range of educational options available. "
        }
    ]
}