{
    "url": "https://aphascience.blog.gov.uk/2023/03/08/international-womens-day-the-benefits-of-creating-a-diverse-workforce-in-a-male-dominated-industry/",
    "title": "International Women’s Day: the benefits of creating a diverse workforce in a male-dominated industry",
    "authors": [
        "Gerry Kaspers"
    ],
    "categories": [
        "Events",
        "Science Capability in Animal Health Programme"
    ],
    "pub_date": "2023-03-08T14:00:30+00:00",
    "content": [
        {
            "text": "On this International Women’s Day 2023 with a theme of #embraceequity, we hear from Gerry Kaspers, Programme Director of the Science Capability in Animal Health (SCAH) programme, about why gender equity is so important in ensuring women have the same chance to succeed and thrive, particularly in the field of science, construction, and engineering."
        },
        {
            "text": "Improving diversity in construction is at the heart of the SCAH programme, a major government infrastructure project to create a world-leading centre of science at Defra’s Animal and Plant Health Agency (APHA) in Weybridge. The redevelopment of the UK’s primary capability for animal health science is critical in maintaining UK trade, providing emergency response to disease outbreaks and safeguarding animal health. The need for which has been brought into even sharper focus with the recent COVID-19 pandemic and current avian influenza outbreak in the UK and beyond."
        },
        {
            "text": "SCAH offers job opportunities for those working in construction, engineering and science and help to ensure the UK remains at the forefront of science, technology and innovation."
        },
        {
            "text": "Women represent only 15% of those employed in the construction industry, black and minority groups account for only 6% of employees and people with disabilities represent 6% of the workforce* so there is a great deal of work to be done in this space."
        },
        {
            "text": "I am particularly proud to support this year’s International Women’s Day 2023 as the focus is on why equal opportunities alone are not sufficient to address gender inequality, since women do not necessarily start from a level playing field. To truly foster belonging and inclusion we need to go further than giving equal opportunities – we need to take equitable action. So, what is the difference between equality and equity and why is this distinction so important?"
        },
        {
            "text": "Equality means individuals or groups of people are given the exact same opportunities or resources."
        },
        {
            "text": "Equity is about giving everyone exactly what they need to be successful, which may not be exactly the same."
        },
        {
            "text": "Equality is our goal and equity the means to achieve it."
        },
        {
            "text": "I lead SCAH’s Equality, Diversity and Inclusion Network which is committed to improving this position within our organisations and building a workforce which brings diversity of experiences, thought and innovation that reflects the communities we serve. Our aim in SCAH is to:"
        },
        {
            "text": "Women are well represented on the SCAH programme at senior level – including the Director of Capital, the Director of Science and Transformation and myself as Programme Director – and we want this to be reflected across the entire programme. We offer an agile working environment with shared parental leave, hybrid working, and flexible hours and we are building a culture that celebrates equality, diversity and inclusion."
        },
        {
            "text": "Mentoring is something I enjoy doing and I have benefited from some great mentors’ advice over my career. I am currently mentoring a female engineer in Zambia as part of a scheme run by the Association for Black and Minority Ethnic Engineers - how amazing it is that we can support equity across so many boundaries of countries, sectors and experiences! All through the power of digital too."
        },
        {
            "text": "To inspire the next generation, we are also introducing a Science, Technology, Engineering and Mathematics (STEM) ambassador programme on SCAH focusing on construction and engineering to complement the STEM activity currently undertaken by APHA scientists. Our ambassadors will be visiting schools and colleges to share their experience and the career opportunities available, particularly in the field of construction, engineering, technology and specialist biosafety."
        },
        {
            "text": "Not only do we want to attract the very best talent to deliver the programme, we want to give everyone an equitable opportunity to thrive and succeed. We have a great opportunity to impact change across our sector and there are direct benefits to our programme. We know that a diverse workforce, comprised of individuals with differing backgrounds and experiences, makes for a more productive culture and environment"
        },
        {
            "text": "* From COIB sector diversity data."
        },
        {
            "heading": 3,
            "text": "Subscribe to our science blog"
        },
        {
            "text": "Throughout the year, we publish blogs which highlight the breadth of scientific work we are involved in as well as sharing our latest news and events we have attended."
        },
        {
            "text": "Subscribing to our blog takes seconds and you will receive instant email alerts as soon as new blogs are published so why not subscribe today!"
        }
    ]
}