{
    "url": "https://insidedio.blog.gov.uk/2023/03/08/international-womens-day-embracing-equity/",
    "title": "International Women's Day - Embracing Equity",
    "authors": [
        "Nikki Halford"
    ],
    "categories": [
        "Inclusion",
        "Mental health",
        "Mentoring",
        "Wellbeing",
        "Working at DIO"
    ],
    "pub_date": "2023-03-08T10:13:50+00:00",
    "content": [
        {
            "text": "The importance of Equity in the workplace [MOD Crown Copyright 2023]Nikki Halford joined DIO in November as Head of the Transformation and Change team and it’s a role she is highly qualified for."
        },
        {
            "text": "Having started as a junior grade in the Civil Service 26-years ago, she has experienced change at all levels and held many varied and challenging roles. She also juggles a busy family life, looking after three children, Hannah, Thomas and Jake, and their dog, with her partner, Martin."
        },
        {
            "heading": 2,
            "text": "A journey of transformation"
        },
        {
            "text": "Today, for International Women’s Day (IWD), Nikki shares her personal journey of transformation and talks about what it means to #EmbraceEquity."
        },
        {
            "text": "I can recall the day I joined the Civil Service. I had married someone in the RAF and I was leaving my home in the North East of England and was moving 600-miles south without my family and friends support network being on the doorstep. I was now living in Service Families Accommodation, mixing with Service families, and someone mentioned that there was a work opportunity within the Civil Service at RAF Daws Hill, High Wycombe as a Contracts Officer."
        },
        {
            "text": "I started as a junior grade, Administrative Officer (AO), and four months into my new career, aged 22, I collapsed at work with an immense headache and was subsequently hospitalised for two weeks. That headache turned out to have been a haemorrhagic stroke."
        },
        {
            "text": "That was really a transforming moment for me. I was off work for six-months, but the support I received from my team and the Civil Service was amazing. I had a HR Case Worker assigned to me, Ann Pemberton, who explained everything that I needed to do and generally just looked after me from a pastoral perspective.  As I couldn’t drive, team members took me to and from work so I could keep in touch. I’d never worked anywhere that had looked after me like that before. Getting through that period of my life and regaining my health helped me to build resilience and from then on, I had a passion to make sure people around me were supported and looked after in their place of work."
        },
        {
            "heading": 2,
            "text": "Empowering people through mentoring"
        },
        {
            "text": "Mentoring is really important to me, particularly mentoring women. I also mentor ex-offenders, helping them adjust to moving back into society, helping with CVs, interviews etc. It’s very rewarding and I learn a lot about how people manage and deal with change.  It’s also a chance for me to share what I have learned and to give something back; I see this as part of my role in the workplace – to be of service to others. I’ve also learned that supporting individuals and empowering people is crucial for creating dynamic and healthy workplaces for all of us. As women, I believe, we have a vital role to play in this."
        },
        {
            "heading": 2,
            "text": "My dedication to challenging roles"
        },
        {
            "text": "I’ve deliberately chosen different and difficult roles in my career. Notably, I was the first, and only woman to date, to run the Joint Casualty and Compassionate Centre and the MOD’s Medal Office where I led a team of fantastically dedicated individuals who dealt with the deaths, from incident to burial, including repatriations of serving Armed Forces personnel, many of whom had died during the Afghanistan campaign. Within that role I also saw the very end of the role out of the late Queen’s Diamond Jubilee Medal, two new WWII medals (Bomber Command Clasp & Arctic Star) instituted culminating in a presentation by Prime Minister David Cameron to some of the remaining Veterans at 10 Downing Street."
        },
        {
            "text": "I also worked with the Home Office and Foreign, Commonwealth & Development Office to repatriate the holidaymakers who had been killed during a terrorist attack in Tunisia in 2015.  Balancing this job with family life would have been difficult had I not had the support of my partner Martin and our family, but given that we are a Military Family (RAF & Royal Navy) everyone understood the importance of the role and why I dedicated myself to it."
        },
        {
            "heading": 2,
            "text": "Building equity and accepting people for who they are"
        },
        {
            "text": "Covid has really helped people to understand the issues around childcare. How people are juggling life became very visible and the challenges were there for all to see. We saw families juggling work with home schooling and caring responsibilities and there was an authenticity to how people were showing up for work, that we didn’t see before. People were seeing you for who you were rather than a version of yourself, and I truly believe that we must ensure that this continues.  The more we invested in our people during that time elicited dedication and loyalty within the team and the organisation.  In my experience, I saw new friendships forged, a greater empathy emerged and a sense of humour reigned."
        },
        {
            "text": "We saw a different kind of teamwork and the importance of these true partnerships at home and at work, which I think has made changes for the better. It’s allowed us to be more empathetic with our leadership. The more comfortable we are in the workplace to be ourselves, the better it will be for all of us and that’s what this year’s theme for IWD is all about – building equity and accepting people for who they are."
        },
        {
            "text": "I’ve had some wonderful role models of different genders both in my work and home life. By showing who we are, women can change the way they are perceived in the workplace, as individuals, mothers, wives/partners, and we need openminded leaders around us to allow that."
        },
        {
            "text": "At DIO, we are lucky that we have policies and procedures in place that naturally allow us to embrace equity, and we know this is crucial for ensuring we are always moving towards better equality in the workplace. This isn’t just a nice to have, it’s essential. Equity means creating an inclusive world."
        },
        {
            "text": " "
        }
    ]
}