{
    "url": "https://marinescience.blog.gov.uk/2023/03/08/international-womens-day-2023-celebrating-our-international-female-colleagues/",
    "title": "International Women’s Day 2023 – celebrating our international female colleagues",
    "authors": [
        "fionavogt"
    ],
    "categories": [
        "Animal Health",
        "Aquaculture",
        "Climate Change",
        "International",
        "Science"
    ],
    "pub_date": "2023-03-08T08:45:51+00:00",
    "content": [
        {
            "text": "Cefas is marking International Women’s Day by inviting our female colleagues that we work with overseas on some of our international projects, to share their science and how we work together. We aim to celebrate the amazing work that is going on around the world by our incredible female colleagues working in Cefas and with partner organisations both in the UK and internationally on a variety of marine, aquatic and environmental sciences."
        },
        {
            "text": "The theme for International Women's Day 2023 is #EmbraceEquity. The aim of the #EmbraceEquity campaign theme is to get the world talking about why equal opportunities aren't enough. People start from different places, so true inclusion requires equitable action."
        },
        {
            "text": "International Wildlife Trade -shark trade in Indonesia"
        },
        {
            "text": "Monika Pinem, a shark trade inspector in Indonesia, has worked with Cefas’ Dr Joanna Murray through an Illegal Wildlife Trade Challenge Fund project “Building capacity to reduce illegal trade of shark products in Indonesia” for the last four years. Their collaborative project aimed to increase the capacity of trade regulators to detect illegally traded species of sharks and rays, in part through visual identification training of shark products (e.g. fins). Monika took part in a “train the trainer” workshop in Jakarta in January 2020 where she studied eight new modules on shark trade monitoring, and received visual ID training from world expert, Dr Rima Jabado."
        },
        {
            "text": "Monika tells us more about her work,"
        },
        {
            "text": "“Working as an Indonesian government inspector to verify trade in shark products is challenging because sharks and rays can look so alike. As well as full-body fish, we encounter many derivative products, like fins, oil, skin, and meat from a variety of species. High-accuracy identification can be obtained using DNA but due to the high-cost and high-large-frequency of trade in many provinces in Indonesia, visual identification is still the best method to monitor trade. However, visual identification is often based on personal judgments from practical experience. In 2020, Cefas through the Illegal Wildlife Trade Challenge Fund project assisted the Indonesian Government to equip inspectors with shark and ray product identification training and the development of training modules. Through this training, I learnt the science behind the identification process - how to observe, collect, and analyse the key distinguishing features of the species in the form of derivative products. First and foremost, we have to understand external morphology and the terminology for the full body, so that whenever we encounter unfamiliar characteristics in the products, we can use references that have been available to figure out from what species the product is made. The sustainability of shark and ray species depends on accurate identification as it is this data that will provide the basis for determining shark and ray management policies to realise sustainable use.”"
        },
        {
            "text": "Antimicrobial Resistance research collaboration with Nigerian colleagues"
        },
        {
            "text": "Dr Suliat Adeleke is a Veterinarian with the DVPCS (Department of Veterinary and Pest Control Services) under the FMARD (Federal Ministry of Agriculture and Rural Development), Nigeria. She is also Laboratory Aquaculture Antimicrobial Resistance (AMR) Fellow under the mentorship of Cefas through the Fleming Fund programme. Dr Adeleke has been working with Andy Joseph and others at Cefas, collaborating on Antimicrobial Resistance (AMR) research and training, as part of the UK’s UN FAO Reference Centre for AMR."
        },
        {
            "text": "Dr Adeleke explains her work here,"
        },
        {
            "text": "“The growing prevalence of AMR and its implication for food safety, humans, animals and the ecosystem have become a global concern. The aquaculture sector plays a major role in Nigeria’s economy which provides support to many people directly and indirectly, encompasses trading, processing, and farming. There are a number of challenges that threaten the sustainability of the aquaculture sector. A major issue that has hampered the development of the sector in Nigeria is the lack of information about the prevention, treatment, and control of fish infections which is further complicated by the lack of a diagnostic lab for fish diseases. During the course of my training, I carried out a gap analysis of the situation of Antimicrobial Use (AMU) and AMR in aquaculture in my home country. Several gaps were identified, and a work plan was developed based on the analysis. Through this training, it has helped to strengthen my capacity on Quality Management Systems, quality of AMR diagnostics, data interpretation and advanced methods in surveillance of AMU and  AMR. I was also allowed to explore my AMR curiosity with guidance enabling me to contribute in my own way to the scientific body of knowledge. As a female in science, it feels awesome presenting some of my research in conferences, workshops, etc."
        },
        {
            "text": "All humans, regardless of gender, should have equal opportunity and the International Women’s world day reminds us of the need to embrace equity. In science, the female gender suffers from inequality, and the Fleming Fund, through Cefas helps bridge that gap. I encourage all girls and women irrespective of age to make use of every scientific opportunity available to satisfy their scientific questions. Thank you Cefas for contributing to the growth of women in science and embracing equity.”"
        },
        {
            "text": "Aquaculture disease diagnostics in Bangladesh"
        },
        {
            "text": "Alif Layla Bablee, assistant professor at the Department of Aquaculture, Bangladesh Agricultural University (BAU), has been working with Chantelle Hooper, Morena Santi and others at Cefas, collaborating on aquatic animal disease diagnostics to support sustainable seafood production in Bangladesh as part of the Defra Blue Planet Ocean Country Partnership Programme."
        },
        {
            "text": "Alif Layla Bablee tells us more about her work,"
        },
        {
            "text": "“My research career began during my postgraduation with an experiment on \"Aquaponics\". Since then, I have focused on the issues of climate change, the effect of climate change on aquatic animals and food security. Recently I have completed a training program arranged by Cefas at their laboratory in Weymouth, UK. This training provided me with practical knowledge on the treatment of tissue samples, histopathology and in-situ hybridization for disease detection in aquatic animals.  It was a great opportunity for me as a novice researcher to meet many female scientists and researchers at Cefas. Currently, I'm working to improve the BAU laboratory facilities with the assistance of my fellow co-workers, as our lab infrastructure is not that advanced and I am also encouraging female students to pursue research careers. Indeed, Bangladesh offers a wide range of opportunities for scientific and fieldwork employment. Yet, due to several societal constraints and environmental issues, it can be rather challenging for women to operate at the fieldwork level. Despite that fact, there are more and more motivated female students. We are now working with a fresh sense of optimism to support female students and incorporate them in aquaculture research for the overall advancement of our nation.”"
        },
        {
            "text": "Marine Science in the South Pacific"
        },
        {
            "text": "We also work with fantastic women scientists in the South Pacific islands. Dr Michelle Devlin has worked with Dr Gilianne Brodie over a number of years under the Commonwealth Marine Economies programme (CME). Dr Brodie was a Senior Lecturer, then Associate Professor in the School of Biological & Chemical Sciences at the University of the South Pacific (USP). She became acting Head of the School and then Deputy Director of the Institute of Applied Sciences in 2020. She has been a part of the CME programme from the start, where she helped Cefas to identify and support two young, amazing Pacific students to complete their Masters on seagrass mapping, and modelling.  She was also a key contributor to the Climate Change report card in the Pacific (funded by UK CME programme), leading on the chapter that reported on Effects of Climate Change on Seagrasses and Seagrass Habitats Relevant to the Pacific Islands. She has led on two scientific papers in the recent Marine Pollution Bulletin Pacific Special Edition on Seagrasses and seagrass habitats in Pacific small island developing states  and co-authoring with Cefas scientists on a paper exploring Kiribati seagrass and water quality."
        },
        {
            "text": "Here, Dr Brodie explains how she has worked with Cefas and how that has supported women scientist in the South Pacific,"
        },
        {
            "text": "“Cefas has supported, from start-up to post graduation, seagrass research female postgraduate students from Fiji, Solomon Islands and Kiribati enrolled at the University of the South Pacific’s Laucala campus. The projects were all locally led and co-developed with Cefas scientists who always listened to what was needed to make research and career outcomes successful and provide workplace skills, making them highly employable or ready for promotion. It is significant that Cefas has a large number of female scientists in leadership roles as mentoring and role models for the female regional people supported.”"
        },
        {
            "text": "Many thanks to all our contributors to this blog and to all our many incredible female colleagues around the world for your collaborative research and inspiration."
        }
    ]
}