{
    "url": "https://lifeathmrc.blog.gov.uk/2023/03/08/international-womens-day-2023-equity-vs-equality/",
    "title": "International Women’s Day 2023: Equity V Equality",
    "authors": [
        "Hannah"
    ],
    "categories": [
        "Culture & Values",
        "General",
        "Guest blog",
        "Inclusion"
    ],
    "pub_date": "2023-03-08T09:27:59+00:00",
    "content": [
        {
            "text": "My name is Hannah and I currently work in HR as a People Impacting and Insight Lead. I have been very lucky to be part of many amazing teams at HMRC such as the Respect at Work Programme and the People Keyholder team. In my roles, I have been a real advocate for equality, diversity, and inclusion – which is a big passion of mine."
        },
        {
            "text": "I am also co-chair of the Liverpool Regional Women’s Network, which is an immensely fulfilling role that has allowed me to be part of colleague-led initiatives which have provided me with a source of mutual support, confidence, empowerment, and inspiration through networking with so many wonderful women across HMRC."
        },
        {
            "heading": 2,
            "text": "Equity V Equality and what it means to me  "
        },
        {
            "text": "Equity for me means having the right tools, support, and guidance to be able to strive and thrive. It's not about giving everyone the exact same thing because we are all different. Equity recognises that each person has different circumstances and needs and allocates the exact resources and opportunities that are unique to us.  Being a part of the Liverpool Women’s Network has allowed me to seek out development opportunities, attend wellbeing sessions and get involved in inclusive community events, which has enabled me to explore the different resources and opportunities specific to me and my journey."
        },
        {
            "text": "As part of the Women’s Network, I have found there are lots of initiatives happening across HMRC to help forge inclusive work cultures where women's careers thrive regardless of their background and specific needs. I have also been lucky enough to attend lots of development programmes thanks to HMRC such as the STRIDE social mobility programme, Women into Leadership, mentoring through the Girls Network and dedicated support sessions to overcome things like imposter syndrome, anxiety, and leadership barriers."
        },
        {
            "heading": 2,
            "text": "What else is on offer in HMRC to drive forward equity?"
        },
        {
            "text": "I find that there are so many support networks and communities within HMRC for women when it comes to wellbeing, mental health, caring and parental responsibilities, menopause, fertility, and so much more. No matter what you’re experiencing, the networks and support groups do exist, even if you are not sure it’s right for you, our lived experiences are what joins us together as individuals and our stories and backgrounds connect us. "
        },
        {
            "heading": 2,
            "text": "Working for HMRC as a woman "
        },
        {
            "text": "I’m so pleased that HMRC champions and supports not only International Women’s Day but women every day. We see so much representation from our Executive Committee community and senior leaders, who continue to champion the importance of diversity and inclusion, while promoting opportunities for individuals no matter what their background is. Our gender champion, Esther Wallington, passionately supports the vision for women progressing into senior roles at HMRC and we see regular support from Angela MacDonald, who acts as champion and advocate for menopause support. It makes a big difference seeing our senior leaders being courageous, visible, and open about some of the barriers women face and how as an organisation we continue to tackle those barriers. "
        },
        {
            "text": "Finally, I have met a wide range of women at HMRC, who come from different backgrounds, many who are role models to me. There are multiple opportunities to network across this organisation and you can find or be an inspiration to other women regardless of age, grade, and backgrounds. HMRC really is a great place to work, and for me that is mostly down to the people, opportunities and support that is on offer. "
        }
    ]
}