{
    "url": "https://socialworkwithadults.blog.gov.uk/2023/03/08/international-womens-day-a-message-from-lyn-romeo/",
    "title": "International Women's Day: a message from Lyn Romeo",
    "authors": [
        "Lyn Romeo"
    ],
    "categories": [
        "Communities",
        "Events",
        "Our profession",
        "Society"
    ],
    "pub_date": "2023-03-08T08:12:33+00:00",
    "content": [
        {
            "heading": 2,
            "text": "#EmbraceEquity"
        },
        {
            "text": "Today, across the world, people are celebrating International Women’s Day. This year, there is an emphasis on inclusivity, diversity and parity of esteem."
        },
        {
            "text": "In social care and social work, helping to contribute to women's equity has never been more important – over 80 percent of the paid workforce is female and many who undertake the primary care giving for family and friends are women."
        },
        {
            "text": "The majority of older people drawing on care and support are women, so making a positive difference in recognising and celebrating women’s contributions and achievements and increasing visibility is key."
        },
        {
            "text": "Supporting the empowerment of women who are social care workers and those with care and support needs, goes hand in hand."
        },
        {
            "heading": 2,
            "text": "Fairness and opportunity"
        },
        {
            "text": "For employers, valuing and supporting the workforce means creating rewarding and meaningful work, alongside appropriate pay and benefits. This undoubtedly contributes to achieving equity."
        },
        {
            "text": "For those of us who draw on care and support, being deeply listened to and helped to make positive life choices is the relentless ambition of social care. Meanwhile, unpaid carers, many of them women, are often taken for granted. Without them, we simply wouldn’t be able to support people to live independently within their communities."
        },
        {
            "text": "A society which values and recognises each and every one of us is the vision for a better world. I hope all of you take the opportunity to celebrate the women in your lives and perhaps one day we won’t need an International Women’s Day, as genuine equality – and equity - will have been achieved.  #EmbraceEquity"
        }
    ]
}