{
    "url": "https://environmentagency.blog.gov.uk/2023/03/08/more-women-are-taking-on-manual-roles-in-the-environment-agency/",
    "title": "More women are taking on manual roles in the Environment Agency",
    "authors": [
        "defrablogs"
    ],
    "categories": [
        "Environment Agency"
    ],
    "pub_date": "2023-03-08T09:00:25+00:00",
    "content": [
        {
            "text": "Vicky and Maggie are the only women in the East Hampshire Field Team, a team that is on-the-ground doing manual work to protect communities from flooding. They tell us what it’s like working in a predominantly male team."
        },
        {
            "text": "Our jobs are mostly outside doing practical work. We help reduce flooding by clearing debris from rivers, removing fallen trees and maintaining mechanical structures. Members of the public often come and talk to us about what we’re doing, especially other women. We think they find it easier to approach us than our male colleagues.     "
        },
        {
            "text": "We’re proud to be women doing a physically demanding jobs and making a difference to the environment.   "
        },
        {
            "text": "These roles have been intentional career changes for us within the last few years. We wanted to be outside doing something that benefits people and the environment. Previously one of us worked in a supermarket and the other worked for a taxi company.        "
        },
        {
            "text": "We’ve already learnt so much, including laying new hedges and confidently using chainsaws. We’ve also brought additional skills to the team such as good communication and organisation.   "
        },
        {
            "text": "We love being out and about, seeing the seasons change and working with nature. We’d encourage more women to think about a role like this. It’s really rewarding and great fun at the same time.  "
        },
        {
            "text": "Alongside our day jobs, we’re doing water environment worker level 3 apprenticeship. This gives us new qualifications, training and skills including flood management and habitat management.   "
        },
        {
            "text": "Georgia is one of only 7 female lock keepers on the non-tidal Thames.   "
        },
        {
            "text": "I am a Resident Lock & Weir Keeper on the River Thames. You’ll usually find me packing and assisting boats through the lock, but I also manage the water levels and maintain the entire site. I’ve been resident here for 2 years, but have been a lock keeper for the last 5 and lived on a lock site from when I was born – my father has been a lock keeper for more years than I have been alive!    "
        },
        {
            "text": "Traditionally, lock keeping has been a male-dominated role. Although it’s a recently increasing number, I am one of only 7 female Resident Lock & Weir Keepers out of 45 on the non-tidal Thames.      "
        },
        {
            "text": "Whilst being a woman doesn’t and shouldn’t directly affect my role, there’s always a minority who still carry stereotypes when it comes to our lock keepers. Often, I am overlooked, and it is presumed that (despite the full uniform – lifejacket, epaulettes and all!) one of my male volunteers is the lock keeper; thankfully they turn them back in the right direction!   "
        },
        {
            "text": "I meet many lovely people out and about performing my duties but unfortunately, compared with my male counterparts, I also tend to experience a higher count of negative interactions from a few; whether that be obscenities, unwillingness to cooperate, sexist remarks or inappropriate comments made toward me. I definitely have a higher rate of lock-side marriage proposals! It can be disheartening, and difficult, when faced with these situations, particularly with uncooperative or even hostile individuals, but I fully believe in challenging these antiquated behaviours.  If we continue to challenge these attitudes, even from friends and colleagues, we will we be able to eradicate them.  "
        },
        {
            "text": "Fortunately I am really privileged to be in a role where diversity is encouraged and celebrated, and to have a fantastic support network within my team. It makes my job so much better and I’m better at it because of that. "
        },
        {
            "text": "Speak up. Band together. Build each other up. Support each other. As Annie Lennox once said “When women get together as a group, it’s immensely powerful.” "
        },
        {
            "text": "Follow the East Hampshire field team on Twitter @johnoflynnEA"
        }
    ]
}