{
    "url": "https://nda.blog.gov.uk/nws-celebrates-gender-inclusivity-on-iwd/",
    "title": "NWS celebrates gender inclusivity on IWD",
    "authors": [
        "Tracy Badham – Social Responsibility Manager at NWS"
    ],
    "categories": [
        "Skills",
        "Waste management"
    ],
    "pub_date": "2023-03-08T11:34:08+00:00",
    "content": [
        {
            "text": "Last year, 44% of the Nuclear Decommissioning Authority (NDA) group's nuclear graduate programme intake and 30% of apprentices across all companies were women. Statistics like these are fantastic and give me so much pride to be working in a dynamic and progressive organisation when it comes to gender equality."
        },
        {
            "text": "On International Women’s Day we can take a moment to reflect on the actions the nuclear industry has taken over recent years to make the sector more inclusive, and the steps NWS has taken to create change."
        },
        {
            "text": "At a time when the nuclear industry is becoming more and more imperative to the UK’s energy mix, we’re seeing more young women interested in joining this innovative and dynamic industry. It’s part of why I love working here."
        },
        {
            "text": "At Nuclear Waste Services (NWS) 40% of our executive team and board members women. And, nearly half of our NWS staff are female with many operating at a nuclear licenced sites. I believe the sector has changed quite a lot over the last 20 years, and I think we have many more role models to help encourage young girls and women into the nuclear sector."
        },
        {
            "text": "Our apprenticeship programmes are a great way for young women to get to grips with the industry and see what we have to offer. If you’re interested I’d"
        },
        {
            "text": "encourage you to not just take my word for it get involved and come and see for yourself! In the last few years the cohort on our apprenticeship programmes have seen a much greater female balance. Some of these placements are on nuclear licensed sites and the young women on these programmes are doing a phenomenal job and enjoying themselves. Isn’t that what it’s about when you’re young and new into your career?"
        },
        {
            "text": "Change doesn’t happen without action, and we are acting now to ensure we are inclusive across the board, this includes women of all ages and at different stages in life. It is about bringing initiatives in and being more agile with the way we operate."
        },
        {
            "text": "Not only are we engaging with girls and women at school and university, but we are also making the workplace more agile and flexible and encouraging and supporting female staff into leadership programmes. In the last two years we’ve had four women feature in the Northern Power Women Power List, that shows you the value we place on our female staff and the inspiring talent we already have."
        },
        {
            "text": "We are also part of the NDA group who have recently announced a corporate membership scheme with Women in Nuclear UK (WiN UK) which works to address the industry’s gender balance by improving the representation of women in leadership. It unlocks amazing opportunities to help women progress in the workplace and we’re really excited to see what kind of opportunities lie ahead."
        },
        {
            "text": "In the coming years we have plans to employ thousands of new employees in this sector, so we need to be open for business to every single person to gain the skills we need to deliver across the whole nuclear industry."
        },
        {
            "text": "We want a diverse range of people coming in with different ideas and experiences.  By managing the UK’s radioactive waste we are doing work of huge impact, and value, and we can see that this is really attractive to a young and up and coming workforce. It’s a great sector to be part of but we must continue to attract the right talent, including young women."
        },
        {
            "text": "Take it from me the sector is just brilliant and offers such a wealth of varied experiences. Why would you want to go anywhere else?"
        },
        {
            "text": "Find out more about working for NWS."
        }
    ]
}