{
    "url": "https://actuaries.blog.gov.uk/2023/03/08/saving-for-your-future/",
    "title": "Saving for your future",
    "authors": [
        "Christophor Ward - Actuary"
    ],
    "categories": [
        "Actuary",
        "Investment",
        "Pensions"
    ],
    "pub_date": "2023-03-08T11:30:21+00:00",
    "content": [
        {
            "text": "The Government Actuary’s Department (GAD) can trace its history through its work on pensions, health care and social security."
        },
        {
            "text": "An important part of that work, which still stands today, is advising government in respect of pensions to workers in the public sector."
        },
        {
            "text": "Public sector pensions are typically what are known as defined benefit. That is, employees earn a set amount of pension based on each year of service with their employer, and their pay during that employment."
        },
        {
            "text": "There are lots of details associated with defined benefit pensions, and actuaries have an important role in helping employers and policymakers understand these details."
        },
        {
            "text": "GAD’s breadth of work also includes insurance, other forms of pensions and savings, and several other topics that use core actuarial techniques to understand financial risk."
        },
        {
            "text": "A growing part of GAD’s work is in respect of defined contribution pensions, reflecting the increasing role these pensions are playing in the UK. In 2019 occupational defined contribution pensions overtook defined benefit as the most prevalent type of pension, by proportion of employees, for workplace pensions."
        },
        {
            "text": "This increase in occupational as well as other types of defined contribution pensions has been accelerated by the requirement for all employers to provide a workplace pension scheme and the attractive features for employers of providing a defined contribution benefit."
        },
        {
            "heading": 2,
            "text": "What is a defined contribution pension?"
        },
        {
            "text": "A defined contribution pension usually has a fixed level of contributions, as a percentage of salary, with an employer contribution and often an employee contribution too."
        },
        {
            "text": "Those contributions are invested with the aim of growing those savings such that when a member retires, they can then access those savings."
        },
        {
            "text": "The standard approach at retirement used to be to take some cash from a pension savings pot and then use the rest to buy a guaranteed income, known as an annuity."
        },
        {
            "text": "More recently, it has become possible for members to use their defined contribution savings more flexibly. For example, it is possible to withdraw all or part of a pension as cash. Members can also keep their pension invested into their retirement, and keep the option to buy an annuity, either at or after retirement."
        },
        {
            "heading": 2,
            "text": "Pensions innovation"
        },
        {
            "text": "With defined contributions pensions set to grow significantly, there is increased focus and demand for innovation. This is a broad area and actuaries can be found in all of the key stakeholder groups that include:"
        },
        {
            "text": "… to name but a few."
        },
        {
            "heading": 2,
            "text": "Future benefits"
        },
        {
            "text": "Actuaries are at the forefront of this innovation, using analysis to understand the nature of possible benefits that can become available in the future. Actuaries also examine the risk surrounding such benefits and how that influences decisions that are made today."
        },
        {
            "text": "This will call on the skills of pensions actuaries and those actuaries practising in investment and insurance. This is a great opportunity to shape the future and it is likely that most of these actuaries will now also be accruing their own defined contribution pension!"
        },
        {
            "text": "An example of GAD’s recent involvement with this innovation has been our work with the Department for Work and Pensions (DWP), The Pensions Regulator (TPR) and the Financial Conduct Authority (FCA) on their current consultation – ‘Value for Money: A framework on metrics, standards, and disclosures.’"
        },
        {
            "text": "We have helped DWP, TPR, and the FCA to consider the possibility of the inclusion of forward-looking measures of investment performance and risk in the VFM framework."
        },
        {
            "text": "The aim is to help trustees and Independent Governance Committees of defined contribution schemes to consider how their pension may perform in future and make informed decisions. For example, considering how performance might vary enables them to compare their scheme with others."
        },
        {
            "text": "Ultimately this is set to improve decision making on pension provision and lead to improved fairness for members who may be employed by different companies and in different pension schemes but will aspire to a financially secure retirement."
        },
        {
            "heading": 2,
            "text": "Improving retirements"
        },
        {
            "text": "This is an exciting opportunity to provide a forward-looking investment performance metric which balances robustness, ease of understanding and consistency."
        },
        {
            "text": "As you might expect, early scoping work has identified several challenges and views of stakeholders will be welcomed to help inform the nature of future pensions savings and ultimately improve the retirements of scheme members."
        },
        {
            "text": "To have your say on this and other important areas of pensions, see the latest policy papers and consultations from the DWP."
        }
    ]
}